; ModuleID = 'molio.ll'
source_filename = "molio.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mat", scope: !2, file: !3, line: 164, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "getmatrix", scope: !3, file: !3, line: 159, type: !4, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !259)
!3 = !DIFile(filename: "molio.c", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX_T", file: !8, line: 14, baseType: !9)
!8 = !DIFile(filename: "./nabtypes.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !11)
!10 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!11 = !{!12, !12}
!12 = !DISubrange(count: 4)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !16, retainedTypes: !33, globals: !253, splitDebugInlining: false, nameTableKind: None)
!16 = !{!17}
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 46, baseType: !19, size: 32, elements: !20)
!18 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!21 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!22 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!23 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!33 = !{!34, !35, !37, !36, !13, !245, !246}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !8, line: 82, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !8, line: 63, size: 1024, elements: !41)
!41 = !{!42, !44, !46, !47, !48, !51, !52, !53, !54, !55, !188, !198, !199, !205, !206, !215, !216, !217}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !40, file: !8, line: 64, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !40, file: !8, line: 65, baseType: !45, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !8, line: 6, baseType: !36)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !40, file: !8, line: 66, baseType: !45, size: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !40, file: !8, line: 67, baseType: !45, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !40, file: !8, line: 68, baseType: !49, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !8, line: 17, baseType: !14)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !40, file: !8, line: 69, baseType: !49, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !40, file: !8, line: 70, baseType: !45, size: 32, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !40, file: !8, line: 71, baseType: !45, size: 32, offset: 352)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !40, file: !8, line: 72, baseType: !45, size: 32, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !40, file: !8, line: 73, baseType: !56, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !8, line: 84, size: 384, elements: !58)
!58 = !{!59, !60, !61, !62, !184, !185, !186, !187}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !57, file: !8, line: 85, baseType: !49, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !57, file: !8, line: 86, baseType: !45, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !57, file: !8, line: 87, baseType: !45, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !57, file: !8, line: 88, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !8, line: 118, size: 1088, elements: !65)
!65 = !{!66, !71, !72, !75, !76, !77, !78}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !64, file: !8, line: 119, baseType: !67, size: 768)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !8, line: 13, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 768, elements: !69)
!69 = !{!12, !70}
!70 = !DISubrange(count: 3)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !64, file: !8, line: 120, baseType: !45, size: 32, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !64, file: !8, line: 121, baseType: !73, size: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !8, line: 93, baseType: !57)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !64, file: !8, line: 122, baseType: !45, size: 32, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !64, file: !8, line: 123, baseType: !45, size: 32, offset: 928)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !64, file: !8, line: 124, baseType: !45, size: 32, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !64, file: !8, line: 125, baseType: !79, size: 64, offset: 1024)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !8, line: 115, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !8, line: 95, size: 5760, elements: !82)
!82 = !{!83, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !143, !144, !145, !146, !147, !148, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !81, file: !8, line: 96, baseType: !84, size: 648)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 648, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 81)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !81, file: !8, line: 97, baseType: !45, size: 32, offset: 672)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !81, file: !8, line: 97, baseType: !45, size: 32, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !81, file: !8, line: 97, baseType: !45, size: 32, offset: 736)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !81, file: !8, line: 98, baseType: !45, size: 32, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !81, file: !8, line: 98, baseType: !45, size: 32, offset: 800)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !81, file: !8, line: 98, baseType: !45, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !81, file: !8, line: 98, baseType: !45, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !81, file: !8, line: 98, baseType: !45, size: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !81, file: !8, line: 98, baseType: !45, size: 32, offset: 928)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !81, file: !8, line: 99, baseType: !45, size: 32, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !81, file: !8, line: 99, baseType: !45, size: 32, offset: 992)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !81, file: !8, line: 99, baseType: !45, size: 32, offset: 1024)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !81, file: !8, line: 99, baseType: !45, size: 32, offset: 1056)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !81, file: !8, line: 99, baseType: !45, size: 32, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !81, file: !8, line: 99, baseType: !45, size: 32, offset: 1120)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !81, file: !8, line: 100, baseType: !45, size: 32, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !81, file: !8, line: 100, baseType: !45, size: 32, offset: 1184)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !81, file: !8, line: 100, baseType: !45, size: 32, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !81, file: !8, line: 100, baseType: !45, size: 32, offset: 1248)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !81, file: !8, line: 100, baseType: !45, size: 32, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !81, file: !8, line: 100, baseType: !45, size: 32, offset: 1312)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !81, file: !8, line: 101, baseType: !45, size: 32, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !81, file: !8, line: 101, baseType: !45, size: 32, offset: 1376)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !81, file: !8, line: 101, baseType: !45, size: 32, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !81, file: !8, line: 101, baseType: !45, size: 32, offset: 1440)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !81, file: !8, line: 101, baseType: !45, size: 32, offset: 1472)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !81, file: !8, line: 101, baseType: !45, size: 32, offset: 1504)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !81, file: !8, line: 101, baseType: !45, size: 32, offset: 1536)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !81, file: !8, line: 101, baseType: !45, size: 32, offset: 1568)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !81, file: !8, line: 102, baseType: !45, size: 32, offset: 1600)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !81, file: !8, line: 102, baseType: !45, size: 32, offset: 1632)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !81, file: !8, line: 102, baseType: !45, size: 32, offset: 1664)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !81, file: !8, line: 103, baseType: !49, size: 64, offset: 1728)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !81, file: !8, line: 103, baseType: !49, size: 64, offset: 1792)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !81, file: !8, line: 103, baseType: !49, size: 64, offset: 1856)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !81, file: !8, line: 103, baseType: !49, size: 64, offset: 1920)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !81, file: !8, line: 104, baseType: !124, size: 64, offset: 1984)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !81, file: !8, line: 104, baseType: !124, size: 64, offset: 2048)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !81, file: !8, line: 104, baseType: !124, size: 64, offset: 2112)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !81, file: !8, line: 104, baseType: !124, size: 64, offset: 2176)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !81, file: !8, line: 104, baseType: !124, size: 64, offset: 2240)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !81, file: !8, line: 104, baseType: !124, size: 64, offset: 2304)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !81, file: !8, line: 104, baseType: !124, size: 64, offset: 2368)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !81, file: !8, line: 104, baseType: !124, size: 64, offset: 2432)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !81, file: !8, line: 104, baseType: !124, size: 64, offset: 2496)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !81, file: !8, line: 105, baseType: !124, size: 64, offset: 2560)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !81, file: !8, line: 105, baseType: !124, size: 64, offset: 2624)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !81, file: !8, line: 105, baseType: !124, size: 64, offset: 2688)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !81, file: !8, line: 105, baseType: !124, size: 64, offset: 2752)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !81, file: !8, line: 105, baseType: !124, size: 64, offset: 2816)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !81, file: !8, line: 105, baseType: !124, size: 64, offset: 2880)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !81, file: !8, line: 105, baseType: !124, size: 64, offset: 2944)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !81, file: !8, line: 106, baseType: !141, size: 192, offset: 3008)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !142)
!142 = !{!70}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !81, file: !8, line: 106, baseType: !10, size: 64, offset: 3200)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !81, file: !8, line: 106, baseType: !10, size: 64, offset: 3264)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !81, file: !8, line: 106, baseType: !10, size: 64, offset: 3328)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !81, file: !8, line: 106, baseType: !10, size: 64, offset: 3392)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !81, file: !8, line: 106, baseType: !10, size: 64, offset: 3456)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !81, file: !8, line: 107, baseType: !149, size: 64, offset: 3520)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !81, file: !8, line: 107, baseType: !149, size: 64, offset: 3584)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !81, file: !8, line: 107, baseType: !149, size: 64, offset: 3648)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !81, file: !8, line: 107, baseType: !149, size: 64, offset: 3712)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !81, file: !8, line: 107, baseType: !149, size: 64, offset: 3776)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !81, file: !8, line: 107, baseType: !149, size: 64, offset: 3840)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !81, file: !8, line: 108, baseType: !149, size: 64, offset: 3904)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !81, file: !8, line: 108, baseType: !149, size: 64, offset: 3968)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !81, file: !8, line: 108, baseType: !149, size: 64, offset: 4032)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !81, file: !8, line: 108, baseType: !149, size: 64, offset: 4096)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !81, file: !8, line: 108, baseType: !149, size: 64, offset: 4160)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !81, file: !8, line: 108, baseType: !149, size: 64, offset: 4224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !81, file: !8, line: 109, baseType: !149, size: 64, offset: 4288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !81, file: !8, line: 109, baseType: !149, size: 64, offset: 4352)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !81, file: !8, line: 109, baseType: !149, size: 64, offset: 4416)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !81, file: !8, line: 109, baseType: !149, size: 64, offset: 4480)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !81, file: !8, line: 109, baseType: !149, size: 64, offset: 4544)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !81, file: !8, line: 110, baseType: !149, size: 64, offset: 4608)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !81, file: !8, line: 110, baseType: !149, size: 64, offset: 4672)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !81, file: !8, line: 110, baseType: !149, size: 64, offset: 4736)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !81, file: !8, line: 110, baseType: !149, size: 64, offset: 4800)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !81, file: !8, line: 110, baseType: !149, size: 64, offset: 4864)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !81, file: !8, line: 111, baseType: !149, size: 64, offset: 4928)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !81, file: !8, line: 111, baseType: !149, size: 64, offset: 4992)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !81, file: !8, line: 111, baseType: !149, size: 64, offset: 5056)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !81, file: !8, line: 111, baseType: !149, size: 64, offset: 5120)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !81, file: !8, line: 111, baseType: !149, size: 64, offset: 5184)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !81, file: !8, line: 111, baseType: !149, size: 64, offset: 5248)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !81, file: !8, line: 112, baseType: !149, size: 64, offset: 5312)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !81, file: !8, line: 112, baseType: !149, size: 64, offset: 5376)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !81, file: !8, line: 112, baseType: !149, size: 64, offset: 5440)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !81, file: !8, line: 112, baseType: !149, size: 64, offset: 5504)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !81, file: !8, line: 113, baseType: !149, size: 64, offset: 5568)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !81, file: !8, line: 113, baseType: !149, size: 64, offset: 5632)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !81, file: !8, line: 114, baseType: !124, size: 64, offset: 5696)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !57, file: !8, line: 89, baseType: !56, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !57, file: !8, line: 90, baseType: !45, size: 32, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !57, file: !8, line: 91, baseType: !45, size: 32, offset: 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !57, file: !8, line: 92, baseType: !37, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !40, file: !8, line: 74, baseType: !189, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !8, line: 52, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !8, line: 47, size: 192, elements: !192)
!192 = !{!193, !195, !196, !197}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !191, file: !8, line: 48, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !191, file: !8, line: 49, baseType: !45, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !191, file: !8, line: 50, baseType: !45, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !191, file: !8, line: 51, baseType: !45, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !40, file: !8, line: 75, baseType: !45, size: 32, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !40, file: !8, line: 76, baseType: !200, size: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !8, line: 54, baseType: !202)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !40, file: !8, line: 77, baseType: !45, size: 32, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !40, file: !8, line: 78, baseType: !207, size: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !8, line: 61, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !8, line: 58, size: 192, elements: !210)
!210 = !{!211, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !209, file: !8, line: 59, baseType: !212, size: 128)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !213)
!213 = !{!12}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !209, file: !8, line: 60, baseType: !10, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !40, file: !8, line: 79, baseType: !45, size: 32, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !40, file: !8, line: 80, baseType: !149, size: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !40, file: !8, line: 81, baseType: !218, size: 64, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !8, line: 45, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !8, line: 25, size: 1408, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !244}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !220, file: !8, line: 26, baseType: !49, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !220, file: !8, line: 27, baseType: !49, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !220, file: !8, line: 28, baseType: !45, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !220, file: !8, line: 29, baseType: !45, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !220, file: !8, line: 30, baseType: !227, size: 256, offset: 192)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 256, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 8)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !220, file: !8, line: 31, baseType: !43, size: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !220, file: !8, line: 32, baseType: !10, size: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !220, file: !8, line: 33, baseType: !10, size: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !220, file: !8, line: 34, baseType: !10, size: 64, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !220, file: !8, line: 35, baseType: !10, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !220, file: !8, line: 36, baseType: !49, size: 64, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !220, file: !8, line: 37, baseType: !45, size: 32, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !220, file: !8, line: 38, baseType: !10, size: 64, offset: 896)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !220, file: !8, line: 39, baseType: !10, size: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !220, file: !8, line: 40, baseType: !45, size: 32, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !220, file: !8, line: 41, baseType: !45, size: 32, offset: 1056)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !220, file: !8, line: 42, baseType: !49, size: 64, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !220, file: !8, line: 43, baseType: !243, size: 192, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !8, line: 12, baseType: !141)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !220, file: !8, line: 44, baseType: !10, size: 64, offset: 1344)
!245 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "CID_T", file: !3, line: 62, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cid_t", file: !3, line: 58, size: 128, elements: !249)
!249 = !{!250, !251, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !248, file: !3, line: 59, baseType: !36, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "c_last", scope: !248, file: !3, line: 60, baseType: !36, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "c_cids", scope: !248, file: !3, line: 61, baseType: !13, size: 64, offset: 64)
!253 = !{!0, !254, !260, !262, !264}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "init", scope: !256, file: !3, line: 774, type: !36, isLocal: true, isDefinition: true)
!256 = distinct !DISubprogram(name: "init_atab", scope: !3, file: !3, line: 772, type: !257, scopeLine: 773, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15, retainedNodes: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{null}
!259 = !{}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "n_atab", scope: !15, file: !3, line: 70, type: !36, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "res", scope: !15, file: !3, line: 75, type: !39, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "atab", scope: !15, file: !3, line: 69, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 1408000, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 1000)
!269 = !{i32 7, !"Dwarf Version", i32 4}
!270 = !{i32 2, !"Debug Info Version", i32 3}
!271 = !{i32 1, !"wchar_size", i32 4}
!272 = !{!"clang version 10.0.0-4ubuntu1 "}
!273 = distinct !DISubprogram(name: "getpdb", scope: !3, file: !3, line: 121, type: !274, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !259)
!274 = !DISubroutineType(types: !275)
!275 = !{!276, !13, !13}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !8, line: 126, baseType: !64)
!278 = !DILocalVariable(name: "fname", arg: 1, scope: !273, file: !3, line: 121, type: !13)
!279 = !DILocation(line: 121, column: 26, scope: !273)
!280 = !DILocalVariable(name: "options", arg: 2, scope: !273, file: !3, line: 121, type: !13)
!281 = !DILocation(line: 121, column: 39, scope: !273)
!282 = !DILocalVariable(name: "fp", scope: !273, file: !3, line: 123, type: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !285, line: 7, baseType: !286)
!285 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !287, line: 49, size: 1728, elements: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !304, !306, !307, !308, !312, !313, !315, !319, !322, !324, !327, !330, !331, !332, !336, !337}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !286, file: !287, line: 51, baseType: !36, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !286, file: !287, line: 54, baseType: !13, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !286, file: !287, line: 55, baseType: !13, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !286, file: !287, line: 56, baseType: !13, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !286, file: !287, line: 57, baseType: !13, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !286, file: !287, line: 58, baseType: !13, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !286, file: !287, line: 59, baseType: !13, size: 64, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !286, file: !287, line: 60, baseType: !13, size: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !286, file: !287, line: 61, baseType: !13, size: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !286, file: !287, line: 64, baseType: !13, size: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !286, file: !287, line: 65, baseType: !13, size: 64, offset: 640)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !286, file: !287, line: 66, baseType: !13, size: 64, offset: 704)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !286, file: !287, line: 68, baseType: !302, size: 64, offset: 768)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !287, line: 36, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !286, file: !287, line: 70, baseType: !305, size: 64, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !286, file: !287, line: 72, baseType: !36, size: 32, offset: 896)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !286, file: !287, line: 73, baseType: !36, size: 32, offset: 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !286, file: !287, line: 74, baseType: !309, size: 64, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !310, line: 152, baseType: !311)
!310 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!311 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !286, file: !287, line: 77, baseType: !245, size: 16, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !286, file: !287, line: 78, baseType: !314, size: 8, offset: 1040)
!314 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !286, file: !287, line: 79, baseType: !316, size: 8, offset: 1048)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 1)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !286, file: !287, line: 81, baseType: !320, size: 64, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !287, line: 43, baseType: null)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !286, file: !287, line: 89, baseType: !323, size: 64, offset: 1152)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !310, line: 153, baseType: !311)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !286, file: !287, line: 91, baseType: !325, size: 64, offset: 1216)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !287, line: 37, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !286, file: !287, line: 92, baseType: !328, size: 64, offset: 1280)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !287, line: 38, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !286, file: !287, line: 93, baseType: !305, size: 64, offset: 1344)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !286, file: !287, line: 94, baseType: !34, size: 64, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !286, file: !287, line: 95, baseType: !333, size: 64, offset: 1472)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !334, line: 46, baseType: !335)
!334 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!335 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !286, file: !287, line: 96, baseType: !36, size: 32, offset: 1536)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !286, file: !287, line: 98, baseType: !338, size: 160, offset: 1568)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 20)
!341 = !DILocation(line: 123, column: 11, scope: !273)
!342 = !DILocalVariable(name: "mol", scope: !273, file: !3, line: 124, type: !276)
!343 = !DILocation(line: 124, column: 17, scope: !273)
!344 = !DILocalVariable(name: "ier", scope: !273, file: !3, line: 125, type: !36)
!345 = !DILocation(line: 125, column: 9, scope: !273)
!346 = !DILocation(line: 127, column: 10, scope: !347)
!347 = distinct !DILexicalBlock(scope: !273, file: !3, line: 127, column: 9)
!348 = !DILocation(line: 127, column: 16, scope: !347)
!349 = !DILocation(line: 127, column: 21, scope: !347)
!350 = !DILocation(line: 127, column: 20, scope: !347)
!351 = !DILocation(line: 127, column: 9, scope: !273)
!352 = !DILocation(line: 128, column: 14, scope: !353)
!353 = distinct !DILexicalBlock(scope: !347, file: !3, line: 127, column: 28)
!354 = !DILocation(line: 128, column: 12, scope: !353)
!355 = !DILocation(line: 129, column: 5, scope: !353)
!356 = !DILocation(line: 129, column: 24, scope: !357)
!357 = distinct !DILexicalBlock(scope: !347, file: !3, line: 129, column: 16)
!358 = !DILocation(line: 129, column: 17, scope: !357)
!359 = !DILocation(line: 129, column: 16, scope: !347)
!360 = !DILocation(line: 130, column: 14, scope: !361)
!361 = distinct !DILexicalBlock(scope: !357, file: !3, line: 129, column: 37)
!362 = !DILocation(line: 130, column: 12, scope: !361)
!363 = !DILocation(line: 131, column: 5, scope: !361)
!364 = !DILocation(line: 132, column: 13, scope: !365)
!365 = distinct !DILexicalBlock(scope: !357, file: !3, line: 131, column: 12)
!366 = !DILocation(line: 133, column: 13, scope: !367)
!367 = distinct !DILexicalBlock(scope: !365, file: !3, line: 133, column: 13)
!368 = !DILocation(line: 133, column: 28, scope: !367)
!369 = !DILocation(line: 133, column: 13, scope: !365)
!370 = !DILocation(line: 134, column: 29, scope: !371)
!371 = distinct !DILexicalBlock(scope: !372, file: !3, line: 134, column: 17)
!372 = distinct !DILexicalBlock(scope: !367, file: !3, line: 133, column: 34)
!373 = !DILocation(line: 134, column: 23, scope: !371)
!374 = !DILocation(line: 134, column: 21, scope: !371)
!375 = !DILocation(line: 134, column: 42, scope: !371)
!376 = !DILocation(line: 134, column: 17, scope: !372)
!377 = !DILocation(line: 135, column: 25, scope: !378)
!378 = distinct !DILexicalBlock(scope: !371, file: !3, line: 134, column: 51)
!379 = !DILocation(line: 135, column: 65, scope: !378)
!380 = !DILocation(line: 135, column: 17, scope: !378)
!381 = !DILocation(line: 136, column: 21, scope: !378)
!382 = !DILocation(line: 137, column: 13, scope: !378)
!383 = !DILocation(line: 138, column: 9, scope: !372)
!384 = !DILocation(line: 139, column: 20, scope: !365)
!385 = !DILocation(line: 139, column: 9, scope: !365)
!386 = !DILocation(line: 143, column: 13, scope: !387)
!387 = distinct !DILexicalBlock(scope: !365, file: !3, line: 143, column: 13)
!388 = !DILocation(line: 143, column: 28, scope: !387)
!389 = !DILocation(line: 143, column: 13, scope: !365)
!390 = !DILocation(line: 144, column: 16, scope: !391)
!391 = distinct !DILexicalBlock(scope: !387, file: !3, line: 143, column: 34)
!392 = !DILocation(line: 145, column: 9, scope: !391)
!393 = !DILocation(line: 148, column: 19, scope: !273)
!394 = !DILocation(line: 148, column: 23, scope: !273)
!395 = !DILocation(line: 148, column: 11, scope: !273)
!396 = !DILocation(line: 148, column: 9, scope: !273)
!397 = !DILocation(line: 150, column: 9, scope: !398)
!398 = distinct !DILexicalBlock(scope: !273, file: !3, line: 150, column: 9)
!399 = !DILocation(line: 150, column: 15, scope: !398)
!400 = !DILocation(line: 150, column: 12, scope: !398)
!401 = !DILocation(line: 150, column: 9, scope: !273)
!402 = !DILocation(line: 151, column: 13, scope: !403)
