; ModuleID = 'molio.c'
source_filename = "molio.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mat", scope: !2, file: !3, line: 164, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "getmatrix", scope: !3, file: !3, line: 159, type: !4, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !15, retainedNodes: !368)
!3 = !DIFile(filename: "molio.c", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX_T", file: !8, line: 14, baseType: !9)
!8 = !DIFile(filename: "./nabtypes.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !11)
!10 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!11 = !{!12, !12}
!12 = !DISubrange(count: 4)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !16, retainedTypes: !33, globals: !350, splitDebugInlining: false, nameTableKind: None)
!16 = !{!17}
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 46, baseType: !19, size: 32, elements: !20)
!18 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!21 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!22 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!23 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!33 = !{!34, !39, !40, !43, !103, !106, !109, !110, !114, !143, !325, !328, !37, !329, !332, !335, !339, !13, !342, !74, !343}
!34 = !DISubprogram(name: "get_mytaskid", scope: !3, file: !3, line: 99, type: !35, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!35 = !DISubroutineType(types: !36)
!36 = !{!37}
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !{}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DISubprogram(name: "reducerror", scope: !3, file: !3, line: 100, type: !41, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !37}
!43 = !DISubprogram(name: "fclose", scope: !44, file: !44, line: 213, type: !45, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!44 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!45 = !DISubroutineType(types: !46)
!46 = !{!37, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !49, line: 49, size: 1728, elements: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !66, !67, !68, !69, !73, !75, !77, !81, !84, !86, !89, !92, !93, !94, !98, !99}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !48, file: !49, line: 51, baseType: !37, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !48, file: !49, line: 54, baseType: !13, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !48, file: !49, line: 55, baseType: !13, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !48, file: !49, line: 56, baseType: !13, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !48, file: !49, line: 57, baseType: !13, size: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !48, file: !49, line: 58, baseType: !13, size: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !48, file: !49, line: 59, baseType: !13, size: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !48, file: !49, line: 60, baseType: !13, size: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !48, file: !49, line: 61, baseType: !13, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !48, file: !49, line: 64, baseType: !13, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !48, file: !49, line: 65, baseType: !13, size: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !48, file: !49, line: 66, baseType: !13, size: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !48, file: !49, line: 68, baseType: !64, size: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !49, line: 36, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !48, file: !49, line: 70, baseType: !47, size: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !48, file: !49, line: 72, baseType: !37, size: 32, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !48, file: !49, line: 73, baseType: !37, size: 32, offset: 928)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !48, file: !49, line: 74, baseType: !70, size: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 152, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!72 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !48, file: !49, line: 77, baseType: !74, size: 16, offset: 1024)
!74 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !48, file: !49, line: 78, baseType: !76, size: 8, offset: 1040)
!76 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !48, file: !49, line: 79, baseType: !78, size: 8, offset: 1048)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 1)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !48, file: !49, line: 81, baseType: !82, size: 64, offset: 1088)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !49, line: 43, baseType: null)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !48, file: !49, line: 89, baseType: !85, size: 64, offset: 1152)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !71, line: 153, baseType: !72)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !48, file: !49, line: 91, baseType: !87, size: 64, offset: 1216)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !49, line: 37, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !48, file: !49, line: 92, baseType: !90, size: 64, offset: 1280)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !49, line: 38, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !48, file: !49, line: 93, baseType: !47, size: 64, offset: 1344)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !48, file: !49, line: 94, baseType: !39, size: 64, offset: 1408)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !48, file: !49, line: 95, baseType: !95, size: 64, offset: 1472)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 46, baseType: !97)
!96 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!97 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !48, file: !49, line: 96, baseType: !37, size: 32, offset: 1536)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !48, file: !49, line: 98, baseType: !100, size: 160, offset: 1568)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 20)
!103 = !DISubprogram(name: "fgets", scope: !44, file: !44, line: 564, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!104 = !DISubroutineType(types: !105)
!105 = !{!13, !13, !37, !47}
!106 = !DISubprogram(name: "rt_errormsg_s", scope: !3, file: !3, line: 107, type: !107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!107 = !DISubroutineType(types: !108)
!108 = !{!37, !37, !13, !13}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!110 = !DISubprogram(name: "free", scope: !111, file: !111, line: 565, type: !112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!111 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!112 = !DISubroutineType(types: !113)
!113 = !{null, !39}
!114 = !DISubprogram(name: "select_atoms", scope: !3, file: !3, line: 106, type: !115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117, !13}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !8, line: 118, size: 1088, elements: !119)
!119 = !{!120, !125, !127, !219, !220, !221, !222}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !118, file: !8, line: 119, baseType: !121, size: 768)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !8, line: 13, baseType: !122)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 768, elements: !123)
!123 = !{!12, !124}
!124 = !DISubrange(count: 3)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !118, file: !8, line: 120, baseType: !126, size: 32, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !8, line: 6, baseType: !37)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !118, file: !8, line: 121, baseType: !128, size: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !8, line: 93, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !8, line: 84, size: 384, elements: !131)
!131 = !{!132, !135, !136, !137, !138, !140, !141, !142}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !130, file: !8, line: 85, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !8, line: 17, baseType: !14)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !130, file: !8, line: 86, baseType: !126, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !130, file: !8, line: 87, baseType: !126, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !130, file: !8, line: 88, baseType: !117, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !130, file: !8, line: 89, baseType: !139, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !130, file: !8, line: 90, baseType: !126, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !130, file: !8, line: 91, baseType: !126, size: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !130, file: !8, line: 92, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !8, line: 82, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !8, line: 63, size: 1024, elements: !147)
!147 = !{!148, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !169, !170, !176, !177, !186, !187, !189}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !146, file: !8, line: 64, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !146, file: !8, line: 65, baseType: !126, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !146, file: !8, line: 66, baseType: !126, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !146, file: !8, line: 67, baseType: !126, size: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !146, file: !8, line: 68, baseType: !133, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !146, file: !8, line: 69, baseType: !133, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !146, file: !8, line: 70, baseType: !126, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !146, file: !8, line: 71, baseType: !126, size: 32, offset: 352)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !146, file: !8, line: 72, baseType: !126, size: 32, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !146, file: !8, line: 73, baseType: !139, size: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !146, file: !8, line: 74, baseType: !160, size: 64, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !8, line: 52, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !8, line: 47, size: 192, elements: !163)
!163 = !{!164, !166, !167, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !162, file: !8, line: 48, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !162, file: !8, line: 49, baseType: !126, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !162, file: !8, line: 50, baseType: !126, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !162, file: !8, line: 51, baseType: !126, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !146, file: !8, line: 75, baseType: !126, size: 32, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !146, file: !8, line: 76, baseType: !171, size: 64, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !8, line: 54, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 2)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !146, file: !8, line: 77, baseType: !126, size: 32, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !146, file: !8, line: 78, baseType: !178, size: 64, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !8, line: 61, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !8, line: 58, size: 192, elements: !181)
!181 = !{!182, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !180, file: !8, line: 59, baseType: !183, size: 128)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !184)
!184 = !{!12}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !180, file: !8, line: 60, baseType: !10, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !146, file: !8, line: 79, baseType: !126, size: 32, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !146, file: !8, line: 80, baseType: !188, size: 64, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !146, file: !8, line: 81, baseType: !190, size: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !8, line: 45, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !8, line: 25, size: 1408, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !218}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !192, file: !8, line: 26, baseType: !133, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !192, file: !8, line: 27, baseType: !133, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !192, file: !8, line: 28, baseType: !126, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !192, file: !8, line: 29, baseType: !126, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !192, file: !8, line: 30, baseType: !199, size: 256, offset: 192)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 256, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 8)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !192, file: !8, line: 31, baseType: !149, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !192, file: !8, line: 32, baseType: !10, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !192, file: !8, line: 33, baseType: !10, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !192, file: !8, line: 34, baseType: !10, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !192, file: !8, line: 35, baseType: !10, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !192, file: !8, line: 36, baseType: !133, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !192, file: !8, line: 37, baseType: !126, size: 32, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !192, file: !8, line: 38, baseType: !10, size: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !192, file: !8, line: 39, baseType: !10, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !192, file: !8, line: 40, baseType: !126, size: 32, offset: 1024)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !192, file: !8, line: 41, baseType: !126, size: 32, offset: 1056)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !192, file: !8, line: 42, baseType: !133, size: 64, offset: 1088)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !192, file: !8, line: 43, baseType: !215, size: 192, offset: 1152)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !8, line: 12, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !217)
!217 = !{!124}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !192, file: !8, line: 44, baseType: !10, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !118, file: !8, line: 122, baseType: !126, size: 32, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !118, file: !8, line: 123, baseType: !126, size: 32, offset: 928)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !118, file: !8, line: 124, baseType: !126, size: 32, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !118, file: !8, line: 125, baseType: !223, size: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !8, line: 115, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !8, line: 95, size: 5760, elements: !226)
!226 = !{!227, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !225, file: !8, line: 96, baseType: !228, size: 648)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 648, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 81)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !225, file: !8, line: 97, baseType: !126, size: 32, offset: 672)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !225, file: !8, line: 97, baseType: !126, size: 32, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !225, file: !8, line: 97, baseType: !126, size: 32, offset: 736)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !225, file: !8, line: 98, baseType: !126, size: 32, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !225, file: !8, line: 98, baseType: !126, size: 32, offset: 800)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !225, file: !8, line: 98, baseType: !126, size: 32, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !225, file: !8, line: 98, baseType: !126, size: 32, offset: 864)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !225, file: !8, line: 98, baseType: !126, size: 32, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !225, file: !8, line: 98, baseType: !126, size: 32, offset: 928)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !225, file: !8, line: 99, baseType: !126, size: 32, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !225, file: !8, line: 99, baseType: !126, size: 32, offset: 992)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !225, file: !8, line: 99, baseType: !126, size: 32, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !225, file: !8, line: 99, baseType: !126, size: 32, offset: 1056)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !225, file: !8, line: 99, baseType: !126, size: 32, offset: 1088)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !225, file: !8, line: 99, baseType: !126, size: 32, offset: 1120)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !225, file: !8, line: 100, baseType: !126, size: 32, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !225, file: !8, line: 100, baseType: !126, size: 32, offset: 1184)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !225, file: !8, line: 100, baseType: !126, size: 32, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !225, file: !8, line: 100, baseType: !126, size: 32, offset: 1248)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !225, file: !8, line: 100, baseType: !126, size: 32, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !225, file: !8, line: 100, baseType: !126, size: 32, offset: 1312)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !225, file: !8, line: 101, baseType: !126, size: 32, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !225, file: !8, line: 101, baseType: !126, size: 32, offset: 1376)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !225, file: !8, line: 101, baseType: !126, size: 32, offset: 1408)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !225, file: !8, line: 101, baseType: !126, size: 32, offset: 1440)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !225, file: !8, line: 101, baseType: !126, size: 32, offset: 1472)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !225, file: !8, line: 101, baseType: !126, size: 32, offset: 1504)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !225, file: !8, line: 101, baseType: !126, size: 32, offset: 1536)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !225, file: !8, line: 101, baseType: !126, size: 32, offset: 1568)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !225, file: !8, line: 102, baseType: !126, size: 32, offset: 1600)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !225, file: !8, line: 102, baseType: !126, size: 32, offset: 1632)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !225, file: !8, line: 102, baseType: !126, size: 32, offset: 1664)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !225, file: !8, line: 103, baseType: !133, size: 64, offset: 1728)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !225, file: !8, line: 103, baseType: !133, size: 64, offset: 1792)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !225, file: !8, line: 103, baseType: !133, size: 64, offset: 1856)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !225, file: !8, line: 103, baseType: !133, size: 64, offset: 1920)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !225, file: !8, line: 104, baseType: !268, size: 64, offset: 1984)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !225, file: !8, line: 104, baseType: !268, size: 64, offset: 2048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !225, file: !8, line: 104, baseType: !268, size: 64, offset: 2112)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !225, file: !8, line: 104, baseType: !268, size: 64, offset: 2176)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !225, file: !8, line: 104, baseType: !268, size: 64, offset: 2240)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !225, file: !8, line: 104, baseType: !268, size: 64, offset: 2304)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !225, file: !8, line: 104, baseType: !268, size: 64, offset: 2368)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !225, file: !8, line: 104, baseType: !268, size: 64, offset: 2432)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !225, file: !8, line: 104, baseType: !268, size: 64, offset: 2496)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !225, file: !8, line: 105, baseType: !268, size: 64, offset: 2560)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !225, file: !8, line: 105, baseType: !268, size: 64, offset: 2624)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !225, file: !8, line: 105, baseType: !268, size: 64, offset: 2688)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !225, file: !8, line: 105, baseType: !268, size: 64, offset: 2752)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !225, file: !8, line: 105, baseType: !268, size: 64, offset: 2816)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !225, file: !8, line: 105, baseType: !268, size: 64, offset: 2880)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !225, file: !8, line: 105, baseType: !268, size: 64, offset: 2944)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !225, file: !8, line: 106, baseType: !216, size: 192, offset: 3008)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !225, file: !8, line: 106, baseType: !10, size: 64, offset: 3200)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !225, file: !8, line: 106, baseType: !10, size: 64, offset: 3264)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !225, file: !8, line: 106, baseType: !10, size: 64, offset: 3328)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !225, file: !8, line: 106, baseType: !10, size: 64, offset: 3392)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !225, file: !8, line: 106, baseType: !10, size: 64, offset: 3456)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !225, file: !8, line: 107, baseType: !188, size: 64, offset: 3520)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !225, file: !8, line: 107, baseType: !188, size: 64, offset: 3584)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !225, file: !8, line: 107, baseType: !188, size: 64, offset: 3648)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !225, file: !8, line: 107, baseType: !188, size: 64, offset: 3712)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !225, file: !8, line: 107, baseType: !188, size: 64, offset: 3776)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !225, file: !8, line: 107, baseType: !188, size: 64, offset: 3840)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !225, file: !8, line: 108, baseType: !188, size: 64, offset: 3904)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !225, file: !8, line: 108, baseType: !188, size: 64, offset: 3968)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !225, file: !8, line: 108, baseType: !188, size: 64, offset: 4032)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !225, file: !8, line: 108, baseType: !188, size: 64, offset: 4096)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !225, file: !8, line: 108, baseType: !188, size: 64, offset: 4160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !225, file: !8, line: 108, baseType: !188, size: 64, offset: 4224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !225, file: !8, line: 109, baseType: !188, size: 64, offset: 4288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !225, file: !8, line: 109, baseType: !188, size: 64, offset: 4352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !225, file: !8, line: 109, baseType: !188, size: 64, offset: 4416)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !225, file: !8, line: 109, baseType: !188, size: 64, offset: 4480)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !225, file: !8, line: 109, baseType: !188, size: 64, offset: 4544)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !225, file: !8, line: 110, baseType: !188, size: 64, offset: 4608)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !225, file: !8, line: 110, baseType: !188, size: 64, offset: 4672)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !225, file: !8, line: 110, baseType: !188, size: 64, offset: 4736)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !225, file: !8, line: 110, baseType: !188, size: 64, offset: 4800)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !225, file: !8, line: 110, baseType: !188, size: 64, offset: 4864)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !225, file: !8, line: 111, baseType: !188, size: 64, offset: 4928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !225, file: !8, line: 111, baseType: !188, size: 64, offset: 4992)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !225, file: !8, line: 111, baseType: !188, size: 64, offset: 5056)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !225, file: !8, line: 111, baseType: !188, size: 64, offset: 5120)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !225, file: !8, line: 111, baseType: !188, size: 64, offset: 5184)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !225, file: !8, line: 111, baseType: !188, size: 64, offset: 5248)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !225, file: !8, line: 112, baseType: !188, size: 64, offset: 5312)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !225, file: !8, line: 112, baseType: !188, size: 64, offset: 5376)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !225, file: !8, line: 112, baseType: !188, size: 64, offset: 5440)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !225, file: !8, line: 112, baseType: !188, size: 64, offset: 5504)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !225, file: !8, line: 113, baseType: !188, size: 64, offset: 5568)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !225, file: !8, line: 113, baseType: !188, size: 64, offset: 5632)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !225, file: !8, line: 114, baseType: !268, size: 64, offset: 5696)
!325 = !DISubprogram(name: "newmolecule", scope: !3, file: !3, line: 103, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!326 = !DISubroutineType(types: !327)
!327 = !{!117}
!328 = !DISubprogram(name: "ggets", scope: !3, file: !3, line: 101, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!329 = !DISubprogram(name: "addresidue", scope: !3, file: !3, line: 105, type: !330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!330 = !DISubroutineType(types: !331)
!331 = !{!37, !117, !13, !149}
!332 = !DISubprogram(name: "addstrand", scope: !3, file: !3, line: 104, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!333 = !DISubroutineType(types: !334)
!334 = !{!37, !117, !13}
!335 = !DISubprogram(name: "NAB_initatom", scope: !3, file: !3, line: 89, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !338, !37}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!339 = !DISubprogram(name: "NAB_initres", scope: !3, file: !3, line: 88, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !149, !37}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "CID_T", file: !3, line: 62, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cid_t", file: !3, line: 58, size: 128, elements: !346)
!346 = !{!347, !348, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !345, file: !3, line: 59, baseType: !37, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "c_last", scope: !345, file: !3, line: 60, baseType: !37, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "c_cids", scope: !345, file: !3, line: 61, baseType: !13, size: 64, offset: 64)
!350 = !{!0, !351, !359, !361, !363}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "init", scope: !353, file: !3, line: 774, type: !37, isLocal: true, isDefinition: true)
!353 = distinct !DISubprogram(name: "init_atab", scope: !3, file: !3, line: 772, type: !354, scopeLine: 773, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !15, retainedNodes: !356)
!354 = !DISubroutineType(types: !355)
!355 = !{null}
!356 = !{!357, !358}
!357 = !DILocalVariable(name: "a", scope: !353, file: !3, line: 775, type: !37)
!358 = !DILocalVariable(name: "ap", scope: !353, file: !3, line: 776, type: !190)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "n_atab", scope: !15, file: !3, line: 70, type: !37, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "res", scope: !15, file: !3, line: 75, type: !145, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "atab", scope: !15, file: !3, line: 69, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 1408000, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 1000)
!368 = !{!369, !370, !374, !378, !379, !380, !381, !382, !383}
!369 = !DILocalVariable(name: "fname", arg: 1, scope: !2, file: !3, line: 159, type: !13)
!370 = !DILocalVariable(name: "fp", scope: !2, file: !3, line: 161, type: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !373, line: 7, baseType: !48)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!374 = !DILocalVariable(name: "line", scope: !2, file: !3, line: 162, type: !375)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 256)
!378 = !DILocalVariable(name: "r", scope: !2, file: !3, line: 163, type: !37)
!379 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 163, type: !37)
!380 = !DILocalVariable(name: "cnt", scope: !2, file: !3, line: 163, type: !37)
!381 = !DILocalVariable(name: "ptr", scope: !2, file: !3, line: 165, type: !39)
!382 = !DILocalVariable(name: "err", scope: !2, file: !3, line: 166, type: !37)
!383 = !DILabel(scope: !2, name: "CLEAN_UP", file: !3, line: 210)
!384 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!385 = !{i32 7, !"Dwarf Version", i32 4}
!386 = !{i32 2, !"Debug Info Version", i32 3}
!387 = !{i32 1, !"wchar_size", i32 4}
!388 = !{!"clang version 10.0.0-4ubuntu1 "}
!389 = distinct !DISubprogram(name: "getpdb", scope: !3, file: !3, line: 121, type: !390, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !15, retainedNodes: !394)
!390 = !DISubroutineType(types: !391)
!391 = !{!392, !13, !13}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !8, line: 126, baseType: !118)
!394 = !{!395, !396, !397, !398, !399}
!395 = !DILocalVariable(name: "fname", arg: 1, scope: !389, file: !3, line: 121, type: !13)
!396 = !DILocalVariable(name: "options", arg: 2, scope: !389, file: !3, line: 121, type: !13)
!397 = !DILocalVariable(name: "fp", scope: !389, file: !3, line: 123, type: !371)
!398 = !DILocalVariable(name: "mol", scope: !389, file: !3, line: 124, type: !392)
