; ModuleID = 'molutil.ll'
source_filename = "molutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.extbond_t = type { %struct.extbond_t*, i32, i32, i32 }
%struct.chiral_t = type { [4 x i32], double }
%struct.atom_t = type { i8*, i8*, i32, i32, [8 x i32], %struct.residue_t*, double, double, double, double, i8*, i32, double, double, i32, i32, i8*, [3 x double], double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "e_msg", scope: !2, file: !3, line: 25, type: !288, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !246, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "molutil.c", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !237, !38, !238, !55, !72, !36, !239, !240, !244, !102, !245}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !24, line: 126, baseType: !25)
!24 = !DIFile(filename: "./nabtypes.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !24, line: 118, size: 1088, elements: !26)
!26 = !{!27, !34, !37, !131, !132, !133, !134}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !25, file: !24, line: 119, baseType: !28, size: 768)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !24, line: 13, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 768, elements: !31)
!30 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!31 = !{!32, !33}
!32 = !DISubrange(count: 4)
!33 = !DISubrange(count: 3)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !25, file: !24, line: 120, baseType: !35, size: 32, offset: 768)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !24, line: 6, baseType: !36)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !25, file: !24, line: 121, baseType: !38, size: 64, offset: 832)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !24, line: 93, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !24, line: 84, size: 384, elements: !41)
!41 = !{!42, !46, !47, !48, !50, !52, !53, !54}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !40, file: !24, line: 85, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !24, line: 17, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !40, file: !24, line: 86, baseType: !35, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !40, file: !24, line: 87, baseType: !35, size: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !40, file: !24, line: 88, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !40, file: !24, line: 89, baseType: !51, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !40, file: !24, line: 90, baseType: !35, size: 32, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !40, file: !24, line: 91, baseType: !35, size: 32, offset: 288)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !40, file: !24, line: 92, baseType: !55, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !24, line: 82, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !24, line: 63, size: 1024, elements: !59)
!59 = !{!60, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !81, !82, !88, !89, !98, !99, !101}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !58, file: !24, line: 64, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !58, file: !24, line: 65, baseType: !35, size: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !58, file: !24, line: 66, baseType: !35, size: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !58, file: !24, line: 67, baseType: !35, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !58, file: !24, line: 68, baseType: !43, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !58, file: !24, line: 69, baseType: !43, size: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !58, file: !24, line: 70, baseType: !35, size: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !58, file: !24, line: 71, baseType: !35, size: 32, offset: 352)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !58, file: !24, line: 72, baseType: !35, size: 32, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !58, file: !24, line: 73, baseType: !51, size: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !58, file: !24, line: 74, baseType: !72, size: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !24, line: 52, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !24, line: 47, size: 192, elements: !75)
!75 = !{!76, !78, !79, !80}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !74, file: !24, line: 48, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !74, file: !24, line: 49, baseType: !35, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !74, file: !24, line: 50, baseType: !35, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !74, file: !24, line: 51, baseType: !35, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !58, file: !24, line: 75, baseType: !35, size: 32, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !58, file: !24, line: 76, baseType: !83, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !24, line: 54, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 2)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !58, file: !24, line: 77, baseType: !35, size: 32, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !58, file: !24, line: 78, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !24, line: 61, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !24, line: 58, size: 192, elements: !93)
!93 = !{!94, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !92, file: !24, line: 59, baseType: !95, size: 128)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !96)
!96 = !{!32}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !92, file: !24, line: 60, baseType: !30, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !58, file: !24, line: 79, baseType: !35, size: 32, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !58, file: !24, line: 80, baseType: !100, size: 64, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !58, file: !24, line: 81, baseType: !102, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !24, line: 45, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !24, line: 25, size: 1408, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !130}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !104, file: !24, line: 26, baseType: !43, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !104, file: !24, line: 27, baseType: !43, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !104, file: !24, line: 28, baseType: !35, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !104, file: !24, line: 29, baseType: !35, size: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !104, file: !24, line: 30, baseType: !111, size: 256, offset: 192)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 256, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 8)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !104, file: !24, line: 31, baseType: !61, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !104, file: !24, line: 32, baseType: !30, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !104, file: !24, line: 33, baseType: !30, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !104, file: !24, line: 34, baseType: !30, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !104, file: !24, line: 35, baseType: !30, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !104, file: !24, line: 36, baseType: !43, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !104, file: !24, line: 37, baseType: !35, size: 32, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !104, file: !24, line: 38, baseType: !30, size: 64, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !104, file: !24, line: 39, baseType: !30, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !104, file: !24, line: 40, baseType: !35, size: 32, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !104, file: !24, line: 41, baseType: !35, size: 32, offset: 1056)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !104, file: !24, line: 42, baseType: !43, size: 64, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !104, file: !24, line: 43, baseType: !127, size: 192, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !24, line: 12, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 192, elements: !129)
!129 = !{!33}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !104, file: !24, line: 44, baseType: !30, size: 64, offset: 1344)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !25, file: !24, line: 122, baseType: !35, size: 32, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !25, file: !24, line: 123, baseType: !35, size: 32, offset: 928)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !25, file: !24, line: 124, baseType: !35, size: 32, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !25, file: !24, line: 125, baseType: !135, size: 64, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !24, line: 115, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !24, line: 95, size: 5760, elements: !138)
!138 = !{!139, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !137, file: !24, line: 96, baseType: !140, size: 648)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 648, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 81)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !137, file: !24, line: 97, baseType: !35, size: 32, offset: 672)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !137, file: !24, line: 97, baseType: !35, size: 32, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !137, file: !24, line: 97, baseType: !35, size: 32, offset: 736)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 800)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 864)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 928)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 992)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 1056)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 1120)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1152)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1184)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1216)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1248)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1312)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1376)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1440)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1504)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1568)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !137, file: !24, line: 102, baseType: !35, size: 32, offset: 1600)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !137, file: !24, line: 102, baseType: !35, size: 32, offset: 1632)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !137, file: !24, line: 102, baseType: !35, size: 32, offset: 1664)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !137, file: !24, line: 103, baseType: !43, size: 64, offset: 1728)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !137, file: !24, line: 103, baseType: !43, size: 64, offset: 1792)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !137, file: !24, line: 103, baseType: !43, size: 64, offset: 1856)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !137, file: !24, line: 103, baseType: !43, size: 64, offset: 1920)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 1984)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2112)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2176)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2240)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2304)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2368)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2432)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2496)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2560)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2624)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2688)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2752)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2816)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2880)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2944)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !137, file: !24, line: 106, baseType: !128, size: 192, offset: 3008)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3200)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3264)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3328)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3392)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3456)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3520)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3584)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3648)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3712)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3776)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3840)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 3904)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 3968)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 4032)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 4096)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 4160)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 4224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4352)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4416)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4480)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4544)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4608)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4800)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4864)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 4928)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 4992)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 5056)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 5120)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 5184)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 5248)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !137, file: !24, line: 112, baseType: !100, size: 64, offset: 5312)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !137, file: !24, line: 112, baseType: !100, size: 64, offset: 5376)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !137, file: !24, line: 112, baseType: !100, size: 64, offset: 5440)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !137, file: !24, line: 112, baseType: !100, size: 64, offset: 5504)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !137, file: !24, line: 113, baseType: !100, size: 64, offset: 5568)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !137, file: !24, line: 113, baseType: !100, size: 64, offset: 5632)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !137, file: !24, line: 114, baseType: !180, size: 64, offset: 5696)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!239 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX_T", file: !24, line: 14, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1024, elements: !243)
!243 = !{!32, !32}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!245 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!246 = !{!247, !253, !258, !263, !268, !273, !280, !285, !0}
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "rname", scope: !249, file: !3, line: 733, type: !238, isLocal: true, isDefinition: true)
!249 = distinct !DISubprogram(name: "getresname", scope: !3, file: !3, line: 731, type: !250, scopeLine: 732, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !252)
!250 = !DISubroutineType(types: !251)
!251 = !{!238, !56}
!252 = !{}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "rv_err", scope: !255, file: !3, line: 1117, type: !36, isLocal: true, isDefinition: true)
!255 = distinct !DISubprogram(name: "NAB_rri", scope: !3, file: !3, line: 1113, type: !256, scopeLine: 1114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !252)
!256 = !DISubroutineType(types: !257)
!257 = !{!244, !56, !238}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "rv_err", scope: !260, file: !3, line: 1162, type: !36, isLocal: true, isDefinition: true)
!260 = distinct !DISubprogram(name: "NAB_ari", scope: !3, file: !3, line: 1160, type: !261, scopeLine: 1161, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !252)
!261 = !DISubroutineType(types: !262)
!262 = !{!244, !102, !238}
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "f", scope: !265, file: !3, line: 1212, type: !30, isLocal: true, isDefinition: true)
!265 = distinct !DISubprogram(name: "NAB_arf", scope: !3, file: !3, line: 1210, type: !266, scopeLine: 1211, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !252)
!266 = !DISubroutineType(types: !267)
!267 = !{!180, !102, !238}
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "mp", scope: !270, file: !3, line: 1318, type: !241, isLocal: true, isDefinition: true)
!270 = distinct !DISubprogram(name: "newtransform", scope: !3, file: !3, line: 1315, type: !271, scopeLine: 1316, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !252)
!271 = !DISubroutineType(types: !272)
!272 = !{!240, !30, !30, !30, !30, !30, !30}
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "mr", scope: !275, file: !3, line: 1431, type: !241, isLocal: true, isDefinition: true)
!275 = distinct !DISubprogram(name: "updtransform", scope: !3, file: !3, line: 1428, type: !276, scopeLine: 1429, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !252)
!276 = !DISubroutineType(types: !277)
!277 = !{!240, !278, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 256, elements: !96)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "mat", scope: !282, file: !3, line: 1443, type: !241, isLocal: true, isDefinition: true)
