; ModuleID = 'reslib.ll'
source_filename = "reslib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.reslib_t = type { %struct.reslib_t*, i8*, i32, i32, %struct.residue_t* }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "e_msg", scope: !2, file: !3, line: 46, type: !352, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !319, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "reslib.c", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!4 = !{}
!5 = !{!6, !7, !14, !169, !201, !228, !183, !190, !12, !53, !168, !229, !232, !234, !238, !298, !308, !311, !104, !315}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DISubprogram(name: "rt_errormsg_s", scope: !8, file: !8, line: 2, type: !9, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!8 = !DIFile(filename: "./traceback.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11, !12, !12}
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DISubprogram(name: "copyresidue", scope: !3, file: !3, line: 54, type: !15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !19, line: 63, size: 1024, elements: !20)
!19 = !DIFile(filename: "./nabtypes.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!20 = !{!21, !22, !24, !25, !26, !29, !30, !31, !32, !33, !171, !181, !182, !188, !189, !198, !199, !200}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !18, file: !19, line: 64, baseType: !17, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !18, file: !19, line: 65, baseType: !23, size: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !19, line: 6, baseType: !11)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !18, file: !19, line: 66, baseType: !23, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !18, file: !19, line: 67, baseType: !23, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !18, file: !19, line: 68, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !19, line: 17, baseType: !13)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !18, file: !19, line: 69, baseType: !27, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !18, file: !19, line: 70, baseType: !23, size: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !18, file: !19, line: 71, baseType: !23, size: 32, offset: 352)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !18, file: !19, line: 72, baseType: !23, size: 32, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !18, file: !19, line: 73, baseType: !34, size: 64, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !19, line: 84, size: 384, elements: !36)
!36 = !{!37, !38, !39, !40, !164, !165, !166, !167}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !35, file: !19, line: 85, baseType: !27, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !35, file: !19, line: 86, baseType: !23, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !35, file: !19, line: 87, baseType: !23, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !35, file: !19, line: 88, baseType: !41, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !19, line: 118, size: 1088, elements: !43)
!43 = !{!44, !51, !52, !55, !56, !57, !58}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !42, file: !19, line: 119, baseType: !45, size: 768)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !19, line: 13, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 768, elements: !48)
!47 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!48 = !{!49, !50}
!49 = !DISubrange(count: 4)
!50 = !DISubrange(count: 3)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !42, file: !19, line: 120, baseType: !23, size: 32, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !42, file: !19, line: 121, baseType: !53, size: 64, offset: 832)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !19, line: 93, baseType: !35)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !42, file: !19, line: 122, baseType: !23, size: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !42, file: !19, line: 123, baseType: !23, size: 32, offset: 928)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !42, file: !19, line: 124, baseType: !23, size: 32, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !42, file: !19, line: 125, baseType: !59, size: 64, offset: 1024)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !19, line: 115, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !19, line: 95, size: 5760, elements: !62)
!62 = !{!63, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !123, !124, !125, !126, !127, !128, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !61, file: !19, line: 96, baseType: !64, size: 648)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 648, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 81)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !61, file: !19, line: 97, baseType: !23, size: 32, offset: 672)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !61, file: !19, line: 97, baseType: !23, size: 32, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !61, file: !19, line: 97, baseType: !23, size: 32, offset: 736)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 800)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 864)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 928)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 992)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 1024)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 1056)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 1120)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1184)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1216)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1248)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1312)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1344)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1376)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1440)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1504)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1536)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1568)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !61, file: !19, line: 102, baseType: !23, size: 32, offset: 1600)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !61, file: !19, line: 102, baseType: !23, size: 32, offset: 1632)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !61, file: !19, line: 102, baseType: !23, size: 32, offset: 1664)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !61, file: !19, line: 103, baseType: !27, size: 64, offset: 1728)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !61, file: !19, line: 103, baseType: !27, size: 64, offset: 1792)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !61, file: !19, line: 103, baseType: !27, size: 64, offset: 1856)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !61, file: !19, line: 103, baseType: !27, size: 64, offset: 1920)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 1984)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2048)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2112)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2176)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2240)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2304)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2368)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2432)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2496)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2560)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2624)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2688)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2752)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2816)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2880)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2944)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !61, file: !19, line: 106, baseType: !121, size: 192, offset: 3008)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 192, elements: !122)
!122 = !{!50}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3200)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3264)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3328)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3392)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3456)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3520)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3584)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3648)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3712)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3776)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3840)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 3904)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 3968)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 4032)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 4096)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 4160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 4224)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4352)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4416)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4480)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4544)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4608)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4672)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4736)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4800)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4864)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 4928)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 4992)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 5056)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 5120)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 5184)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 5248)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !61, file: !19, line: 112, baseType: !129, size: 64, offset: 5312)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !61, file: !19, line: 112, baseType: !129, size: 64, offset: 5376)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !61, file: !19, line: 112, baseType: !129, size: 64, offset: 5440)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !61, file: !19, line: 112, baseType: !129, size: 64, offset: 5504)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !61, file: !19, line: 113, baseType: !129, size: 64, offset: 5568)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !61, file: !19, line: 113, baseType: !129, size: 64, offset: 5632)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !61, file: !19, line: 114, baseType: !104, size: 64, offset: 5696)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !35, file: !19, line: 89, baseType: !34, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !35, file: !19, line: 90, baseType: !23, size: 32, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !35, file: !19, line: 91, baseType: !23, size: 32, offset: 288)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !35, file: !19, line: 92, baseType: !168, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !19, line: 82, baseType: !18)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !18, file: !19, line: 74, baseType: !172, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !19, line: 52, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !19, line: 47, size: 192, elements: !175)
!175 = !{!176, !178, !179, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !174, file: !19, line: 48, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !174, file: !19, line: 49, baseType: !23, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !174, file: !19, line: 50, baseType: !23, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !174, file: !19, line: 51, baseType: !23, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !18, file: !19, line: 75, baseType: !23, size: 32, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !18, file: !19, line: 76, baseType: !183, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !19, line: 54, baseType: !185)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 2)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !18, file: !19, line: 77, baseType: !23, size: 32, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !18, file: !19, line: 78, baseType: !190, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !19, line: 61, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !19, line: 58, size: 192, elements: !193)
!193 = !{!194, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !192, file: !19, line: 59, baseType: !195, size: 128)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !196)
!196 = !{!49}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !192, file: !19, line: 60, baseType: !47, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !18, file: !19, line: 79, baseType: !23, size: 32, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !18, file: !19, line: 80, baseType: !129, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !18, file: !19, line: 81, baseType: !201, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !19, line: 45, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !19, line: 25, size: 1408, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !227}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !203, file: !19, line: 26, baseType: !27, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !203, file: !19, line: 27, baseType: !27, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !203, file: !19, line: 28, baseType: !23, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !203, file: !19, line: 29, baseType: !23, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !203, file: !19, line: 30, baseType: !210, size: 256, offset: 192)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 256, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 8)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !203, file: !19, line: 31, baseType: !17, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !203, file: !19, line: 32, baseType: !47, size: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !203, file: !19, line: 33, baseType: !47, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !203, file: !19, line: 34, baseType: !47, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !203, file: !19, line: 35, baseType: !47, size: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !203, file: !19, line: 36, baseType: !27, size: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !203, file: !19, line: 37, baseType: !23, size: 32, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !203, file: !19, line: 38, baseType: !47, size: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !203, file: !19, line: 39, baseType: !47, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !203, file: !19, line: 40, baseType: !23, size: 32, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !203, file: !19, line: 41, baseType: !23, size: 32, offset: 1056)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !203, file: !19, line: 42, baseType: !27, size: 64, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !203, file: !19, line: 43, baseType: !226, size: 192, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !19, line: 12, baseType: !121)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !203, file: !19, line: 44, baseType: !47, size: 64, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!229 = !DISubprogram(name: "upd_molnumbers", scope: !3, file: !3, line: 16, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !41}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !19, line: 126, baseType: !42)
!234 = !DISubprogram(name: "copyparm", scope: !3, file: !3, line: 53, type: !235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!238 = !DISubprogram(name: "fclose", scope: !239, file: !239, line: 213, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!239 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!240 = !DISubroutineType(types: !241)
!241 = !{!11, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !244, line: 49, size: 1728, elements: !245)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !261, !262, !263, !264, !268, !270, !272, !276, !279, !281, !284, !287, !288, !289, !293, !294}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !243, file: !244, line: 51, baseType: !11, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !243, file: !244, line: 54, baseType: !12, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !243, file: !244, line: 55, baseType: !12, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !243, file: !244, line: 56, baseType: !12, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !243, file: !244, line: 57, baseType: !12, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !243, file: !244, line: 58, baseType: !12, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !243, file: !244, line: 59, baseType: !12, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !243, file: !244, line: 60, baseType: !12, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !243, file: !244, line: 61, baseType: !12, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !243, file: !244, line: 64, baseType: !12, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !243, file: !244, line: 65, baseType: !12, size: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !243, file: !244, line: 66, baseType: !12, size: 64, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !243, file: !244, line: 68, baseType: !259, size: 64, offset: 768)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !244, line: 36, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !243, file: !244, line: 70, baseType: !242, size: 64, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !243, file: !244, line: 72, baseType: !11, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !243, file: !244, line: 73, baseType: !11, size: 32, offset: 928)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !243, file: !244, line: 74, baseType: !265, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !266, line: 152, baseType: !267)
!266 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!267 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !243, file: !244, line: 77, baseType: !269, size: 16, offset: 1024)
!269 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !243, file: !244, line: 78, baseType: !271, size: 8, offset: 1040)
!271 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !243, file: !244, line: 79, baseType: !273, size: 8, offset: 1048)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 1)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !243, file: !244, line: 81, baseType: !277, size: 64, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !244, line: 43, baseType: null)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !243, file: !244, line: 89, baseType: !280, size: 64, offset: 1152)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !266, line: 153, baseType: !267)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !243, file: !244, line: 91, baseType: !282, size: 64, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !244, line: 37, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !243, file: !244, line: 92, baseType: !285, size: 64, offset: 1280)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !244, line: 38, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !243, file: !244, line: 93, baseType: !242, size: 64, offset: 1344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !243, file: !244, line: 94, baseType: !6, size: 64, offset: 1408)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !243, file: !244, line: 95, baseType: !290, size: 64, offset: 1472)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !291, line: 46, baseType: !292)
!291 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!292 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !243, file: !244, line: 96, baseType: !11, size: 32, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !243, file: !244, line: 98, baseType: !295, size: 160, offset: 1568)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 20)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESLIB_T", file: !3, line: 26, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reslib_t", file: !3, line: 20, size: 256, elements: !301)
!301 = !{!302, !304, !305, !306, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rl_next", scope: !300, file: !3, line: 21, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "rl_name", scope: !300, file: !3, line: 22, baseType: !12, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rl_r_kind", scope: !300, file: !3, line: 23, baseType: !11, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rl_r_atomkind", scope: !300, file: !3, line: 24, baseType: !11, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rl_rlist", scope: !300, file: !3, line: 25, baseType: !169, size: 64, offset: 192)
!308 = !DISubprogram(name: "fgets", scope: !239, file: !239, line: 564, type: !309, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!309 = !DISubroutineType(types: !310)
!310 = !{!12, !12, !11, !242}
!311 = !DISubprogram(name: "NAB_initatom", scope: !3, file: !3, line: 48, type: !312, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !314, !11}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!315 = !DISubprogram(name: "chirvol", scope: !316, file: !316, line: 1, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!316 = !DIFile(filename: "./chirvol.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!317 = !DISubroutineType(types: !318)
!318 = !{null, !11, !11, !11, !11, !11, !104, !104, !104}
!319 = !{!0, !320, !322, !330, !335, !337, !340, !342, !345, !347}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "reslibs", scope: !2, file: !3, line: 44, type: !298, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "init", scope: !324, file: !3, line: 474, type: !11, isLocal: true, isDefinition: true)
!324 = distinct !DISubprogram(name: "initatoms", scope: !3, file: !3, line: 472, type: !325, scopeLine: 473, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !327)
!325 = !DISubroutineType(types: !326)
!326 = !{null}
!327 = !{!328, !329}
!328 = !DILocalVariable(name: "i", scope: !324, file: !3, line: 475, type: !11)
!329 = !DILocalVariable(name: "ap", scope: !324, file: !3, line: 476, type: !201)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "atoms", scope: !2, file: !3, line: 34, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 1408000, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 1000)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "n_atoms", scope: !2, file: !3, line: 33, type: !11, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "lr_name", scope: !2, file: !3, line: 32, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !211)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "n_bonds", scope: !2, file: !3, line: 37, type: !11, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "bonds", scope: !2, file: !3, line: 38, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64000, elements: !333)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "n_chi", scope: !2, file: !3, line: 41, type: !11, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "chi", scope: !2, file: !3, line: 42, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 96000, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 500)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2048, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 256)
!355 = !{i32 7, !"Dwarf Version", i32 4}
!356 = !{i32 2, !"Debug Info Version", i32 3}
!357 = !{i32 1, !"wchar_size", i32 4}
!358 = !{!"clang version 10.0.0-4ubuntu1 "}
!359 = distinct !DISubprogram(name: "getreslibkind", scope: !3, file: !3, line: 78, type: !360, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !362)
!360 = !DISubroutineType(types: !361)
!361 = !{!12, !12}
!362 = !{!363, !364, !365}
!363 = !DILocalVariable(name: "reslib", arg: 1, scope: !359, file: !3, line: 78, type: !12)
!364 = !DILocalVariable(name: "nhp", scope: !359, file: !3, line: 80, type: !12)
!365 = !DILocalVariable(name: "rlp", scope: !359, file: !3, line: 81, type: !298)
!366 = !DILocation(line: 0, scope: !359)
!367 = !DILocation(line: 80, column: 8, scope: !359)
!368 = !DILocation(line: 83, column: 14, scope: !369)
!369 = distinct !DILexicalBlock(scope: !359, file: !3, line: 83, column: 6)
!370 = !DILocation(line: 83, column: 39, scope: !369)
!371 = !DILocation(line: 83, column: 6, scope: !359)
!372 = !DILocation(line: 84, column: 15, scope: !373)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 84, column: 7)
!374 = distinct !DILexicalBlock(scope: !369, file: !3, line: 83, column: 48)
!375 = !DILocation(line: 84, column: 39, scope: !373)
!376 = !DILocation(line: 84, column: 7, scope: !374)
!377 = !DILocation(line: 85, column: 13, scope: !378)
!378 = distinct !DILexicalBlock(scope: !373, file: !3, line: 84, column: 48)
!379 = !{!380, !380, i64 0}
!380 = !{!"any pointer", !381, i64 0}
!381 = !{!"omnipotent char", !382, i64 0}
!382 = !{!"Simple C/C++ TBAA"}
!383 = !DILocation(line: 85, column: 4, scope: !378)
!384 = !DILocation(line: 87, column: 4, scope: !378)
!385 = !DILocation(line: 89, column: 2, scope: !374)
!386 = !DILocation(line: 0, scope: !369)
!387 = !DILocation(line: 90, column: 11, scope: !388)
!388 = distinct !DILexicalBlock(scope: !359, file: !3, line: 90, column: 6)
!389 = !{!390, !391, i64 16}
!390 = !{!"reslib_t", !380, i64 0, !380, i64 8, !391, i64 16, !391, i64 20, !380, i64 24}
!391 = !{!"int", !381, i64 0}
!392 = !DILocation(line: 90, column: 21, scope: !388)
!393 = !DILocation(line: 90, column: 6, scope: !359)
!394 = !DILocation(line: 91, column: 3, scope: !388)
!395 = !DILocation(line: 92, column: 16, scope: !396)
!396 = distinct !DILexicalBlock(scope: !388, file: !3, line: 92, column: 11)
!397 = !DILocation(line: 92, column: 26, scope: !396)
!398 = !DILocation(line: 92, column: 11, scope: !388)
!399 = !DILocation(line: 93, column: 3, scope: !396)
!400 = !DILocation(line: 94, column: 16, scope: !401)
!401 = distinct !DILexicalBlock(scope: !396, file: !3, line: 94, column: 11)
!402 = !DILocation(line: 94, column: 26, scope: !401)
!403 = !DILocation(line: 94, column: 11, scope: !396)
!404 = !DILocation(line: 95, column: 3, scope: !401)
!405 = !DILocation(line: 96, column: 16, scope: !406)
!406 = distinct !DILexicalBlock(scope: !401, file: !3, line: 96, column: 11)
!407 = !DILocation(line: 96, column: 26, scope: !406)
!408 = !DILocation(line: 96, column: 11, scope: !401)
!409 = !DILocation(line: 97, column: 3, scope: !406)
!410 = !DILocation(line: 99, column: 3, scope: !406)
!411 = !DILocation(line: 0, scope: !388)
!412 = !DILocation(line: 101, column: 1, scope: !359)
!413 = distinct !DISubprogram(name: "known_reslib", scope: !3, file: !3, line: 422, type: !414, scopeLine: 423, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !416)
!414 = !DISubroutineType(types: !415)
!415 = !{!298, !12}
!416 = !{!417, !418}
!417 = !DILocalVariable(name: "reslib", arg: 1, scope: !413, file: !3, line: 422, type: !12)
!418 = !DILocalVariable(name: "rlp", scope: !413, file: !3, line: 424, type: !298)
!419 = !DILocation(line: 0, scope: !413)
!420 = !DILocation(line: 426, column: 13, scope: !421)
!421 = distinct !DILexicalBlock(scope: !413, file: !3, line: 426, column: 2)
!422 = !DILocation(line: 426, column: 2, scope: !421)
!423 = !DILocation(line: 427, column: 20, scope: !424)
!424 = distinct !DILexicalBlock(scope: !425, file: !3, line: 427, column: 7)
!425 = distinct !DILexicalBlock(scope: !426, file: !3, line: 426, column: 47)
!426 = distinct !DILexicalBlock(scope: !421, file: !3, line: 426, column: 2)
!427 = !{!390, !380, i64 8}
!428 = !DILocation(line: 427, column: 7, scope: !424)
!429 = !DILocation(line: 427, column: 38, scope: !424)
!430 = !DILocation(line: 427, column: 7, scope: !425)
!431 = !DILocation(line: 0, scope: !421)
!432 = !DILocation(line: 428, column: 4, scope: !433)
!433 = distinct !DILexicalBlock(scope: !424, file: !3, line: 427, column: 44)
!434 = !DILocation(line: 430, column: 2, scope: !425)
!435 = !DILocation(line: 426, column: 38, scope: !426)
!436 = !{!390, !380, i64 0}
!437 = distinct !{!437, !422, !438}
!438 = !DILocation(line: 430, column: 2, scope: !421)
!439 = !DILocation(line: 431, column: 2, scope: !413)
!440 = !DILocation(line: 432, column: 1, scope: !413)
!441 = distinct !DISubprogram(name: "read_reslib", scope: !3, file: !3, line: 434, type: !414, scopeLine: 435, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !442)
!442 = !{!443, !444, !448, !449, !450, !451, !452}
!443 = !DILocalVariable(name: "reslib", arg: 1, scope: !441, file: !3, line: 434, type: !12)
!444 = !DILocalVariable(name: "pfp", scope: !441, file: !3, line: 436, type: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !447, line: 7, baseType: !243)
!447 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!448 = !DILocalVariable(name: "bfp", scope: !441, file: !3, line: 437, type: !445)
!449 = !DILocalVariable(name: "qfp", scope: !441, file: !3, line: 438, type: !445)
!450 = !DILocalVariable(name: "cfp", scope: !441, file: !3, line: 439, type: !445)
!451 = !DILocalVariable(name: "rlp", scope: !441, file: !3, line: 440, type: !298)
!452 = !DILocalVariable(name: "offname", scope: !441, file: !3, line: 441, type: !352)
!453 = !DILocation(line: 0, scope: !441)
!454 = !DILocation(line: 436, column: 2, scope: !441)
!455 = !DILocation(line: 436, column: 8, scope: !441)
!456 = !DILocation(line: 437, column: 2, scope: !441)
!457 = !DILocation(line: 437, column: 8, scope: !441)
!458 = !DILocation(line: 438, column: 2, scope: !441)
!459 = !DILocation(line: 438, column: 8, scope: !441)
!460 = !DILocation(line: 439, column: 2, scope: !441)
!461 = !DILocation(line: 439, column: 8, scope: !441)
!462 = !DILocation(line: 441, column: 2, scope: !441)
!463 = !DILocation(line: 441, column: 7, scope: !441)
!464 = !DILocation(line: 444, column: 3, scope: !465)
!465 = distinct !DILexicalBlock(scope: !441, file: !3, line: 443, column: 6)
!466 = !DILocation(line: 443, column: 14, scope: !465)
!467 = !DILocation(line: 444, column: 15, scope: !465)
!468 = !DILocation(line: 443, column: 6, scope: !441)
!469 = !DILocation(line: 446, column: 3, scope: !470)
!470 = distinct !DILexicalBlock(scope: !465, file: !3, line: 445, column: 2)
!471 = !DILocation(line: 449, column: 2, scope: !441)
!472 = !DILocation(line: 450, column: 7, scope: !473)
!473 = distinct !DILexicalBlock(scope: !441, file: !3, line: 450, column: 7)
!474 = !{!381, !381, i64 0}
!475 = !DILocation(line: 450, column: 7, scope: !441)
!476 = !DILocation(line: 451, column: 15, scope: !477)
!477 = distinct !DILexicalBlock(scope: !473, file: !3, line: 450, column: 17)
!478 = !DILocation(line: 451, column: 3, scope: !477)
!479 = !DILocation(line: 452, column: 2, scope: !477)
!480 = !DILocation(line: 453, column: 15, scope: !481)
!481 = distinct !DILexicalBlock(scope: !473, file: !3, line: 452, column: 7)
!482 = !DILocation(line: 453, column: 3, scope: !481)
!483 = !DILocation(line: 454, column: 15, scope: !481)
!484 = !DILocation(line: 454, column: 3, scope: !481)
!485 = !DILocation(line: 455, column: 11, scope: !481)
!486 = !DILocation(line: 455, column: 3, scope: !481)
!487 = !DILocation(line: 456, column: 11, scope: !481)
!488 = !DILocation(line: 456, column: 3, scope: !481)
!489 = !DILocation(line: 459, column: 6, scope: !490)
!490 = distinct !DILexicalBlock(scope: !441, file: !3, line: 459, column: 6)
!491 = !DILocation(line: 459, column: 6, scope: !441)
!492 = !DILocation(line: 460, column: 14, scope: !493)
!493 = distinct !DILexicalBlock(scope: !490, file: !3, line: 459, column: 11)
!494 = !DILocation(line: 460, column: 3, scope: !493)
!495 = !DILocation(line: 461, column: 11, scope: !493)
!496 = !DILocation(line: 461, column: 3, scope: !493)
!497 = !DILocation(line: 462, column: 2, scope: !493)
!498 = !DILocation(line: 464, column: 6, scope: !499)
!499 = distinct !DILexicalBlock(scope: !441, file: !3, line: 464, column: 6)
!500 = !DILocation(line: 464, column: 6, scope: !441)
!501 = !DILocation(line: 465, column: 15, scope: !502)
!502 = distinct !DILexicalBlock(scope: !499, file: !3, line: 464, column: 11)
!503 = !DILocation(line: 465, column: 3, scope: !502)
!504 = !DILocation(line: 466, column: 11, scope: !502)
!505 = !DILocation(line: 466, column: 3, scope: !502)
!506 = !DILocation(line: 467, column: 2, scope: !502)
!507 = !DILocation(line: 469, column: 2, scope: !441)
!508 = !DILocation(line: 470, column: 1, scope: !441)
!509 = distinct !DISubprogram(name: "setreslibkind", scope: !3, file: !3, line: 103, type: !510, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!11, !12, !12}
!512 = !{!513, !514, !515, !516}
!513 = !DILocalVariable(name: "reslib", arg: 1, scope: !509, file: !3, line: 103, type: !12)
!514 = !DILocalVariable(name: "kind", arg: 2, scope: !509, file: !3, line: 103, type: !12)
!515 = !DILocalVariable(name: "nhp", scope: !509, file: !3, line: 105, type: !12)
!516 = !DILocalVariable(name: "rlp", scope: !509, file: !3, line: 106, type: !298)
!517 = !DILocation(line: 0, scope: !509)
!518 = !DILocation(line: 105, column: 8, scope: !509)
!519 = !DILocation(line: 108, column: 14, scope: !520)
!520 = distinct !DILexicalBlock(scope: !509, file: !3, line: 108, column: 6)
!521 = !DILocation(line: 108, column: 39, scope: !520)
!522 = !DILocation(line: 108, column: 6, scope: !509)
!523 = !DILocation(line: 109, column: 16, scope: !524)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 109, column: 8)
!525 = distinct !DILexicalBlock(scope: !520, file: !3, line: 108, column: 48)
!526 = !DILocation(line: 109, column: 40, scope: !524)
!527 = !DILocation(line: 109, column: 8, scope: !525)
!528 = !DILocation(line: 110, column: 15, scope: !529)
!529 = distinct !DILexicalBlock(scope: !524, file: !3, line: 109, column: 49)
!530 = !DILocation(line: 110, column: 6, scope: !529)
!531 = !DILocation(line: 112, column: 6, scope: !529)
!532 = !DILocation(line: 114, column: 2, scope: !525)
!533 = !DILocation(line: 0, scope: !520)
!534 = !DILocation(line: 115, column: 7, scope: !509)
!535 = !DILocation(line: 115, column: 17, scope: !509)
!536 = !DILocation(line: 116, column: 8, scope: !537)
!537 = distinct !DILexicalBlock(scope: !509, file: !3, line: 116, column: 7)
!538 = !DILocation(line: 116, column: 30, scope: !537)
!539 = !DILocation(line: 116, column: 34, scope: !537)
!540 = !DILocation(line: 116, column: 7, scope: !509)
!541 = !DILocation(line: 117, column: 15, scope: !537)
!542 = !DILocation(line: 117, column: 25, scope: !537)
!543 = !DILocation(line: 117, column: 10, scope: !537)
!544 = !DILocation(line: 118, column: 13, scope: !545)
!545 = distinct !DILexicalBlock(scope: !537, file: !3, line: 118, column: 12)
!546 = !DILocation(line: 118, column: 35, scope: !545)
!547 = !DILocation(line: 118, column: 39, scope: !545)
!548 = !DILocation(line: 118, column: 12, scope: !537)
!549 = !DILocation(line: 119, column: 15, scope: !545)
!550 = !DILocation(line: 119, column: 25, scope: !545)
!551 = !DILocation(line: 119, column: 10, scope: !545)
!552 = !DILocation(line: 120, column: 13, scope: !553)
!553 = distinct !DILexicalBlock(scope: !545, file: !3, line: 120, column: 12)
!554 = !DILocation(line: 120, column: 34, scope: !553)
!555 = !DILocation(line: 120, column: 38, scope: !553)
!556 = !DILocation(line: 120, column: 12, scope: !545)
!557 = !DILocation(line: 121, column: 15, scope: !553)
!558 = !DILocation(line: 121, column: 25, scope: !553)
!559 = !DILocation(line: 121, column: 10, scope: !553)
!560 = !DILocation(line: 123, column: 22, scope: !509)
!561 = !DILocation(line: 123, column: 9, scope: !509)
!562 = distinct !DISubprogram(name: "getresidue", scope: !3, file: !3, line: 126, type: !563, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !565)
!563 = !DISubroutineType(types: !564)
!564 = !{!169, !12, !12}
!565 = !{!566, !567, !568, !569, !573, !574, !575}
!566 = !DILocalVariable(name: "rname", arg: 1, scope: !562, file: !3, line: 126, type: !12)
!567 = !DILocalVariable(name: "reslib", arg: 2, scope: !562, file: !3, line: 126, type: !12)
!568 = !DILocalVariable(name: "nhp", scope: !562, file: !3, line: 128, type: !12)
!569 = !DILocalVariable(name: "leapname", scope: !562, file: !3, line: 128, type: !570)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 40, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 5)
!573 = !DILocalVariable(name: "rlp", scope: !562, file: !3, line: 129, type: !298)
!574 = !DILocalVariable(name: "res", scope: !562, file: !3, line: 130, type: !169)
!575 = !DILocalVariable(name: "nres", scope: !562, file: !3, line: 130, type: !169)
!576 = !DILocation(line: 0, scope: !562)
!577 = !DILocation(line: 128, column: 8, scope: !562)
!578 = !DILocation(line: 128, column: 2, scope: !562)
!579 = !DILocation(line: 128, column: 13, scope: !562)
!580 = !DILocation(line: 132, column: 14, scope: !581)
!581 = distinct !DILexicalBlock(scope: !562, file: !3, line: 132, column: 6)
!582 = !DILocation(line: 132, column: 39, scope: !581)
!583 = !DILocation(line: 132, column: 6, scope: !562)
!584 = !DILocation(line: 133, column: 15, scope: !585)
!585 = distinct !DILexicalBlock(scope: !586, file: !3, line: 133, column: 7)
!586 = distinct !DILexicalBlock(scope: !581, file: !3, line: 132, column: 48)
!587 = !DILocation(line: 133, column: 39, scope: !585)
!588 = !DILocation(line: 133, column: 7, scope: !586)
!589 = !DILocation(line: 134, column: 4, scope: !590)
!590 = distinct !DILexicalBlock(scope: !585, file: !3, line: 133, column: 48)
!591 = !DILocation(line: 136, column: 2, scope: !586)
!592 = !DILocation(line: 0, scope: !581)
!593 = !DILocation(line: 138, column: 10, scope: !562)
!594 = !DILocation(line: 138, column: 2, scope: !562)
!595 = !DILocation(line: 139, column: 12, scope: !596)
!596 = distinct !DILexicalBlock(scope: !562, file: !3, line: 139, column: 7)
!597 = !DILocation(line: 139, column: 22, scope: !596)
!598 = !DILocation(line: 139, column: 7, scope: !562)
!599 = !DILocation(line: 140, column: 14, scope: !600)
!600 = distinct !DILexicalBlock(scope: !601, file: !3, line: 140, column: 13)
!601 = distinct !DILexicalBlock(scope: !596, file: !3, line: 139, column: 33)
!602 = !DILocation(line: 140, column: 13, scope: !601)
!603 = !DILocation(line: 141, column: 12, scope: !600)
!604 = !DILocation(line: 141, column: 4, scope: !600)
!605 = !DILocation(line: 142, column: 14, scope: !606)
!606 = distinct !DILexicalBlock(scope: !600, file: !3, line: 142, column: 13)
!607 = !DILocation(line: 142, column: 13, scope: !600)
!608 = !DILocation(line: 143, column: 12, scope: !606)
!609 = !DILocation(line: 143, column: 4, scope: !606)
!610 = !DILocation(line: 144, column: 14, scope: !611)
!611 = distinct !DILexicalBlock(scope: !606, file: !3, line: 144, column: 13)
!612 = !DILocation(line: 144, column: 13, scope: !606)
!613 = !DILocation(line: 145, column: 12, scope: !611)
!614 = !DILocation(line: 145, column: 4, scope: !611)
!615 = !DILocation(line: 146, column: 14, scope: !616)
!616 = distinct !DILexicalBlock(scope: !611, file: !3, line: 146, column: 13)
!617 = !DILocation(line: 146, column: 13, scope: !611)
!618 = !DILocation(line: 147, column: 12, scope: !616)
!619 = !DILocation(line: 147, column: 4, scope: !616)
!620 = !DILocation(line: 148, column: 2, scope: !601)
!621 = !DILocation(line: 149, column: 17, scope: !622)
!622 = distinct !DILexicalBlock(scope: !596, file: !3, line: 149, column: 12)
!623 = !DILocation(line: 149, column: 27, scope: !622)
!624 = !DILocation(line: 149, column: 12, scope: !596)
!625 = !DILocation(line: 150, column: 14, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !3, line: 150, column: 13)
!627 = distinct !DILexicalBlock(scope: !622, file: !3, line: 149, column: 38)
!628 = !DILocation(line: 150, column: 13, scope: !627)
!629 = !DILocation(line: 151, column: 12, scope: !626)
!630 = !DILocation(line: 151, column: 4, scope: !626)
!631 = !DILocation(line: 152, column: 14, scope: !632)
!632 = distinct !DILexicalBlock(scope: !626, file: !3, line: 152, column: 13)
!633 = !DILocation(line: 152, column: 13, scope: !626)
!634 = !DILocation(line: 153, column: 12, scope: !632)
!635 = !DILocation(line: 153, column: 4, scope: !632)
!636 = !DILocation(line: 154, column: 14, scope: !637)
!637 = distinct !DILexicalBlock(scope: !632, file: !3, line: 154, column: 13)
!638 = !DILocation(line: 154, column: 13, scope: !632)
!639 = !DILocation(line: 155, column: 12, scope: !637)
!640 = !DILocation(line: 155, column: 4, scope: !637)
!641 = !DILocation(line: 156, column: 14, scope: !642)
!642 = distinct !DILexicalBlock(scope: !637, file: !3, line: 156, column: 13)
!643 = !DILocation(line: 156, column: 13, scope: !637)
!644 = !DILocation(line: 157, column: 12, scope: !642)
!645 = !DILocation(line: 157, column: 4, scope: !642)
!646 = !DILocation(line: 158, column: 2, scope: !627)
!647 = !DILocation(line: 159, column: 7, scope: !648)
!648 = distinct !DILexicalBlock(scope: !562, file: !3, line: 159, column: 7)
!649 = !DILocation(line: 159, column: 28, scope: !648)
!650 = !DILocation(line: 159, column: 7, scope: !562)
!651 = !DILocation(line: 160, column: 11, scope: !648)
!652 = !DILocation(line: 160, column: 3, scope: !648)
!653 = !DILocation(line: 161, column: 12, scope: !654)
!654 = distinct !DILexicalBlock(scope: !648, file: !3, line: 161, column: 12)
!655 = !DILocation(line: 161, column: 33, scope: !654)
!656 = !DILocation(line: 161, column: 12, scope: !648)
!657 = !DILocation(line: 162, column: 11, scope: !654)
!658 = !DILocation(line: 162, column: 3, scope: !654)
!659 = !DILocation(line: 163, column: 18, scope: !660)
!660 = distinct !DILexicalBlock(scope: !562, file: !3, line: 163, column: 2)
!661 = !{!390, !380, i64 24}
!662 = !DILocation(line: 163, column: 2, scope: !660)
!663 = !DILocation(line: 164, column: 21, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !3, line: 164, column: 6)
!665 = distinct !DILexicalBlock(scope: !666, file: !3, line: 163, column: 53)
!666 = distinct !DILexicalBlock(scope: !660, file: !3, line: 163, column: 2)
!667 = !{!668, !380, i64 24}
!668 = !{!"residue_t", !380, i64 0, !391, i64 8, !391, i64 12, !391, i64 16, !380, i64 24, !380, i64 32, !391, i64 40, !391, i64 44, !391, i64 48, !380, i64 56, !380, i64 64, !391, i64 72, !380, i64 80, !391, i64 88, !380, i64 96, !391, i64 104, !380, i64 112, !380, i64 120}
!669 = !DILocation(line: 164, column: 8, scope: !664)
!670 = !DILocation(line: 164, column: 40, scope: !664)
!671 = !DILocation(line: 164, column: 47, scope: !664)
!672 = !DILocation(line: 165, column: 19, scope: !664)
!673 = !DILocation(line: 165, column: 30, scope: !664)
!674 = !DILocation(line: 165, column: 6, scope: !664)
!675 = !DILocation(line: 165, column: 41, scope: !664)
!676 = !DILocation(line: 164, column: 6, scope: !665)
!677 = !DILocation(line: 0, scope: !660)
!678 = !DILocation(line: 166, column: 4, scope: !664)
!679 = !DILocation(line: 167, column: 2, scope: !665)
!680 = !DILocation(line: 163, column: 45, scope: !666)
!681 = !{!668, !380, i64 0}
!682 = distinct !{!682, !662, !683}
!683 = !DILocation(line: 167, column: 2, scope: !660)
!684 = !DILocation(line: 169, column: 10, scope: !685)
!685 = distinct !DILexicalBlock(scope: !562, file: !3, line: 169, column: 6)
!686 = !DILocation(line: 169, column: 6, scope: !562)
!687 = !DILocation(line: 170, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !3, line: 169, column: 19)
!689 = !DILocation(line: 171, column: 3, scope: !688)
!690 = !DILocation(line: 172, column: 3, scope: !688)
!691 = !DILocation(line: 175, column: 9, scope: !562)
!692 = !DILocation(line: 177, column: 2, scope: !562)
!693 = !DILocation(line: 178, column: 1, scope: !562)
!694 = distinct !DISubprogram(name: "copyresidue", scope: !3, file: !3, line: 180, type: !695, scopeLine: 181, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !697)
!695 = !DISubroutineType(types: !696)
!696 = !{!169, !169}
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!698 = !DILocalVariable(name: "res", arg: 1, scope: !694, file: !3, line: 180, type: !169)
!699 = !DILocalVariable(name: "a", scope: !694, file: !3, line: 182, type: !11)
!700 = !DILocalVariable(name: "b", scope: !694, file: !3, line: 182, type: !11)
!701 = !DILocalVariable(name: "c", scope: !694, file: !3, line: 182, type: !11)
!702 = !DILocalVariable(name: "i", scope: !694, file: !3, line: 182, type: !11)
!703 = !DILocalVariable(name: "aip", scope: !694, file: !3, line: 183, type: !228)
!704 = !DILocalVariable(name: "nres", scope: !694, file: !3, line: 184, type: !169)
!705 = !DILocalVariable(name: "ap", scope: !694, file: !3, line: 185, type: !201)
!706 = !DILocalVariable(name: "anp", scope: !694, file: !3, line: 186, type: !12)
!707 = !DILocalVariable(name: "rnp", scope: !694, file: !3, line: 186, type: !12)
!708 = !DILocalVariable(name: "bp", scope: !694, file: !3, line: 187, type: !183)
!709 = !DILocalVariable(name: "cp", scope: !694, file: !3, line: 188, type: !190)
!710 = !DILocation(line: 0, scope: !694)
!711 = !DILocation(line: 190, column: 26, scope: !712)
!712 = distinct !DILexicalBlock(scope: !694, file: !3, line: 190, column: 5)
!713 = !DILocation(line: 190, column: 13, scope: !712)
!714 = !DILocation(line: 191, column: 3, scope: !712)
!715 = !DILocation(line: 190, column: 5, scope: !694)
!716 = !DILocation(line: 193, column: 42, scope: !717)
!717 = distinct !DILexicalBlock(scope: !712, file: !3, line: 192, column: 2)
!718 = !DILocation(line: 193, column: 3, scope: !717)
!719 = !DILocation(line: 194, column: 3, scope: !717)
!720 = !DILocation(line: 195, column: 3, scope: !717)
!721 = !DILocation(line: 198, column: 37, scope: !722)
!722 = distinct !DILexicalBlock(scope: !694, file: !3, line: 198, column: 6)
!723 = !{!668, !391, i64 104}
!724 = !DILocation(line: 198, column: 32, scope: !722)
!725 = !DILocation(line: 198, column: 45, scope: !722)
!726 = !DILocation(line: 198, column: 25, scope: !722)
!727 = !DILocation(line: 198, column: 13, scope: !722)
!728 = !DILocation(line: 199, column: 3, scope: !722)
!729 = !DILocation(line: 198, column: 6, scope: !694)
!730 = !DILocation(line: 201, column: 51, scope: !731)
!731 = distinct !DILexicalBlock(scope: !722, file: !3, line: 200, column: 2)
!732 = !DILocation(line: 201, column: 3, scope: !731)
!733 = !DILocation(line: 202, column: 3, scope: !731)
!734 = !DILocation(line: 203, column: 3, scope: !731)
!735 = !DILocation(line: 206, column: 35, scope: !736)
!736 = distinct !DILexicalBlock(scope: !694, file: !3, line: 206, column: 6)
!737 = !DILocation(line: 206, column: 30, scope: !736)
!738 = !DILocation(line: 206, column: 43, scope: !736)
!739 = !DILocation(line: 206, column: 23, scope: !736)
!740 = !DILocation(line: 206, column: 14, scope: !736)
!741 = !DILocation(line: 206, column: 58, scope: !736)
!742 = !DILocation(line: 206, column: 6, scope: !694)
!743 = !DILocation(line: 209, column: 9, scope: !744)
!744 = distinct !DILexicalBlock(scope: !736, file: !3, line: 207, column: 2)
!745 = !DILocation(line: 208, column: 3, scope: !744)
!746 = !DILocation(line: 210, column: 3, scope: !744)
!747 = !DILocation(line: 211, column: 3, scope: !744)
!748 = !DILocation(line: 214, column: 11, scope: !749)
!749 = distinct !DILexicalBlock(scope: !694, file: !3, line: 214, column: 6)
!750 = !{!668, !391, i64 72}
!751 = !DILocation(line: 214, column: 23, scope: !749)
!752 = !DILocation(line: 214, column: 6, scope: !694)
!753 = !DILocation(line: 216, column: 16, scope: !754)
!754 = distinct !DILexicalBlock(scope: !755, file: !3, line: 215, column: 7)
!755 = distinct !DILexicalBlock(scope: !749, file: !3, line: 214, column: 28)
!756 = !DILocation(line: 216, column: 11, scope: !754)
!757 = !DILocation(line: 216, column: 27, scope: !754)
!758 = !DILocation(line: 216, column: 4, scope: !754)
!759 = !DILocation(line: 215, column: 14, scope: !754)
!760 = !DILocation(line: 217, column: 4, scope: !754)
!761 = !DILocation(line: 215, column: 7, scope: !755)
!762 = !DILocation(line: 220, column: 37, scope: !763)
!763 = distinct !DILexicalBlock(scope: !754, file: !3, line: 218, column: 3)
!764 = !DILocation(line: 219, column: 4, scope: !763)
!765 = !DILocation(line: 221, column: 4, scope: !763)
!766 = !DILocation(line: 222, column: 4, scope: !763)
!767 = !DILocation(line: 224, column: 2, scope: !755)
!768 = !DILocation(line: 0, scope: !749)
!769 = !DILocation(line: 227, column: 11, scope: !770)
!770 = distinct !DILexicalBlock(scope: !694, file: !3, line: 227, column: 6)
!771 = !{!668, !391, i64 88}
!772 = !DILocation(line: 227, column: 21, scope: !770)
!773 = !DILocation(line: 227, column: 6, scope: !694)
!774 = !DILocation(line: 229, column: 16, scope: !775)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 228, column: 7)
!776 = distinct !DILexicalBlock(scope: !770, file: !3, line: 227, column: 26)
!777 = !DILocation(line: 229, column: 11, scope: !775)
!778 = !DILocation(line: 229, column: 25, scope: !775)
!779 = !DILocation(line: 229, column: 4, scope: !775)
!780 = !DILocation(line: 228, column: 14, scope: !775)
!781 = !DILocation(line: 230, column: 4, scope: !775)
!782 = !DILocation(line: 228, column: 7, scope: !776)
!783 = !DILocation(line: 233, column: 37, scope: !784)
!784 = distinct !DILexicalBlock(scope: !775, file: !3, line: 231, column: 3)
!785 = !DILocation(line: 232, column: 4, scope: !784)
!786 = !DILocation(line: 234, column: 4, scope: !784)
!787 = !DILocation(line: 235, column: 4, scope: !784)
!788 = !DILocation(line: 237, column: 2, scope: !776)
!789 = !DILocation(line: 0, scope: !770)
!790 = !DILocation(line: 240, column: 8, scope: !694)
!791 = !DILocation(line: 240, column: 15, scope: !694)
!792 = !DILocation(line: 242, column: 37, scope: !694)
!793 = !DILocation(line: 242, column: 25, scope: !694)
!794 = !DILocation(line: 242, column: 47, scope: !694)
!795 = !DILocation(line: 242, column: 18, scope: !694)
!796 = !DILocation(line: 243, column: 10, scope: !797)
!797 = distinct !DILexicalBlock(scope: !694, file: !3, line: 243, column: 6)
!798 = !DILocation(line: 243, column: 6, scope: !694)
!799 = !DILocation(line: 244, column: 12, scope: !800)
!800 = distinct !DILexicalBlock(scope: !797, file: !3, line: 243, column: 19)
!801 = !DILocation(line: 244, column: 3, scope: !800)
!802 = !DILocation(line: 246, column: 3, scope: !800)
!803 = !DILocation(line: 248, column: 20, scope: !694)
!804 = !DILocation(line: 248, column: 2, scope: !694)
!805 = !DILocation(line: 249, column: 8, scope: !694)
!806 = !DILocation(line: 249, column: 18, scope: !694)
!807 = !DILocation(line: 251, column: 37, scope: !694)
!808 = !{!668, !380, i64 32}
!809 = !DILocation(line: 251, column: 25, scope: !694)
!810 = !DILocation(line: 251, column: 45, scope: !694)
!811 = !DILocation(line: 251, column: 18, scope: !694)
!812 = !DILocation(line: 252, column: 10, scope: !813)
!813 = distinct !DILexicalBlock(scope: !694, file: !3, line: 252, column: 6)
!814 = !DILocation(line: 252, column: 6, scope: !694)
!815 = !DILocation(line: 253, column: 12, scope: !816)
!816 = distinct !DILexicalBlock(scope: !813, file: !3, line: 252, column: 19)
!817 = !DILocation(line: 253, column: 3, scope: !816)
!818 = !DILocation(line: 254, column: 3, scope: !816)
!819 = !DILocation(line: 256, column: 20, scope: !694)
!820 = !DILocation(line: 256, column: 2, scope: !694)
!821 = !DILocation(line: 257, column: 8, scope: !694)
!822 = !DILocation(line: 257, column: 16, scope: !694)
!823 = !DILocation(line: 259, column: 21, scope: !694)
!824 = !{!668, !391, i64 8}
!825 = !DILocation(line: 259, column: 8, scope: !694)
!826 = !DILocation(line: 259, column: 14, scope: !694)
!827 = !DILocation(line: 260, column: 8, scope: !694)
!828 = !DILocation(line: 260, column: 18, scope: !694)
!829 = !{!668, !391, i64 12}
!830 = !DILocation(line: 261, column: 8, scope: !694)
!831 = !DILocation(line: 261, column: 17, scope: !694)
!832 = !{!668, !391, i64 16}
!833 = !DILocation(line: 262, column: 22, scope: !694)
!834 = !{!668, !391, i64 40}
!835 = !DILocation(line: 262, column: 8, scope: !694)
!836 = !DILocation(line: 262, column: 15, scope: !694)
!837 = !DILocation(line: 263, column: 8, scope: !694)
!838 = !DILocation(line: 263, column: 17, scope: !694)
!839 = !{!668, !380, i64 56}
!840 = !DILocation(line: 264, column: 21, scope: !694)
!841 = !DILocation(line: 264, column: 8, scope: !694)
!842 = !DILocation(line: 264, column: 19, scope: !694)
!843 = !{!668, !380, i64 64}
!844 = !DILocation(line: 265, column: 27, scope: !694)
!845 = !DILocation(line: 265, column: 8, scope: !694)
!846 = !DILocation(line: 265, column: 20, scope: !694)
!847 = !DILocation(line: 266, column: 8, scope: !694)
!848 = !DILocation(line: 266, column: 19, scope: !694)
!849 = !{!668, !380, i64 80}
!850 = !DILocation(line: 267, column: 23, scope: !851)
!851 = distinct !DILexicalBlock(scope: !852, file: !3, line: 267, column: 2)
!852 = distinct !DILexicalBlock(scope: !694, file: !3, line: 267, column: 2)
!853 = !DILocation(line: 267, column: 16, scope: !851)
!854 = !DILocation(line: 267, column: 2, scope: !852)
!855 = !DILocation(line: 268, column: 37, scope: !856)
!856 = distinct !DILexicalBlock(scope: !851, file: !3, line: 267, column: 41)
!857 = !DILocation(line: 268, column: 32, scope: !856)
!858 = !{!391, !391, i64 0}
!859 = !DILocation(line: 268, column: 9, scope: !856)
!860 = !DILocation(line: 268, column: 3, scope: !856)
!861 = !DILocation(line: 268, column: 30, scope: !856)
!862 = !DILocation(line: 269, column: 37, scope: !856)
!863 = !DILocation(line: 269, column: 32, scope: !856)
!864 = !DILocation(line: 269, column: 9, scope: !856)
!865 = !DILocation(line: 269, column: 3, scope: !856)
!866 = !DILocation(line: 269, column: 30, scope: !856)
!867 = !DILocation(line: 270, column: 2, scope: !856)
!868 = !DILocation(line: 267, column: 37, scope: !851)
!869 = distinct !{!869, !854, !870}
!870 = !DILocation(line: 270, column: 2, scope: !852)
!871 = !DILocation(line: 271, column: 25, scope: !694)
!872 = !DILocation(line: 271, column: 8, scope: !694)
!873 = !DILocation(line: 271, column: 18, scope: !694)
!874 = !DILocation(line: 272, column: 8, scope: !694)
!875 = !DILocation(line: 272, column: 17, scope: !694)
!876 = !{!668, !380, i64 96}
!877 = !DILocation(line: 273, column: 18, scope: !878)
!878 = distinct !DILexicalBlock(scope: !694, file: !3, line: 273, column: 2)
!879 = !DILocation(line: 273, column: 44, scope: !880)
!880 = distinct !DILexicalBlock(scope: !878, file: !3, line: 273, column: 2)
!881 = !DILocation(line: 273, column: 37, scope: !880)
!882 = !DILocation(line: 273, column: 2, scope: !878)
!883 = !DILocation(line: 274, column: 3, scope: !884)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 274, column: 3)
!885 = distinct !DILexicalBlock(scope: !880, file: !3, line: 273, column: 66)
!886 = !DILocation(line: 275, column: 27, scope: !887)
!887 = distinct !DILexicalBlock(scope: !884, file: !3, line: 274, column: 3)
!888 = !DILocation(line: 275, column: 22, scope: !887)
!889 = !DILocation(line: 275, column: 41, scope: !887)
!890 = !DILocation(line: 275, column: 8, scope: !887)
!891 = !DILocation(line: 275, column: 4, scope: !887)
!892 = !DILocation(line: 275, column: 20, scope: !887)
!893 = !DILocation(line: 274, column: 23, scope: !887)
!894 = !DILocation(line: 274, column: 17, scope: !887)
!895 = distinct !{!895, !883, !896}
!896 = !DILocation(line: 275, column: 51, scope: !884)
!897 = !DILocation(line: 276, column: 21, scope: !885)
!898 = !DILocation(line: 276, column: 16, scope: !885)
!899 = !DILocation(line: 276, column: 35, scope: !885)
!900 = !{!901, !902, i64 16}
!901 = !{!"chiral_t", !381, i64 0, !902, i64 16}
!902 = !{!"double", !381, i64 0}
!903 = !DILocation(line: 276, column: 7, scope: !885)
!904 = !DILocation(line: 276, column: 14, scope: !885)
!905 = !DILocation(line: 277, column: 2, scope: !885)
!906 = !DILocation(line: 273, column: 56, scope: !880)
!907 = !DILocation(line: 273, column: 62, scope: !880)
!908 = distinct !{!908, !882, !909}
!909 = !DILocation(line: 277, column: 2, scope: !878)
!910 = !DILocation(line: 278, column: 22, scope: !694)
!911 = !{!668, !391, i64 44}
!912 = !DILocation(line: 278, column: 8, scope: !694)
!913 = !DILocation(line: 278, column: 15, scope: !694)
!914 = !DILocation(line: 279, column: 26, scope: !694)
!915 = !{!668, !391, i64 48}
!916 = !DILocation(line: 279, column: 8, scope: !694)
!917 = !DILocation(line: 279, column: 19, scope: !694)
!918 = !DILocation(line: 280, column: 24, scope: !694)
!919 = !DILocation(line: 280, column: 8, scope: !694)
!920 = !DILocation(line: 280, column: 17, scope: !694)
!921 = !DILocation(line: 281, column: 8, scope: !694)
!922 = !DILocation(line: 281, column: 17, scope: !694)
!923 = !{!668, !380, i64 112}
!924 = !DILocation(line: 282, column: 11, scope: !925)
!925 = distinct !DILexicalBlock(scope: !694, file: !3, line: 282, column: 6)
!926 = !DILocation(line: 282, column: 6, scope: !925)
!927 = !DILocation(line: 282, column: 6, scope: !694)
!928 = !DILocation(line: 283, column: 24, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !3, line: 283, column: 3)
!930 = distinct !DILexicalBlock(scope: !931, file: !3, line: 283, column: 3)
!931 = distinct !DILexicalBlock(scope: !925, file: !3, line: 282, column: 21)
!932 = !DILocation(line: 283, column: 17, scope: !929)
!933 = !DILocation(line: 283, column: 3, scope: !930)
!934 = !DILocation(line: 284, column: 31, scope: !929)
!935 = !DILocation(line: 284, column: 26, scope: !929)
!936 = !DILocation(line: 284, column: 10, scope: !929)
!937 = !DILocation(line: 284, column: 4, scope: !929)
!938 = !DILocation(line: 284, column: 24, scope: !929)
!939 = !DILocation(line: 283, column: 35, scope: !929)
!940 = distinct !{!940, !933, !941}
!941 = !DILocation(line: 284, column: 43, scope: !930)
!942 = !DILocation(line: 285, column: 2, scope: !931)
!943 = !DILocation(line: 286, column: 24, scope: !944)
!944 = distinct !DILexicalBlock(scope: !945, file: !3, line: 286, column: 3)
!945 = distinct !DILexicalBlock(scope: !946, file: !3, line: 286, column: 3)
!946 = distinct !DILexicalBlock(scope: !925, file: !3, line: 285, column: 7)
!947 = !DILocation(line: 286, column: 17, scope: !944)
!948 = !DILocation(line: 286, column: 3, scope: !945)
!949 = !DILocation(line: 287, column: 10, scope: !944)
!950 = !DILocation(line: 287, column: 4, scope: !944)
!951 = !DILocation(line: 287, column: 24, scope: !944)
!952 = !DILocation(line: 286, column: 35, scope: !944)
!953 = distinct !{!953, !948, !954}
!954 = !DILocation(line: 287, column: 26, scope: !945)
!955 = !DILocation(line: 289, column: 8, scope: !694)
!956 = !DILocation(line: 289, column: 16, scope: !694)
!957 = !{!668, !380, i64 120}
!958 = !DILocation(line: 290, column: 23, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 290, column: 2)
!960 = distinct !DILexicalBlock(scope: !694, file: !3, line: 290, column: 2)
!961 = !DILocation(line: 290, column: 16, scope: !959)
!962 = !DILocation(line: 290, column: 2, scope: !960)
!963 = !DILocation(line: 292, column: 37, scope: !964)
!964 = distinct !DILexicalBlock(scope: !959, file: !3, line: 290, column: 38)
!965 = !DILocation(line: 292, column: 32, scope: !964)
!966 = !DILocation(line: 292, column: 48, scope: !964)
!967 = !{!968, !380, i64 0}
!968 = !{!"atom_t", !380, i64 0, !380, i64 8, !391, i64 16, !391, i64 20, !381, i64 24, !380, i64 56, !902, i64 64, !902, i64 72, !902, i64 80, !902, i64 88, !380, i64 96, !391, i64 104, !902, i64 112, !902, i64 120, !391, i64 128, !391, i64 132, !380, i64 136, !381, i64 144, !902, i64 168}
!969 = !DILocation(line: 292, column: 24, scope: !964)
!970 = !DILocation(line: 292, column: 60, scope: !964)
!971 = !DILocation(line: 292, column: 17, scope: !964)
!972 = !DILocation(line: 293, column: 11, scope: !973)
!973 = distinct !DILexicalBlock(scope: !964, file: !3, line: 293, column: 7)
!974 = !DILocation(line: 293, column: 7, scope: !964)
!975 = !DILocation(line: 294, column: 13, scope: !976)
!976 = distinct !DILexicalBlock(scope: !973, file: !3, line: 293, column: 20)
!977 = !DILocation(line: 294, column: 4, scope: !976)
!978 = !DILocation(line: 295, column: 4, scope: !976)
!979 = !DILocation(line: 297, column: 21, scope: !964)
!980 = !DILocation(line: 297, column: 16, scope: !964)
!981 = !DILocation(line: 297, column: 34, scope: !964)
!982 = !DILocation(line: 297, column: 3, scope: !964)
!983 = !DILocation(line: 298, column: 3, scope: !964)
!984 = !DILocation(line: 298, column: 11, scope: !964)
!985 = !DILocation(line: 298, column: 22, scope: !964)
!986 = !DILocation(line: 299, column: 3, scope: !964)
!987 = !DILocation(line: 299, column: 11, scope: !964)
!988 = !DILocation(line: 299, column: 22, scope: !964)
!989 = !{!968, !380, i64 8}
!990 = !DILocation(line: 300, column: 25, scope: !964)
!991 = !DILocation(line: 300, column: 20, scope: !964)
!992 = !DILocation(line: 300, column: 38, scope: !964)
!993 = !{!968, !391, i64 16}
!994 = !DILocation(line: 300, column: 3, scope: !964)
!995 = !DILocation(line: 300, column: 11, scope: !964)
!996 = !DILocation(line: 300, column: 18, scope: !964)
!997 = !DILocation(line: 301, column: 29, scope: !964)
!998 = !DILocation(line: 301, column: 24, scope: !964)
!999 = !DILocation(line: 301, column: 42, scope: !964)
!1000 = !{!968, !391, i64 20}
!1001 = !DILocation(line: 301, column: 3, scope: !964)
!1002 = !DILocation(line: 301, column: 11, scope: !964)
!1003 = !DILocation(line: 301, column: 22, scope: !964)
!1004 = !DILocation(line: 302, column: 3, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !964, file: !3, line: 302, column: 3)
!1006 = !DILocation(line: 303, column: 30, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 302, column: 3)
!1008 = !DILocation(line: 303, column: 25, scope: !1007)
!1009 = !DILocation(line: 303, column: 41, scope: !1007)
!1010 = !DILocation(line: 303, column: 4, scope: !1007)
!1011 = !DILocation(line: 303, column: 10, scope: !1007)
!1012 = !DILocation(line: 303, column: 23, scope: !1007)
!1013 = !DILocation(line: 302, column: 38, scope: !1007)
!1014 = !DILocation(line: 302, column: 18, scope: !1007)
!1015 = distinct !{!1015, !1004, !1016}
!1016 = !DILocation(line: 303, column: 52, scope: !1005)
!1017 = !DILocation(line: 304, column: 3, scope: !964)
!1018 = !DILocation(line: 304, column: 11, scope: !964)
!1019 = !DILocation(line: 304, column: 22, scope: !964)
!1020 = !{!968, !380, i64 56}
!1021 = !DILocation(line: 305, column: 29, scope: !964)
!1022 = !DILocation(line: 305, column: 24, scope: !964)
!1023 = !DILocation(line: 305, column: 42, scope: !964)
!1024 = !{!968, !902, i64 64}
!1025 = !DILocation(line: 305, column: 3, scope: !964)
!1026 = !DILocation(line: 305, column: 11, scope: !964)
!1027 = !DILocation(line: 305, column: 22, scope: !964)
!1028 = !DILocation(line: 306, column: 29, scope: !964)
!1029 = !DILocation(line: 306, column: 24, scope: !964)
!1030 = !DILocation(line: 306, column: 42, scope: !964)
!1031 = !{!968, !902, i64 72}
!1032 = !DILocation(line: 306, column: 3, scope: !964)
!1033 = !DILocation(line: 306, column: 11, scope: !964)
!1034 = !DILocation(line: 306, column: 22, scope: !964)
!1035 = !DILocation(line: 307, column: 29, scope: !964)
!1036 = !DILocation(line: 307, column: 24, scope: !964)
!1037 = !DILocation(line: 307, column: 42, scope: !964)
!1038 = !{!968, !902, i64 80}
!1039 = !DILocation(line: 307, column: 3, scope: !964)
!1040 = !DILocation(line: 307, column: 11, scope: !964)
!1041 = !DILocation(line: 307, column: 22, scope: !964)
!1042 = !DILocation(line: 308, column: 29, scope: !964)
!1043 = !DILocation(line: 308, column: 24, scope: !964)
!1044 = !DILocation(line: 308, column: 42, scope: !964)
!1045 = !{!968, !902, i64 88}
!1046 = !DILocation(line: 308, column: 3, scope: !964)
!1047 = !DILocation(line: 308, column: 11, scope: !964)
!1048 = !DILocation(line: 308, column: 22, scope: !964)
!1049 = !DILocation(line: 309, column: 3, scope: !964)
!1050 = !DILocation(line: 309, column: 11, scope: !964)
!1051 = !DILocation(line: 309, column: 22, scope: !964)
!1052 = !{!968, !380, i64 96}
!1053 = !DILocation(line: 310, column: 29, scope: !964)
!1054 = !DILocation(line: 310, column: 24, scope: !964)
!1055 = !DILocation(line: 310, column: 42, scope: !964)
!1056 = !{!968, !391, i64 104}
!1057 = !DILocation(line: 310, column: 3, scope: !964)
!1058 = !DILocation(line: 310, column: 11, scope: !964)
!1059 = !DILocation(line: 310, column: 22, scope: !964)
!1060 = !DILocation(line: 311, column: 29, scope: !964)
!1061 = !DILocation(line: 311, column: 24, scope: !964)
!1062 = !DILocation(line: 311, column: 42, scope: !964)
!1063 = !{!968, !902, i64 112}
!1064 = !DILocation(line: 311, column: 3, scope: !964)
!1065 = !DILocation(line: 311, column: 11, scope: !964)
!1066 = !DILocation(line: 311, column: 22, scope: !964)
!1067 = !DILocation(line: 312, column: 29, scope: !964)
!1068 = !DILocation(line: 312, column: 24, scope: !964)
!1069 = !DILocation(line: 312, column: 42, scope: !964)
!1070 = !{!968, !902, i64 120}
!1071 = !DILocation(line: 312, column: 3, scope: !964)
!1072 = !DILocation(line: 312, column: 11, scope: !964)
!1073 = !DILocation(line: 312, column: 22, scope: !964)
!1074 = !DILocation(line: 313, column: 29, scope: !964)
!1075 = !DILocation(line: 313, column: 24, scope: !964)
!1076 = !DILocation(line: 313, column: 42, scope: !964)
!1077 = !{!968, !391, i64 128}
!1078 = !DILocation(line: 313, column: 3, scope: !964)
!1079 = !DILocation(line: 313, column: 11, scope: !964)
!1080 = !DILocation(line: 313, column: 22, scope: !964)
!1081 = !DILocation(line: 314, column: 29, scope: !964)
!1082 = !DILocation(line: 314, column: 24, scope: !964)
!1083 = !DILocation(line: 314, column: 42, scope: !964)
!1084 = !{!968, !391, i64 132}
!1085 = !DILocation(line: 314, column: 3, scope: !964)
!1086 = !DILocation(line: 314, column: 11, scope: !964)
!1087 = !DILocation(line: 314, column: 22, scope: !964)
!1088 = !DILocation(line: 315, column: 3, scope: !964)
!1089 = !DILocation(line: 315, column: 11, scope: !964)
!1090 = !DILocation(line: 315, column: 22, scope: !964)
!1091 = !{!968, !380, i64 136}
!1092 = !DILocation(line: 316, column: 29, scope: !964)
!1093 = !DILocation(line: 316, column: 24, scope: !964)
!1094 = !DILocation(line: 316, column: 42, scope: !964)
!1095 = !{!902, !902, i64 0}
!1096 = !DILocation(line: 316, column: 3, scope: !964)
!1097 = !DILocation(line: 316, column: 11, scope: !964)
!1098 = !DILocation(line: 316, column: 22, scope: !964)
!1099 = !DILocation(line: 317, column: 29, scope: !964)
!1100 = !DILocation(line: 317, column: 24, scope: !964)
!1101 = !DILocation(line: 317, column: 42, scope: !964)
!1102 = !DILocation(line: 317, column: 3, scope: !964)
!1103 = !DILocation(line: 317, column: 11, scope: !964)
!1104 = !DILocation(line: 317, column: 22, scope: !964)
!1105 = !DILocation(line: 318, column: 29, scope: !964)
!1106 = !DILocation(line: 318, column: 24, scope: !964)
!1107 = !DILocation(line: 318, column: 42, scope: !964)
!1108 = !DILocation(line: 318, column: 3, scope: !964)
!1109 = !DILocation(line: 318, column: 11, scope: !964)
!1110 = !DILocation(line: 318, column: 22, scope: !964)
!1111 = !DILocation(line: 319, column: 29, scope: !964)
!1112 = !DILocation(line: 319, column: 24, scope: !964)
!1113 = !DILocation(line: 319, column: 42, scope: !964)
!1114 = !{!968, !902, i64 168}
!1115 = !DILocation(line: 319, column: 3, scope: !964)
!1116 = !DILocation(line: 319, column: 11, scope: !964)
!1117 = !DILocation(line: 319, column: 22, scope: !964)
!1118 = !DILocation(line: 320, column: 2, scope: !964)
!1119 = !DILocation(line: 290, column: 34, scope: !959)
!1120 = distinct !{!1120, !962, !1121}
!1121 = !DILocation(line: 320, column: 2, scope: !960)
!1122 = !DILocation(line: 322, column: 2, scope: !694)
!1123 = !DILocation(line: 323, column: 1, scope: !694)
!1124 = distinct !DISubprogram(name: "copystrand", scope: !3, file: !3, line: 325, type: !1125, scopeLine: 326, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1127)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!53, !53}
!1127 = !{!1128, !1129, !1130, !1131}
!1128 = !DILocalVariable(name: "str", arg: 1, scope: !1124, file: !3, line: 325, type: !53)
!1129 = !DILocalVariable(name: "newstrand", scope: !1124, file: !3, line: 327, type: !53)
!1130 = !DILocalVariable(name: "namebuf", scope: !1124, file: !3, line: 328, type: !12)
!1131 = !DILocalVariable(name: "resctr", scope: !1124, file: !3, line: 329, type: !11)
!1132 = !DILocation(line: 0, scope: !1124)
!1133 = !DILocation(line: 331, column: 33, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 331, column: 5)
!1135 = !DILocation(line: 331, column: 19, scope: !1134)
!1136 = !DILocation(line: 331, column: 64, scope: !1134)
!1137 = !DILocation(line: 331, column: 5, scope: !1124)
!1138 = !DILocation(line: 332, column: 41, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 331, column: 72)
!1140 = !{!1141, !380, i64 0}
!1141 = !{!"strand_t", !380, i64 0, !391, i64 8, !391, i64 12, !380, i64 16, !380, i64 24, !391, i64 32, !391, i64 36, !380, i64 40}
!1142 = !DILocation(line: 332, column: 3, scope: !1139)
!1143 = !DILocation(line: 333, column: 3, scope: !1139)
!1144 = !DILocation(line: 334, column: 3, scope: !1139)
!1145 = !DILocation(line: 338, column: 16, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 337, column: 13)
!1147 = !{!1141, !391, i64 32}
!1148 = !DILocation(line: 338, column: 11, scope: !1146)
!1149 = !DILocation(line: 338, column: 28, scope: !1146)
!1150 = !DILocation(line: 338, column: 3, scope: !1146)
!1151 = !DILocation(line: 337, column: 39, scope: !1146)
!1152 = !DILocation(line: 337, column: 26, scope: !1146)
!1153 = !DILocation(line: 337, column: 37, scope: !1146)
!1154 = !{!1141, !380, i64 40}
!1155 = !DILocation(line: 338, column: 56, scope: !1146)
!1156 = !DILocation(line: 337, column: 13, scope: !1124)
!1157 = !DILocation(line: 340, column: 17, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 339, column: 2)
!1159 = !DILocation(line: 341, column: 17, scope: !1158)
!1160 = !DILocation(line: 344, column: 51, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 344, column: 6)
!1162 = !DILocation(line: 344, column: 38, scope: !1161)
!1163 = !DILocation(line: 344, column: 66, scope: !1161)
!1164 = !DILocation(line: 345, column: 3, scope: !1161)
!1165 = !DILocation(line: 344, column: 28, scope: !1161)
!1166 = !DILocation(line: 345, column: 24, scope: !1161)
!1167 = !DILocation(line: 344, column: 6, scope: !1124)
!1168 = !DILocation(line: 347, column: 41, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 346, column: 2)
!1170 = !DILocation(line: 347, column: 3, scope: !1169)
!1171 = !DILocation(line: 348, column: 3, scope: !1169)
!1172 = !DILocation(line: 349, column: 3, scope: !1169)
!1173 = !DILocation(line: 351, column: 13, scope: !1124)
!1174 = !DILocation(line: 351, column: 26, scope: !1124)
!1175 = !DILocation(line: 352, column: 20, scope: !1124)
!1176 = !DILocation(line: 352, column: 39, scope: !1124)
!1177 = !DILocation(line: 352, column: 2, scope: !1124)
!1178 = !DILocation(line: 353, column: 32, scope: !1124)
!1179 = !{!1141, !391, i64 8}
!1180 = !DILocation(line: 353, column: 13, scope: !1124)
!1181 = !DILocation(line: 353, column: 25, scope: !1124)
!1182 = !DILocation(line: 354, column: 27, scope: !1124)
!1183 = !{!1141, !391, i64 12}
!1184 = !DILocation(line: 354, column: 13, scope: !1124)
!1185 = !DILocation(line: 354, column: 20, scope: !1124)
!1186 = !DILocation(line: 355, column: 13, scope: !1124)
!1187 = !DILocation(line: 355, column: 24, scope: !1124)
!1188 = !{!1141, !380, i64 16}
!1189 = !DILocation(line: 356, column: 13, scope: !1124)
!1190 = !DILocation(line: 356, column: 20, scope: !1124)
!1191 = !{!1141, !380, i64 24}
!1192 = !DILocation(line: 357, column: 32, scope: !1124)
!1193 = !DILocation(line: 357, column: 13, scope: !1124)
!1194 = !DILocation(line: 357, column: 25, scope: !1124)
!1195 = !DILocation(line: 358, column: 31, scope: !1124)
!1196 = !DILocation(line: 358, column: 13, scope: !1124)
!1197 = !DILocation(line: 358, column: 24, scope: !1124)
!1198 = !{!1141, !391, i64 36}
!1199 = !DILocation(line: 359, column: 41, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !3, line: 359, column: 9)
!1201 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 359, column: 9)
!1202 = !DILocation(line: 359, column: 34, scope: !1200)
!1203 = !DILocation(line: 359, column: 9, scope: !1201)
!1204 = !DILocation(line: 361, column: 22, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1200, file: !3, line: 359, column: 65)
!1206 = !DILocation(line: 361, column: 17, scope: !1205)
!1207 = !DILocation(line: 361, column: 4, scope: !1205)
!1208 = !DILocation(line: 360, column: 28, scope: !1205)
!1209 = !DILocation(line: 360, column: 17, scope: !1205)
!1210 = !DILocation(line: 360, column: 49, scope: !1205)
!1211 = !DILocation(line: 362, column: 28, scope: !1205)
!1212 = !DILocation(line: 362, column: 17, scope: !1205)
!1213 = !DILocation(line: 362, column: 50, scope: !1205)
!1214 = !DILocation(line: 362, column: 59, scope: !1205)
!1215 = !DILocation(line: 363, column: 29, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1205, file: !3, line: 363, column: 22)
!1217 = !DILocation(line: 363, column: 22, scope: !1205)
!1218 = !DILocation(line: 365, column: 16, scope: !1216)
!1219 = !DILocation(line: 365, column: 5, scope: !1216)
!1220 = !DILocation(line: 364, column: 36, scope: !1216)
!1221 = !DILocation(line: 364, column: 55, scope: !1216)
!1222 = !DILocation(line: 364, column: 25, scope: !1216)
!1223 = !DILocation(line: 364, column: 62, scope: !1216)
!1224 = !DILocation(line: 364, column: 69, scope: !1216)
!1225 = !DILocation(line: 366, column: 9, scope: !1205)
!1226 = !DILocation(line: 359, column: 60, scope: !1200)
!1227 = distinct !{!1227, !1203, !1228}
!1228 = !DILocation(line: 366, column: 9, scope: !1201)
!1229 = !DILocation(line: 367, column: 2, scope: !1124)
!1230 = !DILocation(line: 368, column: 1, scope: !1124)
!1231 = distinct !DISubprogram(name: "copymolecule", scope: !3, file: !3, line: 370, type: !1232, scopeLine: 371, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1234)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!232, !232}
!1234 = !{!1235, !1236, !1237, !1238, !1239, !1240, !1241}
!1235 = !DILocalVariable(name: "mol", arg: 1, scope: !1231, file: !3, line: 370, type: !232)
!1236 = !DILocalVariable(name: "row", scope: !1231, file: !3, line: 372, type: !11)
!1237 = !DILocalVariable(name: "col", scope: !1231, file: !3, line: 372, type: !11)
!1238 = !DILocalVariable(name: "strptr", scope: !1231, file: !3, line: 373, type: !53)
!1239 = !DILocalVariable(name: "newstr", scope: !1231, file: !3, line: 373, type: !53)
!1240 = !DILocalVariable(name: "nextstr", scope: !1231, file: !3, line: 373, type: !53)
!1241 = !DILocalVariable(name: "newmol", scope: !1231, file: !3, line: 374, type: !232)
!1242 = !DILocation(line: 0, scope: !1231)
!1243 = !DILocation(line: 376, column: 9, scope: !1231)
!1244 = !DILocation(line: 378, column: 39, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1231, file: !3, line: 378, column: 12)
!1246 = !DILocation(line: 378, column: 23, scope: !1245)
!1247 = !DILocation(line: 378, column: 72, scope: !1245)
!1248 = !DILocation(line: 378, column: 12, scope: !1231)
!1249 = !DILocation(line: 379, column: 17, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1245, file: !3, line: 378, column: 80)
!1251 = !DILocation(line: 380, column: 17, scope: !1250)
!1252 = !DILocation(line: 381, column: 17, scope: !1250)
!1253 = !DILocation(line: 384, column: 35, scope: !1231)
!1254 = !{!1255, !391, i64 96}
!1255 = !{!"molecule_t", !381, i64 0, !391, i64 96, !380, i64 104, !391, i64 112, !391, i64 116, !391, i64 120, !380, i64 128}
!1256 = !DILocation(line: 384, column: 17, scope: !1231)
!1257 = !DILocation(line: 384, column: 28, scope: !1231)
!1258 = !DILocation(line: 385, column: 36, scope: !1231)
!1259 = !{!1255, !391, i64 112}
!1260 = !DILocation(line: 385, column: 17, scope: !1231)
!1261 = !DILocation(line: 385, column: 29, scope: !1231)
!1262 = !DILocation(line: 386, column: 33, scope: !1231)
!1263 = !{!1255, !391, i64 116}
!1264 = !DILocation(line: 386, column: 17, scope: !1231)
!1265 = !DILocation(line: 386, column: 26, scope: !1231)
!1266 = !DILocation(line: 387, column: 33, scope: !1231)
!1267 = !{!1255, !391, i64 120}
!1268 = !DILocation(line: 387, column: 17, scope: !1231)
!1269 = !DILocation(line: 387, column: 26, scope: !1231)
!1270 = !DILocation(line: 389, column: 19, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1231, file: !3, line: 389, column: 14)
!1272 = !{!1255, !380, i64 128}
!1273 = !DILocation(line: 389, column: 25, scope: !1271)
!1274 = !DILocation(line: 389, column: 14, scope: !1231)
!1275 = !DILocation(line: 390, column: 48, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1271, file: !3, line: 389, column: 35)
!1277 = !DILocation(line: 390, column: 33, scope: !1276)
!1278 = !DILocation(line: 390, column: 25, scope: !1276)
!1279 = !DILocation(line: 390, column: 31, scope: !1276)
!1280 = !DILocation(line: 391, column: 9, scope: !1276)
!1281 = !DILocation(line: 393, column: 25, scope: !1271)
!1282 = !DILocation(line: 393, column: 31, scope: !1271)
!1283 = !DILocation(line: 395, column: 9, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1231, file: !3, line: 395, column: 9)
!1285 = !DILocation(line: 396, column: 17, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1287, file: !3, line: 396, column: 17)
!1287 = distinct !DILexicalBlock(scope: !1288, file: !3, line: 395, column: 42)
!1288 = distinct !DILexicalBlock(scope: !1284, file: !3, line: 395, column: 9)
!1289 = !DILocation(line: 397, column: 58, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1291, file: !3, line: 396, column: 50)
!1291 = distinct !DILexicalBlock(scope: !1286, file: !3, line: 396, column: 17)
!1292 = !DILocation(line: 397, column: 53, scope: !1290)
!1293 = !DILocation(line: 397, column: 33, scope: !1290)
!1294 = !DILocation(line: 397, column: 25, scope: !1290)
!1295 = !DILocation(line: 397, column: 51, scope: !1290)
!1296 = !DILocation(line: 398, column: 17, scope: !1290)
!1297 = !DILocation(line: 396, column: 45, scope: !1291)
!1298 = !DILocation(line: 396, column: 36, scope: !1291)
!1299 = distinct !{!1299, !1285, !1300}
!1300 = !DILocation(line: 398, column: 17, scope: !1286)
!1301 = !DILocation(line: 399, column: 9, scope: !1287)
!1302 = !DILocation(line: 395, column: 37, scope: !1288)
!1303 = !DILocation(line: 395, column: 28, scope: !1288)
!1304 = distinct !{!1304, !1283, !1305}
!1305 = !DILocation(line: 399, column: 9, scope: !1284)
!1306 = !DILocation(line: 401, column: 23, scope: !1231)
!1307 = !{!1255, !380, i64 104}
!1308 = !DILocation(line: 402, column: 21, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1231, file: !3, line: 402, column: 14)
!1310 = !DILocation(line: 402, column: 14, scope: !1231)
!1311 = !DILocation(line: 403, column: 26, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1309, file: !3, line: 402, column: 30)
!1313 = !DILocation(line: 404, column: 25, scope: !1312)
!1314 = !DILocation(line: 404, column: 36, scope: !1312)
!1315 = !DILocation(line: 405, column: 25, scope: !1312)
!1316 = !DILocation(line: 405, column: 35, scope: !1312)
!1317 = !DILocation(line: 406, column: 34, scope: !1312)
!1318 = !DILocation(line: 407, column: 9, scope: !1312)
!1319 = !DILocation(line: 409, column: 24, scope: !1231)
!1320 = !DILocation(line: 409, column: 9, scope: !1231)
!1321 = !DILocation(line: 410, column: 27, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1231, file: !3, line: 409, column: 34)
!1323 = !DILocation(line: 411, column: 22, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1322, file: !3, line: 411, column: 22)
!1325 = !DILocation(line: 411, column: 22, scope: !1322)
!1326 = !DILocation(line: 412, column: 33, scope: !1324)
!1327 = !DILocation(line: 412, column: 40, scope: !1324)
!1328 = !DILocation(line: 412, column: 25, scope: !1324)
!1329 = !DILocation(line: 413, column: 26, scope: !1322)
!1330 = !DILocation(line: 413, column: 37, scope: !1322)
!1331 = !DILocation(line: 415, column: 34, scope: !1322)
!1332 = distinct !{!1332, !1320, !1333}
!1333 = !DILocation(line: 416, column: 9, scope: !1231)
!1334 = !DILocation(line: 418, column: 9, scope: !1231)
!1335 = !DILocation(line: 419, column: 9, scope: !1231)
!1336 = !DILocation(line: 420, column: 1, scope: !1231)
!1337 = distinct !DISubprogram(name: "read_reslib_header", scope: !3, file: !3, line: 492, type: !1338, scopeLine: 494, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1341)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!298, !12, !1340, !1340, !1340, !1340, !12}
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!1341 = !{!1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1357, !1358, !1362, !1363, !1364}
!1342 = !DILocalVariable(name: "reslib", arg: 1, scope: !1337, file: !3, line: 492, type: !12)
!1343 = !DILocalVariable(name: "pfp", arg: 2, scope: !1337, file: !3, line: 493, type: !1340)
!1344 = !DILocalVariable(name: "bfp", arg: 3, scope: !1337, file: !3, line: 493, type: !1340)
!1345 = !DILocalVariable(name: "qfp", arg: 4, scope: !1337, file: !3, line: 493, type: !1340)
!1346 = !DILocalVariable(name: "cfp", arg: 5, scope: !1337, file: !3, line: 493, type: !1340)
!1347 = !DILocalVariable(name: "offname", arg: 6, scope: !1337, file: !3, line: 493, type: !12)
!1348 = !DILocalVariable(name: "rfp", scope: !1337, file: !3, line: 495, type: !445)
!1349 = !DILocalVariable(name: "rlp", scope: !1337, file: !3, line: 496, type: !298)
!1350 = !DILocalVariable(name: "nw", scope: !1337, file: !3, line: 497, type: !11)
!1351 = !DILocalVariable(name: "nsize", scope: !1337, file: !3, line: 497, type: !11)
!1352 = !DILocalVariable(name: "np", scope: !1337, file: !3, line: 498, type: !12)
!1353 = !DILocalVariable(name: "line", scope: !1337, file: !3, line: 499, type: !1354)
!1354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024, elements: !1355)
!1355 = !{!1356}
!1356 = !DISubrange(count: 128)
!1357 = !DILocalVariable(name: "keyword", scope: !1337, file: !3, line: 499, type: !295)
!1358 = !DILocalVariable(name: "value", scope: !1337, file: !3, line: 499, type: !1359)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 800, elements: !1360)
!1360 = !{!1361}
!1361 = !DISubrange(count: 100)
!1362 = !DILocalVariable(name: "newname", scope: !1337, file: !3, line: 499, type: !1359)
!1363 = !DILocalVariable(name: "fname", scope: !1337, file: !3, line: 500, type: !352)
!1364 = !DILabel(scope: !1337, name: "clean_up", file: !3, line: 621)
!1365 = !DILocation(line: 0, scope: !1337)
!1366 = !DILocation(line: 499, column: 2, scope: !1337)
!1367 = !DILocation(line: 499, column: 7, scope: !1337)
