; ModuleID = 'reslib.ll'
source_filename = "reslib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.reslib_t = type { %struct.reslib_t*, i8*, i32, i32, %struct.residue_t* }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "e_msg", scope: !2, file: !3, line: 46, type: !352, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !319, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "reslib.c", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!4 = !{}
!5 = !{!6, !7, !14, !169, !201, !228, !183, !190, !12, !53, !168, !229, !232, !234, !238, !298, !308, !311, !104, !315}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DISubprogram(name: "rt_errormsg_s", scope: !8, file: !8, line: 2, type: !9, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!8 = !DIFile(filename: "./traceback.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11, !12, !12}
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DISubprogram(name: "copyresidue", scope: !3, file: !3, line: 54, type: !15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !19, line: 63, size: 1024, elements: !20)
!19 = !DIFile(filename: "./nabtypes.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!20 = !{!21, !22, !24, !25, !26, !29, !30, !31, !32, !33, !171, !181, !182, !188, !189, !198, !199, !200}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !18, file: !19, line: 64, baseType: !17, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !18, file: !19, line: 65, baseType: !23, size: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !19, line: 6, baseType: !11)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !18, file: !19, line: 66, baseType: !23, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !18, file: !19, line: 67, baseType: !23, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !18, file: !19, line: 68, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !19, line: 17, baseType: !13)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !18, file: !19, line: 69, baseType: !27, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !18, file: !19, line: 70, baseType: !23, size: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !18, file: !19, line: 71, baseType: !23, size: 32, offset: 352)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !18, file: !19, line: 72, baseType: !23, size: 32, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !18, file: !19, line: 73, baseType: !34, size: 64, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !19, line: 84, size: 384, elements: !36)
!36 = !{!37, !38, !39, !40, !164, !165, !166, !167}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !35, file: !19, line: 85, baseType: !27, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !35, file: !19, line: 86, baseType: !23, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !35, file: !19, line: 87, baseType: !23, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !35, file: !19, line: 88, baseType: !41, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !19, line: 118, size: 1088, elements: !43)
!43 = !{!44, !51, !52, !55, !56, !57, !58}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !42, file: !19, line: 119, baseType: !45, size: 768)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !19, line: 13, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 768, elements: !48)
!47 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!48 = !{!49, !50}
!49 = !DISubrange(count: 4)
!50 = !DISubrange(count: 3)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !42, file: !19, line: 120, baseType: !23, size: 32, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !42, file: !19, line: 121, baseType: !53, size: 64, offset: 832)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !19, line: 93, baseType: !35)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !42, file: !19, line: 122, baseType: !23, size: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !42, file: !19, line: 123, baseType: !23, size: 32, offset: 928)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !42, file: !19, line: 124, baseType: !23, size: 32, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !42, file: !19, line: 125, baseType: !59, size: 64, offset: 1024)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !19, line: 115, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !19, line: 95, size: 5760, elements: !62)
!62 = !{!63, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !123, !124, !125, !126, !127, !128, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !61, file: !19, line: 96, baseType: !64, size: 648)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 648, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 81)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !61, file: !19, line: 97, baseType: !23, size: 32, offset: 672)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !61, file: !19, line: 97, baseType: !23, size: 32, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !61, file: !19, line: 97, baseType: !23, size: 32, offset: 736)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 800)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 864)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !61, file: !19, line: 98, baseType: !23, size: 32, offset: 928)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 992)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 1024)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 1056)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !61, file: !19, line: 99, baseType: !23, size: 32, offset: 1120)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1184)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1216)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1248)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !61, file: !19, line: 100, baseType: !23, size: 32, offset: 1312)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1344)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1376)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1440)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1504)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1536)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !61, file: !19, line: 101, baseType: !23, size: 32, offset: 1568)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !61, file: !19, line: 102, baseType: !23, size: 32, offset: 1600)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !61, file: !19, line: 102, baseType: !23, size: 32, offset: 1632)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !61, file: !19, line: 102, baseType: !23, size: 32, offset: 1664)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !61, file: !19, line: 103, baseType: !27, size: 64, offset: 1728)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !61, file: !19, line: 103, baseType: !27, size: 64, offset: 1792)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !61, file: !19, line: 103, baseType: !27, size: 64, offset: 1856)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !61, file: !19, line: 103, baseType: !27, size: 64, offset: 1920)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 1984)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2048)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2112)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2176)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2240)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2304)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2368)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2432)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !61, file: !19, line: 104, baseType: !104, size: 64, offset: 2496)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2560)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2624)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2688)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2752)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2816)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2880)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !61, file: !19, line: 105, baseType: !104, size: 64, offset: 2944)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !61, file: !19, line: 106, baseType: !121, size: 192, offset: 3008)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 192, elements: !122)
!122 = !{!50}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3200)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3264)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3328)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3392)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !61, file: !19, line: 106, baseType: !47, size: 64, offset: 3456)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3520)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3584)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3648)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3712)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3776)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !61, file: !19, line: 107, baseType: !129, size: 64, offset: 3840)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 3904)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 3968)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 4032)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 4096)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 4160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !61, file: !19, line: 108, baseType: !129, size: 64, offset: 4224)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4352)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4416)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4480)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !61, file: !19, line: 109, baseType: !129, size: 64, offset: 4544)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4608)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4672)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4736)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4800)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !61, file: !19, line: 110, baseType: !129, size: 64, offset: 4864)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 4928)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 4992)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 5056)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 5120)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 5184)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !61, file: !19, line: 111, baseType: !129, size: 64, offset: 5248)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !61, file: !19, line: 112, baseType: !129, size: 64, offset: 5312)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !61, file: !19, line: 112, baseType: !129, size: 64, offset: 5376)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !61, file: !19, line: 112, baseType: !129, size: 64, offset: 5440)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !61, file: !19, line: 112, baseType: !129, size: 64, offset: 5504)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !61, file: !19, line: 113, baseType: !129, size: 64, offset: 5568)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !61, file: !19, line: 113, baseType: !129, size: 64, offset: 5632)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !61, file: !19, line: 114, baseType: !104, size: 64, offset: 5696)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !35, file: !19, line: 89, baseType: !34, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !35, file: !19, line: 90, baseType: !23, size: 32, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !35, file: !19, line: 91, baseType: !23, size: 32, offset: 288)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !35, file: !19, line: 92, baseType: !168, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !19, line: 82, baseType: !18)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !18, file: !19, line: 74, baseType: !172, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !19, line: 52, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !19, line: 47, size: 192, elements: !175)
!175 = !{!176, !178, !179, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !174, file: !19, line: 48, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !174, file: !19, line: 49, baseType: !23, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !174, file: !19, line: 50, baseType: !23, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !174, file: !19, line: 51, baseType: !23, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !18, file: !19, line: 75, baseType: !23, size: 32, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !18, file: !19, line: 76, baseType: !183, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !19, line: 54, baseType: !185)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 2)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !18, file: !19, line: 77, baseType: !23, size: 32, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !18, file: !19, line: 78, baseType: !190, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !19, line: 61, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !19, line: 58, size: 192, elements: !193)
!193 = !{!194, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !192, file: !19, line: 59, baseType: !195, size: 128)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !196)
!196 = !{!49}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !192, file: !19, line: 60, baseType: !47, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !18, file: !19, line: 79, baseType: !23, size: 32, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !18, file: !19, line: 80, baseType: !129, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !18, file: !19, line: 81, baseType: !201, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !19, line: 45, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !19, line: 25, size: 1408, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !227}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !203, file: !19, line: 26, baseType: !27, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !203, file: !19, line: 27, baseType: !27, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !203, file: !19, line: 28, baseType: !23, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !203, file: !19, line: 29, baseType: !23, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !203, file: !19, line: 30, baseType: !210, size: 256, offset: 192)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 256, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 8)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !203, file: !19, line: 31, baseType: !17, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !203, file: !19, line: 32, baseType: !47, size: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !203, file: !19, line: 33, baseType: !47, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !203, file: !19, line: 34, baseType: !47, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !203, file: !19, line: 35, baseType: !47, size: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !203, file: !19, line: 36, baseType: !27, size: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !203, file: !19, line: 37, baseType: !23, size: 32, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !203, file: !19, line: 38, baseType: !47, size: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !203, file: !19, line: 39, baseType: !47, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !203, file: !19, line: 40, baseType: !23, size: 32, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !203, file: !19, line: 41, baseType: !23, size: 32, offset: 1056)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !203, file: !19, line: 42, baseType: !27, size: 64, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !203, file: !19, line: 43, baseType: !226, size: 192, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !19, line: 12, baseType: !121)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !203, file: !19, line: 44, baseType: !47, size: 64, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!229 = !DISubprogram(name: "upd_molnumbers", scope: !3, file: !3, line: 16, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !41}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !19, line: 126, baseType: !42)
!234 = !DISubprogram(name: "copyparm", scope: !3, file: !3, line: 53, type: !235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!238 = !DISubprogram(name: "fclose", scope: !239, file: !239, line: 213, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!239 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!240 = !DISubroutineType(types: !241)
!241 = !{!11, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !244, line: 49, size: 1728, elements: !245)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !261, !262, !263, !264, !268, !270, !272, !276, !279, !281, !284, !287, !288, !289, !293, !294}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !243, file: !244, line: 51, baseType: !11, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !243, file: !244, line: 54, baseType: !12, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !243, file: !244, line: 55, baseType: !12, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !243, file: !244, line: 56, baseType: !12, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !243, file: !244, line: 57, baseType: !12, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !243, file: !244, line: 58, baseType: !12, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !243, file: !244, line: 59, baseType: !12, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !243, file: !244, line: 60, baseType: !12, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !243, file: !244, line: 61, baseType: !12, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !243, file: !244, line: 64, baseType: !12, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !243, file: !244, line: 65, baseType: !12, size: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !243, file: !244, line: 66, baseType: !12, size: 64, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !243, file: !244, line: 68, baseType: !259, size: 64, offset: 768)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !244, line: 36, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !243, file: !244, line: 70, baseType: !242, size: 64, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !243, file: !244, line: 72, baseType: !11, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !243, file: !244, line: 73, baseType: !11, size: 32, offset: 928)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !243, file: !244, line: 74, baseType: !265, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !266, line: 152, baseType: !267)
!266 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!267 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !243, file: !244, line: 77, baseType: !269, size: 16, offset: 1024)
!269 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !243, file: !244, line: 78, baseType: !271, size: 8, offset: 1040)
!271 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !243, file: !244, line: 79, baseType: !273, size: 8, offset: 1048)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 1)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !243, file: !244, line: 81, baseType: !277, size: 64, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !244, line: 43, baseType: null)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !243, file: !244, line: 89, baseType: !280, size: 64, offset: 1152)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !266, line: 153, baseType: !267)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !243, file: !244, line: 91, baseType: !282, size: 64, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !244, line: 37, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !243, file: !244, line: 92, baseType: !285, size: 64, offset: 1280)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !244, line: 38, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !243, file: !244, line: 93, baseType: !242, size: 64, offset: 1344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !243, file: !244, line: 94, baseType: !6, size: 64, offset: 1408)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !243, file: !244, line: 95, baseType: !290, size: 64, offset: 1472)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !291, line: 46, baseType: !292)
!291 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!292 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !243, file: !244, line: 96, baseType: !11, size: 32, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !243, file: !244, line: 98, baseType: !295, size: 160, offset: 1568)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 20)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESLIB_T", file: !3, line: 26, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reslib_t", file: !3, line: 20, size: 256, elements: !301)
!301 = !{!302, !304, !305, !306, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rl_next", scope: !300, file: !3, line: 21, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "rl_name", scope: !300, file: !3, line: 22, baseType: !12, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rl_r_kind", scope: !300, file: !3, line: 23, baseType: !11, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rl_r_atomkind", scope: !300, file: !3, line: 24, baseType: !11, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rl_rlist", scope: !300, file: !3, line: 25, baseType: !169, size: 64, offset: 192)
!308 = !DISubprogram(name: "fgets", scope: !239, file: !239, line: 564, type: !309, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!309 = !DISubroutineType(types: !310)
!310 = !{!12, !12, !11, !242}
!311 = !DISubprogram(name: "NAB_initatom", scope: !3, file: !3, line: 48, type: !312, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !314, !11}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!315 = !DISubprogram(name: "chirvol", scope: !316, file: !316, line: 1, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!316 = !DIFile(filename: "./chirvol.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!317 = !DISubroutineType(types: !318)
!318 = !{null, !11, !11, !11, !11, !11, !104, !104, !104}
!319 = !{!0, !320, !322, !330, !335, !337, !340, !342, !345, !347}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "reslibs", scope: !2, file: !3, line: 44, type: !298, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "init", scope: !324, file: !3, line: 474, type: !11, isLocal: true, isDefinition: true)
!324 = distinct !DISubprogram(name: "initatoms", scope: !3, file: !3, line: 472, type: !325, scopeLine: 473, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !327)
!325 = !DISubroutineType(types: !326)
!326 = !{null}
!327 = !{!328, !329}
!328 = !DILocalVariable(name: "i", scope: !324, file: !3, line: 475, type: !11)
!329 = !DILocalVariable(name: "ap", scope: !324, file: !3, line: 476, type: !201)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "atoms", scope: !2, file: !3, line: 34, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 1408000, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 1000)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "n_atoms", scope: !2, file: !3, line: 33, type: !11, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "lr_name", scope: !2, file: !3, line: 32, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !211)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "n_bonds", scope: !2, file: !3, line: 37, type: !11, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "bonds", scope: !2, file: !3, line: 38, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64000, elements: !333)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "n_chi", scope: !2, file: !3, line: 41, type: !11, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "chi", scope: !2, file: !3, line: 42, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 96000, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 500)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2048, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 256)
!355 = !{i32 7, !"Dwarf Version", i32 4}
!356 = !{i32 2, !"Debug Info Version", i32 3}
!357 = !{i32 1, !"wchar_size", i32 4}
!358 = !{!"clang version 10.0.0-4ubuntu1 "}
!359 = distinct !DISubprogram(name: "getreslibkind", scope: !3, file: !3, line: 78, type: !360, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !362)
!360 = !DISubroutineType(types: !361)
!361 = !{!12, !12}
!362 = !{!363, !364, !365}
!363 = !DILocalVariable(name: "reslib", arg: 1, scope: !359, file: !3, line: 78, type: !12)
!364 = !DILocalVariable(name: "nhp", scope: !359, file: !3, line: 80, type: !12)
!365 = !DILocalVariable(name: "rlp", scope: !359, file: !3, line: 81, type: !298)
!366 = !DILocation(line: 0, scope: !359)
!367 = !DILocation(line: 80, column: 8, scope: !359)
!368 = !DILocation(line: 83, column: 14, scope: !369)
!369 = distinct !DILexicalBlock(scope: !359, file: !3, line: 83, column: 6)
!370 = !DILocation(line: 83, column: 39, scope: !369)
!371 = !DILocation(line: 83, column: 6, scope: !359)
!372 = !DILocation(line: 84, column: 15, scope: !373)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 84, column: 7)
!374 = distinct !DILexicalBlock(scope: !369, file: !3, line: 83, column: 48)
!375 = !DILocation(line: 84, column: 39, scope: !373)
!376 = !DILocation(line: 84, column: 7, scope: !374)
!377 = !DILocation(line: 85, column: 13, scope: !378)
!378 = distinct !DILexicalBlock(scope: !373, file: !3, line: 84, column: 48)
!379 = !{!380, !380, i64 0}
!380 = !{!"any pointer", !381, i64 0}
!381 = !{!"omnipotent char", !382, i64 0}
!382 = !{!"Simple C/C++ TBAA"}
!383 = !DILocation(line: 85, column: 4, scope: !378)
!384 = !DILocation(line: 87, column: 4, scope: !378)
!385 = !DILocation(line: 0, scope: !369)
!386 = !DILocation(line: 90, column: 11, scope: !387)
!387 = distinct !DILexicalBlock(scope: !359, file: !3, line: 90, column: 6)
!388 = !{!389, !390, i64 16}
!389 = !{!"reslib_t", !380, i64 0, !380, i64 8, !390, i64 16, !390, i64 20, !380, i64 24}
!390 = !{!"int", !381, i64 0}
!391 = !DILocation(line: 90, column: 21, scope: !387)
!392 = !DILocation(line: 90, column: 6, scope: !359)
!393 = !DILocation(line: 92, column: 16, scope: !394)
!394 = distinct !DILexicalBlock(scope: !387, file: !3, line: 92, column: 11)
!395 = !DILocation(line: 92, column: 26, scope: !394)
!396 = !DILocation(line: 92, column: 11, scope: !387)
!397 = !DILocation(line: 94, column: 16, scope: !398)
!398 = distinct !DILexicalBlock(scope: !394, file: !3, line: 94, column: 11)
!399 = !DILocation(line: 94, column: 26, scope: !398)
!400 = !DILocation(line: 94, column: 11, scope: !394)
!401 = !DILocation(line: 96, column: 16, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !3, line: 96, column: 11)
!403 = !DILocation(line: 96, column: 26, scope: !402)
!404 = !DILocation(line: 0, scope: !402)
!405 = !DILocation(line: 0, scope: !387)
!406 = !DILocation(line: 101, column: 1, scope: !359)
!407 = distinct !DISubprogram(name: "known_reslib", scope: !3, file: !3, line: 422, type: !408, scopeLine: 423, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{!298, !12}
!410 = !{!411, !412}
!411 = !DILocalVariable(name: "reslib", arg: 1, scope: !407, file: !3, line: 422, type: !12)
!412 = !DILocalVariable(name: "rlp", scope: !407, file: !3, line: 424, type: !298)
!413 = !DILocation(line: 0, scope: !407)
!414 = !DILocation(line: 426, column: 13, scope: !415)
!415 = distinct !DILexicalBlock(scope: !407, file: !3, line: 426, column: 2)
!416 = !DILocation(line: 426, column: 2, scope: !415)
!417 = !DILocation(line: 427, column: 20, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !3, line: 427, column: 7)
!419 = distinct !DILexicalBlock(scope: !420, file: !3, line: 426, column: 47)
!420 = distinct !DILexicalBlock(scope: !415, file: !3, line: 426, column: 2)
!421 = !{!389, !380, i64 8}
!422 = !DILocation(line: 427, column: 7, scope: !418)
!423 = !DILocation(line: 427, column: 38, scope: !418)
!424 = !DILocation(line: 427, column: 7, scope: !419)
!425 = !DILocation(line: 426, column: 38, scope: !420)
!426 = !{!389, !380, i64 0}
!427 = distinct !{!427, !416, !428}
!428 = !DILocation(line: 430, column: 2, scope: !415)
!429 = !DILocation(line: 432, column: 1, scope: !407)
!430 = distinct !DISubprogram(name: "read_reslib", scope: !3, file: !3, line: 434, type: !408, scopeLine: 435, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !431)
!431 = !{!432, !433, !437, !438, !439, !440, !441}
!432 = !DILocalVariable(name: "reslib", arg: 1, scope: !430, file: !3, line: 434, type: !12)
!433 = !DILocalVariable(name: "pfp", scope: !430, file: !3, line: 436, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !436, line: 7, baseType: !243)
!436 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!437 = !DILocalVariable(name: "bfp", scope: !430, file: !3, line: 437, type: !434)
!438 = !DILocalVariable(name: "qfp", scope: !430, file: !3, line: 438, type: !434)
!439 = !DILocalVariable(name: "cfp", scope: !430, file: !3, line: 439, type: !434)
!440 = !DILocalVariable(name: "rlp", scope: !430, file: !3, line: 440, type: !298)
!441 = !DILocalVariable(name: "offname", scope: !430, file: !3, line: 441, type: !352)
!442 = !DILocation(line: 0, scope: !430)
!443 = !DILocation(line: 436, column: 2, scope: !430)
!444 = !DILocation(line: 437, column: 2, scope: !430)
!445 = !DILocation(line: 438, column: 2, scope: !430)
!446 = !DILocation(line: 439, column: 2, scope: !430)
!447 = !DILocation(line: 441, column: 2, scope: !430)
!448 = !DILocation(line: 441, column: 7, scope: !430)
!449 = !DILocation(line: 444, column: 3, scope: !450)
!450 = distinct !DILexicalBlock(scope: !430, file: !3, line: 443, column: 6)
!451 = !DILocation(line: 443, column: 14, scope: !450)
!452 = !DILocation(line: 444, column: 15, scope: !450)
!453 = !DILocation(line: 443, column: 6, scope: !430)
!454 = !DILocation(line: 449, column: 2, scope: !430)
!455 = !DILocation(line: 450, column: 7, scope: !456)
!456 = distinct !DILexicalBlock(scope: !430, file: !3, line: 450, column: 7)
!457 = !{!381, !381, i64 0}
!458 = !DILocation(line: 450, column: 7, scope: !430)
!459 = !DILocation(line: 451, column: 15, scope: !460)
!460 = distinct !DILexicalBlock(scope: !456, file: !3, line: 450, column: 17)
!461 = !DILocation(line: 451, column: 3, scope: !460)
!462 = !DILocation(line: 452, column: 2, scope: !460)
!463 = !DILocation(line: 453, column: 15, scope: !464)
!464 = distinct !DILexicalBlock(scope: !456, file: !3, line: 452, column: 7)
!465 = !DILocation(line: 453, column: 3, scope: !464)
!466 = !DILocation(line: 454, column: 15, scope: !464)
!467 = !DILocation(line: 454, column: 3, scope: !464)
!468 = !DILocation(line: 455, column: 11, scope: !464)
!469 = !DILocation(line: 455, column: 3, scope: !464)
!470 = !DILocation(line: 456, column: 11, scope: !464)
!471 = !DILocation(line: 456, column: 3, scope: !464)
!472 = !DILocation(line: 459, column: 6, scope: !473)
!473 = distinct !DILexicalBlock(scope: !430, file: !3, line: 459, column: 6)
!474 = !DILocation(line: 459, column: 6, scope: !430)
!475 = !DILocation(line: 460, column: 14, scope: !476)
!476 = distinct !DILexicalBlock(scope: !473, file: !3, line: 459, column: 11)
!477 = !DILocation(line: 460, column: 3, scope: !476)
!478 = !DILocation(line: 461, column: 11, scope: !476)
!479 = !DILocation(line: 461, column: 3, scope: !476)
!480 = !DILocation(line: 462, column: 2, scope: !476)
!481 = !DILocation(line: 464, column: 6, scope: !482)
!482 = distinct !DILexicalBlock(scope: !430, file: !3, line: 464, column: 6)
!483 = !DILocation(line: 464, column: 6, scope: !430)
!484 = !DILocation(line: 465, column: 15, scope: !485)
!485 = distinct !DILexicalBlock(scope: !482, file: !3, line: 464, column: 11)
!486 = !DILocation(line: 465, column: 3, scope: !485)
!487 = !DILocation(line: 466, column: 11, scope: !485)
!488 = !DILocation(line: 466, column: 3, scope: !485)
!489 = !DILocation(line: 467, column: 2, scope: !485)
!490 = !DILocation(line: 470, column: 1, scope: !430)
!491 = distinct !DISubprogram(name: "setreslibkind", scope: !3, file: !3, line: 103, type: !492, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !494)
!492 = !DISubroutineType(types: !493)
!493 = !{!11, !12, !12}
!494 = !{!495, !496, !497, !498}
!495 = !DILocalVariable(name: "reslib", arg: 1, scope: !491, file: !3, line: 103, type: !12)
!496 = !DILocalVariable(name: "kind", arg: 2, scope: !491, file: !3, line: 103, type: !12)
!497 = !DILocalVariable(name: "nhp", scope: !491, file: !3, line: 105, type: !12)
!498 = !DILocalVariable(name: "rlp", scope: !491, file: !3, line: 106, type: !298)
!499 = !DILocation(line: 0, scope: !491)
!500 = !DILocation(line: 105, column: 8, scope: !491)
!501 = !DILocation(line: 108, column: 14, scope: !502)
!502 = distinct !DILexicalBlock(scope: !491, file: !3, line: 108, column: 6)
!503 = !DILocation(line: 108, column: 39, scope: !502)
!504 = !DILocation(line: 108, column: 6, scope: !491)
!505 = !DILocation(line: 109, column: 16, scope: !506)
!506 = distinct !DILexicalBlock(scope: !507, file: !3, line: 109, column: 8)
!507 = distinct !DILexicalBlock(scope: !502, file: !3, line: 108, column: 48)
!508 = !DILocation(line: 109, column: 40, scope: !506)
!509 = !DILocation(line: 109, column: 8, scope: !507)
!510 = !DILocation(line: 110, column: 15, scope: !511)
!511 = distinct !DILexicalBlock(scope: !506, file: !3, line: 109, column: 49)
!512 = !DILocation(line: 110, column: 6, scope: !511)
!513 = !DILocation(line: 112, column: 6, scope: !511)
!514 = !DILocation(line: 0, scope: !502)
!515 = !DILocation(line: 115, column: 7, scope: !491)
!516 = !DILocation(line: 115, column: 17, scope: !491)
!517 = !DILocation(line: 116, column: 8, scope: !518)
!518 = distinct !DILexicalBlock(scope: !491, file: !3, line: 116, column: 7)
!519 = !DILocation(line: 116, column: 30, scope: !518)
!520 = !DILocation(line: 116, column: 34, scope: !518)
!521 = !DILocation(line: 116, column: 7, scope: !491)
!522 = !DILocation(line: 117, column: 15, scope: !518)
!523 = !DILocation(line: 117, column: 25, scope: !518)
!524 = !DILocation(line: 117, column: 10, scope: !518)
!525 = !DILocation(line: 118, column: 13, scope: !526)
!526 = distinct !DILexicalBlock(scope: !518, file: !3, line: 118, column: 12)
!527 = !DILocation(line: 118, column: 35, scope: !526)
!528 = !DILocation(line: 118, column: 39, scope: !526)
!529 = !DILocation(line: 118, column: 12, scope: !518)
!530 = !DILocation(line: 119, column: 15, scope: !526)
!531 = !DILocation(line: 119, column: 25, scope: !526)
!532 = !DILocation(line: 119, column: 10, scope: !526)
!533 = !DILocation(line: 120, column: 13, scope: !534)
!534 = distinct !DILexicalBlock(scope: !526, file: !3, line: 120, column: 12)
!535 = !DILocation(line: 120, column: 34, scope: !534)
!536 = !DILocation(line: 120, column: 38, scope: !534)
!537 = !DILocation(line: 120, column: 12, scope: !526)
!538 = !DILocation(line: 121, column: 15, scope: !534)
!539 = !DILocation(line: 121, column: 25, scope: !534)
!540 = !DILocation(line: 121, column: 10, scope: !534)
!541 = !DILocation(line: 123, column: 22, scope: !491)
!542 = !DILocation(line: 123, column: 9, scope: !491)
!543 = distinct !DISubprogram(name: "getresidue", scope: !3, file: !3, line: 126, type: !544, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!169, !12, !12}
!546 = !{!547, !548, !549, !550, !554, !555, !556}
!547 = !DILocalVariable(name: "rname", arg: 1, scope: !543, file: !3, line: 126, type: !12)
!548 = !DILocalVariable(name: "reslib", arg: 2, scope: !543, file: !3, line: 126, type: !12)
!549 = !DILocalVariable(name: "nhp", scope: !543, file: !3, line: 128, type: !12)
!550 = !DILocalVariable(name: "leapname", scope: !543, file: !3, line: 128, type: !551)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 40, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 5)
!554 = !DILocalVariable(name: "rlp", scope: !543, file: !3, line: 129, type: !298)
!555 = !DILocalVariable(name: "res", scope: !543, file: !3, line: 130, type: !169)
!556 = !DILocalVariable(name: "nres", scope: !543, file: !3, line: 130, type: !169)
!557 = !DILocation(line: 0, scope: !543)
!558 = !DILocation(line: 128, column: 8, scope: !543)
!559 = !DILocation(line: 128, column: 2, scope: !543)
!560 = !DILocation(line: 128, column: 13, scope: !543)
!561 = !DILocation(line: 132, column: 14, scope: !562)
!562 = distinct !DILexicalBlock(scope: !543, file: !3, line: 132, column: 6)
!563 = !DILocation(line: 132, column: 39, scope: !562)
!564 = !DILocation(line: 132, column: 6, scope: !543)
!565 = !DILocation(line: 133, column: 15, scope: !566)
!566 = distinct !DILexicalBlock(scope: !567, file: !3, line: 133, column: 7)
!567 = distinct !DILexicalBlock(scope: !562, file: !3, line: 132, column: 48)
!568 = !DILocation(line: 133, column: 39, scope: !566)
!569 = !DILocation(line: 133, column: 7, scope: !567)
!570 = !DILocation(line: 134, column: 4, scope: !571)
!571 = distinct !DILexicalBlock(scope: !566, file: !3, line: 133, column: 48)
!572 = !DILocation(line: 0, scope: !562)
!573 = !DILocation(line: 138, column: 10, scope: !543)
!574 = !DILocation(line: 138, column: 2, scope: !543)
!575 = !DILocation(line: 139, column: 12, scope: !576)
!576 = distinct !DILexicalBlock(scope: !543, file: !3, line: 139, column: 7)
!577 = !DILocation(line: 139, column: 22, scope: !576)
!578 = !DILocation(line: 139, column: 7, scope: !543)
!579 = !DILocation(line: 140, column: 14, scope: !580)
!580 = distinct !DILexicalBlock(scope: !581, file: !3, line: 140, column: 13)
!581 = distinct !DILexicalBlock(scope: !576, file: !3, line: 139, column: 33)
!582 = !DILocation(line: 140, column: 13, scope: !581)
!583 = !DILocation(line: 141, column: 12, scope: !580)
!584 = !DILocation(line: 141, column: 4, scope: !580)
!585 = !DILocation(line: 142, column: 14, scope: !586)
!586 = distinct !DILexicalBlock(scope: !580, file: !3, line: 142, column: 13)
!587 = !DILocation(line: 142, column: 13, scope: !580)
!588 = !DILocation(line: 143, column: 12, scope: !586)
!589 = !DILocation(line: 143, column: 4, scope: !586)
!590 = !DILocation(line: 144, column: 14, scope: !591)
!591 = distinct !DILexicalBlock(scope: !586, file: !3, line: 144, column: 13)
!592 = !DILocation(line: 144, column: 13, scope: !586)
!593 = !DILocation(line: 145, column: 12, scope: !591)
!594 = !DILocation(line: 145, column: 4, scope: !591)
!595 = !DILocation(line: 146, column: 14, scope: !596)
!596 = distinct !DILexicalBlock(scope: !591, file: !3, line: 146, column: 13)
!597 = !DILocation(line: 146, column: 13, scope: !591)
!598 = !DILocation(line: 147, column: 12, scope: !596)
!599 = !DILocation(line: 147, column: 4, scope: !596)
!600 = !DILocation(line: 149, column: 17, scope: !601)
!601 = distinct !DILexicalBlock(scope: !576, file: !3, line: 149, column: 12)
!602 = !DILocation(line: 149, column: 27, scope: !601)
!603 = !DILocation(line: 149, column: 12, scope: !576)
!604 = !DILocation(line: 150, column: 14, scope: !605)
!605 = distinct !DILexicalBlock(scope: !606, file: !3, line: 150, column: 13)
!606 = distinct !DILexicalBlock(scope: !601, file: !3, line: 149, column: 38)
!607 = !DILocation(line: 150, column: 13, scope: !606)
!608 = !DILocation(line: 151, column: 12, scope: !605)
!609 = !DILocation(line: 151, column: 4, scope: !605)
!610 = !DILocation(line: 152, column: 14, scope: !611)
!611 = distinct !DILexicalBlock(scope: !605, file: !3, line: 152, column: 13)
!612 = !DILocation(line: 152, column: 13, scope: !605)
!613 = !DILocation(line: 153, column: 12, scope: !611)
!614 = !DILocation(line: 153, column: 4, scope: !611)
!615 = !DILocation(line: 154, column: 14, scope: !616)
!616 = distinct !DILexicalBlock(scope: !611, file: !3, line: 154, column: 13)
!617 = !DILocation(line: 154, column: 13, scope: !611)
!618 = !DILocation(line: 155, column: 12, scope: !616)
!619 = !DILocation(line: 155, column: 4, scope: !616)
!620 = !DILocation(line: 156, column: 14, scope: !621)
!621 = distinct !DILexicalBlock(scope: !616, file: !3, line: 156, column: 13)
!622 = !DILocation(line: 156, column: 13, scope: !616)
!623 = !DILocation(line: 157, column: 12, scope: !621)
!624 = !DILocation(line: 157, column: 4, scope: !621)
!625 = !DILocation(line: 159, column: 7, scope: !626)
!626 = distinct !DILexicalBlock(scope: !543, file: !3, line: 159, column: 7)
!627 = !DILocation(line: 159, column: 28, scope: !626)
!628 = !DILocation(line: 159, column: 7, scope: !543)
!629 = !DILocation(line: 160, column: 11, scope: !626)
!630 = !DILocation(line: 160, column: 3, scope: !626)
!631 = !DILocation(line: 161, column: 12, scope: !632)
!632 = distinct !DILexicalBlock(scope: !626, file: !3, line: 161, column: 12)
!633 = !DILocation(line: 161, column: 33, scope: !632)
!634 = !DILocation(line: 161, column: 12, scope: !626)
!635 = !DILocation(line: 162, column: 11, scope: !632)
!636 = !DILocation(line: 162, column: 3, scope: !632)
!637 = !DILocation(line: 163, column: 18, scope: !638)
!638 = distinct !DILexicalBlock(scope: !543, file: !3, line: 163, column: 2)
!639 = !{!389, !380, i64 24}
!640 = !DILocation(line: 163, column: 2, scope: !638)
!641 = !DILocation(line: 164, column: 21, scope: !642)
!642 = distinct !DILexicalBlock(scope: !643, file: !3, line: 164, column: 6)
!643 = distinct !DILexicalBlock(scope: !644, file: !3, line: 163, column: 53)
!644 = distinct !DILexicalBlock(scope: !638, file: !3, line: 163, column: 2)
!645 = !{!646, !380, i64 24}
!646 = !{!"residue_t", !380, i64 0, !390, i64 8, !390, i64 12, !390, i64 16, !380, i64 24, !380, i64 32, !390, i64 40, !390, i64 44, !390, i64 48, !380, i64 56, !380, i64 64, !390, i64 72, !380, i64 80, !390, i64 88, !380, i64 96, !390, i64 104, !380, i64 112, !380, i64 120}
!647 = !DILocation(line: 164, column: 8, scope: !642)
!648 = !DILocation(line: 164, column: 40, scope: !642)
!649 = !DILocation(line: 164, column: 47, scope: !642)
!650 = !DILocation(line: 165, column: 19, scope: !642)
!651 = !DILocation(line: 165, column: 30, scope: !642)
!652 = !DILocation(line: 165, column: 6, scope: !642)
!653 = !DILocation(line: 165, column: 41, scope: !642)
!654 = !DILocation(line: 164, column: 6, scope: !643)
!655 = !DILocation(line: 163, column: 45, scope: !644)
!656 = !{!646, !380, i64 0}
!657 = distinct !{!657, !640, !658}
!658 = !DILocation(line: 167, column: 2, scope: !638)
!659 = !DILocation(line: 169, column: 10, scope: !660)
!660 = distinct !DILexicalBlock(scope: !543, file: !3, line: 169, column: 6)
!661 = !DILocation(line: 169, column: 6, scope: !543)
!662 = !DILocation(line: 170, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !660, file: !3, line: 169, column: 19)
!664 = !DILocation(line: 171, column: 3, scope: !663)
!665 = !DILocation(line: 172, column: 3, scope: !663)
!666 = !DILocation(line: 175, column: 9, scope: !543)
!667 = !DILocation(line: 177, column: 2, scope: !543)
!668 = !DILocation(line: 178, column: 1, scope: !543)
!669 = distinct !DISubprogram(name: "copyresidue", scope: !3, file: !3, line: 180, type: !670, scopeLine: 181, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !672)
!670 = !DISubroutineType(types: !671)
!671 = !{!169, !169}
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!673 = !DILocalVariable(name: "res", arg: 1, scope: !669, file: !3, line: 180, type: !169)
!674 = !DILocalVariable(name: "a", scope: !669, file: !3, line: 182, type: !11)
!675 = !DILocalVariable(name: "b", scope: !669, file: !3, line: 182, type: !11)
!676 = !DILocalVariable(name: "c", scope: !669, file: !3, line: 182, type: !11)
!677 = !DILocalVariable(name: "i", scope: !669, file: !3, line: 182, type: !11)
!678 = !DILocalVariable(name: "aip", scope: !669, file: !3, line: 183, type: !228)
!679 = !DILocalVariable(name: "nres", scope: !669, file: !3, line: 184, type: !169)
!680 = !DILocalVariable(name: "ap", scope: !669, file: !3, line: 185, type: !201)
!681 = !DILocalVariable(name: "anp", scope: !669, file: !3, line: 186, type: !12)
!682 = !DILocalVariable(name: "rnp", scope: !669, file: !3, line: 186, type: !12)
!683 = !DILocalVariable(name: "bp", scope: !669, file: !3, line: 187, type: !183)
!684 = !DILocalVariable(name: "cp", scope: !669, file: !3, line: 188, type: !190)
!685 = !DILocation(line: 0, scope: !669)
!686 = !DILocation(line: 190, column: 26, scope: !687)
!687 = distinct !DILexicalBlock(scope: !669, file: !3, line: 190, column: 5)
!688 = !DILocation(line: 190, column: 13, scope: !687)
!689 = !DILocation(line: 191, column: 3, scope: !687)
!690 = !DILocation(line: 190, column: 5, scope: !669)
!691 = !DILocation(line: 193, column: 42, scope: !692)
!692 = distinct !DILexicalBlock(scope: !687, file: !3, line: 192, column: 2)
!693 = !DILocation(line: 193, column: 3, scope: !692)
!694 = !DILocation(line: 194, column: 3, scope: !692)
!695 = !DILocation(line: 195, column: 3, scope: !692)
!696 = !DILocation(line: 198, column: 37, scope: !697)
!697 = distinct !DILexicalBlock(scope: !669, file: !3, line: 198, column: 6)
!698 = !{!646, !390, i64 104}
!699 = !DILocation(line: 198, column: 32, scope: !697)
!700 = !DILocation(line: 198, column: 45, scope: !697)
!701 = !DILocation(line: 198, column: 25, scope: !697)
!702 = !DILocation(line: 198, column: 13, scope: !697)
!703 = !DILocation(line: 199, column: 3, scope: !697)
!704 = !DILocation(line: 198, column: 6, scope: !669)
!705 = !DILocation(line: 201, column: 51, scope: !706)
!706 = distinct !DILexicalBlock(scope: !697, file: !3, line: 200, column: 2)
!707 = !DILocation(line: 201, column: 3, scope: !706)
!708 = !DILocation(line: 202, column: 3, scope: !706)
!709 = !DILocation(line: 203, column: 3, scope: !706)
!710 = !DILocation(line: 206, column: 35, scope: !711)
!711 = distinct !DILexicalBlock(scope: !669, file: !3, line: 206, column: 6)
!712 = !DILocation(line: 206, column: 30, scope: !711)
!713 = !DILocation(line: 206, column: 43, scope: !711)
!714 = !DILocation(line: 206, column: 23, scope: !711)
!715 = !DILocation(line: 206, column: 58, scope: !711)
!716 = !DILocation(line: 206, column: 6, scope: !669)
!717 = !DILocation(line: 209, column: 9, scope: !718)
!718 = distinct !DILexicalBlock(scope: !711, file: !3, line: 207, column: 2)
!719 = !DILocation(line: 208, column: 3, scope: !718)
!720 = !DILocation(line: 210, column: 3, scope: !718)
!721 = !DILocation(line: 211, column: 3, scope: !718)
!722 = !DILocation(line: 214, column: 11, scope: !723)
!723 = distinct !DILexicalBlock(scope: !669, file: !3, line: 214, column: 6)
!724 = !{!646, !390, i64 72}
!725 = !DILocation(line: 214, column: 23, scope: !723)
!726 = !DILocation(line: 214, column: 6, scope: !669)
!727 = !DILocation(line: 216, column: 16, scope: !728)
!728 = distinct !DILexicalBlock(scope: !729, file: !3, line: 215, column: 7)
!729 = distinct !DILexicalBlock(scope: !723, file: !3, line: 214, column: 28)
!730 = !DILocation(line: 216, column: 11, scope: !728)
!731 = !DILocation(line: 216, column: 27, scope: !728)
!732 = !DILocation(line: 216, column: 4, scope: !728)
!733 = !DILocation(line: 215, column: 14, scope: !728)
!734 = !DILocation(line: 217, column: 4, scope: !728)
!735 = !DILocation(line: 215, column: 7, scope: !729)
!736 = !DILocation(line: 220, column: 37, scope: !737)
!737 = distinct !DILexicalBlock(scope: !728, file: !3, line: 218, column: 3)
!738 = !DILocation(line: 219, column: 4, scope: !737)
!739 = !DILocation(line: 221, column: 4, scope: !737)
!740 = !DILocation(line: 222, column: 4, scope: !737)
!741 = !DILocation(line: 0, scope: !723)
!742 = !DILocation(line: 227, column: 11, scope: !743)
!743 = distinct !DILexicalBlock(scope: !669, file: !3, line: 227, column: 6)
!744 = !{!646, !390, i64 88}
!745 = !DILocation(line: 227, column: 21, scope: !743)
!746 = !DILocation(line: 227, column: 6, scope: !669)
!747 = !DILocation(line: 229, column: 16, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 228, column: 7)
!749 = distinct !DILexicalBlock(scope: !743, file: !3, line: 227, column: 26)
!750 = !DILocation(line: 229, column: 11, scope: !748)
!751 = !DILocation(line: 229, column: 25, scope: !748)
!752 = !DILocation(line: 229, column: 4, scope: !748)
!753 = !DILocation(line: 228, column: 14, scope: !748)
!754 = !DILocation(line: 230, column: 4, scope: !748)
!755 = !DILocation(line: 228, column: 7, scope: !749)
!756 = !DILocation(line: 233, column: 37, scope: !757)
!757 = distinct !DILexicalBlock(scope: !748, file: !3, line: 231, column: 3)
!758 = !DILocation(line: 232, column: 4, scope: !757)
!759 = !DILocation(line: 234, column: 4, scope: !757)
!760 = !DILocation(line: 235, column: 4, scope: !757)
!761 = !DILocation(line: 0, scope: !743)
!762 = !DILocation(line: 240, column: 8, scope: !669)
!763 = !DILocation(line: 240, column: 15, scope: !669)
!764 = !DILocation(line: 242, column: 37, scope: !669)
!765 = !DILocation(line: 242, column: 25, scope: !669)
!766 = !DILocation(line: 242, column: 47, scope: !669)
!767 = !DILocation(line: 242, column: 18, scope: !669)
!768 = !DILocation(line: 243, column: 10, scope: !769)
!769 = distinct !DILexicalBlock(scope: !669, file: !3, line: 243, column: 6)
!770 = !DILocation(line: 243, column: 6, scope: !669)
!771 = !DILocation(line: 244, column: 12, scope: !772)
!772 = distinct !DILexicalBlock(scope: !769, file: !3, line: 243, column: 19)
!773 = !DILocation(line: 244, column: 3, scope: !772)
!774 = !DILocation(line: 246, column: 3, scope: !772)
!775 = !DILocation(line: 248, column: 20, scope: !669)
!776 = !DILocation(line: 248, column: 2, scope: !669)
!777 = !DILocation(line: 249, column: 8, scope: !669)
!778 = !DILocation(line: 249, column: 18, scope: !669)
!779 = !DILocation(line: 251, column: 37, scope: !669)
!780 = !{!646, !380, i64 32}
!781 = !DILocation(line: 251, column: 25, scope: !669)
!782 = !DILocation(line: 251, column: 45, scope: !669)
!783 = !DILocation(line: 251, column: 18, scope: !669)
!784 = !DILocation(line: 252, column: 10, scope: !785)
!785 = distinct !DILexicalBlock(scope: !669, file: !3, line: 252, column: 6)
!786 = !DILocation(line: 252, column: 6, scope: !669)
!787 = !DILocation(line: 253, column: 12, scope: !788)
!788 = distinct !DILexicalBlock(scope: !785, file: !3, line: 252, column: 19)
!789 = !DILocation(line: 253, column: 3, scope: !788)
!790 = !DILocation(line: 254, column: 3, scope: !788)
!791 = !DILocation(line: 256, column: 20, scope: !669)
!792 = !DILocation(line: 256, column: 2, scope: !669)
!793 = !DILocation(line: 257, column: 8, scope: !669)
!794 = !DILocation(line: 257, column: 16, scope: !669)
!795 = !DILocation(line: 259, column: 21, scope: !669)
!796 = !{!646, !390, i64 8}
!797 = !DILocation(line: 259, column: 8, scope: !669)
!798 = !DILocation(line: 259, column: 14, scope: !669)
!799 = !DILocation(line: 260, column: 8, scope: !669)
!800 = !DILocation(line: 260, column: 18, scope: !669)
!801 = !{!646, !390, i64 12}
!802 = !DILocation(line: 261, column: 8, scope: !669)
!803 = !DILocation(line: 261, column: 17, scope: !669)
!804 = !{!646, !390, i64 16}
!805 = !DILocation(line: 262, column: 22, scope: !669)
!806 = !{!646, !390, i64 40}
!807 = !DILocation(line: 262, column: 8, scope: !669)
!808 = !DILocation(line: 262, column: 15, scope: !669)
!809 = !DILocation(line: 263, column: 8, scope: !669)
!810 = !DILocation(line: 263, column: 17, scope: !669)
!811 = !{!646, !380, i64 56}
!812 = !DILocation(line: 264, column: 21, scope: !669)
!813 = !DILocation(line: 264, column: 8, scope: !669)
!814 = !DILocation(line: 264, column: 19, scope: !669)
!815 = !{!646, !380, i64 64}
!816 = !DILocation(line: 265, column: 27, scope: !669)
!817 = !DILocation(line: 265, column: 8, scope: !669)
!818 = !DILocation(line: 265, column: 20, scope: !669)
!819 = !DILocation(line: 266, column: 8, scope: !669)
!820 = !DILocation(line: 266, column: 19, scope: !669)
!821 = !{!646, !380, i64 80}
!822 = !DILocation(line: 267, column: 23, scope: !823)
!823 = distinct !DILexicalBlock(scope: !824, file: !3, line: 267, column: 2)
!824 = distinct !DILexicalBlock(scope: !669, file: !3, line: 267, column: 2)
!825 = !DILocation(line: 267, column: 16, scope: !823)
!826 = !DILocation(line: 267, column: 2, scope: !824)
!827 = !DILocation(line: 268, column: 37, scope: !828)
!828 = distinct !DILexicalBlock(scope: !823, file: !3, line: 267, column: 41)
!829 = !DILocation(line: 268, column: 32, scope: !828)
!830 = !{!390, !390, i64 0}
!831 = !DILocation(line: 268, column: 9, scope: !828)
!832 = !DILocation(line: 268, column: 3, scope: !828)
!833 = !DILocation(line: 268, column: 30, scope: !828)
!834 = !DILocation(line: 269, column: 37, scope: !828)
!835 = !DILocation(line: 269, column: 32, scope: !828)
!836 = !DILocation(line: 269, column: 9, scope: !828)
!837 = !DILocation(line: 269, column: 3, scope: !828)
!838 = !DILocation(line: 269, column: 30, scope: !828)
!839 = !DILocation(line: 267, column: 37, scope: !823)
!840 = distinct !{!840, !826, !841}
!841 = !DILocation(line: 270, column: 2, scope: !824)
!842 = !DILocation(line: 271, column: 25, scope: !669)
!843 = !DILocation(line: 271, column: 8, scope: !669)
!844 = !DILocation(line: 271, column: 18, scope: !669)
!845 = !DILocation(line: 272, column: 8, scope: !669)
!846 = !DILocation(line: 272, column: 17, scope: !669)
!847 = !{!646, !380, i64 96}
!848 = !DILocation(line: 273, column: 44, scope: !849)
!849 = distinct !DILexicalBlock(scope: !850, file: !3, line: 273, column: 2)
!850 = distinct !DILexicalBlock(scope: !669, file: !3, line: 273, column: 2)
!851 = !DILocation(line: 273, column: 37, scope: !849)
!852 = !DILocation(line: 273, column: 2, scope: !850)
!853 = !DILocation(line: 274, column: 3, scope: !854)
!854 = distinct !DILexicalBlock(scope: !855, file: !3, line: 274, column: 3)
!855 = distinct !DILexicalBlock(scope: !849, file: !3, line: 273, column: 66)
!856 = !DILocation(line: 275, column: 27, scope: !857)
!857 = distinct !DILexicalBlock(scope: !854, file: !3, line: 274, column: 3)
!858 = !DILocation(line: 275, column: 22, scope: !857)
!859 = !DILocation(line: 275, column: 4, scope: !857)
!860 = !DILocation(line: 275, column: 20, scope: !857)
!861 = !DILocation(line: 274, column: 23, scope: !857)
!862 = !DILocation(line: 274, column: 17, scope: !857)
!863 = distinct !{!863, !853, !864}
!864 = !DILocation(line: 275, column: 51, scope: !854)
!865 = !DILocation(line: 276, column: 21, scope: !855)
!866 = !DILocation(line: 276, column: 35, scope: !855)
!867 = !{!868, !869, i64 16}
!868 = !{!"chiral_t", !381, i64 0, !869, i64 16}
!869 = !{!"double", !381, i64 0}
!870 = !DILocation(line: 276, column: 7, scope: !855)
!871 = !DILocation(line: 276, column: 14, scope: !855)
!872 = !DILocation(line: 273, column: 56, scope: !849)
!873 = !DILocation(line: 273, column: 62, scope: !849)
!874 = distinct !{!874, !852, !875}
!875 = !DILocation(line: 277, column: 2, scope: !850)
!876 = !DILocation(line: 278, column: 22, scope: !669)
!877 = !{!646, !390, i64 44}
!878 = !DILocation(line: 278, column: 8, scope: !669)
!879 = !DILocation(line: 278, column: 15, scope: !669)
!880 = !DILocation(line: 279, column: 26, scope: !669)
!881 = !{!646, !390, i64 48}
!882 = !DILocation(line: 279, column: 8, scope: !669)
!883 = !DILocation(line: 279, column: 19, scope: !669)
!884 = !DILocation(line: 280, column: 24, scope: !669)
!885 = !DILocation(line: 280, column: 8, scope: !669)
!886 = !DILocation(line: 280, column: 17, scope: !669)
!887 = !DILocation(line: 281, column: 8, scope: !669)
!888 = !DILocation(line: 281, column: 17, scope: !669)
!889 = !{!646, !380, i64 112}
!890 = !DILocation(line: 282, column: 11, scope: !891)
!891 = distinct !DILexicalBlock(scope: !669, file: !3, line: 282, column: 6)
!892 = !DILocation(line: 282, column: 6, scope: !891)
!893 = !DILocation(line: 282, column: 6, scope: !669)
!894 = !DILocation(line: 283, column: 24, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !3, line: 283, column: 3)
!896 = distinct !DILexicalBlock(scope: !897, file: !3, line: 283, column: 3)
!897 = distinct !DILexicalBlock(scope: !891, file: !3, line: 282, column: 21)
!898 = !DILocation(line: 283, column: 17, scope: !895)
!899 = !DILocation(line: 283, column: 3, scope: !896)
!900 = !DILocation(line: 284, column: 31, scope: !895)
!901 = !DILocation(line: 284, column: 26, scope: !895)
!902 = !DILocation(line: 284, column: 10, scope: !895)
!903 = !DILocation(line: 284, column: 4, scope: !895)
!904 = !DILocation(line: 284, column: 24, scope: !895)
!905 = !DILocation(line: 283, column: 35, scope: !895)
!906 = distinct !{!906, !899, !907}
!907 = !DILocation(line: 284, column: 43, scope: !896)
!908 = !DILocation(line: 286, column: 24, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !3, line: 286, column: 3)
!910 = distinct !DILexicalBlock(scope: !911, file: !3, line: 286, column: 3)
!911 = distinct !DILexicalBlock(scope: !891, file: !3, line: 285, column: 7)
!912 = !DILocation(line: 286, column: 17, scope: !909)
!913 = !DILocation(line: 286, column: 3, scope: !910)
!914 = !DILocation(line: 287, column: 10, scope: !909)
!915 = !DILocation(line: 287, column: 4, scope: !909)
!916 = !DILocation(line: 287, column: 24, scope: !909)
!917 = !DILocation(line: 286, column: 35, scope: !909)
!918 = distinct !{!918, !913, !919}
!919 = !DILocation(line: 287, column: 26, scope: !910)
!920 = !DILocation(line: 289, column: 8, scope: !669)
!921 = !DILocation(line: 289, column: 16, scope: !669)
!922 = !{!646, !380, i64 120}
!923 = !DILocation(line: 290, column: 23, scope: !924)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 290, column: 2)
!925 = distinct !DILexicalBlock(scope: !669, file: !3, line: 290, column: 2)
!926 = !DILocation(line: 290, column: 16, scope: !924)
!927 = !DILocation(line: 290, column: 2, scope: !925)
!928 = !DILocation(line: 292, column: 37, scope: !929)
!929 = distinct !DILexicalBlock(scope: !924, file: !3, line: 290, column: 38)
!930 = !DILocation(line: 292, column: 48, scope: !929)
!931 = !{!932, !380, i64 0}
!932 = !{!"atom_t", !380, i64 0, !380, i64 8, !390, i64 16, !390, i64 20, !381, i64 24, !380, i64 56, !869, i64 64, !869, i64 72, !869, i64 80, !869, i64 88, !380, i64 96, !390, i64 104, !869, i64 112, !869, i64 120, !390, i64 128, !390, i64 132, !380, i64 136, !381, i64 144, !869, i64 168}
!933 = !DILocation(line: 292, column: 24, scope: !929)
!934 = !DILocation(line: 292, column: 60, scope: !929)
!935 = !DILocation(line: 292, column: 17, scope: !929)
!936 = !DILocation(line: 293, column: 11, scope: !937)
!937 = distinct !DILexicalBlock(scope: !929, file: !3, line: 293, column: 7)
!938 = !DILocation(line: 293, column: 7, scope: !929)
!939 = !DILocation(line: 294, column: 13, scope: !940)
!940 = distinct !DILexicalBlock(scope: !937, file: !3, line: 293, column: 20)
!941 = !DILocation(line: 294, column: 4, scope: !940)
!942 = !DILocation(line: 295, column: 4, scope: !940)
!943 = !DILocation(line: 297, column: 21, scope: !929)
!944 = !DILocation(line: 297, column: 34, scope: !929)
!945 = !DILocation(line: 297, column: 3, scope: !929)
!946 = !DILocation(line: 298, column: 11, scope: !929)
!947 = !DILocation(line: 298, column: 22, scope: !929)
!948 = !DILocation(line: 299, column: 11, scope: !929)
!949 = !DILocation(line: 299, column: 22, scope: !929)
!950 = !{!932, !380, i64 8}
!951 = !DILocation(line: 300, column: 25, scope: !929)
!952 = !DILocation(line: 300, column: 38, scope: !929)
!953 = !{!932, !390, i64 16}
!954 = !DILocation(line: 300, column: 11, scope: !929)
!955 = !DILocation(line: 300, column: 18, scope: !929)
!956 = !DILocation(line: 301, column: 42, scope: !929)
!957 = !{!932, !390, i64 20}
!958 = !DILocation(line: 301, column: 11, scope: !929)
!959 = !DILocation(line: 301, column: 22, scope: !929)
!960 = !DILocation(line: 302, column: 3, scope: !961)
!961 = distinct !DILexicalBlock(scope: !929, file: !3, line: 302, column: 3)
!962 = !DILocation(line: 303, column: 30, scope: !963)
!963 = distinct !DILexicalBlock(scope: !961, file: !3, line: 302, column: 3)
!964 = !DILocation(line: 303, column: 25, scope: !963)
!965 = !DILocation(line: 303, column: 4, scope: !963)
!966 = !DILocation(line: 303, column: 23, scope: !963)
!967 = !DILocation(line: 302, column: 38, scope: !963)
!968 = !DILocation(line: 302, column: 18, scope: !963)
!969 = distinct !{!969, !960, !970}
!970 = !DILocation(line: 303, column: 52, scope: !961)
!971 = !DILocation(line: 304, column: 11, scope: !929)
!972 = !DILocation(line: 304, column: 22, scope: !929)
!973 = !{!932, !380, i64 56}
!974 = !DILocation(line: 305, column: 29, scope: !929)
!975 = !DILocation(line: 305, column: 42, scope: !929)
!976 = !{!932, !869, i64 64}
!977 = !DILocation(line: 305, column: 11, scope: !929)
!978 = !DILocation(line: 305, column: 22, scope: !929)
!979 = !DILocation(line: 306, column: 42, scope: !929)
!980 = !{!932, !869, i64 72}
!981 = !DILocation(line: 306, column: 11, scope: !929)
!982 = !DILocation(line: 306, column: 22, scope: !929)
!983 = !DILocation(line: 307, column: 29, scope: !929)
!984 = !DILocation(line: 307, column: 42, scope: !929)
!985 = !{!932, !869, i64 80}
!986 = !DILocation(line: 307, column: 11, scope: !929)
!987 = !DILocation(line: 307, column: 22, scope: !929)
!988 = !DILocation(line: 308, column: 42, scope: !929)
!989 = !{!932, !869, i64 88}
!990 = !DILocation(line: 308, column: 11, scope: !929)
!991 = !DILocation(line: 308, column: 22, scope: !929)
!992 = !DILocation(line: 309, column: 11, scope: !929)
!993 = !DILocation(line: 309, column: 22, scope: !929)
!994 = !{!932, !380, i64 96}
!995 = !DILocation(line: 310, column: 29, scope: !929)
!996 = !DILocation(line: 310, column: 42, scope: !929)
!997 = !{!932, !390, i64 104}
!998 = !DILocation(line: 310, column: 11, scope: !929)
!999 = !DILocation(line: 310, column: 22, scope: !929)
!1000 = !DILocation(line: 311, column: 42, scope: !929)
!1001 = !{!932, !869, i64 112}
!1002 = !DILocation(line: 311, column: 11, scope: !929)
!1003 = !DILocation(line: 311, column: 22, scope: !929)
!1004 = !DILocation(line: 312, column: 29, scope: !929)
!1005 = !DILocation(line: 312, column: 42, scope: !929)
!1006 = !{!932, !869, i64 120}
!1007 = !DILocation(line: 312, column: 11, scope: !929)
!1008 = !DILocation(line: 312, column: 22, scope: !929)
!1009 = !DILocation(line: 313, column: 42, scope: !929)
!1010 = !{!932, !390, i64 128}
!1011 = !DILocation(line: 313, column: 11, scope: !929)
!1012 = !DILocation(line: 313, column: 22, scope: !929)
!1013 = !DILocation(line: 314, column: 29, scope: !929)
!1014 = !DILocation(line: 314, column: 42, scope: !929)
!1015 = !{!932, !390, i64 132}
!1016 = !DILocation(line: 314, column: 11, scope: !929)
!1017 = !DILocation(line: 314, column: 22, scope: !929)
!1018 = !DILocation(line: 315, column: 11, scope: !929)
!1019 = !DILocation(line: 315, column: 22, scope: !929)
!1020 = !{!932, !380, i64 136}
!1021 = !DILocation(line: 316, column: 29, scope: !929)
!1022 = !DILocation(line: 316, column: 24, scope: !929)
!1023 = !{!869, !869, i64 0}
!1024 = !DILocation(line: 316, column: 3, scope: !929)
!1025 = !DILocation(line: 316, column: 22, scope: !929)
!1026 = !DILocation(line: 317, column: 24, scope: !929)
!1027 = !DILocation(line: 317, column: 3, scope: !929)
!1028 = !DILocation(line: 317, column: 22, scope: !929)
!1029 = !DILocation(line: 318, column: 29, scope: !929)
!1030 = !DILocation(line: 318, column: 24, scope: !929)
!1031 = !DILocation(line: 318, column: 3, scope: !929)
!1032 = !DILocation(line: 318, column: 22, scope: !929)
!1033 = !DILocation(line: 319, column: 42, scope: !929)
!1034 = !{!932, !869, i64 168}
!1035 = !DILocation(line: 319, column: 11, scope: !929)
!1036 = !DILocation(line: 319, column: 22, scope: !929)
!1037 = !DILocation(line: 290, column: 34, scope: !924)
!1038 = distinct !{!1038, !927, !1039}
!1039 = !DILocation(line: 320, column: 2, scope: !925)
!1040 = !DILocation(line: 323, column: 1, scope: !669)
!1041 = distinct !DISubprogram(name: "copystrand", scope: !3, file: !3, line: 325, type: !1042, scopeLine: 326, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1044)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!53, !53}
!1044 = !{!1045, !1046, !1047, !1048}
!1045 = !DILocalVariable(name: "str", arg: 1, scope: !1041, file: !3, line: 325, type: !53)
!1046 = !DILocalVariable(name: "newstrand", scope: !1041, file: !3, line: 327, type: !53)
!1047 = !DILocalVariable(name: "namebuf", scope: !1041, file: !3, line: 328, type: !12)
!1048 = !DILocalVariable(name: "resctr", scope: !1041, file: !3, line: 329, type: !11)
!1049 = !DILocation(line: 0, scope: !1041)
!1050 = !DILocation(line: 331, column: 33, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 331, column: 5)
!1052 = !DILocation(line: 331, column: 19, scope: !1051)
!1053 = !DILocation(line: 331, column: 64, scope: !1051)
!1054 = !DILocation(line: 331, column: 5, scope: !1041)
!1055 = !DILocation(line: 332, column: 41, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 331, column: 72)
!1057 = !{!1058, !380, i64 0}
!1058 = !{!"strand_t", !380, i64 0, !390, i64 8, !390, i64 12, !380, i64 16, !380, i64 24, !390, i64 32, !390, i64 36, !380, i64 40}
!1059 = !DILocation(line: 332, column: 3, scope: !1056)
!1060 = !DILocation(line: 333, column: 3, scope: !1056)
!1061 = !DILocation(line: 334, column: 3, scope: !1056)
!1062 = !DILocation(line: 338, column: 16, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 337, column: 13)
!1064 = !{!1058, !390, i64 32}
!1065 = !DILocation(line: 338, column: 11, scope: !1063)
!1066 = !DILocation(line: 338, column: 28, scope: !1063)
!1067 = !DILocation(line: 338, column: 3, scope: !1063)
!1068 = !DILocation(line: 337, column: 26, scope: !1063)
!1069 = !DILocation(line: 337, column: 37, scope: !1063)
!1070 = !{!1058, !380, i64 40}
!1071 = !DILocation(line: 338, column: 56, scope: !1063)
!1072 = !DILocation(line: 337, column: 13, scope: !1041)
!1073 = !DILocation(line: 340, column: 17, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 339, column: 2)
!1075 = !DILocation(line: 341, column: 17, scope: !1074)
!1076 = !DILocation(line: 344, column: 51, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 344, column: 6)
!1078 = !DILocation(line: 344, column: 38, scope: !1077)
!1079 = !DILocation(line: 344, column: 66, scope: !1077)
!1080 = !DILocation(line: 344, column: 28, scope: !1077)
!1081 = !DILocation(line: 345, column: 24, scope: !1077)
!1082 = !DILocation(line: 344, column: 6, scope: !1041)
!1083 = !DILocation(line: 347, column: 41, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 346, column: 2)
!1085 = !DILocation(line: 347, column: 3, scope: !1084)
!1086 = !DILocation(line: 348, column: 3, scope: !1084)
!1087 = !DILocation(line: 349, column: 3, scope: !1084)
!1088 = !DILocation(line: 351, column: 13, scope: !1041)
!1089 = !DILocation(line: 351, column: 26, scope: !1041)
!1090 = !DILocation(line: 352, column: 39, scope: !1041)
!1091 = !DILocation(line: 352, column: 2, scope: !1041)
!1092 = !DILocation(line: 353, column: 32, scope: !1041)
!1093 = !{!1058, !390, i64 8}
!1094 = !DILocation(line: 353, column: 13, scope: !1041)
!1095 = !DILocation(line: 353, column: 25, scope: !1041)
!1096 = !DILocation(line: 354, column: 27, scope: !1041)
!1097 = !{!1058, !390, i64 12}
!1098 = !DILocation(line: 354, column: 13, scope: !1041)
!1099 = !DILocation(line: 354, column: 20, scope: !1041)
!1100 = !DILocation(line: 355, column: 13, scope: !1041)
!1101 = !DILocation(line: 355, column: 24, scope: !1041)
!1102 = !{!1058, !380, i64 16}
!1103 = !DILocation(line: 356, column: 13, scope: !1041)
!1104 = !DILocation(line: 356, column: 20, scope: !1041)
!1105 = !{!1058, !380, i64 24}
!1106 = !DILocation(line: 357, column: 32, scope: !1041)
!1107 = !DILocation(line: 357, column: 13, scope: !1041)
!1108 = !DILocation(line: 357, column: 25, scope: !1041)
!1109 = !DILocation(line: 358, column: 13, scope: !1041)
!1110 = !DILocation(line: 358, column: 24, scope: !1041)
!1111 = !{!1058, !390, i64 36}
!1112 = !DILocation(line: 359, column: 41, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 359, column: 9)
!1114 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 359, column: 9)
!1115 = !DILocation(line: 359, column: 34, scope: !1113)
!1116 = !DILocation(line: 359, column: 9, scope: !1114)
!1117 = !DILocation(line: 361, column: 22, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 359, column: 65)
!1119 = !DILocation(line: 361, column: 17, scope: !1118)
!1120 = !DILocation(line: 361, column: 4, scope: !1118)
!1121 = !DILocation(line: 360, column: 28, scope: !1118)
!1122 = !DILocation(line: 360, column: 17, scope: !1118)
!1123 = !DILocation(line: 360, column: 49, scope: !1118)
!1124 = !DILocation(line: 362, column: 28, scope: !1118)
!1125 = !DILocation(line: 362, column: 17, scope: !1118)
!1126 = !DILocation(line: 362, column: 50, scope: !1118)
!1127 = !DILocation(line: 362, column: 59, scope: !1118)
!1128 = !DILocation(line: 363, column: 29, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 363, column: 22)
!1130 = !DILocation(line: 363, column: 22, scope: !1118)
!1131 = !DILocation(line: 365, column: 16, scope: !1129)
!1132 = !DILocation(line: 365, column: 5, scope: !1129)
!1133 = !DILocation(line: 364, column: 55, scope: !1129)
!1134 = !DILocation(line: 364, column: 25, scope: !1129)
!1135 = !DILocation(line: 364, column: 62, scope: !1129)
!1136 = !DILocation(line: 364, column: 69, scope: !1129)
!1137 = !DILocation(line: 359, column: 60, scope: !1113)
!1138 = distinct !{!1138, !1116, !1139}
!1139 = !DILocation(line: 366, column: 9, scope: !1114)
!1140 = !DILocation(line: 368, column: 1, scope: !1041)
!1141 = distinct !DISubprogram(name: "copymolecule", scope: !3, file: !3, line: 370, type: !1142, scopeLine: 371, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1144)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!232, !232}
!1144 = !{!1145, !1146, !1147, !1148, !1149, !1150, !1151}
!1145 = !DILocalVariable(name: "mol", arg: 1, scope: !1141, file: !3, line: 370, type: !232)
!1146 = !DILocalVariable(name: "row", scope: !1141, file: !3, line: 372, type: !11)
!1147 = !DILocalVariable(name: "col", scope: !1141, file: !3, line: 372, type: !11)
!1148 = !DILocalVariable(name: "strptr", scope: !1141, file: !3, line: 373, type: !53)
!1149 = !DILocalVariable(name: "newstr", scope: !1141, file: !3, line: 373, type: !53)
!1150 = !DILocalVariable(name: "nextstr", scope: !1141, file: !3, line: 373, type: !53)
!1151 = !DILocalVariable(name: "newmol", scope: !1141, file: !3, line: 374, type: !232)
!1152 = !DILocation(line: 0, scope: !1141)
!1153 = !DILocation(line: 376, column: 9, scope: !1141)
!1154 = !DILocation(line: 378, column: 39, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 378, column: 12)
!1156 = !DILocation(line: 378, column: 23, scope: !1155)
!1157 = !DILocation(line: 378, column: 72, scope: !1155)
!1158 = !DILocation(line: 378, column: 12, scope: !1141)
!1159 = !DILocation(line: 379, column: 17, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 378, column: 80)
!1161 = !DILocation(line: 380, column: 17, scope: !1160)
!1162 = !DILocation(line: 381, column: 17, scope: !1160)
!1163 = !DILocation(line: 384, column: 35, scope: !1141)
!1164 = !{!1165, !390, i64 96}
!1165 = !{!"molecule_t", !381, i64 0, !390, i64 96, !380, i64 104, !390, i64 112, !390, i64 116, !390, i64 120, !380, i64 128}
!1166 = !DILocation(line: 384, column: 17, scope: !1141)
!1167 = !DILocation(line: 384, column: 28, scope: !1141)
!1168 = !DILocation(line: 385, column: 36, scope: !1141)
!1169 = !{!1165, !390, i64 112}
!1170 = !DILocation(line: 385, column: 17, scope: !1141)
!1171 = !DILocation(line: 385, column: 29, scope: !1141)
!1172 = !DILocation(line: 386, column: 33, scope: !1141)
!1173 = !{!1165, !390, i64 116}
!1174 = !DILocation(line: 386, column: 17, scope: !1141)
!1175 = !DILocation(line: 386, column: 26, scope: !1141)
!1176 = !DILocation(line: 387, column: 33, scope: !1141)
!1177 = !{!1165, !390, i64 120}
!1178 = !DILocation(line: 387, column: 17, scope: !1141)
!1179 = !DILocation(line: 387, column: 26, scope: !1141)
!1180 = !DILocation(line: 389, column: 19, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 389, column: 14)
!1182 = !{!1165, !380, i64 128}
!1183 = !DILocation(line: 389, column: 25, scope: !1181)
!1184 = !DILocation(line: 389, column: 14, scope: !1141)
!1185 = !DILocation(line: 390, column: 48, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1181, file: !3, line: 389, column: 35)
!1187 = !DILocation(line: 390, column: 33, scope: !1186)
!1188 = !DILocation(line: 390, column: 25, scope: !1186)
!1189 = !DILocation(line: 390, column: 31, scope: !1186)
!1190 = !DILocation(line: 391, column: 9, scope: !1186)
!1191 = !DILocation(line: 393, column: 25, scope: !1181)
!1192 = !DILocation(line: 393, column: 31, scope: !1181)
!1193 = !DILocation(line: 395, column: 9, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 395, column: 9)
!1195 = !DILocation(line: 396, column: 17, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !3, line: 396, column: 17)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 395, column: 42)
!1198 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 395, column: 9)
!1199 = !DILocation(line: 397, column: 53, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !3, line: 396, column: 50)
!1201 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 396, column: 17)
!1202 = !DILocation(line: 397, column: 25, scope: !1200)
!1203 = !DILocation(line: 397, column: 51, scope: !1200)
!1204 = !DILocation(line: 396, column: 45, scope: !1201)
!1205 = !DILocation(line: 396, column: 36, scope: !1201)
!1206 = distinct !{!1206, !1195, !1207}
!1207 = !DILocation(line: 398, column: 17, scope: !1196)
!1208 = !DILocation(line: 395, column: 37, scope: !1198)
!1209 = !DILocation(line: 395, column: 28, scope: !1198)
!1210 = distinct !{!1210, !1193, !1211}
!1211 = !DILocation(line: 399, column: 9, scope: !1194)
!1212 = !DILocation(line: 401, column: 23, scope: !1141)
!1213 = !{!1165, !380, i64 104}
!1214 = !DILocation(line: 402, column: 21, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 402, column: 14)
!1216 = !DILocation(line: 402, column: 14, scope: !1141)
!1217 = !DILocation(line: 403, column: 26, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 402, column: 30)
!1219 = !DILocation(line: 404, column: 25, scope: !1218)
!1220 = !DILocation(line: 404, column: 36, scope: !1218)
!1221 = !DILocation(line: 405, column: 25, scope: !1218)
!1222 = !DILocation(line: 405, column: 35, scope: !1218)
!1223 = !DILocation(line: 406, column: 34, scope: !1218)
!1224 = !DILocation(line: 407, column: 9, scope: !1218)
!1225 = !DILocation(line: 409, column: 24, scope: !1141)
!1226 = !DILocation(line: 409, column: 9, scope: !1141)
!1227 = !DILocation(line: 410, column: 27, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 409, column: 34)
!1229 = !DILocation(line: 411, column: 22, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1228, file: !3, line: 411, column: 22)
!1231 = !DILocation(line: 411, column: 22, scope: !1228)
!1232 = !DILocation(line: 412, column: 33, scope: !1230)
!1233 = !DILocation(line: 412, column: 40, scope: !1230)
!1234 = !DILocation(line: 412, column: 25, scope: !1230)
!1235 = !DILocation(line: 413, column: 26, scope: !1228)
!1236 = !DILocation(line: 413, column: 37, scope: !1228)
!1237 = !DILocation(line: 415, column: 34, scope: !1228)
!1238 = distinct !{!1238, !1226, !1239}
!1239 = !DILocation(line: 416, column: 9, scope: !1141)
!1240 = !DILocation(line: 418, column: 9, scope: !1141)
!1241 = !DILocation(line: 419, column: 9, scope: !1141)
!1242 = !DILocation(line: 420, column: 1, scope: !1141)
!1243 = distinct !DISubprogram(name: "read_reslib_header", scope: !3, file: !3, line: 492, type: !1244, scopeLine: 494, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1247)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!298, !12, !1246, !1246, !1246, !1246, !12}
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!1247 = !{!1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1264, !1268, !1269, !1270}
!1248 = !DILocalVariable(name: "reslib", arg: 1, scope: !1243, file: !3, line: 492, type: !12)
!1249 = !DILocalVariable(name: "pfp", arg: 2, scope: !1243, file: !3, line: 493, type: !1246)
!1250 = !DILocalVariable(name: "bfp", arg: 3, scope: !1243, file: !3, line: 493, type: !1246)
!1251 = !DILocalVariable(name: "qfp", arg: 4, scope: !1243, file: !3, line: 493, type: !1246)
!1252 = !DILocalVariable(name: "cfp", arg: 5, scope: !1243, file: !3, line: 493, type: !1246)
!1253 = !DILocalVariable(name: "offname", arg: 6, scope: !1243, file: !3, line: 493, type: !12)
!1254 = !DILocalVariable(name: "rfp", scope: !1243, file: !3, line: 495, type: !434)
!1255 = !DILocalVariable(name: "rlp", scope: !1243, file: !3, line: 496, type: !298)
!1256 = !DILocalVariable(name: "nw", scope: !1243, file: !3, line: 497, type: !11)
!1257 = !DILocalVariable(name: "nsize", scope: !1243, file: !3, line: 497, type: !11)
!1258 = !DILocalVariable(name: "np", scope: !1243, file: !3, line: 498, type: !12)
!1259 = !DILocalVariable(name: "line", scope: !1243, file: !3, line: 499, type: !1260)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024, elements: !1261)
!1261 = !{!1262}
!1262 = !DISubrange(count: 128)
!1263 = !DILocalVariable(name: "keyword", scope: !1243, file: !3, line: 499, type: !295)
!1264 = !DILocalVariable(name: "value", scope: !1243, file: !3, line: 499, type: !1265)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 800, elements: !1266)
!1266 = !{!1267}
!1267 = !DISubrange(count: 100)
!1268 = !DILocalVariable(name: "newname", scope: !1243, file: !3, line: 499, type: !1265)
!1269 = !DILocalVariable(name: "fname", scope: !1243, file: !3, line: 500, type: !352)
!1270 = !DILabel(scope: !1243, name: "clean_up", file: !3, line: 621)
!1271 = !DILocation(line: 0, scope: !1243)
!1272 = !DILocation(line: 499, column: 2, scope: !1243)
!1273 = !DILocation(line: 499, column: 7, scope: !1243)
!1274 = !DILocation(line: 499, column: 20, scope: !1243)
!1275 = !DILocation(line: 499, column: 35, scope: !1243)
!1276 = !DILocation(line: 499, column: 49, scope: !1243)
!1277 = !DILocation(line: 500, column: 2, scope: !1243)
!1278 = !DILocation(line: 500, column: 7, scope: !1243)
!1279 = !DILocation(line: 502, column: 6, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 502, column: 6)
!1281 = !DILocation(line: 502, column: 31, scope: !1280)
!1282 = !DILocation(line: 502, column: 6, scope: !1243)
!1283 = !DILocation(line: 503, column: 12, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1280, file: !3, line: 502, column: 40)
!1285 = !DILocation(line: 503, column: 3, scope: !1284)
!1286 = !DILocation(line: 504, column: 12, scope: !1284)
!1287 = !DILocation(line: 504, column: 21, scope: !1284)
!1288 = !DILocation(line: 504, column: 3, scope: !1284)
!1289 = !DILocation(line: 505, column: 22, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1284, file: !3, line: 505, column: 7)
!1291 = !DILocation(line: 505, column: 15, scope: !1290)
!1292 = !DILocation(line: 505, column: 37, scope: !1290)
!1293 = !DILocation(line: 505, column: 7, scope: !1284)
!1294 = !DILocation(line: 506, column: 47, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1290, file: !3, line: 505, column: 46)
!1296 = !DILocation(line: 506, column: 4, scope: !1295)
!1297 = !DILocation(line: 507, column: 4, scope: !1295)
!1298 = !DILocation(line: 510, column: 21, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1280, file: !3, line: 509, column: 7)
!1300 = !DILocation(line: 510, column: 3, scope: !1299)
!1301 = !DILocation(line: 511, column: 22, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1299, file: !3, line: 511, column: 7)
!1303 = !DILocation(line: 511, column: 15, scope: !1302)
!1304 = !DILocation(line: 511, column: 37, scope: !1302)
!1305 = !DILocation(line: 511, column: 7, scope: !1299)
!1306 = !DILocation(line: 512, column: 47, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1302, file: !3, line: 511, column: 46)
!1308 = !DILocation(line: 512, column: 4, scope: !1307)
!1309 = !DILocation(line: 513, column: 4, scope: !1307)
!1310 = !DILocation(line: 0, scope: !1280)
!1311 = !DILocation(line: 517, column: 28, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 517, column: 6)
!1313 = !DILocation(line: 517, column: 14, scope: !1312)
!1314 = !DILocation(line: 517, column: 59, scope: !1312)
!1315 = !DILocation(line: 517, column: 6, scope: !1243)
!1316 = !DILocation(line: 518, column: 3, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1312, file: !3, line: 517, column: 68)
!1318 = !DILocation(line: 519, column: 3, scope: !1317)
!1319 = !DILocation(line: 520, column: 3, scope: !1317)
!1320 = !DILocation(line: 523, column: 10, scope: !1243)
!1321 = !DILocation(line: 524, column: 31, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 524, column: 6)
!1323 = !DILocation(line: 524, column: 23, scope: !1322)
!1324 = !DILocation(line: 524, column: 58, scope: !1322)
!1325 = !DILocation(line: 524, column: 6, scope: !1243)
!1326 = !DILocation(line: 525, column: 3, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1322, file: !3, line: 524, column: 67)
!1328 = !DILocation(line: 526, column: 3, scope: !1327)
!1329 = !DILocation(line: 527, column: 3, scope: !1327)
!1330 = !DILocation(line: 529, column: 2, scope: !1243)
!1331 = !DILocation(line: 530, column: 17, scope: !1243)
!1332 = !DILocation(line: 530, column: 7, scope: !1243)
!1333 = !DILocation(line: 530, column: 15, scope: !1243)
!1334 = !DILocation(line: 531, column: 10, scope: !1243)
!1335 = !DILocation(line: 532, column: 7, scope: !1243)
!1336 = !DILocation(line: 532, column: 15, scope: !1243)
!1337 = !DILocation(line: 533, column: 7, scope: !1243)
!1338 = !DILocation(line: 533, column: 17, scope: !1243)
!1339 = !DILocation(line: 534, column: 7, scope: !1243)
!1340 = !DILocation(line: 534, column: 21, scope: !1243)
!1341 = !{!389, !390, i64 20}
!1342 = !DILocation(line: 535, column: 7, scope: !1243)
!1343 = !DILocation(line: 535, column: 16, scope: !1243)
!1344 = !DILocation(line: 537, column: 7, scope: !1243)
!1345 = !DILocation(line: 538, column: 7, scope: !1243)
!1346 = !DILocation(line: 539, column: 7, scope: !1243)
!1347 = !DILocation(line: 540, column: 7, scope: !1243)
!1348 = !DILocation(line: 541, column: 11, scope: !1243)
!1349 = !DILocation(line: 543, column: 7, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 543, column: 7)
!1351 = !DILocation(line: 543, column: 32, scope: !1350)
!1352 = !DILocation(line: 543, column: 7, scope: !1243)
!1353 = !DILocation(line: 544, column: 17, scope: !1354)
!1354 = distinct !DILexicalBlock(scope: !1350, file: !3, line: 543, column: 41)
!1355 = !DILocation(line: 544, column: 10, scope: !1354)
!1356 = !DILocation(line: 544, column: 3, scope: !1354)
!1357 = !DILocation(line: 545, column: 8, scope: !1358)
!1358 = distinct !DILexicalBlock(scope: !1359, file: !3, line: 545, column: 8)
!1359 = distinct !DILexicalBlock(scope: !1354, file: !3, line: 544, column: 46)
!1360 = !DILocation(line: 545, column: 14, scope: !1358)
