; ModuleID = 'select_atoms.ll'
source_filename = "select_atoms.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.extbond_t = type { %struct.extbond_t*, i32, i32, i32 }
%struct.chiral_t = type { [4 x i32], double }
%struct.atom_t = type { i8*, i8*, i32, i32, [8 x i32], %struct.residue_t*, double, double, double, double, i8*, i32, double, double, i32, i32, i8*, [3 x double], double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "aexpr", scope: !2, file: !3, line: 14, type: !36, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "select_atoms.c", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !{!0, !26, !30, !32, !34, !39}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "spart", scope: !2, file: !3, line: 15, type: !28, isLocal: true, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "rpart", scope: !2, file: !3, line: 16, type: !28, isLocal: true, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "apart", scope: !2, file: !3, line: 17, type: !28, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "rexpr", scope: !2, file: !3, line: 20, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8000, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 1000)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "expbuf", scope: !2, file: !3, line: 26, type: !36, isLocal: true, isDefinition: true)
!41 = !{i32 7, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 10.0.0-4ubuntu1 "}
!45 = distinct !DISubprogram(name: "setpoint", scope: !3, file: !3, line: 54, type: !46, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !261)
!46 = !DISubroutineType(types: !47)
!47 = !{!23, !48, !28, !204}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !50, line: 126, baseType: !51)
!50 = !DIFile(filename: "./nabtypes.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !50, line: 118, size: 1088, elements: !52)
!52 = !{!53, !60, !62, !155, !156, !157, !158}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !51, file: !50, line: 119, baseType: !54, size: 768)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !50, line: 13, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 768, elements: !57)
!56 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!57 = !{!58, !59}
!58 = !DISubrange(count: 4)
!59 = !DISubrange(count: 3)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !51, file: !50, line: 120, baseType: !61, size: 32, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !50, line: 6, baseType: !23)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !51, file: !50, line: 121, baseType: !63, size: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !50, line: 93, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !50, line: 84, size: 384, elements: !66)
!66 = !{!67, !70, !71, !72, !74, !76, !77, !78}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !65, file: !50, line: 85, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !50, line: 17, baseType: !29)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !65, file: !50, line: 86, baseType: !61, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !65, file: !50, line: 87, baseType: !61, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !65, file: !50, line: 88, baseType: !73, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !65, file: !50, line: 89, baseType: !75, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !65, file: !50, line: 90, baseType: !61, size: 32, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !65, file: !50, line: 91, baseType: !61, size: 32, offset: 288)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !65, file: !50, line: 92, baseType: !79, size: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !50, line: 82, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !50, line: 63, size: 1024, elements: !83)
!83 = !{!84, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !105, !106, !112, !113, !122, !123, !125}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !82, file: !50, line: 64, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !82, file: !50, line: 65, baseType: !61, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !82, file: !50, line: 66, baseType: !61, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !82, file: !50, line: 67, baseType: !61, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !82, file: !50, line: 68, baseType: !68, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !82, file: !50, line: 69, baseType: !68, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !82, file: !50, line: 70, baseType: !61, size: 32, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !82, file: !50, line: 71, baseType: !61, size: 32, offset: 352)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !82, file: !50, line: 72, baseType: !61, size: 32, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !82, file: !50, line: 73, baseType: !75, size: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !82, file: !50, line: 74, baseType: !96, size: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !50, line: 52, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !50, line: 47, size: 192, elements: !99)
!99 = !{!100, !102, !103, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !98, file: !50, line: 48, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !98, file: !50, line: 49, baseType: !61, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !98, file: !50, line: 50, baseType: !61, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !98, file: !50, line: 51, baseType: !61, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !82, file: !50, line: 75, baseType: !61, size: 32, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !82, file: !50, line: 76, baseType: !107, size: 64, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !50, line: 54, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 2)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !82, file: !50, line: 77, baseType: !61, size: 32, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !82, file: !50, line: 78, baseType: !114, size: 64, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !50, line: 61, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !50, line: 58, size: 192, elements: !117)
!117 = !{!118, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !116, file: !50, line: 59, baseType: !119, size: 128)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !120)
!120 = !{!58}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !116, file: !50, line: 60, baseType: !56, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !82, file: !50, line: 79, baseType: !61, size: 32, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !82, file: !50, line: 80, baseType: !124, size: 64, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !82, file: !50, line: 81, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !50, line: 45, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !50, line: 25, size: 1408, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !128, file: !50, line: 26, baseType: !68, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !128, file: !50, line: 27, baseType: !68, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !128, file: !50, line: 28, baseType: !61, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !128, file: !50, line: 29, baseType: !61, size: 32, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !128, file: !50, line: 30, baseType: !135, size: 256, offset: 192)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 256, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !128, file: !50, line: 31, baseType: !85, size: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !128, file: !50, line: 32, baseType: !56, size: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !128, file: !50, line: 33, baseType: !56, size: 64, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !128, file: !50, line: 34, baseType: !56, size: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !128, file: !50, line: 35, baseType: !56, size: 64, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !128, file: !50, line: 36, baseType: !68, size: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !128, file: !50, line: 37, baseType: !61, size: 32, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !128, file: !50, line: 38, baseType: !56, size: 64, offset: 896)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !128, file: !50, line: 39, baseType: !56, size: 64, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !128, file: !50, line: 40, baseType: !61, size: 32, offset: 1024)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !128, file: !50, line: 41, baseType: !61, size: 32, offset: 1056)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !128, file: !50, line: 42, baseType: !68, size: 64, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !128, file: !50, line: 43, baseType: !151, size: 192, offset: 1152)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !50, line: 12, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 192, elements: !153)
!153 = !{!59}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !128, file: !50, line: 44, baseType: !56, size: 64, offset: 1344)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !51, file: !50, line: 122, baseType: !61, size: 32, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !51, file: !50, line: 123, baseType: !61, size: 32, offset: 928)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !51, file: !50, line: 124, baseType: !61, size: 32, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !51, file: !50, line: 125, baseType: !159, size: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !50, line: 115, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !50, line: 95, size: 5760, elements: !162)
!162 = !{!163, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !161, file: !50, line: 96, baseType: !164, size: 648)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 648, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 81)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !161, file: !50, line: 97, baseType: !61, size: 32, offset: 672)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !161, file: !50, line: 97, baseType: !61, size: 32, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !161, file: !50, line: 97, baseType: !61, size: 32, offset: 736)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !161, file: !50, line: 98, baseType: !61, size: 32, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !161, file: !50, line: 98, baseType: !61, size: 32, offset: 800)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !161, file: !50, line: 98, baseType: !61, size: 32, offset: 832)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !161, file: !50, line: 98, baseType: !61, size: 32, offset: 864)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !161, file: !50, line: 98, baseType: !61, size: 32, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !161, file: !50, line: 98, baseType: !61, size: 32, offset: 928)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !161, file: !50, line: 99, baseType: !61, size: 32, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !161, file: !50, line: 99, baseType: !61, size: 32, offset: 992)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !161, file: !50, line: 99, baseType: !61, size: 32, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !161, file: !50, line: 99, baseType: !61, size: 32, offset: 1056)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !161, file: !50, line: 99, baseType: !61, size: 32, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !161, file: !50, line: 99, baseType: !61, size: 32, offset: 1120)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !161, file: !50, line: 100, baseType: !61, size: 32, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !161, file: !50, line: 100, baseType: !61, size: 32, offset: 1184)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !161, file: !50, line: 100, baseType: !61, size: 32, offset: 1216)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !161, file: !50, line: 100, baseType: !61, size: 32, offset: 1248)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !161, file: !50, line: 100, baseType: !61, size: 32, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !161, file: !50, line: 100, baseType: !61, size: 32, offset: 1312)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !161, file: !50, line: 101, baseType: !61, size: 32, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !161, file: !50, line: 101, baseType: !61, size: 32, offset: 1376)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !161, file: !50, line: 101, baseType: !61, size: 32, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !161, file: !50, line: 101, baseType: !61, size: 32, offset: 1440)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !161, file: !50, line: 101, baseType: !61, size: 32, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !161, file: !50, line: 101, baseType: !61, size: 32, offset: 1504)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !161, file: !50, line: 101, baseType: !61, size: 32, offset: 1536)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !161, file: !50, line: 101, baseType: !61, size: 32, offset: 1568)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !161, file: !50, line: 102, baseType: !61, size: 32, offset: 1600)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !161, file: !50, line: 102, baseType: !61, size: 32, offset: 1632)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !161, file: !50, line: 102, baseType: !61, size: 32, offset: 1664)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !161, file: !50, line: 103, baseType: !68, size: 64, offset: 1728)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !161, file: !50, line: 103, baseType: !68, size: 64, offset: 1792)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !161, file: !50, line: 103, baseType: !68, size: 64, offset: 1856)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !161, file: !50, line: 103, baseType: !68, size: 64, offset: 1920)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !161, file: !50, line: 104, baseType: !204, size: 64, offset: 1984)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !161, file: !50, line: 104, baseType: !204, size: 64, offset: 2048)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !161, file: !50, line: 104, baseType: !204, size: 64, offset: 2112)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !161, file: !50, line: 104, baseType: !204, size: 64, offset: 2176)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !161, file: !50, line: 104, baseType: !204, size: 64, offset: 2240)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !161, file: !50, line: 104, baseType: !204, size: 64, offset: 2304)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !161, file: !50, line: 104, baseType: !204, size: 64, offset: 2368)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !161, file: !50, line: 104, baseType: !204, size: 64, offset: 2432)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !161, file: !50, line: 104, baseType: !204, size: 64, offset: 2496)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !161, file: !50, line: 105, baseType: !204, size: 64, offset: 2560)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !161, file: !50, line: 105, baseType: !204, size: 64, offset: 2624)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !161, file: !50, line: 105, baseType: !204, size: 64, offset: 2688)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !161, file: !50, line: 105, baseType: !204, size: 64, offset: 2752)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !161, file: !50, line: 105, baseType: !204, size: 64, offset: 2816)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !161, file: !50, line: 105, baseType: !204, size: 64, offset: 2880)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !161, file: !50, line: 105, baseType: !204, size: 64, offset: 2944)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !161, file: !50, line: 106, baseType: !152, size: 192, offset: 3008)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !161, file: !50, line: 106, baseType: !56, size: 64, offset: 3200)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !161, file: !50, line: 106, baseType: !56, size: 64, offset: 3264)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !161, file: !50, line: 106, baseType: !56, size: 64, offset: 3328)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !161, file: !50, line: 106, baseType: !56, size: 64, offset: 3392)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !161, file: !50, line: 106, baseType: !56, size: 64, offset: 3456)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !161, file: !50, line: 107, baseType: !124, size: 64, offset: 3520)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !161, file: !50, line: 107, baseType: !124, size: 64, offset: 3584)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !161, file: !50, line: 107, baseType: !124, size: 64, offset: 3648)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !161, file: !50, line: 107, baseType: !124, size: 64, offset: 3712)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !161, file: !50, line: 107, baseType: !124, size: 64, offset: 3776)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !161, file: !50, line: 107, baseType: !124, size: 64, offset: 3840)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !161, file: !50, line: 108, baseType: !124, size: 64, offset: 3904)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !161, file: !50, line: 108, baseType: !124, size: 64, offset: 3968)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !161, file: !50, line: 108, baseType: !124, size: 64, offset: 4032)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !161, file: !50, line: 108, baseType: !124, size: 64, offset: 4096)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !161, file: !50, line: 108, baseType: !124, size: 64, offset: 4160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !161, file: !50, line: 108, baseType: !124, size: 64, offset: 4224)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !161, file: !50, line: 109, baseType: !124, size: 64, offset: 4288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !161, file: !50, line: 109, baseType: !124, size: 64, offset: 4352)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !161, file: !50, line: 109, baseType: !124, size: 64, offset: 4416)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !161, file: !50, line: 109, baseType: !124, size: 64, offset: 4480)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !161, file: !50, line: 109, baseType: !124, size: 64, offset: 4544)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !161, file: !50, line: 110, baseType: !124, size: 64, offset: 4608)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !161, file: !50, line: 110, baseType: !124, size: 64, offset: 4672)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !161, file: !50, line: 110, baseType: !124, size: 64, offset: 4736)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !161, file: !50, line: 110, baseType: !124, size: 64, offset: 4800)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !161, file: !50, line: 110, baseType: !124, size: 64, offset: 4864)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !161, file: !50, line: 111, baseType: !124, size: 64, offset: 4928)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !161, file: !50, line: 111, baseType: !124, size: 64, offset: 4992)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !161, file: !50, line: 111, baseType: !124, size: 64, offset: 5056)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !161, file: !50, line: 111, baseType: !124, size: 64, offset: 5120)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !161, file: !50, line: 111, baseType: !124, size: 64, offset: 5184)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !161, file: !50, line: 111, baseType: !124, size: 64, offset: 5248)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !161, file: !50, line: 112, baseType: !124, size: 64, offset: 5312)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !161, file: !50, line: 112, baseType: !124, size: 64, offset: 5376)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !161, file: !50, line: 112, baseType: !124, size: 64, offset: 5440)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !161, file: !50, line: 112, baseType: !124, size: 64, offset: 5504)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !161, file: !50, line: 113, baseType: !124, size: 64, offset: 5568)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !161, file: !50, line: 113, baseType: !124, size: 64, offset: 5632)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !161, file: !50, line: 114, baseType: !204, size: 64, offset: 5696)
!261 = !{}
!262 = !DILocalVariable(name: "mol", arg: 1, scope: !45, file: !3, line: 54, type: !48)
!263 = !DILocation(line: 54, column: 27, scope: !45)
!264 = !DILocalVariable(name: "aexpr", arg: 2, scope: !45, file: !3, line: 54, type: !28)
!265 = !DILocation(line: 54, column: 37, scope: !45)
!266 = !DILocalVariable(name: "point", arg: 3, scope: !45, file: !3, line: 54, type: !204)
!267 = !DILocation(line: 54, column: 54, scope: !45)
!268 = !DILocalVariable(name: "r", scope: !45, file: !3, line: 56, type: !23)
!269 = !DILocation(line: 56, column: 6, scope: !45)
!270 = !DILocalVariable(name: "a", scope: !45, file: !3, line: 56, type: !23)
!271 = !DILocation(line: 56, column: 9, scope: !45)
!272 = !DILocalVariable(name: "ta", scope: !45, file: !3, line: 56, type: !23)
!273 = !DILocation(line: 56, column: 12, scope: !45)
!274 = !DILocalVariable(name: "sp", scope: !45, file: !3, line: 57, type: !63)
!275 = !DILocation(line: 57, column: 12, scope: !45)
!276 = !DILocalVariable(name: "res", scope: !45, file: !3, line: 58, type: !80)
!277 = !DILocation(line: 58, column: 13, scope: !45)
!278 = !DILocalVariable(name: "ap", scope: !45, file: !3, line: 59, type: !126)
!279 = !DILocation(line: 59, column: 11, scope: !45)
!280 = !DILocalVariable(name: "x", scope: !45, file: !3, line: 60, type: !56)
!281 = !DILocation(line: 60, column: 9, scope: !45)
!282 = !DILocalVariable(name: "y", scope: !45, file: !3, line: 60, type: !56)
!283 = !DILocation(line: 60, column: 12, scope: !45)
!284 = !DILocalVariable(name: "z", scope: !45, file: !3, line: 60, type: !56)
!285 = !DILocation(line: 60, column: 15, scope: !45)
!286 = !DILocation(line: 62, column: 16, scope: !45)
!287 = !DILocation(line: 62, column: 21, scope: !45)
!288 = !DILocation(line: 62, column: 2, scope: !45)
!289 = !DILocation(line: 65, column: 12, scope: !45)
!290 = !DILocation(line: 65, column: 8, scope: !45)
!291 = !DILocation(line: 65, column: 4, scope: !45)
!292 = !DILocation(line: 66, column: 10, scope: !293)
!293 = distinct !DILexicalBlock(scope: !45, file: !3, line: 66, column: 2)
!294 = !DILocation(line: 66, column: 20, scope: !293)
!295 = !DILocation(line: 66, column: 25, scope: !293)
!296 = !DILocation(line: 66, column: 18, scope: !293)
!297 = !DILocation(line: 66, column: 7, scope: !293)
!298 = !DILocation(line: 66, column: 36, scope: !299)
!299 = distinct !DILexicalBlock(scope: !293, file: !3, line: 66, column: 2)
!300 = !DILocation(line: 66, column: 2, scope: !293)
!301 = !DILocation(line: 67, column: 19, scope: !302)
!302 = distinct !DILexicalBlock(scope: !303, file: !3, line: 67, column: 7)
!303 = distinct !DILexicalBlock(scope: !299, file: !3, line: 66, column: 57)
!304 = !DILocation(line: 67, column: 23, scope: !302)
!305 = !DILocation(line: 67, column: 17, scope: !302)
!306 = !DILocation(line: 67, column: 7, scope: !303)
!307 = !DILocation(line: 68, column: 11, scope: !308)
!308 = distinct !DILexicalBlock(scope: !309, file: !3, line: 68, column: 4)
!309 = distinct !DILexicalBlock(scope: !302, file: !3, line: 67, column: 31)
!310 = !DILocation(line: 68, column: 9, scope: !308)
!311 = !DILocation(line: 68, column: 16, scope: !312)
!312 = distinct !DILexicalBlock(scope: !308, file: !3, line: 68, column: 4)
!313 = !DILocation(line: 68, column: 20, scope: !312)
!314 = !DILocation(line: 68, column: 24, scope: !312)
!315 = !DILocation(line: 68, column: 18, scope: !312)
!316 = !DILocation(line: 68, column: 4, scope: !308)
!317 = !DILocation(line: 69, column: 11, scope: !318)
!318 = distinct !DILexicalBlock(scope: !312, file: !3, line: 68, column: 42)
!319 = !DILocation(line: 69, column: 15, scope: !318)
!320 = !DILocation(line: 69, column: 27, scope: !318)
!321 = !DILocation(line: 69, column: 9, scope: !318)
!322 = !DILocation(line: 70, column: 21, scope: !323)
!323 = distinct !DILexicalBlock(scope: !318, file: !3, line: 70, column: 9)
