; ModuleID = 'select_atoms.ll'
source_filename = "select_atoms.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.extbond_t = type { %struct.extbond_t*, i32, i32, i32 }
%struct.chiral_t = type { [4 x i32], double }
%struct.atom_t = type { i8*, i8*, i32, i32, [8 x i32], %struct.residue_t*, double, double, double, double, i8*, i32, double, double, i32, i32, i8*, [3 x double], double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "aexpr", scope: !2, file: !3, line: 14, type: !258, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !249, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "select_atoms.c", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !240, !25, !241, !242, !246}
!22 = !DISubprogram(name: "select_atoms", scope: !3, file: !3, line: 29, type: !23, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !239)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !26, !238}
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !28, line: 118, size: 1088, elements: !29)
!28 = !DIFile(filename: "./nabtypes.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!29 = !{!30, !37, !39, !132, !133, !134, !135}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !27, file: !28, line: 119, baseType: !31, size: 768)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !28, line: 13, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 768, elements: !34)
!33 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!34 = !{!35, !36}
!35 = !DISubrange(count: 4)
!36 = !DISubrange(count: 3)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !27, file: !28, line: 120, baseType: !38, size: 32, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !28, line: 6, baseType: !25)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !27, file: !28, line: 121, baseType: !40, size: 64, offset: 832)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !28, line: 93, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !28, line: 84, size: 384, elements: !43)
!43 = !{!44, !48, !49, !50, !51, !53, !54, !55}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !42, file: !28, line: 85, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !28, line: 17, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !42, file: !28, line: 86, baseType: !38, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !42, file: !28, line: 87, baseType: !38, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !42, file: !28, line: 88, baseType: !26, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !42, file: !28, line: 89, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !42, file: !28, line: 90, baseType: !38, size: 32, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !42, file: !28, line: 91, baseType: !38, size: 32, offset: 288)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !42, file: !28, line: 92, baseType: !56, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !28, line: 82, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !28, line: 63, size: 1024, elements: !60)
!60 = !{!61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !82, !83, !89, !90, !99, !100, !102}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !59, file: !28, line: 64, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !59, file: !28, line: 65, baseType: !38, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !59, file: !28, line: 66, baseType: !38, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !59, file: !28, line: 67, baseType: !38, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !59, file: !28, line: 68, baseType: !45, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !59, file: !28, line: 69, baseType: !45, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !59, file: !28, line: 70, baseType: !38, size: 32, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !59, file: !28, line: 71, baseType: !38, size: 32, offset: 352)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !59, file: !28, line: 72, baseType: !38, size: 32, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !59, file: !28, line: 73, baseType: !52, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !59, file: !28, line: 74, baseType: !73, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !28, line: 52, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !28, line: 47, size: 192, elements: !76)
!76 = !{!77, !79, !80, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !75, file: !28, line: 48, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !75, file: !28, line: 49, baseType: !38, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !75, file: !28, line: 50, baseType: !38, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !75, file: !28, line: 51, baseType: !38, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !59, file: !28, line: 75, baseType: !38, size: 32, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !59, file: !28, line: 76, baseType: !84, size: 64, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !28, line: 54, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 2)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !59, file: !28, line: 77, baseType: !38, size: 32, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !59, file: !28, line: 78, baseType: !91, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !28, line: 61, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !28, line: 58, size: 192, elements: !94)
!94 = !{!95, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !93, file: !28, line: 59, baseType: !96, size: 128)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, elements: !97)
!97 = !{!35}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !93, file: !28, line: 60, baseType: !33, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !59, file: !28, line: 79, baseType: !38, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !59, file: !28, line: 80, baseType: !101, size: 64, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !59, file: !28, line: 81, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !28, line: 45, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !28, line: 25, size: 1408, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !131}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !105, file: !28, line: 26, baseType: !45, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !105, file: !28, line: 27, baseType: !45, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !105, file: !28, line: 28, baseType: !38, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !105, file: !28, line: 29, baseType: !38, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !105, file: !28, line: 30, baseType: !112, size: 256, offset: 192)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 256, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 8)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !105, file: !28, line: 31, baseType: !62, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !105, file: !28, line: 32, baseType: !33, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !105, file: !28, line: 33, baseType: !33, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !105, file: !28, line: 34, baseType: !33, size: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !105, file: !28, line: 35, baseType: !33, size: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !105, file: !28, line: 36, baseType: !45, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !105, file: !28, line: 37, baseType: !38, size: 32, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !105, file: !28, line: 38, baseType: !33, size: 64, offset: 896)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !105, file: !28, line: 39, baseType: !33, size: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !105, file: !28, line: 40, baseType: !38, size: 32, offset: 1024)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !105, file: !28, line: 41, baseType: !38, size: 32, offset: 1056)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !105, file: !28, line: 42, baseType: !45, size: 64, offset: 1088)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !105, file: !28, line: 43, baseType: !128, size: 192, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !28, line: 12, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 192, elements: !130)
!130 = !{!36}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !105, file: !28, line: 44, baseType: !33, size: 64, offset: 1344)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !27, file: !28, line: 122, baseType: !38, size: 32, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !27, file: !28, line: 123, baseType: !38, size: 32, offset: 928)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !27, file: !28, line: 124, baseType: !38, size: 32, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !27, file: !28, line: 125, baseType: !136, size: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !28, line: 115, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !28, line: 95, size: 5760, elements: !139)
!139 = !{!140, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !138, file: !28, line: 96, baseType: !141, size: 648)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 648, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 81)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !138, file: !28, line: 97, baseType: !38, size: 32, offset: 672)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !138, file: !28, line: 97, baseType: !38, size: 32, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !138, file: !28, line: 97, baseType: !38, size: 32, offset: 736)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !138, file: !28, line: 98, baseType: !38, size: 32, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !138, file: !28, line: 98, baseType: !38, size: 32, offset: 800)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !138, file: !28, line: 98, baseType: !38, size: 32, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !138, file: !28, line: 98, baseType: !38, size: 32, offset: 864)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !138, file: !28, line: 98, baseType: !38, size: 32, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !138, file: !28, line: 98, baseType: !38, size: 32, offset: 928)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !138, file: !28, line: 99, baseType: !38, size: 32, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !138, file: !28, line: 99, baseType: !38, size: 32, offset: 992)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !138, file: !28, line: 99, baseType: !38, size: 32, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !138, file: !28, line: 99, baseType: !38, size: 32, offset: 1056)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !138, file: !28, line: 99, baseType: !38, size: 32, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !138, file: !28, line: 99, baseType: !38, size: 32, offset: 1120)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !138, file: !28, line: 100, baseType: !38, size: 32, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !138, file: !28, line: 100, baseType: !38, size: 32, offset: 1184)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !138, file: !28, line: 100, baseType: !38, size: 32, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !138, file: !28, line: 100, baseType: !38, size: 32, offset: 1248)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !138, file: !28, line: 100, baseType: !38, size: 32, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !138, file: !28, line: 100, baseType: !38, size: 32, offset: 1312)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !138, file: !28, line: 101, baseType: !38, size: 32, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !138, file: !28, line: 101, baseType: !38, size: 32, offset: 1376)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !138, file: !28, line: 101, baseType: !38, size: 32, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !138, file: !28, line: 101, baseType: !38, size: 32, offset: 1440)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !138, file: !28, line: 101, baseType: !38, size: 32, offset: 1472)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !138, file: !28, line: 101, baseType: !38, size: 32, offset: 1504)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !138, file: !28, line: 101, baseType: !38, size: 32, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !138, file: !28, line: 101, baseType: !38, size: 32, offset: 1568)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !138, file: !28, line: 102, baseType: !38, size: 32, offset: 1600)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !138, file: !28, line: 102, baseType: !38, size: 32, offset: 1632)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !138, file: !28, line: 102, baseType: !38, size: 32, offset: 1664)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !138, file: !28, line: 103, baseType: !45, size: 64, offset: 1728)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !138, file: !28, line: 103, baseType: !45, size: 64, offset: 1792)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !138, file: !28, line: 103, baseType: !45, size: 64, offset: 1856)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !138, file: !28, line: 103, baseType: !45, size: 64, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !138, file: !28, line: 104, baseType: !181, size: 64, offset: 1984)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !138, file: !28, line: 104, baseType: !181, size: 64, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !138, file: !28, line: 104, baseType: !181, size: 64, offset: 2112)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !138, file: !28, line: 104, baseType: !181, size: 64, offset: 2176)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !138, file: !28, line: 104, baseType: !181, size: 64, offset: 2240)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !138, file: !28, line: 104, baseType: !181, size: 64, offset: 2304)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !138, file: !28, line: 104, baseType: !181, size: 64, offset: 2368)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !138, file: !28, line: 104, baseType: !181, size: 64, offset: 2432)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !138, file: !28, line: 104, baseType: !181, size: 64, offset: 2496)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !138, file: !28, line: 105, baseType: !181, size: 64, offset: 2560)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !138, file: !28, line: 105, baseType: !181, size: 64, offset: 2624)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !138, file: !28, line: 105, baseType: !181, size: 64, offset: 2688)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !138, file: !28, line: 105, baseType: !181, size: 64, offset: 2752)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !138, file: !28, line: 105, baseType: !181, size: 64, offset: 2816)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !138, file: !28, line: 105, baseType: !181, size: 64, offset: 2880)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !138, file: !28, line: 105, baseType: !181, size: 64, offset: 2944)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !138, file: !28, line: 106, baseType: !129, size: 192, offset: 3008)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !138, file: !28, line: 106, baseType: !33, size: 64, offset: 3200)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !138, file: !28, line: 106, baseType: !33, size: 64, offset: 3264)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !138, file: !28, line: 106, baseType: !33, size: 64, offset: 3328)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !138, file: !28, line: 106, baseType: !33, size: 64, offset: 3392)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !138, file: !28, line: 106, baseType: !33, size: 64, offset: 3456)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !138, file: !28, line: 107, baseType: !101, size: 64, offset: 3520)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !138, file: !28, line: 107, baseType: !101, size: 64, offset: 3584)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !138, file: !28, line: 107, baseType: !101, size: 64, offset: 3648)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !138, file: !28, line: 107, baseType: !101, size: 64, offset: 3712)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !138, file: !28, line: 107, baseType: !101, size: 64, offset: 3776)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !138, file: !28, line: 107, baseType: !101, size: 64, offset: 3840)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !138, file: !28, line: 108, baseType: !101, size: 64, offset: 3904)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !138, file: !28, line: 108, baseType: !101, size: 64, offset: 3968)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !138, file: !28, line: 108, baseType: !101, size: 64, offset: 4032)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !138, file: !28, line: 108, baseType: !101, size: 64, offset: 4096)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !138, file: !28, line: 108, baseType: !101, size: 64, offset: 4160)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !138, file: !28, line: 108, baseType: !101, size: 64, offset: 4224)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !138, file: !28, line: 109, baseType: !101, size: 64, offset: 4288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !138, file: !28, line: 109, baseType: !101, size: 64, offset: 4352)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !138, file: !28, line: 109, baseType: !101, size: 64, offset: 4416)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !138, file: !28, line: 109, baseType: !101, size: 64, offset: 4480)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !138, file: !28, line: 109, baseType: !101, size: 64, offset: 4544)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !138, file: !28, line: 110, baseType: !101, size: 64, offset: 4608)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !138, file: !28, line: 110, baseType: !101, size: 64, offset: 4672)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !138, file: !28, line: 110, baseType: !101, size: 64, offset: 4736)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !138, file: !28, line: 110, baseType: !101, size: 64, offset: 4800)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !138, file: !28, line: 110, baseType: !101, size: 64, offset: 4864)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !138, file: !28, line: 111, baseType: !101, size: 64, offset: 4928)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !138, file: !28, line: 111, baseType: !101, size: 64, offset: 4992)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !138, file: !28, line: 111, baseType: !101, size: 64, offset: 5056)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !138, file: !28, line: 111, baseType: !101, size: 64, offset: 5120)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !138, file: !28, line: 111, baseType: !101, size: 64, offset: 5184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !138, file: !28, line: 111, baseType: !101, size: 64, offset: 5248)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !138, file: !28, line: 112, baseType: !101, size: 64, offset: 5312)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !138, file: !28, line: 112, baseType: !101, size: 64, offset: 5376)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !138, file: !28, line: 112, baseType: !101, size: 64, offset: 5440)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !138, file: !28, line: 112, baseType: !101, size: 64, offset: 5504)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !138, file: !28, line: 113, baseType: !101, size: 64, offset: 5568)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !138, file: !28, line: 113, baseType: !101, size: 64, offset: 5632)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !138, file: !28, line: 114, baseType: !181, size: 64, offset: 5696)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!239 = !{}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!241 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!242 = !DISubprogram(name: "compile", scope: !243, file: !243, line: 257, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !239)
!243 = !DIFile(filename: "./nab.h", directory: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src")
!244 = !DISubroutineType(types: !245)
!245 = !{!238, !238, !238, !238, !25}
!246 = !DISubprogram(name: "step", scope: !243, file: !243, line: 258, type: !247, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !239)
!247 = !DISubroutineType(types: !248)
!248 = !{!25, !238, !238}
!249 = !{!0, !250, !252, !254, !256, !261}
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "spart", scope: !2, file: !3, line: 15, type: !238, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "rpart", scope: !2, file: !3, line: 16, type: !238, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "apart", scope: !2, file: !3, line: 17, type: !238, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "rexpr", scope: !2, file: !3, line: 20, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8000, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 1000)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "expbuf", scope: !2, file: !3, line: 26, type: !258, isLocal: true, isDefinition: true)
!263 = !{i32 7, !"Dwarf Version", i32 4}
!264 = !{i32 2, !"Debug Info Version", i32 3}
!265 = !{i32 1, !"wchar_size", i32 4}
!266 = !{!"clang version 10.0.0-4ubuntu1 "}
!267 = distinct !DISubprogram(name: "setpoint", scope: !3, file: !3, line: 54, type: !268, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !272)
!268 = !DISubroutineType(types: !269)
!269 = !{!25, !270, !238, !181}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !28, line: 126, baseType: !27)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!273 = !DILocalVariable(name: "mol", arg: 1, scope: !267, file: !3, line: 54, type: !270)
!274 = !DILocalVariable(name: "aexpr", arg: 2, scope: !267, file: !3, line: 54, type: !238)
!275 = !DILocalVariable(name: "point", arg: 3, scope: !267, file: !3, line: 54, type: !181)
!276 = !DILocalVariable(name: "r", scope: !267, file: !3, line: 56, type: !25)
!277 = !DILocalVariable(name: "a", scope: !267, file: !3, line: 56, type: !25)
!278 = !DILocalVariable(name: "ta", scope: !267, file: !3, line: 56, type: !25)
!279 = !DILocalVariable(name: "sp", scope: !267, file: !3, line: 57, type: !40)
!280 = !DILocalVariable(name: "res", scope: !267, file: !3, line: 58, type: !57)
!281 = !DILocalVariable(name: "ap", scope: !267, file: !3, line: 59, type: !103)
!282 = !DILocalVariable(name: "x", scope: !267, file: !3, line: 60, type: !33)
!283 = !DILocalVariable(name: "y", scope: !267, file: !3, line: 60, type: !33)
!284 = !DILocalVariable(name: "z", scope: !267, file: !3, line: 60, type: !33)
!285 = !DILocation(line: 0, scope: !267)
!286 = !DILocation(line: 62, column: 2, scope: !267)
!287 = !DILocation(line: 66, column: 25, scope: !288)
