; ModuleID = '/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/molio.c'
source_filename = "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/molio.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mat", scope: !2, file: !3, line: 164, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "getmatrix", scope: !3, file: !3, line: 159, type: !4, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !15, retainedNodes: !273)
!3 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/molio.c", directory: "/home/rouzbeh/Graduate/Research", checksumkind: CSK_MD5, checksum: "cdb33686aa1c4f7e8add621a7676e5be")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX_T", file: !8, line: 14, baseType: !9)
!8 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/Research", checksumkind: CSK_MD5, checksum: "e6947e1b068a9350a45ab4ee56d7a2de")
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !11)
!10 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!11 = !{!12, !12}
!12 = !DISubrange(count: 4)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = distinct !DICompileUnit(language: DW_LANG_C99, file: !16, producer: "clang version 14.0.0 (https://github.com/llvm/llvm-project.git 4327d39b15b22b9ee23582e5455df5b2a093fe8d)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !17, retainedTypes: !34, globals: !255, splitDebugInlining: false, nameTableKind: None)
!16 = !DIFile(filename: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/molio.c", directory: "/home/rouzbeh/Graduate/Research/LLVM/Active-Lane-Conslidation/test", checksumkind: CSK_MD5, checksum: "cdb33686aa1c4f7e8add621a7676e5be")
!17 = !{!18}
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 46, baseType: !20, size: 32, elements: !21)
!19 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!22 = !DIEnumerator(name: "_ISupper", value: 256)
!23 = !DIEnumerator(name: "_ISlower", value: 512)
!24 = !DIEnumerator(name: "_ISalpha", value: 1024)
!25 = !DIEnumerator(name: "_ISdigit", value: 2048)
!26 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!27 = !DIEnumerator(name: "_ISspace", value: 8192)
!28 = !DIEnumerator(name: "_ISprint", value: 16384)
!29 = !DIEnumerator(name: "_ISgraph", value: 32768)
!30 = !DIEnumerator(name: "_ISblank", value: 1)
!31 = !DIEnumerator(name: "_IScntrl", value: 2)
!32 = !DIEnumerator(name: "_ISpunct", value: 4)
!33 = !DIEnumerator(name: "_ISalnum", value: 8)
!34 = !{!35, !36, !38, !37, !13, !246, !247, !248}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !8, line: 82, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !8, line: 63, size: 1024, elements: !42)
!42 = !{!43, !45, !47, !48, !49, !52, !53, !54, !55, !56, !189, !199, !200, !206, !207, !216, !217, !218}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !41, file: !8, line: 64, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !41, file: !8, line: 65, baseType: !46, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !8, line: 6, baseType: !37)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !41, file: !8, line: 66, baseType: !46, size: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !41, file: !8, line: 67, baseType: !46, size: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !41, file: !8, line: 68, baseType: !50, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !8, line: 17, baseType: !14)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !41, file: !8, line: 69, baseType: !50, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !41, file: !8, line: 70, baseType: !46, size: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !41, file: !8, line: 71, baseType: !46, size: 32, offset: 352)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !41, file: !8, line: 72, baseType: !46, size: 32, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !41, file: !8, line: 73, baseType: !57, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !8, line: 84, size: 384, elements: !59)
!59 = !{!60, !61, !62, !63, !185, !186, !187, !188}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !58, file: !8, line: 85, baseType: !50, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !58, file: !8, line: 86, baseType: !46, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !58, file: !8, line: 87, baseType: !46, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !58, file: !8, line: 88, baseType: !64, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !8, line: 118, size: 1088, elements: !66)
!66 = !{!67, !72, !73, !76, !77, !78, !79}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !65, file: !8, line: 119, baseType: !68, size: 768)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !8, line: 13, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 768, elements: !70)
!70 = !{!12, !71}
!71 = !DISubrange(count: 3)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !65, file: !8, line: 120, baseType: !46, size: 32, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !65, file: !8, line: 121, baseType: !74, size: 64, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !8, line: 93, baseType: !58)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !65, file: !8, line: 122, baseType: !46, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !65, file: !8, line: 123, baseType: !46, size: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !65, file: !8, line: 124, baseType: !46, size: 32, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !65, file: !8, line: 125, baseType: !80, size: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !8, line: 115, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !8, line: 95, size: 5760, elements: !83)
!83 = !{!84, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !144, !145, !146, !147, !148, !149, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !82, file: !8, line: 96, baseType: !85, size: 648)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 648, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 81)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !82, file: !8, line: 97, baseType: !46, size: 32, offset: 672)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !82, file: !8, line: 97, baseType: !46, size: 32, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !82, file: !8, line: 97, baseType: !46, size: 32, offset: 736)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !82, file: !8, line: 98, baseType: !46, size: 32, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !82, file: !8, line: 98, baseType: !46, size: 32, offset: 800)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !82, file: !8, line: 98, baseType: !46, size: 32, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !82, file: !8, line: 98, baseType: !46, size: 32, offset: 864)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !82, file: !8, line: 98, baseType: !46, size: 32, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !82, file: !8, line: 98, baseType: !46, size: 32, offset: 928)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !82, file: !8, line: 99, baseType: !46, size: 32, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !82, file: !8, line: 99, baseType: !46, size: 32, offset: 992)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !82, file: !8, line: 99, baseType: !46, size: 32, offset: 1024)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !82, file: !8, line: 99, baseType: !46, size: 32, offset: 1056)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !82, file: !8, line: 99, baseType: !46, size: 32, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !82, file: !8, line: 99, baseType: !46, size: 32, offset: 1120)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !82, file: !8, line: 100, baseType: !46, size: 32, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !82, file: !8, line: 100, baseType: !46, size: 32, offset: 1184)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !82, file: !8, line: 100, baseType: !46, size: 32, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !82, file: !8, line: 100, baseType: !46, size: 32, offset: 1248)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !82, file: !8, line: 100, baseType: !46, size: 32, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !82, file: !8, line: 100, baseType: !46, size: 32, offset: 1312)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !82, file: !8, line: 101, baseType: !46, size: 32, offset: 1344)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !82, file: !8, line: 101, baseType: !46, size: 32, offset: 1376)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !82, file: !8, line: 101, baseType: !46, size: 32, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !82, file: !8, line: 101, baseType: !46, size: 32, offset: 1440)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !82, file: !8, line: 101, baseType: !46, size: 32, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !82, file: !8, line: 101, baseType: !46, size: 32, offset: 1504)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !82, file: !8, line: 101, baseType: !46, size: 32, offset: 1536)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !82, file: !8, line: 101, baseType: !46, size: 32, offset: 1568)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !82, file: !8, line: 102, baseType: !46, size: 32, offset: 1600)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !82, file: !8, line: 102, baseType: !46, size: 32, offset: 1632)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !82, file: !8, line: 102, baseType: !46, size: 32, offset: 1664)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !82, file: !8, line: 103, baseType: !50, size: 64, offset: 1728)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !82, file: !8, line: 103, baseType: !50, size: 64, offset: 1792)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !82, file: !8, line: 103, baseType: !50, size: 64, offset: 1856)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !82, file: !8, line: 103, baseType: !50, size: 64, offset: 1920)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !82, file: !8, line: 104, baseType: !125, size: 64, offset: 1984)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !82, file: !8, line: 104, baseType: !125, size: 64, offset: 2048)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !82, file: !8, line: 104, baseType: !125, size: 64, offset: 2112)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !82, file: !8, line: 104, baseType: !125, size: 64, offset: 2176)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !82, file: !8, line: 104, baseType: !125, size: 64, offset: 2240)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !82, file: !8, line: 104, baseType: !125, size: 64, offset: 2304)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !82, file: !8, line: 104, baseType: !125, size: 64, offset: 2368)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !82, file: !8, line: 104, baseType: !125, size: 64, offset: 2432)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !82, file: !8, line: 104, baseType: !125, size: 64, offset: 2496)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !82, file: !8, line: 105, baseType: !125, size: 64, offset: 2560)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !82, file: !8, line: 105, baseType: !125, size: 64, offset: 2624)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !82, file: !8, line: 105, baseType: !125, size: 64, offset: 2688)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !82, file: !8, line: 105, baseType: !125, size: 64, offset: 2752)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !82, file: !8, line: 105, baseType: !125, size: 64, offset: 2816)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !82, file: !8, line: 105, baseType: !125, size: 64, offset: 2880)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !82, file: !8, line: 105, baseType: !125, size: 64, offset: 2944)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !82, file: !8, line: 106, baseType: !142, size: 192, offset: 3008)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !143)
!143 = !{!71}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !82, file: !8, line: 106, baseType: !10, size: 64, offset: 3200)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !82, file: !8, line: 106, baseType: !10, size: 64, offset: 3264)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !82, file: !8, line: 106, baseType: !10, size: 64, offset: 3328)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !82, file: !8, line: 106, baseType: !10, size: 64, offset: 3392)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !82, file: !8, line: 106, baseType: !10, size: 64, offset: 3456)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !82, file: !8, line: 107, baseType: !150, size: 64, offset: 3520)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !82, file: !8, line: 107, baseType: !150, size: 64, offset: 3584)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !82, file: !8, line: 107, baseType: !150, size: 64, offset: 3648)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !82, file: !8, line: 107, baseType: !150, size: 64, offset: 3712)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !82, file: !8, line: 107, baseType: !150, size: 64, offset: 3776)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !82, file: !8, line: 107, baseType: !150, size: 64, offset: 3840)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !82, file: !8, line: 108, baseType: !150, size: 64, offset: 3904)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !82, file: !8, line: 108, baseType: !150, size: 64, offset: 3968)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !82, file: !8, line: 108, baseType: !150, size: 64, offset: 4032)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !82, file: !8, line: 108, baseType: !150, size: 64, offset: 4096)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !82, file: !8, line: 108, baseType: !150, size: 64, offset: 4160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !82, file: !8, line: 108, baseType: !150, size: 64, offset: 4224)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !82, file: !8, line: 109, baseType: !150, size: 64, offset: 4288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !82, file: !8, line: 109, baseType: !150, size: 64, offset: 4352)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !82, file: !8, line: 109, baseType: !150, size: 64, offset: 4416)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !82, file: !8, line: 109, baseType: !150, size: 64, offset: 4480)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !82, file: !8, line: 109, baseType: !150, size: 64, offset: 4544)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !82, file: !8, line: 110, baseType: !150, size: 64, offset: 4608)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !82, file: !8, line: 110, baseType: !150, size: 64, offset: 4672)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !82, file: !8, line: 110, baseType: !150, size: 64, offset: 4736)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !82, file: !8, line: 110, baseType: !150, size: 64, offset: 4800)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !82, file: !8, line: 110, baseType: !150, size: 64, offset: 4864)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !82, file: !8, line: 111, baseType: !150, size: 64, offset: 4928)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !82, file: !8, line: 111, baseType: !150, size: 64, offset: 4992)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !82, file: !8, line: 111, baseType: !150, size: 64, offset: 5056)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !82, file: !8, line: 111, baseType: !150, size: 64, offset: 5120)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !82, file: !8, line: 111, baseType: !150, size: 64, offset: 5184)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !82, file: !8, line: 111, baseType: !150, size: 64, offset: 5248)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !82, file: !8, line: 112, baseType: !150, size: 64, offset: 5312)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !82, file: !8, line: 112, baseType: !150, size: 64, offset: 5376)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !82, file: !8, line: 112, baseType: !150, size: 64, offset: 5440)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !82, file: !8, line: 112, baseType: !150, size: 64, offset: 5504)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !82, file: !8, line: 113, baseType: !150, size: 64, offset: 5568)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !82, file: !8, line: 113, baseType: !150, size: 64, offset: 5632)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !82, file: !8, line: 114, baseType: !125, size: 64, offset: 5696)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !58, file: !8, line: 89, baseType: !57, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !58, file: !8, line: 90, baseType: !46, size: 32, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !58, file: !8, line: 91, baseType: !46, size: 32, offset: 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !58, file: !8, line: 92, baseType: !38, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !41, file: !8, line: 74, baseType: !190, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !8, line: 52, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !8, line: 47, size: 192, elements: !193)
!193 = !{!194, !196, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !192, file: !8, line: 48, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !192, file: !8, line: 49, baseType: !46, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !192, file: !8, line: 50, baseType: !46, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !192, file: !8, line: 51, baseType: !46, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !41, file: !8, line: 75, baseType: !46, size: 32, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !41, file: !8, line: 76, baseType: !201, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !8, line: 54, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 2)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !41, file: !8, line: 77, baseType: !46, size: 32, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !41, file: !8, line: 78, baseType: !208, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !8, line: 61, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !8, line: 58, size: 192, elements: !211)
!211 = !{!212, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !210, file: !8, line: 59, baseType: !213, size: 128)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, elements: !214)
!214 = !{!12}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !210, file: !8, line: 60, baseType: !10, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !41, file: !8, line: 79, baseType: !46, size: 32, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !41, file: !8, line: 80, baseType: !150, size: 64, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !41, file: !8, line: 81, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !8, line: 45, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !8, line: 25, size: 1408, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !245}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !221, file: !8, line: 26, baseType: !50, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !221, file: !8, line: 27, baseType: !50, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !221, file: !8, line: 28, baseType: !46, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !221, file: !8, line: 29, baseType: !46, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !221, file: !8, line: 30, baseType: !228, size: 256, offset: 192)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 256, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 8)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !221, file: !8, line: 31, baseType: !44, size: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !221, file: !8, line: 32, baseType: !10, size: 64, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !221, file: !8, line: 33, baseType: !10, size: 64, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !221, file: !8, line: 34, baseType: !10, size: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !221, file: !8, line: 35, baseType: !10, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !221, file: !8, line: 36, baseType: !50, size: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !221, file: !8, line: 37, baseType: !46, size: 32, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !221, file: !8, line: 38, baseType: !10, size: 64, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !221, file: !8, line: 39, baseType: !10, size: 64, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !221, file: !8, line: 40, baseType: !46, size: 32, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !221, file: !8, line: 41, baseType: !46, size: 32, offset: 1056)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !221, file: !8, line: 42, baseType: !50, size: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !221, file: !8, line: 43, baseType: !244, size: 192, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !8, line: 12, baseType: !142)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !221, file: !8, line: 44, baseType: !10, size: 64, offset: 1344)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!247 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "CID_T", file: !3, line: 62, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cid_t", file: !3, line: 58, size: 128, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !250, file: !3, line: 59, baseType: !37, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "c_last", scope: !250, file: !3, line: 60, baseType: !37, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "c_cids", scope: !250, file: !3, line: 61, baseType: !13, size: 64, offset: 64)
!255 = !{!0, !256, !264, !266, !268}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "init", scope: !258, file: !3, line: 774, type: !37, isLocal: true, isDefinition: true)
!258 = distinct !DISubprogram(name: "init_atab", scope: !3, file: !3, line: 772, type: !259, scopeLine: 773, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !15, retainedNodes: !261)
!259 = !DISubroutineType(types: !260)
!260 = !{null}
!261 = !{!262, !263}
!262 = !DILocalVariable(name: "a", scope: !258, file: !3, line: 775, type: !37)
!263 = !DILocalVariable(name: "ap", scope: !258, file: !3, line: 776, type: !219)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "n_atab", scope: !15, file: !3, line: 70, type: !37, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "res", scope: !15, file: !3, line: 75, type: !40, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "atab", scope: !15, file: !3, line: 69, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 1408000, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 1000)
!273 = !{!274, !275, !334, !338, !339, !340, !341, !342, !343}
!274 = !DILocalVariable(name: "fname", arg: 1, scope: !2, file: !3, line: 159, type: !13)
!275 = !DILocalVariable(name: "fp", scope: !2, file: !3, line: 161, type: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !278, line: 7, baseType: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !280, line: 49, size: 1728, elements: !281)
!280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !297, !299, !300, !301, !305, !306, !308, !312, !315, !317, !320, !323, !324, !325, !329, !330}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !279, file: !280, line: 51, baseType: !37, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !279, file: !280, line: 54, baseType: !13, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !279, file: !280, line: 55, baseType: !13, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !279, file: !280, line: 56, baseType: !13, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !279, file: !280, line: 57, baseType: !13, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !279, file: !280, line: 58, baseType: !13, size: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !279, file: !280, line: 59, baseType: !13, size: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !279, file: !280, line: 60, baseType: !13, size: 64, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !279, file: !280, line: 61, baseType: !13, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !279, file: !280, line: 64, baseType: !13, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !279, file: !280, line: 65, baseType: !13, size: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !279, file: !280, line: 66, baseType: !13, size: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !279, file: !280, line: 68, baseType: !295, size: 64, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !280, line: 36, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !279, file: !280, line: 70, baseType: !298, size: 64, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !279, file: !280, line: 72, baseType: !37, size: 32, offset: 896)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !279, file: !280, line: 73, baseType: !37, size: 32, offset: 928)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !279, file: !280, line: 74, baseType: !302, size: 64, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !303, line: 152, baseType: !304)
!303 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!304 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !279, file: !280, line: 77, baseType: !247, size: 16, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !279, file: !280, line: 78, baseType: !307, size: 8, offset: 1040)
!307 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !279, file: !280, line: 79, baseType: !309, size: 8, offset: 1048)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 1)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !279, file: !280, line: 81, baseType: !313, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !280, line: 43, baseType: null)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !279, file: !280, line: 89, baseType: !316, size: 64, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !303, line: 153, baseType: !304)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !279, file: !280, line: 91, baseType: !318, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !280, line: 37, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !279, file: !280, line: 92, baseType: !321, size: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !280, line: 38, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !279, file: !280, line: 93, baseType: !298, size: 64, offset: 1344)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !279, file: !280, line: 94, baseType: !35, size: 64, offset: 1408)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !279, file: !280, line: 95, baseType: !326, size: 64, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !327, line: 46, baseType: !328)
!327 = !DIFile(filename: "llvm-project/build/lib/clang/14.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/Research/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!328 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !279, file: !280, line: 96, baseType: !37, size: 32, offset: 1536)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !279, file: !280, line: 98, baseType: !331, size: 160, offset: 1568)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 20)
!334 = !DILocalVariable(name: "line", scope: !2, file: !3, line: 162, type: !335)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 256)
!338 = !DILocalVariable(name: "r", scope: !2, file: !3, line: 163, type: !37)
!339 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 163, type: !37)
!340 = !DILocalVariable(name: "cnt", scope: !2, file: !3, line: 163, type: !37)
!341 = !DILocalVariable(name: "ptr", scope: !2, file: !3, line: 165, type: !35)
!342 = !DILocalVariable(name: "err", scope: !2, file: !3, line: 166, type: !37)
!343 = !DILabel(scope: !2, name: "CLEAN_UP", file: !3, line: 210)
!344 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!345 = !{i32 7, !"Dwarf Version", i32 5}
!346 = !{i32 2, !"Debug Info Version", i32 3}
!347 = !{i32 1, !"wchar_size", i32 4}
!348 = !{i32 7, !"uwtable", i32 1}
!349 = !{!"clang version 14.0.0 (https://github.com/llvm/llvm-project.git 4327d39b15b22b9ee23582e5455df5b2a093fe8d)"}
!350 = distinct !DISubprogram(name: "getpdb", scope: !3, file: !3, line: 121, type: !351, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !15, retainedNodes: !355)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !13, !13}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !8, line: 126, baseType: !65)
!355 = !{!356, !357, !358, !359, !360}
!356 = !DILocalVariable(name: "fname", arg: 1, scope: !350, file: !3, line: 121, type: !13)
!357 = !DILocalVariable(name: "options", arg: 2, scope: !350, file: !3, line: 121, type: !13)
!358 = !DILocalVariable(name: "fp", scope: !350, file: !3, line: 123, type: !276)
!359 = !DILocalVariable(name: "mol", scope: !350, file: !3, line: 124, type: !353)
!360 = !DILocalVariable(name: "ier", scope: !350, file: !3, line: 125, type: !37)
!361 = !DILocation(line: 0, scope: !350)
!362 = !DILocation(line: 127, column: 10, scope: !363)
!363 = distinct !DILexicalBlock(scope: !350, file: !3, line: 127, column: 9)
!364 = !DILocation(line: 127, column: 16, scope: !363)
!365 = !DILocation(line: 127, column: 20, scope: !363)
!366 = !{!367, !367, i64 0}
!367 = !{!"omnipotent char", !368, i64 0}
!368 = !{!"Simple C/C++ TBAA"}
!369 = !DILocation(line: 127, column: 9, scope: !350)
!370 = !DILocation(line: 128, column: 14, scope: !371)
!371 = distinct !DILexicalBlock(scope: !363, file: !3, line: 127, column: 28)
!372 = !{!373, !373, i64 0}
!373 = !{!"any pointer", !367, i64 0}
!374 = !DILocation(line: 129, column: 5, scope: !371)
!375 = !DILocation(line: 129, column: 17, scope: !376)
!376 = distinct !DILexicalBlock(scope: !363, file: !3, line: 129, column: 16)
!377 = !DILocation(line: 129, column: 16, scope: !363)
!378 = !DILocation(line: 130, column: 14, scope: !379)
!379 = distinct !DILexicalBlock(scope: !376, file: !3, line: 129, column: 37)
!380 = !DILocation(line: 131, column: 5, scope: !379)
!381 = !DILocation(line: 133, column: 13, scope: !382)
!382 = distinct !DILexicalBlock(scope: !383, file: !3, line: 133, column: 13)
!383 = distinct !DILexicalBlock(scope: !376, file: !3, line: 131, column: 12)
!384 = !DILocation(line: 133, column: 28, scope: !382)
!385 = !DILocation(line: 133, column: 13, scope: !383)
!386 = !DILocation(line: 134, column: 23, scope: !387)
!387 = distinct !DILexicalBlock(scope: !388, file: !3, line: 134, column: 17)
!388 = distinct !DILexicalBlock(scope: !382, file: !3, line: 133, column: 34)
!389 = !DILocation(line: 134, column: 42, scope: !387)
