; ModuleID = '/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/select_atoms.c'
source_filename = "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/select_atoms.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.extbond_t = type { %struct.extbond_t*, i32, i32, i32 }
%struct.chiral_t = type { [4 x i32], double }
%struct.atom_t = type { i8*, i8*, i32, i32, [8 x i32], %struct.residue_t*, double, double, double, double, i8*, i32, double, double, i32, i32, i8*, [3 x double], double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "aexpr", scope: !2, file: !28, line: 14, type: !37, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0 (https://github.com/llvm/llvm-project.git 4327d39b15b22b9ee23582e5455df5b2a093fe8d)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/select_atoms.c", directory: "/home/rouzbeh/Graduate/Research/LLVM/Active-Lane-Conslidation/test", checksumkind: CSK_MD5, checksum: "657eaa27113f1d60ac67ba476813e238")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !{!0, !26, !31, !33, !35, !40}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "spart", scope: !2, file: !28, line: 15, type: !29, isLocal: true, isDefinition: true)
!28 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/select_atoms.c", directory: "/home/rouzbeh/Graduate/Research", checksumkind: CSK_MD5, checksum: "657eaa27113f1d60ac67ba476813e238")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "rpart", scope: !2, file: !28, line: 16, type: !29, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "apart", scope: !2, file: !28, line: 17, type: !29, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "rexpr", scope: !2, file: !28, line: 20, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8000, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1000)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "expbuf", scope: !2, file: !28, line: 26, type: !37, isLocal: true, isDefinition: true)
!42 = !{i32 7, !"Dwarf Version", i32 5}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{i32 1, !"wchar_size", i32 4}
!45 = !{i32 7, !"uwtable", i32 1}
!46 = !{!"clang version 14.0.0 (https://github.com/llvm/llvm-project.git 4327d39b15b22b9ee23582e5455df5b2a093fe8d)"}
!47 = distinct !DISubprogram(name: "setpoint", scope: !28, file: !28, line: 54, type: !48, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !263)
!48 = !DISubroutineType(types: !49)
!49 = !{!23, !50, !29, !206}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !52, line: 126, baseType: !53)
!52 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/Research", checksumkind: CSK_MD5, checksum: "e6947e1b068a9350a45ab4ee56d7a2de")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !52, line: 118, size: 1088, elements: !54)
!54 = !{!55, !62, !64, !157, !158, !159, !160}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !53, file: !52, line: 119, baseType: !56, size: 768)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !52, line: 13, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 768, elements: !59)
!58 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!59 = !{!60, !61}
!60 = !DISubrange(count: 4)
!61 = !DISubrange(count: 3)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !53, file: !52, line: 120, baseType: !63, size: 32, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !52, line: 6, baseType: !23)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !53, file: !52, line: 121, baseType: !65, size: 64, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !52, line: 93, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !52, line: 84, size: 384, elements: !68)
!68 = !{!69, !72, !73, !74, !76, !78, !79, !80}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !67, file: !52, line: 85, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !52, line: 17, baseType: !30)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !67, file: !52, line: 86, baseType: !63, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !67, file: !52, line: 87, baseType: !63, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !67, file: !52, line: 88, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !67, file: !52, line: 89, baseType: !77, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !67, file: !52, line: 90, baseType: !63, size: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !67, file: !52, line: 91, baseType: !63, size: 32, offset: 288)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !67, file: !52, line: 92, baseType: !81, size: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !52, line: 82, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !52, line: 63, size: 1024, elements: !85)
!85 = !{!86, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !107, !108, !114, !115, !124, !125, !127}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !84, file: !52, line: 64, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !84, file: !52, line: 65, baseType: !63, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !84, file: !52, line: 66, baseType: !63, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !84, file: !52, line: 67, baseType: !63, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !84, file: !52, line: 68, baseType: !70, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !84, file: !52, line: 69, baseType: !70, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !84, file: !52, line: 70, baseType: !63, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !84, file: !52, line: 71, baseType: !63, size: 32, offset: 352)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !84, file: !52, line: 72, baseType: !63, size: 32, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !84, file: !52, line: 73, baseType: !77, size: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !84, file: !52, line: 74, baseType: !98, size: 64, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !52, line: 52, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !52, line: 47, size: 192, elements: !101)
!101 = !{!102, !104, !105, !106}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !100, file: !52, line: 48, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !100, file: !52, line: 49, baseType: !63, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !100, file: !52, line: 50, baseType: !63, size: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !100, file: !52, line: 51, baseType: !63, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !84, file: !52, line: 75, baseType: !63, size: 32, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !84, file: !52, line: 76, baseType: !109, size: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !52, line: 54, baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 2)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !84, file: !52, line: 77, baseType: !63, size: 32, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !84, file: !52, line: 78, baseType: !116, size: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !52, line: 61, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !52, line: 58, size: 192, elements: !119)
!119 = !{!120, !123}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !118, file: !52, line: 59, baseType: !121, size: 128)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !122)
!122 = !{!60}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !118, file: !52, line: 60, baseType: !58, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !84, file: !52, line: 79, baseType: !63, size: 32, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !84, file: !52, line: 80, baseType: !126, size: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !84, file: !52, line: 81, baseType: !128, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !52, line: 45, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !52, line: 25, size: 1408, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !156}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !130, file: !52, line: 26, baseType: !70, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !130, file: !52, line: 27, baseType: !70, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !130, file: !52, line: 28, baseType: !63, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !130, file: !52, line: 29, baseType: !63, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !130, file: !52, line: 30, baseType: !137, size: 256, offset: 192)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 256, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 8)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !130, file: !52, line: 31, baseType: !87, size: 64, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !130, file: !52, line: 32, baseType: !58, size: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !130, file: !52, line: 33, baseType: !58, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !130, file: !52, line: 34, baseType: !58, size: 64, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !130, file: !52, line: 35, baseType: !58, size: 64, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !130, file: !52, line: 36, baseType: !70, size: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !130, file: !52, line: 37, baseType: !63, size: 32, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !130, file: !52, line: 38, baseType: !58, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !130, file: !52, line: 39, baseType: !58, size: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !130, file: !52, line: 40, baseType: !63, size: 32, offset: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !130, file: !52, line: 41, baseType: !63, size: 32, offset: 1056)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !130, file: !52, line: 42, baseType: !70, size: 64, offset: 1088)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !130, file: !52, line: 43, baseType: !153, size: 192, offset: 1152)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !52, line: 12, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 192, elements: !155)
!155 = !{!61}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !130, file: !52, line: 44, baseType: !58, size: 64, offset: 1344)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !53, file: !52, line: 122, baseType: !63, size: 32, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !53, file: !52, line: 123, baseType: !63, size: 32, offset: 928)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !53, file: !52, line: 124, baseType: !63, size: 32, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !53, file: !52, line: 125, baseType: !161, size: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !52, line: 115, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !52, line: 95, size: 5760, elements: !164)
!164 = !{!165, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !163, file: !52, line: 96, baseType: !166, size: 648)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 648, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 81)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !163, file: !52, line: 97, baseType: !63, size: 32, offset: 672)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !163, file: !52, line: 97, baseType: !63, size: 32, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !163, file: !52, line: 97, baseType: !63, size: 32, offset: 736)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !163, file: !52, line: 98, baseType: !63, size: 32, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !163, file: !52, line: 98, baseType: !63, size: 32, offset: 800)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !163, file: !52, line: 98, baseType: !63, size: 32, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !163, file: !52, line: 98, baseType: !63, size: 32, offset: 864)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !163, file: !52, line: 98, baseType: !63, size: 32, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !163, file: !52, line: 98, baseType: !63, size: 32, offset: 928)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !163, file: !52, line: 99, baseType: !63, size: 32, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !163, file: !52, line: 99, baseType: !63, size: 32, offset: 992)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !163, file: !52, line: 99, baseType: !63, size: 32, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !163, file: !52, line: 99, baseType: !63, size: 32, offset: 1056)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !163, file: !52, line: 99, baseType: !63, size: 32, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !163, file: !52, line: 99, baseType: !63, size: 32, offset: 1120)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !163, file: !52, line: 100, baseType: !63, size: 32, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !163, file: !52, line: 100, baseType: !63, size: 32, offset: 1184)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !163, file: !52, line: 100, baseType: !63, size: 32, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !163, file: !52, line: 100, baseType: !63, size: 32, offset: 1248)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !163, file: !52, line: 100, baseType: !63, size: 32, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !163, file: !52, line: 100, baseType: !63, size: 32, offset: 1312)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !163, file: !52, line: 101, baseType: !63, size: 32, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !163, file: !52, line: 101, baseType: !63, size: 32, offset: 1376)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !163, file: !52, line: 101, baseType: !63, size: 32, offset: 1408)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !163, file: !52, line: 101, baseType: !63, size: 32, offset: 1440)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !163, file: !52, line: 101, baseType: !63, size: 32, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !163, file: !52, line: 101, baseType: !63, size: 32, offset: 1504)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !163, file: !52, line: 101, baseType: !63, size: 32, offset: 1536)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !163, file: !52, line: 101, baseType: !63, size: 32, offset: 1568)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !163, file: !52, line: 102, baseType: !63, size: 32, offset: 1600)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !163, file: !52, line: 102, baseType: !63, size: 32, offset: 1632)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !163, file: !52, line: 102, baseType: !63, size: 32, offset: 1664)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !163, file: !52, line: 103, baseType: !70, size: 64, offset: 1728)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !163, file: !52, line: 103, baseType: !70, size: 64, offset: 1792)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !163, file: !52, line: 103, baseType: !70, size: 64, offset: 1856)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !163, file: !52, line: 103, baseType: !70, size: 64, offset: 1920)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !163, file: !52, line: 104, baseType: !206, size: 64, offset: 1984)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !163, file: !52, line: 104, baseType: !206, size: 64, offset: 2048)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !163, file: !52, line: 104, baseType: !206, size: 64, offset: 2112)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !163, file: !52, line: 104, baseType: !206, size: 64, offset: 2176)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !163, file: !52, line: 104, baseType: !206, size: 64, offset: 2240)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !163, file: !52, line: 104, baseType: !206, size: 64, offset: 2304)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !163, file: !52, line: 104, baseType: !206, size: 64, offset: 2368)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !163, file: !52, line: 104, baseType: !206, size: 64, offset: 2432)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !163, file: !52, line: 104, baseType: !206, size: 64, offset: 2496)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !163, file: !52, line: 105, baseType: !206, size: 64, offset: 2560)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !163, file: !52, line: 105, baseType: !206, size: 64, offset: 2624)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !163, file: !52, line: 105, baseType: !206, size: 64, offset: 2688)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !163, file: !52, line: 105, baseType: !206, size: 64, offset: 2752)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !163, file: !52, line: 105, baseType: !206, size: 64, offset: 2816)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !163, file: !52, line: 105, baseType: !206, size: 64, offset: 2880)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !163, file: !52, line: 105, baseType: !206, size: 64, offset: 2944)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !163, file: !52, line: 106, baseType: !154, size: 192, offset: 3008)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !163, file: !52, line: 106, baseType: !58, size: 64, offset: 3200)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !163, file: !52, line: 106, baseType: !58, size: 64, offset: 3264)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !163, file: !52, line: 106, baseType: !58, size: 64, offset: 3328)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !163, file: !52, line: 106, baseType: !58, size: 64, offset: 3392)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !163, file: !52, line: 106, baseType: !58, size: 64, offset: 3456)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !163, file: !52, line: 107, baseType: !126, size: 64, offset: 3520)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !163, file: !52, line: 107, baseType: !126, size: 64, offset: 3584)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !163, file: !52, line: 107, baseType: !126, size: 64, offset: 3648)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !163, file: !52, line: 107, baseType: !126, size: 64, offset: 3712)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !163, file: !52, line: 107, baseType: !126, size: 64, offset: 3776)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !163, file: !52, line: 107, baseType: !126, size: 64, offset: 3840)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !163, file: !52, line: 108, baseType: !126, size: 64, offset: 3904)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !163, file: !52, line: 108, baseType: !126, size: 64, offset: 3968)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !163, file: !52, line: 108, baseType: !126, size: 64, offset: 4032)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !163, file: !52, line: 108, baseType: !126, size: 64, offset: 4096)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !163, file: !52, line: 108, baseType: !126, size: 64, offset: 4160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !163, file: !52, line: 108, baseType: !126, size: 64, offset: 4224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !163, file: !52, line: 109, baseType: !126, size: 64, offset: 4288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !163, file: !52, line: 109, baseType: !126, size: 64, offset: 4352)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !163, file: !52, line: 109, baseType: !126, size: 64, offset: 4416)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !163, file: !52, line: 109, baseType: !126, size: 64, offset: 4480)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !163, file: !52, line: 109, baseType: !126, size: 64, offset: 4544)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !163, file: !52, line: 110, baseType: !126, size: 64, offset: 4608)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !163, file: !52, line: 110, baseType: !126, size: 64, offset: 4672)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !163, file: !52, line: 110, baseType: !126, size: 64, offset: 4736)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !163, file: !52, line: 110, baseType: !126, size: 64, offset: 4800)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !163, file: !52, line: 110, baseType: !126, size: 64, offset: 4864)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !163, file: !52, line: 111, baseType: !126, size: 64, offset: 4928)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !163, file: !52, line: 111, baseType: !126, size: 64, offset: 4992)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !163, file: !52, line: 111, baseType: !126, size: 64, offset: 5056)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !163, file: !52, line: 111, baseType: !126, size: 64, offset: 5120)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !163, file: !52, line: 111, baseType: !126, size: 64, offset: 5184)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !163, file: !52, line: 111, baseType: !126, size: 64, offset: 5248)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !163, file: !52, line: 112, baseType: !126, size: 64, offset: 5312)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !163, file: !52, line: 112, baseType: !126, size: 64, offset: 5376)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !163, file: !52, line: 112, baseType: !126, size: 64, offset: 5440)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !163, file: !52, line: 112, baseType: !126, size: 64, offset: 5504)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !163, file: !52, line: 113, baseType: !126, size: 64, offset: 5568)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !163, file: !52, line: 113, baseType: !126, size: 64, offset: 5632)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !163, file: !52, line: 114, baseType: !206, size: 64, offset: 5696)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!264 = !DILocalVariable(name: "mol", arg: 1, scope: !47, file: !28, line: 54, type: !50)
!265 = !DILocalVariable(name: "aexpr", arg: 2, scope: !47, file: !28, line: 54, type: !29)
!266 = !DILocalVariable(name: "point", arg: 3, scope: !47, file: !28, line: 54, type: !206)
!267 = !DILocalVariable(name: "r", scope: !47, file: !28, line: 56, type: !23)
!268 = !DILocalVariable(name: "a", scope: !47, file: !28, line: 56, type: !23)
!269 = !DILocalVariable(name: "ta", scope: !47, file: !28, line: 56, type: !23)
!270 = !DILocalVariable(name: "sp", scope: !47, file: !28, line: 57, type: !65)
!271 = !DILocalVariable(name: "res", scope: !47, file: !28, line: 58, type: !82)
!272 = !DILocalVariable(name: "ap", scope: !47, file: !28, line: 59, type: !128)
!273 = !DILocalVariable(name: "x", scope: !47, file: !28, line: 60, type: !58)
!274 = !DILocalVariable(name: "y", scope: !47, file: !28, line: 60, type: !58)
!275 = !DILocalVariable(name: "z", scope: !47, file: !28, line: 60, type: !58)
!276 = !DILocation(line: 0, scope: !47)
!277 = !DILocation(line: 62, column: 2, scope: !47)
!278 = !DILocation(line: 66, column: 25, scope: !279)
!279 = distinct !DILexicalBlock(scope: !47, file: !28, line: 66, column: 2)
!280 = !DILocation(line: 0, scope: !279)
!281 = !{!282, !282, i64 0}
!282 = !{!"any pointer", !283, i64 0}
!283 = !{!"omnipotent char", !284, i64 0}
!284 = !{!"Simple C/C++ TBAA"}
!285 = !DILocation(line: 66, column: 2, scope: !279)
!286 = !DILocation(line: 67, column: 23, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !28, line: 67, column: 7)
!288 = distinct !DILexicalBlock(scope: !289, file: !28, line: 66, column: 57)
!289 = distinct !DILexicalBlock(scope: !279, file: !28, line: 66, column: 2)
!290 = !{!291, !292, i64 12}
!291 = !{!"strand_t", !282, i64 0, !292, i64 8, !292, i64 12, !282, i64 16, !282, i64 24, !292, i64 32, !292, i64 36, !282, i64 40}
!292 = !{!"int", !283, i64 0}
!293 = !DILocation(line: 67, column: 17, scope: !287)
!294 = !DILocation(line: 67, column: 7, scope: !288)
!295 = !{!291, !292, i64 32}
!296 = !DILocation(line: 68, column: 18, scope: !297)
!297 = distinct !DILexicalBlock(scope: !298, file: !28, line: 68, column: 4)
!298 = distinct !DILexicalBlock(scope: !299, file: !28, line: 68, column: 4)
!299 = distinct !DILexicalBlock(scope: !287, file: !28, line: 67, column: 31)
!300 = !DILocation(line: 68, column: 4, scope: !298)
!301 = !{!291, !282, i64 40}
!302 = !DILocation(line: 69, column: 11, scope: !303)
!303 = distinct !DILexicalBlock(scope: !297, file: !28, line: 68, column: 42)
!304 = !DILocation(line: 70, column: 26, scope: !305)
!305 = distinct !DILexicalBlock(scope: !303, file: !28, line: 70, column: 9)
!306 = !{!307, !292, i64 40}
!307 = !{!"residue_t", !282, i64 0, !292, i64 8, !292, i64 12, !292, i64 16, !282, i64 24, !282, i64 32, !292, i64 40, !292, i64 44, !292, i64 48, !282, i64 56, !282, i64 64, !292, i64 72, !282, i64 80, !292, i64 88, !282, i64 96, !292, i64 104, !282, i64 112, !282, i64 120}
!308 = !DILocation(line: 70, column: 19, scope: !305)
!309 = !DILocation(line: 70, column: 9, scope: !303)
!310 = !{!307, !292, i64 104}
!311 = !DILocation(line: 71, column: 20, scope: !312)
!312 = distinct !DILexicalBlock(scope: !313, file: !28, line: 71, column: 6)
!313 = distinct !DILexicalBlock(scope: !314, file: !28, line: 71, column: 6)
!314 = distinct !DILexicalBlock(scope: !305, file: !28, line: 70, column: 34)
!315 = !DILocation(line: 71, column: 6, scope: !313)
!316 = !{!307, !282, i64 120}
!317 = !DILocation(line: 73, column: 27, scope: !318)
!318 = distinct !DILexicalBlock(scope: !319, file: !28, line: 73, column: 11)
!319 = distinct !DILexicalBlock(scope: !312, file: !28, line: 71, column: 42)
!320 = !{!321, !292, i64 16}
