; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/filters/analyze.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/filters/analyze.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!294 = !DIEnumerator(name: "ImageError", value: 465)
!295 = !DIEnumerator(name: "WandError", value: 470)
!296 = !DIEnumerator(name: "RandomError", value: 475)
!297 = !DIEnumerator(name: "XServerError", value: 480)
!298 = !DIEnumerator(name: "MonitorError", value: 485)
!299 = !DIEnumerator(name: "RegistryError", value: 490)
!300 = !DIEnumerator(name: "ConfigureError", value: 495)
!301 = !DIEnumerator(name: "PolicyError", value: 499)
!302 = !DIEnumerator(name: "FatalErrorException", value: 700)
!303 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!304 = !DIEnumerator(name: "TypeFatalError", value: 705)
!305 = !DIEnumerator(name: "OptionFatalError", value: 710)
!306 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!307 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!308 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!309 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!310 = !DIEnumerator(name: "BlobFatalError", value: 735)
!311 = !DIEnumerator(name: "StreamFatalError", value: 740)
!312 = !DIEnumerator(name: "CacheFatalError", value: 745)
!313 = !DIEnumerator(name: "CoderFatalError", value: 750)
!314 = !DIEnumerator(name: "FilterFatalError", value: 752)
!315 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!316 = !DIEnumerator(name: "DrawFatalError", value: 760)
!317 = !DIEnumerator(name: "ImageFatalError", value: 765)
!318 = !DIEnumerator(name: "WandFatalError", value: 770)
!319 = !DIEnumerator(name: "RandomFatalError", value: 775)
!320 = !DIEnumerator(name: "XServerFatalError", value: 780)
!321 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!322 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!323 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!324 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 31, baseType: !5, size: 32, elements: !327)
!326 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!328 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!329 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!330 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!331 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!332 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!333 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!334 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!335 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!336 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!337 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!338 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!339 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!340 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!341 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 47, baseType: !5, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!344 = !DIEnumerator(name: "UndefinedType", value: 0)
!345 = !DIEnumerator(name: "BilevelType", value: 1)
!346 = !DIEnumerator(name: "GrayscaleType", value: 2)
!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!348 = !DIEnumerator(name: "PaletteType", value: 4)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!350 = !DIEnumerator(name: "TrueColorType", value: 6)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!354 = !DIEnumerator(name: "OptimizeType", value: 10)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !{!369, !425, !434, !591, !398, !380}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !372)
!372 = !{!373, !375, !377, !379, !383, !385, !387, !388, !389, !390, !391, !392, !403, !404, !405, !406, !408, !422, !424, !426, !428, !431, !432, !433, !439, !440, !441, !449, !450, !451, !452, !453, !454, !456, !458, !460, !462, !464, !466, !468, !469, !470, !471, !472, !473, !474, !482, !497, !511, !512, !513, !514, !518, !522, !526, !527, !528, !529, !530, !548, !549, !551, !552, !562, !563, !565, !566, !567, !568, !569, !570, !572, !573, !574, !575, !576, !577, !578, !580, !581, !582, !583, !584, !588, !590}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !371, file: !73, line: 153, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !371, file: !73, line: 156, baseType: !376, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !371, file: !73, line: 159, baseType: !378, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !371, file: !73, line: 162, baseType: !380, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !381, line: 46, baseType: !382)
!381 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!382 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !371, file: !73, line: 165, baseType: !384, size: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !371, file: !73, line: 168, baseType: !386, size: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !371, file: !73, line: 169, baseType: !386, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !371, file: !73, line: 172, baseType: !380, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !371, file: !73, line: 173, baseType: !380, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !371, file: !73, line: 174, baseType: !380, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !371, file: !73, line: 175, baseType: !380, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !371, file: !73, line: 178, baseType: !393, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !396)
!396 = !{!397, !400, !401, !402}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !395, file: !326, line: 143, baseType: !398, size: 16)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !399)
!399 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !395, file: !326, line: 144, baseType: !398, size: 16, offset: 16)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !395, file: !326, line: 145, baseType: !398, size: 16, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !395, file: !326, line: 146, baseType: !398, size: 16, offset: 48)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !371, file: !73, line: 179, baseType: !394, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !371, file: !73, line: 180, baseType: !394, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !371, file: !73, line: 181, baseType: !394, size: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !371, file: !73, line: 184, baseType: !407, size: 64, offset: 832)
!407 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !371, file: !73, line: 187, baseType: !409, size: 768, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !411)
!411 = !{!412, !419, !420, !421}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !410, file: !73, line: 124, baseType: !413, size: 192)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !414, file: !73, line: 98, baseType: !407, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !414, file: !73, line: 99, baseType: !407, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !414, file: !73, line: 100, baseType: !407, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !410, file: !73, line: 125, baseType: !413, size: 192, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !410, file: !73, line: 126, baseType: !413, size: 192, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !410, file: !73, line: 127, baseType: !413, size: 192, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !371, file: !73, line: 190, baseType: !423, size: 32, offset: 1664)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !371, file: !73, line: 193, baseType: !425, size: 64, offset: 1728)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !371, file: !73, line: 196, baseType: !427, size: 32, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !371, file: !73, line: 199, baseType: !429, size: 64, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !371, file: !73, line: 200, baseType: !429, size: 64, offset: 1920)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !371, file: !73, line: 201, baseType: !429, size: 64, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !371, file: !73, line: 204, baseType: !434, size: 64, offset: 2048)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !435, line: 77, baseType: !436)
!435 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !437, line: 193, baseType: !438)
!437 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!438 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !371, file: !73, line: 207, baseType: !407, size: 64, offset: 2112)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !371, file: !73, line: 208, baseType: !407, size: 64, offset: 2176)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !371, file: !73, line: 211, baseType: !442, size: 256, offset: 2240)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !443, file: !153, line: 124, baseType: !380, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !443, file: !153, line: 125, baseType: !380, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !443, file: !153, line: 128, baseType: !434, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !443, file: !153, line: 129, baseType: !434, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !371, file: !73, line: 212, baseType: !442, size: 256, offset: 2496)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !371, file: !73, line: 213, baseType: !442, size: 256, offset: 2752)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !371, file: !73, line: 216, baseType: !407, size: 64, offset: 3008)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !371, file: !73, line: 217, baseType: !407, size: 64, offset: 3072)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !371, file: !73, line: 218, baseType: !407, size: 64, offset: 3136)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !371, file: !73, line: 221, baseType: !455, size: 32, offset: 3200)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !371, file: !73, line: 224, baseType: !457, size: 32, offset: 3232)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !371, file: !73, line: 227, baseType: !459, size: 32, offset: 3264)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !371, file: !73, line: 230, baseType: !461, size: 32, offset: 3296)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !371, file: !73, line: 233, baseType: !463, size: 32, offset: 3328)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !371, file: !73, line: 236, baseType: !465, size: 32, offset: 3360)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !371, file: !73, line: 239, baseType: !467, size: 64, offset: 3392)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !371, file: !73, line: 242, baseType: !380, size: 64, offset: 3456)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !371, file: !73, line: 243, baseType: !380, size: 64, offset: 3520)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !371, file: !73, line: 246, baseType: !434, size: 64, offset: 3584)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !371, file: !73, line: 249, baseType: !380, size: 64, offset: 3648)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !371, file: !73, line: 250, baseType: !380, size: 64, offset: 3712)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !371, file: !73, line: 253, baseType: !434, size: 64, offset: 3776)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !371, file: !73, line: 256, baseType: !475, size: 192, offset: 3840)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !476, line: 68, baseType: !477)
!476 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !476, line: 62, size: 192, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !477, file: !476, line: 65, baseType: !407, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !477, file: !476, line: 66, baseType: !407, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !477, file: !476, line: 67, baseType: !407, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !371, file: !73, line: 259, baseType: !483, size: 512, offset: 4032)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !485)
!485 = !{!486, !493, !494, !496}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !484, file: !247, line: 43, baseType: !487, size: 192)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !488, file: !247, line: 35, baseType: !407, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !488, file: !247, line: 36, baseType: !407, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !488, file: !247, line: 37, baseType: !407, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !484, file: !247, line: 44, baseType: !487, size: 192, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !484, file: !247, line: 47, baseType: !495, size: 32, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !484, file: !247, line: 50, baseType: !380, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !371, file: !73, line: 262, baseType: !498, size: 64, offset: 4544)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !499, line: 26, baseType: !500)
!499 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!386, !503, !505, !508, !425}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !507)
!507 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !510)
!510 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !371, file: !73, line: 265, baseType: !425, size: 64, offset: 4608)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !371, file: !73, line: 266, baseType: !425, size: 64, offset: 4672)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !371, file: !73, line: 267, baseType: !425, size: 64, offset: 4736)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !371, file: !73, line: 270, baseType: !515, size: 64, offset: 4800)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !517)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !371, file: !73, line: 273, baseType: !519, size: 64, offset: 4864)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !521)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !371, file: !73, line: 276, baseType: !523, size: 32768, offset: 4928)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 32768, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 4096)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !371, file: !73, line: 277, baseType: !523, size: 32768, offset: 37696)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !371, file: !73, line: 278, baseType: !523, size: 32768, offset: 70464)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !371, file: !73, line: 281, baseType: !380, size: 64, offset: 103232)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !371, file: !73, line: 282, baseType: !380, size: 64, offset: 103296)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !371, file: !73, line: 285, baseType: !531, size: 448, offset: 103360)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !533)
!533 = !{!534, !536, !538, !539, !540, !541, !542, !547}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !532, file: !253, line: 105, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !532, file: !253, line: 108, baseType: !537, size: 32, offset: 32)
!537 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !532, file: !253, line: 111, baseType: !429, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !532, file: !253, line: 112, baseType: !429, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !532, file: !253, line: 115, baseType: !425, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !532, file: !253, line: 118, baseType: !386, size: 32, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !532, file: !253, line: 121, baseType: !543, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !545, line: 26, baseType: !546)
!545 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !545, line: 25, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !532, file: !253, line: 124, baseType: !380, size: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !371, file: !73, line: 288, baseType: !386, size: 32, offset: 103808)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !371, file: !73, line: 291, baseType: !550, size: 64, offset: 103872)
!550 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !434)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !371, file: !73, line: 294, baseType: !543, size: 64, offset: 103936)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !371, file: !73, line: 297, baseType: !553, size: 256, offset: 104000)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !555)
!555 = !{!556, !557, !558, !561}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !554, file: !89, line: 30, baseType: !429, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !554, file: !89, line: 33, baseType: !380, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !554, file: !89, line: 36, baseType: !559, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !554, file: !89, line: 39, baseType: !380, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !371, file: !73, line: 298, baseType: !553, size: 256, offset: 104256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !371, file: !73, line: 299, baseType: !564, size: 64, offset: 104512)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !371, file: !73, line: 302, baseType: !380, size: 64, offset: 104576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !371, file: !73, line: 305, baseType: !380, size: 64, offset: 104640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !371, file: !73, line: 308, baseType: !467, size: 64, offset: 104704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !371, file: !73, line: 309, baseType: !467, size: 64, offset: 104768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !73, line: 310, baseType: !467, size: 64, offset: 104832)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !371, file: !73, line: 313, baseType: !571, size: 32, offset: 104896)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !371, file: !73, line: 316, baseType: !386, size: 32, offset: 104928)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !371, file: !73, line: 319, baseType: !394, size: 64, offset: 104960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !371, file: !73, line: 322, baseType: !467, size: 64, offset: 105024)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !371, file: !73, line: 325, baseType: !442, size: 256, offset: 105088)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !371, file: !73, line: 328, baseType: !425, size: 64, offset: 105344)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !371, file: !73, line: 329, baseType: !425, size: 64, offset: 105408)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !371, file: !73, line: 332, baseType: !579, size: 32, offset: 105472)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !371, file: !73, line: 335, baseType: !386, size: 32, offset: 105504)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !371, file: !73, line: 338, baseType: !509, size: 64, offset: 105536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !371, file: !73, line: 341, baseType: !386, size: 32, offset: 105600)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !371, file: !73, line: 344, baseType: !380, size: 64, offset: 105664)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !371, file: !73, line: 347, baseType: !585, size: 64, offset: 105728)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !586, line: 7, baseType: !587)
!586 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !437, line: 160, baseType: !438)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !371, file: !73, line: 350, baseType: !589, size: 32, offset: 105792)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !371, file: !73, line: 353, baseType: !380, size: 64, offset: 105856)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!593 = !{i32 7, !"Dwarf Version", i32 5}
!594 = !{i32 2, !"Debug Info Version", i32 3}
!595 = !{i32 1, !"wchar_size", i32 4}
!596 = !{i32 7, !"PIC Level", i32 2}
!597 = !{i32 7, !"PIE Level", i32 2}
!598 = !{i32 7, !"uwtable", i32 2}
!599 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!600 = distinct !DISubprogram(name: "analyzeImage", scope: !601, file: !601, line: 80, type: !602, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !608)
!601 = !DIFile(filename: "apps/538.imagick_r/src/filters/analyze.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c77b3dc8fbfcb4c947f16bf102a8beb8")
!602 = !DISubroutineType(types: !603)
!603 = !{!380, !604, !605, !606, !607}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !643, !644, !645, !649}
!609 = !DILocalVariable(name: "images", arg: 1, scope: !600, file: !601, line: 80, type: !604)
!610 = !DILocalVariable(name: "argc", arg: 2, scope: !600, file: !601, line: 80, type: !605)
!611 = !DILocalVariable(name: "argv", arg: 3, scope: !600, file: !601, line: 81, type: !606)
!612 = !DILocalVariable(name: "exception", arg: 4, scope: !600, file: !601, line: 81, type: !607)
!613 = !DILocalVariable(name: "text", scope: !600, file: !601, line: 84, type: !523)
!614 = !DILocalVariable(name: "area", scope: !600, file: !601, line: 87, type: !407)
!615 = !DILocalVariable(name: "brightness", scope: !600, file: !601, line: 88, type: !407)
!616 = !DILocalVariable(name: "brightness_mean", scope: !600, file: !601, line: 89, type: !407)
!617 = !DILocalVariable(name: "brightness_standard_deviation", scope: !600, file: !601, line: 90, type: !407)
!618 = !DILocalVariable(name: "brightness_kurtosis", scope: !600, file: !601, line: 91, type: !407)
!619 = !DILocalVariable(name: "brightness_skewness", scope: !600, file: !601, line: 92, type: !407)
!620 = !DILocalVariable(name: "brightness_sum_x", scope: !600, file: !601, line: 93, type: !407)
!621 = !DILocalVariable(name: "brightness_sum_x2", scope: !600, file: !601, line: 94, type: !407)
!622 = !DILocalVariable(name: "brightness_sum_x3", scope: !600, file: !601, line: 95, type: !407)
!623 = !DILocalVariable(name: "brightness_sum_x4", scope: !600, file: !601, line: 96, type: !407)
!624 = !DILocalVariable(name: "hue", scope: !600, file: !601, line: 97, type: !407)
!625 = !DILocalVariable(name: "saturation", scope: !600, file: !601, line: 98, type: !407)
!626 = !DILocalVariable(name: "saturation_mean", scope: !600, file: !601, line: 99, type: !407)
!627 = !DILocalVariable(name: "saturation_standard_deviation", scope: !600, file: !601, line: 100, type: !407)
!628 = !DILocalVariable(name: "saturation_kurtosis", scope: !600, file: !601, line: 101, type: !407)
!629 = !DILocalVariable(name: "saturation_skewness", scope: !600, file: !601, line: 102, type: !407)
!630 = !DILocalVariable(name: "saturation_sum_x", scope: !600, file: !601, line: 103, type: !407)
!631 = !DILocalVariable(name: "saturation_sum_x2", scope: !600, file: !601, line: 104, type: !407)
!632 = !DILocalVariable(name: "saturation_sum_x3", scope: !600, file: !601, line: 105, type: !407)
