; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/animate.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/animate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!414 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!415 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!416 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!417 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!418 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!419 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!420 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!421 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!422 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 27, baseType: !5, size: 32, elements: !425)
!424 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!426 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!427 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!428 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!429 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!430 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!431 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!432 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!433 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!434 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!435 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!436 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!437 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!438 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!439 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!440 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!441 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!442 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!443 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!444 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !445, line: 34, baseType: !5, size: 32, elements: !446)
!445 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!447 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!448 = !DIEnumerator(name: "NoEvents", value: 0)
!449 = !DIEnumerator(name: "TraceEvent", value: 1)
!450 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!451 = !DIEnumerator(name: "BlobEvent", value: 4)
!452 = !DIEnumerator(name: "CacheEvent", value: 8)
!453 = !DIEnumerator(name: "CoderEvent", value: 16)
!454 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!455 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!456 = !DIEnumerator(name: "DrawEvent", value: 128)
!457 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!458 = !DIEnumerator(name: "ImageEvent", value: 512)
!459 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!460 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!461 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!462 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!463 = !DIEnumerator(name: "TransformEvent", value: 16384)
!464 = !DIEnumerator(name: "UserEvent", value: 36864)
!465 = !DIEnumerator(name: "WandEvent", value: 65536)
!466 = !DIEnumerator(name: "X11Event", value: 131072)
!467 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!468 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!469 = !{!470}
!470 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!471 = !{i32 7, !"Dwarf Version", i32 5}
!472 = !{i32 2, !"Debug Info Version", i32 3}
!473 = !{i32 1, !"wchar_size", i32 4}
!474 = !{i32 7, !"PIC Level", i32 2}
!475 = !{i32 7, !"PIE Level", i32 2}
!476 = !{i32 7, !"uwtable", i32 2}
!477 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!478 = distinct !DISubprogram(name: "AnimateImages", scope: !479, file: !479, line: 3023, type: !480, scopeLine: 3025, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !836)
!479 = !DIFile(filename: "apps/538.imagick_r/src/magick/animate.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3922204ccda8b8c2edd7cca988d7959d")
!480 = !DISubroutineType(types: !481)
!481 = !{!482, !483, !556}
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !35, line: 356, size: 134336, elements: !487)
!487 = !{!488, !490, !492, !493, !494, !495, !496, !499, !500, !501, !502, !505, !506, !507, !509, !511, !513, !514, !515, !516, !517, !518, !519, !521, !522, !532, !533, !534, !535, !536, !537, !539, !541, !543, !549, !550, !551, !552, !553, !555, !750, !751, !752, !753, !754, !765, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !833, !834, !835}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !486, file: !35, line: 359, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !10, line: 49, baseType: !9)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !486, file: !35, line: 362, baseType: !491, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !35, line: 86, baseType: !34)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !486, file: !35, line: 365, baseType: !482, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !486, file: !35, line: 366, baseType: !482, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !486, file: !35, line: 367, baseType: !482, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !486, file: !35, line: 368, baseType: !482, size: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !486, file: !35, line: 371, baseType: !497, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !486, file: !35, line: 372, baseType: !497, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !486, file: !35, line: 373, baseType: !497, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !486, file: !35, line: 374, baseType: !497, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !486, file: !35, line: 377, baseType: !503, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !504, line: 46, baseType: !470)
!504 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!505 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !486, file: !35, line: 378, baseType: !503, size: 64, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !486, file: !35, line: 379, baseType: !503, size: 64, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !486, file: !35, line: 382, baseType: !508, size: 32, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !35, line: 73, baseType: !46)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !486, file: !35, line: 385, baseType: !510, size: 32, offset: 672)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !57, line: 35, baseType: !56)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !486, file: !35, line: 388, baseType: !512, size: 32, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !35, line: 93, baseType: !62)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !486, file: !35, line: 391, baseType: !503, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !486, file: !35, line: 394, baseType: !497, size: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !486, file: !35, line: 395, baseType: !497, size: 64, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !486, file: !35, line: 396, baseType: !497, size: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !486, file: !35, line: 397, baseType: !497, size: 64, offset: 1024)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !486, file: !35, line: 398, baseType: !497, size: 64, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !486, file: !35, line: 401, baseType: !520, size: 64, offset: 1152)
!520 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !486, file: !35, line: 402, baseType: !520, size: 64, offset: 1216)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !486, file: !35, line: 405, baseType: !523, size: 64, offset: 1280)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !525)
!525 = !{!526, !529, !530, !531}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !524, file: !395, line: 143, baseType: !527, size: 16)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !528)
!528 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !524, file: !395, line: 144, baseType: !527, size: 16, offset: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !524, file: !395, line: 145, baseType: !527, size: 16, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !524, file: !395, line: 146, baseType: !527, size: 16, offset: 48)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !486, file: !35, line: 406, baseType: !523, size: 64, offset: 1344)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !486, file: !35, line: 407, baseType: !523, size: 64, offset: 1408)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !486, file: !35, line: 410, baseType: !482, size: 32, offset: 1472)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !486, file: !35, line: 411, baseType: !482, size: 32, offset: 1504)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !486, file: !35, line: 414, baseType: !503, size: 64, offset: 1536)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !486, file: !35, line: 417, baseType: !538, size: 32, offset: 1600)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !68, line: 61, baseType: !67)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !35, line: 420, baseType: !540, size: 32, offset: 1632)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !35, line: 61, baseType: !104)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !486, file: !35, line: 423, baseType: !542, size: 32, offset: 1664)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !119, line: 59, baseType: !118)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !486, file: !35, line: 426, baseType: !544, size: 64, offset: 1728)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !545, line: 77, baseType: !546)
!545 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !547, line: 193, baseType: !548)
!547 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!548 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !486, file: !35, line: 429, baseType: !482, size: 32, offset: 1792)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !486, file: !35, line: 430, baseType: !482, size: 32, offset: 1824)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !486, file: !35, line: 433, baseType: !497, size: 64, offset: 1856)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !486, file: !35, line: 434, baseType: !497, size: 64, offset: 1920)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !486, file: !35, line: 437, baseType: !554, size: 32, offset: 1984)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !151)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !486, file: !35, line: 440, baseType: !556, size: 64, offset: 2048)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !35, line: 150, size: 105920, elements: !559)
!559 = !{!560, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !574, !575, !576, !577, !578, !592, !594, !596, !597, !598, !599, !600, !601, !602, !603, !611, !612, !613, !614, !615, !616, !618, !619, !620, !622, !624, !626, !628, !629, !630, !631, !632, !633, !634, !642, !657, !671, !672, !673, !674, !678, !682, !686, !687, !688, !689, !690, !708, !709, !711, !712, !722, !723, !725, !726, !727, !728, !729, !730, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !747, !749}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !558, file: !35, line: 153, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !173)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !558, file: !35, line: 156, baseType: !538, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !558, file: !35, line: 159, baseType: !489, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !558, file: !35, line: 162, baseType: !503, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !558, file: !35, line: 165, baseType: !491, size: 32, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !558, file: !35, line: 168, baseType: !482, size: 32, offset: 224)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !558, file: !35, line: 169, baseType: !482, size: 32, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !558, file: !35, line: 172, baseType: !503, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !558, file: !35, line: 173, baseType: !503, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !558, file: !35, line: 174, baseType: !503, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !558, file: !35, line: 175, baseType: !503, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !558, file: !35, line: 178, baseType: !573, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !558, file: !35, line: 179, baseType: !523, size: 64, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !558, file: !35, line: 180, baseType: !523, size: 64, offset: 704)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !558, file: !35, line: 181, baseType: !523, size: 64, offset: 768)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !558, file: !35, line: 184, baseType: !520, size: 64, offset: 832)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !558, file: !35, line: 187, baseType: !579, size: 768, offset: 896)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !35, line: 128, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !35, line: 121, size: 768, elements: !581)
!581 = !{!582, !589, !590, !591}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !580, file: !35, line: 124, baseType: !583, size: 192)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !35, line: 101, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !35, line: 95, size: 192, elements: !585)
!585 = !{!586, !587, !588}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !584, file: !35, line: 98, baseType: !520, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !584, file: !35, line: 99, baseType: !520, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !584, file: !35, line: 100, baseType: !520, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !580, file: !35, line: 125, baseType: !583, size: 192, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !580, file: !35, line: 126, baseType: !583, size: 192, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !580, file: !35, line: 127, baseType: !583, size: 192, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !558, file: !35, line: 190, baseType: !593, size: 32, offset: 1664)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !179, line: 49, baseType: !178)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !558, file: !35, line: 193, baseType: !595, size: 64, offset: 1728)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !558, file: !35, line: 196, baseType: !512, size: 32, offset: 1792)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !558, file: !35, line: 199, baseType: !497, size: 64, offset: 1856)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !558, file: !35, line: 200, baseType: !497, size: 64, offset: 1920)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !558, file: !35, line: 201, baseType: !497, size: 64, offset: 1984)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !558, file: !35, line: 204, baseType: !544, size: 64, offset: 2048)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !558, file: !35, line: 207, baseType: !520, size: 64, offset: 2112)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !558, file: !35, line: 208, baseType: !520, size: 64, offset: 2176)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !558, file: !35, line: 211, baseType: !604, size: 256, offset: 2240)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !222, line: 130, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !222, line: 121, size: 256, elements: !606)
!606 = !{!607, !608, !609, !610}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !605, file: !222, line: 124, baseType: !503, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !605, file: !222, line: 125, baseType: !503, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !605, file: !222, line: 128, baseType: !544, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !605, file: !222, line: 129, baseType: !544, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !558, file: !35, line: 212, baseType: !604, size: 256, offset: 2496)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !558, file: !35, line: 213, baseType: !604, size: 256, offset: 2752)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !558, file: !35, line: 216, baseType: !520, size: 64, offset: 3008)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !558, file: !35, line: 217, baseType: !520, size: 64, offset: 3072)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !558, file: !35, line: 218, baseType: !520, size: 64, offset: 3136)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !558, file: !35, line: 221, baseType: !617, size: 32, offset: 3200)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !187, line: 66, baseType: !186)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !558, file: !35, line: 224, baseType: !508, size: 32, offset: 3232)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !558, file: !35, line: 227, baseType: !510, size: 32, offset: 3264)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !558, file: !35, line: 230, baseType: !621, size: 32, offset: 3296)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !222, line: 91, baseType: !221)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !558, file: !35, line: 233, baseType: !623, size: 32, offset: 3328)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !237, line: 99, baseType: !236)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !558, file: !35, line: 236, baseType: !625, size: 32, offset: 3360)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !308, line: 32, baseType: !307)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !558, file: !35, line: 239, baseType: !627, size: 64, offset: 3392)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !558, file: !35, line: 242, baseType: !503, size: 64, offset: 3456)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !558, file: !35, line: 243, baseType: !503, size: 64, offset: 3520)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !558, file: !35, line: 246, baseType: !544, size: 64, offset: 3584)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !558, file: !35, line: 249, baseType: !503, size: 64, offset: 3648)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !558, file: !35, line: 250, baseType: !503, size: 64, offset: 3712)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !558, file: !35, line: 253, baseType: !544, size: 64, offset: 3776)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !558, file: !35, line: 256, baseType: !635, size: 192, offset: 3840)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !636, line: 68, baseType: !637)
!636 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !636, line: 62, size: 192, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !637, file: !636, line: 65, baseType: !520, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !637, file: !636, line: 66, baseType: !520, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !637, file: !636, line: 67, baseType: !520, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !558, file: !35, line: 259, baseType: !643, size: 512, offset: 4032)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !316, line: 51, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !316, line: 40, size: 512, elements: !645)
!645 = !{!646, !653, !654, !656}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !644, file: !316, line: 43, baseType: !647, size: 192)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !316, line: 38, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !316, line: 32, size: 192, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !648, file: !316, line: 35, baseType: !520, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !648, file: !316, line: 36, baseType: !520, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !648, file: !316, line: 37, baseType: !520, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !644, file: !316, line: 44, baseType: !647, size: 192, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !644, file: !316, line: 47, baseType: !655, size: 32, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !316, line: 30, baseType: !315)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !644, file: !316, line: 50, baseType: !503, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !558, file: !35, line: 262, baseType: !658, size: 64, offset: 4544)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !659, line: 26, baseType: !660)
!659 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!482, !663, !665, !668, !595}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !667)
!667 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !670)
!670 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !558, file: !35, line: 265, baseType: !595, size: 64, offset: 4608)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !558, file: !35, line: 266, baseType: !595, size: 64, offset: 4672)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !558, file: !35, line: 267, baseType: !595, size: 64, offset: 4736)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !558, file: !35, line: 270, baseType: !675, size: 64, offset: 4800)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !10, line: 52, baseType: !677)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !10, line: 51, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !558, file: !35, line: 273, baseType: !679, size: 64, offset: 4864)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !681)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !558, file: !35, line: 276, baseType: !683, size: 32768, offset: 4928)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 32768, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 4096)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !558, file: !35, line: 277, baseType: !683, size: 32768, offset: 37696)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !558, file: !35, line: 278, baseType: !683, size: 32768, offset: 70464)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !558, file: !35, line: 281, baseType: !503, size: 64, offset: 103232)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !558, file: !35, line: 282, baseType: !503, size: 64, offset: 103296)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !558, file: !35, line: 285, baseType: !691, size: 448, offset: 103360)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !322, line: 102, size: 448, elements: !693)
!693 = !{!694, !696, !698, !699, !700, !701, !702, !707}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !692, file: !322, line: 105, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !322, line: 100, baseType: !321)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !692, file: !322, line: 108, baseType: !697, size: 32, offset: 32)
!697 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !692, file: !322, line: 111, baseType: !497, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !692, file: !322, line: 112, baseType: !497, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !692, file: !322, line: 115, baseType: !595, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !692, file: !322, line: 118, baseType: !482, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !692, file: !322, line: 121, baseType: !703, size: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !705, line: 26, baseType: !706)
!705 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !705, line: 25, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !692, file: !322, line: 124, baseType: !503, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !558, file: !35, line: 288, baseType: !482, size: 32, offset: 103808)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !558, file: !35, line: 291, baseType: !710, size: 64, offset: 103872)
!710 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !544)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !558, file: !35, line: 294, baseType: !703, size: 64, offset: 103936)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !558, file: !35, line: 297, baseType: !713, size: 256, offset: 104000)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !179, line: 40, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !179, line: 27, size: 256, elements: !715)
!715 = !{!716, !717, !718, !721}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !714, file: !179, line: 30, baseType: !497, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !714, file: !179, line: 33, baseType: !503, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !714, file: !179, line: 36, baseType: !719, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !714, file: !179, line: 39, baseType: !503, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !558, file: !35, line: 298, baseType: !713, size: 256, offset: 104256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !558, file: !35, line: 299, baseType: !724, size: 64, offset: 104512)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !558, file: !35, line: 302, baseType: !503, size: 64, offset: 104576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !558, file: !35, line: 305, baseType: !503, size: 64, offset: 104640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !558, file: !35, line: 308, baseType: !627, size: 64, offset: 104704)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !558, file: !35, line: 309, baseType: !627, size: 64, offset: 104768)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !35, line: 310, baseType: !627, size: 64, offset: 104832)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !558, file: !35, line: 313, baseType: !731, size: 32, offset: 104896)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !558, file: !35, line: 316, baseType: !482, size: 32, offset: 104928)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !558, file: !35, line: 319, baseType: !523, size: 64, offset: 104960)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !558, file: !35, line: 322, baseType: !627, size: 64, offset: 105024)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !558, file: !35, line: 325, baseType: !604, size: 256, offset: 105088)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !558, file: !35, line: 328, baseType: !595, size: 64, offset: 105344)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !558, file: !35, line: 329, baseType: !595, size: 64, offset: 105408)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !558, file: !35, line: 332, baseType: !540, size: 32, offset: 105472)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !558, file: !35, line: 335, baseType: !482, size: 32, offset: 105504)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !558, file: !35, line: 338, baseType: !669, size: 64, offset: 105536)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !558, file: !35, line: 341, baseType: !482, size: 32, offset: 105600)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !558, file: !35, line: 344, baseType: !503, size: 64, offset: 105664)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !558, file: !35, line: 347, baseType: !744, size: 64, offset: 105728)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !745, line: 7, baseType: !746)
!745 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !547, line: 160, baseType: !548)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !558, file: !35, line: 350, baseType: !748, size: 32, offset: 105792)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !558, file: !35, line: 353, baseType: !503, size: 64, offset: 105856)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !486, file: !35, line: 443, baseType: !595, size: 64, offset: 2112)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !486, file: !35, line: 446, baseType: !658, size: 64, offset: 2176)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !486, file: !35, line: 449, baseType: !595, size: 64, offset: 2240)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !486, file: !35, line: 450, baseType: !595, size: 64, offset: 2304)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !486, file: !35, line: 453, baseType: !755, size: 64, offset: 2368)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !756, line: 26, baseType: !757)
!756 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!503, !760, !762, !764}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !486, file: !35, line: 456, baseType: !766, size: 64, offset: 2432)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !768, line: 7, baseType: !769)
!768 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !770, line: 49, size: 1728, elements: !771)
!770 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !787, !789, !790, !791, !793, !794, !796, !800, !803, !805, !808, !811, !812, !813, !814, !815}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !769, file: !770, line: 51, baseType: !697, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !769, file: !770, line: 54, baseType: !497, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !769, file: !770, line: 55, baseType: !497, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !769, file: !770, line: 56, baseType: !497, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !769, file: !770, line: 57, baseType: !497, size: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !769, file: !770, line: 58, baseType: !497, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !769, file: !770, line: 59, baseType: !497, size: 64, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !769, file: !770, line: 60, baseType: !497, size: 64, offset: 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !769, file: !770, line: 61, baseType: !497, size: 64, offset: 512)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !769, file: !770, line: 64, baseType: !497, size: 64, offset: 576)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !769, file: !770, line: 65, baseType: !497, size: 64, offset: 640)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !769, file: !770, line: 66, baseType: !497, size: 64, offset: 704)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !769, file: !770, line: 68, baseType: !785, size: 64, offset: 768)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !770, line: 36, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !769, file: !770, line: 70, baseType: !788, size: 64, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !769, file: !770, line: 72, baseType: !697, size: 32, offset: 896)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !769, file: !770, line: 73, baseType: !697, size: 32, offset: 928)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !769, file: !770, line: 74, baseType: !792, size: 64, offset: 960)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !547, line: 152, baseType: !548)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !769, file: !770, line: 77, baseType: !528, size: 16, offset: 1024)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !769, file: !770, line: 78, baseType: !795, size: 8, offset: 1040)
!795 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !769, file: !770, line: 79, baseType: !797, size: 8, offset: 1048)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 8, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 1)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !769, file: !770, line: 81, baseType: !801, size: 64, offset: 1088)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !770, line: 43, baseType: null)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !769, file: !770, line: 89, baseType: !804, size: 64, offset: 1152)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !547, line: 153, baseType: !548)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !769, file: !770, line: 91, baseType: !806, size: 64, offset: 1216)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !770, line: 37, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !769, file: !770, line: 92, baseType: !809, size: 64, offset: 1280)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !770, line: 38, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !769, file: !770, line: 93, baseType: !788, size: 64, offset: 1344)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !769, file: !770, line: 94, baseType: !595, size: 64, offset: 1408)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !769, file: !770, line: 95, baseType: !503, size: 64, offset: 1472)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !769, file: !770, line: 96, baseType: !697, size: 32, offset: 1536)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !769, file: !770, line: 98, baseType: !816, size: 160, offset: 1568)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 160, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 20)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !486, file: !35, line: 459, baseType: !595, size: 64, offset: 2496)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !486, file: !35, line: 462, baseType: !503, size: 64, offset: 2560)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !486, file: !35, line: 465, baseType: !683, size: 32768, offset: 2624)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !486, file: !35, line: 466, baseType: !683, size: 32768, offset: 35392)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !486, file: !35, line: 467, baseType: !683, size: 32768, offset: 68160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !486, file: !35, line: 468, baseType: !683, size: 32768, offset: 100928)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !486, file: !35, line: 471, baseType: !482, size: 32, offset: 133696)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !486, file: !35, line: 474, baseType: !497, size: 64, offset: 133760)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !486, file: !35, line: 477, baseType: !503, size: 64, offset: 133824)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !486, file: !35, line: 478, baseType: !503, size: 64, offset: 133888)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !486, file: !35, line: 481, baseType: !523, size: 64, offset: 133952)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !486, file: !35, line: 484, baseType: !503, size: 64, offset: 134016)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !486, file: !35, line: 487, baseType: !832, size: 32, offset: 134080)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !486, file: !35, line: 490, baseType: !523, size: 64, offset: 134112)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !486, file: !35, line: 493, baseType: !595, size: 64, offset: 134208)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !486, file: !35, line: 496, baseType: !482, size: 32, offset: 134272)
!836 = !{!837, !838}
!837 = !DILocalVariable(name: "image_info", arg: 1, scope: !478, file: !479, line: 3023, type: !483)
!838 = !DILocalVariable(name: "image", arg: 2, scope: !478, file: !479, line: 3024, type: !556)
!839 = !DILocation(line: 0, scope: !478)
!840 = !DILocation(line: 3031, column: 14, scope: !841)
!841 = distinct !DILexicalBlock(scope: !478, file: !479, line: 3031, column: 7)
!842 = !{!843, !844, i64 12976}
!843 = !{!"_Image", !844, i64 0, !844, i64 4, !844, i64 8, !846, i64 16, !844, i64 24, !844, i64 28, !844, i64 32, !846, i64 40, !846, i64 48, !846, i64 56, !846, i64 64, !847, i64 72, !848, i64 80, !848, i64 88, !848, i64 96, !850, i64 104, !851, i64 112, !844, i64 208, !847, i64 216, !844, i64 224, !847, i64 232, !847, i64 240, !847, i64 248, !846, i64 256, !850, i64 264, !850, i64 272, !853, i64 280, !853, i64 312, !853, i64 344, !850, i64 376, !850, i64 384, !850, i64 392, !844, i64 400, !844, i64 404, !844, i64 408, !844, i64 412, !844, i64 416, !844, i64 420, !847, i64 424, !846, i64 432, !846, i64 440, !846, i64 448, !846, i64 456, !846, i64 464, !846, i64 472, !854, i64 480, !855, i64 504, !847, i64 568, !847, i64 576, !847, i64 584, !847, i64 592, !847, i64 600, !847, i64 608, !844, i64 616, !844, i64 4712, !844, i64 8808, !846, i64 12904, !846, i64 12912, !857, i64 12920, !844, i64 12976, !846, i64 12984, !847, i64 12992, !859, i64 13000, !859, i64 13032, !847, i64 13064, !846, i64 13072, !846, i64 13080, !847, i64 13088, !847, i64 13096, !847, i64 13104, !844, i64 13112, !844, i64 13116, !848, i64 13120, !847, i64 13128, !853, i64 13136, !847, i64 13168, !847, i64 13176, !844, i64 13184, !844, i64 13188, !860, i64 13192, !844, i64 13200, !846, i64 13208, !846, i64 13216, !844, i64 13224, !846, i64 13232}
!844 = !{!"omnipotent char", !845, i64 0}
!845 = !{!"Simple C/C++ TBAA"}
!846 = !{!"long", !844, i64 0}
!847 = !{!"any pointer", !844, i64 0}
!848 = !{!"_PixelPacket", !849, i64 0, !849, i64 2, !849, i64 4, !849, i64 6}
!849 = !{!"short", !844, i64 0}
!850 = !{!"double", !844, i64 0}
!851 = !{!"_ChromaticityInfo", !852, i64 0, !852, i64 24, !852, i64 48, !852, i64 72}
!852 = !{!"_PrimaryInfo", !850, i64 0, !850, i64 8, !850, i64 16}
!853 = !{!"_RectangleInfo", !846, i64 0, !846, i64 8, !846, i64 16, !846, i64 24}
!854 = !{!"_ErrorInfo", !850, i64 0, !850, i64 8, !850, i64 16}
!855 = !{!"_TimerInfo", !856, i64 0, !856, i64 24, !844, i64 48, !846, i64 56}
!856 = !{!"_Timer", !850, i64 0, !850, i64 8, !850, i64 16}
!857 = !{!"_ExceptionInfo", !844, i64 0, !858, i64 4, !847, i64 8, !847, i64 16, !847, i64 24, !844, i64 32, !847, i64 40, !846, i64 48}
!858 = !{!"int", !844, i64 0}
!859 = !{!"_ProfileInfo", !847, i64 0, !846, i64 8, !847, i64 16, !846, i64 24}
!860 = !{!"long long", !844, i64 0}
!861 = !DILocation(line: 3031, column: 20, scope: !841)
!862 = !DILocation(line: 3031, column: 7, scope: !478)
!863 = !DILocation(line: 3032, column: 68, scope: !841)
!864 = !DILocation(line: 3032, column: 12, scope: !841)
!865 = !DILocation(line: 3032, column: 5, scope: !841)
!866 = !DILocation(line: 3033, column: 39, scope: !478)
!867 = !DILocation(line: 3035, column: 12, scope: !478)
!868 = !DILocation(line: 3033, column: 10, scope: !478)
!869 = !DILocation(line: 3036, column: 3, scope: !478)
!870 = !DISubprogram(name: "LogMagickEvent", scope: !445, file: !445, line: 83, type: !871, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !875)
!871 = !DISubroutineType(types: !872)
!872 = !{!482, !873, !663, !663, !764, !663, null}
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !445, line: 58, baseType: !444)
!875 = !{}
!876 = !DISubprogram(name: "ThrowMagickException", scope: !322, file: !322, line: 156, type: !877, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !875)
