; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/artifact.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/artifact.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!350 = !DIEnumerator(name: "TrueColorType", value: 6)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!354 = !DIEnumerator(name: "OptimizeType", value: 10)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!372 = !DIEnumerator(name: "NoEvents", value: 0)
!373 = !DIEnumerator(name: "TraceEvent", value: 1)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!375 = !DIEnumerator(name: "BlobEvent", value: 4)
!376 = !DIEnumerator(name: "CacheEvent", value: 8)
!377 = !DIEnumerator(name: "CoderEvent", value: 16)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!380 = !DIEnumerator(name: "DrawEvent", value: 128)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!382 = !DIEnumerator(name: "ImageEvent", value: 512)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384)
!388 = !DIEnumerator(name: "UserEvent", value: 36864)
!389 = !DIEnumerator(name: "WandEvent", value: 65536)
!390 = !DIEnumerator(name: "X11Event", value: 131072)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!393 = !{!394, !395, !396, !400, !403, !406}
!394 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !398, line: 26, baseType: !399)
!398 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !398, line: 25, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!395, !395}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!407 = !{i32 7, !"Dwarf Version", i32 5}
!408 = !{i32 2, !"Debug Info Version", i32 3}
!409 = !{i32 1, !"wchar_size", i32 4}
!410 = !{i32 7, !"PIC Level", i32 2}
!411 = !{i32 7, !"PIE Level", i32 2}
!412 = !{i32 7, !"uwtable", i32 2}
!413 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!414 = distinct !DISubprogram(name: "CloneImageArtifacts", scope: !415, file: !415, line: 100, type: !416, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !636)
!415 = !DIFile(filename: "apps/538.imagick_r/src/magick/artifact.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f58aee91824e5d2304a154a7f4809071")
!416 = !DISubroutineType(types: !417)
!417 = !{!418, !419, !634}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !422)
!422 = !{!423, !425, !427, !429, !432, !434, !435, !436, !437, !438, !439, !440, !451, !452, !453, !454, !456, !470, !472, !473, !475, !476, !477, !478, !484, !485, !486, !494, !495, !496, !497, !498, !499, !501, !503, !505, !507, !509, !511, !513, !514, !515, !516, !517, !518, !519, !527, !542, !554, !555, !556, !557, !561, !565, !569, !570, !571, !572, !573, !591, !592, !594, !595, !605, !606, !608, !609, !610, !611, !612, !613, !615, !616, !617, !618, !619, !620, !621, !623, !624, !625, !626, !627, !631, !633}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !421, file: !77, line: 153, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !421, file: !77, line: 156, baseType: !426, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !421, file: !77, line: 159, baseType: !428, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !421, file: !77, line: 162, baseType: !430, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !431, line: 46, baseType: !394)
!431 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!432 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !421, file: !77, line: 165, baseType: !433, size: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !421, file: !77, line: 168, baseType: !418, size: 32, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !421, file: !77, line: 169, baseType: !418, size: 32, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !421, file: !77, line: 172, baseType: !430, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !421, file: !77, line: 173, baseType: !430, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !421, file: !77, line: 174, baseType: !430, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !421, file: !77, line: 175, baseType: !430, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !421, file: !77, line: 178, baseType: !441, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !444)
!444 = !{!445, !448, !449, !450}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !443, file: !326, line: 143, baseType: !446, size: 16)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !447)
!447 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !443, file: !326, line: 144, baseType: !446, size: 16, offset: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !443, file: !326, line: 145, baseType: !446, size: 16, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !443, file: !326, line: 146, baseType: !446, size: 16, offset: 48)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !421, file: !77, line: 179, baseType: !442, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !421, file: !77, line: 180, baseType: !442, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !421, file: !77, line: 181, baseType: !442, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !421, file: !77, line: 184, baseType: !455, size: 64, offset: 832)
!455 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !421, file: !77, line: 187, baseType: !457, size: 768, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !459)
!459 = !{!460, !467, !468, !469}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !458, file: !77, line: 124, baseType: !461, size: 192)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !462, file: !77, line: 98, baseType: !455, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !462, file: !77, line: 99, baseType: !455, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !462, file: !77, line: 100, baseType: !455, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !458, file: !77, line: 125, baseType: !461, size: 192, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !458, file: !77, line: 126, baseType: !461, size: 192, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !458, file: !77, line: 127, baseType: !461, size: 192, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !421, file: !77, line: 190, baseType: !471, size: 32, offset: 1664)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !421, file: !77, line: 193, baseType: !395, size: 64, offset: 1728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !421, file: !77, line: 196, baseType: !474, size: 32, offset: 1792)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !421, file: !77, line: 199, baseType: !406, size: 64, offset: 1856)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !421, file: !77, line: 200, baseType: !406, size: 64, offset: 1920)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !421, file: !77, line: 201, baseType: !406, size: 64, offset: 1984)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !421, file: !77, line: 204, baseType: !479, size: 64, offset: 2048)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !480, line: 77, baseType: !481)
!480 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !482, line: 193, baseType: !483)
!482 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!483 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !421, file: !77, line: 207, baseType: !455, size: 64, offset: 2112)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !421, file: !77, line: 208, baseType: !455, size: 64, offset: 2176)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !421, file: !77, line: 211, baseType: !487, size: 256, offset: 2240)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !489)
!489 = !{!490, !491, !492, !493}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !488, file: !153, line: 124, baseType: !430, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !488, file: !153, line: 125, baseType: !430, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !488, file: !153, line: 128, baseType: !479, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !488, file: !153, line: 129, baseType: !479, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !421, file: !77, line: 212, baseType: !487, size: 256, offset: 2496)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !421, file: !77, line: 213, baseType: !487, size: 256, offset: 2752)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !421, file: !77, line: 216, baseType: !455, size: 64, offset: 3008)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !421, file: !77, line: 217, baseType: !455, size: 64, offset: 3072)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !421, file: !77, line: 218, baseType: !455, size: 64, offset: 3136)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !421, file: !77, line: 221, baseType: !500, size: 32, offset: 3200)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !421, file: !77, line: 224, baseType: !502, size: 32, offset: 3232)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !421, file: !77, line: 227, baseType: !504, size: 32, offset: 3264)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !421, file: !77, line: 230, baseType: !506, size: 32, offset: 3296)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !421, file: !77, line: 233, baseType: !508, size: 32, offset: 3328)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !421, file: !77, line: 236, baseType: !510, size: 32, offset: 3360)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !421, file: !77, line: 239, baseType: !512, size: 64, offset: 3392)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !421, file: !77, line: 242, baseType: !430, size: 64, offset: 3456)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !421, file: !77, line: 243, baseType: !430, size: 64, offset: 3520)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !421, file: !77, line: 246, baseType: !479, size: 64, offset: 3584)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !421, file: !77, line: 249, baseType: !430, size: 64, offset: 3648)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !421, file: !77, line: 250, baseType: !430, size: 64, offset: 3712)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !421, file: !77, line: 253, baseType: !479, size: 64, offset: 3776)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !421, file: !77, line: 256, baseType: !520, size: 192, offset: 3840)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !521, line: 68, baseType: !522)
!521 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !521, line: 62, size: 192, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !522, file: !521, line: 65, baseType: !455, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !522, file: !521, line: 66, baseType: !455, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !522, file: !521, line: 67, baseType: !455, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !421, file: !77, line: 259, baseType: !528, size: 512, offset: 4032)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !530)
!530 = !{!531, !538, !539, !541}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !529, file: !247, line: 43, baseType: !532, size: 192)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !533, file: !247, line: 35, baseType: !455, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !533, file: !247, line: 36, baseType: !455, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !533, file: !247, line: 37, baseType: !455, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !529, file: !247, line: 44, baseType: !532, size: 192, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !529, file: !247, line: 47, baseType: !540, size: 32, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !529, file: !247, line: 50, baseType: !430, size: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !421, file: !77, line: 262, baseType: !543, size: 64, offset: 4544)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !544, line: 26, baseType: !545)
!544 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!418, !403, !548, !551, !395}
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !550)
!550 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !553)
!553 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !421, file: !77, line: 265, baseType: !395, size: 64, offset: 4608)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !421, file: !77, line: 266, baseType: !395, size: 64, offset: 4672)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !421, file: !77, line: 267, baseType: !395, size: 64, offset: 4736)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !421, file: !77, line: 270, baseType: !558, size: 64, offset: 4800)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !560)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !421, file: !77, line: 273, baseType: !562, size: 64, offset: 4864)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !564)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !421, file: !77, line: 276, baseType: !566, size: 32768, offset: 4928)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 32768, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 4096)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !421, file: !77, line: 277, baseType: !566, size: 32768, offset: 37696)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !421, file: !77, line: 278, baseType: !566, size: 32768, offset: 70464)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !421, file: !77, line: 281, baseType: !430, size: 64, offset: 103232)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !421, file: !77, line: 282, baseType: !430, size: 64, offset: 103296)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !421, file: !77, line: 285, baseType: !574, size: 448, offset: 103360)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !576)
!576 = !{!577, !579, !581, !582, !583, !584, !585, !590}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !575, file: !253, line: 105, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !575, file: !253, line: 108, baseType: !580, size: 32, offset: 32)
!580 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !575, file: !253, line: 111, baseType: !406, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !575, file: !253, line: 112, baseType: !406, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !575, file: !253, line: 115, baseType: !395, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !575, file: !253, line: 118, baseType: !418, size: 32, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !575, file: !253, line: 121, baseType: !586, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !588, line: 26, baseType: !589)
!588 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !588, line: 25, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !575, file: !253, line: 124, baseType: !430, size: 64, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !421, file: !77, line: 288, baseType: !418, size: 32, offset: 103808)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !421, file: !77, line: 291, baseType: !593, size: 64, offset: 103872)
!593 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !479)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !421, file: !77, line: 294, baseType: !586, size: 64, offset: 103936)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !421, file: !77, line: 297, baseType: !596, size: 256, offset: 104000)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !598)
!598 = !{!599, !600, !601, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !597, file: !89, line: 30, baseType: !406, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !597, file: !89, line: 33, baseType: !430, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !597, file: !89, line: 36, baseType: !602, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !597, file: !89, line: 39, baseType: !430, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !421, file: !77, line: 298, baseType: !596, size: 256, offset: 104256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !421, file: !77, line: 299, baseType: !607, size: 64, offset: 104512)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !421, file: !77, line: 302, baseType: !430, size: 64, offset: 104576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !421, file: !77, line: 305, baseType: !430, size: 64, offset: 104640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !421, file: !77, line: 308, baseType: !512, size: 64, offset: 104704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !421, file: !77, line: 309, baseType: !512, size: 64, offset: 104768)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !77, line: 310, baseType: !512, size: 64, offset: 104832)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !421, file: !77, line: 313, baseType: !614, size: 32, offset: 104896)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !421, file: !77, line: 316, baseType: !418, size: 32, offset: 104928)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !421, file: !77, line: 319, baseType: !442, size: 64, offset: 104960)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !421, file: !77, line: 322, baseType: !512, size: 64, offset: 105024)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !421, file: !77, line: 325, baseType: !487, size: 256, offset: 105088)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !421, file: !77, line: 328, baseType: !395, size: 64, offset: 105344)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !421, file: !77, line: 329, baseType: !395, size: 64, offset: 105408)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !421, file: !77, line: 332, baseType: !622, size: 32, offset: 105472)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !421, file: !77, line: 335, baseType: !418, size: 32, offset: 105504)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !421, file: !77, line: 338, baseType: !552, size: 64, offset: 105536)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !421, file: !77, line: 341, baseType: !418, size: 32, offset: 105600)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !421, file: !77, line: 344, baseType: !430, size: 64, offset: 105664)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !421, file: !77, line: 347, baseType: !628, size: 64, offset: 105728)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !629, line: 7, baseType: !630)
!629 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !482, line: 160, baseType: !483)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !421, file: !77, line: 350, baseType: !632, size: 32, offset: 105792)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !421, file: !77, line: 353, baseType: !430, size: 64, offset: 105856)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!636 = !{!637, !638}
!637 = !DILocalVariable(name: "image", arg: 1, scope: !414, file: !415, line: 100, type: !419)
!638 = !DILocalVariable(name: "clone_image", arg: 2, scope: !414, file: !415, line: 101, type: !634)
!639 = !DILocation(line: 0, scope: !414)
!640 = !DILocation(line: 105, column: 14, scope: !641)
!641 = distinct !DILexicalBlock(scope: !414, file: !415, line: 105, column: 7)
!642 = !{!643, !644, i64 12976}
!643 = !{!"_Image", !644, i64 0, !644, i64 4, !644, i64 8, !646, i64 16, !644, i64 24, !644, i64 28, !644, i64 32, !646, i64 40, !646, i64 48, !646, i64 56, !646, i64 64, !647, i64 72, !648, i64 80, !648, i64 88, !648, i64 96, !650, i64 104, !651, i64 112, !644, i64 208, !647, i64 216, !644, i64 224, !647, i64 232, !647, i64 240, !647, i64 248, !646, i64 256, !650, i64 264, !650, i64 272, !653, i64 280, !653, i64 312, !653, i64 344, !650, i64 376, !650, i64 384, !650, i64 392, !644, i64 400, !644, i64 404, !644, i64 408, !644, i64 412, !644, i64 416, !644, i64 420, !647, i64 424, !646, i64 432, !646, i64 440, !646, i64 448, !646, i64 456, !646, i64 464, !646, i64 472, !654, i64 480, !655, i64 504, !647, i64 568, !647, i64 576, !647, i64 584, !647, i64 592, !647, i64 600, !647, i64 608, !644, i64 616, !644, i64 4712, !644, i64 8808, !646, i64 12904, !646, i64 12912, !657, i64 12920, !644, i64 12976, !646, i64 12984, !647, i64 12992, !659, i64 13000, !659, i64 13032, !647, i64 13064, !646, i64 13072, !646, i64 13080, !647, i64 13088, !647, i64 13096, !647, i64 13104, !644, i64 13112, !644, i64 13116, !648, i64 13120, !647, i64 13128, !653, i64 13136, !647, i64 13168, !647, i64 13176, !644, i64 13184, !644, i64 13188, !660, i64 13192, !644, i64 13200, !646, i64 13208, !646, i64 13216, !644, i64 13224, !646, i64 13232}
!644 = !{!"omnipotent char", !645, i64 0}
!645 = !{!"Simple C/C++ TBAA"}
!646 = !{!"long", !644, i64 0}
!647 = !{!"any pointer", !644, i64 0}
!648 = !{!"_PixelPacket", !649, i64 0, !649, i64 2, !649, i64 4, !649, i64 6}
!649 = !{!"short", !644, i64 0}
!650 = !{!"double", !644, i64 0}
!651 = !{!"_ChromaticityInfo", !652, i64 0, !652, i64 24, !652, i64 48, !652, i64 72}
!652 = !{!"_PrimaryInfo", !650, i64 0, !650, i64 8, !650, i64 16}
!653 = !{!"_RectangleInfo", !646, i64 0, !646, i64 8, !646, i64 16, !646, i64 24}
!654 = !{!"_ErrorInfo", !650, i64 0, !650, i64 8, !650, i64 16}
!655 = !{!"_TimerInfo", !656, i64 0, !656, i64 24, !644, i64 48, !646, i64 56}
!656 = !{!"_Timer", !650, i64 0, !650, i64 8, !650, i64 16}
!657 = !{!"_ExceptionInfo", !644, i64 0, !658, i64 4, !647, i64 8, !647, i64 16, !647, i64 24, !644, i64 32, !647, i64 40, !646, i64 48}
!658 = !{!"int", !644, i64 0}
!659 = !{!"_ProfileInfo", !647, i64 0, !646, i64 8, !647, i64 16, !646, i64 24}
!660 = !{!"long long", !644, i64 0}
!661 = !DILocation(line: 105, column: 20, scope: !641)
!662 = !DILocation(line: 105, column: 7, scope: !414)
!663 = !DILocation(line: 106, column: 68, scope: !641)
!664 = !DILocation(line: 106, column: 12, scope: !641)
!665 = !DILocation(line: 106, column: 5, scope: !641)
!666 = !DILocation(line: 109, column: 20, scope: !667)
!667 = distinct !DILexicalBlock(scope: !414, file: !415, line: 109, column: 7)
!668 = !DILocation(line: 109, column: 26, scope: !667)
!669 = !DILocation(line: 109, column: 7, scope: !414)
!670 = !DILocation(line: 111, column: 20, scope: !667)
!671 = !DILocation(line: 110, column: 12, scope: !667)
!672 = !DILocation(line: 110, column: 5, scope: !667)
!673 = !DILocation(line: 112, column: 20, scope: !674)
!674 = distinct !DILexicalBlock(scope: !414, file: !415, line: 112, column: 7)
!675 = !{!643, !647, i64 13176}
!676 = !DILocation(line: 112, column: 30, scope: !674)
!677 = !DILocation(line: 112, column: 7, scope: !414)
