; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/attribute.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/attribute.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }

!436 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!437 = !DIEnumerator(name: "GammaPreview", value: 7)
!438 = !DIEnumerator(name: "SpiffPreview", value: 8)
!439 = !DIEnumerator(name: "DullPreview", value: 9)
!440 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!441 = !DIEnumerator(name: "QuantizePreview", value: 11)
!442 = !DIEnumerator(name: "DespecklePreview", value: 12)
!443 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!444 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!445 = !DIEnumerator(name: "SharpenPreview", value: 15)
!446 = !DIEnumerator(name: "BlurPreview", value: 16)
!447 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!448 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!449 = !DIEnumerator(name: "SpreadPreview", value: 19)
!450 = !DIEnumerator(name: "SolarizePreview", value: 20)
!451 = !DIEnumerator(name: "ShadePreview", value: 21)
!452 = !DIEnumerator(name: "RaisePreview", value: 22)
!453 = !DIEnumerator(name: "SegmentPreview", value: 23)
!454 = !DIEnumerator(name: "SwirlPreview", value: 24)
!455 = !DIEnumerator(name: "ImplodePreview", value: 25)
!456 = !DIEnumerator(name: "WavePreview", value: 26)
!457 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!458 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!459 = !DIEnumerator(name: "JPEGPreview", value: 29)
!460 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !461, line: 27, baseType: !5, size: 32, elements: !462)
!461 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!463 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!464 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!465 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!466 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!467 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!468 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!469 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!470 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!471 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!472 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!473 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!474 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!475 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!476 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!477 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!478 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!479 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!480 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !482, line: 27, baseType: !5, size: 32, elements: !483)
!482 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantize.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3eab4066ac81fc10b9d90b7cb7db1009")
!483 = !{!484, !485, !486, !487}
!484 = !DIEnumerator(name: "UndefinedDitherMethod", value: 0)
!485 = !DIEnumerator(name: "NoDitherMethod", value: 1)
!486 = !DIEnumerator(name: "RiemersmaDitherMethod", value: 2)
!487 = !DIEnumerator(name: "FloydSteinbergDitherMethod", value: 3)
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!490 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!491 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!492 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!493 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!494 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!495 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!496 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!497 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!498 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!499 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!500 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!501 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!502 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!503 = !{!504, !505, !510, !521, !522, !524, !525, !516, !526, !529, !530, !732, !551, !645, !733, !651, !735, !5}
!504 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !506, line: 77, baseType: !507)
!506 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !508, line: 193, baseType: !509)
!508 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!509 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !514)
!514 = !{!515, !518, !519, !520}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !513, file: !326, line: 143, baseType: !516, size: 16)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !517)
!517 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !513, file: !326, line: 144, baseType: !516, size: 16, offset: 16)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !513, file: !326, line: 145, baseType: !516, size: 16, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !513, file: !326, line: 146, baseType: !516, size: 16, offset: 48)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !523, line: 46, baseType: !504)
!523 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!525 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !516)
!529 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !533)
!533 = !{!534, !536, !538, !540, !541, !543, !545, !546, !547, !548, !549, !550, !552, !553, !554, !555, !556, !570, !572, !573, !575, !578, !579, !580, !581, !582, !583, !591, !592, !593, !594, !595, !596, !598, !600, !602, !604, !606, !608, !610, !611, !612, !613, !614, !615, !616, !624, !639, !653, !654, !655, !656, !660, !664, !668, !669, !670, !671, !672, !689, !690, !692, !693, !703, !704, !706, !707, !708, !709, !710, !711, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !724, !725, !729, !731}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !532, file: !73, line: 153, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !532, file: !73, line: 156, baseType: !537, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !532, file: !73, line: 159, baseType: !539, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !532, file: !73, line: 162, baseType: !522, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !532, file: !73, line: 165, baseType: !542, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !532, file: !73, line: 168, baseType: !544, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !532, file: !73, line: 169, baseType: !544, size: 32, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !532, file: !73, line: 172, baseType: !522, size: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !532, file: !73, line: 173, baseType: !522, size: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !532, file: !73, line: 174, baseType: !522, size: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !532, file: !73, line: 175, baseType: !522, size: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !532, file: !73, line: 178, baseType: !551, size: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !532, file: !73, line: 179, baseType: !512, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !532, file: !73, line: 180, baseType: !512, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !532, file: !73, line: 181, baseType: !512, size: 64, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !532, file: !73, line: 184, baseType: !529, size: 64, offset: 832)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !532, file: !73, line: 187, baseType: !557, size: 768, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !559)
!559 = !{!560, !567, !568, !569}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !558, file: !73, line: 124, baseType: !561, size: 192)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !562, file: !73, line: 98, baseType: !529, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !562, file: !73, line: 99, baseType: !529, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !562, file: !73, line: 100, baseType: !529, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !558, file: !73, line: 125, baseType: !561, size: 192, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !558, file: !73, line: 126, baseType: !561, size: 192, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !558, file: !73, line: 127, baseType: !561, size: 192, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !532, file: !73, line: 190, baseType: !571, size: 32, offset: 1664)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !532, file: !73, line: 193, baseType: !521, size: 64, offset: 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !532, file: !73, line: 196, baseType: !574, size: 32, offset: 1792)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !532, file: !73, line: 199, baseType: !576, size: 64, offset: 1856)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !532, file: !73, line: 200, baseType: !576, size: 64, offset: 1920)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !532, file: !73, line: 201, baseType: !576, size: 64, offset: 1984)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !532, file: !73, line: 204, baseType: !505, size: 64, offset: 2048)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !532, file: !73, line: 207, baseType: !529, size: 64, offset: 2112)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !532, file: !73, line: 208, baseType: !529, size: 64, offset: 2176)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !532, file: !73, line: 211, baseType: !584, size: 256, offset: 2240)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !586)
!586 = !{!587, !588, !589, !590}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !585, file: !153, line: 124, baseType: !522, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !585, file: !153, line: 125, baseType: !522, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !585, file: !153, line: 128, baseType: !505, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !585, file: !153, line: 129, baseType: !505, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !532, file: !73, line: 212, baseType: !584, size: 256, offset: 2496)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !532, file: !73, line: 213, baseType: !584, size: 256, offset: 2752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !532, file: !73, line: 216, baseType: !529, size: 64, offset: 3008)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !532, file: !73, line: 217, baseType: !529, size: 64, offset: 3072)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !532, file: !73, line: 218, baseType: !529, size: 64, offset: 3136)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !532, file: !73, line: 221, baseType: !597, size: 32, offset: 3200)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !532, file: !73, line: 224, baseType: !599, size: 32, offset: 3232)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !532, file: !73, line: 227, baseType: !601, size: 32, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !532, file: !73, line: 230, baseType: !603, size: 32, offset: 3296)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !532, file: !73, line: 233, baseType: !605, size: 32, offset: 3328)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !532, file: !73, line: 236, baseType: !607, size: 32, offset: 3360)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !532, file: !73, line: 239, baseType: !609, size: 64, offset: 3392)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !532, file: !73, line: 242, baseType: !522, size: 64, offset: 3456)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !532, file: !73, line: 243, baseType: !522, size: 64, offset: 3520)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !532, file: !73, line: 246, baseType: !505, size: 64, offset: 3584)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !532, file: !73, line: 249, baseType: !522, size: 64, offset: 3648)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !532, file: !73, line: 250, baseType: !522, size: 64, offset: 3712)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !532, file: !73, line: 253, baseType: !505, size: 64, offset: 3776)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !532, file: !73, line: 256, baseType: !617, size: 192, offset: 3840)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !618, line: 68, baseType: !619)
!618 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !618, line: 62, size: 192, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !619, file: !618, line: 65, baseType: !529, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !619, file: !618, line: 66, baseType: !529, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !619, file: !618, line: 67, baseType: !529, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !532, file: !73, line: 259, baseType: !625, size: 512, offset: 4032)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !627)
!627 = !{!628, !635, !636, !638}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !626, file: !247, line: 43, baseType: !629, size: 192)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !630, file: !247, line: 35, baseType: !529, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !630, file: !247, line: 36, baseType: !529, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !630, file: !247, line: 37, baseType: !529, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !626, file: !247, line: 44, baseType: !629, size: 192, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !626, file: !247, line: 47, baseType: !637, size: 32, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !626, file: !247, line: 50, baseType: !522, size: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !532, file: !73, line: 262, baseType: !640, size: 64, offset: 4544)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !641, line: 26, baseType: !642)
!641 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!544, !645, !647, !650, !521}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !649)
!649 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !652)
!652 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !532, file: !73, line: 265, baseType: !521, size: 64, offset: 4608)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !532, file: !73, line: 266, baseType: !521, size: 64, offset: 4672)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !532, file: !73, line: 267, baseType: !521, size: 64, offset: 4736)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !532, file: !73, line: 270, baseType: !657, size: 64, offset: 4800)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !659)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !532, file: !73, line: 273, baseType: !661, size: 64, offset: 4864)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !663)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !532, file: !73, line: 276, baseType: !665, size: 32768, offset: 4928)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 32768, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 4096)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !532, file: !73, line: 277, baseType: !665, size: 32768, offset: 37696)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !532, file: !73, line: 278, baseType: !665, size: 32768, offset: 70464)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !532, file: !73, line: 281, baseType: !522, size: 64, offset: 103232)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !532, file: !73, line: 282, baseType: !522, size: 64, offset: 103296)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !532, file: !73, line: 285, baseType: !673, size: 448, offset: 103360)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !675)
!675 = !{!676, !678, !679, !680, !681, !682, !683, !688}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !674, file: !253, line: 105, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !674, file: !253, line: 108, baseType: !525, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !674, file: !253, line: 111, baseType: !576, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !674, file: !253, line: 112, baseType: !576, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !674, file: !253, line: 115, baseType: !521, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !674, file: !253, line: 118, baseType: !544, size: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !674, file: !253, line: 121, baseType: !684, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !686, line: 26, baseType: !687)
!686 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !686, line: 25, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !674, file: !253, line: 124, baseType: !522, size: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !532, file: !73, line: 288, baseType: !544, size: 32, offset: 103808)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !532, file: !73, line: 291, baseType: !691, size: 64, offset: 103872)
!691 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !505)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !532, file: !73, line: 294, baseType: !684, size: 64, offset: 103936)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !532, file: !73, line: 297, baseType: !694, size: 256, offset: 104000)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !696)
!696 = !{!697, !698, !699, !702}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !695, file: !89, line: 30, baseType: !576, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !695, file: !89, line: 33, baseType: !522, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !695, file: !89, line: 36, baseType: !700, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !695, file: !89, line: 39, baseType: !522, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !532, file: !73, line: 298, baseType: !694, size: 256, offset: 104256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !532, file: !73, line: 299, baseType: !705, size: 64, offset: 104512)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !532, file: !73, line: 302, baseType: !522, size: 64, offset: 104576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !532, file: !73, line: 305, baseType: !522, size: 64, offset: 104640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !532, file: !73, line: 308, baseType: !609, size: 64, offset: 104704)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !532, file: !73, line: 309, baseType: !609, size: 64, offset: 104768)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !73, line: 310, baseType: !609, size: 64, offset: 104832)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !532, file: !73, line: 313, baseType: !712, size: 32, offset: 104896)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !532, file: !73, line: 316, baseType: !544, size: 32, offset: 104928)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !532, file: !73, line: 319, baseType: !512, size: 64, offset: 104960)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !532, file: !73, line: 322, baseType: !609, size: 64, offset: 105024)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !532, file: !73, line: 325, baseType: !584, size: 256, offset: 105088)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !532, file: !73, line: 328, baseType: !521, size: 64, offset: 105344)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !532, file: !73, line: 329, baseType: !521, size: 64, offset: 105408)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !532, file: !73, line: 332, baseType: !720, size: 32, offset: 105472)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !532, file: !73, line: 335, baseType: !544, size: 32, offset: 105504)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !532, file: !73, line: 338, baseType: !651, size: 64, offset: 105536)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !532, file: !73, line: 341, baseType: !544, size: 32, offset: 105600)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !532, file: !73, line: 344, baseType: !522, size: 64, offset: 105664)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !532, file: !73, line: 347, baseType: !726, size: 64, offset: 105728)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !727, line: 7, baseType: !728)
!727 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !508, line: 160, baseType: !509)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !532, file: !73, line: 350, baseType: !730, size: 32, offset: 105792)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !532, file: !73, line: 353, baseType: !522, size: 64, offset: 105856)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !734)
!734 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAny", file: !4, line: 170, baseType: !651)
!736 = !{i32 7, !"Dwarf Version", i32 5}
!737 = !{i32 2, !"Debug Info Version", i32 3}
!738 = !{i32 1, !"wchar_size", i32 4}
!739 = !{i32 7, !"PIC Level", i32 2}
!740 = !{i32 7, !"PIE Level", i32 2}
!741 = !{i32 7, !"uwtable", i32 2}
!742 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!743 = distinct !DISubprogram(name: "GetImageBoundingBox", scope: !744, file: !744, line: 125, type: !745, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !750)
!744 = !DIFile(filename: "apps/538.imagick_r/src/magick/attribute.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cdb5275a78f94e78110e9e1a0cbfdf20")
!745 = !DISubroutineType(types: !746)
!746 = !{!584, !747, !749}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!750 = !{!751, !752, !753, !757, !758, !775, !776, !777, !778, !779, !783, !784, !786, !788}
!751 = !DILocalVariable(name: "image", arg: 1, scope: !743, file: !744, line: 125, type: !747)
!752 = !DILocalVariable(name: "exception", arg: 2, scope: !743, file: !744, line: 126, type: !749)
!753 = !DILocalVariable(name: "image_view", scope: !743, file: !744, line: 129, type: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !461, line: 50, baseType: !756)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!757 = !DILocalVariable(name: "status", scope: !743, file: !744, line: 132, type: !544)
!758 = !DILocalVariable(name: "target", scope: !743, file: !744, line: 135, type: !759)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 1344, elements: !773)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !761, file: !326, line: 107, baseType: !535, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !761, file: !326, line: 110, baseType: !537, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !761, file: !326, line: 113, baseType: !544, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !761, file: !326, line: 116, baseType: !529, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !761, file: !326, line: 119, baseType: !522, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !761, file: !326, line: 122, baseType: !733, size: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !761, file: !326, line: 123, baseType: !733, size: 32, offset: 288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !761, file: !326, line: 124, baseType: !733, size: 32, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !761, file: !326, line: 125, baseType: !733, size: 32, offset: 352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !761, file: !326, line: 126, baseType: !733, size: 32, offset: 384)
!773 = !{!774}
!774 = !DISubrange(count: 3)
!775 = !DILocalVariable(name: "zero", scope: !743, file: !744, line: 136, type: !760)
!776 = !DILocalVariable(name: "bounds", scope: !743, file: !744, line: 139, type: !584)
!777 = !DILocalVariable(name: "p", scope: !743, file: !744, line: 142, type: !510)
!778 = !DILocalVariable(name: "y", scope: !743, file: !744, line: 145, type: !505)
!779 = !DILocalVariable(name: "pixel", scope: !780, file: !744, line: 184, type: !760)
!780 = distinct !DILexicalBlock(scope: !781, file: !744, line: 182, column: 3)
!781 = distinct !DILexicalBlock(scope: !782, file: !744, line: 181, column: 3)
!782 = distinct !DILexicalBlock(scope: !743, file: !744, line: 181, column: 3)
!783 = !DILocalVariable(name: "bounding_box", scope: !780, file: !744, line: 187, type: !584)
!784 = !DILocalVariable(name: "indexes", scope: !780, file: !744, line: 190, type: !785)
!785 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !526)
!786 = !DILocalVariable(name: "p", scope: !780, file: !744, line: 193, type: !787)
!787 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !510)
!788 = !DILocalVariable(name: "x", scope: !780, file: !744, line: 196, type: !505)
!789 = !DILocation(line: 0, scope: !743)
!790 = !DILocation(line: 134, column: 3, scope: !743)
!791 = !DILocation(line: 135, column: 5, scope: !743)
!792 = !DILocation(line: 136, column: 5, scope: !743)
!793 = !DILocation(line: 139, column: 5, scope: !743)
!794 = !DILocation(line: 149, column: 14, scope: !795)
!795 = distinct !DILexicalBlock(scope: !743, file: !744, line: 149, column: 7)
!796 = !{!797, !798, i64 12976}
!797 = !{!"_Image", !798, i64 0, !798, i64 4, !798, i64 8, !800, i64 16, !798, i64 24, !798, i64 28, !798, i64 32, !800, i64 40, !800, i64 48, !800, i64 56, !800, i64 64, !801, i64 72, !802, i64 80, !802, i64 88, !802, i64 96, !804, i64 104, !805, i64 112, !798, i64 208, !801, i64 216, !798, i64 224, !801, i64 232, !801, i64 240, !801, i64 248, !800, i64 256, !804, i64 264, !804, i64 272, !807, i64 280, !807, i64 312, !807, i64 344, !804, i64 376, !804, i64 384, !804, i64 392, !798, i64 400, !798, i64 404, !798, i64 408, !798, i64 412, !798, i64 416, !798, i64 420, !801, i64 424, !800, i64 432, !800, i64 440, !800, i64 448, !800, i64 456, !800, i64 464, !800, i64 472, !808, i64 480, !809, i64 504, !801, i64 568, !801, i64 576, !801, i64 584, !801, i64 592, !801, i64 600, !801, i64 608, !798, i64 616, !798, i64 4712, !798, i64 8808, !800, i64 12904, !800, i64 12912, !811, i64 12920, !798, i64 12976, !800, i64 12984, !801, i64 12992, !813, i64 13000, !813, i64 13032, !801, i64 13064, !800, i64 13072, !800, i64 13080, !801, i64 13088, !801, i64 13096, !801, i64 13104, !798, i64 13112, !798, i64 13116, !802, i64 13120, !801, i64 13128, !807, i64 13136, !801, i64 13168, !801, i64 13176, !798, i64 13184, !798, i64 13188, !814, i64 13192, !798, i64 13200, !800, i64 13208, !800, i64 13216, !798, i64 13224, !800, i64 13232}
!798 = !{!"omnipotent char", !799, i64 0}
!799 = !{!"Simple C/C++ TBAA"}
!800 = !{!"long", !798, i64 0}
!801 = !{!"any pointer", !798, i64 0}
!802 = !{!"_PixelPacket", !803, i64 0, !803, i64 2, !803, i64 4, !803, i64 6}
!803 = !{!"short", !798, i64 0}
!804 = !{!"double", !798, i64 0}
!805 = !{!"_ChromaticityInfo", !806, i64 0, !806, i64 24, !806, i64 48, !806, i64 72}
!806 = !{!"_PrimaryInfo", !804, i64 0, !804, i64 8, !804, i64 16}
!807 = !{!"_RectangleInfo", !800, i64 0, !800, i64 8, !800, i64 16, !800, i64 24}
!808 = !{!"_ErrorInfo", !804, i64 0, !804, i64 8, !804, i64 16}
!809 = !{!"_TimerInfo", !810, i64 0, !810, i64 24, !798, i64 48, !800, i64 56}
!810 = !{!"_Timer", !804, i64 0, !804, i64 8, !804, i64 16}
!811 = !{!"_ExceptionInfo", !798, i64 0, !812, i64 4, !801, i64 8, !801, i64 16, !801, i64 24, !798, i64 32, !801, i64 40, !800, i64 48}
!812 = !{!"int", !798, i64 0}
!813 = !{!"_ProfileInfo", !801, i64 0, !800, i64 8, !801, i64 16, !800, i64 24}
!814 = !{!"long long", !798, i64 0}
!815 = !DILocation(line: 149, column: 20, scope: !795)
!816 = !DILocation(line: 149, column: 7, scope: !743)
!817 = !DILocation(line: 150, column: 68, scope: !795)
!818 = !DILocation(line: 150, column: 12, scope: !795)
!819 = !DILocation(line: 150, column: 5, scope: !795)
!820 = !DILocation(line: 152, column: 10, scope: !743)
!821 = !DILocation(line: 153, column: 29, scope: !743)
!822 = !DILocation(line: 152, column: 16, scope: !743)
!823 = !{!797, !800, i64 40}
!824 = !DILocation(line: 153, column: 10, scope: !743)
!825 = !DILocation(line: 153, column: 11, scope: !743)
!826 = !{!807, !800, i64 16}
!827 = !DILocation(line: 154, column: 29, scope: !743)
!828 = !{!797, !800, i64 48}
!829 = !DILocation(line: 154, column: 10, scope: !743)
!830 = !DILocation(line: 154, column: 11, scope: !743)
!831 = !{!807, !800, i64 24}
!832 = !DILocation(line: 155, column: 3, scope: !743)
!833 = !DILocation(line: 156, column: 14, scope: !743)
!834 = !DILocation(line: 157, column: 5, scope: !743)
!835 = !DILocation(line: 158, column: 9, scope: !836)
!836 = distinct !DILexicalBlock(scope: !743, file: !744, line: 158, column: 7)
!837 = !DILocation(line: 158, column: 7, scope: !743)
!838 = !DILocation(line: 160, column: 18, scope: !839)
!839 = distinct !DILexicalBlock(scope: !836, file: !744, line: 159, column: 5)
!840 = !DILocation(line: 161, column: 7, scope: !839)
!841 = !DILocation(line: 163, column: 32, scope: !743)
!842 = !DILocation(line: 163, column: 3, scope: !743)
!843 = !{!797, !798, i64 4}
!844 = !DILocalVariable(name: "image", arg: 1, scope: !845, file: !846, line: 92, type: !747)
!845 = distinct !DISubprogram(name: "SetMagickPixelPacket", scope: !846, file: !846, line: 92, type: !847, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !850)
!846 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d0543784df06457407bc99b9890f8aaf")
!847 = !DISubroutineType(types: !848)
!848 = !{null, !747, !510, !526, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!850 = !{!844, !851, !852, !853}
!851 = !DILocalVariable(name: "color", arg: 2, scope: !845, file: !846, line: 93, type: !510)
!852 = !DILocalVariable(name: "index", arg: 3, scope: !845, file: !846, line: 93, type: !526)
!853 = !DILocalVariable(name: "pixel", arg: 4, scope: !845, file: !846, line: 93, type: !849)
!854 = !DILocation(line: 0, scope: !845, inlinedAt: !855)
!855 = distinct !DILocation(line: 163, column: 3, scope: !743)
!856 = !DILocation(line: 95, column: 31, scope: !845, inlinedAt: !855)
!857 = !{!802, !803, i64 4}
!858 = !DILocation(line: 95, column: 14, scope: !845, inlinedAt: !855)
!859 = !DILocation(line: 95, column: 10, scope: !845, inlinedAt: !855)
!860 = !DILocation(line: 95, column: 13, scope: !845, inlinedAt: !855)
!861 = !{!862, !863, i64 32}
!862 = !{!"_MagickPixelPacket", !798, i64 0, !798, i64 4, !798, i64 8, !804, i64 16, !800, i64 24, !863, i64 32, !863, i64 36, !863, i64 40, !863, i64 44, !863, i64 48}
!863 = !{!"float", !798, i64 0}
!864 = !DILocation(line: 96, column: 33, scope: !845, inlinedAt: !855)
!865 = !{!802, !803, i64 2}
!866 = !DILocation(line: 96, column: 16, scope: !845, inlinedAt: !855)
!867 = !DILocation(line: 96, column: 10, scope: !845, inlinedAt: !855)
!868 = !DILocation(line: 96, column: 15, scope: !845, inlinedAt: !855)
!869 = !{!862, !863, i64 36}
!870 = !DILocation(line: 97, column: 32, scope: !845, inlinedAt: !855)
!871 = !{!802, !803, i64 0}
!872 = !DILocation(line: 97, column: 15, scope: !845, inlinedAt: !855)
!873 = !DILocation(line: 97, column: 10, scope: !845, inlinedAt: !855)
!874 = !DILocation(line: 97, column: 14, scope: !845, inlinedAt: !855)
!875 = !{!862, !863, i64 40}
!876 = !DILocation(line: 98, column: 35, scope: !845, inlinedAt: !855)
!877 = !{!802, !803, i64 6}
!878 = !DILocation(line: 98, column: 18, scope: !845, inlinedAt: !855)
!879 = !DILocation(line: 98, column: 10, scope: !845, inlinedAt: !855)
!880 = !DILocation(line: 98, column: 17, scope: !845, inlinedAt: !855)
!881 = !{!862, !863, i64 44}
!882 = !DILocation(line: 99, column: 26, scope: !883, inlinedAt: !855)
!883 = distinct !DILexicalBlock(scope: !845, file: !846, line: 99, column: 7)
!884 = !DILocation(line: 99, column: 45, scope: !883, inlinedAt: !855)
!885 = !DILocation(line: 101, column: 35, scope: !883, inlinedAt: !855)
!886 = !{!803, !803, i64 0}
!887 = !DILocation(line: 101, column: 18, scope: !883, inlinedAt: !855)
!888 = !DILocation(line: 101, column: 12, scope: !883, inlinedAt: !855)
!889 = !DILocation(line: 101, column: 17, scope: !883, inlinedAt: !855)
!890 = !{!862, !863, i64 48}
!891 = !DILocation(line: 101, column: 5, scope: !883, inlinedAt: !855)
!892 = !DILocation(line: 165, column: 31, scope: !743)
!893 = !DILocation(line: 165, column: 3, scope: !743)
!894 = !DILocation(line: 166, column: 59, scope: !743)
!895 = !DILocation(line: 166, column: 66, scope: !743)
!896 = !DILocation(line: 166, column: 5, scope: !743)
!897 = !DILocation(line: 168, column: 32, scope: !743)
!898 = !DILocation(line: 168, column: 3, scope: !743)
!899 = !DILocation(line: 0, scope: !845, inlinedAt: !900)
!900 = distinct !DILocation(line: 168, column: 3, scope: !743)
!901 = !DILocation(line: 95, column: 31, scope: !845, inlinedAt: !900)
!902 = !DILocation(line: 95, column: 14, scope: !845, inlinedAt: !900)
!903 = !DILocation(line: 95, column: 10, scope: !845, inlinedAt: !900)
!904 = !DILocation(line: 95, column: 13, scope: !845, inlinedAt: !900)
!905 = !DILocation(line: 96, column: 33, scope: !845, inlinedAt: !900)
!906 = !DILocation(line: 96, column: 16, scope: !845, inlinedAt: !900)
!907 = !DILocation(line: 96, column: 10, scope: !845, inlinedAt: !900)
!908 = !DILocation(line: 96, column: 15, scope: !845, inlinedAt: !900)
!909 = !DILocation(line: 97, column: 32, scope: !845, inlinedAt: !900)
!910 = !DILocation(line: 97, column: 15, scope: !845, inlinedAt: !900)
!911 = !DILocation(line: 97, column: 10, scope: !845, inlinedAt: !900)
!912 = !DILocation(line: 97, column: 14, scope: !845, inlinedAt: !900)
!913 = !DILocation(line: 98, column: 35, scope: !845, inlinedAt: !900)
!914 = !DILocation(line: 98, column: 18, scope: !845, inlinedAt: !900)
!915 = !DILocation(line: 98, column: 10, scope: !845, inlinedAt: !900)
!916 = !DILocation(line: 98, column: 17, scope: !845, inlinedAt: !900)
!917 = !DILocation(line: 99, column: 26, scope: !883, inlinedAt: !900)
!918 = !DILocation(line: 99, column: 45, scope: !883, inlinedAt: !900)
!919 = !DILocation(line: 101, column: 35, scope: !883, inlinedAt: !900)
!920 = !DILocation(line: 101, column: 18, scope: !883, inlinedAt: !900)
!921 = !DILocation(line: 101, column: 12, scope: !883, inlinedAt: !900)
!922 = !DILocation(line: 101, column: 17, scope: !883, inlinedAt: !900)
!923 = !DILocation(line: 101, column: 5, scope: !883, inlinedAt: !900)
!924 = !DILocation(line: 170, column: 31, scope: !743)
!925 = !DILocation(line: 170, column: 3, scope: !743)
!926 = !DILocation(line: 171, column: 61, scope: !743)
!927 = !DILocation(line: 171, column: 65, scope: !743)
!928 = !DILocation(line: 171, column: 5, scope: !743)
!929 = !DILocation(line: 173, column: 32, scope: !743)
!930 = !DILocation(line: 173, column: 3, scope: !743)
!931 = !DILocation(line: 0, scope: !845, inlinedAt: !932)
!932 = distinct !DILocation(line: 173, column: 3, scope: !743)
!933 = !DILocation(line: 95, column: 31, scope: !845, inlinedAt: !932)
!934 = !DILocation(line: 95, column: 14, scope: !845, inlinedAt: !932)
!935 = !DILocation(line: 95, column: 10, scope: !845, inlinedAt: !932)
!936 = !DILocation(line: 95, column: 13, scope: !845, inlinedAt: !932)
!937 = !DILocation(line: 96, column: 33, scope: !845, inlinedAt: !932)
!938 = !DILocation(line: 96, column: 16, scope: !845, inlinedAt: !932)
!939 = !DILocation(line: 96, column: 10, scope: !845, inlinedAt: !932)
!940 = !DILocation(line: 96, column: 15, scope: !845, inlinedAt: !932)
!941 = !DILocation(line: 97, column: 32, scope: !845, inlinedAt: !932)
!942 = !DILocation(line: 97, column: 15, scope: !845, inlinedAt: !932)
!943 = !DILocation(line: 97, column: 10, scope: !845, inlinedAt: !932)
!944 = !DILocation(line: 97, column: 14, scope: !845, inlinedAt: !932)
!945 = !DILocation(line: 98, column: 35, scope: !845, inlinedAt: !932)
!946 = !DILocation(line: 98, column: 18, scope: !845, inlinedAt: !932)
!947 = !DILocation(line: 98, column: 10, scope: !845, inlinedAt: !932)
!948 = !DILocation(line: 98, column: 17, scope: !845, inlinedAt: !932)
!949 = !DILocation(line: 99, column: 26, scope: !883, inlinedAt: !932)
!950 = !DILocation(line: 99, column: 45, scope: !883, inlinedAt: !932)
!951 = !DILocation(line: 101, column: 35, scope: !883, inlinedAt: !932)
!952 = !DILocation(line: 101, column: 18, scope: !883, inlinedAt: !932)
!953 = !DILocation(line: 101, column: 12, scope: !883, inlinedAt: !932)
!954 = !DILocation(line: 101, column: 17, scope: !883, inlinedAt: !932)
!955 = !DILocation(line: 101, column: 5, scope: !883, inlinedAt: !932)
!956 = !DILocation(line: 176, column: 3, scope: !743)
!957 = !DILocation(line: 181, column: 34, scope: !781)
!958 = !DILocation(line: 181, column: 15, scope: !781)
!959 = !DILocation(line: 181, column: 3, scope: !782)
!960 = !DILocation(line: 183, column: 5, scope: !780)
!961 = !DILocation(line: 184, column: 7, scope: !780)
!962 = !DILocation(line: 198, column: 16, scope: !963)
!963 = distinct !DILexicalBlock(scope: !780, file: !744, line: 198, column: 9)
!964 = !DILocation(line: 198, column: 9, scope: !780)
!965 = !DILocation(line: 0, scope: !780)
!966 = !DILocation(line: 204, column: 55, scope: !780)
!967 = !DILocation(line: 204, column: 7, scope: !780)
!968 = !DILocation(line: 205, column: 11, scope: !969)
!969 = distinct !DILexicalBlock(scope: !780, file: !744, line: 205, column: 9)
!970 = !DILocation(line: 205, column: 9, scope: !780)
!971 = !DILocation(line: 210, column: 13, scope: !780)
!972 = !DILocation(line: 211, column: 11, scope: !780)
!973 = !{i64 0, i64 4, !974, i64 4, i64 4, !974, i64 8, i64 4, !974, i64 16, i64 8, !975, i64 24, i64 8, !976, i64 32, i64 4, !977, i64 36, i64 4, !977, i64 40, i64 4, !977, i64 44, i64 4, !977, i64 48, i64 4, !977}
!974 = !{!798, !798, i64 0}
!975 = !{!804, !804, i64 0}
!976 = !{!800, !800, i64 0}
!977 = !{!863, !863, i64 0}
!978 = !DILocation(line: 212, column: 36, scope: !979)
!979 = distinct !DILexicalBlock(scope: !980, file: !744, line: 212, column: 5)
!980 = distinct !DILexicalBlock(scope: !780, file: !744, line: 212, column: 5)
!981 = !DILocation(line: 212, column: 17, scope: !979)
!982 = !DILocation(line: 212, column: 5, scope: !980)
!983 = !DILocation(line: 214, column: 7, scope: !984)
!984 = distinct !DILexicalBlock(scope: !979, file: !744, line: 213, column: 5)
!985 = !DILocation(line: 0, scope: !845, inlinedAt: !986)
!986 = distinct !DILocation(line: 214, column: 7, scope: !984)
!987 = !DILocation(line: 95, column: 31, scope: !845, inlinedAt: !986)
!988 = !DILocation(line: 95, column: 14, scope: !845, inlinedAt: !986)
!989 = !DILocation(line: 95, column: 13, scope: !845, inlinedAt: !986)
!990 = !DILocation(line: 96, column: 33, scope: !845, inlinedAt: !986)
!991 = !DILocation(line: 96, column: 16, scope: !845, inlinedAt: !986)
!992 = !DILocation(line: 96, column: 15, scope: !845, inlinedAt: !986)
!993 = !DILocation(line: 97, column: 32, scope: !845, inlinedAt: !986)
!994 = !DILocation(line: 97, column: 15, scope: !845, inlinedAt: !986)
!995 = !DILocation(line: 97, column: 14, scope: !845, inlinedAt: !986)
!996 = !DILocation(line: 98, column: 35, scope: !845, inlinedAt: !986)
!997 = !DILocation(line: 98, column: 18, scope: !845, inlinedAt: !986)
!998 = !DILocation(line: 98, column: 17, scope: !845, inlinedAt: !986)
!999 = !DILocation(line: 99, column: 26, scope: !883, inlinedAt: !986)
!1000 = !DILocation(line: 99, column: 45, scope: !883, inlinedAt: !986)
!1001 = !DILocation(line: 214, column: 43, scope: !984)
!1002 = !DILocation(line: 101, column: 35, scope: !883, inlinedAt: !986)
!1003 = !DILocation(line: 101, column: 18, scope: !883, inlinedAt: !986)
!1004 = !DILocation(line: 101, column: 17, scope: !883, inlinedAt: !986)
!1005 = !DILocation(line: 101, column: 5, scope: !883, inlinedAt: !986)
!1006 = !DILocation(line: 215, column: 14, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !984, file: !744, line: 215, column: 11)
!1008 = !DILocation(line: 215, column: 32, scope: !1007)
!1009 = !DILocation(line: 216, column: 12, scope: !1007)
!1010 = !DILocation(line: 216, column: 52, scope: !1007)
!1011 = !DILocation(line: 215, column: 11, scope: !984)
!1012 = !DILocation(line: 218, column: 14, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !984, file: !744, line: 218, column: 11)
!1014 = !DILocation(line: 218, column: 46, scope: !1013)
!1015 = !DILocation(line: 219, column: 12, scope: !1013)
!1016 = !DILocation(line: 219, column: 52, scope: !1013)
!1017 = !DILocation(line: 218, column: 11, scope: !984)
!1018 = !DILocation(line: 221, column: 14, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !984, file: !744, line: 221, column: 11)
!1020 = !DILocation(line: 221, column: 32, scope: !1019)
!1021 = !DILocation(line: 222, column: 12, scope: !1019)
!1022 = !DILocation(line: 222, column: 52, scope: !1019)
!1023 = !DILocation(line: 221, column: 11, scope: !984)
!1024 = !DILocation(line: 224, column: 14, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !984, file: !744, line: 224, column: 11)
!1026 = !DILocation(line: 224, column: 47, scope: !1025)
!1027 = !DILocation(line: 225, column: 12, scope: !1025)
!1028 = !DILocation(line: 225, column: 52, scope: !1025)
!1029 = !DILocation(line: 224, column: 11, scope: !984)
!1030 = !DILocation(line: 227, column: 8, scope: !984)
!1031 = !DILocation(line: 212, column: 46, scope: !979)
!1032 = distinct !{!1032, !982, !1033, !1034, !1035}
!1033 = !DILocation(line: 228, column: 5, scope: !980)
!1034 = !{!"llvm.loop.mustprogress"}
!1035 = !{!"llvm.loop.unroll.disable"}
!1036 = !DILocation(line: 233, column: 26, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !744, line: 233, column: 11)
!1038 = distinct !DILexicalBlock(scope: !780, file: !744, line: 232, column: 5)
!1039 = !DILocation(line: 233, column: 11, scope: !1038)
!1040 = !DILocation(line: 234, column: 17, scope: !1037)
!1041 = !DILocation(line: 234, column: 9, scope: !1037)
!1042 = !DILocation(line: 235, column: 26, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1038, file: !744, line: 235, column: 11)
!1044 = !DILocation(line: 235, column: 11, scope: !1038)
!1045 = !DILocation(line: 236, column: 17, scope: !1043)
!1046 = !DILocation(line: 236, column: 9, scope: !1043)
!1047 = !DILocation(line: 237, column: 30, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1038, file: !744, line: 237, column: 11)
!1049 = !DILocation(line: 237, column: 11, scope: !1038)
!1050 = !DILocation(line: 238, column: 21, scope: !1048)
!1051 = !{!807, !800, i64 0}
!1052 = !DILocation(line: 238, column: 9, scope: !1048)
!1053 = !DILocation(line: 239, column: 31, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1038, file: !744, line: 239, column: 11)
!1055 = !DILocation(line: 239, column: 11, scope: !1038)
!1056 = !DILocation(line: 240, column: 22, scope: !1054)
!1057 = !{!807, !800, i64 8}
!1058 = !DILocation(line: 240, column: 9, scope: !1054)
!1059 = !DILocation(line: 242, column: 3, scope: !781)
!1060 = !DILocation(line: 181, column: 41, scope: !781)
!1061 = distinct !{!1061, !959, !1062, !1034, !1035}
!1062 = !DILocation(line: 242, column: 3, scope: !782)
!1063 = !DILocation(line: 244, column: 15, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !743, file: !744, line: 244, column: 7)
!1065 = !DILocation(line: 243, column: 14, scope: !743)
!1066 = !DILocation(line: 244, column: 21, scope: !1064)
!1067 = !DILocation(line: 244, column: 27, scope: !1064)
!1068 = !DILocation(line: 246, column: 51, scope: !1064)
!1069 = !DILocation(line: 245, column: 12, scope: !1064)
!1070 = !DILocation(line: 245, column: 5, scope: !1064)
!1071 = !DILocation(line: 249, column: 30, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1064, file: !744, line: 248, column: 5)
!1073 = !DILocation(line: 249, column: 19, scope: !1072)
!1074 = !DILocation(line: 250, column: 31, scope: !1072)
!1075 = !DILocation(line: 250, column: 20, scope: !1072)
!1076 = !DILocation(line: 253, column: 1, scope: !743)
!1077 = !DISubprogram(name: "LogMagickEvent", scope: !369, file: !369, line: 83, type: !1078, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!544, !1080, !645, !645, !1082, !645, null}
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !369, line: 58, baseType: !368)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!1083 = !{}
!1084 = !DISubprogram(name: "GetMagickPixelPacket", scope: !326, file: !326, line: 185, type: !1085, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{null, !747, !849}
!1087 = !DISubprogram(name: "AcquireVirtualCacheView", scope: !461, file: !461, line: 55, type: !1088, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!754, !747, !749}
!1090 = !DISubprogram(name: "GetCacheViewVirtualPixels", scope: !461, file: !461, line: 69, type: !1091, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!510, !1093, !1095, !1095, !1082, !1082, !749}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!1096 = !DISubprogram(name: "DestroyCacheView", scope: !461, file: !461, line: 57, type: !1097, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!754, !754}
!1099 = !DISubprogram(name: "GetCacheViewVirtualIndexQueue", scope: !461, file: !461, line: 66, type: !1100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!526, !1093}
!1102 = !DISubprogram(name: "IsMagickColorSimilar", scope: !618, file: !618, line: 82, type: !1103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!544, !1105, !1105}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!1107 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!544, !749, !645, !645, !1082, !1110, !645, !645, null}
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!1111 = distinct !DISubprogram(name: "GetImageDepth", scope: !744, file: !744, line: 283, type: !1112, scopeLine: 284, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1114)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!522, !747, !749}
!1114 = !{!1115, !1116}
!1115 = !DILocalVariable(name: "image", arg: 1, scope: !1111, file: !744, line: 283, type: !747)
!1116 = !DILocalVariable(name: "exception", arg: 2, scope: !1111, file: !744, line: 283, type: !749)
!1117 = !DILocation(line: 0, scope: !1111)
!1118 = !DILocation(line: 285, column: 10, scope: !1111)
!1119 = !DILocation(line: 285, column: 3, scope: !1111)
!1120 = distinct !DISubprogram(name: "GetImageChannelDepth", scope: !744, file: !744, line: 288, type: !1121, scopeLine: 290, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1125)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!522, !747, !1123, !749}
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !393)
!1125 = !{!1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1139, !1140, !1147, !1149, !1150, !1153, !1156, !1157, !1161, !1165, !1166, !1170, !1171, !1172, !1173}
!1126 = !DILocalVariable(name: "image", arg: 1, scope: !1120, file: !744, line: 288, type: !747)
!1127 = !DILocalVariable(name: "channel", arg: 2, scope: !1120, file: !744, line: 289, type: !1123)
!1128 = !DILocalVariable(name: "exception", arg: 3, scope: !1120, file: !744, line: 289, type: !749)
!1129 = !DILocalVariable(name: "image_view", scope: !1120, file: !744, line: 292, type: !754)
!1130 = !DILocalVariable(name: "status", scope: !1120, file: !744, line: 295, type: !544)
!1131 = !DILocalVariable(name: "i", scope: !1120, file: !744, line: 298, type: !505)
!1132 = !DILocalVariable(name: "current_depth", scope: !1120, file: !744, line: 301, type: !524)
!1133 = !DILocalVariable(name: "depth", scope: !1120, file: !744, line: 302, type: !522)
!1134 = !DILocalVariable(name: "number_threads", scope: !1120, file: !744, line: 303, type: !522)
!1135 = !DILocalVariable(name: "y", scope: !1120, file: !744, line: 306, type: !505)
!1136 = !DILocalVariable(name: "message", scope: !1137, file: !744, line: 320, type: !576)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !744, line: 320, column: 5)
!1138 = distinct !DILexicalBlock(scope: !1120, file: !744, line: 319, column: 7)
!1139 = !DILocalVariable(name: "exception", scope: !1137, file: !744, line: 320, type: !673)
!1140 = !DILocalVariable(name: "id", scope: !1141, file: !744, line: 333, type: !1146)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !744, line: 331, column: 7)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !744, line: 330, column: 7)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !744, line: 330, column: 7)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !744, line: 325, column: 5)
!1145 = distinct !DILexicalBlock(scope: !1120, file: !744, line: 324, column: 7)
!1146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!1147 = !DILocalVariable(name: "atDepth", scope: !1148, file: !744, line: 338, type: !544)
!1148 = distinct !DILexicalBlock(scope: !1141, file: !744, line: 336, column: 9)
!1149 = !DILocalVariable(name: "range", scope: !1148, file: !744, line: 341, type: !735)
!1150 = !DILocalVariable(name: "depth_map", scope: !1151, file: !744, line: 373, type: !524)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !744, line: 371, column: 5)
!1152 = distinct !DILexicalBlock(scope: !1120, file: !744, line: 369, column: 7)
!1153 = !DILocalVariable(name: "message", scope: !1154, file: !744, line: 380, type: !576)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !744, line: 380, column: 9)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !744, line: 379, column: 11)
!1156 = !DILocalVariable(name: "exception", scope: !1154, file: !744, line: 380, type: !673)
!1157 = !DILocalVariable(name: "depth", scope: !1158, file: !744, line: 384, type: !5)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !744, line: 382, column: 7)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !744, line: 381, column: 7)
!1160 = distinct !DILexicalBlock(scope: !1151, file: !744, line: 381, column: 7)
!1161 = !DILocalVariable(name: "pixel", scope: !1162, file: !744, line: 389, type: !516)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !744, line: 387, column: 9)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !744, line: 386, column: 9)
!1164 = distinct !DILexicalBlock(scope: !1158, file: !744, line: 386, column: 9)
!1165 = !DILocalVariable(name: "range", scope: !1162, file: !744, line: 392, type: !735)
!1166 = !DILocalVariable(name: "id", scope: !1167, file: !744, line: 408, type: !1146)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !744, line: 406, column: 7)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !744, line: 405, column: 7)
!1169 = distinct !DILexicalBlock(scope: !1151, file: !744, line: 405, column: 7)
!1170 = !DILocalVariable(name: "indexes", scope: !1167, file: !744, line: 411, type: !785)
!1171 = !DILocalVariable(name: "p", scope: !1167, file: !744, line: 414, type: !787)
!1172 = !DILocalVariable(name: "x", scope: !1167, file: !744, line: 417, type: !505)
!1173 = !DILocalVariable(name: "pixel", scope: !1174, file: !744, line: 428, type: !516)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !744, line: 426, column: 9)
!1175 = distinct !DILexicalBlock(scope: !1176, file: !744, line: 425, column: 9)
!1176 = distinct !DILexicalBlock(scope: !1167, file: !744, line: 425, column: 9)
!1177 = !DILocation(line: 0, scope: !1120)
!1178 = !DILocation(line: 314, column: 14, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1120, file: !744, line: 314, column: 7)
!1180 = !DILocation(line: 314, column: 20, scope: !1179)
!1181 = !DILocation(line: 314, column: 7, scope: !1120)
!1182 = !DILocation(line: 315, column: 68, scope: !1179)
!1183 = !DILocation(line: 315, column: 12, scope: !1179)
!1184 = !DILocation(line: 315, column: 5, scope: !1179)
!1185 = !DILocation(line: 316, column: 27, scope: !1120)
!1186 = !DILocation(line: 317, column: 28, scope: !1120)
!1187 = !DILocation(line: 319, column: 21, scope: !1138)
!1188 = !DILocation(line: 319, column: 7, scope: !1120)
!1189 = !DILocation(line: 322, column: 15, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !744, line: 322, column: 3)
!1191 = distinct !DILexicalBlock(scope: !1120, file: !744, line: 322, column: 3)
!1192 = !DILocation(line: 322, column: 3, scope: !1191)
!1193 = !DILocation(line: 320, column: 5, scope: !1137)
!1194 = !{!812, !812, i64 0}
!1195 = !DILocation(line: 0, scope: !1137)
!1196 = !DILocation(line: 323, column: 5, scope: !1190)
!1197 = !DILocation(line: 323, column: 21, scope: !1190)
!1198 = !DILocation(line: 322, column: 44, scope: !1190)
!1199 = distinct !{!1199, !1192, !1200, !1034, !1035}
!1200 = !DILocation(line: 323, column: 22, scope: !1191)
!1201 = !DILocation(line: 324, column: 15, scope: !1145)
!1202 = !{!797, !798, i64 0}
!1203 = !DILocation(line: 324, column: 29, scope: !1145)
!1204 = !DILocation(line: 324, column: 45, scope: !1145)
!1205 = !DILocation(line: 324, column: 56, scope: !1145)
!1206 = !{!797, !798, i64 32}
!1207 = !DILocation(line: 324, column: 62, scope: !1145)
!1208 = !DILocation(line: 324, column: 7, scope: !1120)
!1209 = !DILocation(line: 330, column: 38, scope: !1142)
!1210 = !{!797, !800, i64 64}
!1211 = !DILocation(line: 330, column: 19, scope: !1142)
!1212 = !DILocation(line: 330, column: 7, scope: !1143)
!1213 = !DILocation(line: 359, column: 13, scope: !1144)
!1214 = !DILocation(line: 335, column: 16, scope: !1141)
!1215 = !DILocation(line: 335, column: 34, scope: !1141)
!1216 = !DILocation(line: 0, scope: !1141)
!1217 = !DILocation(line: 335, column: 9, scope: !1141)
!1218 = !DILocation(line: 0, scope: !1148)
!1219 = !DILocalVariable(name: "depth", arg: 1, scope: !1220, file: !1221, line: 91, type: !1082)
!1220 = distinct !DISubprogram(name: "GetQuantumRange", scope: !1221, file: !1221, line: 91, type: !1222, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1224)
!1221 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!651, !1082}
!1224 = !{!1219, !1225}
!1225 = !DILocalVariable(name: "one", scope: !1220, file: !1221, line: 94, type: !651)
!1226 = !DILocation(line: 0, scope: !1220, inlinedAt: !1227)
!1227 = distinct !DILocation(line: 344, column: 17, scope: !1148)
!1228 = !DILocation(line: 97, column: 42, scope: !1220, inlinedAt: !1227)
!1229 = !DILocation(line: 97, column: 46, scope: !1220, inlinedAt: !1227)
!1230 = !DILocation(line: 345, column: 15, scope: !1148)
!1231 = !DILocation(line: 346, column: 39, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !744, line: 346, column: 17)
!1233 = distinct !DILexicalBlock(scope: !1148, file: !744, line: 345, column: 15)
!1234 = !{!797, !801, i64 72}
!1235 = !DILocation(line: 346, column: 51, scope: !1232)
!1236 = !DILocalVariable(name: "pixel", arg: 1, scope: !1237, file: !1238, line: 142, type: !1241)
!1237 = distinct !DISubprogram(name: "IsPixelAtDepth", scope: !1238, file: !1238, line: 142, type: !1239, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1243)
!1238 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel-accessor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5a3f95523a4166f31b566bb4d0a07c1b")
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!544, !1241, !1242}
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!1243 = !{!1236, !1244, !1245}
!1244 = !DILocalVariable(name: "range", arg: 2, scope: !1237, file: !1238, line: 143, type: !1242)
!1245 = !DILocalVariable(name: "quantum", scope: !1237, file: !1238, line: 146, type: !516)
!1246 = !DILocation(line: 0, scope: !1237, inlinedAt: !1247)
!1247 = distinct !DILocation(line: 346, column: 17, scope: !1232)
!1248 = !DILocation(line: 150, column: 7, scope: !1237, inlinedAt: !1247)
!1249 = !DILocation(line: 150, column: 30, scope: !1237, inlinedAt: !1247)
!1250 = !DILocation(line: 150, column: 29, scope: !1237, inlinedAt: !1247)
!1251 = !DILocation(line: 150, column: 36, scope: !1237, inlinedAt: !1247)
!1252 = !DILocation(line: 150, column: 6, scope: !1237, inlinedAt: !1247)
!1253 = !DILocation(line: 150, column: 49, scope: !1237, inlinedAt: !1247)
!1254 = !DILocation(line: 149, column: 54, scope: !1237, inlinedAt: !1247)
!1255 = !DILocation(line: 149, column: 53, scope: !1237, inlinedAt: !1247)
!1256 = !DILocation(line: 149, column: 52, scope: !1237, inlinedAt: !1247)
!1257 = !DILocation(line: 150, column: 56, scope: !1237, inlinedAt: !1247)
!1258 = !DILocation(line: 149, column: 22, scope: !1237, inlinedAt: !1247)
!1259 = !DILocation(line: 150, column: 62, scope: !1237, inlinedAt: !1247)
!1260 = !DILocation(line: 149, column: 11, scope: !1237, inlinedAt: !1247)
!1261 = !DILocation(line: 155, column: 16, scope: !1237, inlinedAt: !1247)
!1262 = !DILocation(line: 348, column: 40, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1148, file: !744, line: 348, column: 15)
!1264 = !DILocation(line: 348, column: 15, scope: !1148)
!1265 = !DILocation(line: 349, column: 39, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1263, file: !744, line: 349, column: 17)
!1267 = !DILocation(line: 349, column: 51, scope: !1266)
!1268 = !DILocation(line: 0, scope: !1237, inlinedAt: !1269)
!1269 = distinct !DILocation(line: 349, column: 17, scope: !1266)
!1270 = !DILocation(line: 150, column: 7, scope: !1237, inlinedAt: !1269)
!1271 = !DILocation(line: 150, column: 30, scope: !1237, inlinedAt: !1269)
!1272 = !DILocation(line: 150, column: 29, scope: !1237, inlinedAt: !1269)
!1273 = !DILocation(line: 150, column: 36, scope: !1237, inlinedAt: !1269)
!1274 = !DILocation(line: 150, column: 6, scope: !1237, inlinedAt: !1269)
!1275 = !DILocation(line: 150, column: 49, scope: !1237, inlinedAt: !1269)
!1276 = !DILocation(line: 149, column: 54, scope: !1237, inlinedAt: !1269)
!1277 = !DILocation(line: 149, column: 53, scope: !1237, inlinedAt: !1269)
!1278 = !DILocation(line: 149, column: 52, scope: !1237, inlinedAt: !1269)
!1279 = !DILocation(line: 150, column: 56, scope: !1237, inlinedAt: !1269)
!1280 = !DILocation(line: 149, column: 22, scope: !1237, inlinedAt: !1269)
!1281 = !DILocation(line: 150, column: 62, scope: !1237, inlinedAt: !1269)
!1282 = !DILocation(line: 149, column: 11, scope: !1237, inlinedAt: !1269)
!1283 = !DILocation(line: 155, column: 16, scope: !1237, inlinedAt: !1269)
!1284 = !DILocation(line: 351, column: 40, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1148, file: !744, line: 351, column: 15)
!1286 = !DILocation(line: 351, column: 15, scope: !1148)
!1287 = !DILocation(line: 352, column: 39, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1285, file: !744, line: 352, column: 17)
!1289 = !DILocation(line: 352, column: 32, scope: !1288)
!1290 = !DILocation(line: 352, column: 51, scope: !1288)
!1291 = !DILocation(line: 0, scope: !1237, inlinedAt: !1292)
!1292 = distinct !DILocation(line: 352, column: 17, scope: !1288)
!1293 = !DILocation(line: 150, column: 7, scope: !1237, inlinedAt: !1292)
!1294 = !DILocation(line: 150, column: 30, scope: !1237, inlinedAt: !1292)
!1295 = !DILocation(line: 150, column: 29, scope: !1237, inlinedAt: !1292)
!1296 = !DILocation(line: 150, column: 36, scope: !1237, inlinedAt: !1292)
!1297 = !DILocation(line: 150, column: 6, scope: !1237, inlinedAt: !1292)
!1298 = !DILocation(line: 150, column: 49, scope: !1237, inlinedAt: !1292)
!1299 = !DILocation(line: 149, column: 54, scope: !1237, inlinedAt: !1292)
!1300 = !DILocation(line: 149, column: 53, scope: !1237, inlinedAt: !1292)
!1301 = !DILocation(line: 149, column: 52, scope: !1237, inlinedAt: !1292)
!1302 = !DILocation(line: 150, column: 56, scope: !1237, inlinedAt: !1292)
!1303 = !DILocation(line: 149, column: 22, scope: !1237, inlinedAt: !1292)
!1304 = !DILocation(line: 150, column: 62, scope: !1237, inlinedAt: !1292)
!1305 = !DILocation(line: 149, column: 11, scope: !1237, inlinedAt: !1292)
!1306 = !DILocation(line: 155, column: 16, scope: !1237, inlinedAt: !1292)
!1307 = !DILocation(line: 354, column: 15, scope: !1148)
!1308 = !DILocation(line: 356, column: 28, scope: !1148)
!1309 = !DILocation(line: 330, column: 47, scope: !1142)
!1310 = distinct !{!1310, !1212, !1311, !1034, !1035, !1312}
!1311 = !DILocation(line: 358, column: 7, scope: !1143)
!1312 = !{!"llvm.loop.unswitch.partial.disable"}
!1313 = !DILocation(line: 360, column: 19, scope: !1314)
!1314 = distinct !DILexicalBlock(scope: !1315, file: !744, line: 360, column: 7)
!1315 = distinct !DILexicalBlock(scope: !1144, file: !744, line: 360, column: 7)
!1316 = !DILocation(line: 360, column: 7, scope: !1315)
!1317 = !DILocation(line: 361, column: 21, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1314, file: !744, line: 361, column: 13)
!1319 = !DILocation(line: 361, column: 13, scope: !1314)
!1320 = !DILocation(line: 360, column: 48, scope: !1314)
!1321 = distinct !{!1321, !1316, !1322, !1034, !1035}
!1322 = !DILocation(line: 362, column: 32, scope: !1315)
!1323 = !DILocation(line: 366, column: 14, scope: !1120)
!1324 = !DILocation(line: 378, column: 28, scope: !1151)
!1325 = !DILocation(line: 0, scope: !1151)
!1326 = !DILocation(line: 379, column: 21, scope: !1155)
!1327 = !DILocation(line: 379, column: 11, scope: !1151)
!1328 = !DILocation(line: 380, column: 9, scope: !1154)
!1329 = !DILocation(line: 0, scope: !1154)
!1330 = !DILocation(line: 0, scope: !1158)
!1331 = !DILocation(line: 386, column: 9, scope: !1164)
!1332 = !DILocation(line: 405, column: 38, scope: !1168)
!1333 = !DILocation(line: 405, column: 19, scope: !1168)
!1334 = !DILocation(line: 405, column: 7, scope: !1169)
!1335 = !DILocation(line: 0, scope: !1220, inlinedAt: !1336)
!1336 = distinct !DILocation(line: 394, column: 17, scope: !1162)
!1337 = !DILocation(line: 97, column: 42, scope: !1220, inlinedAt: !1336)
!1338 = !DILocation(line: 97, column: 46, scope: !1220, inlinedAt: !1336)
!1339 = !DILocation(line: 0, scope: !1162)
!1340 = !DILocalVariable(name: "quantum", arg: 1, scope: !1341, file: !1221, line: 281, type: !1241)
!1341 = distinct !DISubprogram(name: "ScaleQuantumToAny", scope: !1221, file: !1221, line: 281, type: !1342, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1344)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!735, !1241, !1242}
!1344 = !{!1340, !1345}
!1345 = !DILocalVariable(name: "range", arg: 2, scope: !1341, file: !1221, line: 282, type: !1242)
!1346 = !DILocation(line: 0, scope: !1341, inlinedAt: !1347)
!1347 = distinct !DILocation(line: 396, column: 42, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1162, file: !744, line: 396, column: 15)
!1349 = !DILocation(line: 284, column: 25, scope: !1341, inlinedAt: !1347)
!1350 = !DILocation(line: 284, column: 47, scope: !1341, inlinedAt: !1347)
!1351 = !DILocation(line: 284, column: 56, scope: !1341, inlinedAt: !1347)
!1352 = !DILocation(line: 284, column: 24, scope: !1341, inlinedAt: !1347)
!1353 = !DILocation(line: 284, column: 69, scope: !1341, inlinedAt: !1347)
!1354 = !DILocation(line: 284, column: 10, scope: !1341, inlinedAt: !1347)
!1355 = !DILocalVariable(name: "quantum", arg: 1, scope: !1356, file: !1221, line: 271, type: !1242)
!1356 = distinct !DISubprogram(name: "ScaleAnyToQuantum", scope: !1221, file: !1221, line: 271, type: !1357, scopeLine: 273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1359)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!516, !1242, !1242}
!1359 = !{!1355, !1360}
!1360 = !DILocalVariable(name: "range", arg: 2, scope: !1356, file: !1221, line: 272, type: !1242)
!1361 = !DILocation(line: 0, scope: !1356, inlinedAt: !1362)
!1362 = distinct !DILocation(line: 396, column: 24, scope: !1348)
!1363 = !DILocation(line: 275, column: 52, scope: !1356, inlinedAt: !1362)
!1364 = !DILocation(line: 275, column: 51, scope: !1356, inlinedAt: !1362)
!1365 = !DILocation(line: 275, column: 60, scope: !1356, inlinedAt: !1362)
!1366 = !DILocation(line: 275, column: 21, scope: !1356, inlinedAt: !1362)
!1367 = !DILocation(line: 275, column: 66, scope: !1356, inlinedAt: !1362)
!1368 = !DILocation(line: 275, column: 10, scope: !1356, inlinedAt: !1362)
!1369 = !DILocation(line: 396, column: 21, scope: !1348)
!1370 = !DILocation(line: 386, column: 62, scope: !1163)
!1371 = !DILocation(line: 386, column: 29, scope: !1163)
!1372 = distinct !{!1372, !1331, !1373, !1034, !1035}
!1373 = !DILocation(line: 398, column: 9, scope: !1164)
!1374 = !DILocation(line: 0, scope: !1164)
!1375 = !DILocation(line: 399, column: 22, scope: !1158)
!1376 = !DILocation(line: 399, column: 9, scope: !1158)
!1377 = !DILocation(line: 399, column: 21, scope: !1158)
!1378 = !DILocation(line: 381, column: 41, scope: !1159)
!1379 = !DILocation(line: 381, column: 19, scope: !1159)
!1380 = !DILocation(line: 381, column: 7, scope: !1160)
!1381 = distinct !{!1381, !1380, !1382, !1034, !1035}
!1382 = !DILocation(line: 400, column: 7, scope: !1160)
!1383 = !DILocation(line: 0, scope: !1167)
!1384 = !DILocation(line: 419, column: 20, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1167, file: !744, line: 419, column: 13)
!1386 = !DILocation(line: 419, column: 13, scope: !1167)
!1387 = !DILocation(line: 421, column: 59, scope: !1167)
!1388 = !DILocation(line: 421, column: 11, scope: !1167)
!1389 = !DILocation(line: 422, column: 15, scope: !1390)
!1390 = distinct !DILexicalBlock(scope: !1167, file: !744, line: 422, column: 13)
!1391 = !DILocation(line: 422, column: 13, scope: !1167)
!1392 = !DILocation(line: 424, column: 17, scope: !1167)
!1393 = !DILocation(line: 425, column: 40, scope: !1175)
!1394 = !DILocation(line: 425, column: 21, scope: !1175)
!1395 = !DILocation(line: 425, column: 9, scope: !1176)
!1396 = !DILocation(line: 455, column: 47, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !1174, file: !744, line: 455, column: 15)
!1398 = !DILocation(line: 430, column: 15, scope: !1174)
!1399 = !DILocation(line: 432, column: 21, scope: !1400)
!1400 = distinct !DILexicalBlock(scope: !1401, file: !744, line: 431, column: 13)
!1401 = distinct !DILexicalBlock(scope: !1174, file: !744, line: 430, column: 15)
!1402 = !DILocation(line: 0, scope: !1174)
!1403 = !DILocation(line: 433, column: 19, scope: !1404)
!1404 = distinct !DILexicalBlock(scope: !1400, file: !744, line: 433, column: 19)
!1405 = !DILocation(line: 433, column: 57, scope: !1404)
!1406 = !DILocation(line: 433, column: 55, scope: !1404)
!1407 = !DILocation(line: 433, column: 19, scope: !1400)
!1408 = !DILocation(line: 434, column: 34, scope: !1404)
!1409 = !DILocation(line: 434, column: 17, scope: !1404)
!1410 = !DILocation(line: 436, column: 15, scope: !1174)
!1411 = !DILocation(line: 438, column: 21, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1413, file: !744, line: 437, column: 13)
!1413 = distinct !DILexicalBlock(scope: !1174, file: !744, line: 436, column: 15)
!1414 = !DILocation(line: 439, column: 19, scope: !1415)
!1415 = distinct !DILexicalBlock(scope: !1412, file: !744, line: 439, column: 19)
!1416 = !DILocation(line: 439, column: 57, scope: !1415)
!1417 = !DILocation(line: 439, column: 55, scope: !1415)
!1418 = !DILocation(line: 439, column: 19, scope: !1412)
!1419 = !DILocation(line: 440, column: 34, scope: !1415)
!1420 = !DILocation(line: 440, column: 17, scope: !1415)
!1421 = !DILocation(line: 442, column: 15, scope: !1174)
!1422 = !DILocation(line: 444, column: 21, scope: !1423)
!1423 = distinct !DILexicalBlock(scope: !1424, file: !744, line: 443, column: 13)
!1424 = distinct !DILexicalBlock(scope: !1174, file: !744, line: 442, column: 15)
!1425 = !DILocation(line: 445, column: 19, scope: !1426)
!1426 = distinct !DILexicalBlock(scope: !1423, file: !744, line: 445, column: 19)
!1427 = !DILocation(line: 445, column: 57, scope: !1426)
!1428 = !DILocation(line: 445, column: 55, scope: !1426)
!1429 = !DILocation(line: 445, column: 19, scope: !1423)
!1430 = !DILocation(line: 446, column: 34, scope: !1426)
!1431 = !DILocation(line: 446, column: 17, scope: !1426)
!1432 = !DILocation(line: 448, column: 49, scope: !1433)
!1433 = distinct !DILexicalBlock(scope: !1174, file: !744, line: 448, column: 15)
!1434 = !DILocation(line: 449, column: 24, scope: !1433)
!1435 = !DILocation(line: 449, column: 30, scope: !1433)
!1436 = !DILocation(line: 448, column: 15, scope: !1174)
!1437 = !DILocation(line: 451, column: 21, scope: !1438)
!1438 = distinct !DILexicalBlock(scope: !1433, file: !744, line: 450, column: 13)
!1439 = !DILocation(line: 452, column: 19, scope: !1440)
!1440 = distinct !DILexicalBlock(scope: !1438, file: !744, line: 452, column: 19)
!1441 = !DILocation(line: 452, column: 57, scope: !1440)
!1442 = !DILocation(line: 452, column: 55, scope: !1440)
!1443 = !DILocation(line: 452, column: 19, scope: !1438)
!1444 = !DILocation(line: 453, column: 34, scope: !1440)
!1445 = !DILocation(line: 453, column: 17, scope: !1440)
!1446 = !DILocation(line: 462, column: 12, scope: !1174)
!1447 = !DILocation(line: 425, column: 50, scope: !1175)
!1448 = distinct !{!1448, !1395, !1449, !1034, !1035}
!1449 = !DILocation(line: 463, column: 9, scope: !1176)
!1450 = !DILocation(line: 455, column: 15, scope: !1174)
!1451 = !DILocation(line: 458, column: 21, scope: !1452)
!1452 = distinct !DILexicalBlock(scope: !1397, file: !744, line: 457, column: 13)
!1453 = !DILocation(line: 459, column: 19, scope: !1454)
!1454 = distinct !DILexicalBlock(scope: !1452, file: !744, line: 459, column: 19)
!1455 = !DILocation(line: 459, column: 57, scope: !1454)
!1456 = !DILocation(line: 459, column: 55, scope: !1454)
!1457 = !DILocation(line: 459, column: 19, scope: !1452)
!1458 = !DILocation(line: 460, column: 34, scope: !1454)
!1459 = !DILocation(line: 460, column: 17, scope: !1454)
!1460 = !DILocation(line: 464, column: 13, scope: !1461)
!1461 = distinct !DILexicalBlock(scope: !1167, file: !744, line: 464, column: 13)
!1462 = !DILocation(line: 464, column: 31, scope: !1461)
!1463 = !DILocation(line: 464, column: 13, scope: !1167)
!1464 = !DILocation(line: 466, column: 7, scope: !1168)
!1465 = !DILocation(line: 405, column: 45, scope: !1168)
!1466 = distinct !{!1466, !1334, !1467, !1034, !1035}
!1467 = !DILocation(line: 466, column: 7, scope: !1169)
!1468 = !DILocation(line: 467, column: 18, scope: !1151)
!1469 = !DILocation(line: 468, column: 13, scope: !1151)
!1470 = !DILocation(line: 469, column: 19, scope: !1471)
!1471 = distinct !DILexicalBlock(scope: !1472, file: !744, line: 469, column: 7)
!1472 = distinct !DILexicalBlock(scope: !1151, file: !744, line: 469, column: 7)
!1473 = !DILocation(line: 469, column: 7, scope: !1472)
!1474 = !DILocation(line: 470, column: 21, scope: !1475)
!1475 = distinct !DILexicalBlock(scope: !1471, file: !744, line: 470, column: 13)
!1476 = !DILocation(line: 470, column: 13, scope: !1471)
!1477 = !DILocation(line: 469, column: 48, scope: !1471)
!1478 = distinct !{!1478, !1473, !1479, !1034, !1035}
!1479 = !DILocation(line: 471, column: 32, scope: !1472)
!1480 = !DILocation(line: 472, column: 28, scope: !1151)
!1481 = !DILocation(line: 546, column: 1, scope: !1120)
!1482 = !DISubprogram(name: "GetMagickResourceLimit", scope: !416, file: !416, line: 53, type: !1483, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!651, !1485}
!1485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1486)
!1486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResourceType", file: !416, line: 36, baseType: !415)
!1487 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1488, file: !1488, line: 42, type: !1489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1488 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!521, !1082, !1082}
!1491 = !DISubprogram(name: "GetExceptionInfo", scope: !253, file: !253, line: 166, type: !1492, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !749}
!1494 = !DISubprogram(name: "GetExceptionMessage", scope: !253, file: !253, line: 137, type: !1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!576, !1146}
!1497 = !DISubprogram(name: "DestroyString", scope: !1498, file: !1498, line: 46, type: !1499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1498 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!576, !576}
!1501 = !DISubprogram(name: "CatchException", scope: !253, file: !253, line: 164, type: !1492, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1502 = !DISubprogram(name: "DestroyExceptionInfo", scope: !253, file: !253, line: 148, type: !1503, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!749, !749}
!1505 = !DISubprogram(name: "MagickCoreTerminus", scope: !1506, file: !1506, line: 147, type: !1507, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1506 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!1507 = !DISubroutineType(types: !1508)
!1508 = !{null}
!1509 = !DISubprogram(name: "RelinquishMagickMemory", scope: !1488, file: !1488, line: 51, type: !1510, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1083)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!521, !521}
!1512 = distinct !DISubprogram(name: "GetImageQuantumDepth", scope: !744, file: !744, line: 583, type: !1513, scopeLine: 585, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1516)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!522, !747, !1515}
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!1516 = !{!1517, !1518, !1519}
!1517 = !DILocalVariable(name: "image", arg: 1, scope: !1512, file: !744, line: 583, type: !747)
!1518 = !DILocalVariable(name: "constrain", arg: 2, scope: !1512, file: !744, line: 584, type: !1515)
!1519 = !DILocalVariable(name: "depth", scope: !1512, file: !744, line: 587, type: !522)
!1520 = !DILocation(line: 0, scope: !1512)
!1521 = !DILocation(line: 589, column: 16, scope: !1512)
!1522 = !{!797, !800, i64 56}
!1523 = !DILocation(line: 590, column: 13, scope: !1524)
!1524 = distinct !DILexicalBlock(scope: !1512, file: !744, line: 590, column: 7)
!1525 = !DILocation(line: 590, column: 7, scope: !1512)
!1526 = !DILocation(line: 593, column: 15, scope: !1527)
!1527 = distinct !DILexicalBlock(scope: !1524, file: !744, line: 593, column: 9)
!1528 = !DILocation(line: 593, column: 9, scope: !1524)
!1529 = !DILocation(line: 596, column: 11, scope: !1527)
!1530 = !DILocation(line: 0, scope: !1524)
!1531 = !DILocation(line: 601, column: 17, scope: !1532)
!1532 = distinct !DILexicalBlock(scope: !1512, file: !744, line: 601, column: 7)
!1533 = !DILocation(line: 601, column: 7, scope: !1512)
!1534 = !DILocation(line: 602, column: 30, scope: !1532)
!1535 = !DILocalVariable(name: "x", arg: 1, scope: !1536, file: !744, line: 576, type: !1539)
!1536 = distinct !DISubprogram(name: "MagickMin", scope: !744, file: !744, line: 576, type: !1537, scopeLine: 577, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1540)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!529, !1539, !1539}
!1539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!1540 = !{!1535, !1541}
!1541 = !DILocalVariable(name: "y", arg: 2, scope: !1536, file: !744, line: 576, type: !1539)
!1542 = !DILocation(line: 0, scope: !1536, inlinedAt: !1543)
!1543 = distinct !DILocation(line: 602, column: 20, scope: !1532)
!1544 = !DILocation(line: 578, column: 9, scope: !1545, inlinedAt: !1543)
!1545 = distinct !DILexicalBlock(scope: !1536, file: !744, line: 578, column: 7)
!1546 = !DILocation(line: 602, column: 11, scope: !1532)
!1547 = !DILocation(line: 602, column: 5, scope: !1532)
!1548 = !DILocation(line: 603, column: 3, scope: !1512)
!1549 = distinct !DISubprogram(name: "GetImageType", scope: !744, file: !744, line: 638, type: !1550, scopeLine: 639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1552)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!720, !747, !749}
!1552 = !{!1553, !1554}
!1553 = !DILocalVariable(name: "image", arg: 1, scope: !1549, file: !744, line: 638, type: !747)
!1554 = !DILocalVariable(name: "exception", arg: 2, scope: !1549, file: !744, line: 638, type: !749)
!1555 = !DILocation(line: 0, scope: !1549)
!1556 = !DILocation(line: 642, column: 14, scope: !1557)
!1557 = distinct !DILexicalBlock(scope: !1549, file: !744, line: 642, column: 7)
!1558 = !DILocation(line: 642, column: 20, scope: !1557)
!1559 = !DILocation(line: 642, column: 7, scope: !1549)
!1560 = !DILocation(line: 643, column: 68, scope: !1557)
!1561 = !DILocation(line: 643, column: 12, scope: !1557)
!1562 = !DILocation(line: 643, column: 5, scope: !1557)
!1563 = !DILocation(line: 644, column: 14, scope: !1564)
!1564 = distinct !DILexicalBlock(scope: !1549, file: !744, line: 644, column: 7)
!1565 = !DILocation(line: 644, column: 25, scope: !1564)
!1566 = !DILocation(line: 644, column: 7, scope: !1549)
!1567 = !DILocation(line: 646, column: 18, scope: !1568)
!1568 = distinct !DILexicalBlock(scope: !1569, file: !744, line: 646, column: 11)
!1569 = distinct !DILexicalBlock(scope: !1564, file: !744, line: 645, column: 5)
!1570 = !DILocation(line: 646, column: 24, scope: !1568)
!1571 = !DILocation(line: 0, scope: !1569)
!1572 = !DILocation(line: 650, column: 7, scope: !1573)
!1573 = distinct !DILexicalBlock(scope: !1549, file: !744, line: 650, column: 7)
!1574 = !DILocation(line: 650, column: 42, scope: !1573)
!1575 = !DILocation(line: 650, column: 7, scope: !1549)
!1576 = !DILocation(line: 652, column: 7, scope: !1577)
!1577 = distinct !DILexicalBlock(scope: !1549, file: !744, line: 652, column: 7)
!1578 = !DILocation(line: 652, column: 36, scope: !1577)
!1579 = !DILocation(line: 652, column: 7, scope: !1549)
!1580 = !DILocation(line: 654, column: 18, scope: !1581)
!1581 = distinct !DILexicalBlock(scope: !1582, file: !744, line: 654, column: 11)
!1582 = distinct !DILexicalBlock(scope: !1577, file: !744, line: 653, column: 5)
!1583 = !DILocation(line: 654, column: 24, scope: !1581)
!1584 = !DILocation(line: 0, scope: !1582)
!1585 = !DILocation(line: 658, column: 7, scope: !1586)
!1586 = distinct !DILexicalBlock(scope: !1549, file: !744, line: 658, column: 7)
!1587 = !DILocation(line: 658, column: 39, scope: !1586)
!1588 = !DILocation(line: 658, column: 7, scope: !1549)
!1589 = !DILocation(line: 0, scope: !1590)
!1590 = distinct !DILexicalBlock(scope: !1586, file: !744, line: 659, column: 5)
!1591 = !DILocation(line: 667, column: 1, scope: !1549)
!1592 = distinct !DISubprogram(name: "IsMonochromeImage", scope: !744, file: !744, line: 783, type: !1593, scopeLine: 785, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1595)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!544, !747, !749}
!1595 = !{!1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603}
!1596 = !DILocalVariable(name: "image", arg: 1, scope: !1592, file: !744, line: 783, type: !747)
!1597 = !DILocalVariable(name: "exception", arg: 2, scope: !1592, file: !744, line: 784, type: !749)
!1598 = !DILocalVariable(name: "image_view", scope: !1592, file: !744, line: 787, type: !754)
!1599 = !DILocalVariable(name: "type", scope: !1592, file: !744, line: 790, type: !720)
!1600 = !DILocalVariable(name: "status", scope: !1592, file: !744, line: 793, type: !544)
!1601 = !DILocalVariable(name: "x", scope: !1592, file: !744, line: 796, type: !505)
!1602 = !DILocalVariable(name: "p", scope: !1592, file: !744, line: 799, type: !510)
!1603 = !DILocalVariable(name: "y", scope: !1592, file: !744, line: 802, type: !505)
!1604 = !DILocation(line: 0, scope: !1592)
!1605 = !DILocation(line: 806, column: 14, scope: !1606)
!1606 = distinct !DILexicalBlock(scope: !1592, file: !744, line: 806, column: 7)
!1607 = !DILocation(line: 806, column: 20, scope: !1606)
!1608 = !DILocation(line: 806, column: 7, scope: !1592)
!1609 = !DILocation(line: 807, column: 68, scope: !1606)
!1610 = !DILocation(line: 807, column: 12, scope: !1606)
!1611 = !DILocation(line: 807, column: 5, scope: !1606)
!1612 = !DILocation(line: 808, column: 14, scope: !1613)
!1613 = distinct !DILexicalBlock(scope: !1592, file: !744, line: 808, column: 7)
!1614 = !{!797, !798, i64 13184}
!1615 = !DILocation(line: 808, column: 19, scope: !1613)
!1616 = !DILocation(line: 808, column: 7, scope: !1592)
!1617 = !DILocation(line: 810, column: 32, scope: !1618)
!1618 = distinct !DILexicalBlock(scope: !1592, file: !744, line: 810, column: 7)
!1619 = !DILocalVariable(name: "colorspace", arg: 1, scope: !1620, file: !1621, line: 86, type: !1624)
!1620 = distinct !DISubprogram(name: "IsGrayColorspace", scope: !1621, file: !1621, line: 85, type: !1622, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1625)
!1621 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bac8bff1724649a3818d765f5f2e1482")
!1622 = !DISubroutineType(types: !1623)
!1623 = !{!544, !1624}
!1624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!1625 = !{!1619}
!1626 = !DILocation(line: 0, scope: !1620, inlinedAt: !1627)
!1627 = distinct !DILocation(line: 810, column: 8, scope: !1618)
!1628 = !DILocation(line: 88, column: 38, scope: !1629, inlinedAt: !1627)
!1629 = distinct !DILexicalBlock(scope: !1620, file: !1621, line: 88, column: 7)
!1630 = !DILocation(line: 814, column: 14, scope: !1592)
!1631 = !DILocation(line: 815, column: 34, scope: !1632)
!1632 = distinct !DILexicalBlock(scope: !1633, file: !744, line: 815, column: 3)
!1633 = distinct !DILexicalBlock(scope: !1592, file: !744, line: 815, column: 3)
!1634 = !DILocation(line: 815, column: 15, scope: !1632)
!1635 = !DILocation(line: 815, column: 3, scope: !1633)
!1636 = !DILocation(line: 817, column: 55, scope: !1637)
!1637 = distinct !DILexicalBlock(scope: !1632, file: !744, line: 816, column: 3)
!1638 = !DILocation(line: 817, column: 7, scope: !1637)
!1639 = !DILocation(line: 818, column: 11, scope: !1640)
!1640 = distinct !DILexicalBlock(scope: !1637, file: !744, line: 818, column: 9)
!1641 = !DILocation(line: 818, column: 9, scope: !1637)
!1642 = !DILocation(line: 820, column: 17, scope: !1643)
!1643 = distinct !DILexicalBlock(scope: !1644, file: !744, line: 820, column: 5)
!1644 = distinct !DILexicalBlock(scope: !1637, file: !744, line: 820, column: 5)
!1645 = !DILocation(line: 820, column: 5, scope: !1644)
!1646 = !DILocalVariable(name: "pixel", arg: 1, scope: !1647, file: !846, line: 53, type: !510)
!1647 = distinct !DISubprogram(name: "IsMonochromePixel", scope: !846, file: !846, line: 53, type: !1648, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1650)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!544, !510}
!1650 = !{!1646}
!1651 = !DILocation(line: 0, scope: !1647, inlinedAt: !1652)
!1652 = distinct !DILocation(line: 822, column: 11, scope: !1653)
!1653 = distinct !DILexicalBlock(scope: !1654, file: !744, line: 822, column: 11)
!1654 = distinct !DILexicalBlock(scope: !1643, file: !744, line: 821, column: 5)
!1655 = !DILocation(line: 56, column: 9, scope: !1656, inlinedAt: !1652)
!1656 = distinct !DILexicalBlock(scope: !1647, file: !846, line: 56, column: 7)
!1657 = !DILocation(line: 56, column: 34, scope: !1656, inlinedAt: !1652)
!1658 = !DILocation(line: 58, column: 30, scope: !1656, inlinedAt: !1652)
!1659 = !DILocation(line: 58, column: 27, scope: !1656, inlinedAt: !1652)
!1660 = !DILocation(line: 58, column: 52, scope: !1656, inlinedAt: !1652)
!1661 = !DILocation(line: 59, column: 32, scope: !1656, inlinedAt: !1652)
!1662 = !DILocation(line: 59, column: 29, scope: !1656, inlinedAt: !1652)
!1663 = !DILocation(line: 56, column: 7, scope: !1647, inlinedAt: !1652)
!1664 = !DILocation(line: 827, column: 8, scope: !1654)
!1665 = !DILocation(line: 820, column: 46, scope: !1643)
