; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/blob.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/blob.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._BlobInfo = type { i64, i64, i64, i32, i32, i64, i64, i32, i32, i32, i32, i32, %union.FileInfo, %struct.stat, ptr, ptr, i32, ptr, i64, i64 }
%union.FileInfo = type { ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i64, i64, i64, i32, i32, i32, i64, ptr, ptr, ptr, ptr, ptr, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, ptr, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, ptr, i32 }
%struct._PixelPacket = type { i16, i16, i16, i16 }

!480 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !481, line: 28, baseType: !5, size: 32, elements: !482)
!481 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!482 = !{!483, !484, !485}
!483 = !DIEnumerator(name: "UndefinedFormatType", value: 0)
!484 = !DIEnumerator(name: "ImplicitFormatType", value: 1)
!485 = !DIEnumerator(name: "ExplicitFormatType", value: 2)
!486 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !487, line: 25, baseType: !5, size: 32, elements: !488)
!487 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497}
!489 = !DIEnumerator(name: "UndefinedResource", value: 0)
!490 = !DIEnumerator(name: "AreaResource", value: 1)
!491 = !DIEnumerator(name: "DiskResource", value: 2)
!492 = !DIEnumerator(name: "FileResource", value: 3)
!493 = !DIEnumerator(name: "MapResource", value: 4)
!494 = !DIEnumerator(name: "MemoryResource", value: 5)
!495 = !DIEnumerator(name: "ThreadResource", value: 6)
!496 = !DIEnumerator(name: "TimeResource", value: 7)
!497 = !DIEnumerator(name: "ThrottleResource", value: 8)
!498 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !499, line: 30, baseType: !5, size: 32, elements: !500)
!499 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "aeac60f5bee0fb1a4f0bd1456ae975f0")
!500 = !{!501, !502, !503}
!501 = !DIEnumerator(name: "ReadMode", value: 0)
!502 = !DIEnumerator(name: "WriteMode", value: 1)
!503 = !DIEnumerator(name: "IOMode", value: 2)
!504 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 35, baseType: !5, size: 32, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512}
!506 = !DIEnumerator(name: "UndefinedBlobMode", value: 0)
!507 = !DIEnumerator(name: "ReadBlobMode", value: 1)
!508 = !DIEnumerator(name: "ReadBinaryBlobMode", value: 2)
!509 = !DIEnumerator(name: "WriteBlobMode", value: 3)
!510 = !DIEnumerator(name: "WriteBinaryBlobMode", value: 4)
!511 = !DIEnumerator(name: "AppendBlobMode", value: 5)
!512 = !DIEnumerator(name: "AppendBinaryBlobMode", value: 6)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !514, line: 39, baseType: !5, size: 32, elements: !515)
!514 = !DIFile(filename: "apps/538.imagick_r/src/magick/policy.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "6242d97ee47d0d7f0e3878e07f1ce5b1")
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIEnumerator(name: "UndefinedPolicyRights", value: 0)
!517 = !DIEnumerator(name: "NoPolicyRights", value: 0)
!518 = !DIEnumerator(name: "ReadPolicyRights", value: 1)
!519 = !DIEnumerator(name: "WritePolicyRights", value: 2)
!520 = !DIEnumerator(name: "ExecutePolicyRights", value: 4)
!521 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !514, line: 28, baseType: !5, size: 32, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529}
!523 = !DIEnumerator(name: "UndefinedPolicyDomain", value: 0)
!524 = !DIEnumerator(name: "CoderPolicyDomain", value: 1)
!525 = !DIEnumerator(name: "DelegatePolicyDomain", value: 2)
!526 = !DIEnumerator(name: "FilterPolicyDomain", value: 3)
!527 = !DIEnumerator(name: "PathPolicyDomain", value: 4)
!528 = !DIEnumerator(name: "ResourcePolicyDomain", value: 5)
!529 = !DIEnumerator(name: "SystemPolicyDomain", value: 6)
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 25, baseType: !5, size: 32, elements: !532)
!531 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !541}
!533 = !DIEnumerator(name: "UndefinedPath", value: 0)
!534 = !DIEnumerator(name: "MagickPath", value: 1)
!535 = !DIEnumerator(name: "RootPath", value: 2)
!536 = !DIEnumerator(name: "HeadPath", value: 3)
!537 = !DIEnumerator(name: "TailPath", value: 4)
!538 = !DIEnumerator(name: "BasePath", value: 5)
!539 = !DIEnumerator(name: "ExtensionPath", value: 6)
!540 = !DIEnumerator(name: "SubimagePath", value: 7)
!541 = !DIEnumerator(name: "CanonicalPath", value: 8)
!542 = !{!543, !544, !546, !599, !606, !608, !610, !612, !614, !890, !751, !553, !823, !812, !740, !672, !1007, !5, !607, !555, !648, !1008, !579, !556, !988, !1009}
!543 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !545, line: 46, baseType: !543)
!545 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !548, line: 7, baseType: !549)
!548 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !550, line: 49, size: 1728, elements: !551)
!550 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!551 = !{!552, !554, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !570, !572, !573, !574, !578, !580, !582, !586, !589, !591, !594, !597, !598, !600, !601, !602}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !549, file: !550, line: 51, baseType: !553, size: 32)
!553 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !549, file: !550, line: 54, baseType: !555, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !549, file: !550, line: 55, baseType: !555, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !549, file: !550, line: 56, baseType: !555, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !549, file: !550, line: 57, baseType: !555, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !549, file: !550, line: 58, baseType: !555, size: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !549, file: !550, line: 59, baseType: !555, size: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !549, file: !550, line: 60, baseType: !555, size: 64, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !549, file: !550, line: 61, baseType: !555, size: 64, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !549, file: !550, line: 64, baseType: !555, size: 64, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !549, file: !550, line: 65, baseType: !555, size: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !549, file: !550, line: 66, baseType: !555, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !549, file: !550, line: 68, baseType: !568, size: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !550, line: 36, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !549, file: !550, line: 70, baseType: !571, size: 64, offset: 832)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !549, file: !550, line: 72, baseType: !553, size: 32, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !549, file: !550, line: 73, baseType: !553, size: 32, offset: 928)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !549, file: !550, line: 74, baseType: !575, size: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !576, line: 152, baseType: !577)
!576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!577 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !549, file: !550, line: 77, baseType: !579, size: 16, offset: 1024)
!579 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !549, file: !550, line: 78, baseType: !581, size: 8, offset: 1040)
!581 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !549, file: !550, line: 79, baseType: !583, size: 8, offset: 1048)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 8, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 1)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !549, file: !550, line: 81, baseType: !587, size: 64, offset: 1088)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !550, line: 43, baseType: null)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !549, file: !550, line: 89, baseType: !590, size: 64, offset: 1152)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !576, line: 153, baseType: !577)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !549, file: !550, line: 91, baseType: !592, size: 64, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !550, line: 37, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !549, file: !550, line: 92, baseType: !595, size: 64, offset: 1280)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !550, line: 38, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !549, file: !550, line: 93, baseType: !571, size: 64, offset: 1344)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !549, file: !550, line: 94, baseType: !599, size: 64, offset: 1408)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !549, file: !550, line: 95, baseType: !544, size: 64, offset: 1472)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !549, file: !550, line: 96, baseType: !553, size: 32, offset: 1536)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !549, file: !550, line: 98, baseType: !603, size: 160, offset: 1568)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 160, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 20)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !611)
!611 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !88, line: 150, size: 105920, elements: !617)
!617 = !{!618, !620, !622, !624, !625, !627, !629, !630, !631, !632, !633, !634, !644, !645, !646, !647, !649, !663, !665, !666, !668, !669, !670, !671, !675, !676, !677, !685, !686, !687, !688, !689, !690, !692, !694, !696, !698, !700, !702, !704, !705, !706, !707, !708, !709, !710, !718, !733, !743, !744, !745, !746, !750, !829, !833, !834, !835, !836, !837, !850, !851, !853, !854, !862, !863, !865, !866, !867, !868, !869, !870, !872, !873, !874, !875, !876, !877, !878, !880, !881, !882, !883, !884, !887, !889}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !616, file: !88, line: 153, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !20)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !616, file: !88, line: 156, baseType: !621, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !26, line: 61, baseType: !25)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !616, file: !88, line: 159, baseType: !623, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !63, line: 49, baseType: !62)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !616, file: !88, line: 162, baseType: !544, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !616, file: !88, line: 165, baseType: !626, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !88, line: 86, baseType: !87)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !616, file: !88, line: 168, baseType: !628, size: 32, offset: 224)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !616, file: !88, line: 169, baseType: !628, size: 32, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !616, file: !88, line: 172, baseType: !544, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !616, file: !88, line: 173, baseType: !544, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !616, file: !88, line: 174, baseType: !544, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !616, file: !88, line: 175, baseType: !544, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !616, file: !88, line: 178, baseType: !635, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !337, line: 148, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !337, line: 131, size: 64, elements: !638)
!638 = !{!639, !641, !642, !643}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !637, file: !337, line: 143, baseType: !640, size: 16)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !579)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !637, file: !337, line: 144, baseType: !640, size: 16, offset: 16)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !637, file: !337, line: 145, baseType: !640, size: 16, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !637, file: !337, line: 146, baseType: !640, size: 16, offset: 48)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !616, file: !88, line: 179, baseType: !636, size: 64, offset: 640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !616, file: !88, line: 180, baseType: !636, size: 64, offset: 704)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !616, file: !88, line: 181, baseType: !636, size: 64, offset: 768)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !616, file: !88, line: 184, baseType: !648, size: 64, offset: 832)
!648 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !616, file: !88, line: 187, baseType: !650, size: 768, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !88, line: 128, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !88, line: 121, size: 768, elements: !652)
!652 = !{!653, !660, !661, !662}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !651, file: !88, line: 124, baseType: !654, size: 192)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !88, line: 101, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !88, line: 95, size: 192, elements: !656)
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !655, file: !88, line: 98, baseType: !648, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !655, file: !88, line: 99, baseType: !648, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !655, file: !88, line: 100, baseType: !648, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !651, file: !88, line: 125, baseType: !654, size: 192, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !651, file: !88, line: 126, baseType: !654, size: 192, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !651, file: !88, line: 127, baseType: !654, size: 192, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !616, file: !88, line: 190, baseType: !664, size: 32, offset: 1664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !100, line: 49, baseType: !99)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !616, file: !88, line: 193, baseType: !599, size: 64, offset: 1728)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !616, file: !88, line: 196, baseType: !667, size: 32, offset: 1792)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !88, line: 93, baseType: !107)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !616, file: !88, line: 199, baseType: !555, size: 64, offset: 1856)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !616, file: !88, line: 200, baseType: !555, size: 64, offset: 1920)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !616, file: !88, line: 201, baseType: !555, size: 64, offset: 1984)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !616, file: !88, line: 204, baseType: !672, size: 64, offset: 2048)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !673, line: 77, baseType: !674)
!673 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !576, line: 193, baseType: !577)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !616, file: !88, line: 207, baseType: !648, size: 64, offset: 2112)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !616, file: !88, line: 208, baseType: !648, size: 64, offset: 2176)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !616, file: !88, line: 211, baseType: !678, size: 256, offset: 2240)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !164, line: 130, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !164, line: 121, size: 256, elements: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !679, file: !164, line: 124, baseType: !544, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !679, file: !164, line: 125, baseType: !544, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !679, file: !164, line: 128, baseType: !672, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !679, file: !164, line: 129, baseType: !672, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !616, file: !88, line: 212, baseType: !678, size: 256, offset: 2496)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !616, file: !88, line: 213, baseType: !678, size: 256, offset: 2752)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !616, file: !88, line: 216, baseType: !648, size: 64, offset: 3008)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !616, file: !88, line: 217, baseType: !648, size: 64, offset: 3072)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !616, file: !88, line: 218, baseType: !648, size: 64, offset: 3136)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !616, file: !88, line: 221, baseType: !691, size: 32, offset: 3200)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !113, line: 66, baseType: !112)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !616, file: !88, line: 224, baseType: !693, size: 32, offset: 3232)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !88, line: 73, baseType: !147)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !616, file: !88, line: 227, baseType: !695, size: 32, offset: 3264)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !158, line: 35, baseType: !157)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !616, file: !88, line: 230, baseType: !697, size: 32, offset: 3296)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !164, line: 91, baseType: !163)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !616, file: !88, line: 233, baseType: !699, size: 32, offset: 3328)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !179, line: 99, baseType: !178)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !616, file: !88, line: 236, baseType: !701, size: 32, offset: 3360)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !250, line: 32, baseType: !249)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !616, file: !88, line: 239, baseType: !703, size: 64, offset: 3392)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !616, file: !88, line: 242, baseType: !544, size: 64, offset: 3456)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !616, file: !88, line: 243, baseType: !544, size: 64, offset: 3520)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !616, file: !88, line: 246, baseType: !672, size: 64, offset: 3584)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !616, file: !88, line: 249, baseType: !544, size: 64, offset: 3648)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !616, file: !88, line: 250, baseType: !544, size: 64, offset: 3712)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !616, file: !88, line: 253, baseType: !672, size: 64, offset: 3776)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !616, file: !88, line: 256, baseType: !711, size: 192, offset: 3840)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !712, line: 68, baseType: !713)
!712 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !712, line: 62, size: 192, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !713, file: !712, line: 65, baseType: !648, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !713, file: !712, line: 66, baseType: !648, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !713, file: !712, line: 67, baseType: !648, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !616, file: !88, line: 259, baseType: !719, size: 512, offset: 4032)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !258, line: 51, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !258, line: 40, size: 512, elements: !721)
!721 = !{!722, !729, !730, !732}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !720, file: !258, line: 43, baseType: !723, size: 192)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !258, line: 38, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !258, line: 32, size: 192, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !724, file: !258, line: 35, baseType: !648, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !724, file: !258, line: 36, baseType: !648, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !724, file: !258, line: 37, baseType: !648, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !720, file: !258, line: 44, baseType: !723, size: 192, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !720, file: !258, line: 47, baseType: !731, size: 32, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !258, line: 30, baseType: !257)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !720, file: !258, line: 50, baseType: !544, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !616, file: !88, line: 262, baseType: !734, size: 64, offset: 4544)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !735, line: 26, baseType: !736)
!735 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!628, !608, !739, !742, !599}
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !741)
!741 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !616, file: !88, line: 265, baseType: !599, size: 64, offset: 4608)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !616, file: !88, line: 266, baseType: !599, size: 64, offset: 4672)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !616, file: !88, line: 267, baseType: !599, size: 64, offset: 4736)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !616, file: !88, line: 270, baseType: !747, size: 64, offset: 4800)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !63, line: 52, baseType: !749)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !63, line: 51, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !616, file: !88, line: 273, baseType: !751, size: 64, offset: 4864)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !754, line: 108, size: 2176, elements: !755)
!754 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0f9f386409cae931efa8c56a790f8a58")
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !769, !774, !811, !820, !821, !822, !827, !828}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !753, file: !754, line: 111, baseType: !544, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !753, file: !754, line: 112, baseType: !544, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !753, file: !754, line: 113, baseType: !544, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !753, file: !754, line: 116, baseType: !628, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !753, file: !754, line: 117, baseType: !628, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !753, file: !754, line: 120, baseType: !740, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !753, file: !754, line: 123, baseType: !610, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !753, file: !754, line: 126, baseType: !628, size: 32, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !753, file: !754, line: 127, baseType: !628, size: 32, offset: 416)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !753, file: !754, line: 128, baseType: !628, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !753, file: !754, line: 129, baseType: !628, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !753, file: !754, line: 132, baseType: !768, size: 32, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamType", file: !10, line: 56, baseType: !9)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "file_info", scope: !753, file: !754, line: 135, baseType: !770, size: 64, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileInfo", file: !754, line: 106, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "FileInfo", file: !754, line: 92, size: 64, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !771, file: !754, line: 95, baseType: !546, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !753, file: !754, line: 138, baseType: !775, size: 1152, offset: 640)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !776, line: 46, size: 1152, elements: !777)
!776 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "f8d5b541c4f89219f8e8ff8c3e2940d9")
!777 = !{!778, !780, !782, !784, !786, !788, !790, !791, !792, !793, !795, !797, !805, !806, !807}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !775, file: !776, line: 48, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !576, line: 145, baseType: !543)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !775, file: !776, line: 53, baseType: !781, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !576, line: 148, baseType: !543)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !775, file: !776, line: 61, baseType: !783, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !576, line: 151, baseType: !543)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !775, file: !776, line: 62, baseType: !785, size: 32, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !576, line: 150, baseType: !5)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !775, file: !776, line: 64, baseType: !787, size: 32, offset: 224)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !576, line: 146, baseType: !5)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !775, file: !776, line: 65, baseType: !789, size: 32, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !576, line: 147, baseType: !5)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !775, file: !776, line: 67, baseType: !553, size: 32, offset: 288)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !775, file: !776, line: 69, baseType: !779, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !775, file: !776, line: 74, baseType: !575, size: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !775, file: !776, line: 78, baseType: !794, size: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !576, line: 174, baseType: !577)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !775, file: !776, line: 80, baseType: !796, size: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !576, line: 179, baseType: !577)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !775, file: !776, line: 91, baseType: !798, size: 128, offset: 576)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !799, line: 10, size: 128, elements: !800)
!799 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!800 = !{!801, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !798, file: !799, line: 12, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !576, line: 160, baseType: !577)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !798, file: !799, line: 16, baseType: !804, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !576, line: 196, baseType: !577)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !775, file: !776, line: 92, baseType: !798, size: 128, offset: 704)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !775, file: !776, line: 93, baseType: !798, size: 128, offset: 832)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !775, file: !776, line: 106, baseType: !808, size: 192, offset: 960)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 192, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 3)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !753, file: !754, line: 141, baseType: !812, size: 64, offset: 1792)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !813, line: 26, baseType: !814)
!813 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!544, !817, !612, !819}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !753, file: !754, line: 144, baseType: !606, size: 64, offset: 1856)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !753, file: !754, line: 147, baseType: !628, size: 32, offset: 1920)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !753, file: !754, line: 150, baseType: !823, size: 64, offset: 1984)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !825, line: 26, baseType: !826)
!825 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !825, line: 25, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !753, file: !754, line: 153, baseType: !672, size: 64, offset: 2048)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !753, file: !754, line: 156, baseType: !544, size: 64, offset: 2112)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !616, file: !88, line: 276, baseType: !830, size: 32768, offset: 4928)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 32768, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 4096)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !616, file: !88, line: 277, baseType: !830, size: 32768, offset: 37696)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !616, file: !88, line: 278, baseType: !830, size: 32768, offset: 70464)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !616, file: !88, line: 281, baseType: !544, size: 64, offset: 103232)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !616, file: !88, line: 282, baseType: !544, size: 64, offset: 103296)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !616, file: !88, line: 285, baseType: !838, size: 448, offset: 103360)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !264, line: 102, size: 448, elements: !840)
!840 = !{!841, !843, !844, !845, !846, !847, !848, !849}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !839, file: !264, line: 105, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !264, line: 100, baseType: !263)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !839, file: !264, line: 108, baseType: !553, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !839, file: !264, line: 111, baseType: !555, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !839, file: !264, line: 112, baseType: !555, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !839, file: !264, line: 115, baseType: !599, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !839, file: !264, line: 118, baseType: !628, size: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !839, file: !264, line: 121, baseType: !823, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !839, file: !264, line: 124, baseType: !544, size: 64, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !616, file: !88, line: 288, baseType: !628, size: 32, offset: 103808)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !616, file: !88, line: 291, baseType: !852, size: 64, offset: 103872)
!852 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !672)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !616, file: !88, line: 294, baseType: !823, size: 64, offset: 103936)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !616, file: !88, line: 297, baseType: !855, size: 256, offset: 104000)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !100, line: 40, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !100, line: 27, size: 256, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !856, file: !100, line: 30, baseType: !555, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !856, file: !100, line: 33, baseType: !544, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !856, file: !100, line: 36, baseType: !606, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !856, file: !100, line: 39, baseType: !544, size: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !616, file: !88, line: 298, baseType: !855, size: 256, offset: 104256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !616, file: !88, line: 299, baseType: !864, size: 64, offset: 104512)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !616, file: !88, line: 302, baseType: !544, size: 64, offset: 104576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !616, file: !88, line: 305, baseType: !544, size: 64, offset: 104640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !616, file: !88, line: 308, baseType: !703, size: 64, offset: 104704)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !616, file: !88, line: 309, baseType: !703, size: 64, offset: 104768)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !616, file: !88, line: 310, baseType: !703, size: 64, offset: 104832)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !616, file: !88, line: 313, baseType: !871, size: 32, offset: 104896)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !337, line: 47, baseType: !336)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !616, file: !88, line: 316, baseType: !628, size: 32, offset: 104928)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !616, file: !88, line: 319, baseType: !636, size: 64, offset: 104960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !616, file: !88, line: 322, baseType: !703, size: 64, offset: 105024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !616, file: !88, line: 325, baseType: !678, size: 256, offset: 105088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !616, file: !88, line: 328, baseType: !599, size: 64, offset: 105344)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !616, file: !88, line: 329, baseType: !599, size: 64, offset: 105408)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !616, file: !88, line: 332, baseType: !879, size: 32, offset: 105472)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !88, line: 61, baseType: !353)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !616, file: !88, line: 335, baseType: !628, size: 32, offset: 105504)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !616, file: !88, line: 338, baseType: !610, size: 64, offset: 105536)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !616, file: !88, line: 341, baseType: !628, size: 32, offset: 105600)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !616, file: !88, line: 344, baseType: !544, size: 64, offset: 105664)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !616, file: !88, line: 347, baseType: !885, size: 64, offset: 105728)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !886, line: 7, baseType: !802)
!886 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!887 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !616, file: !88, line: 350, baseType: !888, size: 32, offset: 105792)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !337, line: 79, baseType: !367)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !616, file: !88, line: 353, baseType: !544, size: 64, offset: 105856)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !481, line: 103, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !481, line: 51, size: 1216, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900, !970, !978, !983, !990, !991, !992, !993, !994, !995, !996, !998, !1000, !1001, !1003, !1004, !1005, !1006}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !893, file: !481, line: 54, baseType: !555, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !893, file: !481, line: 55, baseType: !555, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !893, file: !481, line: 56, baseType: !555, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !893, file: !481, line: 57, baseType: !555, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !893, file: !481, line: 58, baseType: !555, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !893, file: !481, line: 61, baseType: !901, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !88, line: 356, size: 134336, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !939, !940, !941, !942, !943, !944, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !967, !968, !969}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !903, file: !88, line: 359, baseType: !623, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !903, file: !88, line: 362, baseType: !626, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !903, file: !88, line: 365, baseType: !628, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !903, file: !88, line: 366, baseType: !628, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !903, file: !88, line: 367, baseType: !628, size: 32, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !903, file: !88, line: 368, baseType: !628, size: 32, offset: 160)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !903, file: !88, line: 371, baseType: !555, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !903, file: !88, line: 372, baseType: !555, size: 64, offset: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !903, file: !88, line: 373, baseType: !555, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !903, file: !88, line: 374, baseType: !555, size: 64, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !903, file: !88, line: 377, baseType: !544, size: 64, offset: 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !903, file: !88, line: 378, baseType: !544, size: 64, offset: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !903, file: !88, line: 379, baseType: !544, size: 64, offset: 576)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !903, file: !88, line: 382, baseType: !693, size: 32, offset: 640)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !903, file: !88, line: 385, baseType: !695, size: 32, offset: 672)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !903, file: !88, line: 388, baseType: !667, size: 32, offset: 704)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !903, file: !88, line: 391, baseType: !544, size: 64, offset: 768)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !903, file: !88, line: 394, baseType: !555, size: 64, offset: 832)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !903, file: !88, line: 395, baseType: !555, size: 64, offset: 896)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !903, file: !88, line: 396, baseType: !555, size: 64, offset: 960)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !903, file: !88, line: 397, baseType: !555, size: 64, offset: 1024)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !903, file: !88, line: 398, baseType: !555, size: 64, offset: 1088)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !903, file: !88, line: 401, baseType: !648, size: 64, offset: 1152)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !903, file: !88, line: 402, baseType: !648, size: 64, offset: 1216)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !903, file: !88, line: 405, baseType: !636, size: 64, offset: 1280)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !903, file: !88, line: 406, baseType: !636, size: 64, offset: 1344)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !903, file: !88, line: 407, baseType: !636, size: 64, offset: 1408)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !903, file: !88, line: 410, baseType: !628, size: 32, offset: 1472)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !903, file: !88, line: 411, baseType: !628, size: 32, offset: 1504)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !903, file: !88, line: 414, baseType: !544, size: 64, offset: 1536)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !903, file: !88, line: 417, baseType: !621, size: 32, offset: 1600)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !903, file: !88, line: 420, baseType: !879, size: 32, offset: 1632)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !903, file: !88, line: 423, baseType: !938, size: 32, offset: 1664)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !405, line: 59, baseType: !404)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !903, file: !88, line: 426, baseType: !672, size: 64, offset: 1728)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !903, file: !88, line: 429, baseType: !628, size: 32, offset: 1792)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !903, file: !88, line: 430, baseType: !628, size: 32, offset: 1824)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !903, file: !88, line: 433, baseType: !555, size: 64, offset: 1856)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !903, file: !88, line: 434, baseType: !555, size: 64, offset: 1920)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !903, file: !88, line: 437, baseType: !945, size: 32, offset: 1984)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !437)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !903, file: !88, line: 440, baseType: !614, size: 64, offset: 2048)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !903, file: !88, line: 443, baseType: !599, size: 64, offset: 2112)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !903, file: !88, line: 446, baseType: !734, size: 64, offset: 2176)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !903, file: !88, line: 449, baseType: !599, size: 64, offset: 2240)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !903, file: !88, line: 450, baseType: !599, size: 64, offset: 2304)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !903, file: !88, line: 453, baseType: !812, size: 64, offset: 2368)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !903, file: !88, line: 456, baseType: !546, size: 64, offset: 2432)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !903, file: !88, line: 459, baseType: !599, size: 64, offset: 2496)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !903, file: !88, line: 462, baseType: !544, size: 64, offset: 2560)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !903, file: !88, line: 465, baseType: !830, size: 32768, offset: 2624)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !903, file: !88, line: 466, baseType: !830, size: 32768, offset: 35392)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !903, file: !88, line: 467, baseType: !830, size: 32768, offset: 68160)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !903, file: !88, line: 468, baseType: !830, size: 32768, offset: 100928)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !903, file: !88, line: 471, baseType: !628, size: 32, offset: 133696)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !903, file: !88, line: 474, baseType: !555, size: 64, offset: 133760)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !903, file: !88, line: 477, baseType: !544, size: 64, offset: 133824)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !903, file: !88, line: 478, baseType: !544, size: 64, offset: 133888)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !903, file: !88, line: 481, baseType: !636, size: 64, offset: 133952)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !903, file: !88, line: 484, baseType: !544, size: 64, offset: 134016)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !903, file: !88, line: 487, baseType: !966, size: 32, offset: 134080)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !460, line: 47, baseType: !459)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !903, file: !88, line: 490, baseType: !636, size: 64, offset: 134112)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !903, file: !88, line: 493, baseType: !599, size: 64, offset: 134208)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !903, file: !88, line: 496, baseType: !628, size: 32, offset: 134272)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !893, file: !481, line: 64, baseType: !971, size: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !481, line: 43, baseType: !973)
!973 = !DISubroutineType(types: !974)
!974 = !{!614, !975, !977}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !893, file: !481, line: 67, baseType: !979, size: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !481, line: 46, baseType: !981)
!981 = !DISubroutineType(types: !982)
!982 = !{!628, !975, !614}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !893, file: !481, line: 70, baseType: !984, size: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !481, line: 49, baseType: !986)
!986 = !DISubroutineType(types: !987)
!987 = !{!628, !988, !819}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !893, file: !481, line: 73, baseType: !599, size: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !893, file: !481, line: 76, baseType: !628, size: 32, offset: 640)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !893, file: !481, line: 77, baseType: !628, size: 32, offset: 672)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !893, file: !481, line: 78, baseType: !628, size: 32, offset: 704)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !893, file: !481, line: 79, baseType: !628, size: 32, offset: 736)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !893, file: !481, line: 80, baseType: !628, size: 32, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !893, file: !481, line: 83, baseType: !997, size: 32, offset: 800)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !481, line: 33, baseType: !480)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !893, file: !481, line: 86, baseType: !999, size: 32, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !893, file: !481, line: 89, baseType: !628, size: 32, offset: 864)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !893, file: !481, line: 92, baseType: !1002, size: 64, offset: 896)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !893, file: !481, line: 93, baseType: !1002, size: 64, offset: 960)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !893, file: !481, line: 96, baseType: !544, size: 64, offset: 1024)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !893, file: !481, line: 99, baseType: !555, size: 64, offset: 1088)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !893, file: !481, line: 102, baseType: !823, size: 64, offset: 1152)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !673, line: 63, baseType: !575)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!1010 = !{i32 7, !"Dwarf Version", i32 5}
!1011 = !{i32 2, !"Debug Info Version", i32 3}
!1012 = !{i32 1, !"wchar_size", i32 4}
!1013 = !{i32 7, !"PIC Level", i32 2}
!1014 = !{i32 7, !"PIE Level", i32 2}
!1015 = !{i32 7, !"uwtable", i32 2}
!1016 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1017 = distinct !DISubprogram(name: "AttachBlob", scope: !754, file: !754, line: 192, type: !1018, scopeLine: 194, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1020)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !751, !612, !819}
!1020 = !{!1021, !1022, !1023}
!1021 = !DILocalVariable(name: "blob_info", arg: 1, scope: !1017, file: !754, line: 192, type: !751)
!1022 = !DILocalVariable(name: "blob", arg: 2, scope: !1017, file: !754, line: 192, type: !612)
!1023 = !DILocalVariable(name: "length", arg: 3, scope: !1017, file: !754, line: 193, type: !819)
!1024 = !DILocation(line: 0, scope: !1017)
!1025 = !DILocation(line: 196, column: 18, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1017, file: !754, line: 196, column: 7)
!1027 = !{!1028, !1030, i64 240}
!1028 = !{!"_BlobInfo", !1029, i64 0, !1029, i64 8, !1029, i64 16, !1030, i64 24, !1030, i64 28, !1032, i64 32, !1032, i64 40, !1030, i64 48, !1030, i64 52, !1030, i64 56, !1030, i64 60, !1030, i64 64, !1030, i64 72, !1033, i64 80, !1036, i64 224, !1036, i64 232, !1030, i64 240, !1036, i64 248, !1029, i64 256, !1029, i64 264}
!1029 = !{!"long", !1030, i64 0}
!1030 = !{!"omnipotent char", !1031, i64 0}
!1031 = !{!"Simple C/C++ TBAA"}
!1032 = !{!"long long", !1030, i64 0}
!1033 = !{!"stat", !1029, i64 0, !1029, i64 8, !1029, i64 16, !1034, i64 24, !1034, i64 28, !1034, i64 32, !1034, i64 36, !1029, i64 40, !1029, i64 48, !1029, i64 56, !1029, i64 64, !1035, i64 72, !1035, i64 88, !1035, i64 104, !1030, i64 120}
!1034 = !{!"int", !1030, i64 0}
!1035 = !{!"timespec", !1029, i64 0, !1029, i64 8}
!1036 = !{!"any pointer", !1030, i64 0}
!1037 = !DILocation(line: 196, column: 24, scope: !1026)
!1038 = !DILocation(line: 196, column: 7, scope: !1017)
!1039 = !DILocation(line: 197, column: 12, scope: !1026)
!1040 = !DILocation(line: 197, column: 5, scope: !1026)
!1041 = !DILocation(line: 198, column: 20, scope: !1017)
!1042 = !{!1028, !1029, i64 0}
!1043 = !DILocation(line: 199, column: 14, scope: !1017)
!1044 = !DILocation(line: 199, column: 20, scope: !1017)
!1045 = !{!1028, !1029, i64 8}
!1046 = !DILocation(line: 200, column: 14, scope: !1017)
!1047 = !DILocation(line: 200, column: 21, scope: !1017)
!1048 = !{!1028, !1029, i64 16}
!1049 = !DILocation(line: 201, column: 14, scope: !1017)
!1050 = !DILocation(line: 201, column: 20, scope: !1017)
!1051 = !{!1028, !1032, i64 32}
!1052 = !DILocation(line: 202, column: 14, scope: !1017)
!1053 = !DILocation(line: 202, column: 18, scope: !1017)
!1054 = !{!1028, !1030, i64 64}
!1055 = !DILocation(line: 203, column: 14, scope: !1017)
!1056 = !DILocation(line: 203, column: 28, scope: !1017)
!1057 = !{!1030, !1030, i64 0}
!1058 = !DILocation(line: 204, column: 14, scope: !1017)
!1059 = !DILocation(line: 204, column: 18, scope: !1017)
!1060 = !{!1028, !1036, i64 232}
!1061 = !DILocation(line: 205, column: 14, scope: !1017)
!1062 = !DILocation(line: 205, column: 20, scope: !1017)
!1063 = !{!1028, !1030, i64 24}
!1064 = !DILocation(line: 206, column: 1, scope: !1017)
!1065 = !DISubprogram(name: "LogMagickEvent", scope: !380, file: !380, line: 83, type: !1066, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1070)
