; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/common/block_header_decoder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/block_header_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_block = type { i32, i32, i32, i64, i64, ptr, [64 x i8], ptr, ptr, ptr, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, ptr }

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_block_header_decode(ptr noundef %block, ptr noundef %allocator, ptr noundef %in) local_unnamed_addr #0 !dbg !42 {
entry:
  %in_pos = alloca i64, align 8
  call void @llvm.dbg.value(metadata ptr %block, metadata !121, metadata !DIExpression()), !dbg !143
  call void @llvm.dbg.value(metadata ptr %allocator, metadata !122, metadata !DIExpression()), !dbg !143
  call void @llvm.dbg.value(metadata ptr %in, metadata !123, metadata !DIExpression()), !dbg !143
  call void @llvm.dbg.value(metadata i64 0, metadata !124, metadata !DIExpression()), !dbg !144
  %filters = getelementptr inbounds %struct.lzma_block, ptr %block, i64 0, i32 5
  %0 = load ptr, ptr %filters, align 8, !tbaa !145
  call void @llvm.dbg.value(metadata i64 0, metadata !124, metadata !DIExpression()), !dbg !144
  br label %for.body, !dbg !152


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/block_header_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "fd5977cc73b0a776afe5331d178f422f")
!2 = !{!3, !19, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 27, baseType: !5, size: 32, elements: !21)
!20 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!24 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!25 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !27)
!27 = !{!28}
!28 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!29 = !{!30, !31, !5}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 26, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !34, line: 42, baseType: !5)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!35 = !{i32 7, !"Dwarf Version", i32 5}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 1, !"wchar_size", i32 4}
!38 = !{i32 7, !"PIC Level", i32 2}
!39 = !{i32 7, !"PIE Level", i32 2}
!40 = !{i32 7, !"uwtable", i32 2}
!41 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!42 = distinct !DISubprogram(name: "lzma_block_header_decode", scope: !43, file: !43, line: 34, type: !44, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !120)
!43 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/block_header_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fd5977cc73b0a776afe5331d178f422f")
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !47, !103, !118}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !49, line: 245, baseType: !50)
!49 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/block.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bf8cbafce550217b909c63081e414910")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 30, size: 1664, elements: !51)
!51 = !{!52, !53, !54, !56, !62, !63, !71, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !91, !92, !93, !94, !96, !97, !98, !99, !100, !101, !102}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !50, file: !49, line: 47, baseType: !31, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !50, file: !49, line: 67, baseType: !31, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !50, file: !49, line: 88, baseType: !55, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !20, line: 55, baseType: !19)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !50, file: !49, line: 143, baseType: !57, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !58, line: 63, baseType: !59)
!58 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !32, line: 27, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !34, line: 45, baseType: !61)
!61 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !50, file: !49, line: 167, baseType: !57, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !50, file: !49, line: 195, baseType: !64, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !66, line: 65, baseType: !67)
!66 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 43, size: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !67, file: !66, line: 54, baseType: !57, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !67, file: !66, line: 63, baseType: !30, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !50, file: !49, line: 212, baseType: !72, size: 512, offset: 320)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 512, elements: !76)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !34, line: 38, baseType: !75)
!75 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!76 = !{!77}
!77 = !DISubrange(count: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !50, file: !49, line: 221, baseType: !30, size: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !50, file: !49, line: 222, baseType: !30, size: 64, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !50, file: !49, line: 223, baseType: !30, size: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !50, file: !49, line: 224, baseType: !31, size: 32, offset: 1024)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !50, file: !49, line: 225, baseType: !31, size: 32, offset: 1056)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !50, file: !49, line: 226, baseType: !57, size: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !50, file: !49, line: 227, baseType: !57, size: 64, offset: 1152)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !50, file: !49, line: 228, baseType: !57, size: 64, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !50, file: !49, line: 229, baseType: !57, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !50, file: !49, line: 230, baseType: !57, size: 64, offset: 1344)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !50, file: !49, line: 231, baseType: !57, size: 64, offset: 1408)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !50, file: !49, line: 232, baseType: !90, size: 32, offset: 1472)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !26)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !50, file: !49, line: 233, baseType: !90, size: 32, offset: 1504)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !50, file: !49, line: 234, baseType: !90, size: 32, offset: 1536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !50, file: !49, line: 235, baseType: !90, size: 32, offset: 1568)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !50, file: !49, line: 236, baseType: !95, size: 8, offset: 1600)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !75)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !50, file: !49, line: 237, baseType: !95, size: 8, offset: 1608)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !50, file: !49, line: 238, baseType: !95, size: 8, offset: 1616)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !50, file: !49, line: 239, baseType: !95, size: 8, offset: 1624)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !50, file: !49, line: 240, baseType: !95, size: 8, offset: 1632)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !50, file: !49, line: 241, baseType: !95, size: 8, offset: 1640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !50, file: !49, line: 242, baseType: !95, size: 8, offset: 1648)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !50, file: !49, line: 243, baseType: !95, size: 8, offset: 1656)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !106)
!106 = !{!107, !113, !117}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !105, file: !4, line: 376, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!30, !30, !111, !111}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 46, baseType: !61)
!112 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !105, file: !4, line: 390, baseType: !114, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !30, !30}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !105, file: !4, line: 401, baseType: !30, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!120 = !{!121, !122, !123, !124, !126, !128, !129, !134, !137, !138, !140}
!121 = !DILocalVariable(name: "block", arg: 1, scope: !42, file: !43, line: 34, type: !47)
!122 = !DILocalVariable(name: "allocator", arg: 2, scope: !42, file: !43, line: 35, type: !103)
!123 = !DILocalVariable(name: "in", arg: 3, scope: !42, file: !43, line: 35, type: !118)
!124 = !DILocalVariable(name: "i", scope: !125, file: !43, line: 44, type: !111)
!125 = distinct !DILexicalBlock(scope: !42, file: !43, line: 44, column: 2)
!126 = !DILocalVariable(name: "in_size", scope: !42, file: !43, line: 59, type: !127)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!128 = !DILocalVariable(name: "in_pos", scope: !42, file: !43, line: 70, type: !111)
!129 = !DILocalVariable(name: "ret_", scope: !130, file: !43, line: 74, type: !133)
!130 = distinct !DILexicalBlock(scope: !131, file: !43, line: 74, column: 3)
!131 = distinct !DILexicalBlock(scope: !132, file: !43, line: 73, column: 20)
!132 = distinct !DILexicalBlock(scope: !42, file: !43, line: 73, column: 6)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!134 = !DILocalVariable(name: "ret_", scope: !135, file: !43, line: 87, type: !133)
!135 = distinct !DILexicalBlock(scope: !136, file: !43, line: 87, column: 3)
!136 = distinct !DILexicalBlock(scope: !42, file: !43, line: 86, column: 6)
!137 = !DILocalVariable(name: "filter_count", scope: !42, file: !43, line: 93, type: !127)
!138 = !DILocalVariable(name: "i", scope: !139, file: !43, line: 94, type: !111)
!139 = distinct !DILexicalBlock(scope: !42, file: !43, line: 94, column: 2)
!140 = !DILocalVariable(name: "ret", scope: !141, file: !43, line: 95, type: !133)
!141 = distinct !DILexicalBlock(scope: !142, file: !43, line: 94, column: 44)
!142 = distinct !DILexicalBlock(scope: !139, file: !43, line: 94, column: 2)
!143 = !DILocation(line: 0, scope: !42)
!144 = !DILocation(line: 0, scope: !125)
!145 = !{!146, !151, i64 32}
!146 = !{!"", !147, i64 0, !147, i64 4, !148, i64 8, !150, i64 16, !150, i64 24, !151, i64 32, !148, i64 40, !151, i64 104, !151, i64 112, !151, i64 120, !147, i64 128, !147, i64 132, !150, i64 136, !150, i64 144, !150, i64 152, !150, i64 160, !150, i64 168, !150, i64 176, !148, i64 184, !148, i64 188, !148, i64 192, !148, i64 196, !148, i64 200, !148, i64 201, !148, i64 202, !148, i64 203, !148, i64 204, !148, i64 205, !148, i64 206, !148, i64 207}
!147 = !{!"int", !148, i64 0}
!148 = !{!"omnipotent char", !149, i64 0}
!149 = !{!"Simple C/C++ TBAA"}
!150 = !{!"long", !148, i64 0}
!151 = !{!"any pointer", !148, i64 0}
!152 = !DILocation(line: 44, column: 2, scope: !125)
!153 = !DILocation(line: 50, column: 17, scope: !42)
!154 = !{!146, !147, i64 0}
!155 = !DILocation(line: 54, column: 6, scope: !156)
!156 = distinct !DILexicalBlock(scope: !42, file: !43, line: 54, column: 6)
!157 = !{!148, !148, i64 0}
!158 = !DILocation(line: 54, column: 53, scope: !156)
!159 = !{!146, !147, i64 4}
!160 = !DILocation(line: 54, column: 43, scope: !156)
!161 = !DILocation(line: 55, column: 4, scope: !156)
!162 = !DILocation(line: 45, column: 3, scope: !163)
!163 = distinct !DILexicalBlock(scope: !164, file: !43, line: 44, column: 49)
!164 = distinct !DILexicalBlock(scope: !125, file: !43, line: 44, column: 2)
!165 = !DILocation(line: 45, column: 24, scope: !163)
!166 = !{!167, !150, i64 0}
!167 = !{!"", !150, i64 0, !151, i64 8}
!168 = !DILocation(line: 46, column: 21, scope: !163)
!169 = !DILocation(line: 46, column: 29, scope: !163)
!170 = !{!167, !151, i64 8}
!171 = !DILocation(line: 44, column: 44, scope: !164)
!172 = !DILocation(line: 44, column: 23, scope: !164)
!173 = distinct !{!173, !152, !174, !175, !176}
!174 = !DILocation(line: 47, column: 2, scope: !125)
