; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/common/cabac.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/cabac.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_cabac_t = type { i32, i32, i32, i32, ptr, ptr, ptr, [8 x i8], i32, [460 x i8] }
%struct.x264_t = type { %struct.x264_param_t, [129 x ptr], i32, i32, i32, i32, i32, %struct.anon.2, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [92 x ptr], [92 x [4 x ptr]], ptr, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, ptr, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], ptr, [2 x [3 x ptr]], [2 x ptr], [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], ptr, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, ptr, [8 x i8] }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !14, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/cabac.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "81e922f79a78663e77ecb0915f9a62f5")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "slice_type_e", file: !6, line: 280, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "SLICE_TYPE_P", value: 0)
!10 = !DIEnumerator(name: "SLICE_TYPE_B", value: 1)
!11 = !DIEnumerator(name: "SLICE_TYPE_I", value: 2)
!12 = !DIEnumerator(name: "SLICE_TYPE_SP", value: 3)
!13 = !DIEnumerator(name: "SLICE_TYPE_SI", value: 4)
!14 = !{!0, !15, !28, !33, !41, !51}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "x264_cabac_transition", scope: !2, file: !17, line: 687, type: !18, isLocal: false, isDefinition: true)
!17 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81e922f79a78663e77ecb0915f9a62f5")
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, elements: !25)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !21, line: 24, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !23, line: 38, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !{!26, !27}
!26 = !DISubrange(count: 128)
!27 = !DISubrange(count: 2)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "x264_cabac_renorm_shift", scope: !2, file: !17, line: 707, type: !30, isLocal: false, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 512, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 64)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "x264_cabac_entropy", scope: !2, file: !17, line: 715, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !40)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !21, line: 25, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 40, baseType: !39)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !{!26}
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "x264_cabac_context_init_I", scope: !2, file: !17, line: 27, type: !43, isLocal: true, isDefinition: true)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 7360, elements: !49)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !46, line: 24, baseType: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !23, line: 37, baseType: !48)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !{!50, !27}
!50 = !DISubrange(count: 460)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "x264_cabac_context_init_PB", scope: !2, file: !17, line: 196, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 22080, elements: !54)
!54 = !{!55, !50, !27}
!55 = !DISubrange(count: 3)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, elements: !57)
!57 = !{!32, !58}
!58 = !DISubrange(count: 4)
!59 = !{i32 7, !"Dwarf Version", i32 5}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 4}
!62 = !{i32 7, !"PIC Level", i32 2}
!63 = !{i32 7, !"PIE Level", i32 2}
!64 = !{i32 7, !"uwtable", i32 2}
!65 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!66 = distinct !DISubprogram(name: "x264_cabac_context_init", scope: !17, file: !17, line: 755, type: !67, scopeLine: 756, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !87)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69, !75, !75, !75}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 27, size: 4096, elements: !73)
!73 = !{!74, !76, !77, !78, !79, !81, !82, !83, !84}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !72, file: !71, line: 30, baseType: !75, size: 32)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !72, file: !71, line: 31, baseType: !75, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !72, file: !71, line: 34, baseType: !75, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !72, file: !71, line: 35, baseType: !75, size: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !72, file: !71, line: 37, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !72, file: !71, line: 38, baseType: !80, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !72, file: !71, line: 39, baseType: !80, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !72, file: !71, line: 42, baseType: !75, size: 32, align: 128, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !72, file: !71, line: 45, baseType: !85, size: 3680, offset: 416)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 3680, elements: !86)
!86 = !{!50}
!87 = !{!88, !89, !90, !91, !92, !94, !96}
!88 = !DILocalVariable(name: "cb", arg: 1, scope: !66, file: !17, line: 755, type: !69)
!89 = !DILocalVariable(name: "i_slice_type", arg: 2, scope: !66, file: !17, line: 755, type: !75)
!90 = !DILocalVariable(name: "i_qp", arg: 3, scope: !66, file: !17, line: 755, type: !75)
!91 = !DILocalVariable(name: "i_model", arg: 4, scope: !66, file: !17, line: 755, type: !75)
!92 = !DILocalVariable(name: "cabac_context_init", scope: !66, file: !17, line: 757, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!94 = !DILocalVariable(name: "i", scope: !95, file: !17, line: 764, type: !75)
!95 = distinct !DILexicalBlock(scope: !66, file: !17, line: 764, column: 5)
!96 = !DILocalVariable(name: "state", scope: !97, file: !17, line: 766, type: !75)
!97 = distinct !DILexicalBlock(scope: !98, file: !17, line: 765, column: 5)
!98 = distinct !DILexicalBlock(scope: !95, file: !17, line: 764, column: 5)
!99 = !DILocation(line: 0, scope: !66)
!100 = !DILocation(line: 759, column: 22, scope: !101)
!101 = distinct !DILexicalBlock(scope: !66, file: !17, line: 759, column: 9)
!102 = !DILocation(line: 759, column: 9, scope: !66)
!103 = !DILocation(line: 762, column: 31, scope: !101)
!104 = !DILocation(line: 0, scope: !101)
!105 = !DILocation(line: 0, scope: !95)
!106 = !DILocation(line: 764, column: 5, scope: !95)
!107 = !DILocation(line: 769, column: 1, scope: !66)
!108 = !DILocation(line: 766, column: 35, scope: !97)
!109 = !{!110, !110, i64 0}
!110 = !{!"omnipotent char", !111, i64 0}
!111 = !{!"Simple C/C++ TBAA"}
!112 = !DILocation(line: 766, column: 63, scope: !97)
!113 = !DILocation(line: 766, column: 71, scope: !97)
!114 = !DILocation(line: 766, column: 79, scope: !97)
!115 = !DILocation(line: 766, column: 77, scope: !97)
!116 = !DILocalVariable(name: "v", arg: 1, scope: !117, file: !6, line: 200, type: !75)
!117 = distinct !DISubprogram(name: "x264_clip3", scope: !6, file: !6, line: 200, type: !118, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !120)
!118 = !DISubroutineType(types: !119)
!119 = !{!75, !75, !75, !75}
!120 = !{!116, !121, !122}
!121 = !DILocalVariable(name: "i_min", arg: 2, scope: !117, file: !6, line: 200, type: !75)
!122 = !DILocalVariable(name: "i_max", arg: 3, scope: !117, file: !6, line: 200, type: !75)
!123 = !DILocation(line: 0, scope: !117, inlinedAt: !124)
!124 = distinct !DILocation(line: 766, column: 21, scope: !97)
!125 = !DILocation(line: 202, column: 17, scope: !117, inlinedAt: !124)
!126 = !DILocation(line: 202, column: 14, scope: !117, inlinedAt: !124)
!127 = !DILocation(line: 0, scope: !97)
!128 = !DILocation(line: 767, column: 25, scope: !97)
!129 = !DILocation(line: 767, column: 54, scope: !97)
!130 = !DILocation(line: 767, column: 69, scope: !97)
!131 = !DILocation(line: 767, column: 60, scope: !97)
!132 = !DILocation(line: 767, column: 24, scope: !97)
!133 = !DILocation(line: 767, column: 9, scope: !97)
!134 = !DILocation(line: 767, column: 22, scope: !97)
!135 = !DILocation(line: 764, column: 31, scope: !98)
!136 = !DILocation(line: 764, column: 23, scope: !98)
!137 = distinct !{!137, !106, !138, !139, !140}
!138 = !DILocation(line: 768, column: 5, scope: !95)
!139 = !{!"llvm.loop.mustprogress"}
!140 = !{!"llvm.loop.unroll.disable"}
!141 = distinct !DISubprogram(name: "x264_cabac_encode_init_core", scope: !17, file: !17, line: 771, type: !142, scopeLine: 772, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !69}
!144 = !{!145}
!145 = !DILocalVariable(name: "cb", arg: 1, scope: !141, file: !17, line: 771, type: !69)
!146 = !DILocation(line: 0, scope: !141)
!147 = !DILocation(line: 773, column: 17, scope: !141)
!148 = !{!149, !150, i64 0}
!149 = !{!"", !150, i64 0, !150, i64 4, !150, i64 8, !150, i64 12, !151, i64 16, !151, i64 24, !151, i64 32, !150, i64 48, !110, i64 52}
!150 = !{!"int", !110, i64 0}
!151 = !{!"any pointer", !110, i64 0}
!152 = !DILocation(line: 774, column: 9, scope: !141)
!153 = !DILocation(line: 774, column: 17, scope: !141)
!154 = !{!149, !150, i64 4}
!155 = !DILocation(line: 775, column: 9, scope: !141)
!156 = !DILocation(line: 775, column: 17, scope: !141)
!157 = !{!149, !150, i64 8}
!158 = !DILocation(line: 776, column: 9, scope: !141)
!159 = !DILocation(line: 776, column: 29, scope: !141)
!160 = !{!149, !150, i64 12}
!161 = !DILocation(line: 777, column: 1, scope: !141)
!162 = distinct !DISubprogram(name: "x264_cabac_encode_init", scope: !17, file: !17, line: 779, type: !163, scopeLine: 780, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !69, !80, !80}
!165 = !{!166, !167, !168}
!166 = !DILocalVariable(name: "cb", arg: 1, scope: !162, file: !17, line: 779, type: !69)
!167 = !DILocalVariable(name: "p_data", arg: 2, scope: !162, file: !17, line: 779, type: !80)
!168 = !DILocalVariable(name: "p_end", arg: 3, scope: !162, file: !17, line: 779, type: !80)
!169 = !DILocation(line: 0, scope: !162)
!170 = !DILocation(line: 0, scope: !141, inlinedAt: !171)
!171 = distinct !DILocation(line: 781, column: 5, scope: !162)
!172 = !DILocation(line: 773, column: 17, scope: !141, inlinedAt: !171)
!173 = !DILocation(line: 774, column: 9, scope: !141, inlinedAt: !171)
!174 = !DILocation(line: 774, column: 17, scope: !141, inlinedAt: !171)
!175 = !DILocation(line: 775, column: 9, scope: !141, inlinedAt: !171)
!176 = !DILocation(line: 775, column: 17, scope: !141, inlinedAt: !171)
!177 = !DILocation(line: 776, column: 9, scope: !141, inlinedAt: !171)
!178 = !DILocation(line: 776, column: 29, scope: !141, inlinedAt: !171)
!179 = !DILocation(line: 782, column: 9, scope: !162)
!180 = !DILocation(line: 782, column: 17, scope: !162)
!181 = !{!149, !151, i64 16}
!182 = !DILocation(line: 783, column: 9, scope: !162)
!183 = !DILocation(line: 783, column: 17, scope: !162)
!184 = !{!149, !151, i64 24}
!185 = !DILocation(line: 784, column: 9, scope: !162)
!186 = !DILocation(line: 784, column: 17, scope: !162)
!187 = !{!149, !151, i64 32}
!188 = !DILocation(line: 785, column: 1, scope: !162)
!189 = distinct !DISubprogram(name: "x264_cabac_encode_decision_c", scope: !17, file: !17, line: 831, type: !190, scopeLine: 832, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !69, !75, !75}
!192 = !{!193, !194, !195, !196, !197}
!193 = !DILocalVariable(name: "cb", arg: 1, scope: !189, file: !17, line: 831, type: !69)
!194 = !DILocalVariable(name: "i_ctx", arg: 2, scope: !189, file: !17, line: 831, type: !75)
!195 = !DILocalVariable(name: "b", arg: 3, scope: !189, file: !17, line: 831, type: !75)
!196 = !DILocalVariable(name: "i_state", scope: !189, file: !17, line: 833, type: !75)
!197 = !DILocalVariable(name: "i_range_lps", scope: !189, file: !17, line: 834, type: !75)
!198 = !DILocation(line: 0, scope: !189)
!199 = !DILocation(line: 833, column: 19, scope: !189)
!200 = !DILocation(line: 834, column: 51, scope: !189)
!201 = !DILocation(line: 834, column: 61, scope: !189)
!202 = !DILocation(line: 834, column: 68, scope: !189)
!203 = !DILocation(line: 834, column: 72, scope: !189)
!204 = !DILocation(line: 834, column: 23, scope: !189)
!205 = !DILocation(line: 835, column: 17, scope: !189)
!206 = !DILocation(line: 836, column: 23, scope: !207)
!207 = distinct !DILexicalBlock(scope: !189, file: !17, line: 836, column: 9)
!208 = !DILocation(line: 836, column: 11, scope: !207)
!209 = !DILocation(line: 836, column: 9, scope: !189)
!210 = !DILocation(line: 838, column: 19, scope: !211)
!211 = distinct !DILexicalBlock(scope: !207, file: !17, line: 837, column: 5)
!212 = !DILocation(line: 839, column: 21, scope: !211)
!213 = !DILocation(line: 840, column: 5, scope: !211)
!214 = !DILocation(line: 841, column: 24, scope: !189)
!215 = !DILocation(line: 841, column: 22, scope: !189)
!216 = !DILocalVariable(name: "cb", arg: 1, scope: !217, file: !17, line: 819, type: !69)
!217 = distinct !DISubprogram(name: "x264_cabac_encode_renorm", scope: !17, file: !17, line: 819, type: !142, scopeLine: 820, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !218)
!218 = !{!216, !219}
!219 = !DILocalVariable(name: "shift", scope: !217, file: !17, line: 821, type: !75)
!220 = !DILocation(line: 0, scope: !217, inlinedAt: !221)
!221 = distinct !DILocation(line: 842, column: 5, scope: !189)
!222 = !DILocation(line: 821, column: 45, scope: !217, inlinedAt: !221)
!223 = !DILocation(line: 821, column: 52, scope: !217, inlinedAt: !221)
!224 = !DILocation(line: 821, column: 17, scope: !217, inlinedAt: !221)
!225 = !DILocation(line: 822, column: 17, scope: !217, inlinedAt: !221)
!226 = !DILocation(line: 823, column: 17, scope: !217, inlinedAt: !221)
!227 = !DILocation(line: 824, column: 9, scope: !217, inlinedAt: !221)
!228 = !DILocation(line: 824, column: 18, scope: !217, inlinedAt: !221)
!229 = !DILocalVariable(name: "cb", arg: 1, scope: !230, file: !17, line: 787, type: !69)
!230 = distinct !DISubprogram(name: "x264_cabac_putbyte", scope: !17, file: !17, line: 787, type: !142, scopeLine: 788, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !231)
!231 = !{!229, !232, !235, !238}
!232 = !DILocalVariable(name: "out", scope: !233, file: !17, line: 791, type: !75)
!233 = distinct !DILexicalBlock(scope: !234, file: !17, line: 790, column: 5)
!234 = distinct !DILexicalBlock(scope: !230, file: !17, line: 789, column: 9)
!235 = !DILocalVariable(name: "carry", scope: !236, file: !17, line: 799, type: !75)
!236 = distinct !DILexicalBlock(scope: !237, file: !17, line: 798, column: 9)
!237 = distinct !DILexicalBlock(scope: !233, file: !17, line: 795, column: 13)
!238 = !DILocalVariable(name: "bytes_outstanding", scope: !236, file: !17, line: 800, type: !75)
!239 = !DILocation(line: 0, scope: !230, inlinedAt: !240)
!240 = distinct !DILocation(line: 825, column: 5, scope: !217, inlinedAt: !221)
!241 = !DILocation(line: 789, column: 21, scope: !234, inlinedAt: !240)
!242 = !DILocation(line: 789, column: 9, scope: !230, inlinedAt: !240)
!243 = !DILocation(line: 791, column: 44, scope: !233, inlinedAt: !240)
!244 = !DILocation(line: 791, column: 29, scope: !233, inlinedAt: !240)
!245 = !DILocation(line: 0, scope: !233, inlinedAt: !240)
!246 = !DILocation(line: 792, column: 28, scope: !233, inlinedAt: !240)
!247 = !DILocation(line: 792, column: 42, scope: !233, inlinedAt: !240)
!248 = !DILocation(line: 792, column: 19, scope: !233, inlinedAt: !240)
!249 = !DILocation(line: 793, column: 21, scope: !233, inlinedAt: !240)
!250 = !DILocation(line: 795, column: 18, scope: !237, inlinedAt: !240)
!251 = !DILocation(line: 795, column: 26, scope: !237, inlinedAt: !240)
!252 = !DILocation(line: 795, column: 13, scope: !233, inlinedAt: !240)
!253 = !DILocation(line: 796, column: 17, scope: !237, inlinedAt: !240)
!254 = !DILocation(line: 796, column: 36, scope: !237, inlinedAt: !240)
!255 = !DILocation(line: 796, column: 13, scope: !237, inlinedAt: !240)
!256 = !DILocation(line: 799, column: 29, scope: !236, inlinedAt: !240)
!257 = !DILocation(line: 0, scope: !236, inlinedAt: !240)
!258 = !DILocation(line: 800, column: 41, scope: !236, inlinedAt: !240)
!259 = !DILocation(line: 807, column: 17, scope: !236, inlinedAt: !240)
!260 = !DILocation(line: 807, column: 13, scope: !236, inlinedAt: !240)
!261 = !DILocation(line: 807, column: 23, scope: !236, inlinedAt: !240)
!262 = !DILocation(line: 808, column: 38, scope: !236, inlinedAt: !240)
!263 = !DILocation(line: 808, column: 13, scope: !236, inlinedAt: !240)
!264 = !DILocation(line: 810, column: 24, scope: !265, inlinedAt: !240)
!265 = distinct !DILexicalBlock(scope: !236, file: !17, line: 809, column: 13)
!266 = !DILocation(line: 810, column: 28, scope: !265, inlinedAt: !240)
!267 = !DILocation(line: 811, column: 34, scope: !265, inlinedAt: !240)
!268 = distinct !{!268, !263, !269, !139, !140}
!269 = !DILocation(line: 812, column: 13, scope: !236, inlinedAt: !240)
!270 = !DILocation(line: 813, column: 26, scope: !236, inlinedAt: !240)
!271 = !DILocation(line: 813, column: 20, scope: !236, inlinedAt: !240)
!272 = !DILocation(line: 813, column: 24, scope: !236, inlinedAt: !240)
!273 = !DILocation(line: 814, column: 37, scope: !236, inlinedAt: !240)
!274 = !DILocation(line: 843, column: 1, scope: !189)
!275 = distinct !DISubprogram(name: "x264_cabac_encode_bypass_c", scope: !17, file: !17, line: 845, type: !276, scopeLine: 846, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !278)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !69, !75}
!278 = !{!279, !280}
!279 = !DILocalVariable(name: "cb", arg: 1, scope: !275, file: !17, line: 845, type: !69)
!280 = !DILocalVariable(name: "b", arg: 2, scope: !275, file: !17, line: 845, type: !75)
!281 = !DILocation(line: 0, scope: !275)
!282 = !DILocation(line: 847, column: 15, scope: !275)
!283 = !DILocation(line: 848, column: 18, scope: !275)
!284 = !DILocation(line: 848, column: 27, scope: !275)
!285 = !DILocation(line: 848, column: 21, scope: !275)
!286 = !DILocation(line: 848, column: 15, scope: !275)
!287 = !DILocation(line: 849, column: 9, scope: !275)
!288 = !DILocation(line: 849, column: 17, scope: !275)
!289 = !DILocation(line: 0, scope: !230, inlinedAt: !290)
!290 = distinct !DILocation(line: 850, column: 5, scope: !275)
!291 = !DILocation(line: 789, column: 21, scope: !234, inlinedAt: !290)
!292 = !DILocation(line: 789, column: 9, scope: !230, inlinedAt: !290)
!293 = !DILocation(line: 791, column: 44, scope: !233, inlinedAt: !290)
!294 = !DILocation(line: 791, column: 29, scope: !233, inlinedAt: !290)
!295 = !DILocation(line: 0, scope: !233, inlinedAt: !290)
!296 = !DILocation(line: 792, column: 28, scope: !233, inlinedAt: !290)
!297 = !DILocation(line: 792, column: 42, scope: !233, inlinedAt: !290)
!298 = !DILocation(line: 792, column: 19, scope: !233, inlinedAt: !290)
!299 = !DILocation(line: 793, column: 21, scope: !233, inlinedAt: !290)
!300 = !DILocation(line: 795, column: 18, scope: !237, inlinedAt: !290)
!301 = !DILocation(line: 795, column: 26, scope: !237, inlinedAt: !290)
!302 = !DILocation(line: 795, column: 13, scope: !233, inlinedAt: !290)
!303 = !DILocation(line: 796, column: 17, scope: !237, inlinedAt: !290)
!304 = !DILocation(line: 796, column: 36, scope: !237, inlinedAt: !290)
!305 = !DILocation(line: 796, column: 13, scope: !237, inlinedAt: !290)
!306 = !DILocation(line: 799, column: 29, scope: !236, inlinedAt: !290)
!307 = !DILocation(line: 0, scope: !236, inlinedAt: !290)
!308 = !DILocation(line: 800, column: 41, scope: !236, inlinedAt: !290)
!309 = !DILocation(line: 807, column: 17, scope: !236, inlinedAt: !290)
!310 = !DILocation(line: 807, column: 13, scope: !236, inlinedAt: !290)
!311 = !DILocation(line: 807, column: 23, scope: !236, inlinedAt: !290)
!312 = !DILocation(line: 808, column: 38, scope: !236, inlinedAt: !290)
!313 = !DILocation(line: 808, column: 13, scope: !236, inlinedAt: !290)
!314 = !DILocation(line: 810, column: 24, scope: !265, inlinedAt: !290)
!315 = !DILocation(line: 810, column: 28, scope: !265, inlinedAt: !290)
!316 = !DILocation(line: 811, column: 34, scope: !265, inlinedAt: !290)
!317 = distinct !{!317, !313, !318, !139, !140}
!318 = !DILocation(line: 812, column: 13, scope: !236, inlinedAt: !290)
!319 = !DILocation(line: 813, column: 26, scope: !236, inlinedAt: !290)
!320 = !DILocation(line: 813, column: 20, scope: !236, inlinedAt: !290)
!321 = !DILocation(line: 813, column: 24, scope: !236, inlinedAt: !290)
!322 = !DILocation(line: 814, column: 37, scope: !236, inlinedAt: !290)
!323 = !DILocation(line: 851, column: 1, scope: !275)
!324 = distinct !DISubprogram(name: "x264_cabac_encode_ue_bypass", scope: !17, file: !17, line: 853, type: !190, scopeLine: 854, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !325)
!325 = !{!326, !327, !328, !329, !330, !331}
!326 = !DILocalVariable(name: "cb", arg: 1, scope: !324, file: !17, line: 853, type: !69)
!327 = !DILocalVariable(name: "exp_bits", arg: 2, scope: !324, file: !17, line: 853, type: !75)
!328 = !DILocalVariable(name: "val", arg: 3, scope: !324, file: !17, line: 853, type: !75)
!329 = !DILocalVariable(name: "k", scope: !324, file: !17, line: 855, type: !75)
!330 = !DILocalVariable(name: "i", scope: !324, file: !17, line: 855, type: !75)
!331 = !DILocalVariable(name: "x", scope: !324, file: !17, line: 858, type: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !21, line: 26, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !23, line: 42, baseType: !7)
!334 = !DILocation(line: 0, scope: !324)
!335 = !DILocation(line: 856, column: 33, scope: !336)
!336 = distinct !DILexicalBlock(scope: !337, file: !17, line: 856, column: 5)
!337 = distinct !DILexicalBlock(scope: !324, file: !17, line: 856, column: 5)
!338 = !DILocation(line: 856, column: 28, scope: !336)
!339 = !DILocation(line: 856, column: 5, scope: !337)
!340 = !DILocation(line: 857, column: 13, scope: !336)
!341 = !DILocation(line: 856, column: 40, scope: !336)
!342 = distinct !{!342, !339, !343, !139, !140}
!343 = !DILocation(line: 857, column: 19, scope: !337)
!344 = !DILocation(line: 0, scope: !337)
!345 = !DILocation(line: 858, column: 26, scope: !324)
!346 = !DILocation(line: 858, column: 37, scope: !324)
!347 = !DILocation(line: 858, column: 44, scope: !324)
!348 = !DILocation(line: 858, column: 40, scope: !324)
!349 = !DILocation(line: 858, column: 48, scope: !324)
!350 = !DILocation(line: 859, column: 10, scope: !324)
!351 = !DILocation(line: 859, column: 12, scope: !324)
!352 = !DILocation(line: 859, column: 14, scope: !324)
!353 = !DILocation(line: 860, column: 12, scope: !324)
!354 = !DILocation(line: 860, column: 15, scope: !324)
!355 = !DILocation(line: 860, column: 18, scope: !324)
!356 = !DILocation(line: 863, column: 19, scope: !357)
!357 = distinct !DILexicalBlock(scope: !324, file: !17, line: 861, column: 8)
!358 = !DILocation(line: 861, column: 5, scope: !324)
!359 = !DILocation(line: 862, column: 11, scope: !357)
!360 = !DILocation(line: 864, column: 25, scope: !357)
!361 = !DILocation(line: 864, column: 29, scope: !357)
!362 = !DILocation(line: 864, column: 42, scope: !357)
!363 = !DILocation(line: 864, column: 36, scope: !357)
!364 = !DILocation(line: 864, column: 19, scope: !357)
!365 = !DILocation(line: 865, column: 21, scope: !357)
!366 = !DILocation(line: 0, scope: !230, inlinedAt: !367)
!367 = distinct !DILocation(line: 866, column: 9, scope: !357)
!368 = !DILocation(line: 789, column: 21, scope: !234, inlinedAt: !367)
!369 = !DILocation(line: 789, column: 9, scope: !230, inlinedAt: !367)
!370 = !DILocation(line: 791, column: 44, scope: !233, inlinedAt: !367)
!371 = !DILocation(line: 791, column: 29, scope: !233, inlinedAt: !367)
!372 = !DILocation(line: 0, scope: !233, inlinedAt: !367)
!373 = !DILocation(line: 792, column: 28, scope: !233, inlinedAt: !367)
!374 = !DILocation(line: 792, column: 42, scope: !233, inlinedAt: !367)
!375 = !DILocation(line: 792, column: 19, scope: !233, inlinedAt: !367)
!376 = !DILocation(line: 793, column: 21, scope: !233, inlinedAt: !367)
!377 = !DILocation(line: 795, column: 18, scope: !237, inlinedAt: !367)
!378 = !DILocation(line: 795, column: 26, scope: !237, inlinedAt: !367)
!379 = !DILocation(line: 795, column: 13, scope: !233, inlinedAt: !367)
!380 = !DILocation(line: 796, column: 36, scope: !237, inlinedAt: !367)
!381 = !DILocation(line: 796, column: 13, scope: !237, inlinedAt: !367)
!382 = !DILocation(line: 799, column: 29, scope: !236, inlinedAt: !367)
!383 = !DILocation(line: 0, scope: !236, inlinedAt: !367)
!384 = !DILocation(line: 800, column: 41, scope: !236, inlinedAt: !367)
!385 = !DILocation(line: 807, column: 17, scope: !236, inlinedAt: !367)
!386 = !DILocation(line: 807, column: 13, scope: !236, inlinedAt: !367)
!387 = !DILocation(line: 807, column: 23, scope: !236, inlinedAt: !367)
!388 = !DILocation(line: 808, column: 38, scope: !236, inlinedAt: !367)
!389 = !DILocation(line: 808, column: 13, scope: !236, inlinedAt: !367)
!390 = !DILocation(line: 810, column: 24, scope: !265, inlinedAt: !367)
!391 = !DILocation(line: 810, column: 28, scope: !265, inlinedAt: !367)
!392 = !DILocation(line: 811, column: 34, scope: !265, inlinedAt: !367)
!393 = distinct !{!393, !389, !394, !139, !140}
!394 = !DILocation(line: 812, column: 13, scope: !236, inlinedAt: !367)
!395 = !DILocation(line: 813, column: 26, scope: !236, inlinedAt: !367)
!396 = !DILocation(line: 813, column: 20, scope: !236, inlinedAt: !367)
!397 = !DILocation(line: 813, column: 24, scope: !236, inlinedAt: !367)
!398 = !DILocation(line: 814, column: 37, scope: !236, inlinedAt: !367)
!399 = !DILocation(line: 868, column: 16, scope: !324)
!400 = !DILocation(line: 868, column: 5, scope: !357)
!401 = distinct !{!401, !358, !402, !139, !140}
!402 = !DILocation(line: 868, column: 20, scope: !324)
!403 = !DILocation(line: 869, column: 1, scope: !324)
!404 = distinct !DISubprogram(name: "x264_cabac_encode_terminal_c", scope: !17, file: !17, line: 871, type: !142, scopeLine: 872, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !405)
!405 = !{!406}
!406 = !DILocalVariable(name: "cb", arg: 1, scope: !404, file: !17, line: 871, type: !69)
!407 = !DILocation(line: 0, scope: !404)
!408 = !DILocation(line: 873, column: 9, scope: !404)
!409 = !DILocation(line: 873, column: 17, scope: !404)
!410 = !DILocation(line: 0, scope: !217, inlinedAt: !411)
!411 = distinct !DILocation(line: 874, column: 5, scope: !404)
!412 = !DILocation(line: 821, column: 52, scope: !217, inlinedAt: !411)
!413 = !DILocation(line: 821, column: 17, scope: !217, inlinedAt: !411)
!414 = !DILocation(line: 822, column: 17, scope: !217, inlinedAt: !411)
!415 = !DILocation(line: 823, column: 17, scope: !217, inlinedAt: !411)
!416 = !DILocation(line: 824, column: 9, scope: !217, inlinedAt: !411)
!417 = !DILocation(line: 824, column: 18, scope: !217, inlinedAt: !411)
!418 = !DILocation(line: 0, scope: !230, inlinedAt: !419)
!419 = distinct !DILocation(line: 825, column: 5, scope: !217, inlinedAt: !411)
!420 = !DILocation(line: 789, column: 21, scope: !234, inlinedAt: !419)
!421 = !DILocation(line: 789, column: 9, scope: !230, inlinedAt: !419)
!422 = !DILocation(line: 791, column: 44, scope: !233, inlinedAt: !419)
!423 = !DILocation(line: 791, column: 29, scope: !233, inlinedAt: !419)
!424 = !DILocation(line: 0, scope: !233, inlinedAt: !419)
!425 = !DILocation(line: 792, column: 28, scope: !233, inlinedAt: !419)
!426 = !DILocation(line: 792, column: 42, scope: !233, inlinedAt: !419)
!427 = !DILocation(line: 792, column: 19, scope: !233, inlinedAt: !419)
!428 = !DILocation(line: 793, column: 21, scope: !233, inlinedAt: !419)
!429 = !DILocation(line: 795, column: 18, scope: !237, inlinedAt: !419)
!430 = !DILocation(line: 795, column: 26, scope: !237, inlinedAt: !419)
!431 = !DILocation(line: 795, column: 13, scope: !233, inlinedAt: !419)
!432 = !DILocation(line: 796, column: 17, scope: !237, inlinedAt: !419)
!433 = !DILocation(line: 796, column: 36, scope: !237, inlinedAt: !419)
!434 = !DILocation(line: 796, column: 13, scope: !237, inlinedAt: !419)
!435 = !DILocation(line: 799, column: 29, scope: !236, inlinedAt: !419)
!436 = !DILocation(line: 0, scope: !236, inlinedAt: !419)
!437 = !DILocation(line: 800, column: 41, scope: !236, inlinedAt: !419)
!438 = !DILocation(line: 807, column: 17, scope: !236, inlinedAt: !419)
!439 = !DILocation(line: 807, column: 13, scope: !236, inlinedAt: !419)
!440 = !DILocation(line: 807, column: 23, scope: !236, inlinedAt: !419)
!441 = !DILocation(line: 808, column: 38, scope: !236, inlinedAt: !419)
!442 = !DILocation(line: 808, column: 13, scope: !236, inlinedAt: !419)
!443 = !DILocation(line: 810, column: 24, scope: !265, inlinedAt: !419)
!444 = !DILocation(line: 810, column: 28, scope: !265, inlinedAt: !419)
!445 = !DILocation(line: 811, column: 34, scope: !265, inlinedAt: !419)
!446 = distinct !{!446, !442, !447, !139, !140}
!447 = !DILocation(line: 812, column: 13, scope: !236, inlinedAt: !419)
!448 = !DILocation(line: 813, column: 26, scope: !236, inlinedAt: !419)
!449 = !DILocation(line: 813, column: 20, scope: !236, inlinedAt: !419)
!450 = !DILocation(line: 813, column: 24, scope: !236, inlinedAt: !419)
!451 = !DILocation(line: 814, column: 37, scope: !236, inlinedAt: !419)
!452 = !DILocation(line: 875, column: 1, scope: !404)
!453 = distinct !DISubprogram(name: "x264_cabac_encode_flush", scope: !17, file: !17, line: 877, type: !454, scopeLine: 878, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1733)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !456, !69}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !458, line: 46, baseType: !459)
!458 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !6, line: 381, size: 266752, elements: !460)
!460 = !{!461, !629, !633, !634, !635, !636, !637, !638, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !773, !775, !802, !804, !805, !806, !811, !815, !816, !817, !821, !825, !826, !827, !832, !835, !836, !913, !914, !1075, !1076, !1077, !1078, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1103, !1297, !1301, !1362, !1365, !1367, !1369, !1370, !1373, !1378, !1387, !1388, !1396, !1398, !1403, !1479, !1565, !1609, !1631, !1680, !1709}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !459, file: !6, line: 384, baseType: !462, size: 5632)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !458, line: 376, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !458, line: 176, size: 5632, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !508, !512, !513, !514, !515, !517, !518, !533, !534, !535, !536, !537, !567, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !463, file: !458, line: 179, baseType: !7, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !463, file: !458, line: 180, baseType: !75, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !463, file: !458, line: 181, baseType: !75, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !463, file: !458, line: 182, baseType: !75, size: 32, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !463, file: !458, line: 183, baseType: !75, size: 32, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !463, file: !458, line: 186, baseType: !75, size: 32, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !463, file: !458, line: 187, baseType: !75, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !463, file: !458, line: 188, baseType: !75, size: 32, offset: 224)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !463, file: !458, line: 189, baseType: !75, size: 32, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !463, file: !458, line: 190, baseType: !75, size: 32, offset: 288)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !463, file: !458, line: 198, baseType: !75, size: 32, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !463, file: !458, line: 215, baseType: !477, size: 288, offset: 352)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !458, line: 200, size: 288, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486, !487}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !477, file: !458, line: 203, baseType: !75, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !477, file: !458, line: 204, baseType: !75, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !477, file: !458, line: 206, baseType: !75, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !477, file: !458, line: 209, baseType: !75, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !477, file: !458, line: 210, baseType: !75, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !477, file: !458, line: 211, baseType: !75, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !477, file: !458, line: 212, baseType: !75, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !477, file: !458, line: 213, baseType: !75, size: 32, offset: 224)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !477, file: !458, line: 214, baseType: !75, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !463, file: !458, line: 218, baseType: !75, size: 32, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !463, file: !458, line: 219, baseType: !75, size: 32, offset: 672)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !463, file: !458, line: 220, baseType: !75, size: 32, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !463, file: !458, line: 221, baseType: !75, size: 32, offset: 736)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !463, file: !458, line: 222, baseType: !75, size: 32, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !463, file: !458, line: 224, baseType: !75, size: 32, offset: 800)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !463, file: !458, line: 225, baseType: !75, size: 32, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !463, file: !458, line: 226, baseType: !75, size: 32, offset: 864)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !463, file: !458, line: 227, baseType: !75, size: 32, offset: 896)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !463, file: !458, line: 229, baseType: !75, size: 32, offset: 928)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !463, file: !458, line: 230, baseType: !75, size: 32, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !463, file: !458, line: 231, baseType: !75, size: 32, offset: 992)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !463, file: !458, line: 233, baseType: !75, size: 32, offset: 1024)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !463, file: !458, line: 234, baseType: !75, size: 32, offset: 1056)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !463, file: !458, line: 236, baseType: !75, size: 32, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !463, file: !458, line: 237, baseType: !75, size: 32, offset: 1120)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !463, file: !458, line: 239, baseType: !75, size: 32, offset: 1152)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !463, file: !458, line: 240, baseType: !506, size: 64, offset: 1216)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !463, file: !458, line: 241, baseType: !509, size: 128, offset: 1280)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 16)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !463, file: !458, line: 242, baseType: !509, size: 128, offset: 1408)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !463, file: !458, line: 243, baseType: !509, size: 128, offset: 1536)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !463, file: !458, line: 244, baseType: !509, size: 128, offset: 1664)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !463, file: !458, line: 245, baseType: !516, size: 512, offset: 1792)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, elements: !31)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !463, file: !458, line: 246, baseType: !516, size: 512, offset: 2304)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !463, file: !458, line: 249, baseType: !519, size: 64, offset: 2816)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !522, !75, !523, !525}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !527)
!527 = !{!528, !530, !531, !532}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !526, file: !529, line: 875, baseType: !7, size: 32)
!529 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !526, file: !529, line: 875, baseType: !7, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !526, file: !529, line: 875, baseType: !522, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !526, file: !529, line: 875, baseType: !522, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !463, file: !458, line: 250, baseType: !522, size: 64, offset: 2880)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !463, file: !458, line: 251, baseType: !75, size: 32, offset: 2944)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !463, file: !458, line: 252, baseType: !75, size: 32, offset: 2976)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !463, file: !458, line: 253, baseType: !506, size: 64, offset: 3008)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !463, file: !458, line: 287, baseType: !538, size: 800, offset: 3072)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !458, line: 256, size: 800, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !560, !561, !562, !565, !566}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !538, file: !458, line: 258, baseType: !7, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !538, file: !458, line: 259, baseType: !7, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !538, file: !458, line: 261, baseType: !75, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !538, file: !458, line: 262, baseType: !75, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !538, file: !458, line: 263, baseType: !75, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !538, file: !458, line: 264, baseType: !75, size: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !538, file: !458, line: 265, baseType: !75, size: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !538, file: !458, line: 267, baseType: !75, size: 32, offset: 224)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !538, file: !458, line: 268, baseType: !75, size: 32, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !538, file: !458, line: 269, baseType: !75, size: 32, offset: 288)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !538, file: !458, line: 270, baseType: !75, size: 32, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !538, file: !458, line: 271, baseType: !75, size: 32, offset: 352)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !538, file: !458, line: 272, baseType: !75, size: 32, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !538, file: !458, line: 273, baseType: !75, size: 32, offset: 416)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !538, file: !458, line: 274, baseType: !75, size: 32, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !538, file: !458, line: 275, baseType: !75, size: 32, offset: 480)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !538, file: !458, line: 276, baseType: !75, size: 32, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !538, file: !458, line: 277, baseType: !75, size: 32, offset: 544)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !538, file: !458, line: 278, baseType: !559, size: 32, offset: 576)
!559 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !538, file: !458, line: 279, baseType: !559, size: 32, offset: 608)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !538, file: !458, line: 280, baseType: !75, size: 32, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !538, file: !458, line: 283, baseType: !563, size: 64, offset: 672)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !564)
!564 = !{!27}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !538, file: !458, line: 285, baseType: !75, size: 32, offset: 736)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !538, file: !458, line: 286, baseType: !75, size: 32, offset: 768)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !463, file: !458, line: 327, baseType: !568, size: 1152, offset: 3904)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !458, line: 290, size: 1152, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !607, !608}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !568, file: !458, line: 292, baseType: !75, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !568, file: !458, line: 294, baseType: !75, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !568, file: !458, line: 295, baseType: !75, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !568, file: !458, line: 296, baseType: !75, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !568, file: !458, line: 297, baseType: !75, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !568, file: !458, line: 299, baseType: !75, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !568, file: !458, line: 300, baseType: !559, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !568, file: !458, line: 301, baseType: !559, size: 32, offset: 224)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !568, file: !458, line: 302, baseType: !559, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !568, file: !458, line: 303, baseType: !75, size: 32, offset: 288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !568, file: !458, line: 304, baseType: !75, size: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !568, file: !458, line: 305, baseType: !559, size: 32, offset: 352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !568, file: !458, line: 306, baseType: !559, size: 32, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !568, file: !458, line: 307, baseType: !559, size: 32, offset: 416)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !568, file: !458, line: 309, baseType: !75, size: 32, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !568, file: !458, line: 310, baseType: !559, size: 32, offset: 480)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !568, file: !458, line: 311, baseType: !75, size: 32, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !568, file: !458, line: 312, baseType: !75, size: 32, offset: 544)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !568, file: !458, line: 315, baseType: !75, size: 32, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !568, file: !458, line: 316, baseType: !506, size: 64, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !568, file: !458, line: 317, baseType: !75, size: 32, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !568, file: !458, line: 318, baseType: !506, size: 64, offset: 768)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !568, file: !458, line: 321, baseType: !559, size: 32, offset: 832)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !568, file: !458, line: 322, baseType: !559, size: 32, offset: 864)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !568, file: !458, line: 323, baseType: !559, size: 32, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !568, file: !458, line: 324, baseType: !596, size: 64, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !458, line: 174, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 167, size: 256, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !598, file: !458, line: 169, baseType: !75, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !598, file: !458, line: 169, baseType: !75, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !598, file: !458, line: 170, baseType: !75, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !598, file: !458, line: 171, baseType: !75, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !598, file: !458, line: 172, baseType: !559, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !598, file: !458, line: 173, baseType: !606, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !568, file: !458, line: 325, baseType: !75, size: 32, offset: 1024)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !568, file: !458, line: 326, baseType: !506, size: 64, offset: 1088)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !463, file: !458, line: 330, baseType: !75, size: 32, offset: 5056)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !463, file: !458, line: 331, baseType: !75, size: 32, offset: 5088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !463, file: !458, line: 332, baseType: !75, size: 32, offset: 5120)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !463, file: !458, line: 334, baseType: !75, size: 32, offset: 5152)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !463, file: !458, line: 335, baseType: !75, size: 32, offset: 5184)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !463, file: !458, line: 336, baseType: !332, size: 32, offset: 5216)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !463, file: !458, line: 337, baseType: !332, size: 32, offset: 5248)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !463, file: !458, line: 338, baseType: !332, size: 32, offset: 5280)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !463, file: !458, line: 339, baseType: !332, size: 32, offset: 5312)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !463, file: !458, line: 340, baseType: !75, size: 32, offset: 5344)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !463, file: !458, line: 344, baseType: !75, size: 32, offset: 5376)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !463, file: !458, line: 356, baseType: !75, size: 32, offset: 5408)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !463, file: !458, line: 364, baseType: !75, size: 32, offset: 5440)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !463, file: !458, line: 367, baseType: !75, size: 32, offset: 5472)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !463, file: !458, line: 368, baseType: !75, size: 32, offset: 5504)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !463, file: !458, line: 369, baseType: !75, size: 32, offset: 5536)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !463, file: !458, line: 375, baseType: !626, size: 64, offset: 5568)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !522}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !459, file: !6, line: 386, baseType: !630, size: 8256, offset: 5632)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 8256, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 129)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !459, file: !6, line: 387, baseType: !75, size: 32, offset: 13888)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !459, file: !6, line: 388, baseType: !75, size: 32, offset: 13920)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !459, file: !6, line: 389, baseType: !75, size: 32, offset: 13952)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !459, file: !6, line: 390, baseType: !75, size: 32, offset: 13984)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !459, file: !6, line: 391, baseType: !75, size: 32, offset: 14016)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !459, file: !6, line: 402, baseType: !639, size: 576, offset: 14080)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !6, line: 394, size: 576, elements: !640)
!640 = !{!641, !642, !643, !652, !653, !654}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !639, file: !6, line: 396, baseType: !75, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !639, file: !6, line: 397, baseType: !75, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !639, file: !6, line: 398, baseType: !644, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !458, line: 604, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 593, size: 192, elements: !647)
!647 = !{!648, !649, !650, !651}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !646, file: !458, line: 595, baseType: !75, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !646, file: !458, line: 596, baseType: !75, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !646, file: !458, line: 599, baseType: !75, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !646, file: !458, line: 603, baseType: !80, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !639, file: !6, line: 399, baseType: !75, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !639, file: !6, line: 400, baseType: !80, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !639, file: !6, line: 401, baseType: !655, size: 320, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !656, line: 56, baseType: !657)
!656 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !656, line: 47, size: 320, elements: !658)
!658 = !{!659, !660, !661, !662, !666, !667}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !657, file: !656, line: 49, baseType: !80, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !657, file: !656, line: 50, baseType: !80, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !657, file: !656, line: 51, baseType: !80, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !657, file: !656, line: 53, baseType: !663, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !664, line: 87, baseType: !665)
!664 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!665 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !657, file: !656, line: 54, baseType: !75, size: 32, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !657, file: !656, line: 55, baseType: !75, size: 32, offset: 288)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !459, file: !6, line: 404, baseType: !80, size: 64, offset: 14656)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !459, file: !6, line: 405, baseType: !75, size: 32, offset: 14720)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !459, file: !6, line: 410, baseType: !75, size: 32, offset: 14752)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !459, file: !6, line: 411, baseType: !75, size: 32, offset: 14784)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !459, file: !6, line: 413, baseType: !75, size: 32, offset: 14816)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !459, file: !6, line: 415, baseType: !75, size: 32, offset: 14848)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !459, file: !6, line: 416, baseType: !75, size: 32, offset: 14880)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !459, file: !6, line: 418, baseType: !75, size: 32, offset: 14912)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !459, file: !6, line: 419, baseType: !75, size: 32, offset: 14944)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !459, file: !6, line: 420, baseType: !75, size: 32, offset: 14976)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !459, file: !6, line: 421, baseType: !75, size: 32, offset: 15008)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !459, file: !6, line: 422, baseType: !75, size: 32, offset: 15040)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !459, file: !6, line: 424, baseType: !75, size: 32, offset: 15072)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !459, file: !6, line: 425, baseType: !75, size: 32, offset: 15104)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !459, file: !6, line: 427, baseType: !75, size: 32, offset: 15136)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !459, file: !6, line: 430, baseType: !684, size: 10400, offset: 15168)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 10400, elements: !771)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !686, line: 154, baseType: !687)
!686 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !686, line: 52, size: 10400, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !706, !707, !708, !709, !710, !711, !712, !713, !714, !721, !722, !770}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !687, file: !686, line: 54, baseType: !75, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !687, file: !686, line: 56, baseType: !75, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !687, file: !686, line: 57, baseType: !75, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !687, file: !686, line: 59, baseType: !75, size: 32, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !687, file: !686, line: 60, baseType: !75, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !687, file: !686, line: 61, baseType: !75, size: 32, offset: 160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !687, file: !686, line: 63, baseType: !75, size: 32, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !687, file: !686, line: 65, baseType: !75, size: 32, offset: 224)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !687, file: !686, line: 67, baseType: !75, size: 32, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !687, file: !686, line: 69, baseType: !75, size: 32, offset: 288)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !687, file: !686, line: 70, baseType: !75, size: 32, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !687, file: !686, line: 71, baseType: !75, size: 32, offset: 352)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !687, file: !686, line: 72, baseType: !75, size: 32, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !687, file: !686, line: 73, baseType: !703, size: 8192, offset: 416)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8192, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !687, file: !686, line: 75, baseType: !75, size: 32, offset: 8608)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !687, file: !686, line: 76, baseType: !75, size: 32, offset: 8640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !687, file: !686, line: 77, baseType: !75, size: 32, offset: 8672)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !687, file: !686, line: 78, baseType: !75, size: 32, offset: 8704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !687, file: !686, line: 79, baseType: !75, size: 32, offset: 8736)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !687, file: !686, line: 80, baseType: !75, size: 32, offset: 8768)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !687, file: !686, line: 81, baseType: !75, size: 32, offset: 8800)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !687, file: !686, line: 83, baseType: !75, size: 32, offset: 8832)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !687, file: !686, line: 90, baseType: !715, size: 128, offset: 8864)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !687, file: !686, line: 84, size: 128, elements: !716)
!716 = !{!717, !718, !719, !720}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !715, file: !686, line: 86, baseType: !75, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !715, file: !686, line: 87, baseType: !75, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !715, file: !686, line: 88, baseType: !75, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !715, file: !686, line: 89, baseType: !75, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !687, file: !686, line: 92, baseType: !75, size: 32, offset: 8992)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !687, file: !686, line: 150, baseType: !723, size: 1344, offset: 9024)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !687, file: !686, line: 93, size: 1344, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !723, file: !686, line: 95, baseType: !75, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !723, file: !686, line: 96, baseType: !75, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !723, file: !686, line: 97, baseType: !75, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !723, file: !686, line: 99, baseType: !75, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !723, file: !686, line: 100, baseType: !75, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !723, file: !686, line: 102, baseType: !75, size: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !723, file: !686, line: 103, baseType: !75, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !723, file: !686, line: 104, baseType: !75, size: 32, offset: 224)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !723, file: !686, line: 105, baseType: !75, size: 32, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !723, file: !686, line: 106, baseType: !75, size: 32, offset: 288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !723, file: !686, line: 107, baseType: !75, size: 32, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !723, file: !686, line: 108, baseType: !75, size: 32, offset: 352)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !723, file: !686, line: 110, baseType: !75, size: 32, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !723, file: !686, line: 111, baseType: !75, size: 32, offset: 416)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !723, file: !686, line: 112, baseType: !75, size: 32, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !723, file: !686, line: 114, baseType: !75, size: 32, offset: 480)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !723, file: !686, line: 115, baseType: !332, size: 32, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !723, file: !686, line: 116, baseType: !332, size: 32, offset: 544)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !723, file: !686, line: 117, baseType: !75, size: 32, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !723, file: !686, line: 119, baseType: !75, size: 32, offset: 608)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !723, file: !686, line: 120, baseType: !75, size: 32, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !723, file: !686, line: 137, baseType: !747, size: 384, offset: 672)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !723, file: !686, line: 122, size: 384, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !747, file: !686, line: 124, baseType: !75, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !747, file: !686, line: 125, baseType: !75, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !747, file: !686, line: 126, baseType: !75, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !747, file: !686, line: 127, baseType: !75, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !747, file: !686, line: 128, baseType: !75, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !747, file: !686, line: 129, baseType: !75, size: 32, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !747, file: !686, line: 130, baseType: !75, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !747, file: !686, line: 131, baseType: !75, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !747, file: !686, line: 133, baseType: !75, size: 32, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !747, file: !686, line: 134, baseType: !75, size: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !747, file: !686, line: 135, baseType: !75, size: 32, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !747, file: !686, line: 136, baseType: !75, size: 32, offset: 352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !723, file: !686, line: 139, baseType: !75, size: 32, offset: 1056)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !723, file: !686, line: 140, baseType: !75, size: 32, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !723, file: !686, line: 141, baseType: !75, size: 32, offset: 1120)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !723, file: !686, line: 142, baseType: !75, size: 32, offset: 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !723, file: !686, line: 143, baseType: !75, size: 32, offset: 1184)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !723, file: !686, line: 144, baseType: !75, size: 32, offset: 1216)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !723, file: !686, line: 145, baseType: !75, size: 32, offset: 1248)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !723, file: !686, line: 146, baseType: !75, size: 32, offset: 1280)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !723, file: !686, line: 147, baseType: !75, size: 32, offset: 1312)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !687, file: !686, line: 152, baseType: !75, size: 32, offset: 10368)
!771 = !{!772}
!772 = !DISubrange(count: 1)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !459, file: !6, line: 431, baseType: !774, size: 64, offset: 25600)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !459, file: !6, line: 432, baseType: !776, size: 960, offset: 25664)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 960, elements: !771)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !686, line: 186, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !686, line: 156, size: 960, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !778, file: !686, line: 158, baseType: !75, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !778, file: !686, line: 159, baseType: !75, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !778, file: !686, line: 161, baseType: !75, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !778, file: !686, line: 163, baseType: !75, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !778, file: !686, line: 164, baseType: !75, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !778, file: !686, line: 166, baseType: !75, size: 32, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !778, file: !686, line: 167, baseType: !75, size: 32, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !778, file: !686, line: 169, baseType: !75, size: 32, offset: 224)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !778, file: !686, line: 170, baseType: !75, size: 32, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !778, file: !686, line: 172, baseType: !75, size: 32, offset: 288)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !778, file: !686, line: 173, baseType: !75, size: 32, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !778, file: !686, line: 175, baseType: !75, size: 32, offset: 352)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !778, file: !686, line: 177, baseType: !75, size: 32, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !778, file: !686, line: 178, baseType: !75, size: 32, offset: 416)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !778, file: !686, line: 179, baseType: !75, size: 32, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !778, file: !686, line: 181, baseType: !75, size: 32, offset: 480)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !778, file: !686, line: 183, baseType: !75, size: 32, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !778, file: !686, line: 184, baseType: !798, size: 384, offset: 576)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 384, elements: !800)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!800 = !{!801}
!801 = !DISubrange(count: 6)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !459, file: !6, line: 433, baseType: !803, size: 64, offset: 26624)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !459, file: !6, line: 434, baseType: !75, size: 32, offset: 26688)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !459, file: !6, line: 437, baseType: !75, size: 32, offset: 26720)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !459, file: !6, line: 440, baseType: !807, size: 256, offset: 26752)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 256, elements: !810)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, elements: !510)
!810 = !{!58}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !459, file: !6, line: 441, baseType: !812, size: 128, offset: 27008)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 128, elements: !564)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 2048, elements: !31)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !459, file: !6, line: 443, baseType: !807, size: 256, offset: 27136)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !459, file: !6, line: 444, baseType: !812, size: 128, offset: 27392)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !459, file: !6, line: 446, baseType: !818, size: 256, offset: 27520)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 256, elements: !810)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, elements: !510)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !459, file: !6, line: 447, baseType: !822, size: 128, offset: 27776)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 128, elements: !564)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, elements: !31)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !459, file: !6, line: 448, baseType: !818, size: 256, offset: 27904)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !459, file: !6, line: 449, baseType: !822, size: 128, offset: 28160)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !459, file: !6, line: 454, baseType: !828, size: 5888, offset: 28288)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 5888, elements: !830)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!830 = !{!831}
!831 = !DISubrange(count: 92)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !459, file: !6, line: 455, baseType: !833, size: 23552, offset: 34176)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 23552, elements: !834)
!834 = !{!831, !58}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !459, file: !6, line: 457, baseType: !799, size: 64, offset: 57728)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !459, file: !6, line: 460, baseType: !837, size: 53376, offset: 57856)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !6, line: 364, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 302, size: 53376, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !868, !897, !898, !899, !905, !906, !907, !908, !909, !910, !911, !912}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !838, file: !6, line: 304, baseType: !774, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !838, file: !6, line: 305, baseType: !803, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !838, file: !6, line: 307, baseType: !75, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !838, file: !6, line: 308, baseType: !75, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !838, file: !6, line: 309, baseType: !75, size: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !838, file: !6, line: 311, baseType: !75, size: 32, offset: 224)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !838, file: !6, line: 313, baseType: !75, size: 32, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !838, file: !6, line: 315, baseType: !75, size: 32, offset: 288)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !838, file: !6, line: 316, baseType: !75, size: 32, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !838, file: !6, line: 317, baseType: !75, size: 32, offset: 352)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !838, file: !6, line: 319, baseType: !75, size: 32, offset: 384)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !838, file: !6, line: 321, baseType: !75, size: 32, offset: 416)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !838, file: !6, line: 322, baseType: !75, size: 32, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !838, file: !6, line: 324, baseType: !563, size: 64, offset: 480)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !838, file: !6, line: 325, baseType: !75, size: 32, offset: 544)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !838, file: !6, line: 327, baseType: !75, size: 32, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !838, file: !6, line: 329, baseType: !75, size: 32, offset: 608)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !838, file: !6, line: 330, baseType: !75, size: 32, offset: 640)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !838, file: !6, line: 331, baseType: !75, size: 32, offset: 672)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !838, file: !6, line: 333, baseType: !75, size: 32, offset: 704)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !838, file: !6, line: 334, baseType: !75, size: 32, offset: 736)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !838, file: !6, line: 339, baseType: !862, size: 2048, offset: 768)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 2048, elements: !867)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !838, file: !6, line: 335, size: 64, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !863, file: !6, line: 337, baseType: !75, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !863, file: !6, line: 338, baseType: !75, size: 32, offset: 32)
!867 = !{!27, !511}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !838, file: !6, line: 342, baseType: !869, size: 49152, align: 128, offset: 2816)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 49152, align: 128, elements: !895)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !871, line: 36, baseType: !872, align: 128)
!871 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !871, line: 26, size: 512, elements: !873)
!873 = !{!874, !881, !882, !885, !886, !887}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !872, file: !871, line: 30, baseType: !875, size: 128, align: 128)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 128, elements: !879)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !46, line: 25, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !23, line: 39, baseType: !878)
!878 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!879 = !{!880}
!880 = !DISubrange(count: 8)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !872, file: !871, line: 31, baseType: !875, size: 128, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !872, file: !871, line: 32, baseType: !883, size: 32, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !46, line: 26, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !23, line: 41, baseType: !75)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !872, file: !871, line: 33, baseType: !883, size: 32, offset: 288)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !872, file: !871, line: 34, baseType: !883, size: 32, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !872, file: !871, line: 35, baseType: !888, size: 64, offset: 384)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !871, line: 25, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !80, !75, !80, !75, !893, !75}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!895 = !{!896, !55}
!896 = !DISubrange(count: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !838, file: !6, line: 344, baseType: !75, size: 32, offset: 51968)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !838, file: !6, line: 345, baseType: !75, size: 32, offset: 52000)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !838, file: !6, line: 350, baseType: !900, size: 1024, offset: 52032)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 1024, elements: !510)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !838, file: !6, line: 346, size: 64, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !901, file: !6, line: 348, baseType: !75, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !901, file: !6, line: 349, baseType: !75, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !838, file: !6, line: 352, baseType: !75, size: 32, offset: 53056)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !838, file: !6, line: 354, baseType: !75, size: 32, offset: 53088)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !838, file: !6, line: 355, baseType: !75, size: 32, offset: 53120)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !838, file: !6, line: 356, baseType: !75, size: 32, offset: 53152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !838, file: !6, line: 357, baseType: !75, size: 32, offset: 53184)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !838, file: !6, line: 360, baseType: !75, size: 32, offset: 53216)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !838, file: !6, line: 361, baseType: !75, size: 32, offset: 53248)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !838, file: !6, line: 362, baseType: !75, size: 32, offset: 53280)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !459, file: !6, line: 463, baseType: !70, size: 4096, offset: 111232)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !459, file: !6, line: 494, baseType: !915, size: 2112, offset: 115328)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !6, line: 465, size: 2112, elements: !916)
!916 = !{!917, !1055, !1057, !1058, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1071, !1072, !1073, !1074}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !915, file: !6, line: 468, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !921, line: 146, baseType: !922)
!921 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !921, line: 31, size: 125056, elements: !923)
!923 = !{!924, !925, !926, !927, !930, !931, !932, !933, !934, !935, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !954, !955, !956, !957, !958, !959, !961, !963, !964, !965, !966, !967, !970, !972, !973, !975, !977, !978, !982, !983, !987, !991, !994, !996, !997, !999, !1000, !1002, !1003, !1004, !1007, !1009, !1010, !1011, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1022, !1023, !1027, !1036, !1040, !1042, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !922, file: !921, line: 34, baseType: !75, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !922, file: !921, line: 35, baseType: !75, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !922, file: !921, line: 36, baseType: !75, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !922, file: !921, line: 37, baseType: !928, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !46, line: 27, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 44, baseType: !665)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !922, file: !921, line: 38, baseType: !928, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !922, file: !921, line: 39, baseType: !75, size: 32, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !922, file: !921, line: 40, baseType: !75, size: 32, offset: 288)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !922, file: !921, line: 41, baseType: !75, size: 32, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !922, file: !921, line: 42, baseType: !75, size: 32, offset: 352)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !922, file: !921, line: 43, baseType: !936, size: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !922, file: !921, line: 45, baseType: !75, size: 32, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !922, file: !921, line: 46, baseType: !75, size: 32, offset: 480)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !922, file: !921, line: 47, baseType: !75, size: 32, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !922, file: !921, line: 48, baseType: !75, size: 32, offset: 544)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !922, file: !921, line: 49, baseType: !75, size: 32, offset: 576)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !922, file: !921, line: 50, baseType: !75, size: 32, offset: 608)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !922, file: !921, line: 51, baseType: !75, size: 32, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !922, file: !921, line: 52, baseType: !20, size: 8, offset: 672)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !922, file: !921, line: 53, baseType: !20, size: 8, offset: 680)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !922, file: !921, line: 54, baseType: !20, size: 8, offset: 688)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !922, file: !921, line: 55, baseType: !559, size: 32, offset: 704)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !922, file: !921, line: 56, baseType: !559, size: 32, offset: 736)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !922, file: !921, line: 57, baseType: !75, size: 32, offset: 768)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !922, file: !921, line: 60, baseType: !75, size: 32, offset: 800)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !922, file: !921, line: 61, baseType: !952, size: 96, offset: 832)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 96, elements: !953)
!953 = !{!55}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !922, file: !921, line: 62, baseType: !952, size: 96, offset: 928)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !922, file: !921, line: 63, baseType: !952, size: 96, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !922, file: !921, line: 64, baseType: !75, size: 32, offset: 1120)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !922, file: !921, line: 65, baseType: !75, size: 32, offset: 1152)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !922, file: !921, line: 66, baseType: !75, size: 32, offset: 1184)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !922, file: !921, line: 67, baseType: !960, size: 192, offset: 1216)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 192, elements: !953)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !922, file: !921, line: 68, baseType: !962, size: 256, offset: 1408)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 256, elements: !810)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !922, file: !921, line: 69, baseType: !962, size: 256, offset: 1664)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !922, file: !921, line: 70, baseType: !829, size: 64, offset: 1920)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !922, file: !921, line: 74, baseType: !962, size: 256, offset: 1984)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !922, file: !921, line: 75, baseType: !962, size: 256, offset: 2240)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !922, file: !921, line: 77, baseType: !968, size: 24576, align: 128, offset: 2560)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 24576, align: 128, elements: !969)
!969 = !{!511, !55}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !922, file: !921, line: 78, baseType: !971, size: 1024, offset: 27136)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 1024, elements: !510)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !922, file: !921, line: 79, baseType: !75, size: 32, offset: 28160)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !922, file: !921, line: 80, baseType: !974, size: 64, offset: 28224)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !922, file: !921, line: 83, baseType: !976, size: 64, offset: 28288)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !922, file: !921, line: 84, baseType: !80, size: 64, offset: 28352)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !922, file: !921, line: 85, baseType: !979, size: 128, offset: 28416)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 128, elements: !564)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 32, elements: !564)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !922, file: !921, line: 86, baseType: !980, size: 64, offset: 28544)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !922, file: !921, line: 87, baseType: !984, size: 2176, offset: 28608)
