; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/cache-view.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/cache-view.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }

!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 27, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!371 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!372 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!373 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!374 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!375 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!376 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!377 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!378 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!379 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!380 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!381 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!382 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!383 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!384 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!385 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!386 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!387 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!388 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !390, line: 34, baseType: !5, size: 32, elements: !391)
!390 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!392 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!393 = !DIEnumerator(name: "NoEvents", value: 0)
!394 = !DIEnumerator(name: "TraceEvent", value: 1)
!395 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!396 = !DIEnumerator(name: "BlobEvent", value: 4)
!397 = !DIEnumerator(name: "CacheEvent", value: 8)
!398 = !DIEnumerator(name: "CoderEvent", value: 16)
!399 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!400 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!401 = !DIEnumerator(name: "DrawEvent", value: 128)
!402 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!403 = !DIEnumerator(name: "ImageEvent", value: 512)
!404 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!405 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!406 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!407 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!408 = !DIEnumerator(name: "TransformEvent", value: 16384)
!409 = !DIEnumerator(name: "UserEvent", value: 36864)
!410 = !DIEnumerator(name: "WandEvent", value: 65536)
!411 = !DIEnumerator(name: "X11Event", value: 131072)
!412 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!413 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !415, line: 25, baseType: !5, size: 32, elements: !416)
!415 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425}
!417 = !DIEnumerator(name: "UndefinedResource", value: 0)
!418 = !DIEnumerator(name: "AreaResource", value: 1)
!419 = !DIEnumerator(name: "DiskResource", value: 2)
!420 = !DIEnumerator(name: "FileResource", value: 3)
!421 = !DIEnumerator(name: "MapResource", value: 4)
!422 = !DIEnumerator(name: "MemoryResource", value: 5)
!423 = !DIEnumerator(name: "ThreadResource", value: 6)
!424 = !DIEnumerator(name: "TimeResource", value: 7)
!425 = !DIEnumerator(name: "ThrottleResource", value: 8)
!426 = !{!427, !440, !649, !483, !595, !438, !659, !677}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !430)
!430 = !{!431, !433, !435, !437, !441, !443, !445, !446, !447, !448, !449, !450, !461, !462, !463, !464, !466, !480, !482, !484, !486, !489, !490, !491, !497, !498, !499, !507, !508, !509, !510, !511, !512, !514, !516, !518, !520, !522, !524, !526, !527, !528, !529, !530, !531, !532, !540, !555, !569, !570, !571, !572, !576, !580, !584, !585, !586, !587, !588, !606, !607, !609, !610, !620, !621, !623, !624, !625, !626, !627, !628, !630, !631, !632, !633, !634, !635, !636, !638, !639, !640, !641, !642, !646, !648}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !429, file: !73, line: 153, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !429, file: !73, line: 156, baseType: !434, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !429, file: !73, line: 159, baseType: !436, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !429, file: !73, line: 162, baseType: !438, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !439, line: 46, baseType: !440)
!439 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!440 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !429, file: !73, line: 165, baseType: !442, size: 32, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !429, file: !73, line: 168, baseType: !444, size: 32, offset: 224)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !429, file: !73, line: 169, baseType: !444, size: 32, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !429, file: !73, line: 172, baseType: !438, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !429, file: !73, line: 173, baseType: !438, size: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !429, file: !73, line: 174, baseType: !438, size: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !429, file: !73, line: 175, baseType: !438, size: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !429, file: !73, line: 178, baseType: !451, size: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !454)
!454 = !{!455, !458, !459, !460}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !453, file: !326, line: 143, baseType: !456, size: 16)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !457)
!457 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !453, file: !326, line: 144, baseType: !456, size: 16, offset: 16)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !453, file: !326, line: 145, baseType: !456, size: 16, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !453, file: !326, line: 146, baseType: !456, size: 16, offset: 48)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !429, file: !73, line: 179, baseType: !452, size: 64, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !429, file: !73, line: 180, baseType: !452, size: 64, offset: 704)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !429, file: !73, line: 181, baseType: !452, size: 64, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !429, file: !73, line: 184, baseType: !465, size: 64, offset: 832)
!465 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !429, file: !73, line: 187, baseType: !467, size: 768, offset: 896)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !469)
!469 = !{!470, !477, !478, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !468, file: !73, line: 124, baseType: !471, size: 192)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !472, file: !73, line: 98, baseType: !465, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !472, file: !73, line: 99, baseType: !465, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !472, file: !73, line: 100, baseType: !465, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !468, file: !73, line: 125, baseType: !471, size: 192, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !468, file: !73, line: 126, baseType: !471, size: 192, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !468, file: !73, line: 127, baseType: !471, size: 192, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !429, file: !73, line: 190, baseType: !481, size: 32, offset: 1664)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !429, file: !73, line: 193, baseType: !483, size: 64, offset: 1728)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !429, file: !73, line: 196, baseType: !485, size: 32, offset: 1792)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !429, file: !73, line: 199, baseType: !487, size: 64, offset: 1856)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !429, file: !73, line: 200, baseType: !487, size: 64, offset: 1920)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !429, file: !73, line: 201, baseType: !487, size: 64, offset: 1984)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !429, file: !73, line: 204, baseType: !492, size: 64, offset: 2048)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !493, line: 77, baseType: !494)
!493 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !495, line: 193, baseType: !496)
!495 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!496 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !429, file: !73, line: 207, baseType: !465, size: 64, offset: 2112)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !429, file: !73, line: 208, baseType: !465, size: 64, offset: 2176)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !429, file: !73, line: 211, baseType: !500, size: 256, offset: 2240)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !501, file: !153, line: 124, baseType: !438, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !501, file: !153, line: 125, baseType: !438, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !501, file: !153, line: 128, baseType: !492, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !501, file: !153, line: 129, baseType: !492, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !429, file: !73, line: 212, baseType: !500, size: 256, offset: 2496)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !429, file: !73, line: 213, baseType: !500, size: 256, offset: 2752)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !429, file: !73, line: 216, baseType: !465, size: 64, offset: 3008)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !429, file: !73, line: 217, baseType: !465, size: 64, offset: 3072)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !429, file: !73, line: 218, baseType: !465, size: 64, offset: 3136)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !429, file: !73, line: 221, baseType: !513, size: 32, offset: 3200)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !429, file: !73, line: 224, baseType: !515, size: 32, offset: 3232)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !429, file: !73, line: 227, baseType: !517, size: 32, offset: 3264)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !429, file: !73, line: 230, baseType: !519, size: 32, offset: 3296)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !429, file: !73, line: 233, baseType: !521, size: 32, offset: 3328)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !429, file: !73, line: 236, baseType: !523, size: 32, offset: 3360)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !429, file: !73, line: 239, baseType: !525, size: 64, offset: 3392)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !429, file: !73, line: 242, baseType: !438, size: 64, offset: 3456)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !429, file: !73, line: 243, baseType: !438, size: 64, offset: 3520)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !429, file: !73, line: 246, baseType: !492, size: 64, offset: 3584)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !429, file: !73, line: 249, baseType: !438, size: 64, offset: 3648)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !429, file: !73, line: 250, baseType: !438, size: 64, offset: 3712)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !429, file: !73, line: 253, baseType: !492, size: 64, offset: 3776)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !429, file: !73, line: 256, baseType: !533, size: 192, offset: 3840)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !534, line: 68, baseType: !535)
!534 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !534, line: 62, size: 192, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !535, file: !534, line: 65, baseType: !465, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !535, file: !534, line: 66, baseType: !465, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !535, file: !534, line: 67, baseType: !465, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !429, file: !73, line: 259, baseType: !541, size: 512, offset: 4032)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !543)
!543 = !{!544, !551, !552, !554}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !542, file: !247, line: 43, baseType: !545, size: 192)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !546, file: !247, line: 35, baseType: !465, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !546, file: !247, line: 36, baseType: !465, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !546, file: !247, line: 37, baseType: !465, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !542, file: !247, line: 44, baseType: !545, size: 192, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !542, file: !247, line: 47, baseType: !553, size: 32, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !542, file: !247, line: 50, baseType: !438, size: 64, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !429, file: !73, line: 262, baseType: !556, size: 64, offset: 4544)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !557, line: 26, baseType: !558)
!557 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!444, !561, !563, !566, !483}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !565)
!565 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !568)
!568 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !429, file: !73, line: 265, baseType: !483, size: 64, offset: 4608)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !429, file: !73, line: 266, baseType: !483, size: 64, offset: 4672)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !429, file: !73, line: 267, baseType: !483, size: 64, offset: 4736)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !429, file: !73, line: 270, baseType: !573, size: 64, offset: 4800)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !429, file: !73, line: 273, baseType: !577, size: 64, offset: 4864)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !579)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !429, file: !73, line: 276, baseType: !581, size: 32768, offset: 4928)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 32768, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 4096)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !429, file: !73, line: 277, baseType: !581, size: 32768, offset: 37696)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !429, file: !73, line: 278, baseType: !581, size: 32768, offset: 70464)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !429, file: !73, line: 281, baseType: !438, size: 64, offset: 103232)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !429, file: !73, line: 282, baseType: !438, size: 64, offset: 103296)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !429, file: !73, line: 285, baseType: !589, size: 448, offset: 103360)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !591)
!591 = !{!592, !594, !596, !597, !598, !599, !600, !605}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !590, file: !253, line: 105, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !590, file: !253, line: 108, baseType: !595, size: 32, offset: 32)
!595 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !590, file: !253, line: 111, baseType: !487, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !590, file: !253, line: 112, baseType: !487, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !590, file: !253, line: 115, baseType: !483, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !590, file: !253, line: 118, baseType: !444, size: 32, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !590, file: !253, line: 121, baseType: !601, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !603, line: 26, baseType: !604)
!603 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !603, line: 25, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !590, file: !253, line: 124, baseType: !438, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !429, file: !73, line: 288, baseType: !444, size: 32, offset: 103808)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !429, file: !73, line: 291, baseType: !608, size: 64, offset: 103872)
!608 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !492)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !429, file: !73, line: 294, baseType: !601, size: 64, offset: 103936)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !429, file: !73, line: 297, baseType: !611, size: 256, offset: 104000)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !613)
!613 = !{!614, !615, !616, !619}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !612, file: !89, line: 30, baseType: !487, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !612, file: !89, line: 33, baseType: !438, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !612, file: !89, line: 36, baseType: !617, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !612, file: !89, line: 39, baseType: !438, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !429, file: !73, line: 298, baseType: !611, size: 256, offset: 104256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !429, file: !73, line: 299, baseType: !622, size: 64, offset: 104512)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !429, file: !73, line: 302, baseType: !438, size: 64, offset: 104576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !429, file: !73, line: 305, baseType: !438, size: 64, offset: 104640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !429, file: !73, line: 308, baseType: !525, size: 64, offset: 104704)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !429, file: !73, line: 309, baseType: !525, size: 64, offset: 104768)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !73, line: 310, baseType: !525, size: 64, offset: 104832)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !429, file: !73, line: 313, baseType: !629, size: 32, offset: 104896)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !429, file: !73, line: 316, baseType: !444, size: 32, offset: 104928)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !429, file: !73, line: 319, baseType: !452, size: 64, offset: 104960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !429, file: !73, line: 322, baseType: !525, size: 64, offset: 105024)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !429, file: !73, line: 325, baseType: !500, size: 256, offset: 105088)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !429, file: !73, line: 328, baseType: !483, size: 64, offset: 105344)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !429, file: !73, line: 329, baseType: !483, size: 64, offset: 105408)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !73, line: 332, baseType: !637, size: 32, offset: 105472)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !429, file: !73, line: 335, baseType: !444, size: 32, offset: 105504)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !429, file: !73, line: 338, baseType: !567, size: 64, offset: 105536)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !429, file: !73, line: 341, baseType: !444, size: 32, offset: 105600)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !429, file: !73, line: 344, baseType: !438, size: 64, offset: 105664)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !429, file: !73, line: 347, baseType: !643, size: 64, offset: 105728)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !644, line: 7, baseType: !645)
!644 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !495, line: 160, baseType: !496)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !429, file: !73, line: 350, baseType: !647, size: 32, offset: 105792)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !429, file: !73, line: 353, baseType: !438, size: 64, offset: 105856)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !369, line: 50, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !652, line: 65, size: 384, elements: !653)
!652 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1c02c36d1afff9640ebc3240e403cf60")
!653 = !{!654, !655, !657, !658, !675, !676}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !651, file: !652, line: 68, baseType: !427, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !651, file: !652, line: 71, baseType: !656, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !369, line: 47, baseType: !368)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !651, file: !652, line: 74, baseType: !438, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nexus_info", scope: !651, file: !652, line: 77, baseType: !659, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "NexusInfo", file: !662, line: 126, baseType: !663)
!662 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "6b4e371270617573d29dc6ff902677c8")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NexusInfo", file: !662, line: 103, size: 704, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !674}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !663, file: !662, line: 106, baseType: !444, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !663, file: !662, line: 109, baseType: !500, size: 256, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !663, file: !662, line: 112, baseType: !567, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !663, file: !662, line: 115, baseType: !451, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !663, file: !662, line: 116, baseType: !451, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "authentic_pixel_cache", scope: !663, file: !662, line: 119, baseType: !444, size: 32, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !663, file: !662, line: 122, baseType: !672, size: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !456)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !663, file: !662, line: 125, baseType: !438, size: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !651, file: !652, line: 80, baseType: !444, size: 32, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !651, file: !652, line: 83, baseType: !438, size: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!679 = !{i32 7, !"Dwarf Version", i32 5}
!680 = !{i32 2, !"Debug Info Version", i32 3}
!681 = !{i32 1, !"wchar_size", i32 4}
!682 = !{i32 7, !"PIC Level", i32 2}
!683 = !{i32 7, !"PIE Level", i32 2}
!684 = !{i32 7, !"uwtable", i32 2}
!685 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!686 = distinct !DISubprogram(name: "AcquireAuthenticCacheView", scope: !652, file: !652, line: 111, type: !687, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !692)
!687 = !DISubroutineType(types: !688)
!688 = !{!649, !689, !691}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!692 = !{!693, !694, !695}
!693 = !DILocalVariable(name: "image", arg: 1, scope: !686, file: !652, line: 111, type: !689)
!694 = !DILocalVariable(name: "exception", arg: 2, scope: !686, file: !652, line: 112, type: !691)
!695 = !DILocalVariable(name: "cache_view", scope: !686, file: !652, line: 115, type: !696)
!696 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !649)
!697 = !DILocation(line: 0, scope: !686)
!698 = !DILocation(line: 117, column: 14, scope: !686)
!699 = !DILocation(line: 118, column: 42, scope: !686)
!700 = !{!701, !702, i64 0}
!701 = !{!"_CacheView", !702, i64 0, !703, i64 8, !705, i64 16, !702, i64 24, !703, i64 32, !705, i64 40}
!702 = !{!"any pointer", !703, i64 0}
!703 = !{!"omnipotent char", !704, i64 0}
!704 = !{!"Simple C/C++ TBAA"}
!705 = !{!"long", !703, i64 0}
!706 = !DILocation(line: 118, column: 10, scope: !686)
!707 = !DILocation(line: 119, column: 3, scope: !686)
!708 = distinct !DISubprogram(name: "AcquireVirtualCacheView", scope: !652, file: !652, line: 154, type: !687, scopeLine: 156, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !709)
!709 = !{!710, !711, !712, !713, !716, !717, !720}
!710 = !DILocalVariable(name: "image", arg: 1, scope: !708, file: !652, line: 154, type: !689)
!711 = !DILocalVariable(name: "exception", arg: 2, scope: !708, file: !652, line: 155, type: !691)
!712 = !DILocalVariable(name: "cache_view", scope: !708, file: !652, line: 158, type: !696)
!713 = !DILocalVariable(name: "message", scope: !714, file: !652, line: 168, type: !487)
!714 = distinct !DILexicalBlock(scope: !715, file: !652, line: 168, column: 5)
!715 = distinct !DILexicalBlock(scope: !708, file: !652, line: 167, column: 7)
!716 = !DILocalVariable(name: "exception", scope: !714, file: !652, line: 168, type: !589)
!717 = !DILocalVariable(name: "message", scope: !718, file: !652, line: 181, type: !487)
!718 = distinct !DILexicalBlock(scope: !719, file: !652, line: 181, column: 5)
!719 = distinct !DILexicalBlock(scope: !708, file: !652, line: 180, column: 7)
!720 = !DILocalVariable(name: "exception", scope: !718, file: !652, line: 181, type: !589)
!721 = !DILocation(line: 0, scope: !708)
!722 = !DILocation(line: 162, column: 14, scope: !723)
!723 = distinct !DILexicalBlock(scope: !708, file: !652, line: 162, column: 7)
!724 = !{!725, !703, i64 12976}
