; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/cache.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/cache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._CacheInfo = type { i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, i32, %struct._MagickPixelPacket, i64, ptr, ptr, ptr, i32, i32, [4096 x i8], [4096 x i8], %struct._CacheMethods, ptr, i64, ptr, i32, i32, i32, i64, ptr, ptr, i64, i64 }
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._CacheMethods = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct._NexusInfo = type { i32, %struct._RectangleInfo, i64, ptr, ptr, i32, ptr, i64 }
%struct._RectangleInfo = type { i64, i64, i64, i64 }

!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!447 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!448 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!449 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!450 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!451 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!452 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!453 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!454 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!455 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!456 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!457 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!458 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!459 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!460 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!461 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!462 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!463 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!464 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!465 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!466 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!467 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!468 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!469 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!470 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!471 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!472 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!473 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!474 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!475 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!476 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!477 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!478 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!479 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!480 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!481 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!482 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!483 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!484 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!485 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!486 = !DIEnumerator(name: "MagickListOptions", value: 38)
!487 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!488 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!489 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!490 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!491 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!492 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!493 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!494 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!495 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!496 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!497 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!498 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!499 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!500 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!501 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!502 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!503 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!504 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!505 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!506 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!507 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!508 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!509 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!510 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!511 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!512 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!513 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!514 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!515 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!516 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!517 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!518 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!519 = !{!520, !666, !532, !445, !530, !568, !731, !885, !569, !581, !886, !763, !888, !861, !890, !866, !589, !839, !849, !833, !844, !624, !828, !545, !602, !821, !837, !542, !594, !825, !816, !620, !854, !856, !560, !557, !901, !903, !779, !603}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheInfo", file: !522, line: 217, baseType: !523)
!522 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "6b4e371270617573d29dc6ff902677c8")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheInfo", file: !522, line: 128, size: 68224, elements: !524)
!524 = !{!525, !527, !529, !533, !535, !537, !539, !540, !541, !544, !547, !549, !566, !567, !605, !606, !607, !608, !609, !614, !615, !865, !870, !871, !872, !873, !874, !880, !881, !882, !883, !884}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !523, file: !522, line: 131, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !5)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !523, file: !522, line: 134, baseType: !528, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !13, line: 61, baseType: !12)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !523, file: !522, line: 137, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !531, line: 46, baseType: !532)
!531 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!532 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !523, file: !522, line: 140, baseType: !534, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheType", file: !50, line: 35, baseType: !49)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !523, file: !522, line: 143, baseType: !536, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "MapMode", file: !59, line: 35, baseType: !58)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !523, file: !522, line: 146, baseType: !538, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !523, file: !522, line: 149, baseType: !530, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !523, file: !522, line: 150, baseType: !530, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !523, file: !522, line: 153, baseType: !542, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !543)
!543 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !523, file: !522, line: 156, baseType: !545, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !546)
!546 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !523, file: !522, line: 159, baseType: !548, size: 32, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !69, line: 47, baseType: !68)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_color", scope: !523, file: !522, line: 162, baseType: !550, size: 448, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !364, line: 127, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !364, line: 104, size: 448, elements: !552)
!552 = !{!553, !554, !555, !556, !558, !559, !562, !563, !564, !565}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !551, file: !364, line: 107, baseType: !526, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !551, file: !364, line: 110, baseType: !528, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !551, file: !364, line: 113, baseType: !538, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !551, file: !364, line: 116, baseType: !557, size: 64, offset: 128)
!557 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !551, file: !364, line: 119, baseType: !530, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !551, file: !364, line: 122, baseType: !560, size: 32, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !6, line: 78, baseType: !561)
!561 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !551, file: !364, line: 123, baseType: !560, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !551, file: !364, line: 124, baseType: !560, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !551, file: !364, line: 125, baseType: !560, size: 32, offset: 352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !551, file: !364, line: 126, baseType: !560, size: 32, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !523, file: !522, line: 165, baseType: !530, size: 64, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "nexus_info", scope: !523, file: !522, line: 168, baseType: !568, size: 64, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "NexusInfo", file: !522, line: 126, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NexusInfo", file: !522, line: 103, size: 704, elements: !572)
!572 = !{!573, !574, !587, !588, !599, !600, !601, !604}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !571, file: !522, line: 106, baseType: !538, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !571, file: !522, line: 109, baseType: !575, size: 256, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !191, line: 130, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !191, line: 121, size: 256, elements: !577)
!577 = !{!578, !579, !580, !586}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !576, file: !191, line: 124, baseType: !530, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !576, file: !191, line: 125, baseType: !530, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !576, file: !191, line: 128, baseType: !581, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !582, line: 77, baseType: !583)
!582 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !584, line: 193, baseType: !585)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!585 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !576, file: !191, line: 129, baseType: !581, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !571, file: !522, line: 112, baseType: !545, size: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !571, file: !522, line: 115, baseType: !589, size: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !364, line: 148, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !364, line: 131, size: 64, elements: !592)
!592 = !{!593, !596, !597, !598}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !591, file: !364, line: 143, baseType: !594, size: 16)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !595)
!595 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !591, file: !364, line: 144, baseType: !594, size: 16, offset: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !591, file: !364, line: 145, baseType: !594, size: 16, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !591, file: !364, line: 146, baseType: !594, size: 16, offset: 48)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !571, file: !522, line: 116, baseType: !589, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "authentic_pixel_cache", scope: !571, file: !522, line: 119, baseType: !538, size: 32, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !571, file: !522, line: 122, baseType: !602, size: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !364, line: 129, baseType: !594)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !571, file: !522, line: 125, baseType: !530, size: 64, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !523, file: !522, line: 171, baseType: !589, size: 64, offset: 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !523, file: !522, line: 174, baseType: !602, size: 64, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "active_index_channel", scope: !523, file: !522, line: 177, baseType: !538, size: 32, offset: 1280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !523, file: !522, line: 180, baseType: !445, size: 32, offset: 1312)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !523, file: !522, line: 183, baseType: !610, size: 32768, offset: 1344)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 32768, elements: !612)
!611 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!612 = !{!613}
!613 = !DISubrange(count: 4096)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cache_filename", scope: !523, file: !522, line: 184, baseType: !610, size: 32768, offset: 34112)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !523, file: !522, line: 187, baseType: !616, size: 704, offset: 66880)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheMethods", file: !522, line: 101, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheMethods", file: !522, line: 67, size: 704, elements: !618)
!618 = !{!619, !815, !820, !827, !832, !838, !843, !848, !853, !855, !860}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_pixel_handler", scope: !617, file: !522, line: 70, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualPixelHandler", file: !522, line: 49, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!624, !626, !811, !812, !812, !813, !813, !814}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !115, line: 150, size: 105920, elements: !630)
!630 = !{!631, !632, !633, !635, !636, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !663, !665, !667, !669, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !684, !686, !688, !690, !692, !694, !696, !697, !698, !699, !700, !701, !702, !710, !725, !735, !736, !737, !738, !742, !746, !747, !748, !749, !750, !751, !768, !769, !771, !772, !782, !783, !785, !786, !787, !788, !789, !790, !792, !793, !794, !795, !796, !797, !798, !800, !801, !802, !803, !804, !808, !810}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !629, file: !115, line: 153, baseType: !526, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !629, file: !115, line: 156, baseType: !528, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !629, file: !115, line: 159, baseType: !634, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !90, line: 49, baseType: !89)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !629, file: !115, line: 162, baseType: !530, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !629, file: !115, line: 165, baseType: !637, size: 32, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !115, line: 86, baseType: !114)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !629, file: !115, line: 168, baseType: !538, size: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !629, file: !115, line: 169, baseType: !538, size: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !629, file: !115, line: 172, baseType: !530, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !629, file: !115, line: 173, baseType: !530, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !629, file: !115, line: 174, baseType: !530, size: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !629, file: !115, line: 175, baseType: !530, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !629, file: !115, line: 178, baseType: !589, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !629, file: !115, line: 179, baseType: !590, size: 64, offset: 640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !629, file: !115, line: 180, baseType: !590, size: 64, offset: 704)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !629, file: !115, line: 181, baseType: !590, size: 64, offset: 768)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !629, file: !115, line: 184, baseType: !557, size: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !629, file: !115, line: 187, baseType: !650, size: 768, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !115, line: 128, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !115, line: 121, size: 768, elements: !652)
!652 = !{!653, !660, !661, !662}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !651, file: !115, line: 124, baseType: !654, size: 192)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !115, line: 101, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !115, line: 95, size: 192, elements: !656)
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !655, file: !115, line: 98, baseType: !557, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !655, file: !115, line: 99, baseType: !557, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !655, file: !115, line: 100, baseType: !557, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !651, file: !115, line: 125, baseType: !654, size: 192, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !651, file: !115, line: 126, baseType: !654, size: 192, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !651, file: !115, line: 127, baseType: !654, size: 192, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !629, file: !115, line: 190, baseType: !664, size: 32, offset: 1664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !127, line: 49, baseType: !126)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !629, file: !115, line: 193, baseType: !666, size: 64, offset: 1728)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !629, file: !115, line: 196, baseType: !668, size: 32, offset: 1792)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !115, line: 93, baseType: !134)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !629, file: !115, line: 199, baseType: !670, size: 64, offset: 1856)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !629, file: !115, line: 200, baseType: !670, size: 64, offset: 1920)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !629, file: !115, line: 201, baseType: !670, size: 64, offset: 1984)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !629, file: !115, line: 204, baseType: !581, size: 64, offset: 2048)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !629, file: !115, line: 207, baseType: !557, size: 64, offset: 2112)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !629, file: !115, line: 208, baseType: !557, size: 64, offset: 2176)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !629, file: !115, line: 211, baseType: !575, size: 256, offset: 2240)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !629, file: !115, line: 212, baseType: !575, size: 256, offset: 2496)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !629, file: !115, line: 213, baseType: !575, size: 256, offset: 2752)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !629, file: !115, line: 216, baseType: !557, size: 64, offset: 3008)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !629, file: !115, line: 217, baseType: !557, size: 64, offset: 3072)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !629, file: !115, line: 218, baseType: !557, size: 64, offset: 3136)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !629, file: !115, line: 221, baseType: !683, size: 32, offset: 3200)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !140, line: 66, baseType: !139)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !629, file: !115, line: 224, baseType: !685, size: 32, offset: 3232)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !115, line: 73, baseType: !174)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !629, file: !115, line: 227, baseType: !687, size: 32, offset: 3264)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !185, line: 35, baseType: !184)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !629, file: !115, line: 230, baseType: !689, size: 32, offset: 3296)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !191, line: 91, baseType: !190)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !629, file: !115, line: 233, baseType: !691, size: 32, offset: 3328)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !206, line: 99, baseType: !205)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !629, file: !115, line: 236, baseType: !693, size: 32, offset: 3360)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !277, line: 32, baseType: !276)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !629, file: !115, line: 239, baseType: !695, size: 64, offset: 3392)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !629, file: !115, line: 242, baseType: !530, size: 64, offset: 3456)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !629, file: !115, line: 243, baseType: !530, size: 64, offset: 3520)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !629, file: !115, line: 246, baseType: !581, size: 64, offset: 3584)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !629, file: !115, line: 249, baseType: !530, size: 64, offset: 3648)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !629, file: !115, line: 250, baseType: !530, size: 64, offset: 3712)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !629, file: !115, line: 253, baseType: !581, size: 64, offset: 3776)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !629, file: !115, line: 256, baseType: !703, size: 192, offset: 3840)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !704, line: 68, baseType: !705)
!704 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !704, line: 62, size: 192, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !705, file: !704, line: 65, baseType: !557, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !705, file: !704, line: 66, baseType: !557, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !705, file: !704, line: 67, baseType: !557, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !629, file: !115, line: 259, baseType: !711, size: 512, offset: 4032)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !285, line: 51, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !285, line: 40, size: 512, elements: !713)
!713 = !{!714, !721, !722, !724}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !712, file: !285, line: 43, baseType: !715, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !285, line: 38, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !285, line: 32, size: 192, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !716, file: !285, line: 35, baseType: !557, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !716, file: !285, line: 36, baseType: !557, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !716, file: !285, line: 37, baseType: !557, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !712, file: !285, line: 44, baseType: !715, size: 192, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !712, file: !285, line: 47, baseType: !723, size: 32, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !285, line: 30, baseType: !284)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !712, file: !285, line: 50, baseType: !530, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !629, file: !115, line: 262, baseType: !726, size: 64, offset: 4544)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !727, line: 26, baseType: !728)
!727 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!538, !731, !733, !734, !666}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !629, file: !115, line: 265, baseType: !666, size: 64, offset: 4608)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !629, file: !115, line: 266, baseType: !666, size: 64, offset: 4672)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !629, file: !115, line: 267, baseType: !666, size: 64, offset: 4736)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !629, file: !115, line: 270, baseType: !739, size: 64, offset: 4800)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !90, line: 52, baseType: !741)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !90, line: 51, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !629, file: !115, line: 273, baseType: !743, size: 64, offset: 4864)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !745)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !629, file: !115, line: 276, baseType: !610, size: 32768, offset: 4928)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !629, file: !115, line: 277, baseType: !610, size: 32768, offset: 37696)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !629, file: !115, line: 278, baseType: !610, size: 32768, offset: 70464)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !629, file: !115, line: 281, baseType: !530, size: 64, offset: 103232)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !629, file: !115, line: 282, baseType: !530, size: 64, offset: 103296)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !629, file: !115, line: 285, baseType: !752, size: 448, offset: 103360)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !291, line: 102, size: 448, elements: !754)
!754 = !{!755, !757, !758, !759, !760, !761, !762, !767}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !753, file: !291, line: 105, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !291, line: 100, baseType: !290)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !753, file: !291, line: 108, baseType: !445, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !753, file: !291, line: 111, baseType: !670, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !753, file: !291, line: 112, baseType: !670, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !753, file: !291, line: 115, baseType: !666, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !753, file: !291, line: 118, baseType: !538, size: 32, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !753, file: !291, line: 121, baseType: !763, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !765, line: 26, baseType: !766)
!765 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !765, line: 25, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !753, file: !291, line: 124, baseType: !530, size: 64, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !629, file: !115, line: 288, baseType: !538, size: 32, offset: 103808)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !629, file: !115, line: 291, baseType: !770, size: 64, offset: 103872)
!770 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !581)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !629, file: !115, line: 294, baseType: !763, size: 64, offset: 103936)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !629, file: !115, line: 297, baseType: !773, size: 256, offset: 104000)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !127, line: 40, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !127, line: 27, size: 256, elements: !775)
!775 = !{!776, !777, !778, !781}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !774, file: !127, line: 30, baseType: !670, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !774, file: !127, line: 33, baseType: !530, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !774, file: !127, line: 36, baseType: !779, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !774, file: !127, line: 39, baseType: !530, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !629, file: !115, line: 298, baseType: !773, size: 256, offset: 104256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !629, file: !115, line: 299, baseType: !784, size: 64, offset: 104512)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !629, file: !115, line: 302, baseType: !530, size: 64, offset: 104576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !629, file: !115, line: 305, baseType: !530, size: 64, offset: 104640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !629, file: !115, line: 308, baseType: !695, size: 64, offset: 104704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !629, file: !115, line: 309, baseType: !695, size: 64, offset: 104768)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !629, file: !115, line: 310, baseType: !695, size: 64, offset: 104832)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !629, file: !115, line: 313, baseType: !791, size: 32, offset: 104896)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !364, line: 47, baseType: !363)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !629, file: !115, line: 316, baseType: !538, size: 32, offset: 104928)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !629, file: !115, line: 319, baseType: !590, size: 64, offset: 104960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !629, file: !115, line: 322, baseType: !695, size: 64, offset: 105024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !629, file: !115, line: 325, baseType: !575, size: 256, offset: 105088)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !629, file: !115, line: 328, baseType: !666, size: 64, offset: 105344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !629, file: !115, line: 329, baseType: !666, size: 64, offset: 105408)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !629, file: !115, line: 332, baseType: !799, size: 32, offset: 105472)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !115, line: 61, baseType: !380)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !629, file: !115, line: 335, baseType: !538, size: 32, offset: 105504)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !629, file: !115, line: 338, baseType: !545, size: 64, offset: 105536)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !629, file: !115, line: 341, baseType: !538, size: 32, offset: 105600)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !629, file: !115, line: 344, baseType: !530, size: 64, offset: 105664)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !629, file: !115, line: 347, baseType: !805, size: 64, offset: 105728)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !806, line: 7, baseType: !807)
!806 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !584, line: 160, baseType: !585)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !629, file: !115, line: 350, baseType: !809, size: 32, offset: 105792)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !364, line: 79, baseType: !394)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !629, file: !115, line: 353, baseType: !530, size: 64, offset: 105856)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_pixels_handler", scope: !617, file: !522, line: 73, baseType: !816, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualPixelsHandler", file: !522, line: 51, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!624, !626}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_indexes_from_handler", scope: !617, file: !522, line: 76, baseType: !821, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualIndexesFromHandler", file: !522, line: 36, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!825, !626}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "get_one_virtual_pixel_from_handler", scope: !617, file: !522, line: 79, baseType: !828, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetOneVirtualPixelFromHandler", file: !522, line: 44, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!538, !626, !811, !812, !812, !589, !814}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_pixels_handler", scope: !617, file: !522, line: 82, baseType: !833, size: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticPixelsHandler", file: !522, line: 54, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!589, !837, !812, !812, !813, !813, !814}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_indexes_from_handler", scope: !617, file: !522, line: 85, baseType: !839, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticIndexesFromHandler", file: !522, line: 39, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!602, !626}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "get_one_authentic_pixel_from_handler", scope: !617, file: !522, line: 88, baseType: !844, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetOneAuthenticPixelFromHandler", file: !522, line: 42, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!538, !837, !812, !812, !589, !814}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_pixels_from_handler", scope: !617, file: !522, line: 91, baseType: !849, size: 64, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticPixelsFromHandler", file: !522, line: 58, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!589, !626}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "queue_authentic_pixels_handler", scope: !617, file: !522, line: 94, baseType: !854, size: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueAuthenticPixelsHandler", file: !522, line: 61, baseType: !834)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sync_authentic_pixels_handler", scope: !617, file: !522, line: 97, baseType: !856, size: 64, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncAuthenticPixelsHandler", file: !522, line: 46, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!538, !837, !814}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_pixel_handler", scope: !617, file: !522, line: 100, baseType: !861, size: 64, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "DestroyPixelHandler", file: !522, line: 65, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !837}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "random_info", scope: !523, file: !522, line: 190, baseType: !866, size: 64, offset: 67584)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !868, line: 31, baseType: !869)
!868 = !DIFile(filename: "apps/538.imagick_r/src/magick/random_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "95f31caf92e8a7cab5b1bf8cc3698f31")
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !868, line: 30, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "number_connections", scope: !523, file: !522, line: 193, baseType: !530, size: 64, offset: 67648)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "server_info", scope: !523, file: !522, line: 196, baseType: !666, size: 64, offset: 67712)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !523, file: !522, line: 199, baseType: !538, size: 32, offset: 67776)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !523, file: !522, line: 200, baseType: !538, size: 32, offset: 67808)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !523, file: !522, line: 203, baseType: !875, size: 32, offset: 67840)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickThreadType", file: !876, line: 30, baseType: !877)
!876 = !DIFile(filename: "apps/538.imagick_r/src/magick/thread_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c99214db95297b06bb439184c535bbc9")
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !878, line: 97, baseType: !879)
!878 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !584, line: 154, baseType: !445)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !523, file: !522, line: 206, baseType: !581, size: 64, offset: 67904)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !523, file: !522, line: 209, baseType: !763, size: 64, offset: 67968)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "file_semaphore", scope: !523, file: !522, line: 210, baseType: !763, size: 64, offset: 68032)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !523, file: !522, line: 213, baseType: !805, size: 64, offset: 68096)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !523, file: !522, line: 216, baseType: !530, size: 64, offset: 68160)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cache", file: !522, line: 33, baseType: !666)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "DistributeCacheInfo", file: !892, line: 47, baseType: !893)
!892 = !DIFile(filename: "apps/538.imagick_r/src/magick/distribute-cache-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "49d7fc00e918410003b4207b0f480734")
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DistributeCacheInfo", file: !892, line: 28, size: 33088, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !893, file: !892, line: 31, baseType: !445, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "session_key", scope: !893, file: !892, line: 34, baseType: !530, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !893, file: !892, line: 37, baseType: !610, size: 32768, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !893, file: !892, line: 40, baseType: !445, size: 32, offset: 32896)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !893, file: !892, line: 43, baseType: !530, size: 64, offset: 32960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !893, file: !892, line: 46, baseType: !538, size: 32, offset: 33024)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!904 = !{!0, !905, !909, !914, !939, !941, !943}
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "instantiate_cache", scope: !2, file: !907, line: 147, type: !908, isLocal: true, isDefinition: true)
!907 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5b09d334ef50b671ec9d93400bc939a6")
!908 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !538)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "DitherMatrix", scope: !2, file: !907, line: 2487, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 4096, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 64)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "cpu_throttle", scope: !916, file: !907, line: 1499, type: !545, isLocal: true, isDefinition: true)
!916 = distinct !DISubprogram(name: "GetImagePixelCache", scope: !907, file: !907, line: 1488, type: !917, scopeLine: 1490, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !920)
!917 = !DISubroutineType(types: !918)
!918 = !{!885, !837, !919, !814}
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!920 = !{!921, !922, !923, !924, !926, !927, !928, !932, !933, !938}
!921 = !DILocalVariable(name: "image", arg: 1, scope: !916, file: !907, line: 1488, type: !837)
!922 = !DILocalVariable(name: "clone", arg: 2, scope: !916, file: !907, line: 1488, type: !919)
!923 = !DILocalVariable(name: "exception", arg: 3, scope: !916, file: !907, line: 1489, type: !814)
!924 = !DILocalVariable(name: "cache_info", scope: !916, file: !907, line: 1492, type: !925)
!925 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !520)
!926 = !DILocalVariable(name: "destroy", scope: !916, file: !907, line: 1495, type: !538)
!927 = !DILocalVariable(name: "status", scope: !916, file: !907, line: 1496, type: !538)
!928 = !DILocalVariable(name: "message", scope: !929, file: !907, line: 1526, type: !670)
!929 = distinct !DILexicalBlock(scope: !930, file: !907, line: 1526, column: 8)
!930 = distinct !DILexicalBlock(scope: !931, file: !907, line: 1522, column: 6)
!931 = distinct !DILexicalBlock(scope: !916, file: !907, line: 1520, column: 7)
!932 = !DILocalVariable(name: "exception", scope: !929, file: !907, line: 1526, type: !752)
!933 = !DILocalVariable(name: "clone_info", scope: !934, file: !907, line: 1537, type: !520)
!934 = distinct !DILexicalBlock(scope: !935, file: !907, line: 1535, column: 9)
!935 = distinct !DILexicalBlock(scope: !936, file: !907, line: 1534, column: 11)
!936 = distinct !DILexicalBlock(scope: !937, file: !907, line: 1532, column: 5)
!937 = distinct !DILexicalBlock(scope: !916, file: !907, line: 1531, column: 7)
!938 = !DILocalVariable(name: "clone_image", scope: !934, file: !907, line: 1540, type: !628)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "cycles", scope: !916, file: !907, line: 1500, type: !545, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "time_limit", scope: !916, file: !907, line: 1501, type: !545, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "cache_timestamp", scope: !916, file: !907, line: 1504, type: !805, isLocal: true, isDefinition: true)
!945 = !{i32 7, !"Dwarf Version", i32 5}
!946 = !{i32 2, !"Debug Info Version", i32 3}
!947 = !{i32 1, !"wchar_size", i32 4}
!948 = !{i32 7, !"PIC Level", i32 2}
!949 = !{i32 7, !"PIE Level", i32 2}
!950 = !{i32 7, !"uwtable", i32 2}
!951 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!952 = distinct !DISubprogram(name: "AcquirePixelCache", scope: !907, file: !907, line: 174, type: !953, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !955)
!953 = !DISubroutineType(types: !954)
!954 = !{!885, !813}
!955 = !{!956, !957, !958, !959, !962, !963, !966}
!956 = !DILocalVariable(name: "number_threads", arg: 1, scope: !952, file: !907, line: 174, type: !813)
!957 = !DILocalVariable(name: "cache_info", scope: !952, file: !907, line: 177, type: !925)
!958 = !DILocalVariable(name: "synchronize", scope: !952, file: !907, line: 180, type: !670)
!959 = !DILocalVariable(name: "message", scope: !960, file: !907, line: 184, type: !670)
!960 = distinct !DILexicalBlock(scope: !961, file: !907, line: 184, column: 5)
!961 = distinct !DILexicalBlock(scope: !952, file: !907, line: 183, column: 7)
!962 = !DILocalVariable(name: "exception", scope: !960, file: !907, line: 184, type: !752)
!963 = !DILocalVariable(name: "message", scope: !964, file: !907, line: 201, type: !670)
!964 = distinct !DILexicalBlock(scope: !965, file: !907, line: 201, column: 5)
!965 = distinct !DILexicalBlock(scope: !952, file: !907, line: 200, column: 7)
!966 = !DILocalVariable(name: "exception", scope: !964, file: !907, line: 201, type: !752)
!967 = !DILocation(line: 0, scope: !952)
!968 = !DILocation(line: 182, column: 28, scope: !952)
!969 = !DILocation(line: 183, column: 18, scope: !961)
!970 = !DILocation(line: 183, column: 7, scope: !952)
!971 = !DILocation(line: 184, column: 5, scope: !960)
!972 = !{!973, !973, i64 0}
!973 = !{!"int", !974, i64 0}
!974 = !{!"omnipotent char", !975, i64 0}
!975 = !{!"Simple C/C++ TBAA"}
!976 = !DILocation(line: 0, scope: !960)
!977 = !DILocation(line: 185, column: 10, scope: !952)
!978 = !DILocation(line: 186, column: 15, scope: !952)
!979 = !DILocation(line: 186, column: 19, scope: !952)
!980 = !{!981, !974, i64 16}
!981 = !{!"_CacheInfo", !974, i64 0, !974, i64 4, !982, i64 8, !974, i64 16, !974, i64 20, !974, i64 24, !982, i64 32, !982, i64 40, !983, i64 48, !983, i64 56, !974, i64 64, !984, i64 72, !982, i64 128, !987, i64 136, !987, i64 144, !987, i64 152, !974, i64 160, !973, i64 164, !974, i64 168, !974, i64 4264, !988, i64 8360, !987, i64 8448, !982, i64 8456, !987, i64 8464, !974, i64 8472, !974, i64 8476, !973, i64 8480, !982, i64 8488, !987, i64 8496, !987, i64 8504, !982, i64 8512, !982, i64 8520}
!982 = !{!"long", !974, i64 0}
!983 = !{!"long long", !974, i64 0}
!984 = !{!"_MagickPixelPacket", !974, i64 0, !974, i64 4, !974, i64 8, !985, i64 16, !982, i64 24, !986, i64 32, !986, i64 36, !986, i64 40, !986, i64 44, !986, i64 48}
!985 = !{!"double", !974, i64 0}
!986 = !{!"float", !974, i64 0}
!987 = !{!"any pointer", !974, i64 0}
!988 = !{!"_CacheMethods", !987, i64 0, !987, i64 8, !987, i64 16, !987, i64 24, !987, i64 32, !987, i64 40, !987, i64 48, !987, i64 56, !987, i64 64, !987, i64 72, !987, i64 80}
!989 = !DILocation(line: 187, column: 15, scope: !952)
!990 = !DILocation(line: 187, column: 19, scope: !952)
!991 = !{!981, !974, i64 20}
!992 = !DILocation(line: 188, column: 15, scope: !952)
!993 = !DILocation(line: 188, column: 25, scope: !952)
!994 = !{!981, !974, i64 4}
!995 = !DILocation(line: 189, column: 15, scope: !952)
!996 = !DILocation(line: 189, column: 23, scope: !952)
!997 = !{!981, !982, i64 8}
!998 = !DILocation(line: 190, column: 15, scope: !952)
!999 = !DILocation(line: 190, column: 19, scope: !952)
!1000 = !{!981, !973, i64 164}
!1001 = !DILocation(line: 62, column: 10, scope: !1002, inlinedAt: !1007)
!1002 = distinct !DISubprogram(name: "GetMagickThreadId", scope: !1003, file: !1003, line: 55, type: !1004, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1006)
!1003 = !DIFile(filename: "apps/538.imagick_r/src/magick/thread-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "39ddb4e596128be27607023dd7e0ab15")
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!875}
!1006 = !{}
!1007 = distinct !DILocation(line: 191, column: 18, scope: !952)
!1008 = !DILocation(line: 191, column: 15, scope: !952)
!1009 = !DILocation(line: 191, column: 17, scope: !952)
!1010 = !{!981, !973, i64 8480}
!1011 = !DILocation(line: 192, column: 15, scope: !952)
!1012 = !DILocation(line: 193, column: 33, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !952, file: !907, line: 193, column: 7)
!1014 = !DILocation(line: 193, column: 7, scope: !952)
!1015 = !DILocation(line: 195, column: 7, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !952, file: !907, line: 195, column: 7)
!1017 = !DILocation(line: 195, column: 60, scope: !1016)
!1018 = !{!981, !982, i64 128}
!1019 = !DILocation(line: 195, column: 46, scope: !1016)
!1020 = !DILocation(line: 195, column: 7, scope: !952)
!1021 = !DILocation(line: 196, column: 41, scope: !1016)
!1022 = !DILocation(line: 196, column: 31, scope: !1016)
!1023 = !DILocation(line: 196, column: 5, scope: !1016)
!1024 = !DILocation(line: 197, column: 19, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !952, file: !907, line: 197, column: 7)
!1026 = !DILocation(line: 197, column: 34, scope: !1025)
!1027 = !DILocation(line: 197, column: 7, scope: !952)
!1028 = !DILocation(line: 198, column: 31, scope: !1025)
!1029 = !DILocation(line: 198, column: 5, scope: !1025)
!1030 = !DILocation(line: 199, column: 61, scope: !952)
!1031 = !DILocation(line: 199, column: 26, scope: !952)
!1032 = !DILocation(line: 199, column: 15, scope: !952)
!1033 = !DILocation(line: 199, column: 25, scope: !952)
!1034 = !{!981, !987, i64 136}
!1035 = !DILocation(line: 200, column: 30, scope: !965)
!1036 = !DILocation(line: 200, column: 7, scope: !952)
!1037 = !DILocation(line: 201, column: 5, scope: !964)
!1038 = !DILocation(line: 0, scope: !964)
!1039 = !DILocation(line: 202, column: 15, scope: !952)
!1040 = !DILocation(line: 203, column: 19, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !952, file: !907, line: 203, column: 7)
!1042 = !DILocation(line: 203, column: 7, scope: !952)
!1043 = !DILocation(line: 205, column: 31, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1041, file: !907, line: 204, column: 5)
!1045 = !DILocation(line: 205, column: 19, scope: !1044)
!1046 = !DILocation(line: 205, column: 30, scope: !1044)
!1047 = !{!981, !974, i64 8472}
!1048 = !DILocation(line: 206, column: 19, scope: !1044)
!1049 = !DILocation(line: 207, column: 5, scope: !1044)
!1050 = !DILocation(line: 208, column: 25, scope: !952)
!1051 = !DILocation(line: 208, column: 15, scope: !952)
!1052 = !DILocation(line: 208, column: 24, scope: !952)
!1053 = !{!981, !987, i64 8496}
!1054 = !DILocation(line: 209, column: 15, scope: !952)
!1055 = !DILocation(line: 209, column: 30, scope: !952)
!1056 = !{!981, !982, i64 8488}
!1057 = !DILocation(line: 210, column: 30, scope: !952)
!1058 = !DILocation(line: 210, column: 15, scope: !952)
!1059 = !DILocation(line: 210, column: 29, scope: !952)
!1060 = !{!981, !987, i64 8504}
!1061 = !DILocation(line: 211, column: 21, scope: !952)
!1062 = !DILocation(line: 211, column: 15, scope: !952)
!1063 = !DILocation(line: 211, column: 20, scope: !952)
!1064 = !{!981, !974, i64 8476}
!1065 = !DILocation(line: 212, column: 15, scope: !952)
!1066 = !DILocation(line: 212, column: 24, scope: !952)
!1067 = !{!981, !982, i64 8520}
!1068 = !DILocation(line: 213, column: 3, scope: !952)
!1069 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1070, file: !1070, line: 42, type: !1071, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1070 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!666, !813, !813}
!1073 = !DISubprogram(name: "GetExceptionInfo", scope: !291, file: !291, line: 166, type: !1074, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{null, !814}
!1076 = !DISubprogram(name: "GetExceptionMessage", scope: !291, file: !291, line: 137, type: !1077, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!670, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!1080 = !DISubprogram(name: "ThrowMagickException", scope: !291, file: !291, line: 156, type: !1081, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!538, !814, !731, !731, !813, !1083, !731, !731, null}
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!1084 = !DISubprogram(name: "DestroyString", scope: !1085, file: !1085, line: 46, type: !1086, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1085 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!670, !670}
!1088 = !DISubprogram(name: "CatchException", scope: !291, file: !291, line: 164, type: !1074, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1089 = !DISubprogram(name: "DestroyExceptionInfo", scope: !291, file: !291, line: 148, type: !1090, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!814, !814}
!1092 = !DISubprogram(name: "MagickCoreTerminus", scope: !1093, file: !1093, line: 147, type: !1094, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1093 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!1094 = !DISubroutineType(types: !1095)
!1095 = !{null}
!1096 = !DISubprogram(name: "ResetMagickMemory", scope: !1070, file: !1070, line: 52, type: !1097, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!666, !666, !445, !813}
!1099 = !DISubprogram(name: "GetMagickResourceLimit", scope: !407, file: !407, line: 53, type: !1100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!545, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResourceType", file: !407, line: 36, baseType: !406)
!1104 = distinct !DISubprogram(name: "AcquirePixelCacheNexus", scope: !907, file: !907, line: 238, type: !1105, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1107)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!568, !813}
!1107 = !{!1108, !1109, !1111, !1112, !1115, !1116, !1119}
!1108 = !DILocalVariable(name: "number_threads", arg: 1, scope: !1104, file: !907, line: 238, type: !813)
!1109 = !DILocalVariable(name: "nexus_info", scope: !1104, file: !907, line: 241, type: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !568)
!1111 = !DILocalVariable(name: "i", scope: !1104, file: !907, line: 244, type: !581)
!1112 = !DILocalVariable(name: "message", scope: !1113, file: !907, line: 249, type: !670)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !907, line: 249, column: 5)
!1114 = distinct !DILexicalBlock(scope: !1104, file: !907, line: 248, column: 7)
!1115 = !DILocalVariable(name: "exception", scope: !1113, file: !907, line: 249, type: !752)
!1116 = !DILocalVariable(name: "message", scope: !1117, file: !907, line: 253, type: !670)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !907, line: 253, column: 5)
!1118 = distinct !DILexicalBlock(scope: !1104, file: !907, line: 252, column: 7)
!1119 = !DILocalVariable(name: "exception", scope: !1117, file: !907, line: 253, type: !752)
!1120 = !DILocation(line: 0, scope: !1104)
!1121 = !DILocation(line: 246, column: 29, scope: !1104)
!1122 = !DILocation(line: 248, column: 18, scope: !1114)
!1123 = !DILocation(line: 248, column: 7, scope: !1104)
!1124 = !DILocation(line: 249, column: 5, scope: !1113)
!1125 = !DILocation(line: 0, scope: !1113)
!1126 = !DILocation(line: 250, column: 31, scope: !1104)
!1127 = !DILocation(line: 250, column: 16, scope: !1104)
!1128 = !{!987, !987, i64 0}
!1129 = !DILocation(line: 252, column: 21, scope: !1118)
!1130 = !DILocation(line: 252, column: 7, scope: !1104)
!1131 = !DILocation(line: 253, column: 5, scope: !1117)
!1132 = !DILocation(line: 0, scope: !1117)
!1133 = !DILocation(line: 254, column: 58, scope: !1104)
!1134 = !DILocation(line: 254, column: 10, scope: !1104)
!1135 = !DILocation(line: 255, column: 15, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !907, line: 255, column: 3)
!1137 = distinct !DILexicalBlock(scope: !1104, file: !907, line: 255, column: 3)
!1138 = !DILocation(line: 255, column: 3, scope: !1137)
!1139 = !DILocation(line: 257, column: 21, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1136, file: !907, line: 256, column: 3)
!1141 = !DILocation(line: 257, column: 5, scope: !1140)
!1142 = !DILocation(line: 257, column: 18, scope: !1140)
!1143 = !DILocation(line: 258, column: 20, scope: !1140)
!1144 = !DILocation(line: 258, column: 29, scope: !1140)
!1145 = !{!1146, !982, i64 80}
!1146 = !{!"_NexusInfo", !974, i64 0, !1147, i64 8, !983, i64 40, !987, i64 48, !987, i64 56, !974, i64 64, !987, i64 72, !982, i64 80}
!1147 = !{!"_RectangleInfo", !982, i64 0, !982, i64 8, !982, i64 16, !982, i64 24}
!1148 = !DILocation(line: 255, column: 44, scope: !1136)
!1149 = distinct !{!1149, !1138, !1150, !1151, !1152}
!1150 = !DILocation(line: 259, column: 3, scope: !1137)
!1151 = !{!"llvm.loop.mustprogress"}
!1152 = !{!"llvm.loop.unroll.disable"}
!1153 = !DILocation(line: 260, column: 3, scope: !1104)
!1154 = !DISubprogram(name: "GetEnvironmentValue", scope: !1085, file: !1085, line: 50, type: !1155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!670, !731}
!1157 = !DISubprogram(name: "IsStringTrue", scope: !1085, file: !1085, line: 71, type: !1158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!538, !731}
!1160 = !DISubprogram(name: "AllocateSemaphoreInfo", scope: !765, file: !765, line: 32, type: !1161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!763}
!1163 = !DISubprogram(name: "IsEventLogging", scope: !419, file: !419, line: 80, type: !1164, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!538}
!1166 = !DISubprogram(name: "AcquireAlignedMemory", scope: !1070, file: !1070, line: 38, type: !1071, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1167 = distinct !DISubprogram(name: "AcquirePixelCachePixels", scope: !907, file: !907, line: 291, type: !1168, scopeLine: 293, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1171)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!886, !626, !1170, !814}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!1171 = !{!1172, !1173, !1174, !1175}
!1172 = !DILocalVariable(name: "image", arg: 1, scope: !1167, file: !907, line: 291, type: !626)
!1173 = !DILocalVariable(name: "length", arg: 2, scope: !1167, file: !907, line: 292, type: !1170)
!1174 = !DILocalVariable(name: "exception", arg: 3, scope: !1167, file: !907, line: 292, type: !814)
!1175 = !DILocalVariable(name: "cache_info", scope: !1167, file: !907, line: 295, type: !925)
!1176 = !DILocation(line: 0, scope: !1167)
!1177 = !DILocation(line: 302, column: 35, scope: !1167)
!1178 = !{!1179, !987, i64 584}
!1179 = !{!"_Image", !974, i64 0, !974, i64 4, !974, i64 8, !982, i64 16, !974, i64 24, !974, i64 28, !974, i64 32, !982, i64 40, !982, i64 48, !982, i64 56, !982, i64 64, !987, i64 72, !1180, i64 80, !1180, i64 88, !1180, i64 96, !985, i64 104, !1182, i64 112, !974, i64 208, !987, i64 216, !974, i64 224, !987, i64 232, !987, i64 240, !987, i64 248, !982, i64 256, !985, i64 264, !985, i64 272, !1147, i64 280, !1147, i64 312, !1147, i64 344, !985, i64 376, !985, i64 384, !985, i64 392, !974, i64 400, !974, i64 404, !974, i64 408, !974, i64 412, !974, i64 416, !974, i64 420, !987, i64 424, !982, i64 432, !982, i64 440, !982, i64 448, !982, i64 456, !982, i64 464, !982, i64 472, !1184, i64 480, !1185, i64 504, !987, i64 568, !987, i64 576, !987, i64 584, !987, i64 592, !987, i64 600, !987, i64 608, !974, i64 616, !974, i64 4712, !974, i64 8808, !982, i64 12904, !982, i64 12912, !1187, i64 12920, !974, i64 12976, !982, i64 12984, !987, i64 12992, !1188, i64 13000, !1188, i64 13032, !987, i64 13064, !982, i64 13072, !982, i64 13080, !987, i64 13088, !987, i64 13096, !987, i64 13104, !974, i64 13112, !974, i64 13116, !1180, i64 13120, !987, i64 13128, !1147, i64 13136, !987, i64 13168, !987, i64 13176, !974, i64 13184, !974, i64 13188, !983, i64 13192, !974, i64 13200, !982, i64 13208, !982, i64 13216, !974, i64 13224, !982, i64 13232}
!1180 = !{!"_PixelPacket", !1181, i64 0, !1181, i64 2, !1181, i64 4, !1181, i64 6}
!1181 = !{!"short", !974, i64 0}
!1182 = !{!"_ChromaticityInfo", !1183, i64 0, !1183, i64 24, !1183, i64 48, !1183, i64 72}
!1183 = !{!"_PrimaryInfo", !985, i64 0, !985, i64 8, !985, i64 16}
!1184 = !{!"_ErrorInfo", !985, i64 0, !985, i64 8, !985, i64 16}
!1185 = !{!"_TimerInfo", !1186, i64 0, !1186, i64 24, !974, i64 48, !982, i64 56}
!1186 = !{!"_Timer", !985, i64 0, !985, i64 8, !985, i64 16}
!1187 = !{!"_ExceptionInfo", !974, i64 0, !973, i64 4, !987, i64 8, !987, i64 16, !987, i64 24, !974, i64 32, !987, i64 40, !982, i64 48}
!1188 = !{!"_ProfileInfo", !987, i64 0, !982, i64 8, !987, i64 16, !982, i64 24}
!1189 = !DILocation(line: 305, column: 10, scope: !1167)
!1190 = !{!983, !983, i64 0}
!1191 = !DILocation(line: 306, column: 20, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1167, file: !907, line: 306, column: 7)
!1193 = !DILocation(line: 306, column: 41, scope: !1192)
!1194 = !DILocation(line: 308, column: 23, scope: !1167)
!1195 = !{!981, !983, i64 56}
!1196 = !DILocation(line: 308, column: 10, scope: !1167)
!1197 = !DILocation(line: 309, column: 37, scope: !1167)
!1198 = !{!981, !987, i64 144}
!1199 = !DILocation(line: 309, column: 3, scope: !1167)
!1200 = !DILocation(line: 310, column: 1, scope: !1167)
!1201 = distinct !DISubprogram(name: "CacheComponentGenesis", scope: !907, file: !907, line: 330, type: !1164, scopeLine: 331, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1006)
!1202 = !DILocation(line: 332, column: 7, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1201, file: !907, line: 332, column: 7)
!1204 = !DILocation(line: 332, column: 23, scope: !1203)
!1205 = !DILocation(line: 332, column: 7, scope: !1201)
!1206 = !DILocation(line: 333, column: 21, scope: !1203)
!1207 = !DILocation(line: 333, column: 20, scope: !1203)
!1208 = !DILocation(line: 333, column: 5, scope: !1203)
!1209 = !DILocation(line: 334, column: 3, scope: !1201)
!1210 = distinct !DISubprogram(name: "CacheComponentTerminus", scope: !907, file: !907, line: 355, type: !1094, scopeLine: 356, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1006)
!1211 = !DILocation(line: 357, column: 7, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1210, file: !907, line: 357, column: 7)
!1213 = !DILocation(line: 357, column: 23, scope: !1212)
!1214 = !DILocation(line: 357, column: 7, scope: !1210)
!1215 = !DILocation(line: 358, column: 5, scope: !1212)
!1216 = !DILocation(line: 359, column: 21, scope: !1210)
!1217 = !DILocation(line: 359, column: 3, scope: !1210)
!1218 = !DILocation(line: 360, column: 20, scope: !1210)
!1219 = !{!974, !974, i64 0}
!1220 = !DILocation(line: 361, column: 23, scope: !1210)
!1221 = !DILocation(line: 361, column: 3, scope: !1210)
!1222 = !DILocation(line: 362, column: 3, scope: !1210)
!1223 = !DILocation(line: 363, column: 1, scope: !1210)
!1224 = !DISubprogram(name: "ActivateSemaphoreInfo", scope: !765, file: !765, line: 35, type: !1225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{null, !1227}
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!1228 = !DISubprogram(name: "LockSemaphoreInfo", scope: !765, file: !765, line: 37, type: !1229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{null, !763}
!1231 = !DISubprogram(name: "UnlockSemaphoreInfo", scope: !765, file: !765, line: 39, type: !1229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1232 = !DISubprogram(name: "DestroySemaphoreInfo", scope: !765, file: !765, line: 36, type: !1225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1233 = distinct !DISubprogram(name: "ClonePixelCache", scope: !907, file: !907, line: 493, type: !1234, scopeLine: 494, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1237)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!885, !1236}
!1236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!1237 = !{!1238, !1239, !1240}
!1238 = !DILocalVariable(name: "cache", arg: 1, scope: !1233, file: !907, line: 493, type: !1236)
!1239 = !DILocalVariable(name: "clone_info", scope: !1233, file: !907, line: 496, type: !925)
!1240 = !DILocalVariable(name: "cache_info", scope: !1233, file: !907, line: 499, type: !1241)
!1241 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !888)
!1242 = !DILocation(line: 0, scope: !1233)
!1243 = !DILocation(line: 504, column: 19, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1233, file: !907, line: 504, column: 7)
!1245 = !DILocation(line: 504, column: 25, scope: !1244)
!1246 = !DILocation(line: 504, column: 7, scope: !1233)
!1247 = !DILocation(line: 506, column: 19, scope: !1244)
!1248 = !DILocation(line: 505, column: 12, scope: !1244)
!1249 = !DILocation(line: 505, column: 5, scope: !1244)
!1250 = !DILocation(line: 507, column: 58, scope: !1233)
!1251 = !DILocation(line: 507, column: 28, scope: !1233)
!1252 = !DILocation(line: 508, column: 18, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1233, file: !907, line: 508, column: 7)
!1254 = !DILocation(line: 508, column: 7, scope: !1233)
!1255 = !DILocation(line: 510, column: 48, scope: !1233)
!1256 = !{!981, !974, i64 64}
!1257 = !DILocation(line: 510, column: 15, scope: !1233)
!1258 = !DILocation(line: 510, column: 35, scope: !1233)
!1259 = !DILocation(line: 511, column: 3, scope: !1233)
!1260 = !DILocation(line: 512, column: 1, scope: !1233)
!1261 = !DISubprogram(name: "LogMagickEvent", scope: !419, file: !419, line: 83, type: !1262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!538, !1264, !731, !731, !813, !731, null}
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !419, line: 58, baseType: !418)
!1266 = distinct !DISubprogram(name: "ClonePixelCacheMethods", scope: !907, file: !907, line: 539, type: !1267, scopeLine: 540, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1269)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{null, !885, !1236}
!1269 = !{!1270, !1271, !1272, !1273}
!1270 = !DILocalVariable(name: "clone", arg: 1, scope: !1266, file: !907, line: 539, type: !885)
!1271 = !DILocalVariable(name: "cache", arg: 2, scope: !1266, file: !907, line: 539, type: !1236)
!1272 = !DILocalVariable(name: "cache_info", scope: !1266, file: !907, line: 542, type: !925)
!1273 = !DILocalVariable(name: "source_info", scope: !1266, file: !907, line: 543, type: !925)
!1274 = !DILocation(line: 0, scope: !1266)
!1275 = !DILocation(line: 548, column: 20, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1266, file: !907, line: 548, column: 7)
!1277 = !DILocation(line: 548, column: 26, scope: !1276)
!1278 = !DILocation(line: 548, column: 7, scope: !1266)
!1279 = !DILocation(line: 550, column: 20, scope: !1276)
!1280 = !DILocation(line: 549, column: 12, scope: !1276)
!1281 = !DILocation(line: 549, column: 5, scope: !1276)
!1282 = !DILocation(line: 554, column: 16, scope: !1266)
!1283 = !DILocation(line: 554, column: 36, scope: !1266)
!1284 = !{i64 0, i64 8, !1128, i64 8, i64 8, !1128, i64 16, i64 8, !1128, i64 24, i64 8, !1128, i64 32, i64 8, !1128, i64 40, i64 8, !1128, i64 48, i64 8, !1128, i64 56, i64 8, !1128, i64 64, i64 8, !1128, i64 72, i64 8, !1128, i64 80, i64 8, !1128}
!1285 = !DILocation(line: 555, column: 1, scope: !1266)
!1286 = distinct !DISubprogram(name: "DestroyImagePixels", scope: !907, file: !907, line: 827, type: !863, scopeLine: 828, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1287)
!1287 = !{!1288, !1289}
!1288 = !DILocalVariable(name: "image", arg: 1, scope: !1286, file: !907, line: 827, type: !837)
!1289 = !DILocalVariable(name: "cache_info", scope: !1286, file: !907, line: 830, type: !925)
!1290 = !DILocation(line: 0, scope: !1286)
!1291 = !DILocation(line: 834, column: 14, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1286, file: !907, line: 834, column: 7)
!1293 = !{!1179, !974, i64 12976}
!1294 = !DILocation(line: 834, column: 20, scope: !1292)
!1295 = !DILocation(line: 834, column: 7, scope: !1286)
!1296 = !DILocation(line: 835, column: 68, scope: !1292)
!1297 = !DILocation(line: 835, column: 12, scope: !1292)
!1298 = !DILocation(line: 835, column: 5, scope: !1292)
!1299 = !DILocation(line: 837, column: 35, scope: !1286)
!1300 = !DILocation(line: 839, column: 27, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1286, file: !907, line: 839, column: 7)
!1302 = !{!981, !987, i64 8440}
!1303 = !DILocation(line: 839, column: 49, scope: !1301)
!1304 = !DILocation(line: 839, column: 7, scope: !1286)
!1305 = !DILocation(line: 841, column: 7, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1301, file: !907, line: 840, column: 5)
!1307 = !DILocation(line: 842, column: 7, scope: !1306)
!1308 = !DILocation(line: 844, column: 16, scope: !1286)
!1309 = !DILocation(line: 844, column: 15, scope: !1286)
!1310 = !DILocation(line: 845, column: 1, scope: !1286)
!1311 = distinct !DISubprogram(name: "DestroyPixelCache", scope: !907, file: !907, line: 936, type: !1312, scopeLine: 937, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1314)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!885, !885}
!1314 = !{!1315, !1316, !1317}
!1315 = !DILocalVariable(name: "cache", arg: 1, scope: !1311, file: !907, line: 936, type: !885)
!1316 = !DILocalVariable(name: "cache_info", scope: !1311, file: !907, line: 939, type: !925)
!1317 = !DILocalVariable(name: "message", scope: !1318, file: !907, line: 958, type: !610)
!1318 = distinct !DILexicalBlock(scope: !1319, file: !907, line: 956, column: 5)
!1319 = distinct !DILexicalBlock(scope: !1311, file: !907, line: 955, column: 7)
!1320 = !DILocation(line: 0, scope: !1311)
!1321 = !DILocation(line: 944, column: 19, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1311, file: !907, line: 944, column: 7)
!1323 = !DILocation(line: 944, column: 25, scope: !1322)
!1324 = !DILocation(line: 944, column: 7, scope: !1311)
!1325 = !DILocation(line: 946, column: 19, scope: !1322)
!1326 = !DILocation(line: 945, column: 12, scope: !1322)
!1327 = !DILocation(line: 945, column: 5, scope: !1322)
!1328 = !DILocation(line: 947, column: 33, scope: !1311)
!1329 = !DILocation(line: 947, column: 3, scope: !1311)
!1330 = !DILocation(line: 948, column: 15, scope: !1311)
!1331 = !DILocation(line: 948, column: 30, scope: !1311)
!1332 = !DILocation(line: 949, column: 35, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1311, file: !907, line: 949, column: 7)
!1334 = !DILocation(line: 949, column: 7, scope: !1311)
!1335 = !DILocation(line: 955, column: 19, scope: !1319)
!1336 = !DILocation(line: 955, column: 25, scope: !1319)
!1337 = !DILocation(line: 955, column: 7, scope: !1311)
!1338 = !DILocation(line: 957, column: 7, scope: !1318)
!1339 = !DILocation(line: 958, column: 9, scope: !1318)
!1340 = !DILocation(line: 961, column: 21, scope: !1318)
!1341 = !DILocation(line: 960, column: 14, scope: !1318)
!1342 = !DILocation(line: 962, column: 14, scope: !1318)
!1343 = !DILocation(line: 963, column: 5, scope: !1319)
!1344 = !DILocation(line: 963, column: 5, scope: !1318)
!1345 = !DILocation(line: 964, column: 3, scope: !1311)
!1346 = !DILocation(line: 965, column: 19, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1311, file: !907, line: 965, column: 7)
!1348 = !{!981, !987, i64 8464}
!1349 = !DILocation(line: 965, column: 31, scope: !1347)
!1350 = !DILocation(line: 965, column: 7, scope: !1311)
!1351 = !DILocation(line: 966, column: 29, scope: !1347)
!1352 = !DILocation(line: 966, column: 28, scope: !1347)
!1353 = !DILocation(line: 966, column: 5, scope: !1347)
!1354 = !DILocation(line: 968, column: 19, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1311, file: !907, line: 968, column: 7)
!1356 = !DILocation(line: 968, column: 30, scope: !1355)
!1357 = !DILocation(line: 968, column: 7, scope: !1311)
!1358 = !DILocation(line: 970, column: 19, scope: !1355)
!1359 = !DILocalVariable(name: "nexus_info", arg: 1, scope: !1360, file: !907, line: 1022, type: !568)
!1360 = distinct !DISubprogram(name: "DestroyPixelCacheNexus", scope: !907, file: !907, line: 1022, type: !1361, scopeLine: 1024, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1363)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!568, !568, !813}
!1363 = !{!1359, !1364, !1365}
!1364 = !DILocalVariable(name: "number_threads", arg: 2, scope: !1360, file: !907, line: 1023, type: !813)
!1365 = !DILocalVariable(name: "i", scope: !1360, file: !907, line: 1026, type: !581)
!1366 = !DILocation(line: 0, scope: !1360, inlinedAt: !1367)
!1367 = distinct !DILocation(line: 969, column: 28, scope: !1355)
!1368 = !DILocation(line: 1029, column: 15, scope: !1369, inlinedAt: !1367)
!1369 = distinct !DILexicalBlock(scope: !1370, file: !907, line: 1029, column: 3)
!1370 = distinct !DILexicalBlock(scope: !1360, file: !907, line: 1029, column: 3)
!1371 = !DILocation(line: 1029, column: 3, scope: !1370, inlinedAt: !1367)
!1372 = !DILocation(line: 1031, column: 9, scope: !1373, inlinedAt: !1367)
!1373 = distinct !DILexicalBlock(scope: !1374, file: !907, line: 1031, column: 9)
!1374 = distinct !DILexicalBlock(scope: !1369, file: !907, line: 1030, column: 3)
!1375 = !DILocation(line: 1031, column: 24, scope: !1373, inlinedAt: !1367)
!1376 = !{!1146, !987, i64 48}
!1377 = !DILocation(line: 1031, column: 30, scope: !1373, inlinedAt: !1367)
!1378 = !DILocation(line: 1031, column: 9, scope: !1374, inlinedAt: !1367)
!1379 = !DILocalVariable(name: "nexus_info", arg: 1, scope: !1380, file: !907, line: 1009, type: !569)
!1380 = distinct !DISubprogram(name: "RelinquishCacheNexusPixels", scope: !907, file: !907, line: 1009, type: !1381, scopeLine: 1010, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1383)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{null, !569}
!1383 = !{!1379}
!1384 = !DILocation(line: 0, scope: !1380, inlinedAt: !1385)
!1385 = distinct !DILocation(line: 1032, column: 7, scope: !1373, inlinedAt: !1367)
!1386 = !DILocation(line: 1011, column: 19, scope: !1387, inlinedAt: !1385)
!1387 = distinct !DILexicalBlock(scope: !1380, file: !907, line: 1011, column: 7)
!1388 = !{!1146, !974, i64 0}
!1389 = !DILocation(line: 1011, column: 26, scope: !1387, inlinedAt: !1385)
!1390 = !DILocation(line: 1011, column: 7, scope: !1380, inlinedAt: !1385)
!1391 = !DILocation(line: 1012, column: 12, scope: !1387, inlinedAt: !1385)
!1392 = !DILocation(line: 1012, column: 5, scope: !1387, inlinedAt: !1385)
!1393 = !DILocation(line: 1014, column: 61, scope: !1387, inlinedAt: !1385)
!1394 = !{!1146, !983, i64 40}
!1395 = !DILocation(line: 1014, column: 12, scope: !1387, inlinedAt: !1385)
!1396 = !DILocation(line: 1017, column: 15, scope: !1380, inlinedAt: !1385)
!1397 = !DILocation(line: 1017, column: 22, scope: !1380, inlinedAt: !1385)
!1398 = !{!1146, !987, i64 72}
!1399 = !DILocation(line: 1018, column: 15, scope: !1380, inlinedAt: !1385)
!1400 = !DILocation(line: 1019, column: 21, scope: !1380, inlinedAt: !1385)
!1401 = !DILocation(line: 1018, column: 21, scope: !1380, inlinedAt: !1385)
!1402 = !DILocation(line: 1033, column: 5, scope: !1374, inlinedAt: !1367)
!1403 = !DILocation(line: 1032, column: 7, scope: !1373, inlinedAt: !1367)
!1404 = !DILocation(line: 1033, column: 20, scope: !1374, inlinedAt: !1367)
!1405 = !DILocation(line: 1033, column: 29, scope: !1374, inlinedAt: !1367)
!1406 = !DILocation(line: 1029, column: 44, scope: !1369, inlinedAt: !1367)
!1407 = distinct !{!1407, !1371, !1408, !1151, !1152}
!1408 = !DILocation(line: 1034, column: 3, scope: !1370, inlinedAt: !1367)
!1409 = !DILocation(line: 1035, column: 54, scope: !1360, inlinedAt: !1367)
!1410 = !DILocation(line: 1035, column: 31, scope: !1360, inlinedAt: !1367)
!1411 = !DILocation(line: 1035, column: 16, scope: !1360, inlinedAt: !1367)
!1412 = !DILocation(line: 1036, column: 29, scope: !1360, inlinedAt: !1367)
!1413 = !DILocation(line: 969, column: 27, scope: !1355)
!1414 = !DILocation(line: 969, column: 5, scope: !1355)
!1415 = !DILocation(line: 971, column: 19, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1311, file: !907, line: 971, column: 7)
!1417 = !{!981, !987, i64 8448}
!1418 = !DILocation(line: 971, column: 31, scope: !1416)
!1419 = !DILocation(line: 971, column: 7, scope: !1311)
!1420 = !DILocation(line: 972, column: 29, scope: !1416)
!1421 = !DILocation(line: 972, column: 28, scope: !1416)
!1422 = !DILocation(line: 972, column: 5, scope: !1416)
!1423 = !DILocation(line: 973, column: 19, scope: !1424)
!1424 = distinct !DILexicalBlock(scope: !1311, file: !907, line: 973, column: 7)
!1425 = !DILocation(line: 973, column: 34, scope: !1424)
!1426 = !DILocation(line: 973, column: 7, scope: !1311)
!1427 = !DILocation(line: 974, column: 5, scope: !1424)
!1428 = !DILocation(line: 975, column: 19, scope: !1429)
!1429 = distinct !DILexicalBlock(scope: !1311, file: !907, line: 975, column: 7)
!1430 = !DILocation(line: 975, column: 29, scope: !1429)
!1431 = !DILocation(line: 975, column: 7, scope: !1311)
!1432 = !DILocation(line: 976, column: 5, scope: !1429)
!1433 = !DILocation(line: 977, column: 15, scope: !1311)
!1434 = !DILocation(line: 977, column: 24, scope: !1311)
!1435 = !DILocation(line: 978, column: 28, scope: !1311)
!1436 = !DILocation(line: 980, column: 3, scope: !1311)
!1437 = !DILocation(line: 981, column: 1, scope: !1311)
!1438 = !DISubprogram(name: "FormatLocaleString", scope: !1439, file: !1439, line: 71, type: !1440, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1439 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "156c27c5fb4b55284e5f6c924766571a")
!1440 = !DISubroutineType(types: !1441)
!1441 = !{!581, !1442, !813, !1443, null}
!1442 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !670)
!1443 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !731)
!1444 = distinct !DISubprogram(name: "RelinquishPixelCachePixels", scope: !907, file: !907, line: 885, type: !1445, scopeLine: 886, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1447)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{null, !520}
!1447 = !{!1448}
!1448 = !DILocalVariable(name: "cache_info", arg: 1, scope: !1444, file: !907, line: 885, type: !520)
!1449 = !DILocation(line: 0, scope: !1444)
!1450 = !DILocation(line: 887, column: 23, scope: !1444)
!1451 = !DILocation(line: 887, column: 3, scope: !1444)
!1452 = !DILocation(line: 891, column: 23, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1454, file: !907, line: 891, column: 11)
!1454 = distinct !DILexicalBlock(scope: !1455, file: !907, line: 890, column: 5)
!1455 = distinct !DILexicalBlock(scope: !1444, file: !907, line: 888, column: 3)
!1456 = !{!981, !974, i64 24}
!1457 = !DILocation(line: 891, column: 30, scope: !1453)
!1458 = !DILocation(line: 0, scope: !1453)
!1459 = !DILocation(line: 891, column: 11, scope: !1454)
!1460 = !DILocation(line: 892, column: 44, scope: !1453)
!1461 = !DILocation(line: 892, column: 9, scope: !1453)
!1462 = !DILocation(line: 896, column: 68, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1453, file: !907, line: 895, column: 9)
!1464 = !DILocation(line: 896, column: 18, scope: !1463)
!1465 = !DILocation(line: 899, column: 59, scope: !1454)
!1466 = !DILocation(line: 899, column: 7, scope: !1454)
!1467 = !DILocation(line: 900, column: 7, scope: !1454)
!1468 = !DILocation(line: 904, column: 36, scope: !1469)
!1469 = distinct !DILexicalBlock(scope: !1455, file: !907, line: 903, column: 5)
!1470 = !DILocation(line: 904, column: 64, scope: !1469)
!1471 = !DILocation(line: 904, column: 14, scope: !1469)
!1472 = !DILocation(line: 905, column: 25, scope: !1469)
!1473 = !DILocation(line: 906, column: 23, scope: !1474)
!1474 = distinct !DILexicalBlock(scope: !1469, file: !907, line: 906, column: 11)
!1475 = !DILocation(line: 906, column: 28, scope: !1474)
!1476 = !DILocation(line: 906, column: 11, scope: !1469)
!1477 = !DILocation(line: 907, column: 57, scope: !1474)
!1478 = !DILocation(line: 907, column: 16, scope: !1474)
!1479 = !DILocation(line: 907, column: 9, scope: !1474)
!1480 = !DILocation(line: 908, column: 20, scope: !1469)
!1481 = !DILocation(line: 908, column: 34, scope: !1469)
!1482 = !DILocation(line: 909, column: 56, scope: !1469)
!1483 = !DILocation(line: 909, column: 7, scope: !1469)
!1484 = !DILocation(line: 910, column: 5, scope: !1469)
!1485 = !DILocation(line: 913, column: 23, scope: !1486)
!1486 = distinct !DILexicalBlock(scope: !1487, file: !907, line: 913, column: 11)
!1487 = distinct !DILexicalBlock(scope: !1455, file: !907, line: 912, column: 5)
!1488 = !DILocation(line: 913, column: 28, scope: !1486)
!1489 = !DILocation(line: 913, column: 11, scope: !1487)
!1490 = !DILocalVariable(name: "cache_info", arg: 1, scope: !1491, file: !907, line: 870, type: !520)
!1491 = distinct !DISubprogram(name: "ClosePixelCacheOnDisk", scope: !907, file: !907, line: 870, type: !1492, scopeLine: 871, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1494)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!538, !520}
!1494 = !{!1490, !1495}
!1495 = !DILocalVariable(name: "status", scope: !1491, file: !907, line: 873, type: !445)
!1496 = !DILocation(line: 0, scope: !1491, inlinedAt: !1497)
!1497 = distinct !DILocation(line: 914, column: 16, scope: !1486)
!1498 = !DILocation(line: 878, column: 14, scope: !1499, inlinedAt: !1497)
!1499 = distinct !DILexicalBlock(scope: !1500, file: !907, line: 877, column: 5)
!1500 = distinct !DILexicalBlock(scope: !1491, file: !907, line: 876, column: 7)
!1501 = !DILocation(line: 879, column: 23, scope: !1499, inlinedAt: !1497)
!1502 = !DILocation(line: 880, column: 7, scope: !1499, inlinedAt: !1497)
!1503 = !DILocation(line: 914, column: 9, scope: !1486)
!1504 = !DILocation(line: 915, column: 23, scope: !1505)
!1505 = distinct !DILexicalBlock(scope: !1487, file: !907, line: 915, column: 11)
!1506 = !DILocation(line: 915, column: 28, scope: !1505)
!1507 = !DILocation(line: 915, column: 11, scope: !1487)
!1508 = !DILocation(line: 916, column: 57, scope: !1505)
!1509 = !DILocation(line: 916, column: 16, scope: !1505)
!1510 = !DILocation(line: 916, column: 9, scope: !1505)
!1511 = !DILocation(line: 917, column: 20, scope: !1487)
!1512 = !DILocation(line: 917, column: 34, scope: !1487)
!1513 = !DILocation(line: 918, column: 57, scope: !1487)
!1514 = !DILocation(line: 918, column: 7, scope: !1487)
!1515 = !DILocation(line: 919, column: 7, scope: !1487)
!1516 = !DILocation(line: 923, column: 20, scope: !1517)
!1517 = distinct !DILexicalBlock(scope: !1455, file: !907, line: 922, column: 5)
!1518 = !DILocation(line: 923, column: 34, scope: !1517)
!1519 = !DILocation(line: 925, column: 21, scope: !1517)
!1520 = !DILocation(line: 924, column: 14, scope: !1517)
!1521 = !DILocation(line: 926, column: 7, scope: !1517)
!1522 = !DILocation(line: 931, column: 19, scope: !1444)
!1523 = !DILocation(line: 932, column: 15, scope: !1444)
!1524 = !DILocation(line: 932, column: 21, scope: !1444)
!1525 = !DILocation(line: 933, column: 15, scope: !1444)
!1526 = !DILocation(line: 933, column: 22, scope: !1444)
!1527 = !{!981, !987, i64 152}
!1528 = !DILocation(line: 934, column: 1, scope: !1444)
!1529 = !DISubprogram(name: "DestroyDistributeCacheInfo", scope: !892, file: !892, line: 54, type: !1530, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!890, !890}
!1532 = !DILocation(line: 0, scope: !1360)
!1533 = !DILocation(line: 1029, column: 15, scope: !1369)
!1534 = !DILocation(line: 1029, column: 3, scope: !1370)
!1535 = !DILocation(line: 1031, column: 9, scope: !1373)
!1536 = !DILocation(line: 1031, column: 24, scope: !1373)
!1537 = !DILocation(line: 1031, column: 30, scope: !1373)
!1538 = !DILocation(line: 1031, column: 9, scope: !1374)
!1539 = !DILocation(line: 0, scope: !1380, inlinedAt: !1540)
!1540 = distinct !DILocation(line: 1032, column: 7, scope: !1373)
!1541 = !DILocation(line: 1011, column: 19, scope: !1387, inlinedAt: !1540)
!1542 = !DILocation(line: 1011, column: 26, scope: !1387, inlinedAt: !1540)
!1543 = !DILocation(line: 1011, column: 7, scope: !1380, inlinedAt: !1540)
!1544 = !DILocation(line: 1012, column: 12, scope: !1387, inlinedAt: !1540)
!1545 = !DILocation(line: 1012, column: 5, scope: !1387, inlinedAt: !1540)
!1546 = !DILocation(line: 1014, column: 61, scope: !1387, inlinedAt: !1540)
!1547 = !DILocation(line: 1014, column: 12, scope: !1387, inlinedAt: !1540)
!1548 = !DILocation(line: 1017, column: 15, scope: !1380, inlinedAt: !1540)
!1549 = !DILocation(line: 1017, column: 22, scope: !1380, inlinedAt: !1540)
!1550 = !DILocation(line: 1018, column: 15, scope: !1380, inlinedAt: !1540)
!1551 = !DILocation(line: 1019, column: 21, scope: !1380, inlinedAt: !1540)
!1552 = !DILocation(line: 1018, column: 21, scope: !1380, inlinedAt: !1540)
!1553 = !DILocation(line: 1033, column: 5, scope: !1374)
!1554 = !DILocation(line: 1032, column: 7, scope: !1373)
!1555 = !DILocation(line: 1033, column: 20, scope: !1374)
!1556 = !DILocation(line: 1033, column: 29, scope: !1374)
!1557 = !DILocation(line: 1029, column: 44, scope: !1369)
!1558 = distinct !{!1558, !1534, !1559, !1151, !1152}
!1559 = !DILocation(line: 1034, column: 3, scope: !1370)
!1560 = !DILocation(line: 1035, column: 54, scope: !1360)
!1561 = !DILocation(line: 1035, column: 31, scope: !1360)
!1562 = !DILocation(line: 1035, column: 16, scope: !1360)
!1563 = !DILocation(line: 1036, column: 29, scope: !1360)
!1564 = !DILocation(line: 1037, column: 3, scope: !1360)
!1565 = !DISubprogram(name: "DestroyRandomInfo", scope: !868, file: !868, line: 45, type: !1566, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{!866, !866}
!1568 = !DISubprogram(name: "RelinquishMagickMemory", scope: !1070, file: !1070, line: 51, type: !1569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!666, !666}
!1571 = !DISubprogram(name: "RelinquishAlignedMemory", scope: !1070, file: !1070, line: 50, type: !1569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1006)
!1572 = distinct !DISubprogram(name: "GetAuthenticIndexQueue", scope: !907, file: !907, line: 1105, type: !841, scopeLine: 1106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1573)
!1573 = !{!1574, !1575, !1576}
!1574 = !DILocalVariable(name: "image", arg: 1, scope: !1572, file: !907, line: 1105, type: !626)
!1575 = !DILocalVariable(name: "cache_info", scope: !1572, file: !907, line: 1108, type: !925)
!1576 = !DILocalVariable(name: "id", scope: !1572, file: !907, line: 1111, type: !1079)
!1577 = !DILocation(line: 0, scope: !1572)
!1578 = !DILocation(line: 1116, column: 35, scope: !1572)
!1579 = !DILocation(line: 1118, column: 27, scope: !1580)
!1580 = distinct !DILexicalBlock(scope: !1572, file: !907, line: 1118, column: 7)
!1581 = !{!981, !987, i64 8400}
!1582 = !DILocation(line: 1118, column: 62, scope: !1580)
!1583 = !DILocation(line: 1118, column: 7, scope: !1572)
!1584 = !DILocation(line: 1120, column: 12, scope: !1580)
!1585 = !DILocation(line: 1120, column: 5, scope: !1580)
