; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/encoder/cavlc.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/encoder/cavlc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.vlc_t = type { i8, i8 }
%struct.vlc_large_t = type { i16, i8, i8 }
%struct.x264_t = type { %struct.x264_param_t, [129 x ptr], i32, i32, i32, i32, i32, %struct.anon.2, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [92 x ptr], [92 x [4 x ptr]], ptr, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, ptr, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], ptr, [2 x [3 x ptr]], [2 x ptr], [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], ptr, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, ptr, [8 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "i_offsets", scope: !2, file: !3, line: 294, type: !1593, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "x264_macroblock_write_cavlc", scope: !3, file: !3, line: 290, type: !4, scopeLine: 291, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1323, retainedNodes: !1512)
!3 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/cavlc.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "75a5da4a09d0be3f3469f38c5a0088f2")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !8, line: 46, baseType: !9)
!8 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !10, line: 381, size: 266752, elements: !11)
!10 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!11 = !{!12, !192, !196, !197, !198, !199, !200, !201, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !337, !339, !367, !369, !370, !371, !377, !381, !382, !383, !390, !394, !395, !396, !401, !404, !405, !484, !501, !665, !666, !667, !668, !672, !673, !674, !675, !676, !677, !678, !693, !887, !891, !952, !955, !957, !959, !960, !963, !968, !977, !978, !986, !988, !993, !1069, !1155, !1199, !1221, !1270, !1299}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !9, file: !10, line: 384, baseType: !13, size: 5632)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !8, line: 376, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !8, line: 176, size: 5632, elements: !15)
!15 = !{!16, !18, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !61, !70, !71, !72, !73, !77, !78, !93, !94, !95, !96, !97, !128, !170, !171, !172, !173, !174, !175, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !14, file: !8, line: 179, baseType: !17, size: 32)
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !14, file: !8, line: 180, baseType: !19, size: 32, offset: 32)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !14, file: !8, line: 181, baseType: !19, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !14, file: !8, line: 182, baseType: !19, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !14, file: !8, line: 183, baseType: !19, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !14, file: !8, line: 186, baseType: !19, size: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !14, file: !8, line: 187, baseType: !19, size: 32, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !14, file: !8, line: 188, baseType: !19, size: 32, offset: 224)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !14, file: !8, line: 189, baseType: !19, size: 32, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !14, file: !8, line: 190, baseType: !19, size: 32, offset: 288)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !14, file: !8, line: 198, baseType: !19, size: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !14, file: !8, line: 215, baseType: !30, size: 288, offset: 352)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !8, line: 200, size: 288, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !30, file: !8, line: 203, baseType: !19, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !30, file: !8, line: 204, baseType: !19, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !30, file: !8, line: 206, baseType: !19, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !30, file: !8, line: 209, baseType: !19, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !30, file: !8, line: 210, baseType: !19, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !30, file: !8, line: 211, baseType: !19, size: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !30, file: !8, line: 212, baseType: !19, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !30, file: !8, line: 213, baseType: !19, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !30, file: !8, line: 214, baseType: !19, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !14, file: !8, line: 218, baseType: !19, size: 32, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !14, file: !8, line: 219, baseType: !19, size: 32, offset: 672)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !14, file: !8, line: 220, baseType: !19, size: 32, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !14, file: !8, line: 221, baseType: !19, size: 32, offset: 736)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !14, file: !8, line: 222, baseType: !19, size: 32, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !14, file: !8, line: 224, baseType: !19, size: 32, offset: 800)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !14, file: !8, line: 225, baseType: !19, size: 32, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !14, file: !8, line: 226, baseType: !19, size: 32, offset: 864)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !14, file: !8, line: 227, baseType: !19, size: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !14, file: !8, line: 229, baseType: !19, size: 32, offset: 928)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !14, file: !8, line: 230, baseType: !19, size: 32, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !14, file: !8, line: 231, baseType: !19, size: 32, offset: 992)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !14, file: !8, line: 233, baseType: !19, size: 32, offset: 1024)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !14, file: !8, line: 234, baseType: !19, size: 32, offset: 1056)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !14, file: !8, line: 236, baseType: !19, size: 32, offset: 1088)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !14, file: !8, line: 237, baseType: !19, size: 32, offset: 1120)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !14, file: !8, line: 239, baseType: !19, size: 32, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !14, file: !8, line: 240, baseType: !59, size: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !14, file: !8, line: 241, baseType: !62, size: 128, offset: 1280)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !68)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !64, line: 24, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !66, line: 38, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !{!69}
!69 = !DISubrange(count: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !14, file: !8, line: 242, baseType: !62, size: 128, offset: 1408)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !14, file: !8, line: 243, baseType: !62, size: 128, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !14, file: !8, line: 244, baseType: !62, size: 128, offset: 1664)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !14, file: !8, line: 245, baseType: !74, size: 512, offset: 1792)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !14, file: !8, line: 246, baseType: !74, size: 512, offset: 2304)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !14, file: !8, line: 249, baseType: !79, size: 64, offset: 2816)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !82, !19, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !87)
!87 = !{!88, !90, !91, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !86, file: !89, baseType: !17, size: 32)
!89 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/cavlc.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!90 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !86, file: !89, baseType: !17, size: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !86, file: !89, baseType: !82, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !86, file: !89, baseType: !82, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !14, file: !8, line: 250, baseType: !82, size: 64, offset: 2880)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !14, file: !8, line: 251, baseType: !19, size: 32, offset: 2944)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !14, file: !8, line: 252, baseType: !19, size: 32, offset: 2976)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !14, file: !8, line: 253, baseType: !59, size: 64, offset: 3008)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !14, file: !8, line: 287, baseType: !98, size: 800, offset: 3072)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !8, line: 256, size: 800, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !120, !121, !122, !126, !127}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !98, file: !8, line: 258, baseType: !17, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !98, file: !8, line: 259, baseType: !17, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !98, file: !8, line: 261, baseType: !19, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !98, file: !8, line: 262, baseType: !19, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !98, file: !8, line: 263, baseType: !19, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !98, file: !8, line: 264, baseType: !19, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !98, file: !8, line: 265, baseType: !19, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !98, file: !8, line: 267, baseType: !19, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !98, file: !8, line: 268, baseType: !19, size: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !98, file: !8, line: 269, baseType: !19, size: 32, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !98, file: !8, line: 270, baseType: !19, size: 32, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !98, file: !8, line: 271, baseType: !19, size: 32, offset: 352)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !98, file: !8, line: 272, baseType: !19, size: 32, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !98, file: !8, line: 273, baseType: !19, size: 32, offset: 416)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !98, file: !8, line: 274, baseType: !19, size: 32, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !98, file: !8, line: 275, baseType: !19, size: 32, offset: 480)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !98, file: !8, line: 276, baseType: !19, size: 32, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !98, file: !8, line: 277, baseType: !19, size: 32, offset: 544)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !98, file: !8, line: 278, baseType: !119, size: 32, offset: 576)
!119 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !98, file: !8, line: 279, baseType: !119, size: 32, offset: 608)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !98, file: !8, line: 280, baseType: !19, size: 32, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !98, file: !8, line: 283, baseType: !123, size: 64, offset: 672)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 2)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !98, file: !8, line: 285, baseType: !19, size: 32, offset: 736)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !98, file: !8, line: 286, baseType: !19, size: 32, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !14, file: !8, line: 327, baseType: !129, size: 1152, offset: 3904)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !8, line: 290, size: 1152, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !168, !169}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !129, file: !8, line: 292, baseType: !19, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !129, file: !8, line: 294, baseType: !19, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !129, file: !8, line: 295, baseType: !19, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !129, file: !8, line: 296, baseType: !19, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !129, file: !8, line: 297, baseType: !19, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !129, file: !8, line: 299, baseType: !19, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !129, file: !8, line: 300, baseType: !119, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !129, file: !8, line: 301, baseType: !119, size: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !129, file: !8, line: 302, baseType: !119, size: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !129, file: !8, line: 303, baseType: !19, size: 32, offset: 288)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !129, file: !8, line: 304, baseType: !19, size: 32, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !129, file: !8, line: 305, baseType: !119, size: 32, offset: 352)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !129, file: !8, line: 306, baseType: !119, size: 32, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !129, file: !8, line: 307, baseType: !119, size: 32, offset: 416)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !129, file: !8, line: 309, baseType: !19, size: 32, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !129, file: !8, line: 310, baseType: !119, size: 32, offset: 480)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !129, file: !8, line: 311, baseType: !19, size: 32, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !129, file: !8, line: 312, baseType: !19, size: 32, offset: 544)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !129, file: !8, line: 315, baseType: !19, size: 32, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !129, file: !8, line: 316, baseType: !59, size: 64, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !129, file: !8, line: 317, baseType: !19, size: 32, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !129, file: !8, line: 318, baseType: !59, size: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !129, file: !8, line: 321, baseType: !119, size: 32, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !129, file: !8, line: 322, baseType: !119, size: 32, offset: 864)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !129, file: !8, line: 323, baseType: !119, size: 32, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !129, file: !8, line: 324, baseType: !157, size: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !8, line: 174, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 167, size: 256, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !159, file: !8, line: 169, baseType: !19, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !159, file: !8, line: 169, baseType: !19, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !159, file: !8, line: 170, baseType: !19, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !159, file: !8, line: 171, baseType: !19, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !159, file: !8, line: 172, baseType: !119, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !159, file: !8, line: 173, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !129, file: !8, line: 325, baseType: !19, size: 32, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !129, file: !8, line: 326, baseType: !59, size: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !14, file: !8, line: 330, baseType: !19, size: 32, offset: 5056)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !14, file: !8, line: 331, baseType: !19, size: 32, offset: 5088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !14, file: !8, line: 332, baseType: !19, size: 32, offset: 5120)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !14, file: !8, line: 334, baseType: !19, size: 32, offset: 5152)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !14, file: !8, line: 335, baseType: !19, size: 32, offset: 5184)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !14, file: !8, line: 336, baseType: !176, size: 32, offset: 5216)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !64, line: 26, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !66, line: 42, baseType: !17)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !14, file: !8, line: 337, baseType: !176, size: 32, offset: 5248)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !14, file: !8, line: 338, baseType: !176, size: 32, offset: 5280)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !14, file: !8, line: 339, baseType: !176, size: 32, offset: 5312)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !14, file: !8, line: 340, baseType: !19, size: 32, offset: 5344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !14, file: !8, line: 344, baseType: !19, size: 32, offset: 5376)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !14, file: !8, line: 356, baseType: !19, size: 32, offset: 5408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !14, file: !8, line: 364, baseType: !19, size: 32, offset: 5440)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !14, file: !8, line: 367, baseType: !19, size: 32, offset: 5472)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !14, file: !8, line: 368, baseType: !19, size: 32, offset: 5504)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !14, file: !8, line: 369, baseType: !19, size: 32, offset: 5536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !14, file: !8, line: 375, baseType: !189, size: 64, offset: 5568)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !82}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !9, file: !10, line: 386, baseType: !193, size: 8256, offset: 5632)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8256, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 129)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !9, file: !10, line: 387, baseType: !19, size: 32, offset: 13888)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !9, file: !10, line: 388, baseType: !19, size: 32, offset: 13920)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !9, file: !10, line: 389, baseType: !19, size: 32, offset: 13952)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !9, file: !10, line: 390, baseType: !19, size: 32, offset: 13984)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !9, file: !10, line: 391, baseType: !19, size: 32, offset: 14016)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !9, file: !10, line: 402, baseType: !202, size: 576, offset: 14080)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !9, file: !10, line: 394, size: 576, elements: !203)
!203 = !{!204, !205, !206, !216, !217, !218}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !202, file: !10, line: 396, baseType: !19, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !202, file: !10, line: 397, baseType: !19, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !202, file: !10, line: 398, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !8, line: 604, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 593, size: 192, elements: !210)
!210 = !{!211, !212, !213, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !209, file: !8, line: 595, baseType: !19, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !209, file: !8, line: 596, baseType: !19, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !209, file: !8, line: 599, baseType: !19, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !209, file: !8, line: 603, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !202, file: !10, line: 399, baseType: !19, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !202, file: !10, line: 400, baseType: !215, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !202, file: !10, line: 401, baseType: !219, size: 320, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !220, line: 56, baseType: !221)
!220 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !220, line: 47, size: 320, elements: !222)
!222 = !{!223, !224, !225, !226, !230, !231}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !221, file: !220, line: 49, baseType: !215, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !221, file: !220, line: 50, baseType: !215, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !221, file: !220, line: 51, baseType: !215, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !221, file: !220, line: 53, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !228, line: 87, baseType: !229)
!228 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!229 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !221, file: !220, line: 54, baseType: !19, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !221, file: !220, line: 55, baseType: !19, size: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !9, file: !10, line: 404, baseType: !215, size: 64, offset: 14656)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !9, file: !10, line: 405, baseType: !19, size: 32, offset: 14720)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !9, file: !10, line: 410, baseType: !19, size: 32, offset: 14752)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !9, file: !10, line: 411, baseType: !19, size: 32, offset: 14784)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !9, file: !10, line: 413, baseType: !19, size: 32, offset: 14816)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !9, file: !10, line: 415, baseType: !19, size: 32, offset: 14848)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !9, file: !10, line: 416, baseType: !19, size: 32, offset: 14880)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !9, file: !10, line: 418, baseType: !19, size: 32, offset: 14912)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !9, file: !10, line: 419, baseType: !19, size: 32, offset: 14944)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !9, file: !10, line: 420, baseType: !19, size: 32, offset: 14976)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !9, file: !10, line: 421, baseType: !19, size: 32, offset: 15008)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !9, file: !10, line: 422, baseType: !19, size: 32, offset: 15040)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !9, file: !10, line: 424, baseType: !19, size: 32, offset: 15072)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !9, file: !10, line: 425, baseType: !19, size: 32, offset: 15104)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !9, file: !10, line: 427, baseType: !19, size: 32, offset: 15136)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !9, file: !10, line: 430, baseType: !248, size: 10400, offset: 15168)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 10400, elements: !335)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !250, line: 154, baseType: !251)
!250 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !250, line: 52, size: 10400, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !270, !271, !272, !273, !274, !275, !276, !277, !278, !285, !286, !334}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !251, file: !250, line: 54, baseType: !19, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !251, file: !250, line: 56, baseType: !19, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !251, file: !250, line: 57, baseType: !19, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !251, file: !250, line: 59, baseType: !19, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !251, file: !250, line: 60, baseType: !19, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !251, file: !250, line: 61, baseType: !19, size: 32, offset: 160)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !251, file: !250, line: 63, baseType: !19, size: 32, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !251, file: !250, line: 65, baseType: !19, size: 32, offset: 224)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !251, file: !250, line: 67, baseType: !19, size: 32, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !251, file: !250, line: 69, baseType: !19, size: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !251, file: !250, line: 70, baseType: !19, size: 32, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !251, file: !250, line: 71, baseType: !19, size: 32, offset: 352)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !251, file: !250, line: 72, baseType: !19, size: 32, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !251, file: !250, line: 73, baseType: !267, size: 8192, offset: 416)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8192, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !251, file: !250, line: 75, baseType: !19, size: 32, offset: 8608)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !251, file: !250, line: 76, baseType: !19, size: 32, offset: 8640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !251, file: !250, line: 77, baseType: !19, size: 32, offset: 8672)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !251, file: !250, line: 78, baseType: !19, size: 32, offset: 8704)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !251, file: !250, line: 79, baseType: !19, size: 32, offset: 8736)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !251, file: !250, line: 80, baseType: !19, size: 32, offset: 8768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !251, file: !250, line: 81, baseType: !19, size: 32, offset: 8800)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !251, file: !250, line: 83, baseType: !19, size: 32, offset: 8832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !251, file: !250, line: 90, baseType: !279, size: 128, offset: 8864)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !251, file: !250, line: 84, size: 128, elements: !280)
!280 = !{!281, !282, !283, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !279, file: !250, line: 86, baseType: !19, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !279, file: !250, line: 87, baseType: !19, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !279, file: !250, line: 88, baseType: !19, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !279, file: !250, line: 89, baseType: !19, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !251, file: !250, line: 92, baseType: !19, size: 32, offset: 8992)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !251, file: !250, line: 150, baseType: !287, size: 1344, offset: 9024)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !251, file: !250, line: 93, size: 1344, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !287, file: !250, line: 95, baseType: !19, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !287, file: !250, line: 96, baseType: !19, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !287, file: !250, line: 97, baseType: !19, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !287, file: !250, line: 99, baseType: !19, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !287, file: !250, line: 100, baseType: !19, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !287, file: !250, line: 102, baseType: !19, size: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !287, file: !250, line: 103, baseType: !19, size: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !287, file: !250, line: 104, baseType: !19, size: 32, offset: 224)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !287, file: !250, line: 105, baseType: !19, size: 32, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !287, file: !250, line: 106, baseType: !19, size: 32, offset: 288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !287, file: !250, line: 107, baseType: !19, size: 32, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !287, file: !250, line: 108, baseType: !19, size: 32, offset: 352)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !287, file: !250, line: 110, baseType: !19, size: 32, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !287, file: !250, line: 111, baseType: !19, size: 32, offset: 416)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !287, file: !250, line: 112, baseType: !19, size: 32, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !287, file: !250, line: 114, baseType: !19, size: 32, offset: 480)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !287, file: !250, line: 115, baseType: !176, size: 32, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !287, file: !250, line: 116, baseType: !176, size: 32, offset: 544)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !287, file: !250, line: 117, baseType: !19, size: 32, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !287, file: !250, line: 119, baseType: !19, size: 32, offset: 608)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !287, file: !250, line: 120, baseType: !19, size: 32, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !287, file: !250, line: 137, baseType: !311, size: 384, offset: 672)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !250, line: 122, size: 384, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !311, file: !250, line: 124, baseType: !19, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !311, file: !250, line: 125, baseType: !19, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !311, file: !250, line: 126, baseType: !19, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !311, file: !250, line: 127, baseType: !19, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !311, file: !250, line: 128, baseType: !19, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !311, file: !250, line: 129, baseType: !19, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !311, file: !250, line: 130, baseType: !19, size: 32, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !311, file: !250, line: 131, baseType: !19, size: 32, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !311, file: !250, line: 133, baseType: !19, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !311, file: !250, line: 134, baseType: !19, size: 32, offset: 288)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !311, file: !250, line: 135, baseType: !19, size: 32, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !311, file: !250, line: 136, baseType: !19, size: 32, offset: 352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !287, file: !250, line: 139, baseType: !19, size: 32, offset: 1056)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !287, file: !250, line: 140, baseType: !19, size: 32, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !287, file: !250, line: 141, baseType: !19, size: 32, offset: 1120)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !287, file: !250, line: 142, baseType: !19, size: 32, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !287, file: !250, line: 143, baseType: !19, size: 32, offset: 1184)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !287, file: !250, line: 144, baseType: !19, size: 32, offset: 1216)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !287, file: !250, line: 145, baseType: !19, size: 32, offset: 1248)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !287, file: !250, line: 146, baseType: !19, size: 32, offset: 1280)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !287, file: !250, line: 147, baseType: !19, size: 32, offset: 1312)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !251, file: !250, line: 152, baseType: !19, size: 32, offset: 10368)
!335 = !{!336}
!336 = !DISubrange(count: 1)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !9, file: !10, line: 431, baseType: !338, size: 64, offset: 25600)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !9, file: !10, line: 432, baseType: !340, size: 960, offset: 25664)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 960, elements: !335)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !250, line: 186, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !250, line: 156, size: 960, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !342, file: !250, line: 158, baseType: !19, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !342, file: !250, line: 159, baseType: !19, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !342, file: !250, line: 161, baseType: !19, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !342, file: !250, line: 163, baseType: !19, size: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !342, file: !250, line: 164, baseType: !19, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !342, file: !250, line: 166, baseType: !19, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !342, file: !250, line: 167, baseType: !19, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !342, file: !250, line: 169, baseType: !19, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !342, file: !250, line: 170, baseType: !19, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !342, file: !250, line: 172, baseType: !19, size: 32, offset: 288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !342, file: !250, line: 173, baseType: !19, size: 32, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !342, file: !250, line: 175, baseType: !19, size: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !342, file: !250, line: 177, baseType: !19, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !342, file: !250, line: 178, baseType: !19, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !342, file: !250, line: 179, baseType: !19, size: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !342, file: !250, line: 181, baseType: !19, size: 32, offset: 480)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !342, file: !250, line: 183, baseType: !19, size: 32, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !342, file: !250, line: 184, baseType: !362, size: 384, offset: 576)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 384, elements: !365)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!365 = !{!366}
!366 = !DISubrange(count: 6)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !9, file: !10, line: 433, baseType: !368, size: 64, offset: 26624)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !9, file: !10, line: 434, baseType: !19, size: 32, offset: 26688)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !9, file: !10, line: 437, baseType: !19, size: 32, offset: 26720)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !9, file: !10, line: 440, baseType: !372, size: 256, offset: 26752)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 256, elements: !375)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 512, elements: !68)
!375 = !{!376}
!376 = !DISubrange(count: 4)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !9, file: !10, line: 441, baseType: !378, size: 128, offset: 27008)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 128, elements: !124)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, elements: !75)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !9, file: !10, line: 443, baseType: !372, size: 256, offset: 27136)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !9, file: !10, line: 444, baseType: !378, size: 128, offset: 27392)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !9, file: !10, line: 446, baseType: !384, size: 256, offset: 27520)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 256, elements: !375)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 256, elements: !68)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !64, line: 25, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !66, line: 40, baseType: !389)
!389 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !9, file: !10, line: 447, baseType: !391, size: 128, offset: 27776)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 128, elements: !124)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 1024, elements: !75)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !9, file: !10, line: 448, baseType: !384, size: 256, offset: 27904)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !9, file: !10, line: 449, baseType: !391, size: 128, offset: 28160)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !9, file: !10, line: 454, baseType: !397, size: 5888, offset: 28288)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 5888, elements: !399)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!399 = !{!400}
!400 = !DISubrange(count: 92)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !9, file: !10, line: 455, baseType: !402, size: 23552, offset: 34176)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 23552, elements: !403)
!403 = !{!400, !376}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !9, file: !10, line: 457, baseType: !363, size: 64, offset: 57728)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !9, file: !10, line: 460, baseType: !406, size: 53376, offset: 57856)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !10, line: 364, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 302, size: 53376, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !437, !468, !469, !470, !476, !477, !478, !479, !480, !481, !482, !483}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !407, file: !10, line: 304, baseType: !338, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !407, file: !10, line: 305, baseType: !368, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !407, file: !10, line: 307, baseType: !19, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !407, file: !10, line: 308, baseType: !19, size: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !407, file: !10, line: 309, baseType: !19, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !407, file: !10, line: 311, baseType: !19, size: 32, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !407, file: !10, line: 313, baseType: !19, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !407, file: !10, line: 315, baseType: !19, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !407, file: !10, line: 316, baseType: !19, size: 32, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !407, file: !10, line: 317, baseType: !19, size: 32, offset: 352)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !407, file: !10, line: 319, baseType: !19, size: 32, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !407, file: !10, line: 321, baseType: !19, size: 32, offset: 416)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !407, file: !10, line: 322, baseType: !19, size: 32, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !407, file: !10, line: 324, baseType: !123, size: 64, offset: 480)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !407, file: !10, line: 325, baseType: !19, size: 32, offset: 544)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !407, file: !10, line: 327, baseType: !19, size: 32, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !407, file: !10, line: 329, baseType: !19, size: 32, offset: 608)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !407, file: !10, line: 330, baseType: !19, size: 32, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !407, file: !10, line: 331, baseType: !19, size: 32, offset: 672)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !407, file: !10, line: 333, baseType: !19, size: 32, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !407, file: !10, line: 334, baseType: !19, size: 32, offset: 736)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !407, file: !10, line: 339, baseType: !431, size: 2048, offset: 768)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 2048, elements: !436)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !10, line: 335, size: 64, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !432, file: !10, line: 337, baseType: !19, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !432, file: !10, line: 338, baseType: !19, size: 32, offset: 32)
!436 = !{!125, !69}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !407, file: !10, line: 342, baseType: !438, size: 49152, align: 128, offset: 2816)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 49152, align: 128, elements: !465)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !440, line: 36, baseType: !441, align: 128)
!440 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !440, line: 26, size: 512, elements: !442)
!442 = !{!443, !451, !452, !455, !456, !457}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !441, file: !440, line: 30, baseType: !444, size: 128, align: 128)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 128, elements: !449)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !446, line: 25, baseType: !447)
!446 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !66, line: 39, baseType: !448)
!448 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!449 = !{!450}
!450 = !DISubrange(count: 8)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !441, file: !440, line: 31, baseType: !444, size: 128, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !441, file: !440, line: 32, baseType: !453, size: 32, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !446, line: 26, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !66, line: 41, baseType: !19)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !441, file: !440, line: 33, baseType: !453, size: 32, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !441, file: !440, line: 34, baseType: !453, size: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !441, file: !440, line: 35, baseType: !458, size: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !440, line: 25, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !215, !19, !215, !19, !463, !19}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!465 = !{!466, !467}
!466 = !DISubrange(count: 32)
!467 = !DISubrange(count: 3)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !407, file: !10, line: 344, baseType: !19, size: 32, offset: 51968)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !407, file: !10, line: 345, baseType: !19, size: 32, offset: 52000)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !407, file: !10, line: 350, baseType: !471, size: 1024, offset: 52032)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 1024, elements: !68)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !10, line: 346, size: 64, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !472, file: !10, line: 348, baseType: !19, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !472, file: !10, line: 349, baseType: !19, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !407, file: !10, line: 352, baseType: !19, size: 32, offset: 53056)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !407, file: !10, line: 354, baseType: !19, size: 32, offset: 53088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !407, file: !10, line: 355, baseType: !19, size: 32, offset: 53120)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !407, file: !10, line: 356, baseType: !19, size: 32, offset: 53152)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !407, file: !10, line: 357, baseType: !19, size: 32, offset: 53184)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !407, file: !10, line: 360, baseType: !19, size: 32, offset: 53216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !407, file: !10, line: 361, baseType: !19, size: 32, offset: 53248)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !407, file: !10, line: 362, baseType: !19, size: 32, offset: 53280)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !9, file: !10, line: 463, baseType: !485, size: 4096, offset: 111232)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !486, line: 46, baseType: !487)
!486 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 27, size: 4096, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !487, file: !486, line: 30, baseType: !19, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !487, file: !486, line: 31, baseType: !19, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !487, file: !486, line: 34, baseType: !19, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !487, file: !486, line: 35, baseType: !19, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !487, file: !486, line: 37, baseType: !215, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !487, file: !486, line: 38, baseType: !215, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !487, file: !486, line: 39, baseType: !215, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !487, file: !486, line: 42, baseType: !19, size: 32, align: 128, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !487, file: !486, line: 45, baseType: !498, size: 3680, offset: 416)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 3680, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 460)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !9, file: !10, line: 494, baseType: !502, size: 2112, offset: 115328)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !9, file: !10, line: 465, size: 2112, elements: !503)
!503 = !{!504, !645, !647, !648, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !661, !662, !663, !664}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !502, file: !10, line: 468, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !508, line: 146, baseType: !509)
!508 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !508, line: 31, size: 125056, elements: !510)
!510 = !{!511, !512, !513, !514, !517, !518, !519, !520, !521, !522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !541, !542, !543, !544, !545, !546, !548, !550, !551, !552, !553, !554, !557, !559, !560, !562, !567, !568, !572, !573, !577, !581, !584, !586, !587, !589, !590, !592, !593, !594, !597, !599, !600, !601, !603, !604, !605, !606, !607, !608, !609, !610, !612, !613, !617, !626, !630, !632, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !509, file: !508, line: 34, baseType: !19, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !509, file: !508, line: 35, baseType: !19, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !509, file: !508, line: 36, baseType: !19, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !509, file: !508, line: 37, baseType: !515, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !446, line: 27, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !66, line: 44, baseType: !229)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !509, file: !508, line: 38, baseType: !515, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !509, file: !508, line: 39, baseType: !19, size: 32, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !509, file: !508, line: 40, baseType: !19, size: 32, offset: 288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !509, file: !508, line: 41, baseType: !19, size: 32, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !509, file: !508, line: 42, baseType: !19, size: 32, offset: 352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !509, file: !508, line: 43, baseType: !523, size: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !509, file: !508, line: 45, baseType: !19, size: 32, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !509, file: !508, line: 46, baseType: !19, size: 32, offset: 480)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !509, file: !508, line: 47, baseType: !19, size: 32, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !509, file: !508, line: 48, baseType: !19, size: 32, offset: 544)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !509, file: !508, line: 49, baseType: !19, size: 32, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !509, file: !508, line: 50, baseType: !19, size: 32, offset: 608)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !509, file: !508, line: 51, baseType: !19, size: 32, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !509, file: !508, line: 52, baseType: !63, size: 8, offset: 672)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !509, file: !508, line: 53, baseType: !63, size: 8, offset: 680)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !509, file: !508, line: 54, baseType: !63, size: 8, offset: 688)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !509, file: !508, line: 55, baseType: !119, size: 32, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !509, file: !508, line: 56, baseType: !119, size: 32, offset: 736)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !509, file: !508, line: 57, baseType: !19, size: 32, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !509, file: !508, line: 60, baseType: !19, size: 32, offset: 800)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !509, file: !508, line: 61, baseType: !539, size: 96, offset: 832)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !540)
!540 = !{!467}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !509, file: !508, line: 62, baseType: !539, size: 96, offset: 928)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !509, file: !508, line: 63, baseType: !539, size: 96, offset: 1024)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !509, file: !508, line: 64, baseType: !19, size: 32, offset: 1120)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !509, file: !508, line: 65, baseType: !19, size: 32, offset: 1152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !509, file: !508, line: 66, baseType: !19, size: 32, offset: 1184)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !509, file: !508, line: 67, baseType: !547, size: 192, offset: 1216)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 192, elements: !540)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !509, file: !508, line: 68, baseType: !549, size: 256, offset: 1408)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 256, elements: !375)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !509, file: !508, line: 69, baseType: !549, size: 256, offset: 1664)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !509, file: !508, line: 70, baseType: !398, size: 64, offset: 1920)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !509, file: !508, line: 74, baseType: !549, size: 256, offset: 1984)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !509, file: !508, line: 75, baseType: !549, size: 256, offset: 2240)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !509, file: !508, line: 77, baseType: !555, size: 24576, align: 128, offset: 2560)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 24576, align: 128, elements: !556)
!556 = !{!69, !467}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !509, file: !508, line: 78, baseType: !558, size: 1024, offset: 27136)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 1024, elements: !68)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !509, file: !508, line: 79, baseType: !19, size: 32, offset: 28160)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !509, file: !508, line: 80, baseType: !561, size: 64, offset: 28224)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !509, file: !508, line: 83, baseType: !563, size: 64, offset: 28288)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !446, line: 24, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !66, line: 37, baseType: !566)
!566 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !509, file: !508, line: 84, baseType: !215, size: 64, offset: 28352)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !509, file: !508, line: 85, baseType: !569, size: 128, offset: 28416)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 128, elements: !124)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 32, elements: !124)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !509, file: !508, line: 86, baseType: !570, size: 64, offset: 28544)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !509, file: !508, line: 87, baseType: !574, size: 2176, offset: 28608)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 2176, elements: !575)
!575 = !{!125, !576}
!576 = !DISubrange(count: 17)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !509, file: !508, line: 92, baseType: !578, size: 20736, offset: 30784)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 20736, elements: !579)
!579 = !{!580, !580}
!580 = !DISubrange(count: 18)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !509, file: !508, line: 96, baseType: !582, size: 2176, offset: 51520)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 2176, elements: !575)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !509, file: !508, line: 97, baseType: !585, size: 128, offset: 53696)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 128, elements: !124)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !509, file: !508, line: 98, baseType: !123, size: 64, offset: 53824)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !509, file: !508, line: 99, baseType: !588, size: 1024, offset: 53888)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1024, elements: !436)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !509, file: !508, line: 100, baseType: !571, size: 32, offset: 54912)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !509, file: !508, line: 105, baseType: !591, size: 10368, offset: 54944)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 10368, elements: !579)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !509, file: !508, line: 106, baseType: !591, size: 10368, offset: 65312)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !509, file: !508, line: 107, baseType: !19, size: 32, offset: 75680)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !509, file: !508, line: 108, baseType: !595, size: 576, offset: 75712)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 576, elements: !596)
!596 = !{!580}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !509, file: !508, line: 109, baseType: !598, size: 20736, offset: 76288)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 20736, elements: !579)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !509, file: !508, line: 110, baseType: !583, size: 64, offset: 97024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !509, file: !508, line: 111, baseType: !583, size: 64, offset: 97088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !509, file: !508, line: 112, baseType: !602, size: 64, offset: 97152)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !509, file: !508, line: 113, baseType: !602, size: 64, offset: 97216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !509, file: !508, line: 114, baseType: !602, size: 64, offset: 97280)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !509, file: !508, line: 115, baseType: !19, size: 32, offset: 97344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !509, file: !508, line: 116, baseType: !398, size: 64, offset: 97408)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !509, file: !508, line: 117, baseType: !398, size: 64, offset: 97472)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !509, file: !508, line: 118, baseType: !398, size: 64, offset: 97536)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !509, file: !508, line: 119, baseType: !19, size: 32, offset: 97600)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !509, file: !508, line: 120, baseType: !611, size: 576, offset: 97632)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 576, elements: !596)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !509, file: !508, line: 121, baseType: !176, size: 32, offset: 98208)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !509, file: !508, line: 122, baseType: !614, size: 64, offset: 98240)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !64, line: 27, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !66, line: 45, baseType: !616)
!616 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !509, file: !508, line: 125, baseType: !618, size: 256, offset: 98304)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !8, line: 503, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 496, size: 256, elements: !620)
!620 = !{!621, !623, !624, !625}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !619, file: !8, line: 498, baseType: !622, size: 64)
!622 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !619, file: !8, line: 499, baseType: !622, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !619, file: !8, line: 500, baseType: !622, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !619, file: !8, line: 502, baseType: !622, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !509, file: !508, line: 128, baseType: !627, size: 2008, offset: 98560)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2008, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 251)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !509, file: !508, line: 129, baseType: !631, size: 8032, offset: 100576)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8032, elements: !628)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !509, file: !508, line: 130, baseType: !633, size: 16064, offset: 108608)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 16064, elements: !628)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !509, file: !508, line: 131, baseType: !19, size: 32, offset: 124672)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !509, file: !508, line: 132, baseType: !19, size: 32, offset: 124704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !509, file: !508, line: 135, baseType: !19, size: 32, offset: 124736)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !509, file: !508, line: 136, baseType: !19, size: 32, offset: 124768)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !509, file: !508, line: 137, baseType: !19, size: 32, offset: 124800)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !509, file: !508, line: 138, baseType: !19, size: 32, offset: 124832)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !509, file: !508, line: 139, baseType: !19, size: 32, offset: 124864)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !509, file: !508, line: 142, baseType: !119, size: 32, offset: 124896)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !509, file: !508, line: 143, baseType: !19, size: 32, offset: 124928)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !509, file: !508, line: 144, baseType: !19, size: 32, offset: 124960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !509, file: !508, line: 145, baseType: !19, size: 32, offset: 124992)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !502, file: !10, line: 470, baseType: !646, size: 128, offset: 64)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 128, elements: !124)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !502, file: !10, line: 473, baseType: !505, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !502, file: !10, line: 476, baseType: !649, size: 1152, offset: 256)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 1152, elements: !596)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !502, file: !10, line: 478, baseType: !19, size: 32, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !502, file: !10, line: 480, baseType: !19, size: 32, offset: 1440)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !502, file: !10, line: 482, baseType: !19, size: 32, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !502, file: !10, line: 483, baseType: !19, size: 32, offset: 1504)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !502, file: !10, line: 484, baseType: !19, size: 32, offset: 1536)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !502, file: !10, line: 485, baseType: !19, size: 32, offset: 1568)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !502, file: !10, line: 486, baseType: !19, size: 32, offset: 1600)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !502, file: !10, line: 487, baseType: !515, size: 64, offset: 1664)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !502, file: !10, line: 488, baseType: !515, size: 64, offset: 1728)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !502, file: !10, line: 489, baseType: !660, size: 128, offset: 1792)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 128, elements: !124)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !502, file: !10, line: 490, baseType: !515, size: 64, offset: 1920)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !502, file: !10, line: 491, baseType: !515, size: 64, offset: 1984)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !502, file: !10, line: 492, baseType: !19, size: 32, offset: 2048)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !502, file: !10, line: 493, baseType: !19, size: 32, offset: 2080)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !9, file: !10, line: 497, baseType: !506, size: 64, offset: 117440)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !9, file: !10, line: 500, baseType: !506, size: 64, offset: 117504)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !9, file: !10, line: 503, baseType: !19, size: 32, offset: 117568)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !9, file: !10, line: 504, baseType: !669, size: 1216, offset: 117632)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 1216, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 19)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !9, file: !10, line: 505, baseType: !19, size: 32, offset: 118848)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !9, file: !10, line: 506, baseType: !669, size: 1216, offset: 118912)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !9, file: !10, line: 507, baseType: !123, size: 64, offset: 120128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !9, file: !10, line: 510, baseType: !19, size: 32, offset: 120192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !9, file: !10, line: 511, baseType: !19, size: 32, offset: 120224)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !9, file: !10, line: 512, baseType: !515, size: 64, offset: 120256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !9, file: !10, line: 522, baseType: !679, size: 10624, offset: 120320)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !9, file: !10, line: 515, size: 10624, elements: !680)
!680 = !{!681, !683, !686, !689}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !679, file: !10, line: 517, baseType: !682, size: 256, align: 128)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 256, elements: !68)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !679, file: !10, line: 518, baseType: !684, size: 128, align: 128, offset: 256)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 128, elements: !685)
!685 = !{!125, !376}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !679, file: !10, line: 520, baseType: !687, size: 4096, align: 128, offset: 384)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 4096, elements: !688)
!688 = !{!376, !76}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !679, file: !10, line: 521, baseType: !690, size: 6144, align: 128, offset: 4480)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 6144, elements: !691)
!691 = !{!692, !69}
!692 = !DISubrange(count: 24)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !9, file: !10, line: 732, baseType: !694, size: 82688, offset: 130944)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !9, file: !10, line: 525, size: 82688, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !723, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !741, !744, !748, !749, !750, !755, !756, !759, !760, !761, !762, !763, !764, !765, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !825, !856, !857, !858, !859, !860, !861, !862, !863, !864, !867, !868, !869, !872, !875, !877, !880, !882, !883}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !694, file: !10, line: 527, baseType: !19, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !694, file: !10, line: 530, baseType: !19, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !694, file: !10, line: 531, baseType: !19, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !694, file: !10, line: 532, baseType: !19, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !694, file: !10, line: 535, baseType: !19, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !694, file: !10, line: 536, baseType: !19, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !694, file: !10, line: 537, baseType: !19, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !694, file: !10, line: 538, baseType: !19, size: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !694, file: !10, line: 539, baseType: !19, size: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !694, file: !10, line: 542, baseType: !19, size: 32, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !694, file: !10, line: 543, baseType: !19, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !694, file: !10, line: 544, baseType: !19, size: 32, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !694, file: !10, line: 545, baseType: !19, size: 32, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !694, file: !10, line: 546, baseType: !19, size: 32, offset: 416)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !694, file: !10, line: 547, baseType: !19, size: 32, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !694, file: !10, line: 548, baseType: !19, size: 32, offset: 480)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !694, file: !10, line: 549, baseType: !19, size: 32, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !694, file: !10, line: 551, baseType: !19, size: 32, offset: 544)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !694, file: !10, line: 554, baseType: !123, size: 64, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !694, file: !10, line: 555, baseType: !123, size: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !694, file: !10, line: 558, baseType: !123, size: 64, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !694, file: !10, line: 559, baseType: !123, size: 64, offset: 768)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !694, file: !10, line: 561, baseType: !123, size: 64, offset: 832)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !694, file: !10, line: 562, baseType: !123, size: 64, offset: 896)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !694, file: !10, line: 565, baseType: !17, size: 32, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !694, file: !10, line: 566, baseType: !722, size: 128, offset: 992)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !375)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !694, file: !10, line: 567, baseType: !724, size: 512, offset: 1120)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 512, elements: !68)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !694, file: !10, line: 568, baseType: !17, size: 32, offset: 1632)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !694, file: !10, line: 569, baseType: !17, size: 32, offset: 1664)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !694, file: !10, line: 570, baseType: !19, size: 32, offset: 1696)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !694, file: !10, line: 571, baseType: !19, size: 32, offset: 1728)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !694, file: !10, line: 572, baseType: !19, size: 32, offset: 1760)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !694, file: !10, line: 573, baseType: !19, size: 32, offset: 1792)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !694, file: !10, line: 574, baseType: !19, size: 32, offset: 1824)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !694, file: !10, line: 575, baseType: !19, size: 32, offset: 1856)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !694, file: !10, line: 576, baseType: !19, size: 32, offset: 1888)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !694, file: !10, line: 577, baseType: !19, size: 32, offset: 1920)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !694, file: !10, line: 578, baseType: !19, size: 32, offset: 1952)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !10, line: 585, baseType: !563, size: 64, offset: 1984)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !694, file: !10, line: 586, baseType: !215, size: 64, offset: 2048)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !694, file: !10, line: 587, baseType: !563, size: 64, offset: 2112)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !694, file: !10, line: 588, baseType: !740, size: 64, offset: 2176)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !694, file: !10, line: 589, baseType: !742, size: 64, offset: 2240)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 64, elements: !449)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !694, file: !10, line: 591, baseType: !745, size: 64, offset: 2304)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 192, elements: !747)
!747 = !{!692}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !694, file: !10, line: 592, baseType: !563, size: 64, offset: 2368)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !694, file: !10, line: 593, baseType: !569, size: 128, offset: 2432)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !694, file: !10, line: 594, baseType: !751, size: 128, offset: 2560)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 128, elements: !124)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !754)
!754 = !{!450, !125}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !694, file: !10, line: 595, baseType: !585, size: 128, offset: 2688)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !694, file: !10, line: 596, baseType: !757, size: 4096, offset: 2816)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 4096, elements: !758)
!758 = !{!125, !466}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !694, file: !10, line: 597, baseType: !563, size: 64, offset: 6912)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !694, file: !10, line: 598, baseType: !563, size: 64, offset: 6976)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !694, file: !10, line: 599, baseType: !398, size: 64, offset: 7040)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !694, file: !10, line: 603, baseType: !558, size: 1024, offset: 7104)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !694, file: !10, line: 606, baseType: !19, size: 32, offset: 8128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !694, file: !10, line: 607, baseType: !19, size: 32, offset: 8160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !694, file: !10, line: 608, baseType: !766, size: 32, align: 32, offset: 8192)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 32, elements: !375)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !694, file: !10, line: 609, baseType: !19, size: 32, offset: 8224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !694, file: !10, line: 611, baseType: !19, size: 32, offset: 8256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !694, file: !10, line: 612, baseType: !19, size: 32, offset: 8288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !694, file: !10, line: 614, baseType: !19, size: 32, offset: 8320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !694, file: !10, line: 615, baseType: !19, size: 32, offset: 8352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !694, file: !10, line: 621, baseType: !19, size: 32, offset: 8384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !694, file: !10, line: 624, baseType: !19, size: 32, offset: 8416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !694, file: !10, line: 626, baseType: !19, size: 32, offset: 8448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !694, file: !10, line: 627, baseType: !19, size: 32, offset: 8480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !694, file: !10, line: 671, baseType: !777, size: 60672, offset: 8576)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !694, file: !10, line: 629, size: 60672, elements: !778)
!778 = !{!779, !783, !787, !789, !790, !793, !797, !799, !800, !801, !802, !803, !806, !810, !813, !814, !815, !816, !817, !820, !822, !824}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !777, file: !10, line: 634, baseType: !780, size: 3072, align: 128)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 3072, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !777, file: !10, line: 635, baseType: !784, size: 6912, align: 128, offset: 3072)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 6912, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 864)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !777, file: !10, line: 638, baseType: !788, size: 2048, align: 128, offset: 9984)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2048, elements: !268)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !777, file: !10, line: 639, baseType: !788, size: 2048, align: 128, offset: 12032)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !777, file: !10, line: 640, baseType: !791, size: 3072, align: 128, offset: 14080)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 3072, elements: !792)
!792 = !{!467, !76}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !777, file: !10, line: 641, baseType: !794, size: 3840, align: 128, offset: 17152)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 3840, elements: !795)
!795 = !{!796, !69}
!796 = !DISubrange(count: 15)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !777, file: !10, line: 642, baseType: !798, size: 128, offset: 20992)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !375)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !777, file: !10, line: 643, baseType: !798, size: 128, offset: 21120)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !777, file: !10, line: 644, baseType: !19, size: 32, offset: 21248)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !777, file: !10, line: 645, baseType: !19, size: 32, offset: 21280)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !777, file: !10, line: 648, baseType: !687, size: 4096, align: 128, offset: 21376)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !777, file: !10, line: 649, baseType: !804, size: 4096, align: 128, offset: 25472)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 4096, elements: !805)
!805 = !{!69, !69}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_hadamard_cache", scope: !777, file: !10, line: 652, baseType: !807, size: 576, align: 128, offset: 29568)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 576, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 9)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_cache", scope: !777, file: !10, line: 653, baseType: !811, size: 1024, align: 128, offset: 30208)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 1024, elements: !812)
!812 = !{!466}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !777, file: !10, line: 656, baseType: !547, size: 192, offset: 31232)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !777, file: !10, line: 658, baseType: !547, size: 192, offset: 31424)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !777, file: !10, line: 661, baseType: !547, size: 192, offset: 31616)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !777, file: !10, line: 664, baseType: !123, size: 64, offset: 31808)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !777, file: !10, line: 665, baseType: !818, size: 24576, offset: 31872)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 24576, elements: !819)
!819 = !{!125, !466, !366}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref_w", scope: !777, file: !10, line: 666, baseType: !821, size: 2048, offset: 56448)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 2048, elements: !812)
