; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/channel.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/channel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 177, baseType: !5, size: 32, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!370 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!371 = !DIEnumerator(name: "RedChannel", value: 1)
!372 = !DIEnumerator(name: "GrayChannel", value: 1)
!373 = !DIEnumerator(name: "CyanChannel", value: 1)
!374 = !DIEnumerator(name: "GreenChannel", value: 2)
!375 = !DIEnumerator(name: "MagentaChannel", value: 2)
!376 = !DIEnumerator(name: "BlueChannel", value: 4)
!377 = !DIEnumerator(name: "YellowChannel", value: 4)
!378 = !DIEnumerator(name: "AlphaChannel", value: 8)
!379 = !DIEnumerator(name: "OpacityChannel", value: 8)
!380 = !DIEnumerator(name: "MatteChannel", value: 8)
!381 = !DIEnumerator(name: "BlackChannel", value: 32)
!382 = !DIEnumerator(name: "IndexChannel", value: 32)
!383 = !DIEnumerator(name: "CompositeChannels", value: 47)
!384 = !DIEnumerator(name: "AllChannels", value: 134217727)
!385 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!386 = !DIEnumerator(name: "RGBChannels", value: 128)
!387 = !DIEnumerator(name: "GrayChannels", value: 128)
!388 = !DIEnumerator(name: "SyncChannels", value: 256)
!389 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !391, line: 34, baseType: !5, size: 32, elements: !392)
!391 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!393 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!394 = !DIEnumerator(name: "NoEvents", value: 0)
!395 = !DIEnumerator(name: "TraceEvent", value: 1)
!396 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!397 = !DIEnumerator(name: "BlobEvent", value: 4)
!398 = !DIEnumerator(name: "CacheEvent", value: 8)
!399 = !DIEnumerator(name: "CoderEvent", value: 16)
!400 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!401 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!402 = !DIEnumerator(name: "DrawEvent", value: 128)
!403 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!404 = !DIEnumerator(name: "ImageEvent", value: 512)
!405 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!406 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!407 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!408 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!409 = !DIEnumerator(name: "TransformEvent", value: 16384)
!410 = !DIEnumerator(name: "UserEvent", value: 36864)
!411 = !DIEnumerator(name: "WandEvent", value: 65536)
!412 = !DIEnumerator(name: "X11Event", value: 131072)
!413 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!414 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!417 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!418 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!419 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!420 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!421 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!422 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!423 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!424 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!425 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!426 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!427 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!428 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!429 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!430 = !{!431, !432, !487, !496, !455, !653, !460, !655, !656, !560, !657, !469, !659}
!431 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !435)
!435 = !{!436, !438, !440, !442, !445, !447, !449, !450, !451, !452, !453, !454, !465, !466, !467, !468, !470, !484, !486, !488, !490, !493, !494, !495, !501, !502, !503, !511, !512, !513, !514, !515, !516, !518, !520, !522, !524, !526, !528, !530, !531, !532, !533, !534, !535, !536, !544, !559, !573, !574, !575, !576, !580, !584, !588, !589, !590, !591, !592, !610, !611, !613, !614, !624, !625, !627, !628, !629, !630, !631, !632, !634, !635, !636, !637, !638, !639, !640, !642, !643, !644, !645, !646, !650, !652}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !434, file: !73, line: 153, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !434, file: !73, line: 156, baseType: !439, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !434, file: !73, line: 159, baseType: !441, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !434, file: !73, line: 162, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !444, line: 46, baseType: !431)
!444 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!445 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !434, file: !73, line: 165, baseType: !446, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !434, file: !73, line: 168, baseType: !448, size: 32, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !434, file: !73, line: 169, baseType: !448, size: 32, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !434, file: !73, line: 172, baseType: !443, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !434, file: !73, line: 173, baseType: !443, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !434, file: !73, line: 174, baseType: !443, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !434, file: !73, line: 175, baseType: !443, size: 64, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !434, file: !73, line: 178, baseType: !455, size: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !458)
!458 = !{!459, !462, !463, !464}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !457, file: !326, line: 143, baseType: !460, size: 16)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !461)
!461 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !457, file: !326, line: 144, baseType: !460, size: 16, offset: 16)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !457, file: !326, line: 145, baseType: !460, size: 16, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !457, file: !326, line: 146, baseType: !460, size: 16, offset: 48)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !434, file: !73, line: 179, baseType: !456, size: 64, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !434, file: !73, line: 180, baseType: !456, size: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !434, file: !73, line: 181, baseType: !456, size: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !434, file: !73, line: 184, baseType: !469, size: 64, offset: 832)
!469 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !434, file: !73, line: 187, baseType: !471, size: 768, offset: 896)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !473)
!473 = !{!474, !481, !482, !483}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !472, file: !73, line: 124, baseType: !475, size: 192)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !476, file: !73, line: 98, baseType: !469, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !476, file: !73, line: 99, baseType: !469, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !476, file: !73, line: 100, baseType: !469, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !472, file: !73, line: 125, baseType: !475, size: 192, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !472, file: !73, line: 126, baseType: !475, size: 192, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !472, file: !73, line: 127, baseType: !475, size: 192, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !434, file: !73, line: 190, baseType: !485, size: 32, offset: 1664)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !434, file: !73, line: 193, baseType: !487, size: 64, offset: 1728)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !434, file: !73, line: 196, baseType: !489, size: 32, offset: 1792)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !434, file: !73, line: 199, baseType: !491, size: 64, offset: 1856)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !434, file: !73, line: 200, baseType: !491, size: 64, offset: 1920)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !434, file: !73, line: 201, baseType: !491, size: 64, offset: 1984)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !434, file: !73, line: 204, baseType: !496, size: 64, offset: 2048)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !497, line: 77, baseType: !498)
!497 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !499, line: 193, baseType: !500)
!499 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!500 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !434, file: !73, line: 207, baseType: !469, size: 64, offset: 2112)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !434, file: !73, line: 208, baseType: !469, size: 64, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !434, file: !73, line: 211, baseType: !504, size: 256, offset: 2240)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !505, file: !153, line: 124, baseType: !443, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !505, file: !153, line: 125, baseType: !443, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !505, file: !153, line: 128, baseType: !496, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !505, file: !153, line: 129, baseType: !496, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !434, file: !73, line: 212, baseType: !504, size: 256, offset: 2496)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !434, file: !73, line: 213, baseType: !504, size: 256, offset: 2752)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !434, file: !73, line: 216, baseType: !469, size: 64, offset: 3008)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !434, file: !73, line: 217, baseType: !469, size: 64, offset: 3072)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !434, file: !73, line: 218, baseType: !469, size: 64, offset: 3136)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !434, file: !73, line: 221, baseType: !517, size: 32, offset: 3200)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !434, file: !73, line: 224, baseType: !519, size: 32, offset: 3232)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !434, file: !73, line: 227, baseType: !521, size: 32, offset: 3264)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !434, file: !73, line: 230, baseType: !523, size: 32, offset: 3296)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !434, file: !73, line: 233, baseType: !525, size: 32, offset: 3328)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !434, file: !73, line: 236, baseType: !527, size: 32, offset: 3360)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !434, file: !73, line: 239, baseType: !529, size: 64, offset: 3392)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !434, file: !73, line: 242, baseType: !443, size: 64, offset: 3456)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !434, file: !73, line: 243, baseType: !443, size: 64, offset: 3520)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !434, file: !73, line: 246, baseType: !496, size: 64, offset: 3584)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !434, file: !73, line: 249, baseType: !443, size: 64, offset: 3648)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !434, file: !73, line: 250, baseType: !443, size: 64, offset: 3712)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !434, file: !73, line: 253, baseType: !496, size: 64, offset: 3776)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !434, file: !73, line: 256, baseType: !537, size: 192, offset: 3840)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !538, line: 68, baseType: !539)
!538 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !538, line: 62, size: 192, elements: !540)
!540 = !{!541, !542, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !539, file: !538, line: 65, baseType: !469, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !539, file: !538, line: 66, baseType: !469, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !539, file: !538, line: 67, baseType: !469, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !434, file: !73, line: 259, baseType: !545, size: 512, offset: 4032)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !547)
!547 = !{!548, !555, !556, !558}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !546, file: !247, line: 43, baseType: !549, size: 192)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !551)
!551 = !{!552, !553, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !550, file: !247, line: 35, baseType: !469, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !550, file: !247, line: 36, baseType: !469, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !550, file: !247, line: 37, baseType: !469, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !546, file: !247, line: 44, baseType: !549, size: 192, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !546, file: !247, line: 47, baseType: !557, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !546, file: !247, line: 50, baseType: !443, size: 64, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !434, file: !73, line: 262, baseType: !560, size: 64, offset: 4544)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !561, line: 26, baseType: !562)
!561 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!448, !565, !567, !570, !487}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !569)
!569 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !572)
!572 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !434, file: !73, line: 265, baseType: !487, size: 64, offset: 4608)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !434, file: !73, line: 266, baseType: !487, size: 64, offset: 4672)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !434, file: !73, line: 267, baseType: !487, size: 64, offset: 4736)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !434, file: !73, line: 270, baseType: !577, size: 64, offset: 4800)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !579)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !434, file: !73, line: 273, baseType: !581, size: 64, offset: 4864)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !583)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !434, file: !73, line: 276, baseType: !585, size: 32768, offset: 4928)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 32768, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 4096)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !434, file: !73, line: 277, baseType: !585, size: 32768, offset: 37696)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !434, file: !73, line: 278, baseType: !585, size: 32768, offset: 70464)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !434, file: !73, line: 281, baseType: !443, size: 64, offset: 103232)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !434, file: !73, line: 282, baseType: !443, size: 64, offset: 103296)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !434, file: !73, line: 285, baseType: !593, size: 448, offset: 103360)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !595)
!595 = !{!596, !598, !600, !601, !602, !603, !604, !609}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !594, file: !253, line: 105, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !594, file: !253, line: 108, baseType: !599, size: 32, offset: 32)
!599 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !594, file: !253, line: 111, baseType: !491, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !594, file: !253, line: 112, baseType: !491, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !594, file: !253, line: 115, baseType: !487, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !594, file: !253, line: 118, baseType: !448, size: 32, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !594, file: !253, line: 121, baseType: !605, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !607, line: 26, baseType: !608)
!607 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !607, line: 25, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !594, file: !253, line: 124, baseType: !443, size: 64, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !434, file: !73, line: 288, baseType: !448, size: 32, offset: 103808)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !434, file: !73, line: 291, baseType: !612, size: 64, offset: 103872)
!612 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !496)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !434, file: !73, line: 294, baseType: !605, size: 64, offset: 103936)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !434, file: !73, line: 297, baseType: !615, size: 256, offset: 104000)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !617)
!617 = !{!618, !619, !620, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !616, file: !89, line: 30, baseType: !491, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !616, file: !89, line: 33, baseType: !443, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !616, file: !89, line: 36, baseType: !621, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !616, file: !89, line: 39, baseType: !443, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !434, file: !73, line: 298, baseType: !615, size: 256, offset: 104256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !434, file: !73, line: 299, baseType: !626, size: 64, offset: 104512)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !434, file: !73, line: 302, baseType: !443, size: 64, offset: 104576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !434, file: !73, line: 305, baseType: !443, size: 64, offset: 104640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !434, file: !73, line: 308, baseType: !529, size: 64, offset: 104704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !434, file: !73, line: 309, baseType: !529, size: 64, offset: 104768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !434, file: !73, line: 310, baseType: !529, size: 64, offset: 104832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !434, file: !73, line: 313, baseType: !633, size: 32, offset: 104896)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !434, file: !73, line: 316, baseType: !448, size: 32, offset: 104928)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !434, file: !73, line: 319, baseType: !456, size: 64, offset: 104960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !434, file: !73, line: 322, baseType: !529, size: 64, offset: 105024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !434, file: !73, line: 325, baseType: !504, size: 256, offset: 105088)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !434, file: !73, line: 328, baseType: !487, size: 64, offset: 105344)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !434, file: !73, line: 329, baseType: !487, size: 64, offset: 105408)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !434, file: !73, line: 332, baseType: !641, size: 32, offset: 105472)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !434, file: !73, line: 335, baseType: !448, size: 32, offset: 105504)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !434, file: !73, line: 338, baseType: !571, size: 64, offset: 105536)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !434, file: !73, line: 341, baseType: !448, size: 32, offset: 105600)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !434, file: !73, line: 344, baseType: !443, size: 64, offset: 105664)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !434, file: !73, line: 347, baseType: !647, size: 64, offset: 105728)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !648, line: 7, baseType: !649)
!648 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !499, line: 160, baseType: !500)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !434, file: !73, line: 350, baseType: !651, size: 32, offset: 105792)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !434, file: !73, line: 353, baseType: !443, size: 64, offset: 105856)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !460)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !660)
!660 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!661 = !{i32 7, !"Dwarf Version", i32 5}
!662 = !{i32 2, !"Debug Info Version", i32 3}
!663 = !{i32 1, !"wchar_size", i32 4}
!664 = !{i32 7, !"PIC Level", i32 2}
!665 = !{i32 7, !"PIE Level", i32 2}
!666 = !{i32 7, !"uwtable", i32 2}
!667 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!668 = distinct !DISubprogram(name: "CombineImages", scope: !669, file: !669, line: 93, type: !670, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !677)
!669 = !DIFile(filename: "apps/538.imagick_r/src/magick/channel.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fa3490fc669484185103076548113b37")
!670 = !DISubroutineType(types: !671)
!671 = !{!432, !672, !674, !676}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !368)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!677 = !{!678, !679, !680, !681, !686, !687, !688, !689, !690, !691, !695, !696, !697, !699, !701, !702, !705}
!678 = !DILocalVariable(name: "image", arg: 1, scope: !668, file: !669, line: 93, type: !672)
!679 = !DILocalVariable(name: "channel", arg: 2, scope: !668, file: !669, line: 93, type: !674)
!680 = !DILocalVariable(name: "exception", arg: 3, scope: !668, file: !669, line: 94, type: !676)
!681 = !DILocalVariable(name: "combine_view", scope: !668, file: !669, line: 99, type: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !684, line: 50, baseType: !685)
!684 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!686 = !DILocalVariable(name: "next", scope: !668, file: !669, line: 102, type: !672)
!687 = !DILocalVariable(name: "combine_image", scope: !668, file: !669, line: 105, type: !432)
!688 = !DILocalVariable(name: "status", scope: !668, file: !669, line: 108, type: !448)
!689 = !DILocalVariable(name: "progress", scope: !668, file: !669, line: 111, type: !568)
!690 = !DILocalVariable(name: "y", scope: !668, file: !669, line: 114, type: !496)
!691 = !DILocalVariable(name: "image_view", scope: !692, file: !669, line: 153, type: !682)
!692 = distinct !DILexicalBlock(scope: !693, file: !669, line: 151, column: 3)
!693 = distinct !DILexicalBlock(scope: !694, file: !669, line: 150, column: 3)
!694 = distinct !DILexicalBlock(scope: !668, file: !669, line: 150, column: 3)
!695 = !DILocalVariable(name: "next", scope: !692, file: !669, line: 156, type: !672)
!696 = !DILocalVariable(name: "pixels", scope: !692, file: !669, line: 159, type: !455)
!697 = !DILocalVariable(name: "p", scope: !692, file: !669, line: 162, type: !698)
!698 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !653)
!699 = !DILocalVariable(name: "q", scope: !692, file: !669, line: 165, type: !700)
!700 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !455)
!701 = !DILocalVariable(name: "x", scope: !692, file: !669, line: 168, type: !496)
!702 = !DILocalVariable(name: "indexes", scope: !703, file: !669, line: 248, type: !655)
!703 = distinct !DILexicalBlock(scope: !704, file: !669, line: 246, column: 7)
!704 = distinct !DILexicalBlock(scope: !692, file: !669, line: 244, column: 9)
!705 = !DILocalVariable(name: "proceed", scope: !706, file: !669, line: 268, type: !448)
!706 = distinct !DILexicalBlock(scope: !707, file: !669, line: 266, column: 7)
!707 = distinct !DILexicalBlock(scope: !692, file: !669, line: 265, column: 9)
!708 = !DILocation(line: 0, scope: !668)
!709 = !DILocation(line: 121, column: 14, scope: !710)
!710 = distinct !DILexicalBlock(scope: !668, file: !669, line: 121, column: 7)
!711 = !{!712, !713, i64 12976}
!712 = !{!"_Image", !713, i64 0, !713, i64 4, !713, i64 8, !715, i64 16, !713, i64 24, !713, i64 28, !713, i64 32, !715, i64 40, !715, i64 48, !715, i64 56, !715, i64 64, !716, i64 72, !717, i64 80, !717, i64 88, !717, i64 96, !719, i64 104, !720, i64 112, !713, i64 208, !716, i64 216, !713, i64 224, !716, i64 232, !716, i64 240, !716, i64 248, !715, i64 256, !719, i64 264, !719, i64 272, !722, i64 280, !722, i64 312, !722, i64 344, !719, i64 376, !719, i64 384, !719, i64 392, !713, i64 400, !713, i64 404, !713, i64 408, !713, i64 412, !713, i64 416, !713, i64 420, !716, i64 424, !715, i64 432, !715, i64 440, !715, i64 448, !715, i64 456, !715, i64 464, !715, i64 472, !723, i64 480, !724, i64 504, !716, i64 568, !716, i64 576, !716, i64 584, !716, i64 592, !716, i64 600, !716, i64 608, !713, i64 616, !713, i64 4712, !713, i64 8808, !715, i64 12904, !715, i64 12912, !726, i64 12920, !713, i64 12976, !715, i64 12984, !716, i64 12992, !728, i64 13000, !728, i64 13032, !716, i64 13064, !715, i64 13072, !715, i64 13080, !716, i64 13088, !716, i64 13096, !716, i64 13104, !713, i64 13112, !713, i64 13116, !717, i64 13120, !716, i64 13128, !722, i64 13136, !716, i64 13168, !716, i64 13176, !713, i64 13184, !713, i64 13188, !729, i64 13192, !713, i64 13200, !715, i64 13208, !715, i64 13216, !713, i64 13224, !715, i64 13232}
!713 = !{!"omnipotent char", !714, i64 0}
!714 = !{!"Simple C/C++ TBAA"}
!715 = !{!"long", !713, i64 0}
!716 = !{!"any pointer", !713, i64 0}
!717 = !{!"_PixelPacket", !718, i64 0, !718, i64 2, !718, i64 4, !718, i64 6}
!718 = !{!"short", !713, i64 0}
!719 = !{!"double", !713, i64 0}
!720 = !{!"_ChromaticityInfo", !721, i64 0, !721, i64 24, !721, i64 48, !721, i64 72}
!721 = !{!"_PrimaryInfo", !719, i64 0, !719, i64 8, !719, i64 16}
!722 = !{!"_RectangleInfo", !715, i64 0, !715, i64 8, !715, i64 16, !715, i64 24}
!723 = !{!"_ErrorInfo", !719, i64 0, !719, i64 8, !719, i64 16}
!724 = !{!"_TimerInfo", !725, i64 0, !725, i64 24, !713, i64 48, !715, i64 56}
!725 = !{!"_Timer", !719, i64 0, !719, i64 8, !719, i64 16}
!726 = !{!"_ExceptionInfo", !713, i64 0, !727, i64 4, !716, i64 8, !716, i64 16, !716, i64 24, !713, i64 32, !716, i64 40, !715, i64 48}
!727 = !{!"int", !713, i64 0}
!728 = !{!"_ProfileInfo", !716, i64 0, !715, i64 8, !716, i64 16, !715, i64 24}
!729 = !{!"long long", !713, i64 0}
!730 = !DILocation(line: 121, column: 20, scope: !710)
!731 = !DILocation(line: 121, column: 7, scope: !668)
!732 = !DILocation(line: 122, column: 68, scope: !710)
!733 = !DILocation(line: 122, column: 12, scope: !710)
!734 = !DILocation(line: 122, column: 5, scope: !710)
!735 = !DILocation(line: 125, column: 3, scope: !736)
!736 = distinct !DILexicalBlock(scope: !668, file: !669, line: 125, column: 3)
!737 = !DILocation(line: 127, column: 16, scope: !738)
!738 = distinct !DILexicalBlock(scope: !739, file: !669, line: 127, column: 9)
!739 = distinct !DILexicalBlock(scope: !740, file: !669, line: 126, column: 3)
!740 = distinct !DILexicalBlock(scope: !736, file: !669, line: 125, column: 3)
!741 = !{!712, !715, i64 40}
!742 = !DILocation(line: 127, column: 34, scope: !738)
!743 = !DILocation(line: 127, column: 24, scope: !738)
!744 = !DILocation(line: 127, column: 43, scope: !738)
!745 = !DILocation(line: 127, column: 53, scope: !738)
!746 = !{!712, !715, i64 48}
!747 = !DILocation(line: 127, column: 68, scope: !738)
!748 = !DILocation(line: 127, column: 58, scope: !738)
!749 = !DILocation(line: 127, column: 9, scope: !739)
!750 = !DILocation(line: 128, column: 7, scope: !751)
!751 = distinct !DILexicalBlock(scope: !738, file: !669, line: 128, column: 7)
!752 = !DILocation(line: 125, column: 49, scope: !740)
!753 = !DILocation(line: 125, column: 25, scope: !740)
!754 = distinct !{!754, !735, !755, !756, !757}
!755 = !DILocation(line: 129, column: 3, scope: !736)
!756 = !{!"llvm.loop.mustprogress"}
!757 = !{!"llvm.loop.unroll.disable"}
!758 = !DILocation(line: 130, column: 17, scope: !668)
!759 = !DILocation(line: 131, column: 21, scope: !760)
!760 = distinct !DILexicalBlock(scope: !668, file: !669, line: 131, column: 7)
!761 = !DILocation(line: 131, column: 7, scope: !668)
!762 = !DILocation(line: 133, column: 7, scope: !763)
!763 = distinct !DILexicalBlock(scope: !668, file: !669, line: 133, column: 7)
!764 = !DILocation(line: 133, column: 55, scope: !763)
!765 = !DILocation(line: 133, column: 7, scope: !668)
!766 = !DILocation(line: 135, column: 50, scope: !767)
!767 = distinct !DILexicalBlock(scope: !763, file: !669, line: 134, column: 5)
!768 = !DILocation(line: 135, column: 7, scope: !767)
!769 = !DILocation(line: 136, column: 21, scope: !767)
!770 = !DILocation(line: 137, column: 7, scope: !767)
!771 = !DILocation(line: 139, column: 41, scope: !772)
!772 = distinct !DILexicalBlock(scope: !668, file: !669, line: 139, column: 7)
!773 = !{!712, !713, i64 4}
!774 = !DILocalVariable(name: "colorspace", arg: 1, scope: !775, file: !776, line: 110, type: !779)
!775 = distinct !DISubprogram(name: "IssRGBCompatibleColorspace", scope: !776, file: !776, line: 109, type: !777, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !780)
!776 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bac8bff1724649a3818d765f5f2e1482")
!777 = !DISubroutineType(types: !778)
!778 = !{!448, !779}
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!780 = !{!774}
!781 = !DILocation(line: 0, scope: !775, inlinedAt: !782)
!782 = distinct !DILocation(line: 139, column: 7, scope: !772)
!783 = !DILocation(line: 112, column: 38, scope: !784, inlinedAt: !782)
!784 = distinct !DILexicalBlock(scope: !775, file: !776, line: 112, column: 7)
!785 = !DILocation(line: 140, column: 12, scope: !772)
!786 = !DILocation(line: 140, column: 5, scope: !772)
!787 = !DILocation(line: 141, column: 16, scope: !788)
!788 = distinct !DILexicalBlock(scope: !668, file: !669, line: 141, column: 7)
!789 = !DILocation(line: 141, column: 34, scope: !788)
!790 = !DILocation(line: 141, column: 7, scope: !668)
!791 = !DILocation(line: 142, column: 20, scope: !788)
!792 = !DILocation(line: 142, column: 25, scope: !788)
!793 = !{!712, !713, i64 32}
!794 = !DILocation(line: 142, column: 5, scope: !788)
!795 = !DILocation(line: 143, column: 10, scope: !668)
!796 = !DILocation(line: 149, column: 16, scope: !668)
!797 = !DILocation(line: 150, column: 42, scope: !693)
!798 = !DILocation(line: 150, column: 15, scope: !693)
!799 = !DILocation(line: 150, column: 3, scope: !694)
!800 = !DILocation(line: 170, column: 16, scope: !801)
!801 = distinct !DILexicalBlock(scope: !692, file: !669, line: 170, column: 9)
!802 = !DILocation(line: 170, column: 9, scope: !692)
!803 = !DILocation(line: 172, column: 72, scope: !692)
!804 = !DILocation(line: 172, column: 12, scope: !692)
!805 = !DILocation(line: 0, scope: !692)
!806 = !DILocation(line: 174, column: 16, scope: !807)
!807 = distinct !DILexicalBlock(scope: !692, file: !669, line: 174, column: 9)
!808 = !DILocation(line: 174, column: 9, scope: !692)
!809 = !DILocation(line: 180, column: 39, scope: !810)
!810 = distinct !DILexicalBlock(scope: !692, file: !669, line: 180, column: 9)
!811 = !DILocation(line: 182, column: 20, scope: !812)
!812 = distinct !DILexicalBlock(scope: !810, file: !669, line: 181, column: 7)
!813 = !DILocation(line: 183, column: 58, scope: !812)
!814 = !DILocation(line: 183, column: 11, scope: !812)
!815 = !DILocation(line: 184, column: 15, scope: !816)
!816 = distinct !DILexicalBlock(scope: !812, file: !669, line: 184, column: 13)
!817 = !DILocation(line: 184, column: 13, scope: !812)
!818 = !DILocation(line: 187, column: 48, scope: !819)
!819 = distinct !DILexicalBlock(scope: !820, file: !669, line: 187, column: 9)
!820 = distinct !DILexicalBlock(scope: !812, file: !669, line: 187, column: 9)
!821 = !DILocation(line: 187, column: 21, scope: !819)
!822 = !DILocation(line: 187, column: 9, scope: !820)
!823 = !DILocation(line: 189, column: 11, scope: !824)
!824 = distinct !DILexicalBlock(scope: !819, file: !669, line: 188, column: 9)
!825 = !DILocalVariable(name: "value", arg: 1, scope: !826, file: !147, line: 87, type: !829)
!826 = distinct !DISubprogram(name: "ClampToQuantum", scope: !147, file: !147, line: 87, type: !827, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !830)
!827 = !DISubroutineType(types: !828)
!828 = !{!460, !829}
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!830 = !{!825}
!831 = !DILocation(line: 0, scope: !826, inlinedAt: !832)
!832 = distinct !DILocation(line: 189, column: 11, scope: !824)
!833 = !DILocation(line: 92, column: 13, scope: !834, inlinedAt: !832)
!834 = distinct !DILexicalBlock(scope: !826, file: !147, line: 92, column: 7)
!835 = !DILocation(line: 92, column: 7, scope: !826, inlinedAt: !832)
!836 = !DILocation(line: 94, column: 13, scope: !837, inlinedAt: !832)
!837 = distinct !DILexicalBlock(scope: !826, file: !147, line: 94, column: 7)
!838 = !DILocation(line: 94, column: 7, scope: !826, inlinedAt: !832)
!839 = !DILocation(line: 96, column: 26, scope: !826, inlinedAt: !832)
!840 = !DILocation(line: 96, column: 10, scope: !826, inlinedAt: !832)
!841 = !DILocation(line: 96, column: 3, scope: !826, inlinedAt: !832)
!842 = !{!717, !718, i64 4}
!843 = !DILocation(line: 190, column: 12, scope: !824)
!844 = !DILocation(line: 191, column: 12, scope: !824)
!845 = !DILocation(line: 187, column: 58, scope: !819)
!846 = distinct !{!846, !822, !847, !756, !757}
!847 = !DILocation(line: 192, column: 9, scope: !820)
!848 = !DILocation(line: 193, column: 20, scope: !812)
!849 = !DILocation(line: 194, column: 14, scope: !812)
!850 = !DILocation(line: 195, column: 7, scope: !812)
!851 = !DILocation(line: 196, column: 41, scope: !852)
!852 = distinct !DILexicalBlock(scope: !692, file: !669, line: 196, column: 9)
!853 = !DILocation(line: 198, column: 20, scope: !854)
!854 = distinct !DILexicalBlock(scope: !852, file: !669, line: 197, column: 7)
!855 = !DILocation(line: 199, column: 58, scope: !854)
!856 = !DILocation(line: 199, column: 11, scope: !854)
!857 = !DILocation(line: 200, column: 15, scope: !858)
!858 = distinct !DILexicalBlock(scope: !854, file: !669, line: 200, column: 13)
!859 = !DILocation(line: 200, column: 13, scope: !854)
!860 = !DILocation(line: 203, column: 48, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !669, line: 203, column: 9)
!862 = distinct !DILexicalBlock(scope: !854, file: !669, line: 203, column: 9)
!863 = !DILocation(line: 203, column: 21, scope: !861)
!864 = !DILocation(line: 203, column: 9, scope: !862)
!865 = !DILocation(line: 205, column: 11, scope: !866)
!866 = distinct !DILexicalBlock(scope: !861, file: !669, line: 204, column: 9)
!867 = !DILocation(line: 0, scope: !826, inlinedAt: !868)
!868 = distinct !DILocation(line: 205, column: 11, scope: !866)
!869 = !DILocation(line: 92, column: 13, scope: !834, inlinedAt: !868)
!870 = !DILocation(line: 92, column: 7, scope: !826, inlinedAt: !868)
!871 = !DILocation(line: 94, column: 13, scope: !837, inlinedAt: !868)
!872 = !DILocation(line: 94, column: 7, scope: !826, inlinedAt: !868)
!873 = !DILocation(line: 96, column: 26, scope: !826, inlinedAt: !868)
!874 = !DILocation(line: 96, column: 10, scope: !826, inlinedAt: !868)
!875 = !DILocation(line: 96, column: 3, scope: !826, inlinedAt: !868)
!876 = !{!717, !718, i64 2}
!877 = !DILocation(line: 206, column: 12, scope: !866)
!878 = !DILocation(line: 207, column: 12, scope: !866)
!879 = !DILocation(line: 203, column: 58, scope: !861)
!880 = distinct !{!880, !864, !881, !756, !757}
!881 = !DILocation(line: 208, column: 9, scope: !862)
!882 = !DILocation(line: 209, column: 20, scope: !854)
!883 = !DILocation(line: 210, column: 14, scope: !854)
!884 = !DILocation(line: 211, column: 7, scope: !854)
!885 = !DILocation(line: 212, column: 40, scope: !886)
!886 = distinct !DILexicalBlock(scope: !692, file: !669, line: 212, column: 9)
!887 = !DILocation(line: 214, column: 20, scope: !888)
!888 = distinct !DILexicalBlock(scope: !886, file: !669, line: 213, column: 7)
!889 = !DILocation(line: 215, column: 58, scope: !888)
!890 = !DILocation(line: 215, column: 11, scope: !888)
!891 = !DILocation(line: 216, column: 15, scope: !892)
!892 = distinct !DILexicalBlock(scope: !888, file: !669, line: 216, column: 13)
!893 = !DILocation(line: 216, column: 13, scope: !888)
!894 = !DILocation(line: 219, column: 48, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !669, line: 219, column: 9)
!896 = distinct !DILexicalBlock(scope: !888, file: !669, line: 219, column: 9)
!897 = !DILocation(line: 219, column: 21, scope: !895)
!898 = !DILocation(line: 219, column: 9, scope: !896)
!899 = !DILocation(line: 221, column: 11, scope: !900)
!900 = distinct !DILexicalBlock(scope: !895, file: !669, line: 220, column: 9)
!901 = !DILocation(line: 0, scope: !826, inlinedAt: !902)
!902 = distinct !DILocation(line: 221, column: 11, scope: !900)
!903 = !DILocation(line: 92, column: 13, scope: !834, inlinedAt: !902)
!904 = !DILocation(line: 92, column: 7, scope: !826, inlinedAt: !902)
!905 = !DILocation(line: 94, column: 13, scope: !837, inlinedAt: !902)
!906 = !DILocation(line: 94, column: 7, scope: !826, inlinedAt: !902)
!907 = !DILocation(line: 96, column: 26, scope: !826, inlinedAt: !902)
!908 = !DILocation(line: 96, column: 10, scope: !826, inlinedAt: !902)
!909 = !DILocation(line: 96, column: 3, scope: !826, inlinedAt: !902)
!910 = !{!717, !718, i64 0}
!911 = !DILocation(line: 222, column: 12, scope: !900)
!912 = !DILocation(line: 223, column: 12, scope: !900)
!913 = !DILocation(line: 219, column: 58, scope: !895)
!914 = distinct !{!914, !898, !915, !756, !757}
!915 = !DILocation(line: 224, column: 9, scope: !896)
!916 = !DILocation(line: 225, column: 20, scope: !888)
!917 = !DILocation(line: 226, column: 14, scope: !888)
!918 = !DILocation(line: 227, column: 7, scope: !888)
!919 = !DILocation(line: 228, column: 43, scope: !920)
!920 = distinct !DILexicalBlock(scope: !692, file: !669, line: 228, column: 9)
!921 = !DILocation(line: 230, column: 20, scope: !922)
!922 = distinct !DILexicalBlock(scope: !920, file: !669, line: 229, column: 7)
!923 = !DILocation(line: 231, column: 58, scope: !922)
!924 = !DILocation(line: 231, column: 11, scope: !922)
!925 = !DILocation(line: 232, column: 15, scope: !926)
!926 = distinct !DILexicalBlock(scope: !922, file: !669, line: 232, column: 13)
!927 = !DILocation(line: 232, column: 13, scope: !922)
!928 = !DILocation(line: 235, column: 48, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !669, line: 235, column: 9)
!930 = distinct !DILexicalBlock(scope: !922, file: !669, line: 235, column: 9)
!931 = !DILocation(line: 235, column: 21, scope: !929)
!932 = !DILocation(line: 235, column: 9, scope: !930)
!933 = !DILocation(line: 237, column: 11, scope: !934)
!934 = distinct !DILexicalBlock(scope: !929, file: !669, line: 236, column: 9)
!935 = !DILocation(line: 0, scope: !826, inlinedAt: !936)
!936 = distinct !DILocation(line: 237, column: 11, scope: !934)
!937 = !DILocation(line: 92, column: 13, scope: !834, inlinedAt: !936)
!938 = !DILocation(line: 92, column: 7, scope: !826, inlinedAt: !936)
!939 = !DILocation(line: 94, column: 13, scope: !837, inlinedAt: !936)
!940 = !DILocation(line: 94, column: 7, scope: !826, inlinedAt: !936)
!941 = !DILocation(line: 96, column: 26, scope: !826, inlinedAt: !936)
!942 = !DILocation(line: 96, column: 10, scope: !826, inlinedAt: !936)
!943 = !DILocation(line: 96, column: 3, scope: !826, inlinedAt: !936)
!944 = !{!717, !718, i64 6}
!945 = !DILocation(line: 238, column: 12, scope: !934)
!946 = !DILocation(line: 239, column: 12, scope: !934)
!947 = !DILocation(line: 235, column: 58, scope: !929)
!948 = distinct !{!948, !932, !949, !756, !757}
!949 = !DILocation(line: 240, column: 9, scope: !930)
!950 = !DILocation(line: 241, column: 20, scope: !922)
!951 = !DILocation(line: 242, column: 14, scope: !922)
!952 = !DILocation(line: 243, column: 7, scope: !922)
!953 = !DILocation(line: 244, column: 41, scope: !704)
!954 = !DILocation(line: 245, column: 17, scope: !704)
!955 = !DILocation(line: 245, column: 28, scope: !704)
!956 = !DILocation(line: 245, column: 47, scope: !704)
!957 = !DILocation(line: 250, column: 20, scope: !703)
!958 = !DILocation(line: 251, column: 58, scope: !703)
!959 = !DILocation(line: 251, column: 11, scope: !703)
!960 = !DILocation(line: 252, column: 15, scope: !961)
!961 = distinct !DILexicalBlock(scope: !703, file: !669, line: 252, column: 13)
!962 = !DILocation(line: 252, column: 13, scope: !703)
!963 = !DILocation(line: 254, column: 17, scope: !703)
!964 = !DILocation(line: 0, scope: !703)
!965 = !DILocation(line: 255, column: 48, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !669, line: 255, column: 9)
!967 = distinct !DILexicalBlock(scope: !703, file: !669, line: 255, column: 9)
!968 = !DILocation(line: 255, column: 21, scope: !966)
!969 = !DILocation(line: 255, column: 9, scope: !967)
!970 = !DILocation(line: 257, column: 11, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !669, line: 257, column: 11)
!972 = distinct !DILexicalBlock(scope: !973, file: !669, line: 257, column: 11)
!973 = distinct !DILexicalBlock(scope: !966, file: !669, line: 256, column: 9)
!974 = !DILocation(line: 0, scope: !826, inlinedAt: !975)
!975 = distinct !DILocation(line: 257, column: 11, scope: !971)
!976 = !DILocation(line: 92, column: 13, scope: !834, inlinedAt: !975)
!977 = !DILocation(line: 92, column: 7, scope: !826, inlinedAt: !975)
!978 = !DILocation(line: 94, column: 13, scope: !837, inlinedAt: !975)
!979 = !DILocation(line: 94, column: 7, scope: !826, inlinedAt: !975)
!980 = !DILocation(line: 96, column: 26, scope: !826, inlinedAt: !975)
!981 = !DILocation(line: 96, column: 10, scope: !826, inlinedAt: !975)
!982 = !DILocation(line: 96, column: 3, scope: !826, inlinedAt: !975)
!983 = !{!718, !718, i64 0}
!984 = !DILocation(line: 258, column: 12, scope: !973)
!985 = !DILocation(line: 255, column: 58, scope: !966)
!986 = distinct !{!986, !969, !987, !756, !757}
!987 = !DILocation(line: 259, column: 9, scope: !967)
!988 = !DILocation(line: 260, column: 20, scope: !703)
!989 = !DILocation(line: 261, column: 14, scope: !703)
!990 = !DILocation(line: 263, column: 9, scope: !991)
!991 = distinct !DILexicalBlock(scope: !692, file: !669, line: 263, column: 9)
!992 = !DILocation(line: 263, column: 62, scope: !991)
!993 = !DILocation(line: 263, column: 9, scope: !692)
!994 = !DILocation(line: 265, column: 16, scope: !707)
!995 = !{!712, !716, i64 568}
!996 = !DILocation(line: 265, column: 33, scope: !707)
!997 = !DILocation(line: 265, column: 9, scope: !692)
!998 = !DILocation(line: 270, column: 64, scope: !706)
!999 = !DILocation(line: 271, column: 26, scope: !706)
!1000 = !DILocalVariable(name: "image", arg: 1, scope: !1001, file: !1002, line: 27, type: !672)
!1001 = distinct !DISubprogram(name: "SetImageProgress", scope: !1002, file: !1002, line: 27, type: !1003, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1005)
!1002 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a84e9021f92665a913f9cbc20a804774")
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!448, !672, !565, !567, !570}
!1005 = !{!1000, !1006, !1007, !1008, !1009}
!1006 = !DILocalVariable(name: "tag", arg: 2, scope: !1001, file: !1002, line: 28, type: !565)
!1007 = !DILocalVariable(name: "offset", arg: 3, scope: !1001, file: !1002, line: 28, type: !567)
!1008 = !DILocalVariable(name: "extent", arg: 4, scope: !1001, file: !1002, line: 28, type: !570)
!1009 = !DILocalVariable(name: "message", scope: !1001, file: !1002, line: 31, type: !585)
!1010 = !DILocation(line: 0, scope: !1001, inlinedAt: !1011)
!1011 = distinct !DILocation(line: 270, column: 17, scope: !706)
!1012 = !DILocation(line: 30, column: 3, scope: !1001, inlinedAt: !1011)
!1013 = !DILocation(line: 31, column: 5, scope: !1001, inlinedAt: !1011)
!1014 = !DILocation(line: 35, column: 10, scope: !1001, inlinedAt: !1011)
!1015 = !DILocation(line: 36, column: 17, scope: !1001, inlinedAt: !1011)
!1016 = !DILocation(line: 36, column: 63, scope: !1001, inlinedAt: !1011)
!1017 = !{!712, !716, i64 576}
!1018 = !DILocation(line: 36, column: 10, scope: !1001, inlinedAt: !1011)
!1019 = !DILocation(line: 37, column: 1, scope: !1001, inlinedAt: !1011)
!1020 = !DILocation(line: 0, scope: !706)
!1021 = !DILocation(line: 272, column: 21, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !706, file: !669, line: 272, column: 13)
!1023 = !DILocation(line: 272, column: 13, scope: !706)
!1024 = !DILocation(line: 274, column: 7, scope: !706)
!1025 = !DILocation(line: 150, column: 49, scope: !693)
!1026 = distinct !{!1026, !799, !1027, !756, !757}
!1027 = !DILocation(line: 275, column: 3, scope: !694)
!1028 = !DILocation(line: 147, column: 9, scope: !668)
!1029 = !DILocation(line: 276, column: 16, scope: !668)
!1030 = !DILocation(line: 277, column: 39, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !668, file: !669, line: 277, column: 7)
!1032 = !DILocalVariable(name: "colorspace", arg: 1, scope: !1033, file: !776, line: 86, type: !779)
!1033 = distinct !DISubprogram(name: "IsGrayColorspace", scope: !776, file: !776, line: 85, type: !777, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1034)
!1034 = !{!1032}
!1035 = !DILocation(line: 0, scope: !1033, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 277, column: 7, scope: !1031)
!1037 = !DILocation(line: 88, column: 38, scope: !1038, inlinedAt: !1036)
!1038 = distinct !DILexicalBlock(scope: !1033, file: !776, line: 88, column: 7)
!1039 = !DILocation(line: 278, column: 12, scope: !1031)
!1040 = !DILocation(line: 278, column: 5, scope: !1031)
!1041 = !DILocation(line: 279, column: 14, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !668, file: !669, line: 279, column: 7)
!1043 = !DILocation(line: 279, column: 7, scope: !668)
!1044 = !DILocation(line: 280, column: 19, scope: !1042)
!1045 = !DILocation(line: 280, column: 5, scope: !1042)
!1046 = !DILocation(line: 282, column: 1, scope: !668)
!1047 = !DISubprogram(name: "LogMagickEvent", scope: !391, file: !391, line: 83, type: !1048, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!448, !1050, !565, !565, !1052, !565, null}
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !391, line: 58, baseType: !390)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!1053 = !{}
!1054 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1055, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!448, !676, !565, !565, !1052, !1057, !565, !565, null}
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!1058 = !DISubprogram(name: "GetNextImageInList", scope: !1059, file: !1059, line: 33, type: !1060, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1059 = !DIFile(filename: "apps/538.imagick_r/src/magick/list.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53876be9fc59b89d67d5ff7fa85db93a")
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!432, !672}
!1062 = !DISubprogram(name: "CloneImage", scope: !73, file: !73, line: 508, type: !1063, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!432, !672, !1052, !1052, !1065, !676}
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!1066 = !DISubprogram(name: "SetImageStorageClass", scope: !73, file: !73, line: 542, type: !1067, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!448, !432, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!1070 = !DISubprogram(name: "InheritException", scope: !253, file: !253, line: 167, type: !1071, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !676, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!1075 = !DISubprogram(name: "DestroyImage", scope: !73, file: !73, line: 510, type: !1076, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!432, !432}
!1078 = !DISubprogram(name: "SetImageColorspace", scope: !11, file: !11, line: 65, type: !1079, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!448, !432, !779}
!1081 = !DISubprogram(name: "SetImageBackgroundColor", scope: !73, file: !73, line: 534, type: !1082, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!448, !432}
!1084 = !DISubprogram(name: "AcquireAuthenticCacheView", scope: !684, file: !684, line: 53, type: !1085, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!682, !672, !676}
!1087 = !DISubprogram(name: "GetCacheViewAuthenticPixels", scope: !684, file: !684, line: 99, type: !1088, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!455, !682, !1090, !1090, !1052, !1052, !676}
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!1091 = !DISubprogram(name: "AcquireVirtualCacheView", scope: !684, file: !684, line: 55, type: !1085, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1092 = !DISubprogram(name: "GetCacheViewVirtualPixels", scope: !684, file: !684, line: 69, type: !1093, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!653, !1095, !1090, !1090, !1052, !1052, !676}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!1097 = !DISubprogram(name: "GetPixelIntensity", scope: !326, file: !326, line: 181, type: !1098, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!659, !672, !698}
!1100 = !DISubprogram(name: "DestroyCacheView", scope: !684, file: !684, line: 57, type: !1101, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!682, !682}
!1103 = !DISubprogram(name: "GetCacheViewAuthenticIndexQueue", scope: !684, file: !684, line: 77, type: !1104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!655, !682}
!1106 = !DISubprogram(name: "SyncCacheViewAuthenticPixels", scope: !684, file: !684, line: 89, type: !1107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!448, !682, !676}
!1109 = !DISubprogram(name: "TransformImageColorspace", scope: !11, file: !11, line: 66, type: !1079, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1110 = distinct !DISubprogram(name: "GetImageAlphaChannel", scope: !669, file: !669, line: 308, type: !1111, scopeLine: 309, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1113)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!448, !672}
!1113 = !{!1114}
!1114 = !DILocalVariable(name: "image", arg: 1, scope: !1110, file: !669, line: 308, type: !672)
!1115 = !DILocation(line: 0, scope: !1110)
!1116 = !DILocation(line: 311, column: 14, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1110, file: !669, line: 311, column: 7)
!1118 = !DILocation(line: 311, column: 20, scope: !1117)
!1119 = !DILocation(line: 311, column: 7, scope: !1110)
!1120 = !DILocation(line: 312, column: 12, scope: !1117)
!1121 = !DILocation(line: 312, column: 5, scope: !1117)
!1122 = !DILocation(line: 314, column: 17, scope: !1110)
!1123 = !DILocation(line: 314, column: 3, scope: !1110)
!1124 = distinct !DISubprogram(name: "SeparateImage", scope: !669, file: !669, line: 347, type: !670, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1125)
!1125 = !{!1126, !1127, !1128, !1129, !1130}
!1126 = !DILocalVariable(name: "image", arg: 1, scope: !1124, file: !669, line: 347, type: !672)
!1127 = !DILocalVariable(name: "channel", arg: 2, scope: !1124, file: !669, line: 347, type: !674)
!1128 = !DILocalVariable(name: "exception", arg: 3, scope: !1124, file: !669, line: 348, type: !676)
!1129 = !DILocalVariable(name: "separate_image", scope: !1124, file: !669, line: 351, type: !432)
!1130 = !DILocalVariable(name: "status", scope: !1124, file: !669, line: 354, type: !448)
!1131 = !DILocation(line: 0, scope: !1124)
!1132 = !DILocation(line: 361, column: 14, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1124, file: !669, line: 361, column: 7)
!1134 = !DILocation(line: 361, column: 20, scope: !1133)
!1135 = !DILocation(line: 361, column: 7, scope: !1124)
!1136 = !DILocation(line: 362, column: 68, scope: !1133)
!1137 = !DILocation(line: 362, column: 12, scope: !1133)
!1138 = !DILocation(line: 362, column: 5, scope: !1133)
!1139 = !DILocation(line: 365, column: 18, scope: !1124)
!1140 = !DILocation(line: 366, column: 22, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1124, file: !669, line: 366, column: 7)
!1142 = !DILocation(line: 366, column: 7, scope: !1124)
!1143 = !DILocation(line: 368, column: 10, scope: !1124)
!1144 = !DILocation(line: 369, column: 14, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1124, file: !669, line: 369, column: 7)
!1146 = !DILocation(line: 369, column: 7, scope: !1124)
!1147 = !DILocation(line: 370, column: 20, scope: !1145)
!1148 = !DILocation(line: 370, column: 5, scope: !1145)
!1149 = !DILocation(line: 372, column: 1, scope: !1124)
!1150 = distinct !DISubprogram(name: "SeparateImageChannel", scope: !669, file: !669, line: 374, type: !1151, scopeLine: 376, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1153)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!448, !432, !674}
!1153 = !{!1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1166, !1167, !1168}
!1154 = !DILocalVariable(name: "image", arg: 1, scope: !1150, file: !669, line: 374, type: !432)
!1155 = !DILocalVariable(name: "channel", arg: 2, scope: !1150, file: !669, line: 375, type: !674)
!1156 = !DILocalVariable(name: "image_view", scope: !1150, file: !669, line: 380, type: !682)
!1157 = !DILocalVariable(name: "exception", scope: !1150, file: !669, line: 383, type: !676)
!1158 = !DILocalVariable(name: "status", scope: !1150, file: !669, line: 386, type: !448)
!1159 = !DILocalVariable(name: "progress", scope: !1150, file: !669, line: 389, type: !568)
!1160 = !DILocalVariable(name: "y", scope: !1150, file: !669, line: 392, type: !496)
!1161 = !DILocalVariable(name: "indexes", scope: !1162, file: !669, line: 416, type: !1165)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !669, line: 414, column: 3)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !669, line: 413, column: 3)
!1164 = distinct !DILexicalBlock(scope: !1150, file: !669, line: 413, column: 3)
!1165 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !655)
!1166 = !DILocalVariable(name: "q", scope: !1162, file: !669, line: 419, type: !700)
!1167 = !DILocalVariable(name: "x", scope: !1162, file: !669, line: 422, type: !496)
!1168 = !DILocalVariable(name: "proceed", scope: !1169, file: !669, line: 518, type: !448)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !669, line: 516, column: 7)
!1170 = distinct !DILexicalBlock(scope: !1162, file: !669, line: 515, column: 9)
!1171 = !DILocation(line: 0, scope: !1150)
!1172 = !DILocation(line: 396, column: 14, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1150, file: !669, line: 396, column: 7)
!1174 = !DILocation(line: 396, column: 20, scope: !1173)
!1175 = !DILocation(line: 396, column: 7, scope: !1150)
!1176 = !DILocation(line: 397, column: 68, scope: !1173)
!1177 = !DILocation(line: 397, column: 12, scope: !1173)
!1178 = !DILocation(line: 397, column: 5, scope: !1173)
!1179 = !DILocation(line: 398, column: 7, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1150, file: !669, line: 398, column: 7)
!1181 = !DILocation(line: 398, column: 47, scope: !1180)
!1182 = !DILocation(line: 398, column: 7, scope: !1150)
!1183 = !DILocation(line: 400, column: 15, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1150, file: !669, line: 400, column: 7)
!1185 = !DILocation(line: 400, column: 7, scope: !1150)
!1186 = !DILocation(line: 401, column: 12, scope: !1184)
!1187 = !DILocation(line: 401, column: 17, scope: !1184)
!1188 = !DILocation(line: 401, column: 5, scope: !1184)
!1189 = !DILocation(line: 407, column: 22, scope: !1150)
!1190 = !DILocation(line: 408, column: 14, scope: !1150)
!1191 = !DILocation(line: 413, column: 34, scope: !1163)
!1192 = !DILocation(line: 413, column: 15, scope: !1163)
!1193 = !DILocation(line: 413, column: 3, scope: !1164)
!1194 = !DILocation(line: 424, column: 16, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1162, file: !669, line: 424, column: 9)
!1196 = !DILocation(line: 424, column: 9, scope: !1162)
!1197 = !DILocation(line: 426, column: 57, scope: !1162)
!1198 = !DILocation(line: 426, column: 7, scope: !1162)
!1199 = !DILocation(line: 0, scope: !1162)
!1200 = !DILocation(line: 427, column: 11, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1162, file: !669, line: 427, column: 9)
!1202 = !DILocation(line: 427, column: 9, scope: !1162)
!1203 = !DILocation(line: 432, column: 13, scope: !1162)
!1204 = !DILocation(line: 433, column: 5, scope: !1162)
!1205 = !DILocation(line: 503, column: 40, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1207, file: !669, line: 503, column: 9)
!1207 = distinct !DILexicalBlock(scope: !1208, file: !669, line: 503, column: 9)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !669, line: 502, column: 7)
!1209 = distinct !DILexicalBlock(scope: !1162, file: !669, line: 434, column: 5)
!1210 = !DILocation(line: 503, column: 21, scope: !1206)
!1211 = !DILocation(line: 503, column: 9, scope: !1207)
!1212 = !DILocation(line: 492, column: 21, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1214, file: !669, line: 492, column: 9)
!1214 = distinct !DILexicalBlock(scope: !1215, file: !669, line: 492, column: 9)
!1215 = distinct !DILexicalBlock(scope: !1209, file: !669, line: 491, column: 7)
!1216 = !DILocation(line: 492, column: 9, scope: !1214)
!1217 = !DILocation(line: 467, column: 21, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1219, file: !669, line: 467, column: 9)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !669, line: 467, column: 9)
!1220 = distinct !DILexicalBlock(scope: !1209, file: !669, line: 466, column: 7)
!1221 = !DILocation(line: 467, column: 9, scope: !1219)
!1222 = !DILocation(line: 457, column: 21, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1224, file: !669, line: 457, column: 9)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !669, line: 457, column: 9)
!1225 = distinct !DILexicalBlock(scope: !1209, file: !669, line: 456, column: 7)
!1226 = !DILocation(line: 457, column: 9, scope: !1224)
!1227 = !DILocation(line: 447, column: 21, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1229, file: !669, line: 447, column: 9)
!1229 = distinct !DILexicalBlock(scope: !1230, file: !669, line: 447, column: 9)
!1230 = distinct !DILexicalBlock(scope: !1209, file: !669, line: 446, column: 7)
!1231 = !DILocation(line: 447, column: 9, scope: !1229)
!1232 = !DILocation(line: 437, column: 21, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1234, file: !669, line: 437, column: 9)
!1234 = distinct !DILexicalBlock(scope: !1235, file: !669, line: 437, column: 9)
!1235 = distinct !DILexicalBlock(scope: !1209, file: !669, line: 436, column: 7)
!1236 = !DILocation(line: 437, column: 9, scope: !1234)
!1237 = !DILocation(line: 439, column: 11, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1233, file: !669, line: 438, column: 9)
!1239 = !DILocation(line: 440, column: 11, scope: !1238)
!1240 = !DILocation(line: 441, column: 12, scope: !1238)
!1241 = !DILocation(line: 437, column: 50, scope: !1233)
!1242 = distinct !{!1242, !1236, !1243, !756, !757}
!1243 = !DILocation(line: 442, column: 9, scope: !1234)
!1244 = !DILocation(line: 449, column: 11, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1228, file: !669, line: 448, column: 9)
!1246 = !DILocation(line: 450, column: 11, scope: !1245)
!1247 = !DILocation(line: 451, column: 12, scope: !1245)
!1248 = !DILocation(line: 447, column: 50, scope: !1228)
!1249 = distinct !{!1249, !1231, !1250, !756, !757}
!1250 = !DILocation(line: 452, column: 9, scope: !1229)
!1251 = !DILocation(line: 459, column: 11, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1223, file: !669, line: 458, column: 9)
!1253 = !DILocation(line: 460, column: 11, scope: !1252)
!1254 = !DILocation(line: 461, column: 12, scope: !1252)
!1255 = !DILocation(line: 457, column: 50, scope: !1223)
!1256 = distinct !{!1256, !1226, !1257, !756, !757}
!1257 = !DILocation(line: 462, column: 9, scope: !1224)
!1258 = !DILocation(line: 469, column: 11, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1218, file: !669, line: 468, column: 9)
!1260 = !DILocation(line: 470, column: 11, scope: !1259)
!1261 = !DILocation(line: 471, column: 11, scope: !1259)
!1262 = !DILocation(line: 472, column: 12, scope: !1259)
!1263 = !DILocation(line: 467, column: 50, scope: !1218)
!1264 = distinct !{!1264, !1221, !1265, !756, !757}
!1265 = !DILocation(line: 473, column: 9, scope: !1219)
!1266 = !DILocation(line: 478, column: 21, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1268, file: !669, line: 478, column: 13)
!1268 = distinct !DILexicalBlock(scope: !1209, file: !669, line: 477, column: 7)
!1269 = !{!712, !713, i64 0}
!1270 = !DILocation(line: 478, column: 35, scope: !1267)
!1271 = !DILocation(line: 478, column: 51, scope: !1267)
!1272 = !DILocation(line: 479, column: 21, scope: !1267)
!1273 = !DILocation(line: 479, column: 32, scope: !1267)
!1274 = !DILocation(line: 478, column: 13, scope: !1268)
!1275 = !DILocation(line: 481, column: 21, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1277, file: !669, line: 481, column: 9)
!1277 = distinct !DILexicalBlock(scope: !1268, file: !669, line: 481, column: 9)
!1278 = !DILocation(line: 481, column: 9, scope: !1277)
!1279 = !DILocation(line: 483, column: 11, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1276, file: !669, line: 482, column: 9)
!1281 = !DILocation(line: 484, column: 11, scope: !1280)
!1282 = !DILocation(line: 485, column: 11, scope: !1280)
!1283 = !DILocation(line: 486, column: 12, scope: !1280)
!1284 = !DILocation(line: 481, column: 50, scope: !1276)
!1285 = distinct !{!1285, !1278, !1286, !756, !757}
!1286 = !DILocation(line: 487, column: 9, scope: !1277)
!1287 = !DILocation(line: 494, column: 11, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1213, file: !669, line: 493, column: 9)
!1289 = !DILocation(line: 495, column: 11, scope: !1288)
!1290 = !DILocation(line: 496, column: 11, scope: !1288)
!1291 = !DILocation(line: 497, column: 12, scope: !1288)
!1292 = !DILocation(line: 492, column: 50, scope: !1213)
!1293 = distinct !{!1293, !1216, !1294, !756, !757}
!1294 = !DILocation(line: 498, column: 9, scope: !1214)
!1295 = !DILocation(line: 505, column: 11, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1206, file: !669, line: 504, column: 9)
!1297 = !DILocation(line: 0, scope: !826, inlinedAt: !1298)
!1298 = distinct !DILocation(line: 505, column: 11, scope: !1296)
!1299 = !DILocation(line: 92, column: 13, scope: !834, inlinedAt: !1298)
!1300 = !DILocation(line: 92, column: 7, scope: !826, inlinedAt: !1298)
!1301 = !DILocation(line: 94, column: 13, scope: !837, inlinedAt: !1298)
!1302 = !DILocation(line: 94, column: 7, scope: !826, inlinedAt: !1298)
!1303 = !DILocation(line: 96, column: 26, scope: !826, inlinedAt: !1298)
!1304 = !DILocation(line: 96, column: 10, scope: !826, inlinedAt: !1298)
!1305 = !DILocation(line: 96, column: 3, scope: !826, inlinedAt: !1298)
!1306 = !DILocation(line: 506, column: 12, scope: !1296)
!1307 = !DILocation(line: 503, column: 50, scope: !1206)
!1308 = distinct !{!1308, !1211, !1309, !756, !757}
!1309 = !DILocation(line: 507, column: 9, scope: !1207)
!1310 = !DILocation(line: 513, column: 9, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1162, file: !669, line: 513, column: 9)
!1312 = !DILocation(line: 513, column: 60, scope: !1311)
!1313 = !DILocation(line: 513, column: 9, scope: !1162)
!1314 = !DILocation(line: 515, column: 16, scope: !1170)
!1315 = !DILocation(line: 515, column: 33, scope: !1170)
!1316 = !DILocation(line: 515, column: 9, scope: !1162)
!1317 = !DILocation(line: 523, column: 65, scope: !1169)
!1318 = !DILocation(line: 523, column: 75, scope: !1169)
!1319 = !DILocation(line: 0, scope: !1001, inlinedAt: !1320)
!1320 = distinct !DILocation(line: 523, column: 17, scope: !1169)
!1321 = !DILocation(line: 30, column: 3, scope: !1001, inlinedAt: !1320)
!1322 = !DILocation(line: 31, column: 5, scope: !1001, inlinedAt: !1320)
!1323 = !DILocation(line: 35, column: 10, scope: !1001, inlinedAt: !1320)
!1324 = !DILocation(line: 36, column: 17, scope: !1001, inlinedAt: !1320)
!1325 = !DILocation(line: 36, column: 63, scope: !1001, inlinedAt: !1320)
!1326 = !DILocation(line: 36, column: 10, scope: !1001, inlinedAt: !1320)
!1327 = !DILocation(line: 37, column: 1, scope: !1001, inlinedAt: !1320)
!1328 = !DILocation(line: 0, scope: !1169)
!1329 = !DILocation(line: 524, column: 21, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1169, file: !669, line: 524, column: 13)
!1331 = !DILocation(line: 524, column: 13, scope: !1169)
!1332 = !DILocation(line: 526, column: 7, scope: !1169)
!1333 = !DILocation(line: 413, column: 41, scope: !1163)
!1334 = distinct !{!1334, !1193, !1335, !756, !757}
!1335 = !DILocation(line: 527, column: 3, scope: !1164)
!1336 = !DILocation(line: 405, column: 9, scope: !1150)
!1337 = !DILocation(line: 528, column: 14, scope: !1150)
!1338 = !DILocation(line: 529, column: 7, scope: !1150)
!1339 = !DILocation(line: 530, column: 12, scope: !1340)
!1340 = distinct !DILexicalBlock(scope: !1150, file: !669, line: 529, column: 7)
!1341 = !DILocation(line: 530, column: 17, scope: !1340)
!1342 = !DILocation(line: 530, column: 5, scope: !1340)
!1343 = !DILocation(line: 531, column: 10, scope: !1150)
!1344 = !DILocation(line: 532, column: 3, scope: !1150)
!1345 = !DILocation(line: 533, column: 1, scope: !1150)
!1346 = distinct !DISubprogram(name: "SeparateImages", scope: !669, file: !669, line: 565, type: !670, scopeLine: 567, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1352}
!1348 = !DILocalVariable(name: "image", arg: 1, scope: !1346, file: !669, line: 565, type: !672)
!1349 = !DILocalVariable(name: "channel", arg: 2, scope: !1346, file: !669, line: 565, type: !674)
!1350 = !DILocalVariable(name: "exception", arg: 3, scope: !1346, file: !669, line: 566, type: !676)
!1351 = !DILocalVariable(name: "images", scope: !1346, file: !669, line: 569, type: !432)
!1352 = !DILocalVariable(name: "separate_image", scope: !1346, file: !669, line: 570, type: !432)
!1353 = !DILocation(line: 0, scope: !1346)
!1354 = !DILocation(line: 568, column: 3, scope: !1346)
!1355 = !DILocation(line: 574, column: 14, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1346, file: !669, line: 574, column: 7)
!1357 = !DILocation(line: 574, column: 20, scope: !1356)
!1358 = !DILocation(line: 574, column: 7, scope: !1346)
!1359 = !DILocation(line: 575, column: 68, scope: !1356)
!1360 = !DILocation(line: 575, column: 12, scope: !1356)
!1361 = !DILocation(line: 575, column: 5, scope: !1356)
!1362 = !DILocation(line: 576, column: 10, scope: !1346)
!1363 = !DILocation(line: 576, column: 9, scope: !1346)
!1364 = !{!716, !716, i64 0}
!1365 = !DILocation(line: 577, column: 16, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !1346, file: !669, line: 577, column: 7)
!1367 = !DILocation(line: 577, column: 30, scope: !1366)
!1368 = !DILocation(line: 577, column: 7, scope: !1346)
!1369 = !DILocation(line: 579, column: 22, scope: !1370)
!1370 = distinct !DILexicalBlock(scope: !1366, file: !669, line: 578, column: 5)
!1371 = !DILocation(line: 580, column: 14, scope: !1370)
!1372 = !DILocation(line: 581, column: 7, scope: !1370)
!1373 = !DILocation(line: 582, column: 5, scope: !1370)
!1374 = !DILocation(line: 583, column: 16, scope: !1375)
!1375 = distinct !DILexicalBlock(scope: !1346, file: !669, line: 583, column: 7)
!1376 = !DILocation(line: 583, column: 32, scope: !1375)
!1377 = !DILocation(line: 583, column: 7, scope: !1346)
!1378 = !DILocation(line: 585, column: 22, scope: !1379)
!1379 = distinct !DILexicalBlock(scope: !1375, file: !669, line: 584, column: 5)
!1380 = !DILocation(line: 586, column: 14, scope: !1379)
!1381 = !DILocation(line: 587, column: 7, scope: !1379)
!1382 = !DILocation(line: 588, column: 5, scope: !1379)
!1383 = !DILocation(line: 589, column: 16, scope: !1384)
!1384 = distinct !DILexicalBlock(scope: !1346, file: !669, line: 589, column: 7)
!1385 = !DILocation(line: 589, column: 31, scope: !1384)
!1386 = !DILocation(line: 589, column: 7, scope: !1346)
!1387 = !DILocation(line: 591, column: 22, scope: !1388)
!1388 = distinct !DILexicalBlock(scope: !1384, file: !669, line: 590, column: 5)
!1389 = !DILocation(line: 592, column: 14, scope: !1388)
!1390 = !DILocation(line: 593, column: 7, scope: !1388)
!1391 = !DILocation(line: 594, column: 5, scope: !1388)
!1392 = !DILocation(line: 595, column: 17, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1346, file: !669, line: 595, column: 7)
!1394 = !DILocation(line: 595, column: 33, scope: !1393)
!1395 = !DILocation(line: 595, column: 39, scope: !1393)
!1396 = !DILocation(line: 595, column: 50, scope: !1393)
!1397 = !DILocation(line: 595, column: 61, scope: !1393)
!1398 = !DILocation(line: 595, column: 7, scope: !1346)
!1399 = !DILocation(line: 597, column: 22, scope: !1400)
!1400 = distinct !DILexicalBlock(scope: !1393, file: !669, line: 596, column: 5)
!1401 = !DILocation(line: 598, column: 14, scope: !1400)
!1402 = !DILocation(line: 599, column: 7, scope: !1400)
!1403 = !DILocation(line: 600, column: 5, scope: !1400)
!1404 = !DILocation(line: 601, column: 16, scope: !1405)
!1405 = distinct !DILexicalBlock(scope: !1346, file: !669, line: 601, column: 7)
!1406 = !DILocation(line: 601, column: 32, scope: !1405)
!1407 = !DILocation(line: 601, column: 7, scope: !1346)
!1408 = !DILocation(line: 603, column: 22, scope: !1409)
!1409 = distinct !DILexicalBlock(scope: !1405, file: !669, line: 602, column: 5)
!1410 = !DILocation(line: 604, column: 14, scope: !1409)
!1411 = !DILocation(line: 605, column: 7, scope: !1409)
!1412 = !DILocation(line: 606, column: 5, scope: !1409)
!1413 = !DILocation(line: 607, column: 10, scope: !1346)
!1414 = !DILocation(line: 608, column: 1, scope: !1346)
!1415 = !DILocation(line: 607, column: 3, scope: !1346)
!1416 = !DISubprogram(name: "NewImageList", scope: !1059, file: !1059, line: 36, type: !1417, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!432}
!1419 = !DISubprogram(name: "AppendImageToList", scope: !1059, file: !1059, line: 51, type: !1420, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1053)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{null, !1422, !672}
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!1423 = distinct !DISubprogram(name: "SetImageAlphaChannel", scope: !669, file: !669, line: 639, type: !1424, scopeLine: 641, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1428)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!448, !432, !1426}
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1427)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlphaChannelType", file: !73, line: 45, baseType: !415)
!1428 = !{!1429, !1430, !1431, !1432, !1435, !1436, !1437, !1438, !1452, !1453, !1454, !1458, !1459, !1460, !1464, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1476, !1477, !1478, !1482}
!1429 = !DILocalVariable(name: "image", arg: 1, scope: !1423, file: !669, line: 639, type: !432)
!1430 = !DILocalVariable(name: "alpha_type", arg: 2, scope: !1423, file: !669, line: 640, type: !1426)
!1431 = !DILocalVariable(name: "status", scope: !1423, file: !669, line: 643, type: !448)
!1432 = !DILocalVariable(name: "image_view", scope: !1433, file: !669, line: 660, type: !682)
!1433 = distinct !DILexicalBlock(scope: !1434, file: !669, line: 658, column: 5)
!1434 = distinct !DILexicalBlock(scope: !1423, file: !669, line: 651, column: 3)
!1435 = !DILocalVariable(name: "exception", scope: !1433, file: !669, line: 663, type: !676)
!1436 = !DILocalVariable(name: "index", scope: !1433, file: !669, line: 666, type: !656)
!1437 = !DILocalVariable(name: "status", scope: !1433, file: !669, line: 669, type: !448)
!1438 = !DILocalVariable(name: "background", scope: !1433, file: !669, line: 672, type: !1439)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !1440, file: !326, line: 107, baseType: !437, size: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1440, file: !326, line: 110, baseType: !439, size: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1440, file: !326, line: 113, baseType: !448, size: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1440, file: !326, line: 116, baseType: !469, size: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1440, file: !326, line: 119, baseType: !443, size: 64, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1440, file: !326, line: 122, baseType: !659, size: 32, offset: 256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1440, file: !326, line: 123, baseType: !659, size: 32, offset: 288)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1440, file: !326, line: 124, baseType: !659, size: 32, offset: 320)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1440, file: !326, line: 125, baseType: !659, size: 32, offset: 352)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1440, file: !326, line: 126, baseType: !659, size: 32, offset: 384)
!1452 = !DILocalVariable(name: "pixel", scope: !1433, file: !669, line: 675, type: !456)
!1453 = !DILocalVariable(name: "y", scope: !1433, file: !669, line: 678, type: !496)
!1454 = !DILocalVariable(name: "indexes", scope: !1455, file: !669, line: 704, type: !1165)
!1455 = distinct !DILexicalBlock(scope: !1456, file: !669, line: 702, column: 7)
!1456 = distinct !DILexicalBlock(scope: !1457, file: !669, line: 701, column: 7)
!1457 = distinct !DILexicalBlock(scope: !1433, file: !669, line: 701, column: 7)
!1458 = !DILocalVariable(name: "q", scope: !1455, file: !669, line: 707, type: !700)
!1459 = !DILocalVariable(name: "x", scope: !1455, file: !669, line: 710, type: !496)
!1460 = !DILocalVariable(name: "background", scope: !1461, file: !669, line: 755, type: !1439)
!1461 = distinct !DILexicalBlock(scope: !1462, file: !669, line: 753, column: 9)
!1462 = distinct !DILexicalBlock(scope: !1463, file: !669, line: 752, column: 11)
!1463 = distinct !DILexicalBlock(scope: !1434, file: !669, line: 745, column: 5)
!1464 = !DILocalVariable(name: "image_view", scope: !1465, file: !669, line: 782, type: !682)
!1465 = distinct !DILexicalBlock(scope: !1434, file: !669, line: 780, column: 5)
!1466 = !DILocalVariable(name: "exception", scope: !1465, file: !669, line: 785, type: !676)
!1467 = !DILocalVariable(name: "index", scope: !1465, file: !669, line: 788, type: !656)
!1468 = !DILocalVariable(name: "status", scope: !1465, file: !669, line: 791, type: !448)
!1469 = !DILocalVariable(name: "background", scope: !1465, file: !669, line: 794, type: !1439)
!1470 = !DILocalVariable(name: "pixel", scope: !1465, file: !669, line: 797, type: !456)
!1471 = !DILocalVariable(name: "y", scope: !1465, file: !669, line: 800, type: !496)
!1472 = !DILocalVariable(name: "indexes", scope: !1473, file: !669, line: 826, type: !1165)
!1473 = distinct !DILexicalBlock(scope: !1474, file: !669, line: 824, column: 7)
!1474 = distinct !DILexicalBlock(scope: !1475, file: !669, line: 823, column: 7)
!1475 = distinct !DILexicalBlock(scope: !1465, file: !669, line: 823, column: 7)
!1476 = !DILocalVariable(name: "q", scope: !1473, file: !669, line: 829, type: !700)
!1477 = !DILocalVariable(name: "x", scope: !1473, file: !669, line: 832, type: !496)
!1478 = !DILocalVariable(name: "gamma", scope: !1479, file: !669, line: 846, type: !469)
!1479 = distinct !DILexicalBlock(scope: !1480, file: !669, line: 844, column: 9)
!1480 = distinct !DILexicalBlock(scope: !1481, file: !669, line: 843, column: 9)
!1481 = distinct !DILexicalBlock(scope: !1473, file: !669, line: 843, column: 9)
!1482 = !DILocalVariable(name: "opacity", scope: !1479, file: !669, line: 847, type: !469)
!1483 = !DILocation(line: 0, scope: !1423)
!1484 = !DILocation(line: 646, column: 14, scope: !1485)
!1485 = distinct !DILexicalBlock(scope: !1423, file: !669, line: 646, column: 7)
!1486 = !DILocation(line: 646, column: 20, scope: !1485)
!1487 = !DILocation(line: 646, column: 7, scope: !1423)
!1488 = !DILocation(line: 647, column: 12, scope: !1485)
!1489 = !DILocation(line: 647, column: 5, scope: !1485)
!1490 = !DILocation(line: 650, column: 3, scope: !1423)
!1491 = !DILocation(line: 654, column: 14, scope: !1492)
!1492 = distinct !DILexicalBlock(scope: !1434, file: !669, line: 653, column: 5)
!1493 = !DILocation(line: 654, column: 19, scope: !1492)
!1494 = !DILocation(line: 655, column: 7, scope: !1492)
!1495 = !DILocation(line: 671, column: 7, scope: !1433)
!1496 = !DILocation(line: 672, column: 9, scope: !1433)
!1497 = !DILocation(line: 683, column: 18, scope: !1498)
!1498 = distinct !DILexicalBlock(scope: !1433, file: !669, line: 683, column: 11)
!1499 = !DILocation(line: 683, column: 24, scope: !1498)
!1500 = !DILocation(line: 683, column: 11, scope: !1433)
!1501 = !DILocation(line: 685, column: 11, scope: !1502)
!1502 = distinct !DILexicalBlock(scope: !1433, file: !669, line: 685, column: 11)
