; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/cipher.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/cipher.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!323 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!324 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 31, baseType: !5, size: 32, elements: !327)
!326 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!328 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!329 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!330 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!331 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!332 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!333 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!334 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!335 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!336 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!337 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!338 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!339 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!340 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!341 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 47, baseType: !5, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!344 = !DIEnumerator(name: "UndefinedType", value: 0)
!345 = !DIEnumerator(name: "BilevelType", value: 1)
!346 = !DIEnumerator(name: "GrayscaleType", value: 2)
!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!348 = !DIEnumerator(name: "PaletteType", value: 4)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!350 = !DIEnumerator(name: "TrueColorType", value: 6)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!354 = !DIEnumerator(name: "OptimizeType", value: 10)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!372 = !DIEnumerator(name: "NoEvents", value: 0)
!373 = !DIEnumerator(name: "TraceEvent", value: 1)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!375 = !DIEnumerator(name: "BlobEvent", value: 4)
!376 = !DIEnumerator(name: "CacheEvent", value: 8)
!377 = !DIEnumerator(name: "CoderEvent", value: 16)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!380 = !DIEnumerator(name: "DrawEvent", value: 128)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!382 = !DIEnumerator(name: "ImageEvent", value: 512)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384)
!388 = !DIEnumerator(name: "UserEvent", value: 36864)
!389 = !DIEnumerator(name: "WandEvent", value: 65536)
!390 = !DIEnumerator(name: "X11Event", value: 131072)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!393 = !{!394, !395, !450}
!394 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !398)
!398 = !{!399, !401, !403, !405, !408, !410, !412, !413, !414, !415, !416, !417, !428, !429, !430, !431, !433, !447, !449, !451, !453, !456, !457, !458, !464, !465, !466, !474, !475, !476, !477, !478, !479, !481, !483, !485, !487, !489, !491, !493, !494, !495, !496, !497, !498, !499, !507, !522, !536, !537, !538, !539, !543, !547, !551, !552, !553, !554, !555, !573, !574, !576, !577, !587, !588, !590, !591, !592, !593, !594, !595, !597, !598, !599, !600, !601, !602, !603, !605, !606, !607, !608, !609, !613, !615}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !397, file: !77, line: 153, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !397, file: !77, line: 156, baseType: !402, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !397, file: !77, line: 159, baseType: !404, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !397, file: !77, line: 162, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !407, line: 46, baseType: !394)
!407 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !397, file: !77, line: 165, baseType: !409, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !397, file: !77, line: 168, baseType: !411, size: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !397, file: !77, line: 169, baseType: !411, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !397, file: !77, line: 172, baseType: !406, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !397, file: !77, line: 173, baseType: !406, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !397, file: !77, line: 174, baseType: !406, size: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !397, file: !77, line: 175, baseType: !406, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !397, file: !77, line: 178, baseType: !418, size: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !421)
!421 = !{!422, !425, !426, !427}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !420, file: !326, line: 143, baseType: !423, size: 16)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !424)
!424 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !420, file: !326, line: 144, baseType: !423, size: 16, offset: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !420, file: !326, line: 145, baseType: !423, size: 16, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !420, file: !326, line: 146, baseType: !423, size: 16, offset: 48)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !397, file: !77, line: 179, baseType: !419, size: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !397, file: !77, line: 180, baseType: !419, size: 64, offset: 704)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !397, file: !77, line: 181, baseType: !419, size: 64, offset: 768)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !397, file: !77, line: 184, baseType: !432, size: 64, offset: 832)
!432 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !397, file: !77, line: 187, baseType: !434, size: 768, offset: 896)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !436)
!436 = !{!437, !444, !445, !446}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !435, file: !77, line: 124, baseType: !438, size: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !440)
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !439, file: !77, line: 98, baseType: !432, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !439, file: !77, line: 99, baseType: !432, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !439, file: !77, line: 100, baseType: !432, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !435, file: !77, line: 125, baseType: !438, size: 192, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !435, file: !77, line: 126, baseType: !438, size: 192, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !435, file: !77, line: 127, baseType: !438, size: 192, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !397, file: !77, line: 190, baseType: !448, size: 32, offset: 1664)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !397, file: !77, line: 193, baseType: !450, size: 64, offset: 1728)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !397, file: !77, line: 196, baseType: !452, size: 32, offset: 1792)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !397, file: !77, line: 199, baseType: !454, size: 64, offset: 1856)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !397, file: !77, line: 200, baseType: !454, size: 64, offset: 1920)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !397, file: !77, line: 201, baseType: !454, size: 64, offset: 1984)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !397, file: !77, line: 204, baseType: !459, size: 64, offset: 2048)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !460, line: 77, baseType: !461)
!460 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !462, line: 193, baseType: !463)
!462 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!463 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !397, file: !77, line: 207, baseType: !432, size: 64, offset: 2112)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !397, file: !77, line: 208, baseType: !432, size: 64, offset: 2176)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !397, file: !77, line: 211, baseType: !467, size: 256, offset: 2240)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !468, file: !153, line: 124, baseType: !406, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !468, file: !153, line: 125, baseType: !406, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !468, file: !153, line: 128, baseType: !459, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !468, file: !153, line: 129, baseType: !459, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !397, file: !77, line: 212, baseType: !467, size: 256, offset: 2496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !397, file: !77, line: 213, baseType: !467, size: 256, offset: 2752)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !397, file: !77, line: 216, baseType: !432, size: 64, offset: 3008)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !397, file: !77, line: 217, baseType: !432, size: 64, offset: 3072)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !397, file: !77, line: 218, baseType: !432, size: 64, offset: 3136)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !397, file: !77, line: 221, baseType: !480, size: 32, offset: 3200)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !397, file: !77, line: 224, baseType: !482, size: 32, offset: 3232)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !397, file: !77, line: 227, baseType: !484, size: 32, offset: 3264)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !397, file: !77, line: 230, baseType: !486, size: 32, offset: 3296)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !397, file: !77, line: 233, baseType: !488, size: 32, offset: 3328)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !397, file: !77, line: 236, baseType: !490, size: 32, offset: 3360)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !397, file: !77, line: 239, baseType: !492, size: 64, offset: 3392)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !397, file: !77, line: 242, baseType: !406, size: 64, offset: 3456)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !397, file: !77, line: 243, baseType: !406, size: 64, offset: 3520)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !397, file: !77, line: 246, baseType: !459, size: 64, offset: 3584)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !397, file: !77, line: 249, baseType: !406, size: 64, offset: 3648)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !397, file: !77, line: 250, baseType: !406, size: 64, offset: 3712)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !397, file: !77, line: 253, baseType: !459, size: 64, offset: 3776)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !397, file: !77, line: 256, baseType: !500, size: 192, offset: 3840)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !501, line: 68, baseType: !502)
!501 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !501, line: 62, size: 192, elements: !503)
!503 = !{!504, !505, !506}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !502, file: !501, line: 65, baseType: !432, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !502, file: !501, line: 66, baseType: !432, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !502, file: !501, line: 67, baseType: !432, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !397, file: !77, line: 259, baseType: !508, size: 512, offset: 4032)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !510)
!510 = !{!511, !518, !519, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !509, file: !247, line: 43, baseType: !512, size: 192)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !514)
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !513, file: !247, line: 35, baseType: !432, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !513, file: !247, line: 36, baseType: !432, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !513, file: !247, line: 37, baseType: !432, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !509, file: !247, line: 44, baseType: !512, size: 192, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !509, file: !247, line: 47, baseType: !520, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !509, file: !247, line: 50, baseType: !406, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !397, file: !77, line: 262, baseType: !523, size: 64, offset: 4544)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !524, line: 26, baseType: !525)
!524 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!411, !528, !530, !533, !450}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !532)
!532 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !535)
!535 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !397, file: !77, line: 265, baseType: !450, size: 64, offset: 4608)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !397, file: !77, line: 266, baseType: !450, size: 64, offset: 4672)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !397, file: !77, line: 267, baseType: !450, size: 64, offset: 4736)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !397, file: !77, line: 270, baseType: !540, size: 64, offset: 4800)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !397, file: !77, line: 273, baseType: !544, size: 64, offset: 4864)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !546)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !397, file: !77, line: 276, baseType: !548, size: 32768, offset: 4928)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 32768, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 4096)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !397, file: !77, line: 277, baseType: !548, size: 32768, offset: 37696)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !397, file: !77, line: 278, baseType: !548, size: 32768, offset: 70464)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !397, file: !77, line: 281, baseType: !406, size: 64, offset: 103232)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !397, file: !77, line: 282, baseType: !406, size: 64, offset: 103296)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !397, file: !77, line: 285, baseType: !556, size: 448, offset: 103360)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !558)
!558 = !{!559, !561, !563, !564, !565, !566, !567, !572}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !557, file: !253, line: 105, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !557, file: !253, line: 108, baseType: !562, size: 32, offset: 32)
!562 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !557, file: !253, line: 111, baseType: !454, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !557, file: !253, line: 112, baseType: !454, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !557, file: !253, line: 115, baseType: !450, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !557, file: !253, line: 118, baseType: !411, size: 32, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !557, file: !253, line: 121, baseType: !568, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !570, line: 26, baseType: !571)
!570 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !570, line: 25, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !557, file: !253, line: 124, baseType: !406, size: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !397, file: !77, line: 288, baseType: !411, size: 32, offset: 103808)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !397, file: !77, line: 291, baseType: !575, size: 64, offset: 103872)
!575 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !459)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !397, file: !77, line: 294, baseType: !568, size: 64, offset: 103936)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !397, file: !77, line: 297, baseType: !578, size: 256, offset: 104000)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !580)
!580 = !{!581, !582, !583, !586}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !89, line: 30, baseType: !454, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !579, file: !89, line: 33, baseType: !406, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !579, file: !89, line: 36, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !579, file: !89, line: 39, baseType: !406, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !397, file: !77, line: 298, baseType: !578, size: 256, offset: 104256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !397, file: !77, line: 299, baseType: !589, size: 64, offset: 104512)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !397, file: !77, line: 302, baseType: !406, size: 64, offset: 104576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !397, file: !77, line: 305, baseType: !406, size: 64, offset: 104640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !397, file: !77, line: 308, baseType: !492, size: 64, offset: 104704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !397, file: !77, line: 309, baseType: !492, size: 64, offset: 104768)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !77, line: 310, baseType: !492, size: 64, offset: 104832)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !397, file: !77, line: 313, baseType: !596, size: 32, offset: 104896)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !397, file: !77, line: 316, baseType: !411, size: 32, offset: 104928)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !397, file: !77, line: 319, baseType: !419, size: 64, offset: 104960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !397, file: !77, line: 322, baseType: !492, size: 64, offset: 105024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !397, file: !77, line: 325, baseType: !467, size: 256, offset: 105088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !397, file: !77, line: 328, baseType: !450, size: 64, offset: 105344)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !397, file: !77, line: 329, baseType: !450, size: 64, offset: 105408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !397, file: !77, line: 332, baseType: !604, size: 32, offset: 105472)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !397, file: !77, line: 335, baseType: !411, size: 32, offset: 105504)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !397, file: !77, line: 338, baseType: !534, size: 64, offset: 105536)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !397, file: !77, line: 341, baseType: !411, size: 32, offset: 105600)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !397, file: !77, line: 344, baseType: !406, size: 64, offset: 105664)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !397, file: !77, line: 347, baseType: !610, size: 64, offset: 105728)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !611, line: 7, baseType: !612)
!611 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !462, line: 160, baseType: !463)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !397, file: !77, line: 350, baseType: !614, size: 32, offset: 105792)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !397, file: !77, line: 353, baseType: !406, size: 64, offset: 105856)
!616 = !{i32 7, !"Dwarf Version", i32 5}
!617 = !{i32 2, !"Debug Info Version", i32 3}
!618 = !{i32 1, !"wchar_size", i32 4}
!619 = !{i32 7, !"PIC Level", i32 2}
!620 = !{i32 7, !"PIE Level", i32 2}
!621 = !{i32 7, !"uwtable", i32 2}
!622 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!623 = distinct !DISubprogram(name: "DecipherImage", scope: !624, file: !624, line: 1114, type: !625, scopeLine: 1116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !628)
!624 = !DIFile(filename: "apps/538.imagick_r/src/magick/cipher.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53aad58e18d0e7841e68fa1a0ec74082")
!625 = !DISubroutineType(types: !626)
!626 = !{!411, !395, !528, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!628 = !{!629, !630, !631}
!629 = !DILocalVariable(name: "image", arg: 1, scope: !623, file: !624, line: 1114, type: !395)
!630 = !DILocalVariable(name: "passphrase", arg: 2, scope: !623, file: !624, line: 1115, type: !528)
!631 = !DILocalVariable(name: "exception", arg: 3, scope: !623, file: !624, line: 1115, type: !627)
!632 = !DILocation(line: 0, scope: !623)
!633 = !DILocation(line: 1119, column: 14, scope: !634)
!634 = distinct !DILexicalBlock(scope: !623, file: !624, line: 1119, column: 7)
!635 = !{!636, !637, i64 12976}
!636 = !{!"_Image", !637, i64 0, !637, i64 4, !637, i64 8, !639, i64 16, !637, i64 24, !637, i64 28, !637, i64 32, !639, i64 40, !639, i64 48, !639, i64 56, !639, i64 64, !640, i64 72, !641, i64 80, !641, i64 88, !641, i64 96, !643, i64 104, !644, i64 112, !637, i64 208, !640, i64 216, !637, i64 224, !640, i64 232, !640, i64 240, !640, i64 248, !639, i64 256, !643, i64 264, !643, i64 272, !646, i64 280, !646, i64 312, !646, i64 344, !643, i64 376, !643, i64 384, !643, i64 392, !637, i64 400, !637, i64 404, !637, i64 408, !637, i64 412, !637, i64 416, !637, i64 420, !640, i64 424, !639, i64 432, !639, i64 440, !639, i64 448, !639, i64 456, !639, i64 464, !639, i64 472, !647, i64 480, !648, i64 504, !640, i64 568, !640, i64 576, !640, i64 584, !640, i64 592, !640, i64 600, !640, i64 608, !637, i64 616, !637, i64 4712, !637, i64 8808, !639, i64 12904, !639, i64 12912, !650, i64 12920, !637, i64 12976, !639, i64 12984, !640, i64 12992, !652, i64 13000, !652, i64 13032, !640, i64 13064, !639, i64 13072, !639, i64 13080, !640, i64 13088, !640, i64 13096, !640, i64 13104, !637, i64 13112, !637, i64 13116, !641, i64 13120, !640, i64 13128, !646, i64 13136, !640, i64 13168, !640, i64 13176, !637, i64 13184, !637, i64 13188, !653, i64 13192, !637, i64 13200, !639, i64 13208, !639, i64 13216, !637, i64 13224, !639, i64 13232}
!637 = !{!"omnipotent char", !638, i64 0}
!638 = !{!"Simple C/C++ TBAA"}
!639 = !{!"long", !637, i64 0}
!640 = !{!"any pointer", !637, i64 0}
!641 = !{!"_PixelPacket", !642, i64 0, !642, i64 2, !642, i64 4, !642, i64 6}
!642 = !{!"short", !637, i64 0}
!643 = !{!"double", !637, i64 0}
!644 = !{!"_ChromaticityInfo", !645, i64 0, !645, i64 24, !645, i64 48, !645, i64 72}
!645 = !{!"_PrimaryInfo", !643, i64 0, !643, i64 8, !643, i64 16}
!646 = !{!"_RectangleInfo", !639, i64 0, !639, i64 8, !639, i64 16, !639, i64 24}
!647 = !{!"_ErrorInfo", !643, i64 0, !643, i64 8, !643, i64 16}
!648 = !{!"_TimerInfo", !649, i64 0, !649, i64 24, !637, i64 48, !639, i64 56}
!649 = !{!"_Timer", !643, i64 0, !643, i64 8, !643, i64 16}
!650 = !{!"_ExceptionInfo", !637, i64 0, !651, i64 4, !640, i64 8, !640, i64 16, !640, i64 24, !637, i64 32, !640, i64 40, !639, i64 48}
!651 = !{!"int", !637, i64 0}
!652 = !{!"_ProfileInfo", !640, i64 0, !639, i64 8, !640, i64 16, !639, i64 24}
!653 = !{!"long long", !637, i64 0}
!654 = !DILocation(line: 1119, column: 20, scope: !634)
!655 = !DILocation(line: 1119, column: 7, scope: !623)
!656 = !DILocation(line: 1120, column: 68, scope: !634)
!657 = !DILocation(line: 1120, column: 12, scope: !634)
!658 = !DILocation(line: 1120, column: 5, scope: !634)
!659 = !DILocation(line: 1124, column: 3, scope: !660)
!660 = distinct !DILexicalBlock(scope: !661, file: !624, line: 1124, column: 3)
!661 = distinct !DILexicalBlock(scope: !623, file: !624, line: 1124, column: 3)
!662 = !DILocation(line: 1124, column: 3, scope: !661)
!663 = !DISubprogram(name: "LogMagickEvent", scope: !369, file: !369, line: 83, type: !664, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !669)
!664 = !DISubroutineType(types: !665)
!665 = !{!411, !666, !528, !528, !668, !528, null}
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !369, line: 58, baseType: !368)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!669 = !{}
!670 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !671, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !669)
!671 = !DISubroutineType(types: !672)
!672 = !{!411, !627, !528, !528, !668, !673, !528, !528, null}
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!674 = distinct !DISubprogram(name: "PasskeyDecipherImage", scope: !624, file: !624, line: 1127, type: !675, scopeLine: 1129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !687)
!675 = !DISubroutineType(types: !676)
!676 = !{!411, !395, !677, !627}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !680, line: 40, baseType: !681)
!680 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !680, line: 29, size: 32960, elements: !682)
!682 = !{!683, !684, !685, !686}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !681, file: !680, line: 32, baseType: !548, size: 32768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !681, file: !680, line: 35, baseType: !584, size: 64, offset: 32768)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !681, file: !680, line: 38, baseType: !406, size: 64, offset: 32832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !681, file: !680, line: 39, baseType: !406, size: 64, offset: 32896)
!687 = !{!688, !689, !690}
!688 = !DILocalVariable(name: "image", arg: 1, scope: !674, file: !624, line: 1127, type: !395)
!689 = !DILocalVariable(name: "passkey", arg: 2, scope: !674, file: !624, line: 1128, type: !677)
!690 = !DILocalVariable(name: "exception", arg: 3, scope: !674, file: !624, line: 1128, type: !627)
!691 = !DILocation(line: 0, scope: !674)
!692 = !DILocation(line: 1132, column: 14, scope: !693)
!693 = distinct !DILexicalBlock(scope: !674, file: !624, line: 1132, column: 7)
!694 = !DILocation(line: 1132, column: 20, scope: !693)
!695 = !DILocation(line: 1132, column: 7, scope: !674)
!696 = !DILocation(line: 1133, column: 68, scope: !693)
!697 = !DILocation(line: 1133, column: 12, scope: !693)
!698 = !DILocation(line: 1133, column: 5, scope: !693)
!699 = !DILocation(line: 1137, column: 3, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !624, line: 1137, column: 3)
!701 = distinct !DILexicalBlock(scope: !674, file: !624, line: 1137, column: 3)
!702 = !DILocation(line: 1137, column: 3, scope: !701)
!703 = distinct !DISubprogram(name: "EncipherImage", scope: !624, file: !624, line: 1170, type: !625, scopeLine: 1172, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !704)
!704 = !{!705, !706, !707}
!705 = !DILocalVariable(name: "image", arg: 1, scope: !703, file: !624, line: 1170, type: !395)
!706 = !DILocalVariable(name: "passphrase", arg: 2, scope: !703, file: !624, line: 1171, type: !528)
!707 = !DILocalVariable(name: "exception", arg: 3, scope: !703, file: !624, line: 1171, type: !627)
!708 = !DILocation(line: 0, scope: !703)
!709 = !DILocation(line: 1175, column: 14, scope: !710)
!710 = distinct !DILexicalBlock(scope: !703, file: !624, line: 1175, column: 7)
!711 = !DILocation(line: 1175, column: 20, scope: !710)
!712 = !DILocation(line: 1175, column: 7, scope: !703)
!713 = !DILocation(line: 1176, column: 68, scope: !710)
!714 = !DILocation(line: 1176, column: 12, scope: !710)
!715 = !DILocation(line: 1176, column: 5, scope: !710)
!716 = !DILocation(line: 1180, column: 3, scope: !717)
!717 = distinct !DILexicalBlock(scope: !718, file: !624, line: 1180, column: 3)
!718 = distinct !DILexicalBlock(scope: !703, file: !624, line: 1180, column: 3)
!719 = !DILocation(line: 1180, column: 3, scope: !718)
!720 = distinct !DISubprogram(name: "PasskeyEncipherImage", scope: !624, file: !624, line: 1183, type: !675, scopeLine: 1185, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !721)
!721 = !{!722, !723, !724}
!722 = !DILocalVariable(name: "image", arg: 1, scope: !720, file: !624, line: 1183, type: !395)
!723 = !DILocalVariable(name: "passkey", arg: 2, scope: !720, file: !624, line: 1184, type: !677)
!724 = !DILocalVariable(name: "exception", arg: 3, scope: !720, file: !624, line: 1184, type: !627)
!725 = !DILocation(line: 0, scope: !720)
!726 = !DILocation(line: 1188, column: 14, scope: !727)
!727 = distinct !DILexicalBlock(scope: !720, file: !624, line: 1188, column: 7)
!728 = !DILocation(line: 1188, column: 20, scope: !727)
!729 = !DILocation(line: 1188, column: 7, scope: !720)
!730 = !DILocation(line: 1189, column: 68, scope: !727)
!731 = !DILocation(line: 1189, column: 12, scope: !727)
!732 = !DILocation(line: 1189, column: 5, scope: !727)
!733 = !DILocation(line: 1193, column: 3, scope: !734)
!734 = distinct !DILexicalBlock(scope: !735, file: !624, line: 1193, column: 3)
!735 = distinct !DILexicalBlock(scope: !720, file: !624, line: 1193, column: 3)
!736 = !DILocation(line: 1193, column: 3, scope: !735)
