; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/coder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/coder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._CoderMapInfo = type { ptr, ptr }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._CoderInfo = type { ptr, ptr, ptr, i32, i32, ptr, ptr, i64 }

@coder_semaphore = internal global ptr null, align 8, !dbg !0
@coder_cache = internal unnamed_addr global ptr null, align 8, !dbg !235
@.str = private unnamed_addr constant [2 x i8] c"*\00", align 1
@.str.1 = private unnamed_addr constant [84 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/coder.c\00", align 1
@.str.2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@stdout = external local_unnamed_addr global ptr, align 8
@.str.4 = private unnamed_addr constant [12 x i8] c"\0APath: %s\0A\0A\00", align 1
@.str.5 = private unnamed_addr constant [19 x i8] c"Magick      Coder\0A\00", align 1
@.str.6 = private unnamed_addr constant [81 x i8] c"-------------------------------------------------------------------------------\0A\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c" \00", align 1

!59 = !DIEnumerator(name: "ConfigureError", value: 495)
!60 = !DIEnumerator(name: "PolicyError", value: 499)
!61 = !DIEnumerator(name: "FatalErrorException", value: 700)
!62 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!63 = !DIEnumerator(name: "TypeFatalError", value: 705)
!64 = !DIEnumerator(name: "OptionFatalError", value: 710)
!65 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!66 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!67 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!68 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!69 = !DIEnumerator(name: "BlobFatalError", value: 735)
!70 = !DIEnumerator(name: "StreamFatalError", value: 740)
!71 = !DIEnumerator(name: "CacheFatalError", value: 745)
!72 = !DIEnumerator(name: "CoderFatalError", value: 750)
!73 = !DIEnumerator(name: "FilterFatalError", value: 752)
!74 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!75 = !DIEnumerator(name: "DrawFatalError", value: 760)
!76 = !DIEnumerator(name: "ImageFatalError", value: 765)
!77 = !DIEnumerator(name: "WandFatalError", value: 770)
!78 = !DIEnumerator(name: "RandomFatalError", value: 775)
!79 = !DIEnumerator(name: "XServerFatalError", value: 780)
!80 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!81 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!82 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!83 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 34, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!87 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!88 = !DIEnumerator(name: "NoEvents", value: 0)
!89 = !DIEnumerator(name: "TraceEvent", value: 1)
!90 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!91 = !DIEnumerator(name: "BlobEvent", value: 4)
!92 = !DIEnumerator(name: "CacheEvent", value: 8)
!93 = !DIEnumerator(name: "CoderEvent", value: 16)
!94 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!95 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!96 = !DIEnumerator(name: "DrawEvent", value: 128)
!97 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!98 = !DIEnumerator(name: "ImageEvent", value: 512)
!99 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!100 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!101 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!102 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!103 = !DIEnumerator(name: "TransformEvent", value: 16384)
!104 = !DIEnumerator(name: "UserEvent", value: 36864)
!105 = !DIEnumerator(name: "WandEvent", value: 65536)
!106 = !DIEnumerator(name: "X11Event", value: 131072)
!107 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!108 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 25, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120}
!112 = !DIEnumerator(name: "UndefinedPath", value: 0)
!113 = !DIEnumerator(name: "MagickPath", value: 1)
!114 = !DIEnumerator(name: "RootPath", value: 2)
!115 = !DIEnumerator(name: "HeadPath", value: 3)
!116 = !DIEnumerator(name: "TailPath", value: 4)
!117 = !DIEnumerator(name: "BasePath", value: 5)
!118 = !DIEnumerator(name: "ExtensionPath", value: 6)
!119 = !DIEnumerator(name: "SubimagePath", value: 7)
!120 = !DIEnumerator(name: "CanonicalPath", value: 8)
!121 = !{!122, !126, !127, !131, !152, !151, !154, !149, !155, !156, !138, !157, !215, !218, !165, !219}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !124, line: 26, baseType: !125)
!124 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !124, line: 25, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !129, line: 26, baseType: !130)
!129 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !129, line: 25, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "CoderInfo", file: !134, line: 42, baseType: !135)
!134 = !DIFile(filename: "apps/538.imagick_r/src/magick/coder.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b19db32cde4adab4a8107a917daf2a2c")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CoderInfo", file: !134, line: 25, size: 448, elements: !136)
!136 = !{!137, !140, !141, !142, !144, !145, !147, !148}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !135, file: !134, line: 28, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !135, file: !134, line: 29, baseType: !138, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !134, line: 30, baseType: !138, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !135, file: !134, line: 33, baseType: !143, size: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !135, file: !134, line: 34, baseType: !143, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !135, file: !134, line: 37, baseType: !146, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !134, line: 38, baseType: !146, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !135, file: !134, line: 41, baseType: !149, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!151 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !160, line: 7, baseType: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !162, line: 49, size: 1728, elements: !163)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!163 = !{!164, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !180, !182, !183, !184, !188, !190, !192, !196, !199, !201, !204, !207, !208, !209, !210, !211}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !161, file: !162, line: 51, baseType: !165, size: 32)
!165 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !161, file: !162, line: 54, baseType: !138, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !161, file: !162, line: 55, baseType: !138, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !161, file: !162, line: 56, baseType: !138, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !161, file: !162, line: 57, baseType: !138, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !161, file: !162, line: 58, baseType: !138, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !161, file: !162, line: 59, baseType: !138, size: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !161, file: !162, line: 60, baseType: !138, size: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !161, file: !162, line: 61, baseType: !138, size: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !161, file: !162, line: 64, baseType: !138, size: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !161, file: !162, line: 65, baseType: !138, size: 64, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !161, file: !162, line: 66, baseType: !138, size: 64, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !161, file: !162, line: 68, baseType: !178, size: 64, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !162, line: 36, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !161, file: !162, line: 70, baseType: !181, size: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !161, file: !162, line: 72, baseType: !165, size: 32, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !161, file: !162, line: 73, baseType: !165, size: 32, offset: 928)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !161, file: !162, line: 74, baseType: !185, size: 64, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !186, line: 152, baseType: !187)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!187 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !161, file: !162, line: 77, baseType: !189, size: 16, offset: 1024)
!189 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !161, file: !162, line: 78, baseType: !191, size: 8, offset: 1040)
!191 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !161, file: !162, line: 79, baseType: !193, size: 8, offset: 1048)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !161, file: !162, line: 81, baseType: !197, size: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !162, line: 43, baseType: null)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !161, file: !162, line: 89, baseType: !200, size: 64, offset: 1152)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !186, line: 153, baseType: !187)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !161, file: !162, line: 91, baseType: !202, size: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !162, line: 37, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !161, file: !162, line: 92, baseType: !205, size: 64, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !162, line: 38, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !161, file: !162, line: 93, baseType: !181, size: 64, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !161, file: !162, line: 94, baseType: !126, size: 64, offset: 1408)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !161, file: !162, line: 95, baseType: !149, size: 64, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !161, file: !162, line: 96, baseType: !165, size: 32, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !161, file: !162, line: 98, baseType: !212, size: 160, offset: 1568)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 160, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 20)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !216, line: 77, baseType: !217)
!216 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !186, line: 193, baseType: !187)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !222, line: 40, baseType: !223)
!222 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !222, line: 29, size: 32960, elements: !224)
!224 = !{!225, !229, !232, !233}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !223, file: !222, line: 32, baseType: !226, size: 32768)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 32768, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 4096)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !223, file: !222, line: 35, baseType: !230, size: 64, offset: 32768)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !223, file: !222, line: 38, baseType: !149, size: 64, offset: 32832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !223, file: !222, line: 39, baseType: !149, size: 64, offset: 32896)
!234 = !{!0, !235, !238}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "coder_cache", scope: !2, file: !237, line: 236, type: !127, isLocal: true, isDefinition: true)
!237 = !DIFile(filename: "apps/538.imagick_r/src/magick/coder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "91bd6c814c23b7fee73bb832f75d1f0c")
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "CoderMap", scope: !2, file: !237, line: 81, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 18432, elements: !247)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "CoderMapInfo", file: !237, line: 75, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CoderMapInfo", file: !237, line: 70, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !243, file: !237, line: 73, baseType: !152, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !237, line: 74, baseType: !152, size: 64, offset: 64)
!247 = !{!248}
!248 = !DISubrange(count: 144)
!249 = !{i32 7, !"Dwarf Version", i32 5}
!250 = !{i32 2, !"Debug Info Version", i32 3}
!251 = !{i32 1, !"wchar_size", i32 4}
!252 = !{i32 7, !"PIC Level", i32 2}
!253 = !{i32 7, !"PIE Level", i32 2}
!254 = !{i32 7, !"uwtable", i32 2}
!255 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!256 = distinct !DISubprogram(name: "CoderComponentGenesis", scope: !237, file: !237, line: 378, type: !257, scopeLine: 379, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{!143}
!259 = !{}
!260 = !DILocation(line: 380, column: 7, scope: !261)
!261 = distinct !DILexicalBlock(scope: !256, file: !237, line: 380, column: 7)
!262 = !{!263, !263, i64 0}
!263 = !{!"any pointer", !264, i64 0}
!264 = !{!"omnipotent char", !265, i64 0}
!265 = !{!"Simple C/C++ TBAA"}
!266 = !DILocation(line: 380, column: 23, scope: !261)
!267 = !DILocation(line: 380, column: 7, scope: !256)
!268 = !DILocation(line: 381, column: 21, scope: !261)
!269 = !DILocation(line: 381, column: 20, scope: !261)
!270 = !DILocation(line: 381, column: 5, scope: !261)
!271 = !DILocation(line: 382, column: 3, scope: !256)
!272 = !DISubprogram(name: "AllocateSemaphoreInfo", scope: !124, file: !124, line: 32, type: !273, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !259)
!273 = !DISubroutineType(types: !274)
!274 = !{!122}
!275 = distinct !DISubprogram(name: "CoderComponentTerminus", scope: !237, file: !237, line: 403, type: !276, scopeLine: 404, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !259)
!276 = !DISubroutineType(types: !277)
!277 = !{null}
!278 = !DILocation(line: 405, column: 7, scope: !279)
!279 = distinct !DILexicalBlock(scope: !275, file: !237, line: 405, column: 7)
!280 = !DILocation(line: 405, column: 23, scope: !279)
!281 = !DILocation(line: 405, column: 7, scope: !275)
!282 = !DILocation(line: 406, column: 5, scope: !279)
!283 = !DILocation(line: 407, column: 21, scope: !275)
!284 = !DILocation(line: 407, column: 3, scope: !275)
!285 = !DILocation(line: 408, column: 7, scope: !286)
!286 = distinct !DILexicalBlock(scope: !275, file: !237, line: 408, column: 7)
!287 = !DILocation(line: 408, column: 19, scope: !286)
!288 = !DILocation(line: 408, column: 7, scope: !275)
!289 = !DILocation(line: 409, column: 17, scope: !286)
!290 = !DILocation(line: 409, column: 16, scope: !286)
!291 = !DILocation(line: 409, column: 5, scope: !286)
!292 = !DILocation(line: 410, column: 23, scope: !275)
!293 = !DILocation(line: 410, column: 3, scope: !275)
!294 = !DILocation(line: 411, column: 3, scope: !275)
!295 = !DILocation(line: 412, column: 1, scope: !275)
!296 = !DISubprogram(name: "ActivateSemaphoreInfo", scope: !124, file: !124, line: 35, type: !297, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !259)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!300 = !DISubprogram(name: "LockSemaphoreInfo", scope: !124, file: !124, line: 37, type: !301, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !259)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !122}
!303 = !DISubprogram(name: "DestroySplayTree", scope: !129, file: !129, line: 44, type: !304, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !259)
!304 = !DISubroutineType(types: !305)
!305 = !{!127, !127}
!306 = !DISubprogram(name: "UnlockSemaphoreInfo", scope: !124, file: !124, line: 39, type: !301, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !259)
!307 = !DISubprogram(name: "DestroySemaphoreInfo", scope: !124, file: !124, line: 36, type: !297, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !259)
!308 = distinct !DISubprogram(name: "GetCoderInfo", scope: !237, file: !237, line: 439, type: !309, scopeLine: 441, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !324)
!309 = !DISubroutineType(types: !310)
!310 = !{!131, !152, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !12, line: 102, size: 448, elements: !314)
!314 = !{!315, !317, !318, !319, !320, !321, !322, !323}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !313, file: !12, line: 105, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !12, line: 100, baseType: !11)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !313, file: !12, line: 108, baseType: !165, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !313, file: !12, line: 111, baseType: !138, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !313, file: !12, line: 112, baseType: !138, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !313, file: !12, line: 115, baseType: !126, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !313, file: !12, line: 118, baseType: !143, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !313, file: !12, line: 121, baseType: !122, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !313, file: !12, line: 124, baseType: !149, size: 64, offset: 384)
!324 = !{!325, !326, !327}
!325 = !DILocalVariable(name: "name", arg: 1, scope: !308, file: !237, line: 439, type: !152)
!326 = !DILocalVariable(name: "exception", arg: 2, scope: !308, file: !237, line: 440, type: !311)
!327 = !DILocalVariable(name: "coder_info", scope: !308, file: !237, line: 443, type: !131)
!328 = !DILocation(line: 0, scope: !308)
!329 = !DILocalVariable(name: "exception", arg: 1, scope: !330, file: !237, line: 655, type: !311)
!330 = distinct !DISubprogram(name: "IsCoderTreeInstantiated", scope: !237, file: !237, line: 655, type: !331, scopeLine: 656, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !333)
!331 = !DISubroutineType(types: !332)
!332 = !{!143, !311}
!333 = !{!329}
!334 = !DILocation(line: 0, scope: !330, inlinedAt: !335)
!335 = distinct !DILocation(line: 446, column: 7, scope: !336)
!336 = distinct !DILexicalBlock(scope: !308, file: !237, line: 446, column: 7)
!337 = !DILocation(line: 657, column: 7, scope: !338, inlinedAt: !335)
!338 = distinct !DILexicalBlock(scope: !330, file: !237, line: 657, column: 7)
!339 = !DILocation(line: 657, column: 19, scope: !338, inlinedAt: !335)
!340 = !DILocation(line: 657, column: 7, scope: !330, inlinedAt: !335)
!341 = !DILocation(line: 659, column: 11, scope: !342, inlinedAt: !335)
!342 = distinct !DILexicalBlock(scope: !343, file: !237, line: 659, column: 11)
!343 = distinct !DILexicalBlock(scope: !338, file: !237, line: 658, column: 5)
!344 = !DILocation(line: 659, column: 27, scope: !342, inlinedAt: !335)
!345 = !DILocation(line: 659, column: 11, scope: !343, inlinedAt: !335)
!346 = !DILocation(line: 660, column: 9, scope: !342, inlinedAt: !335)
!347 = !DILocation(line: 661, column: 25, scope: !343, inlinedAt: !335)
!348 = !DILocation(line: 661, column: 7, scope: !343, inlinedAt: !335)
!349 = !DILocation(line: 662, column: 11, scope: !350, inlinedAt: !335)
!350 = distinct !DILexicalBlock(scope: !343, file: !237, line: 662, column: 11)
!351 = !DILocation(line: 662, column: 23, scope: !350, inlinedAt: !335)
!352 = !DILocation(line: 662, column: 11, scope: !343, inlinedAt: !335)
!353 = !DILocalVariable(name: "filename", arg: 1, scope: !354, file: !237, line: 291, type: !152)
!354 = distinct !DISubprogram(name: "AcquireCoderCache", scope: !237, file: !237, line: 291, type: !355, scopeLine: 293, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{!127, !152, !311}
!357 = !{!353, !358, !359, !360, !365, !367, !368, !369, !372, !373, !377}
!358 = !DILocalVariable(name: "exception", arg: 2, scope: !354, file: !237, line: 292, type: !311)
!359 = !DILocalVariable(name: "option", scope: !354, file: !237, line: 295, type: !219)
!360 = !DILocalVariable(name: "options", scope: !354, file: !237, line: 298, type: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !363, line: 34, baseType: !364)
!363 = !DIFile(filename: "apps/538.imagick_r/src/magick/hashmap.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "683c2bd26601474466c188c023adadf2")
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !363, line: 33, flags: DIFlagFwdDecl)
!365 = !DILocalVariable(name: "status", scope: !354, file: !237, line: 301, type: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !6, line: 147, baseType: !7)
!367 = !DILocalVariable(name: "i", scope: !354, file: !237, line: 304, type: !215)
!368 = !DILocalVariable(name: "coder_cache", scope: !354, file: !237, line: 307, type: !127)
