; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/color.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/color.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ColorMapInfo = type { ptr, i8, i8, i8, float, i64 }
%struct._ColorInfo = type { ptr, ptr, i32, %struct._MagickPixelPacket, i32, i32, ptr, ptr, i64 }
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }

!493 = !DIEnumerator(name: "UndefinedType", value: 0)
!494 = !DIEnumerator(name: "BilevelType", value: 1)
!495 = !DIEnumerator(name: "GrayscaleType", value: 2)
!496 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!497 = !DIEnumerator(name: "PaletteType", value: 4)
!498 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!499 = !DIEnumerator(name: "TrueColorType", value: 6)
!500 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!501 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!502 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!503 = !DIEnumerator(name: "OptimizeType", value: 10)
!504 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !475, line: 67, baseType: !7, size: 32, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!507 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!508 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!509 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!510 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!511 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!512 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!513 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!514 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!515 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!516 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !375, line: 25, baseType: !7, size: 32, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!519 = !DIEnumerator(name: "NoValue", value: 0)
!520 = !DIEnumerator(name: "XValue", value: 1)
!521 = !DIEnumerator(name: "XiValue", value: 1)
!522 = !DIEnumerator(name: "YValue", value: 2)
!523 = !DIEnumerator(name: "PsiValue", value: 2)
!524 = !DIEnumerator(name: "WidthValue", value: 4)
!525 = !DIEnumerator(name: "RhoValue", value: 4)
!526 = !DIEnumerator(name: "HeightValue", value: 8)
!527 = !DIEnumerator(name: "SigmaValue", value: 8)
!528 = !DIEnumerator(name: "ChiValue", value: 16)
!529 = !DIEnumerator(name: "XiNegative", value: 32)
!530 = !DIEnumerator(name: "XNegative", value: 32)
!531 = !DIEnumerator(name: "PsiNegative", value: 64)
!532 = !DIEnumerator(name: "YNegative", value: 64)
!533 = !DIEnumerator(name: "ChiNegative", value: 128)
!534 = !DIEnumerator(name: "PercentValue", value: 4096)
!535 = !DIEnumerator(name: "AspectValue", value: 8192)
!536 = !DIEnumerator(name: "NormalizeValue", value: 8192)
!537 = !DIEnumerator(name: "LessValue", value: 16384)
!538 = !DIEnumerator(name: "GreaterValue", value: 32768)
!539 = !DIEnumerator(name: "MinimumValue", value: 65536)
!540 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536)
!541 = !DIEnumerator(name: "AreaValue", value: 131072)
!542 = !DIEnumerator(name: "DecimalValue", value: 262144)
!543 = !DIEnumerator(name: "SeparatorValue", value: 524288)
!544 = !DIEnumerator(name: "AllValues", value: 2147483647)
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !546, line: 25, baseType: !7, size: 32, elements: !547)
!546 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556}
!548 = !DIEnumerator(name: "UndefinedPath", value: 0)
!549 = !DIEnumerator(name: "MagickPath", value: 1)
!550 = !DIEnumerator(name: "RootPath", value: 2)
!551 = !DIEnumerator(name: "HeadPath", value: 3)
!552 = !DIEnumerator(name: "TailPath", value: 4)
!553 = !DIEnumerator(name: "BasePath", value: 5)
!554 = !DIEnumerator(name: "ExtensionPath", value: 6)
!555 = !DIEnumerator(name: "SubimagePath", value: 7)
!556 = !DIEnumerator(name: "CanonicalPath", value: 8)
!557 = !{!558, !562, !563, !567, !607, !199, !609, !610, !611, !593, !612, !589, !613, !591, !614, !573, !595, !615, !620, !626, !631, !685, !687, !585, !7, !872, !873, !577, !883, !629}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !560, line: 26, baseType: !561)
!560 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !560, line: 25, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !565, line: 34, baseType: !566)
!565 = !DIFile(filename: "apps/538.imagick_r/src/magick/hashmap.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "683c2bd26601474466c188c023adadf2")
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !565, line: 33, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorInfo", file: !12, line: 60, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ColorInfo", file: !12, line: 38, size: 896, elements: !571)
!571 = !{!572, !575, !576, !578, !601, !602, !603, !605, !606}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !570, file: !12, line: 41, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !570, file: !12, line: 42, baseType: !573, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "compliance", scope: !570, file: !12, line: 45, baseType: !577, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ComplianceType", file: !12, line: 36, baseType: !11)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !570, file: !12, line: 48, baseType: !579, size: 448, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !475, line: 127, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !475, line: 104, size: 448, elements: !581)
!581 = !{!582, !584, !586, !588, !590, !594, !597, !598, !599, !600}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !580, file: !475, line: 107, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !20)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !580, file: !475, line: 110, baseType: !585, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !26, line: 61, baseType: !25)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !580, file: !475, line: 113, baseType: !587, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !580, file: !475, line: 116, baseType: !589, size: 64, offset: 128)
!589 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !580, file: !475, line: 119, baseType: !591, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !592, line: 46, baseType: !593)
!592 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!593 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !580, file: !475, line: 122, baseType: !595, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !6, line: 78, baseType: !596)
!596 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !580, file: !475, line: 123, baseType: !595, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !580, file: !475, line: 124, baseType: !595, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !580, file: !475, line: 125, baseType: !595, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !580, file: !475, line: 126, baseType: !595, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !570, file: !12, line: 51, baseType: !587, size: 32, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !570, file: !12, line: 52, baseType: !587, size: 32, offset: 672)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !570, file: !12, line: 55, baseType: !604, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !570, file: !12, line: 56, baseType: !604, size: 64, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !570, file: !12, line: 59, baseType: !591, size: 64, offset: 832)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!609 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!610 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !610)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !616, line: 77, baseType: !617)
!616 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !618, line: 193, baseType: !619)
!618 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!619 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !621, line: 26, baseType: !622)
!621 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!587, !607, !625, !628, !562}
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !627)
!627 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !630)
!630 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !634, line: 7, baseType: !635)
!634 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !636, line: 49, size: 1728, elements: !637)
!636 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !653, !655, !656, !657, !659, !660, !662, !666, !669, !671, !674, !677, !678, !679, !680, !681}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !635, file: !636, line: 51, baseType: !199, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !635, file: !636, line: 54, baseType: !573, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !635, file: !636, line: 55, baseType: !573, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !635, file: !636, line: 56, baseType: !573, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !635, file: !636, line: 57, baseType: !573, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !635, file: !636, line: 58, baseType: !573, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !635, file: !636, line: 59, baseType: !573, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !635, file: !636, line: 60, baseType: !573, size: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !635, file: !636, line: 61, baseType: !573, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !635, file: !636, line: 64, baseType: !573, size: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !635, file: !636, line: 65, baseType: !573, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !635, file: !636, line: 66, baseType: !573, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !635, file: !636, line: 68, baseType: !651, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !636, line: 36, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !635, file: !636, line: 70, baseType: !654, size: 64, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !635, file: !636, line: 72, baseType: !199, size: 32, offset: 896)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !635, file: !636, line: 73, baseType: !199, size: 32, offset: 928)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !635, file: !636, line: 74, baseType: !658, size: 64, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !618, line: 152, baseType: !619)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !635, file: !636, line: 77, baseType: !610, size: 16, offset: 1024)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !635, file: !636, line: 78, baseType: !661, size: 8, offset: 1040)
!661 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !635, file: !636, line: 79, baseType: !663, size: 8, offset: 1048)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 8, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 1)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !635, file: !636, line: 81, baseType: !667, size: 64, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !636, line: 43, baseType: null)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !635, file: !636, line: 89, baseType: !670, size: 64, offset: 1152)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !618, line: 153, baseType: !619)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !635, file: !636, line: 91, baseType: !672, size: 64, offset: 1216)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !636, line: 37, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !635, file: !636, line: 92, baseType: !675, size: 64, offset: 1280)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !636, line: 38, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !635, file: !636, line: 93, baseType: !654, size: 64, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !635, file: !636, line: 94, baseType: !562, size: 64, offset: 1408)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !635, file: !636, line: 95, baseType: !591, size: 64, offset: 1472)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !635, file: !636, line: 96, baseType: !199, size: 32, offset: 1536)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !635, file: !636, line: 98, baseType: !682, size: 160, offset: 1568)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 160, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 20)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !475, line: 129, baseType: !612)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !299, line: 150, size: 105920, elements: !690)
!690 = !{!691, !692, !693, !695, !696, !698, !699, !700, !701, !702, !703, !704, !713, !714, !715, !716, !717, !731, !733, !734, !736, !737, !738, !739, !740, !741, !742, !750, !751, !752, !753, !754, !755, !757, !759, !761, !763, !765, !767, !769, !770, !771, !772, !773, !774, !775, !782, !797, !798, !799, !800, !801, !805, !809, !813, !814, !815, !816, !817, !830, !831, !833, !834, !843, !844, !846, !847, !848, !849, !850, !851, !853, !854, !855, !856, !857, !858, !859, !861, !862, !863, !864, !865, !869, !871}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !689, file: !299, line: 153, baseType: !583, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !689, file: !299, line: 156, baseType: !585, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !689, file: !299, line: 159, baseType: !694, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !274, line: 49, baseType: !273)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !689, file: !299, line: 162, baseType: !591, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !689, file: !299, line: 165, baseType: !697, size: 32, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !299, line: 86, baseType: !298)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !689, file: !299, line: 168, baseType: !587, size: 32, offset: 224)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !689, file: !299, line: 169, baseType: !587, size: 32, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !689, file: !299, line: 172, baseType: !591, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !689, file: !299, line: 173, baseType: !591, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !689, file: !299, line: 174, baseType: !591, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !689, file: !299, line: 175, baseType: !591, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !689, file: !299, line: 178, baseType: !705, size: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !475, line: 148, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !475, line: 131, size: 64, elements: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !707, file: !475, line: 143, baseType: !612, size: 16)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !707, file: !475, line: 144, baseType: !612, size: 16, offset: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !707, file: !475, line: 145, baseType: !612, size: 16, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !707, file: !475, line: 146, baseType: !612, size: 16, offset: 48)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !689, file: !299, line: 179, baseType: !706, size: 64, offset: 640)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !689, file: !299, line: 180, baseType: !706, size: 64, offset: 704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !689, file: !299, line: 181, baseType: !706, size: 64, offset: 768)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !689, file: !299, line: 184, baseType: !589, size: 64, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !689, file: !299, line: 187, baseType: !718, size: 768, offset: 896)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !299, line: 128, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !299, line: 121, size: 768, elements: !720)
!720 = !{!721, !728, !729, !730}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !719, file: !299, line: 124, baseType: !722, size: 192)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !299, line: 101, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !299, line: 95, size: 192, elements: !724)
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !723, file: !299, line: 98, baseType: !589, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !723, file: !299, line: 99, baseType: !589, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !723, file: !299, line: 100, baseType: !589, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !719, file: !299, line: 125, baseType: !722, size: 192, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !719, file: !299, line: 126, baseType: !722, size: 192, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !719, file: !299, line: 127, baseType: !722, size: 192, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !689, file: !299, line: 190, baseType: !732, size: 32, offset: 1664)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !311, line: 49, baseType: !310)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !689, file: !299, line: 193, baseType: !562, size: 64, offset: 1728)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !689, file: !299, line: 196, baseType: !735, size: 32, offset: 1792)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !299, line: 93, baseType: !318)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !689, file: !299, line: 199, baseType: !573, size: 64, offset: 1856)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !689, file: !299, line: 200, baseType: !573, size: 64, offset: 1920)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !689, file: !299, line: 201, baseType: !573, size: 64, offset: 1984)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !689, file: !299, line: 204, baseType: !615, size: 64, offset: 2048)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !689, file: !299, line: 207, baseType: !589, size: 64, offset: 2112)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !689, file: !299, line: 208, baseType: !589, size: 64, offset: 2176)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !689, file: !299, line: 211, baseType: !743, size: 256, offset: 2240)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !375, line: 130, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !375, line: 121, size: 256, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !744, file: !375, line: 124, baseType: !591, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !744, file: !375, line: 125, baseType: !591, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !744, file: !375, line: 128, baseType: !615, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !744, file: !375, line: 129, baseType: !615, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !689, file: !299, line: 212, baseType: !743, size: 256, offset: 2496)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !689, file: !299, line: 213, baseType: !743, size: 256, offset: 2752)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !689, file: !299, line: 216, baseType: !589, size: 64, offset: 3008)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !689, file: !299, line: 217, baseType: !589, size: 64, offset: 3072)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !689, file: !299, line: 218, baseType: !589, size: 64, offset: 3136)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !689, file: !299, line: 221, baseType: !756, size: 32, offset: 3200)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !324, line: 66, baseType: !323)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !689, file: !299, line: 224, baseType: !758, size: 32, offset: 3232)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !299, line: 73, baseType: !358)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !689, file: !299, line: 227, baseType: !760, size: 32, offset: 3264)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !369, line: 35, baseType: !368)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !689, file: !299, line: 230, baseType: !762, size: 32, offset: 3296)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !375, line: 91, baseType: !374)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !689, file: !299, line: 233, baseType: !764, size: 32, offset: 3328)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !390, line: 99, baseType: !389)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !689, file: !299, line: 236, baseType: !766, size: 32, offset: 3360)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !461, line: 32, baseType: !460)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !689, file: !299, line: 239, baseType: !768, size: 64, offset: 3392)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !689, file: !299, line: 242, baseType: !591, size: 64, offset: 3456)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !689, file: !299, line: 243, baseType: !591, size: 64, offset: 3520)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !689, file: !299, line: 246, baseType: !615, size: 64, offset: 3584)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !689, file: !299, line: 249, baseType: !591, size: 64, offset: 3648)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !689, file: !299, line: 250, baseType: !591, size: 64, offset: 3712)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !689, file: !299, line: 253, baseType: !615, size: 64, offset: 3776)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !689, file: !299, line: 256, baseType: !776, size: 192, offset: 3840)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !12, line: 68, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !12, line: 62, size: 192, elements: !778)
!778 = !{!779, !780, !781}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !777, file: !12, line: 65, baseType: !589, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !777, file: !12, line: 66, baseType: !589, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !777, file: !12, line: 67, baseType: !589, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !689, file: !299, line: 259, baseType: !783, size: 512, offset: 4032)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !469, line: 51, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !469, line: 40, size: 512, elements: !785)
!785 = !{!786, !793, !794, !796}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !784, file: !469, line: 43, baseType: !787, size: 192)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !469, line: 38, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !469, line: 32, size: 192, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !788, file: !469, line: 35, baseType: !589, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !788, file: !469, line: 36, baseType: !589, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !788, file: !469, line: 37, baseType: !589, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !784, file: !469, line: 44, baseType: !787, size: 192, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !784, file: !469, line: 47, baseType: !795, size: 32, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !469, line: 30, baseType: !468)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !784, file: !469, line: 50, baseType: !591, size: 64, offset: 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !689, file: !299, line: 262, baseType: !620, size: 64, offset: 4544)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !689, file: !299, line: 265, baseType: !562, size: 64, offset: 4608)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !689, file: !299, line: 266, baseType: !562, size: 64, offset: 4672)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !689, file: !299, line: 267, baseType: !562, size: 64, offset: 4736)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !689, file: !299, line: 270, baseType: !802, size: 64, offset: 4800)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !274, line: 52, baseType: !804)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !274, line: 51, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !689, file: !299, line: 273, baseType: !806, size: 64, offset: 4864)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !808)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !689, file: !299, line: 276, baseType: !810, size: 32768, offset: 4928)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 32768, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 4096)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !689, file: !299, line: 277, baseType: !810, size: 32768, offset: 37696)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !689, file: !299, line: 278, baseType: !810, size: 32768, offset: 70464)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !689, file: !299, line: 281, baseType: !591, size: 64, offset: 103232)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !689, file: !299, line: 282, baseType: !591, size: 64, offset: 103296)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !689, file: !299, line: 285, baseType: !818, size: 448, offset: 103360)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !63, line: 102, size: 448, elements: !820)
!820 = !{!821, !823, !824, !825, !826, !827, !828, !829}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !819, file: !63, line: 105, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !63, line: 100, baseType: !62)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !819, file: !63, line: 108, baseType: !199, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !819, file: !63, line: 111, baseType: !573, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !819, file: !63, line: 112, baseType: !573, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !819, file: !63, line: 115, baseType: !562, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !819, file: !63, line: 118, baseType: !587, size: 32, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !819, file: !63, line: 121, baseType: !558, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !819, file: !63, line: 124, baseType: !591, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !689, file: !299, line: 288, baseType: !587, size: 32, offset: 103808)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !689, file: !299, line: 291, baseType: !832, size: 64, offset: 103872)
!832 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !615)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !689, file: !299, line: 294, baseType: !558, size: 64, offset: 103936)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !689, file: !299, line: 297, baseType: !835, size: 256, offset: 104000)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !311, line: 40, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !311, line: 27, size: 256, elements: !837)
!837 = !{!838, !839, !840, !842}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !836, file: !311, line: 30, baseType: !573, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !836, file: !311, line: 33, baseType: !591, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !836, file: !311, line: 36, baseType: !841, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !836, file: !311, line: 39, baseType: !591, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !689, file: !299, line: 298, baseType: !835, size: 256, offset: 104256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !689, file: !299, line: 299, baseType: !845, size: 64, offset: 104512)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !689, file: !299, line: 302, baseType: !591, size: 64, offset: 104576)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !689, file: !299, line: 305, baseType: !591, size: 64, offset: 104640)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !689, file: !299, line: 308, baseType: !768, size: 64, offset: 104704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !689, file: !299, line: 309, baseType: !768, size: 64, offset: 104768)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !689, file: !299, line: 310, baseType: !768, size: 64, offset: 104832)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !689, file: !299, line: 313, baseType: !852, size: 32, offset: 104896)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !475, line: 47, baseType: !474)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !689, file: !299, line: 316, baseType: !587, size: 32, offset: 104928)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !689, file: !299, line: 319, baseType: !706, size: 64, offset: 104960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !689, file: !299, line: 322, baseType: !768, size: 64, offset: 105024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !689, file: !299, line: 325, baseType: !743, size: 256, offset: 105088)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !689, file: !299, line: 328, baseType: !562, size: 64, offset: 105344)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !689, file: !299, line: 329, baseType: !562, size: 64, offset: 105408)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !689, file: !299, line: 332, baseType: !860, size: 32, offset: 105472)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !299, line: 61, baseType: !491)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !689, file: !299, line: 335, baseType: !587, size: 32, offset: 105504)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !689, file: !299, line: 338, baseType: !629, size: 64, offset: 105536)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !689, file: !299, line: 341, baseType: !587, size: 32, offset: 105600)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !689, file: !299, line: 344, baseType: !591, size: 64, offset: 105664)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !689, file: !299, line: 347, baseType: !866, size: 64, offset: 105728)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !867, line: 7, baseType: !868)
!867 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !618, line: 160, baseType: !619)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !689, file: !299, line: 350, baseType: !870, size: 32, offset: 105792)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !475, line: 79, baseType: !505)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !689, file: !299, line: 353, baseType: !591, size: 64, offset: 105856)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !876, line: 40, baseType: !877)
!876 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !876, line: 29, size: 32960, elements: !878)
!878 = !{!879, !880, !881, !882}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !877, file: !876, line: 32, baseType: !810, size: 32768)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !877, file: !876, line: 35, baseType: !841, size: 64, offset: 32768)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !877, file: !876, line: 38, baseType: !591, size: 64, offset: 32832)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !877, file: !876, line: 39, baseType: !591, size: 64, offset: 32896)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!885 = !{!0, !886, !889}
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "color_cache", scope: !2, file: !888, line: 786, type: !563, isLocal: true, isDefinition: true)
!888 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "93582e7902575721988efc4eab97ca2a")
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "ColorMap", scope: !2, file: !888, line: 100, type: !891, isLocal: true, isDefinition: true)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 130176, elements: !905)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorMapInfo", file: !888, line: 94, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ColorMapInfo", file: !888, line: 79, size: 192, elements: !895)
!895 = !{!896, !897, !899, !900, !901, !903}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !894, file: !888, line: 82, baseType: !607, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !894, file: !888, line: 85, baseType: !898, size: 8, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !894, file: !888, line: 86, baseType: !898, size: 8, offset: 72)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !894, file: !888, line: 87, baseType: !898, size: 8, offset: 80)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !894, file: !888, line: 90, baseType: !902, size: 32, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "compliance", scope: !894, file: !888, line: 93, baseType: !904, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!905 = !{!906}
!906 = !DISubrange(count: 678)
!907 = !{i32 7, !"Dwarf Version", i32 5}
!908 = !{i32 2, !"Debug Info Version", i32 3}
!909 = !{i32 1, !"wchar_size", i32 4}
!910 = !{i32 7, !"PIC Level", i32 2}
!911 = !{i32 7, !"PIE Level", i32 2}
!912 = !{i32 7, !"uwtable", i32 2}
!913 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!914 = distinct !DISubprogram(name: "ColorComponentGenesis", scope: !888, file: !888, line: 917, type: !915, scopeLine: 918, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !917)
!915 = !DISubroutineType(types: !916)
!916 = !{!587}
!917 = !{}
!918 = !DILocation(line: 919, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !914, file: !888, line: 919, column: 7)
!920 = !{!921, !921, i64 0}
!921 = !{!"any pointer", !922, i64 0}
!922 = !{!"omnipotent char", !923, i64 0}
!923 = !{!"Simple C/C++ TBAA"}
!924 = !DILocation(line: 919, column: 23, scope: !919)
!925 = !DILocation(line: 919, column: 7, scope: !914)
!926 = !DILocation(line: 920, column: 21, scope: !919)
!927 = !DILocation(line: 920, column: 20, scope: !919)
!928 = !DILocation(line: 920, column: 5, scope: !919)
!929 = !DILocation(line: 921, column: 3, scope: !914)
!930 = !DISubprogram(name: "AllocateSemaphoreInfo", scope: !560, file: !560, line: 32, type: !931, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!931 = !DISubroutineType(types: !932)
!932 = !{!558}
!933 = distinct !DISubprogram(name: "ColorComponentTerminus", scope: !888, file: !888, line: 960, type: !934, scopeLine: 961, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !917)
!934 = !DISubroutineType(types: !935)
!935 = !{null}
!936 = !DILocation(line: 962, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !933, file: !888, line: 962, column: 7)
!938 = !DILocation(line: 962, column: 23, scope: !937)
!939 = !DILocation(line: 962, column: 7, scope: !933)
!940 = !DILocation(line: 963, column: 5, scope: !937)
!941 = !DILocation(line: 964, column: 21, scope: !933)
!942 = !DILocation(line: 964, column: 3, scope: !933)
!943 = !DILocation(line: 965, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !933, file: !888, line: 965, column: 7)
!945 = !DILocation(line: 965, column: 19, scope: !944)
!946 = !DILocation(line: 965, column: 7, scope: !933)
!947 = !DILocation(line: 966, column: 17, scope: !944)
!948 = !DILocation(line: 966, column: 16, scope: !944)
!949 = !DILocation(line: 966, column: 5, scope: !944)
!950 = !DILocation(line: 967, column: 23, scope: !933)
!951 = !DILocation(line: 967, column: 3, scope: !933)
!952 = !DILocation(line: 968, column: 3, scope: !933)
!953 = !DILocation(line: 969, column: 1, scope: !933)
!954 = !DISubprogram(name: "ActivateSemaphoreInfo", scope: !560, file: !560, line: 35, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!958 = !DISubprogram(name: "LockSemaphoreInfo", scope: !560, file: !560, line: 37, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !558}
!961 = !DISubprogram(name: "DestroyLinkedList", scope: !565, file: !565, line: 42, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!962 = !DISubroutineType(types: !963)
!963 = !{!563, !563, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!562, !562}
!967 = distinct !DISubprogram(name: "DestroyColorElement", scope: !888, file: !888, line: 943, type: !965, scopeLine: 944, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !968)
!968 = !{!969, !970}
!969 = !DILocalVariable(name: "color_info", arg: 1, scope: !967, file: !888, line: 943, type: !562)
!970 = !DILocalVariable(name: "p", scope: !967, file: !888, line: 946, type: !611)
!971 = !DILocation(line: 0, scope: !967)
!972 = !DILocation(line: 949, column: 10, scope: !973)
!973 = distinct !DILexicalBlock(scope: !967, file: !888, line: 949, column: 7)
!974 = !{!975, !922, i64 80}
!975 = !{!"_ColorInfo", !921, i64 0, !921, i64 8, !922, i64 16, !976, i64 24, !922, i64 80, !922, i64 84, !921, i64 88, !921, i64 96, !978, i64 104}
!976 = !{!"_MagickPixelPacket", !922, i64 0, !922, i64 4, !922, i64 8, !977, i64 16, !978, i64 24, !979, i64 32, !979, i64 36, !979, i64 40, !979, i64 44, !979, i64 48}
!977 = !{!"double", !922, i64 0}
!978 = !{!"long", !922, i64 0}
!979 = !{!"float", !922, i64 0}
!980 = !DILocation(line: 949, column: 18, scope: !973)
!981 = !DILocation(line: 949, column: 7, scope: !967)
!982 = !DILocation(line: 951, column: 14, scope: !983)
!983 = distinct !DILexicalBlock(scope: !984, file: !888, line: 951, column: 11)
!984 = distinct !DILexicalBlock(scope: !973, file: !888, line: 950, column: 5)
!985 = !{!975, !921, i64 0}
!986 = !DILocation(line: 951, column: 19, scope: !983)
!987 = !DILocation(line: 951, column: 11, scope: !984)
!988 = !DILocation(line: 952, column: 17, scope: !983)
!989 = !DILocation(line: 952, column: 16, scope: !983)
!990 = !DILocation(line: 952, column: 9, scope: !983)
!991 = !DILocation(line: 953, column: 14, scope: !992)
!992 = distinct !DILexicalBlock(scope: !984, file: !888, line: 953, column: 11)
!993 = !{!975, !921, i64 8}
!994 = !DILocation(line: 953, column: 19, scope: !992)
!995 = !DILocation(line: 953, column: 11, scope: !984)
!996 = !DILocation(line: 954, column: 17, scope: !992)
!997 = !DILocation(line: 954, column: 16, scope: !992)
!998 = !DILocation(line: 954, column: 9, scope: !992)
!999 = !DILocation(line: 956, column: 19, scope: !967)
!1000 = !DILocation(line: 957, column: 3, scope: !967)
!1001 = !DISubprogram(name: "UnlockSemaphoreInfo", scope: !560, file: !560, line: 39, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1002 = !DISubprogram(name: "DestroySemaphoreInfo", scope: !560, file: !560, line: 36, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1003 = distinct !DISubprogram(name: "GetColorCompliance", scope: !888, file: !888, line: 999, type: !1004, scopeLine: 1001, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1008)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!567, !607, !1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014}
!1009 = !DILocalVariable(name: "name", arg: 1, scope: !1003, file: !888, line: 999, type: !607)
!1010 = !DILocalVariable(name: "compliance", arg: 2, scope: !1003, file: !888, line: 1000, type: !1006)
!1011 = !DILocalVariable(name: "exception", arg: 3, scope: !1003, file: !888, line: 1000, type: !1007)
!1012 = !DILocalVariable(name: "colorname", scope: !1003, file: !888, line: 1003, type: !810)
!1013 = !DILocalVariable(name: "p", scope: !1003, file: !888, line: 1006, type: !567)
!1014 = !DILocalVariable(name: "q", scope: !1003, file: !888, line: 1009, type: !573)
!1015 = !DILocation(line: 0, scope: !1003)
!1016 = !DILocation(line: 1002, column: 3, scope: !1003)
!1017 = !DILocation(line: 1003, column: 5, scope: !1003)
!1018 = !DILocalVariable(name: "exception", arg: 1, scope: !1019, file: !888, line: 1607, type: !1007)
!1019 = distinct !DISubprogram(name: "IsColorCacheInstantiated", scope: !888, file: !888, line: 1607, type: !1020, scopeLine: 1608, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1022)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!587, !1007}
!1022 = !{!1018}
!1023 = !DILocation(line: 0, scope: !1019, inlinedAt: !1024)
!1024 = distinct !DILocation(line: 1012, column: 7, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1003, file: !888, line: 1012, column: 7)
!1026 = !DILocation(line: 1609, column: 7, scope: !1027, inlinedAt: !1024)
!1027 = distinct !DILexicalBlock(scope: !1019, file: !888, line: 1609, column: 7)
!1028 = !DILocation(line: 1609, column: 19, scope: !1027, inlinedAt: !1024)
!1029 = !DILocation(line: 1609, column: 7, scope: !1019, inlinedAt: !1024)
!1030 = !DILocation(line: 1611, column: 11, scope: !1031, inlinedAt: !1024)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !888, line: 1611, column: 11)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !888, line: 1610, column: 5)
!1033 = !DILocation(line: 1611, column: 27, scope: !1031, inlinedAt: !1024)
!1034 = !DILocation(line: 1611, column: 11, scope: !1032, inlinedAt: !1024)
!1035 = !DILocation(line: 1612, column: 9, scope: !1031, inlinedAt: !1024)
!1036 = !DILocation(line: 1613, column: 25, scope: !1032, inlinedAt: !1024)
!1037 = !DILocation(line: 1613, column: 7, scope: !1032, inlinedAt: !1024)
!1038 = !DILocation(line: 1614, column: 11, scope: !1039, inlinedAt: !1024)
!1039 = distinct !DILexicalBlock(scope: !1032, file: !888, line: 1614, column: 11)
!1040 = !DILocation(line: 1614, column: 23, scope: !1039, inlinedAt: !1024)
!1041 = !DILocation(line: 1614, column: 11, scope: !1032, inlinedAt: !1024)
!1042 = !DILocalVariable(name: "filename", arg: 1, scope: !1043, file: !888, line: 825, type: !607)
!1043 = distinct !DISubprogram(name: "AcquireColorCache", scope: !888, file: !888, line: 825, type: !1044, scopeLine: 827, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1046)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!563, !607, !1007}
!1046 = !{!1042, !1047, !1048, !1049, !1050, !1051, !1053, !1054, !1057, !1058, !1062}
!1047 = !DILocalVariable(name: "exception", arg: 2, scope: !1043, file: !888, line: 826, type: !1007)
!1048 = !DILocalVariable(name: "option", scope: !1043, file: !888, line: 829, type: !873)
!1049 = !DILocalVariable(name: "color_cache", scope: !1043, file: !888, line: 832, type: !563)
!1050 = !DILocalVariable(name: "options", scope: !1043, file: !888, line: 833, type: !563)
!1051 = !DILocalVariable(name: "status", scope: !1043, file: !888, line: 836, type: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !6, line: 147, baseType: !7)
!1053 = !DILocalVariable(name: "i", scope: !1043, file: !888, line: 839, type: !615)
!1054 = !DILocalVariable(name: "message", scope: !1055, file: !888, line: 846, type: !573)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !888, line: 846, column: 5)
!1056 = distinct !DILexicalBlock(scope: !1043, file: !888, line: 845, column: 7)
!1057 = !DILocalVariable(name: "exception", scope: !1055, file: !888, line: 846, type: !818)
!1058 = !DILocalVariable(name: "color_info", scope: !1059, file: !888, line: 863, type: !611)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !888, line: 861, column: 3)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !888, line: 860, column: 3)
!1061 = distinct !DILexicalBlock(scope: !1043, file: !888, line: 860, column: 3)
!1062 = !DILocalVariable(name: "p", scope: !1059, file: !888, line: 866, type: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!1064 = !DILocation(line: 0, scope: !1043, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 1615, column: 21, scope: !1039, inlinedAt: !1024)
!1066 = !DILocation(line: 844, column: 15, scope: !1043, inlinedAt: !1065)
!1067 = !DILocation(line: 845, column: 19, scope: !1056, inlinedAt: !1065)
!1068 = !DILocation(line: 845, column: 7, scope: !1043, inlinedAt: !1065)
!1069 = !DILocation(line: 846, column: 5, scope: !1055, inlinedAt: !1065)
!1070 = !{!1071, !1071, i64 0}
!1071 = !{!"int", !922, i64 0}
!1072 = !DILocation(line: 0, scope: !1055, inlinedAt: !1065)
!1073 = !DILocation(line: 848, column: 11, scope: !1043, inlinedAt: !1065)
!1074 = !DILocation(line: 849, column: 31, scope: !1043, inlinedAt: !1065)
!1075 = !DILocation(line: 850, column: 17, scope: !1043, inlinedAt: !1065)
!1076 = !DILocation(line: 850, column: 3, scope: !1043, inlinedAt: !1065)
!1077 = !DILocation(line: 853, column: 7, scope: !1078, inlinedAt: !1065)
!1078 = distinct !DILexicalBlock(scope: !1043, file: !888, line: 851, column: 3)
!1079 = !DILocation(line: 853, column: 34, scope: !1078, inlinedAt: !1065)
!1080 = !DILocation(line: 852, column: 13, scope: !1078, inlinedAt: !1065)
!1081 = !DILocation(line: 852, column: 11, scope: !1078, inlinedAt: !1065)
!1082 = !DILocation(line: 854, column: 33, scope: !1078, inlinedAt: !1065)
!1083 = distinct !{!1083, !1076, !1084, !1085, !1086}
!1084 = !DILocation(line: 855, column: 3, scope: !1043, inlinedAt: !1065)
!1085 = !{!"llvm.loop.mustprogress"}
!1086 = !{!"llvm.loop.unroll.disable"}
!1087 = !DILocation(line: 856, column: 11, scope: !1043, inlinedAt: !1065)
!1088 = !DILocation(line: 860, column: 3, scope: !1061, inlinedAt: !1065)
!1089 = !DILocation(line: 868, column: 15, scope: !1059, inlinedAt: !1065)
!1090 = !DILocation(line: 0, scope: !1059, inlinedAt: !1065)
!1091 = !DILocation(line: 869, column: 30, scope: !1059, inlinedAt: !1065)
!1092 = !DILocation(line: 870, column: 20, scope: !1093, inlinedAt: !1065)
!1093 = distinct !DILexicalBlock(scope: !1059, file: !888, line: 870, column: 9)
!1094 = !DILocation(line: 870, column: 9, scope: !1059, inlinedAt: !1065)
!1095 = !DILocation(line: 876, column: 12, scope: !1059, inlinedAt: !1065)
!1096 = !DILocation(line: 877, column: 21, scope: !1059, inlinedAt: !1065)
!1097 = !DILocation(line: 878, column: 34, scope: !1059, inlinedAt: !1065)
!1098 = !{!1099, !921, i64 0}
!1099 = !{!"_ColorMapInfo", !921, i64 0, !922, i64 8, !922, i64 9, !922, i64 10, !979, i64 12, !978, i64 16}
!1100 = !DILocation(line: 878, column: 17, scope: !1059, inlinedAt: !1065)
!1101 = !DILocation(line: 878, column: 21, scope: !1059, inlinedAt: !1065)
!1102 = !DILocation(line: 879, column: 54, scope: !1059, inlinedAt: !1065)
!1103 = !DILocation(line: 879, column: 5, scope: !1059, inlinedAt: !1065)
!1104 = !DILocation(line: 881, column: 7, scope: !1059, inlinedAt: !1065)
!1105 = !{!1099, !922, i64 8}
!1106 = !DILocalVariable(name: "value", arg: 1, scope: !1107, file: !1108, line: 363, type: !898)
!1107 = distinct !DISubprogram(name: "ScaleCharToQuantum", scope: !1108, file: !1108, line: 363, type: !1109, scopeLine: 364, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1111)
!1108 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!612, !898}
!1111 = !{!1106}
!1112 = !DILocation(line: 0, scope: !1107, inlinedAt: !1113)
!1113 = distinct !DILocation(line: 880, column: 44, scope: !1059, inlinedAt: !1065)
!1114 = !DILocation(line: 366, column: 26, scope: !1107, inlinedAt: !1113)
!1115 = !DILocation(line: 366, column: 25, scope: !1107, inlinedAt: !1113)
!1116 = !DILocation(line: 880, column: 27, scope: !1059, inlinedAt: !1065)
!1117 = !DILocation(line: 880, column: 23, scope: !1059, inlinedAt: !1065)
!1118 = !DILocation(line: 880, column: 26, scope: !1059, inlinedAt: !1065)
!1119 = !{!975, !979, i64 56}
!1120 = !DILocation(line: 883, column: 7, scope: !1059, inlinedAt: !1065)
!1121 = !{!1099, !922, i64 9}
!1122 = !DILocation(line: 0, scope: !1107, inlinedAt: !1123)
!1123 = distinct !DILocation(line: 882, column: 46, scope: !1059, inlinedAt: !1065)
!1124 = !DILocation(line: 366, column: 26, scope: !1107, inlinedAt: !1123)
!1125 = !DILocation(line: 366, column: 25, scope: !1107, inlinedAt: !1123)
!1126 = !DILocation(line: 882, column: 29, scope: !1059, inlinedAt: !1065)
!1127 = !DILocation(line: 882, column: 23, scope: !1059, inlinedAt: !1065)
!1128 = !DILocation(line: 882, column: 28, scope: !1059, inlinedAt: !1065)
!1129 = !{!975, !979, i64 60}
!1130 = !DILocation(line: 885, column: 7, scope: !1059, inlinedAt: !1065)
!1131 = !{!1099, !922, i64 10}
!1132 = !DILocation(line: 0, scope: !1107, inlinedAt: !1133)
!1133 = distinct !DILocation(line: 884, column: 45, scope: !1059, inlinedAt: !1065)
!1134 = !DILocation(line: 366, column: 26, scope: !1107, inlinedAt: !1133)
!1135 = !DILocation(line: 366, column: 25, scope: !1107, inlinedAt: !1133)
!1136 = !DILocation(line: 884, column: 28, scope: !1059, inlinedAt: !1065)
!1137 = !DILocation(line: 884, column: 23, scope: !1059, inlinedAt: !1065)
!1138 = !DILocation(line: 884, column: 27, scope: !1059, inlinedAt: !1065)
!1139 = !{!975, !979, i64 64}
!1140 = !DILocation(line: 887, column: 10, scope: !1059, inlinedAt: !1065)
!1141 = !{!1099, !979, i64 12}
!1142 = !DILocation(line: 886, column: 61, scope: !1059, inlinedAt: !1065)
!1143 = !DILocation(line: 886, column: 23, scope: !1059, inlinedAt: !1065)
!1144 = !DILocation(line: 886, column: 30, scope: !1059, inlinedAt: !1065)
!1145 = !{!975, !979, i64 68}
!1146 = !DILocation(line: 888, column: 48, scope: !1059, inlinedAt: !1065)
!1147 = !{!1099, !978, i64 16}
!1148 = !DILocation(line: 888, column: 28, scope: !1059, inlinedAt: !1065)
!1149 = !DILocation(line: 888, column: 17, scope: !1059, inlinedAt: !1065)
!1150 = !DILocation(line: 888, column: 27, scope: !1059, inlinedAt: !1065)
!1151 = !{!975, !922, i64 16}
!1152 = !DILocation(line: 889, column: 17, scope: !1059, inlinedAt: !1065)
!1153 = !DILocation(line: 889, column: 23, scope: !1059, inlinedAt: !1065)
!1154 = !DILocation(line: 890, column: 17, scope: !1059, inlinedAt: !1065)
!1155 = !DILocation(line: 890, column: 26, scope: !1059, inlinedAt: !1065)
!1156 = !{!975, !978, i64 104}
!1157 = !DILocation(line: 891, column: 13, scope: !1059, inlinedAt: !1065)
!1158 = !DILocation(line: 891, column: 11, scope: !1059, inlinedAt: !1065)
!1159 = !DILocation(line: 892, column: 16, scope: !1160, inlinedAt: !1065)
!1160 = distinct !DILexicalBlock(scope: !1059, file: !888, line: 892, column: 9)
!1161 = !DILocation(line: 892, column: 9, scope: !1059, inlinedAt: !1065)
!1162 = !DILocation(line: 860, column: 66, scope: !1060, inlinedAt: !1065)
!1163 = !DILocation(line: 860, column: 15, scope: !1060, inlinedAt: !1065)
!1164 = distinct !{!1164, !1088, !1165, !1085, !1086}
!1165 = !DILocation(line: 895, column: 3, scope: !1061, inlinedAt: !1065)
!1166 = !DILocation(line: 1615, column: 20, scope: !1039, inlinedAt: !1024)
!1167 = !DILocation(line: 1615, column: 9, scope: !1039, inlinedAt: !1024)
!1168 = !DILocation(line: 1616, column: 27, scope: !1032, inlinedAt: !1024)
!1169 = !DILocation(line: 1616, column: 7, scope: !1032, inlinedAt: !1024)
!1170 = !DILocation(line: 1618, column: 10, scope: !1019, inlinedAt: !1024)
!1171 = !DILocation(line: 1618, column: 22, scope: !1019, inlinedAt: !1024)
!1172 = !DILocation(line: 1012, column: 7, scope: !1003)
!1173 = !DILocation(line: 1017, column: 13, scope: !1003)
!1174 = !{!922, !922, i64 0}
!1175 = !DILocation(line: 1018, column: 12, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1003, file: !888, line: 1018, column: 7)
!1177 = !DILocation(line: 1018, column: 7, scope: !1003)
!1178 = !DILocation(line: 1019, column: 12, scope: !1176)
!1179 = !DILocation(line: 1020, column: 21, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !888, line: 1020, column: 3)
!1181 = distinct !DILexicalBlock(scope: !1003, file: !888, line: 1020, column: 3)
!1182 = !DILocation(line: 1020, column: 24, scope: !1180)
!1183 = !DILocation(line: 1020, column: 3, scope: !1181)
!1184 = !DILocation(line: 1022, column: 9, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !888, line: 1022, column: 9)
!1186 = distinct !DILexicalBlock(scope: !1180, file: !888, line: 1021, column: 3)
!1187 = !{!1188, !1188, i64 0}
!1188 = !{!"short", !922, i64 0}
!1189 = !DILocation(line: 1022, column: 45, scope: !1185)
!1190 = !DILocation(line: 1022, column: 9, scope: !1186)
!1191 = !DILocation(line: 1024, column: 32, scope: !1186)
!1192 = !DILocation(line: 1024, column: 12, scope: !1186)
!1193 = !DILocation(line: 1025, column: 6, scope: !1186)
!1194 = !DILocation(line: 1026, column: 3, scope: !1186)
!1195 = !DILocation(line: 0, scope: !1181)
!1196 = !DILocation(line: 1020, column: 34, scope: !1180)
!1197 = distinct !{!1197, !1183, !1198, !1085, !1086}
!1198 = !DILocation(line: 1026, column: 3, scope: !1181)
!1199 = !DILocation(line: 1030, column: 21, scope: !1003)
!1200 = !DILocation(line: 1030, column: 3, scope: !1003)
!1201 = !DILocation(line: 1031, column: 27, scope: !1003)
!1202 = !DILocation(line: 1031, column: 3, scope: !1003)
!1203 = !DILocation(line: 1032, column: 50, scope: !1003)
!1204 = !DILocation(line: 1032, column: 25, scope: !1003)
!1205 = !DILocation(line: 1033, column: 37, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1003, file: !888, line: 1033, column: 7)
!1207 = !DILocation(line: 1033, column: 41, scope: !1206)
!1208 = !DILocation(line: 1033, column: 65, scope: !1206)
!1209 = !DILocation(line: 1033, column: 7, scope: !1003)
!1210 = !DILocation(line: 1038, column: 3, scope: !1003)
!1211 = !DILocation(line: 1040, column: 14, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1213, file: !888, line: 1040, column: 9)
!1213 = distinct !DILexicalBlock(scope: !1003, file: !888, line: 1039, column: 3)
!1214 = !DILocation(line: 1040, column: 25, scope: !1212)
!1215 = !DILocation(line: 1040, column: 39, scope: !1212)
!1216 = !DILocation(line: 1040, column: 45, scope: !1212)
!1217 = !DILocation(line: 1041, column: 37, scope: !1212)
!1218 = !DILocation(line: 1041, column: 10, scope: !1212)
!1219 = !DILocation(line: 1041, column: 43, scope: !1212)
!1220 = !DILocation(line: 1040, column: 9, scope: !1213)
!1221 = !DILocation(line: 1043, column: 52, scope: !1213)
!1222 = !DILocation(line: 1043, column: 27, scope: !1213)
!1223 = distinct !{!1223, !1210, !1224, !1085, !1086}
!1224 = !DILocation(line: 1044, column: 3, scope: !1003)
!1225 = !DILocation(line: 1046, column: 12, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1003, file: !888, line: 1045, column: 7)
!1227 = !DILocation(line: 1046, column: 5, scope: !1226)
!1228 = !DILocation(line: 1049, column: 36, scope: !1226)
!1229 = !DILocation(line: 1050, column: 7, scope: !1226)
!1230 = !DILocation(line: 1049, column: 12, scope: !1226)
!1231 = !DILocation(line: 1053, column: 1, scope: !1003)
!1232 = !DISubprogram(name: "CopyMagickString", scope: !876, file: !876, line: 78, type: !1233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!591, !573, !607, !1235}
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!1236 = !DISubprogram(name: "ResetLinkedListIterator", scope: !565, file: !565, line: 77, type: !1237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{null, !563}
!1239 = !DISubprogram(name: "GetNextValueInLinkedList", scope: !565, file: !565, line: 69, type: !1240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!562, !563}
!1242 = !DISubprogram(name: "LocaleCompare", scope: !876, file: !876, line: 66, type: !1243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!199, !607, !607}
!1245 = !DISubprogram(name: "ThrowMagickException", scope: !63, file: !63, line: 156, type: !1246, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!587, !1007, !607, !607, !1235, !1248, !607, !607, null}
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!1249 = !DISubprogram(name: "InsertValueInLinkedList", scope: !565, file: !565, line: 49, type: !1250, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!587, !563, !1235, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1254 = !DISubprogram(name: "RemoveElementByValueFromLinkedList", scope: !565, file: !565, line: 72, type: !1255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!562, !563, !1252}
!1257 = distinct !DISubprogram(name: "GetColorInfo", scope: !888, file: !888, line: 1084, type: !1258, scopeLine: 1086, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1260)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!567, !607, !1007}
!1260 = !{!1261, !1262}
!1261 = !DILocalVariable(name: "name", arg: 1, scope: !1257, file: !888, line: 1084, type: !607)
!1262 = !DILocalVariable(name: "exception", arg: 2, scope: !1257, file: !888, line: 1085, type: !1007)
!1263 = !DILocation(line: 0, scope: !1257)
!1264 = !DILocation(line: 1087, column: 10, scope: !1257)
!1265 = !DILocation(line: 1087, column: 3, scope: !1257)
!1266 = distinct !DISubprogram(name: "ConcatenateColorComponent", scope: !888, file: !888, line: 1119, type: !1267, scopeLine: 1121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1273)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{null, !1269, !1271, !1006, !573}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !150)
!1273 = !{!1274, !1275, !1276, !1277, !1278, !1279}
!1274 = !DILocalVariable(name: "pixel", arg: 1, scope: !1266, file: !888, line: 1119, type: !1269)
!1275 = !DILocalVariable(name: "channel", arg: 2, scope: !1266, file: !888, line: 1120, type: !1271)
!1276 = !DILocalVariable(name: "compliance", arg: 3, scope: !1266, file: !888, line: 1120, type: !1006)
!1277 = !DILocalVariable(name: "tuple", arg: 4, scope: !1266, file: !888, line: 1120, type: !573)
!1278 = !DILocalVariable(name: "component", scope: !1266, file: !888, line: 1123, type: !810)
!1279 = !DILocalVariable(name: "color", scope: !1266, file: !888, line: 1126, type: !589)
!1280 = !DILocation(line: 0, scope: !1266)
!1281 = !DILocation(line: 1122, column: 3, scope: !1266)
!1282 = !DILocation(line: 1123, column: 5, scope: !1266)
!1283 = !DILocation(line: 1129, column: 3, scope: !1266)
!1284 = !DILocation(line: 1133, column: 20, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1286, file: !888, line: 1132, column: 5)
!1286 = distinct !DILexicalBlock(scope: !1266, file: !888, line: 1130, column: 3)
!1287 = !{!976, !979, i64 32}
!1288 = !DILocation(line: 1133, column: 13, scope: !1285)
!1289 = !DILocation(line: 1134, column: 7, scope: !1285)
!1290 = !DILocation(line: 1138, column: 20, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1286, file: !888, line: 1137, column: 5)
!1292 = !{!976, !979, i64 36}
!1293 = !DILocation(line: 1138, column: 13, scope: !1291)
!1294 = !DILocation(line: 1139, column: 7, scope: !1291)
!1295 = !DILocation(line: 1143, column: 20, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1286, file: !888, line: 1142, column: 5)
!1297 = !{!976, !979, i64 40}
!1298 = !DILocation(line: 1143, column: 13, scope: !1296)
!1299 = !DILocation(line: 1144, column: 7, scope: !1296)
!1300 = !DILocation(line: 1148, column: 33, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1286, file: !888, line: 1147, column: 5)
!1302 = !{!976, !979, i64 44}
!1303 = !DILocation(line: 1148, column: 25, scope: !1301)
!1304 = !DILocation(line: 1148, column: 13, scope: !1301)
!1305 = !DILocation(line: 1149, column: 7, scope: !1301)
!1306 = !DILocation(line: 1153, column: 20, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1286, file: !888, line: 1152, column: 5)
!1308 = !{!976, !979, i64 48}
!1309 = !DILocation(line: 1153, column: 13, scope: !1307)
!1310 = !DILocation(line: 1154, column: 7, scope: !1307)
!1311 = !DILocation(line: 1159, column: 7, scope: !1266)
!1312 = !DILocation(line: 1162, column: 9, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1314, file: !888, line: 1160, column: 5)
!1314 = distinct !DILexicalBlock(scope: !1266, file: !888, line: 1159, column: 7)
!1315 = !DILocation(line: 1161, column: 14, scope: !1313)
!1316 = !DILocation(line: 1164, column: 7, scope: !1313)
!1317 = !DILocation(line: 1168, column: 18, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1319, file: !888, line: 1168, column: 11)
!1319 = distinct !DILexicalBlock(scope: !1320, file: !888, line: 1167, column: 5)
!1320 = distinct !DILexicalBlock(scope: !1266, file: !888, line: 1166, column: 7)
!1321 = !{!976, !978, i64 24}
!1322 = !DILocation(line: 1168, column: 24, scope: !1318)
!1323 = !DILocation(line: 1168, column: 11, scope: !1319)
!1324 = !DILocation(line: 1171, column: 63, scope: !1325)
!1325 = distinct !DILexicalBlock(scope: !1318, file: !888, line: 1169, column: 9)
!1326 = !DILocalVariable(name: "value", arg: 1, scope: !1327, file: !369, line: 87, type: !1330)
!1327 = distinct !DISubprogram(name: "ClampToQuantum", scope: !369, file: !369, line: 87, type: !1328, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1331)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!612, !1330}
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!1331 = !{!1326}
!1332 = !DILocation(line: 0, scope: !1327, inlinedAt: !1333)
!1333 = distinct !DILocation(line: 1171, column: 48, scope: !1325)
!1334 = !DILocation(line: 92, column: 13, scope: !1335, inlinedAt: !1333)
!1335 = distinct !DILexicalBlock(scope: !1327, file: !369, line: 92, column: 7)
!1336 = !DILocation(line: 92, column: 7, scope: !1327, inlinedAt: !1333)
!1337 = !DILocation(line: 94, column: 13, scope: !1338, inlinedAt: !1333)
!1338 = distinct !DILexicalBlock(scope: !1327, file: !369, line: 94, column: 7)
!1339 = !DILocation(line: 94, column: 7, scope: !1327, inlinedAt: !1333)
!1340 = !DILocation(line: 96, column: 26, scope: !1327, inlinedAt: !1333)
!1341 = !DILocation(line: 96, column: 10, scope: !1327, inlinedAt: !1333)
!1342 = !DILocation(line: 96, column: 3, scope: !1327, inlinedAt: !1333)
!1343 = !DILocation(line: 1170, column: 18, scope: !1325)
!1344 = !DILocation(line: 1173, column: 11, scope: !1325)
!1345 = !DILocation(line: 1175, column: 24, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1319, file: !888, line: 1175, column: 11)
!1347 = !DILocation(line: 0, scope: !1319)
!1348 = !DILocation(line: 0, scope: !1327, inlinedAt: !1349)
!1349 = distinct !DILocation(line: 1178, column: 33, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1346, file: !888, line: 1176, column: 9)
!1351 = !DILocation(line: 0, scope: !1327, inlinedAt: !1352)
!1352 = distinct !DILocation(line: 1183, column: 28, scope: !1319)
!1353 = !DILocation(line: 1175, column: 11, scope: !1319)
!1354 = !DILocation(line: 92, column: 7, scope: !1327, inlinedAt: !1349)
!1355 = !DILocation(line: 94, column: 13, scope: !1338, inlinedAt: !1349)
!1356 = !DILocation(line: 94, column: 7, scope: !1327, inlinedAt: !1349)
!1357 = !DILocation(line: 96, column: 26, scope: !1327, inlinedAt: !1349)
!1358 = !DILocation(line: 96, column: 10, scope: !1327, inlinedAt: !1349)
!1359 = !DILocation(line: 96, column: 3, scope: !1327, inlinedAt: !1349)
!1360 = !DILocation(line: 1177, column: 18, scope: !1350)
!1361 = !DILocation(line: 1180, column: 11, scope: !1350)
!1362 = !DILocation(line: 92, column: 7, scope: !1327, inlinedAt: !1352)
!1363 = !DILocation(line: 94, column: 13, scope: !1338, inlinedAt: !1352)
!1364 = !DILocation(line: 94, column: 7, scope: !1327, inlinedAt: !1352)
!1365 = !DILocation(line: 96, column: 26, scope: !1327, inlinedAt: !1352)
!1366 = !DILocation(line: 96, column: 10, scope: !1327, inlinedAt: !1352)
!1367 = !DILocation(line: 96, column: 3, scope: !1327, inlinedAt: !1352)
!1368 = !DILocalVariable(name: "quantum", arg: 1, scope: !1369, file: !369, line: 114, type: !1372)
!1369 = distinct !DISubprogram(name: "ScaleQuantumToChar", scope: !369, file: !369, line: 114, type: !1370, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1373)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!609, !1372}
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!1373 = !{!1368}
!1374 = !DILocation(line: 0, scope: !1369, inlinedAt: !1375)
!1375 = distinct !DILocation(line: 1183, column: 9, scope: !1319)
!1376 = !DILocation(line: 117, column: 61, scope: !1369, inlinedAt: !1375)
!1377 = !DILocation(line: 117, column: 43, scope: !1369, inlinedAt: !1375)
!1378 = !DILocation(line: 117, column: 10, scope: !1369, inlinedAt: !1375)
!1379 = !DILocation(line: 1183, column: 9, scope: !1319)
!1380 = !DILocation(line: 1182, column: 14, scope: !1319)
!1381 = !DILocation(line: 1185, column: 7, scope: !1319)
!1382 = !DILocation(line: 1187, column: 15, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1266, file: !888, line: 1187, column: 7)
!1384 = !DILocation(line: 1187, column: 7, scope: !1266)
!1385 = !DILocation(line: 1190, column: 9, scope: !1386)
!1386 = distinct !DILexicalBlock(scope: !1383, file: !888, line: 1188, column: 5)
!1387 = !DILocation(line: 1190, column: 43, scope: !1386)
!1388 = !DILocation(line: 1189, column: 14, scope: !1386)
!1389 = !DILocation(line: 1192, column: 7, scope: !1386)
!1390 = !DILocation(line: 1194, column: 15, scope: !1391)
!1391 = distinct !DILexicalBlock(scope: !1266, file: !888, line: 1194, column: 7)
!1392 = !{!976, !922, i64 4}
!1393 = !DILocation(line: 1194, column: 44, scope: !1391)
!1394 = !DILocation(line: 1203, column: 9, scope: !1395)
!1395 = distinct !DILexicalBlock(scope: !1391, file: !888, line: 1201, column: 5)
!1396 = !DILocation(line: 1203, column: 49, scope: !1395)
!1397 = !DILocation(line: 1202, column: 14, scope: !1395)
!1398 = !DILocation(line: 1205, column: 7, scope: !1395)
!1399 = !DILocation(line: 1207, column: 14, scope: !1400)
!1400 = distinct !DILexicalBlock(scope: !1266, file: !888, line: 1207, column: 7)
!1401 = !DILocation(line: 1207, column: 20, scope: !1400)
!1402 = !DILocation(line: 1207, column: 7, scope: !1266)
!1403 = !DILocation(line: 1210, column: 9, scope: !1404)
!1404 = distinct !DILexicalBlock(scope: !1400, file: !888, line: 1208, column: 5)
!1405 = !DILocation(line: 1210, column: 49, scope: !1404)
!1406 = !DILocation(line: 1209, column: 14, scope: !1404)
!1407 = !DILocation(line: 1212, column: 7, scope: !1404)
!1408 = !DILocation(line: 1215, column: 39, scope: !1266)
!1409 = !DILocation(line: 0, scope: !1327, inlinedAt: !1410)
!1410 = distinct !DILocation(line: 1215, column: 24, scope: !1266)
!1411 = !DILocation(line: 92, column: 13, scope: !1335, inlinedAt: !1410)
!1412 = !DILocation(line: 92, column: 7, scope: !1327, inlinedAt: !1410)
!1413 = !DILocation(line: 94, column: 13, scope: !1338, inlinedAt: !1410)
!1414 = !DILocation(line: 94, column: 7, scope: !1327, inlinedAt: !1410)
!1415 = !DILocation(line: 96, column: 26, scope: !1327, inlinedAt: !1410)
!1416 = !DILocation(line: 96, column: 10, scope: !1327, inlinedAt: !1410)
!1417 = !DILocation(line: 96, column: 3, scope: !1327, inlinedAt: !1410)
!1418 = !DILocation(line: 0, scope: !1369, inlinedAt: !1419)
!1419 = distinct !DILocation(line: 1215, column: 5, scope: !1266)
!1420 = !DILocation(line: 117, column: 61, scope: !1369, inlinedAt: !1419)
!1421 = !DILocation(line: 117, column: 43, scope: !1369, inlinedAt: !1419)
!1422 = !DILocation(line: 117, column: 10, scope: !1369, inlinedAt: !1419)
!1423 = !DILocation(line: 1215, column: 5, scope: !1266)
!1424 = !DILocation(line: 1214, column: 10, scope: !1266)
!1425 = !DILocation(line: 1217, column: 1, scope: !1266)
!1426 = !DISubprogram(name: "FormatLocaleString", scope: !1427, file: !1427, line: 71, type: !1428, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1427 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "156c27c5fb4b55284e5f6c924766571a")
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!615, !1430, !1235, !1431, null}
!1430 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !573)
!1431 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !607)
!1432 = !DISubprogram(name: "GetMagickPrecision", scope: !1433, file: !1433, line: 119, type: !1434, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1433 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!199}
!1436 = !DISubprogram(name: "ConcatenateMagickString", scope: !876, file: !876, line: 76, type: !1233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1437 = distinct !DISubprogram(name: "GetColorInfoList", scope: !888, file: !888, line: 1268, type: !1438, scopeLine: 1270, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1441)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!613, !607, !1440, !1007}
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447}
!1442 = !DILocalVariable(name: "pattern", arg: 1, scope: !1437, file: !888, line: 1268, type: !607)
!1443 = !DILocalVariable(name: "number_colors", arg: 2, scope: !1437, file: !888, line: 1269, type: !1440)
!1444 = !DILocalVariable(name: "exception", arg: 3, scope: !1437, file: !888, line: 1269, type: !1007)
!1445 = !DILocalVariable(name: "colors", scope: !1437, file: !888, line: 1272, type: !613)
!1446 = !DILocalVariable(name: "p", scope: !1437, file: !888, line: 1275, type: !567)
!1447 = !DILocalVariable(name: "i", scope: !1437, file: !888, line: 1278, type: !615)
!1448 = !DILocation(line: 0, scope: !1437)
!1449 = !DILocation(line: 1284, column: 10, scope: !1437)
!1450 = !DILocation(line: 1286, column: 17, scope: !1437)
!1451 = !{!978, !978, i64 0}
!1452 = !DILocation(line: 0, scope: !1257, inlinedAt: !1453)
!1453 = distinct !DILocation(line: 1287, column: 5, scope: !1437)
!1454 = !DILocation(line: 1087, column: 10, scope: !1257, inlinedAt: !1453)
!1455 = !DILocation(line: 1288, column: 9, scope: !1456)
!1456 = distinct !DILexicalBlock(scope: !1437, file: !888, line: 1288, column: 7)
!1457 = !DILocation(line: 1288, column: 7, scope: !1437)
!1458 = !DILocation(line: 1291, column: 37, scope: !1437)
!1459 = !DILocation(line: 1291, column: 5, scope: !1437)
!1460 = !DILocation(line: 1291, column: 49, scope: !1437)
!1461 = !DILocation(line: 1290, column: 31, scope: !1437)
!1462 = !DILocation(line: 1292, column: 14, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1437, file: !888, line: 1292, column: 7)
!1464 = !DILocation(line: 1292, column: 7, scope: !1437)
!1465 = !DILocation(line: 1297, column: 21, scope: !1437)
!1466 = !DILocation(line: 1297, column: 3, scope: !1437)
!1467 = !DILocation(line: 1298, column: 27, scope: !1437)
!1468 = !DILocation(line: 1298, column: 3, scope: !1437)
!1469 = !DILocation(line: 1299, column: 50, scope: !1437)
!1470 = !DILocation(line: 1299, column: 25, scope: !1437)
!1471 = !DILocation(line: 1300, column: 15, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !1473, file: !888, line: 1300, column: 3)
!1473 = distinct !DILexicalBlock(scope: !1437, file: !888, line: 1300, column: 3)
!1474 = !DILocation(line: 1300, column: 3, scope: !1473)
!1475 = !DILocation(line: 1302, column: 13, scope: !1476)
!1476 = distinct !DILexicalBlock(scope: !1477, file: !888, line: 1302, column: 9)
!1477 = distinct !DILexicalBlock(scope: !1472, file: !888, line: 1301, column: 3)
!1478 = !{!975, !922, i64 84}
!1479 = !DILocation(line: 1302, column: 21, scope: !1476)
!1480 = !DILocation(line: 1302, column: 37, scope: !1476)
!1481 = !DILocation(line: 1303, column: 28, scope: !1476)
!1482 = !DILocation(line: 1303, column: 10, scope: !1476)
!1483 = !DILocation(line: 1303, column: 54, scope: !1476)
!1484 = !DILocation(line: 1302, column: 9, scope: !1477)
!1485 = !DILocation(line: 1304, column: 15, scope: !1476)
!1486 = !DILocation(line: 1304, column: 7, scope: !1476)
!1487 = !DILocation(line: 1304, column: 18, scope: !1476)
!1488 = !DILocation(line: 0, scope: !1473)
!1489 = !DILocation(line: 1305, column: 52, scope: !1477)
!1490 = !DILocation(line: 1305, column: 27, scope: !1477)
!1491 = distinct !{!1491, !1474, !1492, !1085, !1086}
!1492 = !DILocation(line: 1306, column: 3, scope: !1473)
!1493 = !DILocation(line: 1307, column: 23, scope: !1437)
!1494 = !DILocation(line: 1307, column: 3, scope: !1437)
!1495 = !DILocation(line: 1308, column: 3, scope: !1437)
!1496 = !DILocation(line: 1309, column: 3, scope: !1437)
!1497 = !DILocation(line: 1309, column: 12, scope: !1437)
!1498 = !DILocation(line: 1310, column: 17, scope: !1437)
!1499 = !DILocation(line: 1311, column: 3, scope: !1437)
!1500 = !DILocation(line: 1312, column: 1, scope: !1437)
!1501 = !DISubprogram(name: "LogMagickEvent", scope: !173, file: !173, line: 83, type: !1502, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!587, !1504, !607, !607, !1235, !607, null}
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1505)
!1505 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !173, line: 58, baseType: !172)
!1506 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1507, file: !1507, line: 42, type: !1508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1507 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!562, !1235, !1235}
!1510 = !DISubprogram(name: "GetNumberOfElementsInLinkedList", scope: !565, file: !565, line: 58, type: !1511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!591, !1513}
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!1515 = !DISubprogram(name: "GlobExpression", scope: !1516, file: !1516, line: 36, type: !1517, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1516 = !DIFile(filename: "apps/538.imagick_r/src/magick/token.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f90c1544ca665b41425c6912f2cbc1e4")
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!587, !607, !607, !1519}
!1519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!1520 = !DISubprogram(name: "qsort", scope: !1521, file: !1521, line: 830, type: !1522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1521 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!1522 = !DISubroutineType(types: !1523)
!1523 = !{null, !562, !591, !591, !1524}
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !1521, line: 808, baseType: !1525)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!199, !1252, !1252}
!1528 = distinct !DISubprogram(name: "ColorInfoCompare", scope: !888, file: !888, line: 1251, type: !1526, scopeLine: 1252, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1529)
!1529 = !{!1530, !1531, !1532, !1533}
!1530 = !DILocalVariable(name: "x", arg: 1, scope: !1528, file: !888, line: 1251, type: !1252)
!1531 = !DILocalVariable(name: "y", arg: 2, scope: !1528, file: !888, line: 1251, type: !1252)
!1532 = !DILocalVariable(name: "p", scope: !1528, file: !888, line: 1254, type: !613)
!1533 = !DILocalVariable(name: "q", scope: !1528, file: !888, line: 1255, type: !613)
!1534 = !DILocation(line: 0, scope: !1528)
!1535 = !DILocation(line: 1259, column: 22, scope: !1536)
!1536 = distinct !DILexicalBlock(scope: !1528, file: !888, line: 1259, column: 7)
!1537 = !DILocation(line: 1259, column: 27, scope: !1536)
!1538 = !DILocation(line: 1259, column: 33, scope: !1536)
!1539 = !DILocation(line: 1259, column: 38, scope: !1536)
!1540 = !DILocation(line: 1259, column: 7, scope: !1536)
!1541 = !DILocation(line: 1259, column: 44, scope: !1536)
!1542 = !DILocation(line: 1259, column: 7, scope: !1528)
!1543 = !DILocation(line: 1260, column: 32, scope: !1536)
!1544 = !DILocation(line: 1260, column: 38, scope: !1536)
!1545 = !DILocation(line: 1260, column: 43, scope: !1536)
!1546 = !DILocation(line: 1260, column: 5, scope: !1536)
!1547 = !DILocation(line: 1261, column: 36, scope: !1528)
!1548 = !DILocation(line: 1261, column: 3, scope: !1528)
!1549 = !DILocation(line: 1262, column: 1, scope: !1528)
!1550 = distinct !DISubprogram(name: "GetColorList", scope: !888, file: !888, line: 1361, type: !1551, scopeLine: 1363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1553)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!614, !607, !1440, !1007}
!1553 = !{!1554, !1555, !1556, !1557, !1558, !1559}
!1554 = !DILocalVariable(name: "pattern", arg: 1, scope: !1550, file: !888, line: 1361, type: !607)
!1555 = !DILocalVariable(name: "number_colors", arg: 2, scope: !1550, file: !888, line: 1362, type: !1440)
!1556 = !DILocalVariable(name: "exception", arg: 3, scope: !1550, file: !888, line: 1362, type: !1007)
!1557 = !DILocalVariable(name: "colors", scope: !1550, file: !888, line: 1365, type: !614)
!1558 = !DILocalVariable(name: "p", scope: !1550, file: !888, line: 1368, type: !567)
!1559 = !DILocalVariable(name: "i", scope: !1550, file: !888, line: 1371, type: !615)
!1560 = !DILocation(line: 0, scope: !1550)
!1561 = !DILocation(line: 1377, column: 10, scope: !1550)
!1562 = !DILocation(line: 1379, column: 17, scope: !1550)
!1563 = !DILocation(line: 0, scope: !1257, inlinedAt: !1564)
!1564 = distinct !DILocation(line: 1380, column: 5, scope: !1550)
!1565 = !DILocation(line: 1087, column: 10, scope: !1257, inlinedAt: !1564)
!1566 = !DILocation(line: 1381, column: 9, scope: !1567)
!1567 = distinct !DILexicalBlock(scope: !1550, file: !888, line: 1381, column: 7)
!1568 = !DILocation(line: 1381, column: 7, scope: !1550)
!1569 = !DILocation(line: 1384, column: 37, scope: !1550)
!1570 = !DILocation(line: 1384, column: 5, scope: !1550)
!1571 = !DILocation(line: 1384, column: 49, scope: !1550)
!1572 = !DILocation(line: 1383, column: 20, scope: !1550)
!1573 = !DILocation(line: 1385, column: 14, scope: !1574)
!1574 = distinct !DILexicalBlock(scope: !1550, file: !888, line: 1385, column: 7)
!1575 = !DILocation(line: 1385, column: 7, scope: !1550)
!1576 = !DILocation(line: 1390, column: 21, scope: !1550)
!1577 = !DILocation(line: 1390, column: 3, scope: !1550)
!1578 = !DILocation(line: 1391, column: 27, scope: !1550)
!1579 = !DILocation(line: 1391, column: 3, scope: !1550)
!1580 = !DILocation(line: 1392, column: 50, scope: !1550)
!1581 = !DILocation(line: 1392, column: 25, scope: !1550)
!1582 = !DILocation(line: 1393, column: 15, scope: !1583)
!1583 = distinct !DILexicalBlock(scope: !1584, file: !888, line: 1393, column: 3)
!1584 = distinct !DILexicalBlock(scope: !1550, file: !888, line: 1393, column: 3)
!1585 = !DILocation(line: 1393, column: 3, scope: !1584)
!1586 = !DILocation(line: 1395, column: 13, scope: !1587)
!1587 = distinct !DILexicalBlock(scope: !1588, file: !888, line: 1395, column: 9)
!1588 = distinct !DILexicalBlock(scope: !1583, file: !888, line: 1394, column: 3)
!1589 = !DILocation(line: 1395, column: 21, scope: !1587)
!1590 = !DILocation(line: 1395, column: 37, scope: !1587)
!1591 = !DILocation(line: 1396, column: 28, scope: !1587)
!1592 = !DILocation(line: 1396, column: 10, scope: !1587)
!1593 = !DILocation(line: 1396, column: 54, scope: !1587)
!1594 = !DILocation(line: 1395, column: 9, scope: !1588)
!1595 = !DILocation(line: 1397, column: 37, scope: !1587)
!1596 = !DILocation(line: 1397, column: 19, scope: !1587)
!1597 = !DILocation(line: 1397, column: 15, scope: !1587)
!1598 = !DILocation(line: 1397, column: 7, scope: !1587)
!1599 = !DILocation(line: 1397, column: 18, scope: !1587)
!1600 = !DILocation(line: 0, scope: !1584)
!1601 = !DILocation(line: 1398, column: 52, scope: !1588)
!1602 = !DILocation(line: 1398, column: 27, scope: !1588)
!1603 = distinct !{!1603, !1585, !1604, !1085, !1086}
!1604 = !DILocation(line: 1399, column: 3, scope: !1584)
!1605 = !DILocation(line: 1400, column: 23, scope: !1550)
!1606 = !DILocation(line: 1400, column: 3, scope: !1550)
!1607 = !DILocation(line: 1401, column: 3, scope: !1550)
!1608 = !DILocation(line: 1402, column: 3, scope: !1550)
!1609 = !DILocation(line: 1402, column: 12, scope: !1550)
!1610 = !DILocation(line: 1403, column: 17, scope: !1550)
!1611 = !DILocation(line: 1404, column: 3, scope: !1550)
!1612 = !DILocation(line: 1405, column: 1, scope: !1550)
!1613 = !DISubprogram(name: "ConstantString", scope: !876, file: !876, line: 45, type: !1614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !917)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!573, !607}
!1616 = distinct !DISubprogram(name: "ColorCompare", scope: !888, file: !888, line: 1346, type: !1526, scopeLine: 1347, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1617)
!1617 = !{!1618, !1619, !1620, !1621}
!1618 = !DILocalVariable(name: "x", arg: 1, scope: !1616, file: !888, line: 1346, type: !1252)
!1619 = !DILocalVariable(name: "y", arg: 2, scope: !1616, file: !888, line: 1346, type: !1252)
!1620 = !DILocalVariable(name: "p", scope: !1616, file: !888, line: 1349, type: !872)
!1621 = !DILocalVariable(name: "q", scope: !1616, file: !888, line: 1350, type: !872)
!1622 = !DILocation(line: 0, scope: !1616)
!1623 = !DILocation(line: 1354, column: 24, scope: !1616)
!1624 = !DILocation(line: 1354, column: 27, scope: !1616)
!1625 = !DILocation(line: 1354, column: 10, scope: !1616)
!1626 = !DILocation(line: 1354, column: 3, scope: !1616)
!1627 = distinct !DISubprogram(name: "GetColorTuple", scope: !888, file: !888, line: 1504, type: !1628, scopeLine: 1506, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1630)
!1628 = !DISubroutineType(types: !1629)
!1629 = !{null, !1269, !1519, !573}
!1630 = !{!1631, !1632, !1633, !1634, !1635}
!1631 = !DILocalVariable(name: "pixel", arg: 1, scope: !1627, file: !888, line: 1504, type: !1269)
!1632 = !DILocalVariable(name: "hex", arg: 2, scope: !1627, file: !888, line: 1505, type: !1519)
!1633 = !DILocalVariable(name: "tuple", arg: 3, scope: !1627, file: !888, line: 1505, type: !573)
!1634 = !DILocalVariable(name: "color", scope: !1627, file: !888, line: 1508, type: !579)
!1635 = !DILocalVariable(name: "status", scope: !1636, file: !888, line: 1539, type: !1052)
!1636 = distinct !DILexicalBlock(scope: !1637, file: !888, line: 1534, column: 5)
!1637 = distinct !DILexicalBlock(scope: !1627, file: !888, line: 1533, column: 7)
!1638 = !DILocation(line: 0, scope: !1627)
!1639 = !DILocation(line: 1507, column: 3, scope: !1627)
!1640 = !DILocation(line: 1508, column: 5, scope: !1627)
!1641 = !DILocation(line: 1512, column: 10, scope: !1627)
!1642 = !DILocation(line: 1513, column: 9, scope: !1627)
!1643 = !DILocation(line: 1514, column: 11, scope: !1644)
!1644 = distinct !DILexicalBlock(scope: !1627, file: !888, line: 1514, column: 7)
!1645 = !DILocation(line: 1514, column: 7, scope: !1627)
!1646 = !DILocation(line: 1519, column: 14, scope: !1647)
!1647 = distinct !DILexicalBlock(scope: !1644, file: !888, line: 1515, column: 5)
!1648 = !DILocation(line: 1520, column: 7, scope: !1647)
!1649 = !DILocation(line: 1521, column: 7, scope: !1647)
!1650 = !DILocation(line: 1522, column: 7, scope: !1647)
!1651 = !DILocation(line: 1523, column: 18, scope: !1652)
!1652 = distinct !DILexicalBlock(scope: !1647, file: !888, line: 1523, column: 11)
!1653 = !DILocation(line: 1523, column: 29, scope: !1652)
!1654 = !DILocation(line: 1523, column: 11, scope: !1647)
!1655 = !DILocation(line: 1524, column: 9, scope: !1652)
!1656 = !DILocation(line: 1525, column: 19, scope: !1657)
!1657 = distinct !DILexicalBlock(scope: !1647, file: !888, line: 1525, column: 11)
!1658 = !{!976, !922, i64 8}
!1659 = !DILocation(line: 1525, column: 25, scope: !1657)
!1660 = !DILocation(line: 1525, column: 41, scope: !1657)
!1661 = !DILocation(line: 1525, column: 52, scope: !1657)
!1662 = !DILocation(line: 1525, column: 60, scope: !1657)
!1663 = !DILocation(line: 1525, column: 11, scope: !1647)
!1664 = !DILocation(line: 1526, column: 9, scope: !1657)
!1665 = !DILocation(line: 1532, column: 10, scope: !1627)
!1666 = !{i64 0, i64 4, !1174, i64 4, i64 4, !1174, i64 8, i64 4, !1174, i64 16, i64 8, !1667, i64 24, i64 8, !1451, i64 32, i64 4, !1668, i64 36, i64 4, !1668, i64 40, i64 4, !1668, i64 44, i64 4, !1668, i64 48, i64 4, !1668}
!1667 = !{!977, !977, i64 0}
!1668 = !{!979, !979, i64 0}
!1669 = !DILocation(line: 1533, column: 13, scope: !1637)
