; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/common/common.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_allocator = type { ptr, ptr, ptr }
%struct.lzma_filter_info_s = type { i64, ptr, ptr }
%struct.lzma_next_coder_s = type { ptr, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.lzma_stream = type { ptr, i64, i64, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }

@.str = private unnamed_addr constant [22 x i8] c"5.0.5benchmarkcpu2017\00", align 1

; Function Attrs: mustprogress nofree norecurse nosync nounwind readnone willreturn uwtable
define dso_local i32 @lzma_version_number() local_unnamed_addr #0 !dbg !142 {
entry:
  ret i32 50000056, !dbg !149
}

; Function Attrs: mustprogress nofree norecurse nosync nounwind readnone willreturn uwtable
define dso_local nonnull ptr @lzma_version_string() local_unnamed_addr #0 !dbg !150 {
entry:
  ret ptr @.str, !dbg !156
}

; Function Attrs: nounwind uwtable
define dso_local ptr @lzma_alloc(i64 noundef %size, ptr noundef readonly %allocator) local_unnamed_addr #1 !dbg !157 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !134, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/common.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "4324f888732c15afaa7e948651790b3b")
!2 = !{!3, !19, !25, !32, !131}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !34, file: !33, line: 187, baseType: !5, size: 32, elements: !124)
!33 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !33, line: 179, size: 704, elements: !35)
!35 = !{!36, !116, !117, !118, !123}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 181, baseType: !37, size: 512)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !33, line: 80, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !33, line: 124, size: 512, elements: !39)
!39 = !{!40, !43, !51, !54, !87, !92, !99, !104}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !38, file: !33, line: 126, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !33, line: 78, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !38, file: !33, line: 130, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !45, line: 63, baseType: !46)
!45 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 27, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !49, line: 45, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!50 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !38, file: !33, line: 136, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !53, line: 90, baseType: !50)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !38, file: !33, line: 139, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !33, line: 94, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !41, !60, !76, !82, !69, !84, !82, !69, !86}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !63)
!63 = !{!64, !71, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !62, file: !4, line: 376, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !68, !69, !69}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !50)
!70 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !62, file: !4, line: 390, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !68, !68}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !62, file: !4, line: 401, baseType: !68, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !47, line: 24, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !49, line: 38, baseType: !81)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !38, file: !33, line: 144, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !33, line: 102, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !41, !60}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !38, file: !33, line: 148, baseType: !93, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !38, file: !33, line: 152, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!59, !41, !103, !103, !46}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !38, file: !33, line: 157, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!59, !41, !60, !108, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !111, line: 65, baseType: !112)
!111 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 43, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !111, line: 54, baseType: !44, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !112, file: !111, line: 63, baseType: !68, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !34, file: !33, line: 194, baseType: !32, size: 32, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !34, file: !33, line: 199, baseType: !69, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !34, file: !33, line: 202, baseType: !119, size: 32, offset: 640)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 32, elements: !121)
!120 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!121 = !{!122}
!122 = !DISubrange(count: 4)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !34, file: !33, line: 206, baseType: !120, size: 8, offset: 672)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!126 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!127 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!128 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!129 = !DIEnumerator(name: "ISEQ_END", value: 4)
!130 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !132)
!132 = !{!133}
!133 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!134 = !{!68, !52, !5}
!135 = !{i32 7, !"Dwarf Version", i32 5}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = !{i32 7, !"PIC Level", i32 2}
!139 = !{i32 7, !"PIE Level", i32 2}
!140 = !{i32 7, !"uwtable", i32 2}
!141 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!142 = distinct !DISubprogram(name: "lzma_version_number", scope: !143, file: !143, line: 21, type: !144, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !148)
!143 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4324f888732c15afaa7e948651790b3b")
!144 = !DISubroutineType(types: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 26, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !49, line: 42, baseType: !5)
!148 = !{}
!149 = !DILocation(line: 23, column: 2, scope: !142)
!150 = distinct !DISubprogram(name: "lzma_version_string", scope: !143, file: !143, line: 28, type: !151, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !148)
!151 = !DISubroutineType(types: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!156 = !DILocation(line: 30, column: 2, scope: !150)
!157 = distinct !DISubprogram(name: "lzma_alloc", scope: !143, file: !143, line: 39, type: !158, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !160)
!158 = !DISubroutineType(types: !159)
!159 = !{!68, !69, !60}
!160 = !{!161, !162, !163}
!161 = !DILocalVariable(name: "size", arg: 1, scope: !157, file: !143, line: 39, type: !69)
!162 = !DILocalVariable(name: "allocator", arg: 2, scope: !157, file: !143, line: 39, type: !60)
!163 = !DILocalVariable(name: "ptr", scope: !157, file: !143, line: 45, type: !68)
!164 = !DILocation(line: 0, scope: !157)
!165 = !DILocation(line: 42, column: 11, scope: !166)
!166 = distinct !DILexicalBlock(scope: !157, file: !143, line: 42, column: 6)
!167 = !DILocation(line: 42, column: 6, scope: !157)
!168 = !DILocation(line: 47, column: 16, scope: !169)
!169 = distinct !DILexicalBlock(scope: !157, file: !143, line: 47, column: 6)
!170 = !DILocation(line: 47, column: 24, scope: !169)
!171 = !DILocation(line: 47, column: 38, scope: !169)
!172 = !{!173, !174, i64 0}
!173 = !{!"", !174, i64 0, !174, i64 8, !174, i64 16}
!174 = !{!"any pointer", !175, i64 0}
!175 = !{!"omnipotent char", !176, i64 0}
!176 = !{!"Simple C/C++ TBAA"}
!177 = !DILocation(line: 47, column: 44, scope: !169)
!178 = !DILocation(line: 47, column: 6, scope: !157)
!179 = !DILocation(line: 48, column: 37, scope: !169)
!180 = !{!173, !174, i64 16}
!181 = !DILocation(line: 48, column: 9, scope: !169)
!182 = !DILocation(line: 48, column: 3, scope: !169)
!183 = !DILocation(line: 50, column: 9, scope: !169)
!184 = !DILocation(line: 0, scope: !169)
!185 = !DILocation(line: 52, column: 2, scope: !157)
!186 = distinct !DISubprogram(name: "lzma_free", scope: !143, file: !143, line: 57, type: !187, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !189)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !68, !60}
!189 = !{!190, !191}
!190 = !DILocalVariable(name: "ptr", arg: 1, scope: !186, file: !143, line: 57, type: !68)
!191 = !DILocalVariable(name: "allocator", arg: 2, scope: !186, file: !143, line: 57, type: !60)
!192 = !DILocation(line: 0, scope: !186)
!193 = !DILocation(line: 59, column: 16, scope: !194)
!194 = distinct !DILexicalBlock(scope: !186, file: !143, line: 59, column: 6)
!195 = !DILocation(line: 59, column: 24, scope: !194)
!196 = !DILocation(line: 59, column: 38, scope: !194)
!197 = !{!173, !174, i64 8}
!198 = !DILocation(line: 59, column: 43, scope: !194)
!199 = !DILocation(line: 59, column: 6, scope: !186)
!200 = !DILocation(line: 60, column: 30, scope: !194)
!201 = !DILocation(line: 60, column: 3, scope: !194)
!202 = !DILocation(line: 62, column: 3, scope: !194)
!203 = !DILocation(line: 64, column: 2, scope: !186)
!204 = distinct !DISubprogram(name: "lzma_bufcpy", scope: !143, file: !143, line: 73, type: !205, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !207)
!205 = !DISubroutineType(types: !206)
!206 = !{!69, !76, !82, !69, !84, !82, !69}
!207 = !{!208, !209, !210, !211, !212, !213, !214, !216, !217}
!208 = !DILocalVariable(name: "in", arg: 1, scope: !204, file: !143, line: 73, type: !76)
!209 = !DILocalVariable(name: "in_pos", arg: 2, scope: !204, file: !143, line: 73, type: !82)
!210 = !DILocalVariable(name: "in_size", arg: 3, scope: !204, file: !143, line: 74, type: !69)
!211 = !DILocalVariable(name: "out", arg: 4, scope: !204, file: !143, line: 74, type: !84)
!212 = !DILocalVariable(name: "out_pos", arg: 5, scope: !204, file: !143, line: 75, type: !82)
!213 = !DILocalVariable(name: "out_size", arg: 6, scope: !204, file: !143, line: 75, type: !69)
!214 = !DILocalVariable(name: "in_avail", scope: !204, file: !143, line: 77, type: !215)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!216 = !DILocalVariable(name: "out_avail", scope: !204, file: !143, line: 78, type: !215)
!217 = !DILocalVariable(name: "copy_size", scope: !204, file: !143, line: 79, type: !215)
!218 = !DILocation(line: 0, scope: !204)
!219 = !DILocation(line: 77, column: 36, scope: !204)
!220 = !{!221, !221, i64 0}
!221 = !{!"long", !175, i64 0}
!222 = !DILocation(line: 77, column: 34, scope: !204)
!223 = !DILocation(line: 78, column: 38, scope: !204)
!224 = !DILocation(line: 78, column: 36, scope: !204)
!225 = !DILocation(line: 79, column: 27, scope: !204)
!226 = !DILocation(line: 81, column: 13, scope: !204)
!227 = !DILocation(line: 81, column: 28, scope: !204)
!228 = !DILocation(line: 81, column: 2, scope: !204)
!229 = !DILocation(line: 83, column: 10, scope: !204)
!230 = !DILocation(line: 84, column: 11, scope: !204)
!231 = !DILocation(line: 86, column: 2, scope: !204)
!232 = distinct !DISubprogram(name: "lzma_next_filter_init", scope: !143, file: !143, line: 91, type: !233, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !246)
!233 = !DISubroutineType(types: !234)
!234 = !{!59, !235, !60, !236}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !33, line: 82, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !33, line: 109, size: 192, elements: !240)
!240 = !{!241, !242, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !239, file: !33, line: 112, baseType: !44, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !239, file: !33, line: 116, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !33, line: 86, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !239, file: !33, line: 119, baseType: !68, size: 64, offset: 128)
!246 = !{!247, !248, !249}
!247 = !DILocalVariable(name: "next", arg: 1, scope: !232, file: !143, line: 91, type: !235)
!248 = !DILocalVariable(name: "allocator", arg: 2, scope: !232, file: !143, line: 91, type: !60)
!249 = !DILocalVariable(name: "filters", arg: 3, scope: !232, file: !143, line: 92, type: !236)
!250 = !DILocation(line: 0, scope: !232)
!251 = !DILocation(line: 94, column: 2, scope: !252)
!252 = distinct !DILexicalBlock(scope: !253, file: !143, line: 94, column: 2)
!253 = distinct !DILexicalBlock(scope: !232, file: !143, line: 94, column: 2)
!254 = !{!255, !174, i64 8}
!255 = !{!"lzma_filter_info_s", !221, i64 0, !174, i64 8, !174, i64 16}
!256 = !{!257, !221, i64 16}
!257 = !{!"lzma_next_coder_s", !174, i64 0, !221, i64 8, !221, i64 16, !174, i64 24, !174, i64 32, !174, i64 40, !174, i64 48, !174, i64 56}
!258 = !DILocation(line: 94, column: 2, scope: !253)
!259 = !DILocalVariable(name: "next", arg: 1, scope: !260, file: !143, line: 120, type: !235)
!260 = distinct !DISubprogram(name: "lzma_next_end", scope: !143, file: !143, line: 120, type: !261, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !263)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !235, !60}
!263 = !{!259, !264}
!264 = !DILocalVariable(name: "allocator", arg: 2, scope: !260, file: !143, line: 120, type: !60)
!265 = !DILocation(line: 0, scope: !260, inlinedAt: !266)
!266 = distinct !DILocation(line: 94, column: 2, scope: !252)
!267 = !DILocation(line: 126, column: 13, scope: !268, inlinedAt: !266)
!268 = distinct !DILexicalBlock(scope: !269, file: !143, line: 126, column: 7)
!269 = distinct !DILexicalBlock(scope: !270, file: !143, line: 122, column: 39)
!270 = distinct !DILexicalBlock(scope: !260, file: !143, line: 122, column: 6)
!271 = !{!257, !174, i64 32}
!272 = !DILocation(line: 126, column: 17, scope: !268, inlinedAt: !266)
!273 = !DILocation(line: 0, scope: !268, inlinedAt: !266)
!274 = !{!257, !174, i64 0}
!275 = !DILocation(line: 126, column: 7, scope: !269, inlinedAt: !266)
!276 = !DILocation(line: 127, column: 4, scope: !268, inlinedAt: !266)
!277 = !DILocation(line: 0, scope: !186, inlinedAt: !278)
!278 = distinct !DILocation(line: 129, column: 4, scope: !268, inlinedAt: !266)
!279 = !DILocation(line: 59, column: 16, scope: !194, inlinedAt: !278)
!280 = !DILocation(line: 59, column: 24, scope: !194, inlinedAt: !278)
!281 = !DILocation(line: 59, column: 38, scope: !194, inlinedAt: !278)
!282 = !DILocation(line: 59, column: 43, scope: !194, inlinedAt: !278)
!283 = !DILocation(line: 59, column: 6, scope: !186, inlinedAt: !278)
!284 = !DILocation(line: 60, column: 30, scope: !194, inlinedAt: !278)
!285 = !DILocation(line: 60, column: 3, scope: !194, inlinedAt: !278)
!286 = !DILocation(line: 62, column: 3, scope: !194, inlinedAt: !278)
!287 = !DILocation(line: 133, column: 11, scope: !269, inlinedAt: !266)
!288 = !{i64 0, i64 8, !289, i64 8, i64 8, !220, i64 16, i64 8, !220, i64 24, i64 8, !289, i64 32, i64 8, !289, i64 40, i64 8, !289, i64 48, i64 8, !289, i64 56, i64 8, !289}
!289 = !{!174, !174, i64 0}
!290 = !{i64 0, i64 8, !220, i64 8, i64 8, !220, i64 16, i64 8, !289, i64 24, i64 8, !289, i64 32, i64 8, !289, i64 40, i64 8, !289, i64 48, i64 8, !289}
!291 = !DILocation(line: 134, column: 2, scope: !269, inlinedAt: !266)
!292 = !DILocation(line: 95, column: 24, scope: !232)
!293 = !{!255, !221, i64 0}
!294 = !DILocation(line: 95, column: 8, scope: !232)
!295 = !DILocation(line: 95, column: 11, scope: !232)
!296 = !{!257, !221, i64 8}
!297 = !DILocation(line: 96, column: 25, scope: !232)
!298 = !DILocation(line: 96, column: 9, scope: !232)
!299 = !DILocation(line: 97, column: 16, scope: !232)
!300 = !DILocation(line: 96, column: 2, scope: !232)
!301 = !DILocation(line: 0, scope: !260)
!302 = !DILocation(line: 122, column: 12, scope: !270)
!303 = !DILocation(line: 122, column: 17, scope: !270)
!304 = !DILocation(line: 122, column: 6, scope: !260)
!305 = !DILocation(line: 126, column: 13, scope: !268)
!306 = !DILocation(line: 126, column: 17, scope: !268)
!307 = !DILocation(line: 0, scope: !268)
!308 = !DILocation(line: 126, column: 7, scope: !269)
!309 = !DILocation(line: 127, column: 4, scope: !268)
!310 = !DILocation(line: 0, scope: !186, inlinedAt: !311)
!311 = distinct !DILocation(line: 129, column: 4, scope: !268)
!312 = !DILocation(line: 59, column: 16, scope: !194, inlinedAt: !311)
!313 = !DILocation(line: 59, column: 24, scope: !194, inlinedAt: !311)
!314 = !DILocation(line: 59, column: 38, scope: !194, inlinedAt: !311)
!315 = !DILocation(line: 59, column: 43, scope: !194, inlinedAt: !311)
!316 = !DILocation(line: 59, column: 6, scope: !186, inlinedAt: !311)
!317 = !DILocation(line: 60, column: 30, scope: !194, inlinedAt: !311)
!318 = !DILocation(line: 60, column: 3, scope: !194, inlinedAt: !311)
!319 = !DILocation(line: 62, column: 3, scope: !194, inlinedAt: !311)
!320 = !DILocation(line: 133, column: 11, scope: !269)
!321 = !DILocation(line: 134, column: 2, scope: !269)
!322 = !DILocation(line: 136, column: 2, scope: !260)
!323 = distinct !DISubprogram(name: "lzma_next_filter_update", scope: !143, file: !143, line: 102, type: !324, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{!59, !235, !60, !108}
!326 = !{!327, !328, !329}
!327 = !DILocalVariable(name: "next", arg: 1, scope: !323, file: !143, line: 102, type: !235)
!328 = !DILocalVariable(name: "allocator", arg: 2, scope: !323, file: !143, line: 102, type: !60)
!329 = !DILocalVariable(name: "reversed_filters", arg: 3, scope: !323, file: !143, line: 103, type: !108)
!330 = !DILocation(line: 0, scope: !323)
!331 = !DILocation(line: 108, column: 26, scope: !332)
!332 = distinct !DILexicalBlock(scope: !323, file: !143, line: 108, column: 6)
!333 = !{!334, !221, i64 0}
!334 = !{!"", !221, i64 0, !174, i64 8}
!335 = !DILocation(line: 108, column: 38, scope: !332)
!336 = !DILocation(line: 108, column: 29, scope: !332)
!337 = !DILocation(line: 108, column: 6, scope: !323)
!338 = !DILocation(line: 111, column: 29, scope: !339)
!339 = distinct !DILexicalBlock(scope: !323, file: !143, line: 111, column: 6)
!340 = !DILocation(line: 111, column: 6, scope: !323)
!341 = !DILocation(line: 115, column: 15, scope: !323)
!342 = !{!257, !174, i64 56}
!343 = !DILocation(line: 115, column: 28, scope: !323)
!344 = !DILocation(line: 115, column: 9, scope: !323)
!345 = !DILocation(line: 115, column: 2, scope: !323)
!346 = !DILocation(line: 116, column: 1, scope: !323)
!347 = distinct !DISubprogram(name: "lzma_strm_init", scope: !143, file: !143, line: 145, type: !348, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !375)
!348 = !DISubroutineType(types: !349)
!349 = !{!59, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, elements: !353)
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !364, !365, !366, !367, !368, !369, !370, !371, !372, !374}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !352, file: !4, line: 454, baseType: !77, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !352, file: !4, line: 455, baseType: !69, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !352, file: !4, line: 456, baseType: !46, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !352, file: !4, line: 458, baseType: !85, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !352, file: !4, line: 459, baseType: !69, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !352, file: !4, line: 460, baseType: !46, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !352, file: !4, line: 468, baseType: !60, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !352, file: !4, line: 471, baseType: !362, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !34)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !352, file: !4, line: 479, baseType: !68, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !352, file: !4, line: 480, baseType: !68, size: 64, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !352, file: !4, line: 481, baseType: !68, size: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !352, file: !4, line: 482, baseType: !68, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !352, file: !4, line: 483, baseType: !46, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !352, file: !4, line: 484, baseType: !46, size: 64, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !352, file: !4, line: 485, baseType: !69, size: 64, offset: 896)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !352, file: !4, line: 486, baseType: !69, size: 64, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !352, file: !4, line: 487, baseType: !373, size: 32, offset: 1024)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !131)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !352, file: !4, line: 488, baseType: !373, size: 32, offset: 1056)
!375 = !{!376}
!376 = !DILocalVariable(name: "strm", arg: 1, scope: !347, file: !143, line: 145, type: !350)
!377 = !DILocation(line: 0, scope: !347)
!378 = !DILocation(line: 147, column: 11, scope: !379)
!379 = distinct !DILexicalBlock(scope: !347, file: !143, line: 147, column: 6)
!380 = !DILocation(line: 147, column: 6, scope: !347)
!381 = !DILocation(line: 150, column: 12, scope: !382)
!382 = distinct !DILexicalBlock(scope: !347, file: !143, line: 150, column: 6)
!383 = !{!384, !174, i64 56}
!384 = !{!"", !174, i64 0, !221, i64 8, !221, i64 16, !174, i64 24, !221, i64 32, !221, i64 40, !174, i64 48, !174, i64 56, !174, i64 64, !174, i64 72, !174, i64 80, !174, i64 88, !221, i64 96, !221, i64 104, !221, i64 112, !221, i64 120, !175, i64 128, !175, i64 132}
!385 = !DILocation(line: 150, column: 21, scope: !382)
!386 = !DILocation(line: 150, column: 6, scope: !347)
!387 = !DILocation(line: 152, column: 11, scope: !388)
!388 = distinct !DILexicalBlock(scope: !382, file: !143, line: 150, column: 30)
!389 = !{!384, !174, i64 48}
!390 = !DILocation(line: 0, scope: !157, inlinedAt: !391)
!391 = distinct !DILocation(line: 151, column: 20, scope: !388)
!392 = !DILocation(line: 47, column: 16, scope: !169, inlinedAt: !391)
!393 = !DILocation(line: 47, column: 24, scope: !169, inlinedAt: !391)
!394 = !DILocation(line: 47, column: 38, scope: !169, inlinedAt: !391)
!395 = !DILocation(line: 47, column: 44, scope: !169, inlinedAt: !391)
!396 = !DILocation(line: 47, column: 6, scope: !157, inlinedAt: !391)
!397 = !DILocation(line: 48, column: 37, scope: !169, inlinedAt: !391)
!398 = !DILocation(line: 48, column: 9, scope: !169, inlinedAt: !391)
!399 = !DILocation(line: 48, column: 3, scope: !169, inlinedAt: !391)
!400 = !DILocation(line: 50, column: 9, scope: !169, inlinedAt: !391)
!401 = !DILocation(line: 0, scope: !169, inlinedAt: !391)
!402 = !DILocation(line: 151, column: 18, scope: !388)
!403 = !DILocation(line: 153, column: 22, scope: !404)
!404 = distinct !DILexicalBlock(scope: !388, file: !143, line: 153, column: 7)
!405 = !DILocation(line: 153, column: 7, scope: !388)
!406 = !DILocation(line: 156, column: 26, scope: !388)
!407 = !DILocation(line: 159, column: 8, scope: !347)
!408 = !DILocation(line: 157, column: 2, scope: !388)
!409 = !DILocation(line: 159, column: 18, scope: !347)
!410 = !DILocation(line: 163, column: 18, scope: !347)
!411 = !DILocation(line: 163, column: 27, scope: !347)
!412 = !{!413, !175, i64 64}
!413 = !{!"lzma_internal_s", !257, i64 0, !175, i64 64, !221, i64 72, !175, i64 80, !414, i64 84}
!414 = !{!"_Bool", !175, i64 0}
!415 = !DILocation(line: 166, column: 8, scope: !347)
!416 = !DILocation(line: 160, column: 53, scope: !347)
!417 = !DILocation(line: 166, column: 17, scope: !347)
!418 = !{!384, !221, i64 16}
!419 = !DILocation(line: 167, column: 8, scope: !347)
!420 = !DILocation(line: 167, column: 18, scope: !347)
!421 = !{!384, !221, i64 40}
!422 = !DILocation(line: 169, column: 2, scope: !347)
!423 = !DILocation(line: 170, column: 1, scope: !347)
!424 = distinct !DISubprogram(name: "lzma_code", scope: !143, file: !143, line: 174, type: !425, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{!59, !350, !86}
!427 = !{!428, !429, !430, !431, !432}
!428 = !DILocalVariable(name: "strm", arg: 1, scope: !424, file: !143, line: 174, type: !350)
!429 = !DILocalVariable(name: "action", arg: 2, scope: !424, file: !143, line: 174, type: !86)
!430 = !DILocalVariable(name: "in_pos", scope: !424, file: !143, line: 251, type: !69)
!431 = !DILocalVariable(name: "out_pos", scope: !424, file: !143, line: 252, type: !69)
!432 = !DILocalVariable(name: "ret", scope: !424, file: !143, line: 253, type: !59)
!433 = !DILocation(line: 0, scope: !424)
