; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/composite.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/composite.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._GeometryInfo = type { double, double, double, double, double }
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }

!408 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!409 = !DIEnumerator(name: "TransformEvent", value: 16384)
!410 = !DIEnumerator(name: "UserEvent", value: 36864)
!411 = !DIEnumerator(name: "WandEvent", value: 65536)
!412 = !DIEnumerator(name: "X11Event", value: 131072)
!413 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!414 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 30, baseType: !5, size: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!417 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!418 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!419 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!420 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!421 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!422 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!423 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!424 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!425 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!426 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!427 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!428 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!429 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !153, line: 25, baseType: !5, size: 32, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!432 = !DIEnumerator(name: "NoValue", value: 0)
!433 = !DIEnumerator(name: "XValue", value: 1)
!434 = !DIEnumerator(name: "XiValue", value: 1)
!435 = !DIEnumerator(name: "YValue", value: 2)
!436 = !DIEnumerator(name: "PsiValue", value: 2)
!437 = !DIEnumerator(name: "WidthValue", value: 4)
!438 = !DIEnumerator(name: "RhoValue", value: 4)
!439 = !DIEnumerator(name: "HeightValue", value: 8)
!440 = !DIEnumerator(name: "SigmaValue", value: 8)
!441 = !DIEnumerator(name: "ChiValue", value: 16)
!442 = !DIEnumerator(name: "XiNegative", value: 32)
!443 = !DIEnumerator(name: "XNegative", value: 32)
!444 = !DIEnumerator(name: "PsiNegative", value: 64)
!445 = !DIEnumerator(name: "YNegative", value: 64)
!446 = !DIEnumerator(name: "ChiNegative", value: 128)
!447 = !DIEnumerator(name: "PercentValue", value: 4096)
!448 = !DIEnumerator(name: "AspectValue", value: 8192)
!449 = !DIEnumerator(name: "NormalizeValue", value: 8192)
!450 = !DIEnumerator(name: "LessValue", value: 16384)
!451 = !DIEnumerator(name: "GreaterValue", value: 32768)
!452 = !DIEnumerator(name: "MinimumValue", value: 65536)
!453 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536)
!454 = !DIEnumerator(name: "AreaValue", value: 131072)
!455 = !DIEnumerator(name: "DecimalValue", value: 262144)
!456 = !DIEnumerator(name: "SeparatorValue", value: 524288)
!457 = !DIEnumerator(name: "AllValues", value: 2147483647)
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !459, line: 27, baseType: !5, size: 32, elements: !460)
!459 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!461 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!462 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!463 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!464 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!465 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!466 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!467 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!468 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!469 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!470 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!471 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!472 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!473 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!474 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!475 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!476 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!477 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!478 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!479 = !{!480, !481, !537, !703, !546, !704, !505, !706, !708, !610, !618, !541, !519, !510, !710, !615, !707}
!480 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !485)
!485 = !{!486, !488, !490, !492, !495, !497, !499, !500, !501, !502, !503, !504, !515, !516, !517, !518, !520, !534, !536, !538, !540, !543, !544, !545, !551, !552, !553, !561, !562, !563, !564, !565, !566, !568, !570, !572, !574, !576, !578, !580, !581, !582, !583, !584, !585, !586, !594, !609, !623, !624, !625, !626, !630, !634, !638, !639, !640, !641, !642, !660, !661, !663, !664, !674, !675, !677, !678, !679, !680, !681, !682, !684, !685, !686, !687, !688, !689, !690, !692, !693, !694, !695, !696, !700, !702}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !484, file: !77, line: 153, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !484, file: !77, line: 156, baseType: !489, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !484, file: !77, line: 159, baseType: !491, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !484, file: !77, line: 162, baseType: !493, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !494, line: 46, baseType: !480)
!494 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!495 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !484, file: !77, line: 165, baseType: !496, size: 32, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !484, file: !77, line: 168, baseType: !498, size: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !484, file: !77, line: 169, baseType: !498, size: 32, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !484, file: !77, line: 172, baseType: !493, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !484, file: !77, line: 173, baseType: !493, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !484, file: !77, line: 174, baseType: !493, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !484, file: !77, line: 175, baseType: !493, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !484, file: !77, line: 178, baseType: !505, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !508)
!508 = !{!509, !512, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !507, file: !326, line: 143, baseType: !510, size: 16)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !511)
!511 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !507, file: !326, line: 144, baseType: !510, size: 16, offset: 16)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !507, file: !326, line: 145, baseType: !510, size: 16, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !507, file: !326, line: 146, baseType: !510, size: 16, offset: 48)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !484, file: !77, line: 179, baseType: !506, size: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !484, file: !77, line: 180, baseType: !506, size: 64, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !484, file: !77, line: 181, baseType: !506, size: 64, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !484, file: !77, line: 184, baseType: !519, size: 64, offset: 832)
!519 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !484, file: !77, line: 187, baseType: !521, size: 768, offset: 896)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !523)
!523 = !{!524, !531, !532, !533}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !522, file: !77, line: 124, baseType: !525, size: 192)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !527)
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !526, file: !77, line: 98, baseType: !519, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !526, file: !77, line: 99, baseType: !519, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !526, file: !77, line: 100, baseType: !519, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !522, file: !77, line: 125, baseType: !525, size: 192, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !522, file: !77, line: 126, baseType: !525, size: 192, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !522, file: !77, line: 127, baseType: !525, size: 192, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !484, file: !77, line: 190, baseType: !535, size: 32, offset: 1664)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !484, file: !77, line: 193, baseType: !537, size: 64, offset: 1728)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !484, file: !77, line: 196, baseType: !539, size: 32, offset: 1792)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !484, file: !77, line: 199, baseType: !541, size: 64, offset: 1856)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !484, file: !77, line: 200, baseType: !541, size: 64, offset: 1920)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !484, file: !77, line: 201, baseType: !541, size: 64, offset: 1984)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !484, file: !77, line: 204, baseType: !546, size: 64, offset: 2048)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !547, line: 77, baseType: !548)
!547 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !549, line: 193, baseType: !550)
!549 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!550 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !484, file: !77, line: 207, baseType: !519, size: 64, offset: 2112)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !484, file: !77, line: 208, baseType: !519, size: 64, offset: 2176)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !484, file: !77, line: 211, baseType: !554, size: 256, offset: 2240)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !556)
!556 = !{!557, !558, !559, !560}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !555, file: !153, line: 124, baseType: !493, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !555, file: !153, line: 125, baseType: !493, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !555, file: !153, line: 128, baseType: !546, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !555, file: !153, line: 129, baseType: !546, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !484, file: !77, line: 212, baseType: !554, size: 256, offset: 2496)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !484, file: !77, line: 213, baseType: !554, size: 256, offset: 2752)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !484, file: !77, line: 216, baseType: !519, size: 64, offset: 3008)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !484, file: !77, line: 217, baseType: !519, size: 64, offset: 3072)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !484, file: !77, line: 218, baseType: !519, size: 64, offset: 3136)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !484, file: !77, line: 221, baseType: !567, size: 32, offset: 3200)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !484, file: !77, line: 224, baseType: !569, size: 32, offset: 3232)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !484, file: !77, line: 227, baseType: !571, size: 32, offset: 3264)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !484, file: !77, line: 230, baseType: !573, size: 32, offset: 3296)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !484, file: !77, line: 233, baseType: !575, size: 32, offset: 3328)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !484, file: !77, line: 236, baseType: !577, size: 32, offset: 3360)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !484, file: !77, line: 239, baseType: !579, size: 64, offset: 3392)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !484, file: !77, line: 242, baseType: !493, size: 64, offset: 3456)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !484, file: !77, line: 243, baseType: !493, size: 64, offset: 3520)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !484, file: !77, line: 246, baseType: !546, size: 64, offset: 3584)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !484, file: !77, line: 249, baseType: !493, size: 64, offset: 3648)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !484, file: !77, line: 250, baseType: !493, size: 64, offset: 3712)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !484, file: !77, line: 253, baseType: !546, size: 64, offset: 3776)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !484, file: !77, line: 256, baseType: !587, size: 192, offset: 3840)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !588, line: 68, baseType: !589)
!588 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !588, line: 62, size: 192, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !589, file: !588, line: 65, baseType: !519, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !589, file: !588, line: 66, baseType: !519, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !589, file: !588, line: 67, baseType: !519, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !484, file: !77, line: 259, baseType: !595, size: 512, offset: 4032)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !597)
!597 = !{!598, !605, !606, !608}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !596, file: !247, line: 43, baseType: !599, size: 192)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !600, file: !247, line: 35, baseType: !519, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !600, file: !247, line: 36, baseType: !519, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !600, file: !247, line: 37, baseType: !519, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !596, file: !247, line: 44, baseType: !599, size: 192, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !596, file: !247, line: 47, baseType: !607, size: 32, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !596, file: !247, line: 50, baseType: !493, size: 64, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !484, file: !77, line: 262, baseType: !610, size: 64, offset: 4544)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !611, line: 26, baseType: !612)
!611 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!498, !615, !617, !620, !537}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !619)
!619 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !622)
!622 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !484, file: !77, line: 265, baseType: !537, size: 64, offset: 4608)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !484, file: !77, line: 266, baseType: !537, size: 64, offset: 4672)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !484, file: !77, line: 267, baseType: !537, size: 64, offset: 4736)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !484, file: !77, line: 270, baseType: !627, size: 64, offset: 4800)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !629)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !484, file: !77, line: 273, baseType: !631, size: 64, offset: 4864)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !633)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !484, file: !77, line: 276, baseType: !635, size: 32768, offset: 4928)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 32768, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 4096)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !484, file: !77, line: 277, baseType: !635, size: 32768, offset: 37696)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !484, file: !77, line: 278, baseType: !635, size: 32768, offset: 70464)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !484, file: !77, line: 281, baseType: !493, size: 64, offset: 103232)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !484, file: !77, line: 282, baseType: !493, size: 64, offset: 103296)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !484, file: !77, line: 285, baseType: !643, size: 448, offset: 103360)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !645)
!645 = !{!646, !648, !650, !651, !652, !653, !654, !659}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !644, file: !253, line: 105, baseType: !647, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !644, file: !253, line: 108, baseType: !649, size: 32, offset: 32)
!649 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !644, file: !253, line: 111, baseType: !541, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !644, file: !253, line: 112, baseType: !541, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !644, file: !253, line: 115, baseType: !537, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !644, file: !253, line: 118, baseType: !498, size: 32, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !644, file: !253, line: 121, baseType: !655, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !657, line: 26, baseType: !658)
!657 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !657, line: 25, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !644, file: !253, line: 124, baseType: !493, size: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !484, file: !77, line: 288, baseType: !498, size: 32, offset: 103808)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !484, file: !77, line: 291, baseType: !662, size: 64, offset: 103872)
!662 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !546)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !484, file: !77, line: 294, baseType: !655, size: 64, offset: 103936)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !484, file: !77, line: 297, baseType: !665, size: 256, offset: 104000)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !667)
!667 = !{!668, !669, !670, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !666, file: !89, line: 30, baseType: !541, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !666, file: !89, line: 33, baseType: !493, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !666, file: !89, line: 36, baseType: !671, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !666, file: !89, line: 39, baseType: !493, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !484, file: !77, line: 298, baseType: !665, size: 256, offset: 104256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !484, file: !77, line: 299, baseType: !676, size: 64, offset: 104512)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !484, file: !77, line: 302, baseType: !493, size: 64, offset: 104576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !484, file: !77, line: 305, baseType: !493, size: 64, offset: 104640)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !484, file: !77, line: 308, baseType: !579, size: 64, offset: 104704)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !484, file: !77, line: 309, baseType: !579, size: 64, offset: 104768)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !77, line: 310, baseType: !579, size: 64, offset: 104832)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !484, file: !77, line: 313, baseType: !683, size: 32, offset: 104896)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !484, file: !77, line: 316, baseType: !498, size: 32, offset: 104928)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !484, file: !77, line: 319, baseType: !506, size: 64, offset: 104960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !484, file: !77, line: 322, baseType: !579, size: 64, offset: 105024)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !484, file: !77, line: 325, baseType: !554, size: 256, offset: 105088)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !484, file: !77, line: 328, baseType: !537, size: 64, offset: 105344)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !484, file: !77, line: 329, baseType: !537, size: 64, offset: 105408)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !484, file: !77, line: 332, baseType: !691, size: 32, offset: 105472)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !484, file: !77, line: 335, baseType: !498, size: 32, offset: 105504)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !484, file: !77, line: 338, baseType: !621, size: 64, offset: 105536)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !484, file: !77, line: 341, baseType: !498, size: 32, offset: 105600)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !484, file: !77, line: 344, baseType: !493, size: 64, offset: 105664)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !484, file: !77, line: 347, baseType: !697, size: 64, offset: 105728)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !698, line: 7, baseType: !699)
!698 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !549, line: 160, baseType: !550)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !484, file: !77, line: 350, baseType: !701, size: 32, offset: 105792)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !484, file: !77, line: 353, baseType: !493, size: 64, offset: 105856)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !510)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !711)
!711 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!712 = !{i32 7, !"Dwarf Version", i32 5}
!713 = !{i32 2, !"Debug Info Version", i32 3}
!714 = !{i32 1, !"wchar_size", i32 4}
!715 = !{i32 7, !"PIC Level", i32 2}
!716 = !{i32 7, !"PIE Level", i32 2}
!717 = !{i32 7, !"uwtable", i32 2}
!718 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!719 = distinct !DISubprogram(name: "CompositeImage", scope: !720, file: !720, line: 1619, type: !721, scopeLine: 1622, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !725)
!720 = !DIFile(filename: "apps/538.imagick_r/src/magick/composite.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "548053456c298b11e0ea0a46c37f5ee5")
!721 = !DISubroutineType(types: !722)
!722 = !{!498, !703, !723, !481, !724, !724}
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!725 = !{!726, !727, !728, !729, !730, !731}
!726 = !DILocalVariable(name: "image", arg: 1, scope: !719, file: !720, line: 1619, type: !703)
!727 = !DILocalVariable(name: "compose", arg: 2, scope: !719, file: !720, line: 1620, type: !723)
!728 = !DILocalVariable(name: "composite_image", arg: 3, scope: !719, file: !720, line: 1620, type: !481)
!729 = !DILocalVariable(name: "x_offset", arg: 4, scope: !719, file: !720, line: 1621, type: !724)
!730 = !DILocalVariable(name: "y_offset", arg: 5, scope: !719, file: !720, line: 1621, type: !724)
!731 = !DILocalVariable(name: "status", scope: !719, file: !720, line: 1624, type: !498)
!732 = !DILocation(line: 0, scope: !719)
!733 = !DILocation(line: 1626, column: 10, scope: !719)
!734 = !DILocation(line: 1628, column: 3, scope: !719)
!735 = distinct !DISubprogram(name: "CompositeImageChannel", scope: !720, file: !720, line: 1631, type: !736, scopeLine: 1634, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !740)
!736 = !DISubroutineType(types: !737)
!737 = !{!498, !703, !738, !723, !481, !724, !724}
!738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !368)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !751, !752, !753, !755, !764, !765, !766, !767, !768, !769, !783, !784, !785, !786, !787, !788, !789, !790, !792, !793, !799, !800, !801, !802, !803, !806, !808, !809, !810, !811, !812, !813, !814, !818, !826, !829, !833, !835, !837, !839, !840, !846, !848, !849, !850, !851, !852, !853, !860, !861, !862, !863, !867, !868, !869, !873, !874, !875, !876, !877, !878, !879, !880, !882, !883, !884, !885, !886, !892}
!741 = !DILocalVariable(name: "image", arg: 1, scope: !735, file: !720, line: 1631, type: !703)
!742 = !DILocalVariable(name: "channel", arg: 2, scope: !735, file: !720, line: 1632, type: !738)
!743 = !DILocalVariable(name: "compose", arg: 3, scope: !735, file: !720, line: 1632, type: !723)
!744 = !DILocalVariable(name: "composite", arg: 4, scope: !735, file: !720, line: 1633, type: !481)
!745 = !DILocalVariable(name: "x_offset", arg: 5, scope: !735, file: !720, line: 1633, type: !724)
!746 = !DILocalVariable(name: "y_offset", arg: 6, scope: !735, file: !720, line: 1633, type: !724)
!747 = !DILocalVariable(name: "composite_view", scope: !735, file: !720, line: 1638, type: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !459, line: 50, baseType: !750)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!751 = !DILocalVariable(name: "image_view", scope: !735, file: !720, line: 1639, type: !748)
!752 = !DILocalVariable(name: "value", scope: !735, file: !720, line: 1642, type: !615)
!753 = !DILocalVariable(name: "exception", scope: !735, file: !720, line: 1645, type: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!755 = !DILocalVariable(name: "geometry_info", scope: !735, file: !720, line: 1648, type: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryInfo", file: !153, line: 112, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GeometryInfo", file: !153, line: 104, size: 320, elements: !758)
!758 = !{!759, !760, !761, !762, !763}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !757, file: !153, line: 107, baseType: !519, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !757, file: !153, line: 108, baseType: !519, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !757, file: !153, line: 109, baseType: !519, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !757, file: !153, line: 110, baseType: !519, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "chi", scope: !757, file: !153, line: 111, baseType: !519, size: 64, offset: 256)
!764 = !DILocalVariable(name: "composite_image", scope: !735, file: !720, line: 1651, type: !703)
!765 = !DILocalVariable(name: "destination_image", scope: !735, file: !720, line: 1652, type: !703)
!766 = !DILocalVariable(name: "clip_to_self", scope: !735, file: !720, line: 1655, type: !498)
!767 = !DILocalVariable(name: "status", scope: !735, file: !720, line: 1656, type: !498)
!768 = !DILocalVariable(name: "progress", scope: !735, file: !720, line: 1659, type: !618)
!769 = !DILocalVariable(name: "zero", scope: !735, file: !720, line: 1662, type: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779, !780, !781, !782}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !771, file: !326, line: 107, baseType: !487, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !771, file: !326, line: 110, baseType: !489, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !771, file: !326, line: 113, baseType: !498, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !771, file: !326, line: 116, baseType: !519, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !771, file: !326, line: 119, baseType: !493, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !771, file: !326, line: 122, baseType: !710, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !771, file: !326, line: 123, baseType: !710, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !771, file: !326, line: 124, baseType: !710, size: 32, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !771, file: !326, line: 125, baseType: !710, size: 32, offset: 352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !771, file: !326, line: 126, baseType: !710, size: 32, offset: 384)
!783 = !DILocalVariable(name: "amount", scope: !735, file: !720, line: 1665, type: !710)
!784 = !DILocalVariable(name: "destination_dissolve", scope: !735, file: !720, line: 1666, type: !710)
!785 = !DILocalVariable(name: "midpoint", scope: !735, file: !720, line: 1667, type: !710)
!786 = !DILocalVariable(name: "percent_luma", scope: !735, file: !720, line: 1668, type: !710)
!787 = !DILocalVariable(name: "percent_chroma", scope: !735, file: !720, line: 1669, type: !710)
!788 = !DILocalVariable(name: "source_dissolve", scope: !735, file: !720, line: 1670, type: !710)
!789 = !DILocalVariable(name: "threshold", scope: !735, file: !720, line: 1671, type: !710)
!790 = !DILocalVariable(name: "flags", scope: !735, file: !720, line: 1674, type: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!792 = !DILocalVariable(name: "y", scope: !735, file: !720, line: 1677, type: !546)
!793 = !DILocalVariable(name: "sync", scope: !794, file: !720, line: 1748, type: !498)
!794 = distinct !DILexicalBlock(scope: !795, file: !720, line: 1746, column: 7)
!795 = distinct !DILexicalBlock(scope: !796, file: !720, line: 1745, column: 7)
!796 = distinct !DILexicalBlock(scope: !797, file: !720, line: 1745, column: 7)
!797 = distinct !DILexicalBlock(scope: !798, file: !720, line: 1731, column: 5)
!798 = distinct !DILexicalBlock(scope: !735, file: !720, line: 1707, column: 3)
!799 = !DILocalVariable(name: "composite_indexes", scope: !794, file: !720, line: 1751, type: !708)
!800 = !DILocalVariable(name: "p", scope: !794, file: !720, line: 1754, type: !704)
!801 = !DILocalVariable(name: "indexes", scope: !794, file: !720, line: 1757, type: !706)
!802 = !DILocalVariable(name: "q", scope: !794, file: !720, line: 1760, type: !505)
!803 = !DILocalVariable(name: "proceed", scope: !804, file: !720, line: 1786, type: !498)
!804 = distinct !DILexicalBlock(scope: !805, file: !720, line: 1784, column: 11)
!805 = distinct !DILexicalBlock(scope: !794, file: !720, line: 1783, column: 13)
!806 = !DILocalVariable(name: "composite_view", scope: !807, file: !720, line: 1817, type: !748)
!807 = distinct !DILexicalBlock(scope: !798, file: !720, line: 1815, column: 5)
!808 = !DILocalVariable(name: "destination_view", scope: !807, file: !720, line: 1818, type: !748)
!809 = !DILocalVariable(name: "pixel", scope: !807, file: !720, line: 1821, type: !770)
!810 = !DILocalVariable(name: "angle_range", scope: !807, file: !720, line: 1824, type: !710)
!811 = !DILocalVariable(name: "angle_start", scope: !807, file: !720, line: 1825, type: !710)
!812 = !DILocalVariable(name: "height", scope: !807, file: !720, line: 1826, type: !710)
!813 = !DILocalVariable(name: "width", scope: !807, file: !720, line: 1827, type: !710)
!814 = !DILocalVariable(name: "resample_filter", scope: !807, file: !720, line: 1830, type: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResampleFilter", file: !102, line: 76, baseType: !817)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ResampleFilter", file: !102, line: 75, flags: DIFlagFwdDecl)
!818 = !DILocalVariable(name: "blur", scope: !807, file: !720, line: 1833, type: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !77, line: 110, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !77, line: 103, size: 256, elements: !821)
!821 = !{!822, !823, !824, !825}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !820, file: !77, line: 106, baseType: !519, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !820, file: !77, line: 107, baseType: !519, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !820, file: !77, line: 108, baseType: !519, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !820, file: !77, line: 109, baseType: !519, size: 64, offset: 192)
!826 = !DILocalVariable(name: "angle", scope: !827, file: !720, line: 1882, type: !710)
!827 = distinct !DILexicalBlock(scope: !828, file: !720, line: 1880, column: 9)
!828 = distinct !DILexicalBlock(scope: !807, file: !720, line: 1879, column: 11)
!829 = !DILocalVariable(name: "sync", scope: !830, file: !720, line: 1919, type: !498)
!830 = distinct !DILexicalBlock(scope: !831, file: !720, line: 1917, column: 7)
!831 = distinct !DILexicalBlock(scope: !832, file: !720, line: 1916, column: 7)
!832 = distinct !DILexicalBlock(scope: !807, file: !720, line: 1916, column: 7)
!833 = !DILocalVariable(name: "p", scope: !830, file: !720, line: 1922, type: !834)
!834 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !704)
!835 = !DILocalVariable(name: "r", scope: !830, file: !720, line: 1925, type: !836)
!836 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !505)
!837 = !DILocalVariable(name: "destination_indexes", scope: !830, file: !720, line: 1928, type: !838)
!838 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !706)
!839 = !DILocalVariable(name: "x", scope: !830, file: !720, line: 1931, type: !546)
!840 = !DILocalVariable(name: "angle", scope: !841, file: !720, line: 1952, type: !710)
!841 = distinct !DILexicalBlock(scope: !842, file: !720, line: 1950, column: 13)
!842 = distinct !DILexicalBlock(scope: !843, file: !720, line: 1949, column: 15)
!843 = distinct !DILexicalBlock(scope: !844, file: !720, line: 1943, column: 9)
!844 = distinct !DILexicalBlock(scope: !845, file: !720, line: 1942, column: 9)
!845 = distinct !DILexicalBlock(scope: !830, file: !720, line: 1942, column: 9)
!846 = !DILocalVariable(name: "composite_view", scope: !847, file: !720, line: 1996, type: !748)
!847 = distinct !DILexicalBlock(scope: !798, file: !720, line: 1994, column: 5)
!848 = !DILocalVariable(name: "destination_view", scope: !847, file: !720, line: 1997, type: !748)
!849 = !DILocalVariable(name: "image_view", scope: !847, file: !720, line: 1998, type: !748)
!850 = !DILocalVariable(name: "pixel", scope: !847, file: !720, line: 2001, type: !770)
!851 = !DILocalVariable(name: "horizontal_scale", scope: !847, file: !720, line: 2004, type: !710)
!852 = !DILocalVariable(name: "vertical_scale", scope: !847, file: !720, line: 2005, type: !710)
!853 = !DILocalVariable(name: "center", scope: !847, file: !720, line: 2008, type: !854)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !855, line: 142, baseType: !856)
!855 = !DIFile(filename: "apps/538.imagick_r/src/magick/draw.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7430ad7998fb3d4ef58bbf5582967ea1")
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !855, line: 137, size: 128, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !856, file: !855, line: 140, baseType: !519, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !856, file: !855, line: 141, baseType: !519, size: 64, offset: 64)
!860 = !DILocalVariable(name: "offset", scope: !847, file: !720, line: 2009, type: !854)
!861 = !DILocalVariable(name: "destination_indexes", scope: !847, file: !720, line: 2012, type: !838)
!862 = !DILocalVariable(name: "r", scope: !847, file: !720, line: 2015, type: !836)
!863 = !DILocalVariable(name: "sync", scope: !864, file: !720, line: 2113, type: !498)
!864 = distinct !DILexicalBlock(scope: !865, file: !720, line: 2111, column: 7)
!865 = distinct !DILexicalBlock(scope: !866, file: !720, line: 2110, column: 7)
!866 = distinct !DILexicalBlock(scope: !847, file: !720, line: 2110, column: 7)
!867 = !DILocalVariable(name: "p", scope: !864, file: !720, line: 2116, type: !834)
!868 = !DILocalVariable(name: "x", scope: !864, file: !720, line: 2119, type: !546)
!869 = !DILocalVariable(name: "pixels", scope: !870, file: !720, line: 2295, type: !704)
!870 = distinct !DILexicalBlock(scope: !871, file: !720, line: 2293, column: 3)
!871 = distinct !DILexicalBlock(scope: !872, file: !720, line: 2292, column: 3)
!872 = distinct !DILexicalBlock(scope: !735, file: !720, line: 2292, column: 3)
!873 = !DILocalVariable(name: "luma", scope: !870, file: !720, line: 2298, type: !519)
!874 = !DILocalVariable(name: "hue", scope: !870, file: !720, line: 2299, type: !519)
!875 = !DILocalVariable(name: "chroma", scope: !870, file: !720, line: 2300, type: !519)
!876 = !DILocalVariable(name: "sans", scope: !870, file: !720, line: 2301, type: !519)
!877 = !DILocalVariable(name: "composite", scope: !870, file: !720, line: 2304, type: !770)
!878 = !DILocalVariable(name: "destination", scope: !870, file: !720, line: 2305, type: !770)
!879 = !DILocalVariable(name: "source", scope: !870, file: !720, line: 2306, type: !770)
!880 = !DILocalVariable(name: "composite_indexes", scope: !870, file: !720, line: 2309, type: !881)
!881 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !708)
!882 = !DILocalVariable(name: "p", scope: !870, file: !720, line: 2312, type: !834)
!883 = !DILocalVariable(name: "indexes", scope: !870, file: !720, line: 2315, type: !838)
!884 = !DILocalVariable(name: "x", scope: !870, file: !720, line: 2318, type: !546)
!885 = !DILocalVariable(name: "q", scope: !870, file: !720, line: 2321, type: !836)
!886 = !DILocalVariable(name: "offset", scope: !887, file: !720, line: 2712, type: !546)
!887 = distinct !DILexicalBlock(scope: !888, file: !720, line: 2710, column: 9)
!888 = distinct !DILexicalBlock(scope: !889, file: !720, line: 2466, column: 7)
!889 = distinct !DILexicalBlock(scope: !890, file: !720, line: 2364, column: 5)
!890 = distinct !DILexicalBlock(scope: !891, file: !720, line: 2363, column: 5)
!891 = distinct !DILexicalBlock(scope: !870, file: !720, line: 2363, column: 5)
!892 = !DILocalVariable(name: "proceed", scope: !893, file: !720, line: 2872, type: !498)
!893 = distinct !DILexicalBlock(scope: !894, file: !720, line: 2870, column: 7)
!894 = distinct !DILexicalBlock(scope: !870, file: !720, line: 2869, column: 9)
!895 = !DILocation(line: 0, scope: !735)
!896 = !DILocation(line: 1647, column: 3, scope: !735)
!897 = !DILocation(line: 1648, column: 5, scope: !735)
!898 = !DILocation(line: 1661, column: 3, scope: !735)
!899 = !DILocation(line: 1662, column: 5, scope: !735)
!900 = !DILocation(line: 1684, column: 14, scope: !901)
!901 = distinct !DILexicalBlock(scope: !735, file: !720, line: 1684, column: 7)
!902 = !{!903, !904, i64 12976}
