; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/compress.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/compress.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HuffmanTable = type { i64, i64, i64, i64 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }

!399 = !DIEnumerator(name: "RotatePreview", value: 1)
!400 = !DIEnumerator(name: "ShearPreview", value: 2)
!401 = !DIEnumerator(name: "RollPreview", value: 3)
!402 = !DIEnumerator(name: "HuePreview", value: 4)
!403 = !DIEnumerator(name: "SaturationPreview", value: 5)
!404 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!405 = !DIEnumerator(name: "GammaPreview", value: 7)
!406 = !DIEnumerator(name: "SpiffPreview", value: 8)
!407 = !DIEnumerator(name: "DullPreview", value: 9)
!408 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!409 = !DIEnumerator(name: "QuantizePreview", value: 11)
!410 = !DIEnumerator(name: "DespecklePreview", value: 12)
!411 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!412 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!413 = !DIEnumerator(name: "SharpenPreview", value: 15)
!414 = !DIEnumerator(name: "BlurPreview", value: 16)
!415 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!416 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!417 = !DIEnumerator(name: "SpreadPreview", value: 19)
!418 = !DIEnumerator(name: "SolarizePreview", value: 20)
!419 = !DIEnumerator(name: "ShadePreview", value: 21)
!420 = !DIEnumerator(name: "RaisePreview", value: 22)
!421 = !DIEnumerator(name: "SegmentPreview", value: 23)
!422 = !DIEnumerator(name: "SwirlPreview", value: 24)
!423 = !DIEnumerator(name: "ImplodePreview", value: 25)
!424 = !DIEnumerator(name: "WavePreview", value: 26)
!425 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!426 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!427 = !DIEnumerator(name: "JPEGPreview", value: 29)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 177, baseType: !7, size: 32, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!430 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!431 = !DIEnumerator(name: "RedChannel", value: 1)
!432 = !DIEnumerator(name: "GrayChannel", value: 1)
!433 = !DIEnumerator(name: "CyanChannel", value: 1)
!434 = !DIEnumerator(name: "GreenChannel", value: 2)
!435 = !DIEnumerator(name: "MagentaChannel", value: 2)
!436 = !DIEnumerator(name: "BlueChannel", value: 4)
!437 = !DIEnumerator(name: "YellowChannel", value: 4)
!438 = !DIEnumerator(name: "AlphaChannel", value: 8)
!439 = !DIEnumerator(name: "OpacityChannel", value: 8)
!440 = !DIEnumerator(name: "MatteChannel", value: 8)
!441 = !DIEnumerator(name: "BlackChannel", value: 32)
!442 = !DIEnumerator(name: "IndexChannel", value: 32)
!443 = !DIEnumerator(name: "CompositeChannels", value: 47)
!444 = !DIEnumerator(name: "AllChannels", value: 134217727)
!445 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!446 = !DIEnumerator(name: "RGBChannels", value: 128)
!447 = !DIEnumerator(name: "GrayChannels", value: 128)
!448 = !DIEnumerator(name: "SyncChannels", value: 256)
!449 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !451, line: 27, baseType: !7, size: 32, elements: !452)
!451 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!453 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!454 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!455 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!456 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!457 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!458 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!459 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!460 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!461 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!462 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!463 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!464 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!465 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!466 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!467 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!468 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!469 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!470 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!471 = !{!472, !489, !490, !491, !492, !494, !486, !496, !505, !506, !497, !478, !713, !7, !527, !715, !716, !532, !717, !719, !482, !721, !745, !563, !626}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !50, line: 52, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !475, line: 71, size: 256, elements: !476)
!475 = !DIFile(filename: "apps/538.imagick_r/src/magick/compress.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cae6ae6356e273ce65402fb9a311ea2c")
!476 = !{!477, !483, !484}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !474, file: !475, line: 74, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !479, line: 77, baseType: !480)
!479 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !481, line: 193, baseType: !482)
!481 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!482 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "line_break", scope: !474, file: !475, line: 75, baseType: !478, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !474, file: !475, line: 78, baseType: !485, size: 80, offset: 128)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 80, elements: !487)
!486 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!487 = !{!488}
!488 = !DISubrange(count: 10)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!490 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!491 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !493, line: 46, baseType: !490)
!493 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "HuffmanTable", file: !475, line: 88, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HuffmanTable", file: !475, line: 81, size: 256, elements: !500)
!500 = !{!501, !502, !503, !504}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !499, file: !475, line: 84, baseType: !492, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !499, file: !475, line: 85, baseType: !492, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !499, file: !475, line: 86, baseType: !492, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !499, file: !475, line: 87, baseType: !492, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !75, line: 150, size: 105920, elements: !509)
!509 = !{!510, !512, !514, !516, !517, !519, !521, !522, !523, !524, !525, !526, !537, !538, !539, !540, !542, !556, !558, !559, !561, !564, !565, !566, !567, !568, !569, !577, !578, !579, !580, !581, !582, !584, !586, !588, !590, !592, !594, !596, !597, !598, !599, !600, !601, !602, !610, !625, !639, !640, !641, !642, !643, !647, !651, !652, !653, !654, !655, !672, !673, !675, !676, !684, !685, !687, !688, !689, !690, !691, !692, !694, !695, !696, !697, !698, !699, !700, !702, !703, !704, !705, !706, !710, !712}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !508, file: !75, line: 153, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !5)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !508, file: !75, line: 156, baseType: !513, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !13, line: 61, baseType: !12)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !508, file: !75, line: 159, baseType: !515, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !50, line: 49, baseType: !49)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !508, file: !75, line: 162, baseType: !492, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !508, file: !75, line: 165, baseType: !518, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !75, line: 86, baseType: !74)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !508, file: !75, line: 168, baseType: !520, size: 32, offset: 224)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !86)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !508, file: !75, line: 169, baseType: !520, size: 32, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !508, file: !75, line: 172, baseType: !492, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !508, file: !75, line: 173, baseType: !492, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !508, file: !75, line: 174, baseType: !492, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !508, file: !75, line: 175, baseType: !492, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !508, file: !75, line: 178, baseType: !527, size: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !328, line: 148, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !328, line: 131, size: 64, elements: !530)
!530 = !{!531, !534, !535, !536}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !529, file: !328, line: 143, baseType: !532, size: 16)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !533)
!533 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !529, file: !328, line: 144, baseType: !532, size: 16, offset: 16)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !529, file: !328, line: 145, baseType: !532, size: 16, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !529, file: !328, line: 146, baseType: !532, size: 16, offset: 48)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !508, file: !75, line: 179, baseType: !528, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !508, file: !75, line: 180, baseType: !528, size: 64, offset: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !508, file: !75, line: 181, baseType: !528, size: 64, offset: 768)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !508, file: !75, line: 184, baseType: !541, size: 64, offset: 832)
!541 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !508, file: !75, line: 187, baseType: !543, size: 768, offset: 896)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !75, line: 128, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !75, line: 121, size: 768, elements: !545)
!545 = !{!546, !553, !554, !555}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !544, file: !75, line: 124, baseType: !547, size: 192)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !75, line: 101, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !75, line: 95, size: 192, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !548, file: !75, line: 98, baseType: !541, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !548, file: !75, line: 99, baseType: !541, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !548, file: !75, line: 100, baseType: !541, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !544, file: !75, line: 125, baseType: !547, size: 192, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !544, file: !75, line: 126, baseType: !547, size: 192, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !544, file: !75, line: 127, baseType: !547, size: 192, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !508, file: !75, line: 190, baseType: !557, size: 32, offset: 1664)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !91, line: 49, baseType: !90)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !508, file: !75, line: 193, baseType: !489, size: 64, offset: 1728)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !508, file: !75, line: 196, baseType: !560, size: 32, offset: 1792)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !75, line: 93, baseType: !98)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !508, file: !75, line: 199, baseType: !562, size: 64, offset: 1856)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !508, file: !75, line: 200, baseType: !562, size: 64, offset: 1920)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !508, file: !75, line: 201, baseType: !562, size: 64, offset: 1984)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !508, file: !75, line: 204, baseType: !478, size: 64, offset: 2048)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !508, file: !75, line: 207, baseType: !541, size: 64, offset: 2112)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !508, file: !75, line: 208, baseType: !541, size: 64, offset: 2176)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !508, file: !75, line: 211, baseType: !570, size: 256, offset: 2240)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !155, line: 130, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !155, line: 121, size: 256, elements: !572)
!572 = !{!573, !574, !575, !576}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !571, file: !155, line: 124, baseType: !492, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !571, file: !155, line: 125, baseType: !492, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !571, file: !155, line: 128, baseType: !478, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !571, file: !155, line: 129, baseType: !478, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !508, file: !75, line: 212, baseType: !570, size: 256, offset: 2496)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !508, file: !75, line: 213, baseType: !570, size: 256, offset: 2752)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !508, file: !75, line: 216, baseType: !541, size: 64, offset: 3008)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !508, file: !75, line: 217, baseType: !541, size: 64, offset: 3072)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !508, file: !75, line: 218, baseType: !541, size: 64, offset: 3136)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !508, file: !75, line: 221, baseType: !583, size: 32, offset: 3200)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !104, line: 66, baseType: !103)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !508, file: !75, line: 224, baseType: !585, size: 32, offset: 3232)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !75, line: 73, baseType: !138)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !508, file: !75, line: 227, baseType: !587, size: 32, offset: 3264)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !149, line: 35, baseType: !148)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !508, file: !75, line: 230, baseType: !589, size: 32, offset: 3296)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !155, line: 91, baseType: !154)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !508, file: !75, line: 233, baseType: !591, size: 32, offset: 3328)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !170, line: 99, baseType: !169)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !508, file: !75, line: 236, baseType: !593, size: 32, offset: 3360)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !241, line: 32, baseType: !240)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !508, file: !75, line: 239, baseType: !595, size: 64, offset: 3392)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !508, file: !75, line: 242, baseType: !492, size: 64, offset: 3456)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !508, file: !75, line: 243, baseType: !492, size: 64, offset: 3520)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !508, file: !75, line: 246, baseType: !478, size: 64, offset: 3584)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !508, file: !75, line: 249, baseType: !492, size: 64, offset: 3648)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !508, file: !75, line: 250, baseType: !492, size: 64, offset: 3712)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !508, file: !75, line: 253, baseType: !478, size: 64, offset: 3776)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !508, file: !75, line: 256, baseType: !603, size: 192, offset: 3840)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !604, line: 68, baseType: !605)
!604 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !604, line: 62, size: 192, elements: !606)
!606 = !{!607, !608, !609}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !605, file: !604, line: 65, baseType: !541, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !605, file: !604, line: 66, baseType: !541, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !605, file: !604, line: 67, baseType: !541, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !508, file: !75, line: 259, baseType: !611, size: 512, offset: 4032)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !249, line: 51, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !249, line: 40, size: 512, elements: !613)
!613 = !{!614, !621, !622, !624}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !612, file: !249, line: 43, baseType: !615, size: 192)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !249, line: 38, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !249, line: 32, size: 192, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !616, file: !249, line: 35, baseType: !541, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !616, file: !249, line: 36, baseType: !541, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !616, file: !249, line: 37, baseType: !541, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !612, file: !249, line: 44, baseType: !615, size: 192, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !612, file: !249, line: 47, baseType: !623, size: 32, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !249, line: 30, baseType: !248)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !612, file: !249, line: 50, baseType: !492, size: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !508, file: !75, line: 262, baseType: !626, size: 64, offset: 4544)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !627, line: 26, baseType: !628)
!627 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!520, !631, !633, !636, !489}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !635)
!635 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !638)
!638 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !508, file: !75, line: 265, baseType: !489, size: 64, offset: 4608)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !508, file: !75, line: 266, baseType: !489, size: 64, offset: 4672)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !508, file: !75, line: 267, baseType: !489, size: 64, offset: 4736)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !508, file: !75, line: 270, baseType: !472, size: 64, offset: 4800)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !508, file: !75, line: 273, baseType: !644, size: 64, offset: 4864)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !646)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !508, file: !75, line: 276, baseType: !648, size: 32768, offset: 4928)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 32768, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 4096)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !508, file: !75, line: 277, baseType: !648, size: 32768, offset: 37696)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !508, file: !75, line: 278, baseType: !648, size: 32768, offset: 70464)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !508, file: !75, line: 281, baseType: !492, size: 64, offset: 103232)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !508, file: !75, line: 282, baseType: !492, size: 64, offset: 103296)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !508, file: !75, line: 285, baseType: !656, size: 448, offset: 103360)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !255, line: 102, size: 448, elements: !658)
!658 = !{!659, !661, !662, !663, !664, !665, !666, !671}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !657, file: !255, line: 105, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !255, line: 100, baseType: !254)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !657, file: !255, line: 108, baseType: !491, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !657, file: !255, line: 111, baseType: !562, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !657, file: !255, line: 112, baseType: !562, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !657, file: !255, line: 115, baseType: !489, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !657, file: !255, line: 118, baseType: !520, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !657, file: !255, line: 121, baseType: !667, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !669, line: 26, baseType: !670)
!669 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !669, line: 25, flags: DIFlagFwdDecl)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !657, file: !255, line: 124, baseType: !492, size: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !508, file: !75, line: 288, baseType: !520, size: 32, offset: 103808)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !508, file: !75, line: 291, baseType: !674, size: 64, offset: 103872)
!674 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !478)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !508, file: !75, line: 294, baseType: !667, size: 64, offset: 103936)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !508, file: !75, line: 297, baseType: !677, size: 256, offset: 104000)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !91, line: 40, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !91, line: 27, size: 256, elements: !679)
!679 = !{!680, !681, !682, !683}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !91, line: 30, baseType: !562, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !678, file: !91, line: 33, baseType: !492, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !678, file: !91, line: 36, baseType: !505, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !678, file: !91, line: 39, baseType: !492, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !508, file: !75, line: 298, baseType: !677, size: 256, offset: 104256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !508, file: !75, line: 299, baseType: !686, size: 64, offset: 104512)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !508, file: !75, line: 302, baseType: !492, size: 64, offset: 104576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !508, file: !75, line: 305, baseType: !492, size: 64, offset: 104640)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !508, file: !75, line: 308, baseType: !595, size: 64, offset: 104704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !508, file: !75, line: 309, baseType: !595, size: 64, offset: 104768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !75, line: 310, baseType: !595, size: 64, offset: 104832)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !508, file: !75, line: 313, baseType: !693, size: 32, offset: 104896)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !328, line: 47, baseType: !327)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !508, file: !75, line: 316, baseType: !520, size: 32, offset: 104928)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !508, file: !75, line: 319, baseType: !528, size: 64, offset: 104960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !508, file: !75, line: 322, baseType: !595, size: 64, offset: 105024)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !508, file: !75, line: 325, baseType: !570, size: 256, offset: 105088)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !508, file: !75, line: 328, baseType: !489, size: 64, offset: 105344)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !508, file: !75, line: 329, baseType: !489, size: 64, offset: 105408)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !508, file: !75, line: 332, baseType: !701, size: 32, offset: 105472)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !75, line: 61, baseType: !344)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !508, file: !75, line: 335, baseType: !520, size: 32, offset: 105504)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !508, file: !75, line: 338, baseType: !637, size: 64, offset: 105536)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !508, file: !75, line: 341, baseType: !520, size: 32, offset: 105600)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !508, file: !75, line: 344, baseType: !492, size: 64, offset: 105664)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !508, file: !75, line: 347, baseType: !707, size: 64, offset: 105728)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !708, line: 7, baseType: !709)
!708 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !481, line: 160, baseType: !482)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !508, file: !75, line: 350, baseType: !711, size: 32, offset: 105792)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !328, line: 79, baseType: !358)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !508, file: !75, line: 353, baseType: !492, size: 64, offset: 105856)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !328, line: 129, baseType: !532)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !6, line: 78, baseType: !720)
!720 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "TableType", scope: !723, file: !475, line: 957, baseType: !740)
!723 = distinct !DISubprogram(name: "LZWEncodeImage", scope: !475, file: !475, line: 934, type: !724, scopeLine: 936, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !728)
!724 = !DISubroutineType(types: !725)
!725 = !{!520, !506, !726, !727}
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!727 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !505)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!729 = !DILocalVariable(name: "image", arg: 1, scope: !723, file: !475, line: 934, type: !506)
!730 = !DILocalVariable(name: "length", arg: 2, scope: !723, file: !475, line: 934, type: !726)
!731 = !DILocalVariable(name: "pixels", arg: 3, scope: !723, file: !475, line: 935, type: !727)
!732 = !DILocalVariable(name: "i", scope: !723, file: !475, line: 960, type: !478)
!733 = !DILocalVariable(name: "accumulator", scope: !723, file: !475, line: 963, type: !492)
!734 = !DILocalVariable(name: "number_bits", scope: !723, file: !475, line: 964, type: !492)
!735 = !DILocalVariable(name: "code_width", scope: !723, file: !475, line: 965, type: !492)
!736 = !DILocalVariable(name: "last_code", scope: !723, file: !475, line: 966, type: !492)
!737 = !DILocalVariable(name: "next_index", scope: !723, file: !475, line: 967, type: !492)
!738 = !DILocalVariable(name: "index", scope: !723, file: !475, line: 970, type: !478)
!739 = !DILocalVariable(name: "table", scope: !723, file: !475, line: 973, type: !721)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TableType", scope: !723, file: !475, line: 951, size: 192, elements: !741)
!741 = !{!742, !743, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !740, file: !475, line: 954, baseType: !478, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !740, file: !475, line: 955, baseType: !478, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !740, file: !475, line: 956, baseType: !478, size: 64, offset: 128)
!745 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!746 = !{!747, !0, !761, !766, !771, !776}
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "tuple", scope: !749, file: !475, line: 237, type: !758, isLocal: true, isDefinition: true)
!749 = distinct !DISubprogram(name: "Ascii85Tuple", scope: !475, file: !475, line: 234, type: !750, scopeLine: 235, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !752)
!750 = !DISubroutineType(types: !751)
!751 = !{!562, !505}
!752 = !{!753, !754, !755, !756, !757}
!753 = !DILocalVariable(name: "data", arg: 1, scope: !749, file: !475, line: 234, type: !505)
!754 = !DILocalVariable(name: "i", scope: !749, file: !475, line: 240, type: !478)
!755 = !DILocalVariable(name: "x", scope: !749, file: !475, line: 241, type: !478)
!756 = !DILocalVariable(name: "code", scope: !749, file: !475, line: 244, type: !492)
!757 = !DILocalVariable(name: "quantum", scope: !749, file: !475, line: 245, type: !492)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 48, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 6)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "MWTable", scope: !2, file: !475, line: 132, type: !763, isLocal: true, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 7168, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 28)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "EXTable", scope: !2, file: !475, line: 120, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 3584, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 14)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "TBTable", scope: !2, file: !475, line: 151, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 16640, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 65)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "MBTable", scope: !2, file: !475, line: 101, type: !763, isLocal: true, isDefinition: true)
!778 = !{i32 7, !"Dwarf Version", i32 5}
!779 = !{i32 2, !"Debug Info Version", i32 3}
!780 = !{i32 1, !"wchar_size", i32 4}
!781 = !{i32 7, !"PIC Level", i32 2}
!782 = !{i32 7, !"PIE Level", i32 2}
!783 = !{i32 7, !"uwtable", i32 2}
!784 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!785 = distinct !DISubprogram(name: "Ascii85Initialize", scope: !475, file: !475, line: 268, type: !786, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !788)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !506}
!788 = !{!789, !790, !793}
!789 = !DILocalVariable(name: "image", arg: 1, scope: !785, file: !475, line: 268, type: !506)
!790 = !DILocalVariable(name: "message", scope: !791, file: !475, line: 276, type: !562)
!791 = distinct !DILexicalBlock(scope: !792, file: !475, line: 276, column: 5)
!792 = distinct !DILexicalBlock(scope: !785, file: !475, line: 275, column: 7)
!793 = !DILocalVariable(name: "exception", scope: !791, file: !475, line: 276, type: !656)
!794 = !DILocation(line: 0, scope: !785)
!795 = !DILocation(line: 273, column: 14, scope: !796)
!796 = distinct !DILexicalBlock(scope: !785, file: !475, line: 273, column: 7)
!797 = !{!798, !802, i64 600}
!798 = !{!"_Image", !799, i64 0, !799, i64 4, !799, i64 8, !801, i64 16, !799, i64 24, !799, i64 28, !799, i64 32, !801, i64 40, !801, i64 48, !801, i64 56, !801, i64 64, !802, i64 72, !803, i64 80, !803, i64 88, !803, i64 96, !805, i64 104, !806, i64 112, !799, i64 208, !802, i64 216, !799, i64 224, !802, i64 232, !802, i64 240, !802, i64 248, !801, i64 256, !805, i64 264, !805, i64 272, !808, i64 280, !808, i64 312, !808, i64 344, !805, i64 376, !805, i64 384, !805, i64 392, !799, i64 400, !799, i64 404, !799, i64 408, !799, i64 412, !799, i64 416, !799, i64 420, !802, i64 424, !801, i64 432, !801, i64 440, !801, i64 448, !801, i64 456, !801, i64 464, !801, i64 472, !809, i64 480, !810, i64 504, !802, i64 568, !802, i64 576, !802, i64 584, !802, i64 592, !802, i64 600, !802, i64 608, !799, i64 616, !799, i64 4712, !799, i64 8808, !801, i64 12904, !801, i64 12912, !812, i64 12920, !799, i64 12976, !801, i64 12984, !802, i64 12992, !814, i64 13000, !814, i64 13032, !802, i64 13064, !801, i64 13072, !801, i64 13080, !802, i64 13088, !802, i64 13096, !802, i64 13104, !799, i64 13112, !799, i64 13116, !803, i64 13120, !802, i64 13128, !808, i64 13136, !802, i64 13168, !802, i64 13176, !799, i64 13184, !799, i64 13188, !815, i64 13192, !799, i64 13200, !801, i64 13208, !801, i64 13216, !799, i64 13224, !801, i64 13232}
!799 = !{!"omnipotent char", !800, i64 0}
!800 = !{!"Simple C/C++ TBAA"}
!801 = !{!"long", !799, i64 0}
!802 = !{!"any pointer", !799, i64 0}
!803 = !{!"_PixelPacket", !804, i64 0, !804, i64 2, !804, i64 4, !804, i64 6}
!804 = !{!"short", !799, i64 0}
!805 = !{!"double", !799, i64 0}
!806 = !{!"_ChromaticityInfo", !807, i64 0, !807, i64 24, !807, i64 48, !807, i64 72}
!807 = !{!"_PrimaryInfo", !805, i64 0, !805, i64 8, !805, i64 16}
!808 = !{!"_RectangleInfo", !801, i64 0, !801, i64 8, !801, i64 16, !801, i64 24}
!809 = !{!"_ErrorInfo", !805, i64 0, !805, i64 8, !805, i64 16}
!810 = !{!"_TimerInfo", !811, i64 0, !811, i64 24, !799, i64 48, !801, i64 56}
!811 = !{!"_Timer", !805, i64 0, !805, i64 8, !805, i64 16}
!812 = !{!"_ExceptionInfo", !799, i64 0, !813, i64 4, !802, i64 8, !802, i64 16, !802, i64 24, !799, i64 32, !802, i64 40, !801, i64 48}
!813 = !{!"int", !799, i64 0}
!814 = !{!"_ProfileInfo", !802, i64 0, !801, i64 8, !802, i64 16, !801, i64 24}
!815 = !{!"long long", !799, i64 0}
!816 = !DILocation(line: 273, column: 22, scope: !796)
!817 = !DILocation(line: 273, column: 7, scope: !785)
!818 = !DILocation(line: 274, column: 36, scope: !796)
!819 = !DILocation(line: 274, column: 19, scope: !796)
!820 = !DILocation(line: 275, column: 22, scope: !792)
!821 = !DILocation(line: 275, column: 7, scope: !785)
!822 = !DILocation(line: 276, column: 5, scope: !791)
!823 = !{!813, !813, i64 0}
!824 = !DILocation(line: 0, scope: !791)
!825 = !DILocation(line: 277, column: 10, scope: !785)
!826 = !DILocation(line: 278, column: 10, scope: !785)
!827 = !DILocation(line: 278, column: 19, scope: !785)
!828 = !DILocation(line: 278, column: 29, scope: !785)
!829 = !{!830, !801, i64 8}
!830 = !{!"_Ascii85Info", !801, i64 0, !801, i64 8, !799, i64 16}
!831 = !DILocation(line: 279, column: 25, scope: !785)
!832 = !{!830, !801, i64 0}
!833 = !DILocation(line: 280, column: 1, scope: !785)
!834 = !DISubprogram(name: "AcquireMagickMemory", scope: !835, file: !835, line: 40, type: !836, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!835 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!836 = !DISubroutineType(types: !837)
!837 = !{!489, !726}
!838 = !{}
!839 = !DISubprogram(name: "GetExceptionInfo", scope: !255, file: !255, line: 166, type: !840, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!843 = !DISubprogram(name: "GetExceptionMessage", scope: !255, file: !255, line: 137, type: !844, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!844 = !DISubroutineType(types: !845)
!845 = !{!562, !846}
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!847 = !DISubprogram(name: "ThrowMagickException", scope: !255, file: !255, line: 156, type: !848, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!848 = !DISubroutineType(types: !849)
!849 = !{!520, !842, !631, !631, !726, !850, !631, !631, null}
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!851 = !DISubprogram(name: "DestroyString", scope: !852, file: !852, line: 46, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!852 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!853 = !DISubroutineType(types: !854)
!854 = !{!562, !562}
!855 = !DISubprogram(name: "CatchException", scope: !255, file: !255, line: 164, type: !840, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!856 = !DISubprogram(name: "DestroyExceptionInfo", scope: !255, file: !255, line: 148, type: !857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!857 = !DISubroutineType(types: !858)
!858 = !{!842, !842}
!859 = !DISubprogram(name: "MagickCoreTerminus", scope: !860, file: !860, line: 147, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!860 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!861 = !DISubroutineType(types: !862)
!862 = !{null}
!863 = !DISubprogram(name: "ResetMagickMemory", scope: !835, file: !835, line: 52, type: !864, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!864 = !DISubroutineType(types: !865)
!865 = !{!489, !489, !491, !726}
!866 = distinct !DISubprogram(name: "Ascii85Flush", scope: !475, file: !475, line: 282, type: !786, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !867)
!867 = !{!868, !869}
!868 = !DILocalVariable(name: "image", arg: 1, scope: !866, file: !475, line: 282, type: !506)
!869 = !DILocalVariable(name: "tuple", scope: !866, file: !475, line: 285, type: !562)
!870 = !DILocation(line: 0, scope: !866)
!871 = !DILocation(line: 289, column: 14, scope: !872)
!872 = distinct !DILexicalBlock(scope: !866, file: !475, line: 289, column: 7)
!873 = !{!798, !799, i64 12976}
!874 = !DILocation(line: 289, column: 20, scope: !872)
!875 = !DILocation(line: 289, column: 7, scope: !866)
!876 = !DILocation(line: 290, column: 68, scope: !872)
!877 = !DILocation(line: 290, column: 12, scope: !872)
!878 = !DILocation(line: 290, column: 5, scope: !872)
!879 = !DILocation(line: 292, column: 14, scope: !880)
!880 = distinct !DILexicalBlock(scope: !866, file: !475, line: 292, column: 7)
!881 = !DILocation(line: 292, column: 23, scope: !880)
!882 = !DILocation(line: 292, column: 30, scope: !880)
!883 = !DILocation(line: 292, column: 7, scope: !866)
!884 = !DILocation(line: 294, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !880, file: !475, line: 293, column: 5)
!886 = !DILocation(line: 294, column: 53, scope: !885)
!887 = !{!799, !799, i64 0}
!888 = !DILocation(line: 295, column: 14, scope: !885)
!889 = !DILocation(line: 295, column: 46, scope: !885)
!890 = !DILocation(line: 295, column: 52, scope: !885)
!891 = !DILocation(line: 295, column: 7, scope: !885)
!892 = !DILocation(line: 295, column: 55, scope: !885)
!893 = !DILocation(line: 296, column: 14, scope: !885)
!894 = !DILocation(line: 296, column: 46, scope: !885)
!895 = !DILocation(line: 296, column: 52, scope: !885)
!896 = !DILocation(line: 296, column: 7, scope: !885)
!897 = !DILocation(line: 296, column: 55, scope: !885)
!898 = !DILocation(line: 297, column: 33, scope: !885)
!899 = !DILocation(line: 297, column: 42, scope: !885)
!900 = !DILocation(line: 0, scope: !749, inlinedAt: !901)
!901 = distinct !DILocation(line: 297, column: 13, scope: !885)
!902 = !DILocation(line: 247, column: 20, scope: !749, inlinedAt: !901)
!903 = !DILocation(line: 247, column: 11, scope: !749, inlinedAt: !901)
!904 = !DILocation(line: 247, column: 45, scope: !749, inlinedAt: !901)
!905 = !DILocation(line: 247, column: 36, scope: !749, inlinedAt: !901)
!906 = !DILocation(line: 247, column: 54, scope: !749, inlinedAt: !901)
!907 = !DILocation(line: 248, column: 15, scope: !749, inlinedAt: !901)
!908 = !DILocation(line: 248, column: 6, scope: !749, inlinedAt: !901)
!909 = !DILocation(line: 248, column: 23, scope: !749, inlinedAt: !901)
!910 = !DILocation(line: 247, column: 61, scope: !749, inlinedAt: !901)
!911 = !DILocation(line: 248, column: 40, scope: !749, inlinedAt: !901)
!912 = !DILocation(line: 248, column: 31, scope: !749, inlinedAt: !901)
!913 = !DILocation(line: 248, column: 29, scope: !749, inlinedAt: !901)
!914 = !DILocation(line: 249, column: 12, scope: !915, inlinedAt: !901)
!915 = distinct !DILexicalBlock(scope: !749, file: !475, line: 249, column: 7)
!916 = !DILocation(line: 249, column: 7, scope: !749, inlinedAt: !901)
!917 = !DILocation(line: 251, column: 15, scope: !918, inlinedAt: !901)
!918 = distinct !DILexicalBlock(scope: !915, file: !475, line: 250, column: 5)
!919 = !DILocation(line: 253, column: 7, scope: !918, inlinedAt: !901)
!920 = !DILocation(line: 258, column: 22, scope: !921, inlinedAt: !901)
!921 = distinct !DILexicalBlock(scope: !922, file: !475, line: 257, column: 3)
!922 = distinct !DILexicalBlock(scope: !923, file: !475, line: 256, column: 3)
!923 = distinct !DILexicalBlock(scope: !749, file: !475, line: 256, column: 3)
!924 = !DILocation(line: 259, column: 18, scope: !921, inlinedAt: !901)
!925 = !DILocation(line: 260, column: 14, scope: !921, inlinedAt: !901)
!926 = !DILocation(line: 260, column: 5, scope: !921, inlinedAt: !901)
!927 = !DILocation(line: 260, column: 13, scope: !921, inlinedAt: !901)
!928 = !DILocation(line: 261, column: 12, scope: !921, inlinedAt: !901)
!929 = !DILocation(line: 256, column: 21, scope: !922, inlinedAt: !901)
!930 = !DILocation(line: 256, column: 15, scope: !922, inlinedAt: !901)
!931 = !DILocation(line: 256, column: 3, scope: !923, inlinedAt: !901)
!932 = distinct !{!932, !931, !933, !934, !935}
!933 = !DILocation(line: 262, column: 3, scope: !923, inlinedAt: !901)
!934 = !{!"llvm.loop.mustprogress"}
!935 = !{!"llvm.loop.unroll.disable"}
!936 = !DILocation(line: 263, column: 26, scope: !749, inlinedAt: !901)
!937 = !DILocation(line: 263, column: 12, scope: !749, inlinedAt: !901)
!938 = !DILocation(line: 263, column: 11, scope: !749, inlinedAt: !901)
!939 = !DILocation(line: 299, column: 34, scope: !885)
!940 = !DILocation(line: 265, column: 3, scope: !749, inlinedAt: !901)
!941 = !DILocation(line: 298, column: 55, scope: !885)
!942 = !DILocation(line: 298, column: 61, scope: !885)
!943 = !DILocation(line: 298, column: 14, scope: !885)
!944 = !DILocation(line: 300, column: 5, scope: !885)
!945 = !DILocation(line: 301, column: 10, scope: !866)
!946 = !DILocation(line: 302, column: 10, scope: !866)
!947 = !DILocation(line: 303, column: 10, scope: !866)
!948 = !DILocation(line: 304, column: 1, scope: !866)
!949 = !DISubprogram(name: "LogMagickEvent", scope: !371, file: !371, line: 83, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!950 = !DISubroutineType(types: !951)
!951 = !{!520, !952, !631, !631, !726, !631, null}
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !371, line: 58, baseType: !370)
!954 = !DISubprogram(name: "WriteBlob", scope: !955, file: !955, line: 98, type: !956, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!955 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a66ea2eabdd36512a199f3a0075ea4ad")
!956 = !DISubroutineType(types: !957)
!957 = !{!478, !506, !726, !494}
!958 = !DISubprogram(name: "WriteBlobByte", scope: !955, file: !955, line: 99, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!959 = !DISubroutineType(types: !960)
!960 = !{!478, !506, !495}
!961 = distinct !DISubprogram(name: "Ascii85Encode", scope: !475, file: !475, line: 306, type: !962, scopeLine: 307, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !964)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !506, !495}
!964 = !{!965, !966, !967, !968, !969}
!965 = !DILocalVariable(name: "image", arg: 1, scope: !961, file: !475, line: 306, type: !506)
!966 = !DILocalVariable(name: "code", arg: 2, scope: !961, file: !475, line: 306, type: !495)
!967 = !DILocalVariable(name: "q", scope: !961, file: !475, line: 309, type: !562)
!968 = !DILocalVariable(name: "p", scope: !961, file: !475, line: 312, type: !505)
!969 = !DILocalVariable(name: "n", scope: !961, file: !475, line: 315, type: !478)
!970 = !DILocation(line: 0, scope: !961)
!971 = !DILocation(line: 320, column: 10, scope: !961)
!972 = !DILocation(line: 320, column: 42, scope: !961)
!973 = !DILocation(line: 320, column: 3, scope: !961)
!974 = !DILocation(line: 320, column: 49, scope: !961)
!975 = !DILocation(line: 321, column: 10, scope: !961)
!976 = !DILocation(line: 321, column: 25, scope: !961)
!977 = !DILocation(line: 322, column: 30, scope: !978)
!978 = distinct !DILexicalBlock(scope: !961, file: !475, line: 322, column: 7)
!979 = !DILocation(line: 322, column: 7, scope: !961)
!980 = !DILocation(line: 324, column: 21, scope: !961)
!981 = !DILocation(line: 325, column: 3, scope: !982)
!982 = distinct !DILexicalBlock(scope: !961, file: !475, line: 325, column: 3)
!983 = !DILocation(line: 0, scope: !749, inlinedAt: !984)
!984 = distinct !DILocation(line: 327, column: 12, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !475, line: 327, column: 5)
!986 = distinct !DILexicalBlock(scope: !987, file: !475, line: 326, column: 3)
!987 = distinct !DILexicalBlock(scope: !982, file: !475, line: 325, column: 3)
!988 = !DILocation(line: 247, column: 20, scope: !749, inlinedAt: !984)
!989 = !DILocation(line: 247, column: 11, scope: !749, inlinedAt: !984)
!990 = !DILocation(line: 247, column: 45, scope: !749, inlinedAt: !984)
!991 = !DILocation(line: 247, column: 36, scope: !749, inlinedAt: !984)
!992 = !DILocation(line: 247, column: 54, scope: !749, inlinedAt: !984)
!993 = !DILocation(line: 248, column: 15, scope: !749, inlinedAt: !984)
!994 = !DILocation(line: 248, column: 6, scope: !749, inlinedAt: !984)
!995 = !DILocation(line: 248, column: 23, scope: !749, inlinedAt: !984)
!996 = !DILocation(line: 247, column: 61, scope: !749, inlinedAt: !984)
!997 = !DILocation(line: 248, column: 40, scope: !749, inlinedAt: !984)
!998 = !DILocation(line: 248, column: 31, scope: !749, inlinedAt: !984)
!999 = !DILocation(line: 248, column: 29, scope: !749, inlinedAt: !984)
!1000 = !DILocation(line: 249, column: 12, scope: !915, inlinedAt: !984)
!1001 = !DILocation(line: 249, column: 7, scope: !749, inlinedAt: !984)
!1002 = !DILocation(line: 251, column: 15, scope: !918, inlinedAt: !984)
!1003 = !DILocation(line: 327, column: 5, scope: !985)
!1004 = !DILocation(line: 258, column: 22, scope: !921, inlinedAt: !984)
!1005 = !DILocation(line: 259, column: 18, scope: !921, inlinedAt: !984)
!1006 = !DILocation(line: 260, column: 14, scope: !921, inlinedAt: !984)
!1007 = !DILocation(line: 260, column: 5, scope: !921, inlinedAt: !984)
!1008 = !DILocation(line: 260, column: 13, scope: !921, inlinedAt: !984)
!1009 = !DILocation(line: 261, column: 12, scope: !921, inlinedAt: !984)
!1010 = !DILocation(line: 256, column: 21, scope: !922, inlinedAt: !984)
!1011 = !DILocation(line: 256, column: 15, scope: !922, inlinedAt: !984)
!1012 = !DILocation(line: 256, column: 3, scope: !923, inlinedAt: !984)
!1013 = distinct !{!1013, !1012, !1014, !934, !935}
!1014 = !DILocation(line: 262, column: 3, scope: !923, inlinedAt: !984)
!1015 = !DILocation(line: 263, column: 26, scope: !749, inlinedAt: !984)
!1016 = !DILocation(line: 263, column: 12, scope: !749, inlinedAt: !984)
!1017 = !DILocation(line: 263, column: 11, scope: !749, inlinedAt: !984)
!1018 = !DILocation(line: 327, column: 29, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !985, file: !475, line: 327, column: 5)
!1020 = !DILocation(line: 327, column: 32, scope: !1019)
!1021 = !DILocation(line: 329, column: 14, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !475, line: 328, column: 5)
!1023 = !DILocation(line: 329, column: 23, scope: !1022)
!1024 = !DILocation(line: 329, column: 33, scope: !1022)
!1025 = !DILocation(line: 330, column: 39, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !475, line: 330, column: 11)
!1027 = !DILocation(line: 330, column: 44, scope: !1026)
!1028 = !DILocation(line: 332, column: 18, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1026, file: !475, line: 331, column: 9)
!1030 = !DILocation(line: 333, column: 18, scope: !1029)
!1031 = !DILocation(line: 333, column: 27, scope: !1029)
!1032 = !DILocation(line: 333, column: 37, scope: !1029)
!1033 = !DILocation(line: 335, column: 50, scope: !1022)
!1034 = !DILocation(line: 334, column: 9, scope: !1029)
!1035 = !DILocation(line: 335, column: 14, scope: !1022)
!1036 = !DILocation(line: 327, column: 42, scope: !1019)
!1037 = distinct !{!1037, !1003, !1038, !934, !935}
!1038 = !DILocation(line: 336, column: 5, scope: !985)
!1039 = !DILocation(line: 337, column: 6, scope: !986)
!1040 = !DILocation(line: 325, column: 43, scope: !987)
!1041 = !DILocation(line: 325, column: 36, scope: !987)
!1042 = distinct !{!1042, !981, !1043, !934, !935}
!1043 = !DILocation(line: 338, column: 3, scope: !982)
!1044 = !DILocation(line: 339, column: 10, scope: !961)
!1045 = !DILocation(line: 339, column: 25, scope: !961)
!1046 = !DILocation(line: 340, column: 4, scope: !961)
!1047 = !DILocation(line: 342, column: 32, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !475, line: 341, column: 3)
!1049 = distinct !DILexicalBlock(scope: !961, file: !475, line: 341, column: 3)
!1050 = !DILocation(line: 342, column: 5, scope: !1048)
!1051 = !DILocation(line: 342, column: 30, scope: !1048)
!1052 = !DILocation(line: 341, column: 3, scope: !1049)
!1053 = !DILocation(line: 342, column: 34, scope: !1048)
!1054 = !DILocation(line: 342, column: 12, scope: !1048)
!1055 = !DILocation(line: 341, column: 21, scope: !1048)
!1056 = !DILocation(line: 341, column: 15, scope: !1048)
!1057 = distinct !{!1057, !1052, !1058, !934, !935}
!1058 = !DILocation(line: 342, column: 36, scope: !1049)
!1059 = !DILocation(line: 343, column: 1, scope: !961)
!1060 = distinct !DISubprogram(name: "HuffmanDecodeImage", scope: !475, file: !475, line: 383, type: !1061, scopeLine: 384, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1063)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!520, !506}
!1063 = !{!1064, !1065, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1095}
!1064 = !DILocalVariable(name: "image", arg: 1, scope: !1060, file: !475, line: 383, type: !506)
!1065 = !DILocalVariable(name: "image_view", scope: !1060, file: !475, line: 418, type: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !451, line: 50, baseType: !1068)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !328, line: 160, flags: DIFlagFwdDecl)
!1069 = !DILocalVariable(name: "entry", scope: !1060, file: !475, line: 421, type: !713)
!1070 = !DILocalVariable(name: "exception", scope: !1060, file: !475, line: 424, type: !842)
!1071 = !DILocalVariable(name: "mb_hash", scope: !1060, file: !475, line: 427, type: !496)
!1072 = !DILocalVariable(name: "mw_hash", scope: !1060, file: !475, line: 428, type: !496)
!1073 = !DILocalVariable(name: "index", scope: !1060, file: !475, line: 431, type: !715)
!1074 = !DILocalVariable(name: "byte", scope: !1060, file: !475, line: 434, type: !491)
!1075 = !DILocalVariable(name: "proceed", scope: !1060, file: !475, line: 437, type: !520)
!1076 = !DILocalVariable(name: "indexes", scope: !1060, file: !475, line: 440, type: !716)
!1077 = !DILocalVariable(name: "i", scope: !1060, file: !475, line: 443, type: !478)
!1078 = !DILocalVariable(name: "p", scope: !1060, file: !475, line: 446, type: !505)
!1079 = !DILocalVariable(name: "bit", scope: !1060, file: !475, line: 449, type: !492)
!1080 = !DILocalVariable(name: "code", scope: !1060, file: !475, line: 450, type: !492)
!1081 = !DILocalVariable(name: "mask", scope: !1060, file: !475, line: 451, type: !492)
!1082 = !DILocalVariable(name: "length", scope: !1060, file: !475, line: 452, type: !492)
!1083 = !DILocalVariable(name: "null_lines", scope: !1060, file: !475, line: 453, type: !492)
!1084 = !DILocalVariable(name: "runlength", scope: !1060, file: !475, line: 454, type: !492)
!1085 = !DILocalVariable(name: "count", scope: !1060, file: !475, line: 457, type: !478)
!1086 = !DILocalVariable(name: "y", scope: !1060, file: !475, line: 458, type: !478)
!1087 = !DILocalVariable(name: "scanline", scope: !1060, file: !475, line: 461, type: !505)
!1088 = !DILocalVariable(name: "bail", scope: !1060, file: !475, line: 464, type: !7)
!1089 = !DILocalVariable(name: "color", scope: !1060, file: !475, line: 465, type: !7)
!1090 = !DILocalVariable(name: "q", scope: !1091, file: !475, line: 515, type: !1094)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !475, line: 513, column: 3)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !475, line: 512, column: 3)
!1093 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 512, column: 3)
!1094 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !527)
!1095 = !DILocalVariable(name: "x", scope: !1091, file: !475, line: 518, type: !478)
!1096 = !DILocation(line: 0, scope: !1060)
!1097 = !DILocation(line: 472, column: 14, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 472, column: 7)
!1099 = !DILocation(line: 472, column: 20, scope: !1098)
!1100 = !DILocation(line: 472, column: 7, scope: !1060)
!1101 = !DILocation(line: 473, column: 68, scope: !1098)
!1102 = !DILocation(line: 473, column: 12, scope: !1098)
!1103 = !DILocation(line: 473, column: 5, scope: !1098)
!1104 = !DILocation(line: 474, column: 29, scope: !1060)
!1105 = !DILocation(line: 475, column: 29, scope: !1060)
!1106 = !DILocation(line: 476, column: 67, scope: !1060)
!1107 = !{!798, !801, i64 40}
!1108 = !DILocation(line: 476, column: 30, scope: !1060)
!1109 = !DILocation(line: 478, column: 16, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 478, column: 7)
!1111 = !DILocation(line: 478, column: 43, scope: !1110)
!1112 = !DILocation(line: 481, column: 5, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !475, line: 481, column: 5)
!1114 = distinct !DILexicalBlock(scope: !1110, file: !475, line: 481, column: 5)
!1115 = !DILocation(line: 488, column: 5, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !475, line: 487, column: 3)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !475, line: 486, column: 3)
!1118 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 486, column: 3)
!1119 = !DILocation(line: 488, column: 15, scope: !1116)
!1120 = !{!802, !802, i64 0}
!1121 = !DILocation(line: 489, column: 5, scope: !1116)
!1122 = !DILocation(line: 489, column: 15, scope: !1116)
!1123 = !DILocation(line: 486, column: 28, scope: !1117)
!1124 = !DILocation(line: 486, column: 15, scope: !1117)
!1125 = !DILocation(line: 486, column: 3, scope: !1118)
!1126 = distinct !{!1126, !1125, !1127, !934, !935}
!1127 = !DILocation(line: 490, column: 3, scope: !1118)
!1128 = !DILocation(line: 491, column: 3, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !475, line: 491, column: 3)
!1130 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 491, column: 3)
!1131 = !{!1132, !801, i64 16}
!1132 = !{!"HuffmanTable", !801, i64 0, !801, i64 8, !801, i64 16, !801, i64 24}
!1133 = !DILocation(line: 491, column: 3, scope: !1130)
!1134 = !{!1132, !801, i64 8}
!1135 = distinct !{!1135, !1133, !1133, !934, !935}
!1136 = !DILocation(line: 492, column: 3, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !475, line: 492, column: 3)
!1138 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 492, column: 3)
!1139 = !DILocation(line: 492, column: 3, scope: !1138)
!1140 = distinct !{!1140, !1139, !1139, !934, !935}
!1141 = !DILocation(line: 493, column: 3, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !475, line: 493, column: 3)
!1143 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 493, column: 3)
!1144 = !DILocation(line: 493, column: 3, scope: !1143)
!1145 = distinct !{!1145, !1144, !1144, !934, !935}
!1146 = !DILocation(line: 494, column: 3, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1148, file: !475, line: 494, column: 3)
!1148 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 494, column: 3)
!1149 = !DILocation(line: 494, column: 3, scope: !1148)
!1150 = distinct !{!1150, !1149, !1149, !934, !935}
!1151 = !DILocation(line: 495, column: 3, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !475, line: 495, column: 3)
!1153 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 495, column: 3)
!1154 = !DILocation(line: 495, column: 3, scope: !1153)
!1155 = distinct !{!1155, !1154, !1154, !934, !935}
!1156 = !DILocation(line: 496, column: 3, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !475, line: 496, column: 3)
!1158 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 496, column: 3)
!1159 = !DILocation(line: 496, column: 3, scope: !1158)
!1160 = distinct !{!1160, !1159, !1159, !934, !935}
!1161 = !DILocation(line: 505, column: 4, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !475, line: 505, column: 4)
!1163 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 505, column: 4)
!1164 = !DILocation(line: 505, column: 4, scope: !1163)
!1165 = !DILocation(line: 505, column: 4, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1162, file: !475, line: 505, column: 4)
!1167 = !DILocation(line: 505, column: 4, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1166, file: !475, line: 505, column: 4)
!1169 = !DILocation(line: 504, column: 20, scope: !1060)
!1170 = !DILocation(line: 504, column: 3, scope: !1060)
!1171 = !DILocation(line: 506, column: 3, scope: !1060)
!1172 = !DILocation(line: 506, column: 8, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !475, line: 506, column: 8)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !475, line: 506, column: 8)
!1175 = distinct !DILexicalBlock(scope: !1060, file: !475, line: 506, column: 6)
!1176 = !DILocation(line: 506, column: 8, scope: !1174)
!1177 = !DILocation(line: 506, column: 8, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1173, file: !475, line: 506, column: 8)
!1179 = !DILocation(line: 506, column: 8, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1178, file: !475, line: 506, column: 8)
!1181 = !DILocation(line: 506, column: 23, scope: !1175)
!1182 = distinct !{!1182, !1171, !1183, !934, !935}
!1183 = !DILocation(line: 506, column: 46, scope: !1060)
!1184 = !DILocation(line: 507, column: 10, scope: !1060)
!1185 = !DILocation(line: 507, column: 22, scope: !1060)
!1186 = !{!798, !805, i64 264}
!1187 = !DILocation(line: 508, column: 10, scope: !1060)
!1188 = !DILocation(line: 508, column: 22, scope: !1060)
!1189 = !{!798, !805, i64 272}
!1190 = !DILocation(line: 509, column: 10, scope: !1060)
!1191 = !DILocation(line: 509, column: 15, scope: !1060)
!1192 = !{!798, !799, i64 224}
!1193 = !DILocation(line: 510, column: 22, scope: !1060)
!1194 = !DILocation(line: 511, column: 14, scope: !1060)
!1195 = !DILocation(line: 35, column: 70, scope: !1196, inlinedAt: !1208)
!1196 = distinct !DISubprogram(name: "SetImageProgress", scope: !1197, file: !1197, line: 27, type: !1198, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1202)
!1197 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a84e9021f92665a913f9cbc20a804774")
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!520, !1200, !631, !633, !636}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!1202 = !{!1203, !1204, !1205, !1206, !1207}
!1203 = !DILocalVariable(name: "image", arg: 1, scope: !1196, file: !1197, line: 27, type: !1200)
!1204 = !DILocalVariable(name: "tag", arg: 2, scope: !1196, file: !1197, line: 28, type: !631)
!1205 = !DILocalVariable(name: "offset", arg: 3, scope: !1196, file: !1197, line: 28, type: !633)
!1206 = !DILocalVariable(name: "extent", arg: 4, scope: !1196, file: !1197, line: 28, type: !636)
!1207 = !DILocalVariable(name: "message", scope: !1196, file: !1197, line: 31, type: !648)
!1208 = distinct !DILocation(line: 643, column: 13, scope: !1091)
!1209 = !DILocation(line: 512, column: 36, scope: !1092)
!1210 = !{!798, !801, i64 48}
!1211 = !DILocation(line: 512, column: 17, scope: !1092)
!1212 = !DILocation(line: 512, column: 42, scope: !1092)
!1213 = !DILocation(line: 0, scope: !1091)
!1214 = !DILocation(line: 524, column: 36, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1216, file: !475, line: 524, column: 5)
!1216 = distinct !DILexicalBlock(scope: !1091, file: !475, line: 524, column: 5)
!1217 = !DILocation(line: 524, column: 17, scope: !1215)
!1218 = !DILocation(line: 524, column: 5, scope: !1216)
!1219 = !DILocation(line: 537, column: 16, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !475, line: 537, column: 11)
!1221 = distinct !DILexicalBlock(scope: !1222, file: !475, line: 536, column: 5)
!1222 = distinct !DILexicalBlock(scope: !1223, file: !475, line: 535, column: 5)
!1223 = distinct !DILexicalBlock(scope: !1091, file: !475, line: 535, column: 5)
!1224 = !DILocation(line: 537, column: 11, scope: !1221)
!1225 = !DILocation(line: 525, column: 9, scope: !1215)
!1226 = !DILocation(line: 525, column: 11, scope: !1215)
!1227 = !DILocation(line: 524, column: 46, scope: !1215)
!1228 = distinct !{!1228, !1218, !1229, !934, !935}
!1229 = !DILocation(line: 525, column: 28, scope: !1216)
!1230 = !DILocation(line: 539, column: 33, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1221, file: !475, line: 539, column: 11)
!1232 = !DILocation(line: 539, column: 13, scope: !1231)
!1233 = !DILocation(line: 539, column: 11, scope: !1221)
!1234 = !DILocation(line: 541, column: 28, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1231, file: !475, line: 540, column: 9)
!1236 = !DILocation(line: 541, column: 11, scope: !1235)
!1237 = !DILocation(line: 542, column: 13, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1239, file: !475, line: 542, column: 13)
!1239 = distinct !DILexicalBlock(scope: !1235, file: !475, line: 542, column: 13)
!1240 = !DILocation(line: 542, column: 13, scope: !1239)
!1241 = !DILocation(line: 542, column: 13, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1238, file: !475, line: 542, column: 13)
!1243 = !DILocation(line: 542, column: 13, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1242, file: !475, line: 542, column: 13)
!1245 = !DILocation(line: 0, scope: !1235)
!1246 = !DILocation(line: 543, column: 11, scope: !1235)
!1247 = !DILocation(line: 543, column: 16, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !475, line: 543, column: 16)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !475, line: 543, column: 16)
!1250 = distinct !DILexicalBlock(scope: !1235, file: !475, line: 543, column: 14)
!1251 = !DILocation(line: 543, column: 16, scope: !1249)
!1252 = !DILocation(line: 543, column: 16, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1248, file: !475, line: 543, column: 16)
!1254 = !DILocation(line: 543, column: 16, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1253, file: !475, line: 543, column: 16)
!1256 = !DILocation(line: 543, column: 31, scope: !1250)
!1257 = distinct !{!1257, !1246, !1258, !934, !935}
!1258 = !DILocation(line: 543, column: 54, scope: !1235)
!1259 = !DILocation(line: 549, column: 23, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1261, file: !475, line: 549, column: 13)
!1261 = distinct !DILexicalBlock(scope: !1221, file: !475, line: 548, column: 7)
!1262 = !DILocation(line: 0, scope: !1260)
!1263 = !DILocation(line: 549, column: 13, scope: !1261)
!1264 = !DILocation(line: 550, column: 11, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1260, file: !475, line: 550, column: 11)
!1266 = !DILocation(line: 550, column: 11, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1268, file: !475, line: 550, column: 11)
!1268 = distinct !DILexicalBlock(scope: !1265, file: !475, line: 550, column: 11)
!1269 = !DILocation(line: 550, column: 11, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1267, file: !475, line: 550, column: 11)
!1271 = !DILocation(line: 553, column: 13, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1273, file: !475, line: 553, column: 13)
!1273 = distinct !DILexicalBlock(scope: !1260, file: !475, line: 552, column: 11)
!1274 = !DILocation(line: 553, column: 13, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !475, line: 553, column: 13)
!1276 = distinct !DILexicalBlock(scope: !1272, file: !475, line: 553, column: 13)
!1277 = !DILocation(line: 553, column: 13, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1275, file: !475, line: 553, column: 13)
!1279 = !DILocation(line: 554, column: 17, scope: !1273)
!1280 = !DILocation(line: 563, column: 20, scope: !1261)
!1281 = !DILocation(line: 563, column: 25, scope: !1261)
!1282 = !DILocation(line: 564, column: 15, scope: !1261)
!1283 = !DILocation(line: 565, column: 21, scope: !1221)
!1284 = !DILocation(line: 565, column: 7, scope: !1261)
!1285 = distinct !{!1285, !1286, !1287, !934, !935}
!1286 = !DILocation(line: 547, column: 7, scope: !1221)
!1287 = !DILocation(line: 565, column: 25, scope: !1221)
!1288 = !DILocation(line: 556, column: 27, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1290, file: !475, line: 555, column: 15)
!1290 = distinct !DILexicalBlock(scope: !1273, file: !475, line: 554, column: 17)
!1291 = !DILocation(line: 557, column: 23, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1289, file: !475, line: 557, column: 21)
!1293 = !DILocation(line: 557, column: 21, scope: !1289)
!1294 = !DILocation(line: 566, column: 11, scope: !1221)
!1295 = !DILocation(line: 568, column: 18, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1221, file: !475, line: 568, column: 11)
!1297 = !DILocation(line: 568, column: 11, scope: !1221)
!1298 = !DILocation(line: 570, column: 28, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1296, file: !475, line: 569, column: 9)
!1300 = !DILocation(line: 570, column: 11, scope: !1299)
!1301 = !DILocation(line: 571, column: 12, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1303, file: !475, line: 571, column: 12)
!1303 = distinct !DILexicalBlock(scope: !1299, file: !475, line: 571, column: 12)
!1304 = !DILocation(line: 571, column: 12, scope: !1303)
!1305 = !DILocation(line: 571, column: 12, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1302, file: !475, line: 571, column: 12)
!1307 = !DILocation(line: 571, column: 12, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1306, file: !475, line: 571, column: 12)
!1309 = !DILocation(line: 0, scope: !1221)
!1310 = !DILocation(line: 0, scope: !1299)
!1311 = !DILocation(line: 572, column: 11, scope: !1299)
!1312 = !DILocation(line: 572, column: 16, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1314, file: !475, line: 572, column: 16)
!1314 = distinct !DILexicalBlock(scope: !1315, file: !475, line: 572, column: 16)
!1315 = distinct !DILexicalBlock(scope: !1299, file: !475, line: 572, column: 14)
!1316 = !DILocation(line: 572, column: 16, scope: !1314)
!1317 = !DILocation(line: 572, column: 16, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1313, file: !475, line: 572, column: 16)
!1319 = !DILocation(line: 572, column: 16, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1318, file: !475, line: 572, column: 16)
!1321 = !DILocation(line: 572, column: 31, scope: !1315)
!1322 = distinct !{!1322, !1311, !1323, !934, !935}
!1323 = !DILocation(line: 572, column: 54, scope: !1299)
!1324 = !DILocation(line: 575, column: 11, scope: !1221)
!1325 = !DILocation(line: 577, column: 22, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1327, file: !475, line: 577, column: 15)
!1327 = distinct !DILexicalBlock(scope: !1328, file: !475, line: 576, column: 9)
!1328 = distinct !DILexicalBlock(scope: !1221, file: !475, line: 575, column: 11)
!1329 = !DILocation(line: 577, column: 15, scope: !1327)
!1330 = distinct !{!1330, !1331, !1332, !935}
!1331 = !DILocation(line: 535, column: 5, scope: !1223)
!1332 = !DILocation(line: 626, column: 5, scope: !1223)
!1333 = !DILocation(line: 583, column: 22, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1335, file: !475, line: 583, column: 15)
!1335 = distinct !DILexicalBlock(scope: !1328, file: !475, line: 582, column: 9)
!1336 = !DILocation(line: 583, column: 15, scope: !1335)
!1337 = !DILocation(line: 0, scope: !1328)
!1338 = !DILocation(line: 587, column: 17, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !1221, file: !475, line: 587, column: 11)
!1340 = !DILocation(line: 587, column: 11, scope: !1221)
!1341 = !DILocation(line: 589, column: 19, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1221, file: !475, line: 589, column: 11)
!1343 = !DILocation(line: 589, column: 26, scope: !1342)
!1344 = !DILocation(line: 589, column: 37, scope: !1342)
!1345 = !DILocation(line: 589, column: 48, scope: !1342)
!1346 = !DILocation(line: 589, column: 53, scope: !1342)
!1347 = !DILocation(line: 589, column: 11, scope: !1221)
!1348 = !DILocation(line: 591, column: 22, scope: !1221)
!1349 = !{!1132, !801, i64 0}
!1350 = !DILocation(line: 591, column: 7, scope: !1221)
!1351 = !DILocation(line: 596, column: 35, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !1353, file: !475, line: 595, column: 9)
!1353 = distinct !DILexicalBlock(scope: !1221, file: !475, line: 592, column: 7)
!1354 = !{!1132, !801, i64 24}
!1355 = !DILocation(line: 596, column: 16, scope: !1352)
!1356 = !DILocation(line: 597, column: 17, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1352, file: !475, line: 597, column: 15)
!1358 = !DILocation(line: 597, column: 44, scope: !1357)
!1359 = !DILocation(line: 597, column: 25, scope: !1357)
!1360 = !DILocation(line: 597, column: 15, scope: !1352)
!1361 = !DILocation(line: 599, column: 21, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1352, file: !475, line: 599, column: 15)
!1363 = !DILocation(line: 599, column: 15, scope: !1352)
!1364 = !DILocation(line: 601, column: 19, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !1362, file: !475, line: 600, column: 13)
!1366 = !DILocation(line: 607, column: 17, scope: !1367)
!1367 = distinct !DILexicalBlock(scope: !1368, file: !475, line: 607, column: 17)
!1368 = distinct !DILexicalBlock(scope: !1365, file: !475, line: 601, column: 19)
!1369 = !DILocation(line: 608, column: 32, scope: !1370)
!1370 = distinct !DILexicalBlock(scope: !1367, file: !475, line: 607, column: 17)
!1371 = !DILocation(line: 611, column: 14, scope: !1352)
!1372 = !DILocation(line: 603, column: 20, scope: !1373)
!1373 = distinct !DILexicalBlock(scope: !1368, file: !475, line: 602, column: 17)
!1374 = !DILocation(line: 605, column: 17, scope: !1373)
!1375 = !DILocation(line: 0, scope: !1352)
!1376 = !DILocation(line: 612, column: 11, scope: !1352)
!1377 = !DILocation(line: 618, column: 35, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1353, file: !475, line: 617, column: 9)
!1379 = !DILocation(line: 618, column: 16, scope: !1378)
!1380 = !DILocation(line: 619, column: 11, scope: !1378)
!1381 = !DILocation(line: 502, column: 13, scope: !1060)
!1382 = !DILocation(line: 631, column: 59, scope: !1091)
!1383 = !DILocation(line: 631, column: 7, scope: !1091)
!1384 = !DILocation(line: 632, column: 11, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1091, file: !475, line: 632, column: 9)
!1386 = !DILocation(line: 632, column: 9, scope: !1091)
!1387 = !DILocation(line: 634, column: 13, scope: !1091)
!1388 = !DILocation(line: 635, column: 17, scope: !1389)
!1389 = distinct !DILexicalBlock(scope: !1390, file: !475, line: 635, column: 5)
!1390 = distinct !DILexicalBlock(scope: !1091, file: !475, line: 635, column: 5)
!1391 = !DILocation(line: 635, column: 5, scope: !1390)
!1392 = !{!798, !802, i64 72}
!1393 = !DILocation(line: 637, column: 30, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1389, file: !475, line: 636, column: 5)
!1395 = !DILocation(line: 637, column: 28, scope: !1394)
!1396 = !DILocation(line: 638, column: 7, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !1394, file: !475, line: 638, column: 7)
!1398 = !DILocation(line: 637, column: 13, scope: !1394)
!1399 = !DILocation(line: 638, column: 7, scope: !1400)
!1400 = distinct !DILexicalBlock(scope: !1397, file: !475, line: 638, column: 7)
!1401 = !{!804, !804, i64 0}
!1402 = !DILocation(line: 639, column: 7, scope: !1403)
!1403 = distinct !DILexicalBlock(scope: !1394, file: !475, line: 639, column: 7)
!1404 = !{!803, !804, i64 4}
!1405 = !{!803, !804, i64 2}
!1406 = !{!803, !804, i64 0}
!1407 = !{!803, !804, i64 6}
!1408 = !DILocation(line: 635, column: 46, scope: !1389)
!1409 = distinct !{!1409, !1391, !1410, !934, !935}
!1410 = !DILocation(line: 640, column: 5, scope: !1390)
!1411 = !DILocation(line: 641, column: 9, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1091, file: !475, line: 641, column: 9)
!1413 = !DILocation(line: 641, column: 60, scope: !1412)
!1414 = !DILocation(line: 641, column: 9, scope: !1091)
!1415 = !DILocation(line: 643, column: 58, scope: !1091)
!1416 = !DILocation(line: 0, scope: !1196, inlinedAt: !1208)
!1417 = !DILocation(line: 30, column: 3, scope: !1196, inlinedAt: !1208)
!1418 = !DILocation(line: 31, column: 5, scope: !1196, inlinedAt: !1208)
!1419 = !DILocation(line: 33, column: 14, scope: !1420, inlinedAt: !1208)
!1420 = distinct !DILexicalBlock(scope: !1196, file: !1197, line: 33, column: 7)
!1421 = !{!798, !802, i64 568}
!1422 = !DILocation(line: 33, column: 31, scope: !1420, inlinedAt: !1208)
!1423 = !DILocation(line: 33, column: 7, scope: !1196, inlinedAt: !1208)
!1424 = !DILocation(line: 37, column: 1, scope: !1196, inlinedAt: !1208)
!1425 = !DILocation(line: 644, column: 9, scope: !1091)
!1426 = !DILocation(line: 35, column: 10, scope: !1196, inlinedAt: !1208)
!1427 = !DILocation(line: 36, column: 17, scope: !1196, inlinedAt: !1208)
!1428 = !DILocation(line: 36, column: 63, scope: !1196, inlinedAt: !1208)
!1429 = !{!798, !802, i64 576}
!1430 = !DILocation(line: 36, column: 10, scope: !1196, inlinedAt: !1208)
!1431 = !DILocation(line: 644, column: 17, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1091, file: !475, line: 644, column: 9)
!1433 = !DILocation(line: 0, scope: !1093)
!1434 = !DILocation(line: 512, column: 9, scope: !1093)
!1435 = !DILocation(line: 648, column: 14, scope: !1060)
!1436 = !DILocation(line: 649, column: 44, scope: !1060)
!1437 = !DILocalVariable(name: "x", arg: 1, scope: !1438, file: !475, line: 369, type: !726)
!1438 = distinct !DISubprogram(name: "MagickMax", scope: !475, file: !475, line: 369, type: !1439, scopeLine: 370, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1441)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!492, !726, !726}
!1441 = !{!1437, !1442}
!1442 = !DILocalVariable(name: "y", arg: 2, scope: !1438, file: !475, line: 369, type: !726)
!1443 = !DILocation(line: 0, scope: !1438, inlinedAt: !1444)
!1444 = distinct !DILocation(line: 649, column: 24, scope: !1060)
!1445 = !DILocation(line: 649, column: 14, scope: !1060)
!1446 = !DILocation(line: 650, column: 10, scope: !1060)
!1447 = !DILocation(line: 650, column: 21, scope: !1060)
!1448 = !{!798, !799, i64 8}
!1449 = !DILocation(line: 654, column: 29, scope: !1060)
!1450 = !DILocation(line: 655, column: 29, scope: !1060)
!1451 = !DILocation(line: 656, column: 30, scope: !1060)
!1452 = !DILocation(line: 657, column: 3, scope: !1060)
!1453 = !DILocation(line: 658, column: 1, scope: !1060)
!1454 = !DISubprogram(name: "AcquireQuantumMemory", scope: !835, file: !835, line: 42, type: !1455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!489, !726, !726}
!1457 = !DISubprogram(name: "ReadBlobByte", scope: !955, file: !955, line: 79, type: !1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!491, !506}
!1460 = !DISubprogram(name: "AcquireAuthenticCacheView", scope: !451, file: !451, line: 53, type: !1461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!1066, !1200, !842}
!1463 = !DISubprogram(name: "QueueCacheViewAuthenticPixels", scope: !451, file: !451, line: 101, type: !1464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{!527, !1066, !1466, !1466, !726, !726, !842}
!1466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!1467 = !DISubprogram(name: "GetCacheViewAuthenticIndexQueue", scope: !451, file: !451, line: 77, type: !1468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!716, !1066}
!1470 = !DISubprogram(name: "SyncCacheViewAuthenticPixels", scope: !451, file: !451, line: 89, type: !1471, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!520, !1066, !842}
!1473 = !DISubprogram(name: "DestroyCacheView", scope: !451, file: !451, line: 57, type: !1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!1066, !1066}
!1476 = !DISubprogram(name: "RelinquishMagickMemory", scope: !835, file: !835, line: 51, type: !1477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!489, !489}
!1479 = distinct !DISubprogram(name: "HuffmanEncodeImage", scope: !475, file: !475, line: 688, type: !1480, scopeLine: 690, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1612)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!520, !1482, !506, !506}
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64)
!1483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1484)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !6, line: 223, baseType: !1485)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !75, line: 356, size: 134336, elements: !1486)
!1486 = !{!1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1521, !1522, !1523, !1524, !1525, !1526, !1528, !1529, !1530, !1531, !1532, !1533, !1541, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1609, !1610, !1611}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1485, file: !75, line: 359, baseType: !515, size: 32)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !1485, file: !75, line: 362, baseType: !518, size: 32, offset: 32)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !1485, file: !75, line: 365, baseType: !520, size: 32, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !1485, file: !75, line: 366, baseType: !520, size: 32, offset: 96)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !1485, file: !75, line: 367, baseType: !520, size: 32, offset: 128)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !1485, file: !75, line: 368, baseType: !520, size: 32, offset: 160)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1485, file: !75, line: 371, baseType: !562, size: 64, offset: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !1485, file: !75, line: 372, baseType: !562, size: 64, offset: 256)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !1485, file: !75, line: 373, baseType: !562, size: 64, offset: 320)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !1485, file: !75, line: 374, baseType: !562, size: 64, offset: 384)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1485, file: !75, line: 377, baseType: !492, size: 64, offset: 448)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !1485, file: !75, line: 378, baseType: !492, size: 64, offset: 512)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1485, file: !75, line: 379, baseType: !492, size: 64, offset: 576)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !1485, file: !75, line: 382, baseType: !585, size: 32, offset: 640)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !1485, file: !75, line: 385, baseType: !587, size: 32, offset: 672)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1485, file: !75, line: 388, baseType: !560, size: 32, offset: 704)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1485, file: !75, line: 391, baseType: !492, size: 64, offset: 768)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !1485, file: !75, line: 394, baseType: !562, size: 64, offset: 832)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !1485, file: !75, line: 395, baseType: !562, size: 64, offset: 896)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1485, file: !75, line: 396, baseType: !562, size: 64, offset: 960)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !1485, file: !75, line: 397, baseType: !562, size: 64, offset: 1024)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1485, file: !75, line: 398, baseType: !562, size: 64, offset: 1088)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !1485, file: !75, line: 401, baseType: !541, size: 64, offset: 1152)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1485, file: !75, line: 402, baseType: !541, size: 64, offset: 1216)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !1485, file: !75, line: 405, baseType: !528, size: 64, offset: 1280)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1485, file: !75, line: 406, baseType: !528, size: 64, offset: 1344)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !1485, file: !75, line: 407, baseType: !528, size: 64, offset: 1408)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1485, file: !75, line: 410, baseType: !520, size: 32, offset: 1472)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !1485, file: !75, line: 411, baseType: !520, size: 32, offset: 1504)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1485, file: !75, line: 414, baseType: !492, size: 64, offset: 1536)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1485, file: !75, line: 417, baseType: !513, size: 32, offset: 1600)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1485, file: !75, line: 420, baseType: !701, size: 32, offset: 1632)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !1485, file: !75, line: 423, baseType: !1520, size: 32, offset: 1664)
!1520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !396, line: 59, baseType: !395)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1485, file: !75, line: 426, baseType: !478, size: 64, offset: 1728)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !1485, file: !75, line: 429, baseType: !520, size: 32, offset: 1792)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !1485, file: !75, line: 430, baseType: !520, size: 32, offset: 1824)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1485, file: !75, line: 433, baseType: !562, size: 64, offset: 1856)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !1485, file: !75, line: 434, baseType: !562, size: 64, offset: 1920)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !1485, file: !75, line: 437, baseType: !1527, size: 32, offset: 1984)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !428)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1485, file: !75, line: 440, baseType: !506, size: 64, offset: 2048)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1485, file: !75, line: 443, baseType: !489, size: 64, offset: 2112)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !1485, file: !75, line: 446, baseType: !626, size: 64, offset: 2176)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1485, file: !75, line: 449, baseType: !489, size: 64, offset: 2240)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1485, file: !75, line: 450, baseType: !489, size: 64, offset: 2304)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1485, file: !75, line: 453, baseType: !1534, size: 64, offset: 2368)
!1534 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1535, line: 26, baseType: !1536)
!1535 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!492, !1200, !1539, !726}
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1485, file: !75, line: 456, baseType: !1542, size: 64, offset: 2432)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1544, line: 7, baseType: !1545)
!1544 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1546, line: 49, size: 1728, elements: !1547)
!1546 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1547 = !{!1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1563, !1565, !1566, !1567, !1569, !1570, !1572, !1576, !1579, !1581, !1584, !1587, !1588, !1589, !1590, !1591}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1545, file: !1546, line: 51, baseType: !491, size: 32)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1545, file: !1546, line: 54, baseType: !562, size: 64, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1545, file: !1546, line: 55, baseType: !562, size: 64, offset: 128)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1545, file: !1546, line: 56, baseType: !562, size: 64, offset: 192)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1545, file: !1546, line: 57, baseType: !562, size: 64, offset: 256)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1545, file: !1546, line: 58, baseType: !562, size: 64, offset: 320)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1545, file: !1546, line: 59, baseType: !562, size: 64, offset: 384)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1545, file: !1546, line: 60, baseType: !562, size: 64, offset: 448)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1545, file: !1546, line: 61, baseType: !562, size: 64, offset: 512)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1545, file: !1546, line: 64, baseType: !562, size: 64, offset: 576)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1545, file: !1546, line: 65, baseType: !562, size: 64, offset: 640)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1545, file: !1546, line: 66, baseType: !562, size: 64, offset: 704)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1545, file: !1546, line: 68, baseType: !1561, size: 64, offset: 768)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64)
!1562 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1546, line: 36, flags: DIFlagFwdDecl)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1545, file: !1546, line: 70, baseType: !1564, size: 64, offset: 832)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1545, file: !1546, line: 72, baseType: !491, size: 32, offset: 896)
