; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/configure.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/configure.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ConfigureMapInfo = type { ptr, ptr }
%struct._ConfigureInfo = type { ptr, ptr, ptr, i32, i32, ptr, ptr, i64 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }

@configure_semaphore = internal global ptr null, align 8, !dbg !0
@configure_cache = internal unnamed_addr global ptr null, align 8, !dbg !236
@.str = private unnamed_addr constant [2 x i8] c"*\00", align 1
@.str.1 = private unnamed_addr constant [88 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/configure.c\00", align 1
@.str.2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"%s%s\00", align 1
@.str.5 = private unnamed_addr constant [35 x i8] c"Searching for configure file: \22%s\22\00", align 1
@.str.6 = private unnamed_addr constant [26 x i8] c"UnableToOpenConfigureFile\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1
@.str.8 = private unnamed_addr constant [22 x i8] c"MAGICK_CONFIGURE_PATH\00", align 1

!59 = !DIEnumerator(name: "ConfigureError", value: 495)
!60 = !DIEnumerator(name: "PolicyError", value: 499)
!61 = !DIEnumerator(name: "FatalErrorException", value: 700)
!62 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!63 = !DIEnumerator(name: "TypeFatalError", value: 705)
!64 = !DIEnumerator(name: "OptionFatalError", value: 710)
!65 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!66 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!67 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!68 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!69 = !DIEnumerator(name: "BlobFatalError", value: 735)
!70 = !DIEnumerator(name: "StreamFatalError", value: 740)
!71 = !DIEnumerator(name: "CacheFatalError", value: 745)
!72 = !DIEnumerator(name: "CoderFatalError", value: 750)
!73 = !DIEnumerator(name: "FilterFatalError", value: 752)
!74 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!75 = !DIEnumerator(name: "DrawFatalError", value: 760)
!76 = !DIEnumerator(name: "ImageFatalError", value: 765)
!77 = !DIEnumerator(name: "WandFatalError", value: 770)
!78 = !DIEnumerator(name: "RandomFatalError", value: 775)
!79 = !DIEnumerator(name: "XServerFatalError", value: 780)
!80 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!81 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!82 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!83 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 34, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!87 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!88 = !DIEnumerator(name: "NoEvents", value: 0)
!89 = !DIEnumerator(name: "TraceEvent", value: 1)
!90 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!91 = !DIEnumerator(name: "BlobEvent", value: 4)
!92 = !DIEnumerator(name: "CacheEvent", value: 8)
!93 = !DIEnumerator(name: "CoderEvent", value: 16)
!94 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!95 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!96 = !DIEnumerator(name: "DrawEvent", value: 128)
!97 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!98 = !DIEnumerator(name: "ImageEvent", value: 512)
!99 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!100 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!101 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!102 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!103 = !DIEnumerator(name: "TransformEvent", value: 16384)
!104 = !DIEnumerator(name: "UserEvent", value: 36864)
!105 = !DIEnumerator(name: "WandEvent", value: 65536)
!106 = !DIEnumerator(name: "X11Event", value: 131072)
!107 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!108 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 25, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120}
!112 = !DIEnumerator(name: "UndefinedPath", value: 0)
!113 = !DIEnumerator(name: "MagickPath", value: 1)
!114 = !DIEnumerator(name: "RootPath", value: 2)
!115 = !DIEnumerator(name: "HeadPath", value: 3)
!116 = !DIEnumerator(name: "TailPath", value: 4)
!117 = !DIEnumerator(name: "BasePath", value: 5)
!118 = !DIEnumerator(name: "ExtensionPath", value: 6)
!119 = !DIEnumerator(name: "SubimagePath", value: 7)
!120 = !DIEnumerator(name: "CanonicalPath", value: 8)
!121 = !{!122, !126, !127, !131, !152, !154, !151, !155, !149, !156, !138, !157, !171, !229, !179, !232, !234}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !124, line: 26, baseType: !125)
!124 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !124, line: 25, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !129, line: 34, baseType: !130)
!129 = !DIFile(filename: "apps/538.imagick_r/src/magick/hashmap.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "683c2bd26601474466c188c023adadf2")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !129, line: 33, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConfigureInfo", file: !134, line: 44, baseType: !135)
!134 = !DIFile(filename: "apps/538.imagick_r/src/magick/configure.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "509000215663377a353fdb892d1d0c76")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ConfigureInfo", file: !134, line: 27, size: 448, elements: !136)
!136 = !{!137, !140, !141, !142, !144, !145, !147, !148}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !135, file: !134, line: 30, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !134, line: 31, baseType: !138, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !135, file: !134, line: 32, baseType: !138, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !135, file: !134, line: 35, baseType: !143, size: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !135, file: !134, line: 36, baseType: !143, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !135, file: !134, line: 39, baseType: !146, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !134, line: 40, baseType: !146, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !135, file: !134, line: 43, baseType: !149, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!151 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !159, line: 40, baseType: !160)
!159 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !159, line: 29, size: 32960, elements: !161)
!161 = !{!162, !166, !169, !170}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !160, file: !159, line: 32, baseType: !163, size: 32768)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 32768, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 4096)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !160, file: !159, line: 35, baseType: !167, size: 64, offset: 32768)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !160, file: !159, line: 38, baseType: !149, size: 64, offset: 32832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !160, file: !159, line: 39, baseType: !149, size: 64, offset: 32896)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !174, line: 7, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !176, line: 49, size: 1728, elements: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!177 = !{!178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !194, !196, !197, !198, !202, !204, !206, !210, !213, !215, !218, !221, !222, !223, !224, !225}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !175, file: !176, line: 51, baseType: !179, size: 32)
!179 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !175, file: !176, line: 54, baseType: !138, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !175, file: !176, line: 55, baseType: !138, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !175, file: !176, line: 56, baseType: !138, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !175, file: !176, line: 57, baseType: !138, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !175, file: !176, line: 58, baseType: !138, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !175, file: !176, line: 59, baseType: !138, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !175, file: !176, line: 60, baseType: !138, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !175, file: !176, line: 61, baseType: !138, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !175, file: !176, line: 64, baseType: !138, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !175, file: !176, line: 65, baseType: !138, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !175, file: !176, line: 66, baseType: !138, size: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !175, file: !176, line: 68, baseType: !192, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !176, line: 36, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !175, file: !176, line: 70, baseType: !195, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !175, file: !176, line: 72, baseType: !179, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !175, file: !176, line: 73, baseType: !179, size: 32, offset: 928)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !175, file: !176, line: 74, baseType: !199, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 152, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!201 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !175, file: !176, line: 77, baseType: !203, size: 16, offset: 1024)
!203 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !175, file: !176, line: 78, baseType: !205, size: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !175, file: !176, line: 79, baseType: !207, size: 8, offset: 1048)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !175, file: !176, line: 81, baseType: !211, size: 64, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !176, line: 43, baseType: null)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !175, file: !176, line: 89, baseType: !214, size: 64, offset: 1152)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 153, baseType: !201)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !175, file: !176, line: 91, baseType: !216, size: 64, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !176, line: 37, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !175, file: !176, line: 92, baseType: !219, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !176, line: 38, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !175, file: !176, line: 93, baseType: !195, size: 64, offset: 1344)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !175, file: !176, line: 94, baseType: !126, size: 64, offset: 1408)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !175, file: !176, line: 95, baseType: !149, size: 64, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !175, file: !176, line: 96, baseType: !179, size: 32, offset: 1536)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !175, file: !176, line: 98, baseType: !226, size: 160, offset: 1568)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 160, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 20)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !230, line: 77, baseType: !231)
!230 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !200, line: 193, baseType: !201)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!235 = !{!0, !236, !239}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "configure_cache", scope: !2, file: !238, line: 113, type: !127, isLocal: true, isDefinition: true)
!238 = !DIFile(filename: "apps/538.imagick_r/src/magick/configure.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c8f031117d01e31770da80d57cb3c4e5")
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "ConfigureMap", scope: !2, file: !238, line: 105, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 384, elements: !248)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConfigureMapInfo", file: !238, line: 99, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ConfigureMapInfo", file: !238, line: 94, size: 128, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !238, line: 97, baseType: !152, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !244, file: !238, line: 98, baseType: !152, size: 64, offset: 64)
!248 = !{!249}
!249 = !DISubrange(count: 3)
!250 = !{i32 7, !"Dwarf Version", i32 5}
!251 = !{i32 2, !"Debug Info Version", i32 3}
!252 = !{i32 1, !"wchar_size", i32 4}
!253 = !{i32 7, !"PIC Level", i32 2}
!254 = !{i32 7, !"PIE Level", i32 2}
!255 = !{i32 7, !"uwtable", i32 2}
!256 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!257 = distinct !DISubprogram(name: "ConfigureComponentGenesis", scope: !238, file: !238, line: 237, type: !258, scopeLine: 238, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{!143}
!260 = !{}
!261 = !DILocation(line: 239, column: 7, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !238, line: 239, column: 7)
!263 = !{!264, !264, i64 0}
!264 = !{!"any pointer", !265, i64 0}
!265 = !{!"omnipotent char", !266, i64 0}
!266 = !{!"Simple C/C++ TBAA"}
!267 = !DILocation(line: 239, column: 27, scope: !262)
!268 = !DILocation(line: 239, column: 7, scope: !257)
!269 = !DILocation(line: 240, column: 25, scope: !262)
!270 = !DILocation(line: 240, column: 24, scope: !262)
!271 = !DILocation(line: 240, column: 5, scope: !262)
!272 = !DILocation(line: 241, column: 3, scope: !257)
!273 = !DISubprogram(name: "AllocateSemaphoreInfo", scope: !124, file: !124, line: 32, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !260)
!274 = !DISubroutineType(types: !275)
!275 = !{!122}
!276 = distinct !DISubprogram(name: "ConfigureComponentTerminus", scope: !238, file: !238, line: 282, type: !277, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!277 = !DISubroutineType(types: !278)
!278 = !{null}
!279 = !DILocation(line: 284, column: 7, scope: !280)
!280 = distinct !DILexicalBlock(scope: !276, file: !238, line: 284, column: 7)
!281 = !DILocation(line: 284, column: 27, scope: !280)
!282 = !DILocation(line: 284, column: 7, scope: !276)
!283 = !DILocation(line: 285, column: 5, scope: !280)
!284 = !DILocation(line: 286, column: 21, scope: !276)
!285 = !DILocation(line: 286, column: 3, scope: !276)
!286 = !DILocation(line: 287, column: 7, scope: !287)
!287 = distinct !DILexicalBlock(scope: !276, file: !238, line: 287, column: 7)
!288 = !DILocation(line: 287, column: 23, scope: !287)
!289 = !DILocation(line: 287, column: 7, scope: !276)
!290 = !DILocation(line: 288, column: 21, scope: !287)
!291 = !DILocation(line: 288, column: 5, scope: !287)
!292 = !DILocation(line: 289, column: 18, scope: !276)
!293 = !DILocation(line: 290, column: 23, scope: !276)
!294 = !DILocation(line: 290, column: 3, scope: !276)
!295 = !DILocation(line: 291, column: 3, scope: !276)
!296 = !DILocation(line: 292, column: 1, scope: !276)
!297 = !DISubprogram(name: "ActivateSemaphoreInfo", scope: !124, file: !124, line: 35, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !260)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!301 = !DISubprogram(name: "LockSemaphoreInfo", scope: !124, file: !124, line: 37, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !260)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !122}
!304 = !DISubprogram(name: "DestroyLinkedList", scope: !129, file: !129, line: 42, type: !305, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !260)
!305 = !DISubroutineType(types: !306)
!306 = !{!127, !127, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!126, !126}
!310 = distinct !DISubprogram(name: "DestroyConfigureElement", scope: !238, file: !238, line: 263, type: !308, scopeLine: 264, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !311)
!311 = !{!312, !313}
!312 = !DILocalVariable(name: "configure_info", arg: 1, scope: !310, file: !238, line: 263, type: !126)
!313 = !DILocalVariable(name: "p", scope: !310, file: !238, line: 266, type: !154)
!314 = !DILocation(line: 0, scope: !310)
!315 = !DILocation(line: 269, column: 10, scope: !316)
!316 = distinct !DILexicalBlock(scope: !310, file: !238, line: 269, column: 7)
!317 = !{!318, !265, i64 24}
!318 = !{!"_ConfigureInfo", !264, i64 0, !264, i64 8, !264, i64 16, !265, i64 24, !265, i64 28, !264, i64 32, !264, i64 40, !319, i64 48}
!319 = !{!"long", !265, i64 0}
!320 = !DILocation(line: 269, column: 17, scope: !316)
!321 = !DILocation(line: 269, column: 7, scope: !310)
!322 = !DILocation(line: 271, column: 14, scope: !323)
!323 = distinct !DILexicalBlock(scope: !324, file: !238, line: 271, column: 11)
!324 = distinct !DILexicalBlock(scope: !316, file: !238, line: 270, column: 5)
!325 = !{!318, !264, i64 16}
!326 = !DILocation(line: 271, column: 20, scope: !323)
!327 = !DILocation(line: 271, column: 11, scope: !324)
!328 = !DILocation(line: 272, column: 18, scope: !323)
!329 = !DILocation(line: 272, column: 17, scope: !323)
!330 = !DILocation(line: 272, column: 9, scope: !323)
!331 = !DILocation(line: 273, column: 14, scope: !332)
!332 = distinct !DILexicalBlock(scope: !324, file: !238, line: 273, column: 11)
!333 = !{!318, !264, i64 8}
!334 = !DILocation(line: 273, column: 19, scope: !332)
!335 = !DILocation(line: 273, column: 11, scope: !324)
!336 = !DILocation(line: 274, column: 17, scope: !332)
!337 = !DILocation(line: 274, column: 16, scope: !332)
!338 = !DILocation(line: 274, column: 9, scope: !332)
!339 = !DILocation(line: 275, column: 14, scope: !340)
!340 = distinct !DILexicalBlock(scope: !324, file: !238, line: 275, column: 11)
!341 = !{!318, !264, i64 0}
!342 = !DILocation(line: 275, column: 19, scope: !340)
!343 = !DILocation(line: 275, column: 11, scope: !324)
!344 = !DILocation(line: 276, column: 17, scope: !340)
!345 = !DILocation(line: 276, column: 16, scope: !340)
!346 = !DILocation(line: 276, column: 9, scope: !340)
!347 = !DILocation(line: 278, column: 23, scope: !310)
!348 = !DILocation(line: 279, column: 3, scope: !310)
!349 = !DISubprogram(name: "UnlockSemaphoreInfo", scope: !124, file: !124, line: 39, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !260)
!350 = !DISubprogram(name: "DestroySemaphoreInfo", scope: !124, file: !124, line: 36, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !260)
!351 = distinct !DISubprogram(name: "DestroyConfigureOptions", scope: !238, file: !238, line: 323, type: !352, scopeLine: 324, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !354)
!352 = !DISubroutineType(types: !353)
!353 = !{!127, !127}
!354 = !{!355}
!355 = !DILocalVariable(name: "options", arg: 1, scope: !351, file: !238, line: 323, type: !127)
!356 = !DILocation(line: 0, scope: !351)
!357 = !DILocation(line: 326, column: 10, scope: !351)
!358 = !DILocation(line: 326, column: 3, scope: !351)
!359 = distinct !DISubprogram(name: "DestroyOptions", scope: !238, file: !238, line: 318, type: !308, scopeLine: 319, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !360)
!360 = !{!361}
!361 = !DILocalVariable(name: "option", arg: 1, scope: !359, file: !238, line: 318, type: !126)
!362 = !DILocation(line: 0, scope: !359)
!363 = !DILocation(line: 320, column: 10, scope: !359)
!364 = !DILocation(line: 320, column: 3, scope: !359)
!365 = distinct !DISubprogram(name: "GetConfigureInfo", scope: !238, file: !238, line: 358, type: !366, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !381)
!366 = !DISubroutineType(types: !367)
!367 = !{!131, !152, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !12, line: 102, size: 448, elements: !371)
!371 = !{!372, !374, !375, !376, !377, !378, !379, !380}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !370, file: !12, line: 105, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !12, line: 100, baseType: !11)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !370, file: !12, line: 108, baseType: !179, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !370, file: !12, line: 111, baseType: !138, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !370, file: !12, line: 112, baseType: !138, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !370, file: !12, line: 115, baseType: !126, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !370, file: !12, line: 118, baseType: !143, size: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !370, file: !12, line: 121, baseType: !122, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !370, file: !12, line: 124, baseType: !149, size: 64, offset: 384)
!381 = !{!382, !383, !384}
!382 = !DILocalVariable(name: "name", arg: 1, scope: !365, file: !238, line: 358, type: !152)
!383 = !DILocalVariable(name: "exception", arg: 2, scope: !365, file: !238, line: 359, type: !368)
!384 = !DILocalVariable(name: "p", scope: !365, file: !238, line: 362, type: !131)
!385 = !DILocation(line: 0, scope: !365)
!386 = !DILocalVariable(name: "exception", arg: 1, scope: !387, file: !238, line: 1002, type: !368)
!387 = distinct !DISubprogram(name: "IsConfigureCacheInstantiated", scope: !238, file: !238, line: 1002, type: !388, scopeLine: 1003, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !390)
!388 = !DISubroutineType(types: !389)
!389 = !{!143, !368}
!390 = !{!386}
!391 = !DILocation(line: 0, scope: !387, inlinedAt: !392)
!392 = distinct !DILocation(line: 365, column: 7, scope: !393)
!393 = distinct !DILexicalBlock(scope: !365, file: !238, line: 365, column: 7)
!394 = !DILocation(line: 1004, column: 7, scope: !395, inlinedAt: !392)
!395 = distinct !DILexicalBlock(scope: !387, file: !238, line: 1004, column: 7)
!396 = !DILocation(line: 1004, column: 23, scope: !395, inlinedAt: !392)
!397 = !DILocation(line: 1004, column: 7, scope: !387, inlinedAt: !392)
!398 = !DILocation(line: 1006, column: 11, scope: !399, inlinedAt: !392)
!399 = distinct !DILexicalBlock(scope: !400, file: !238, line: 1006, column: 11)
!400 = distinct !DILexicalBlock(scope: !395, file: !238, line: 1005, column: 5)
!401 = !DILocation(line: 1006, column: 31, scope: !399, inlinedAt: !392)
!402 = !DILocation(line: 1006, column: 11, scope: !400, inlinedAt: !392)
!403 = !DILocation(line: 1007, column: 9, scope: !399, inlinedAt: !392)
!404 = !DILocation(line: 1008, column: 25, scope: !400, inlinedAt: !392)
!405 = !DILocation(line: 1008, column: 7, scope: !400, inlinedAt: !392)
!406 = !DILocation(line: 1009, column: 11, scope: !407, inlinedAt: !392)
!407 = distinct !DILexicalBlock(scope: !400, file: !238, line: 1009, column: 11)
!408 = !DILocation(line: 1009, column: 27, scope: !407, inlinedAt: !392)
!409 = !DILocation(line: 1009, column: 11, scope: !400, inlinedAt: !392)
!410 = !DILocalVariable(name: "filename", arg: 1, scope: !411, file: !238, line: 152, type: !152)
!411 = distinct !DISubprogram(name: "AcquireConfigureCache", scope: !238, file: !238, line: 152, type: !412, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!127, !152, !368}
!414 = !{!410, !415, !416, !417, !418, !419, !421, !422, !425, !426, !430}
!415 = !DILocalVariable(name: "exception", arg: 2, scope: !411, file: !238, line: 153, type: !368)
!416 = !DILocalVariable(name: "option", scope: !411, file: !238, line: 156, type: !232)
!417 = !DILocalVariable(name: "configure_cache", scope: !411, file: !238, line: 159, type: !127)
!418 = !DILocalVariable(name: "options", scope: !411, file: !238, line: 160, type: !127)
!419 = !DILocalVariable(name: "status", scope: !411, file: !238, line: 163, type: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !6, line: 147, baseType: !7)
!421 = !DILocalVariable(name: "i", scope: !411, file: !238, line: 166, type: !229)
!422 = !DILocalVariable(name: "message", scope: !423, file: !238, line: 173, type: !138)
!423 = distinct !DILexicalBlock(scope: !424, file: !238, line: 173, column: 5)
!424 = distinct !DILexicalBlock(scope: !411, file: !238, line: 172, column: 7)
!425 = !DILocalVariable(name: "exception", scope: !423, file: !238, line: 173, type: !369)
!426 = !DILocalVariable(name: "configure_info", scope: !427, file: !238, line: 190, type: !154)
!427 = distinct !DILexicalBlock(scope: !428, file: !238, line: 188, column: 3)
