; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/constitute.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/constitute.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633}
!562 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!563 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!564 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!565 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!566 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!567 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!568 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!569 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!570 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!571 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!572 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!573 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!574 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!575 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!576 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!577 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!578 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!579 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!580 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!581 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!582 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!583 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!584 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!585 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!586 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!587 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!588 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!589 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!590 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!591 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!592 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!593 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!594 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!595 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!596 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!597 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!598 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!599 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!600 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!601 = !DIEnumerator(name: "MagickListOptions", value: 38)
!602 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!603 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!604 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!605 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!606 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!607 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!608 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!609 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!610 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!611 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!612 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!613 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!614 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!615 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!616 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!617 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!618 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!619 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!620 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!621 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!622 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!623 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!624 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!625 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!626 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!627 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!628 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!629 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!630 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!631 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!632 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!633 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!634 = !{!635, !636, !748, !709, !560, !697, !988, !650, !1000, !1036, !643, !665, !816, !907, !1055, !656, !778, !811, !871, !1008, !1065, !5, !1066}
!635 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !73, line: 356, size: 134336, elements: !639)
!639 = !{!640, !642, !644, !646, !647, !648, !649, !652, !653, !654, !655, !658, !659, !660, !662, !664, !666, !667, !668, !669, !670, !671, !672, !674, !675, !685, !686, !687, !688, !689, !690, !692, !694, !696, !702, !703, !704, !705, !706, !708, !902, !903, !904, !905, !906, !917, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !985, !986, !987}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !638, file: !73, line: 359, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !638, file: !73, line: 362, baseType: !643, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !638, file: !73, line: 365, baseType: !645, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !638, file: !73, line: 366, baseType: !645, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !638, file: !73, line: 367, baseType: !645, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !638, file: !73, line: 368, baseType: !645, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !73, line: 371, baseType: !650, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !638, file: !73, line: 372, baseType: !650, size: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !638, file: !73, line: 373, baseType: !650, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !638, file: !73, line: 374, baseType: !650, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !638, file: !73, line: 377, baseType: !656, size: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !657, line: 46, baseType: !635)
!657 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!658 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !638, file: !73, line: 378, baseType: !656, size: 64, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !638, file: !73, line: 379, baseType: !656, size: 64, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !638, file: !73, line: 382, baseType: !661, size: 32, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !638, file: !73, line: 385, baseType: !663, size: 32, offset: 672)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !638, file: !73, line: 388, baseType: !665, size: 32, offset: 704)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !638, file: !73, line: 391, baseType: !656, size: 64, offset: 768)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !638, file: !73, line: 394, baseType: !650, size: 64, offset: 832)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !638, file: !73, line: 395, baseType: !650, size: 64, offset: 896)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !638, file: !73, line: 396, baseType: !650, size: 64, offset: 960)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !638, file: !73, line: 397, baseType: !650, size: 64, offset: 1024)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !638, file: !73, line: 398, baseType: !650, size: 64, offset: 1088)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !638, file: !73, line: 401, baseType: !673, size: 64, offset: 1152)
!673 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !638, file: !73, line: 402, baseType: !673, size: 64, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !638, file: !73, line: 405, baseType: !676, size: 64, offset: 1280)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !678)
!678 = !{!679, !682, !683, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !677, file: !326, line: 143, baseType: !680, size: 16)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !681)
!681 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !677, file: !326, line: 144, baseType: !680, size: 16, offset: 16)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !677, file: !326, line: 145, baseType: !680, size: 16, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !677, file: !326, line: 146, baseType: !680, size: 16, offset: 48)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !638, file: !73, line: 406, baseType: !676, size: 64, offset: 1344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !638, file: !73, line: 407, baseType: !676, size: 64, offset: 1408)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !638, file: !73, line: 410, baseType: !645, size: 32, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !638, file: !73, line: 411, baseType: !645, size: 32, offset: 1504)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !638, file: !73, line: 414, baseType: !656, size: 64, offset: 1536)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !638, file: !73, line: 417, baseType: !691, size: 32, offset: 1600)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !73, line: 420, baseType: !693, size: 32, offset: 1632)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !638, file: !73, line: 423, baseType: !695, size: 32, offset: 1664)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !405, line: 59, baseType: !404)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !638, file: !73, line: 426, baseType: !697, size: 64, offset: 1728)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !698, line: 77, baseType: !699)
!698 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !700, line: 193, baseType: !701)
!700 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!701 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !638, file: !73, line: 429, baseType: !645, size: 32, offset: 1792)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !638, file: !73, line: 430, baseType: !645, size: 32, offset: 1824)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !638, file: !73, line: 433, baseType: !650, size: 64, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !638, file: !73, line: 434, baseType: !650, size: 64, offset: 1920)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !638, file: !73, line: 437, baseType: !707, size: 32, offset: 1984)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !437)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !638, file: !73, line: 440, baseType: !709, size: 64, offset: 2048)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !712)
!712 = !{!713, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !727, !728, !729, !730, !731, !745, !747, !749, !750, !751, !752, !753, !754, !755, !756, !764, !765, !766, !767, !768, !769, !771, !772, !773, !775, !777, !779, !781, !782, !783, !784, !785, !786, !787, !795, !810, !824, !825, !826, !827, !831, !835, !839, !840, !841, !842, !843, !860, !861, !863, !864, !874, !875, !877, !878, !879, !880, !881, !882, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !899, !901}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !711, file: !73, line: 153, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !711, file: !73, line: 156, baseType: !691, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !711, file: !73, line: 159, baseType: !641, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !711, file: !73, line: 162, baseType: !656, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !711, file: !73, line: 165, baseType: !643, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !711, file: !73, line: 168, baseType: !645, size: 32, offset: 224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !711, file: !73, line: 169, baseType: !645, size: 32, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !711, file: !73, line: 172, baseType: !656, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !711, file: !73, line: 173, baseType: !656, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !711, file: !73, line: 174, baseType: !656, size: 64, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !711, file: !73, line: 175, baseType: !656, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !711, file: !73, line: 178, baseType: !726, size: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !711, file: !73, line: 179, baseType: !676, size: 64, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !711, file: !73, line: 180, baseType: !676, size: 64, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !711, file: !73, line: 181, baseType: !676, size: 64, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !711, file: !73, line: 184, baseType: !673, size: 64, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !711, file: !73, line: 187, baseType: !732, size: 768, offset: 896)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !734)
!734 = !{!735, !742, !743, !744}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !733, file: !73, line: 124, baseType: !736, size: 192)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !737, file: !73, line: 98, baseType: !673, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !737, file: !73, line: 99, baseType: !673, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !737, file: !73, line: 100, baseType: !673, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !733, file: !73, line: 125, baseType: !736, size: 192, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !733, file: !73, line: 126, baseType: !736, size: 192, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !733, file: !73, line: 127, baseType: !736, size: 192, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !711, file: !73, line: 190, baseType: !746, size: 32, offset: 1664)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !711, file: !73, line: 193, baseType: !748, size: 64, offset: 1728)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !711, file: !73, line: 196, baseType: !665, size: 32, offset: 1792)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !711, file: !73, line: 199, baseType: !650, size: 64, offset: 1856)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !711, file: !73, line: 200, baseType: !650, size: 64, offset: 1920)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !711, file: !73, line: 201, baseType: !650, size: 64, offset: 1984)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !711, file: !73, line: 204, baseType: !697, size: 64, offset: 2048)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !711, file: !73, line: 207, baseType: !673, size: 64, offset: 2112)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !711, file: !73, line: 208, baseType: !673, size: 64, offset: 2176)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !711, file: !73, line: 211, baseType: !757, size: 256, offset: 2240)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !759)
!759 = !{!760, !761, !762, !763}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !758, file: !153, line: 124, baseType: !656, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !758, file: !153, line: 125, baseType: !656, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !758, file: !153, line: 128, baseType: !697, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !758, file: !153, line: 129, baseType: !697, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !711, file: !73, line: 212, baseType: !757, size: 256, offset: 2496)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !711, file: !73, line: 213, baseType: !757, size: 256, offset: 2752)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !711, file: !73, line: 216, baseType: !673, size: 64, offset: 3008)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !711, file: !73, line: 217, baseType: !673, size: 64, offset: 3072)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !711, file: !73, line: 218, baseType: !673, size: 64, offset: 3136)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !711, file: !73, line: 221, baseType: !770, size: 32, offset: 3200)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !711, file: !73, line: 224, baseType: !661, size: 32, offset: 3232)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !711, file: !73, line: 227, baseType: !663, size: 32, offset: 3264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !711, file: !73, line: 230, baseType: !774, size: 32, offset: 3296)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !711, file: !73, line: 233, baseType: !776, size: 32, offset: 3328)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !711, file: !73, line: 236, baseType: !778, size: 32, offset: 3360)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !711, file: !73, line: 239, baseType: !780, size: 64, offset: 3392)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !711, file: !73, line: 242, baseType: !656, size: 64, offset: 3456)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !711, file: !73, line: 243, baseType: !656, size: 64, offset: 3520)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !711, file: !73, line: 246, baseType: !697, size: 64, offset: 3584)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !711, file: !73, line: 249, baseType: !656, size: 64, offset: 3648)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !711, file: !73, line: 250, baseType: !656, size: 64, offset: 3712)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !711, file: !73, line: 253, baseType: !697, size: 64, offset: 3776)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !711, file: !73, line: 256, baseType: !788, size: 192, offset: 3840)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !789, line: 68, baseType: !790)
!789 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !789, line: 62, size: 192, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !790, file: !789, line: 65, baseType: !673, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !790, file: !789, line: 66, baseType: !673, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !790, file: !789, line: 67, baseType: !673, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !711, file: !73, line: 259, baseType: !796, size: 512, offset: 4032)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !798)
!798 = !{!799, !806, !807, !809}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !797, file: !247, line: 43, baseType: !800, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !801, file: !247, line: 35, baseType: !673, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !801, file: !247, line: 36, baseType: !673, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !801, file: !247, line: 37, baseType: !673, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !797, file: !247, line: 44, baseType: !800, size: 192, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !797, file: !247, line: 47, baseType: !808, size: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !797, file: !247, line: 50, baseType: !656, size: 64, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !711, file: !73, line: 262, baseType: !811, size: 64, offset: 4544)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !812, line: 26, baseType: !813)
!812 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!645, !816, !818, !821, !748}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !820)
!820 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !823)
!823 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !711, file: !73, line: 265, baseType: !748, size: 64, offset: 4608)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !711, file: !73, line: 266, baseType: !748, size: 64, offset: 4672)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !711, file: !73, line: 267, baseType: !748, size: 64, offset: 4736)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !711, file: !73, line: 270, baseType: !828, size: 64, offset: 4800)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !830)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !711, file: !73, line: 273, baseType: !832, size: 64, offset: 4864)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !834)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !711, file: !73, line: 276, baseType: !836, size: 32768, offset: 4928)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 32768, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 4096)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !711, file: !73, line: 277, baseType: !836, size: 32768, offset: 37696)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !711, file: !73, line: 278, baseType: !836, size: 32768, offset: 70464)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !711, file: !73, line: 281, baseType: !656, size: 64, offset: 103232)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !711, file: !73, line: 282, baseType: !656, size: 64, offset: 103296)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !711, file: !73, line: 285, baseType: !844, size: 448, offset: 103360)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !846)
!846 = !{!847, !849, !850, !851, !852, !853, !854, !859}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !845, file: !253, line: 105, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !845, file: !253, line: 108, baseType: !560, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !845, file: !253, line: 111, baseType: !650, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !845, file: !253, line: 112, baseType: !650, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !845, file: !253, line: 115, baseType: !748, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !845, file: !253, line: 118, baseType: !645, size: 32, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !845, file: !253, line: 121, baseType: !855, size: 64, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !857, line: 26, baseType: !858)
!857 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !857, line: 25, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !845, file: !253, line: 124, baseType: !656, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !711, file: !73, line: 288, baseType: !645, size: 32, offset: 103808)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !711, file: !73, line: 291, baseType: !862, size: 64, offset: 103872)
!862 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !697)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !711, file: !73, line: 294, baseType: !855, size: 64, offset: 103936)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !711, file: !73, line: 297, baseType: !865, size: 256, offset: 104000)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !867)
!867 = !{!868, !869, !870, !873}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !866, file: !89, line: 30, baseType: !650, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !866, file: !89, line: 33, baseType: !656, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !866, file: !89, line: 36, baseType: !871, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !866, file: !89, line: 39, baseType: !656, size: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !711, file: !73, line: 298, baseType: !865, size: 256, offset: 104256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !711, file: !73, line: 299, baseType: !876, size: 64, offset: 104512)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !711, file: !73, line: 302, baseType: !656, size: 64, offset: 104576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !711, file: !73, line: 305, baseType: !656, size: 64, offset: 104640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !711, file: !73, line: 308, baseType: !780, size: 64, offset: 104704)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !711, file: !73, line: 309, baseType: !780, size: 64, offset: 104768)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !711, file: !73, line: 310, baseType: !780, size: 64, offset: 104832)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !711, file: !73, line: 313, baseType: !883, size: 32, offset: 104896)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !711, file: !73, line: 316, baseType: !645, size: 32, offset: 104928)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !711, file: !73, line: 319, baseType: !676, size: 64, offset: 104960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !711, file: !73, line: 322, baseType: !780, size: 64, offset: 105024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !711, file: !73, line: 325, baseType: !757, size: 256, offset: 105088)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !711, file: !73, line: 328, baseType: !748, size: 64, offset: 105344)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !711, file: !73, line: 329, baseType: !748, size: 64, offset: 105408)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !711, file: !73, line: 332, baseType: !693, size: 32, offset: 105472)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !711, file: !73, line: 335, baseType: !645, size: 32, offset: 105504)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !711, file: !73, line: 338, baseType: !822, size: 64, offset: 105536)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !711, file: !73, line: 341, baseType: !645, size: 32, offset: 105600)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !711, file: !73, line: 344, baseType: !656, size: 64, offset: 105664)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !711, file: !73, line: 347, baseType: !896, size: 64, offset: 105728)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !897, line: 7, baseType: !898)
!897 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !700, line: 160, baseType: !701)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !711, file: !73, line: 350, baseType: !900, size: 32, offset: 105792)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !711, file: !73, line: 353, baseType: !656, size: 64, offset: 105856)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !638, file: !73, line: 443, baseType: !748, size: 64, offset: 2112)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !638, file: !73, line: 446, baseType: !811, size: 64, offset: 2176)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !638, file: !73, line: 449, baseType: !748, size: 64, offset: 2240)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !638, file: !73, line: 450, baseType: !748, size: 64, offset: 2304)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !638, file: !73, line: 453, baseType: !907, size: 64, offset: 2368)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !908, line: 26, baseType: !909)
!908 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!656, !912, !914, !916}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !638, file: !73, line: 456, baseType: !918, size: 64, offset: 2432)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !920, line: 7, baseType: !921)
!920 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !922, line: 49, size: 1728, elements: !923)
!922 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !939, !941, !942, !943, !945, !946, !948, !952, !955, !957, !960, !963, !964, !965, !966, !967}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !921, file: !922, line: 51, baseType: !560, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !921, file: !922, line: 54, baseType: !650, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !921, file: !922, line: 55, baseType: !650, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !921, file: !922, line: 56, baseType: !650, size: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !921, file: !922, line: 57, baseType: !650, size: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !921, file: !922, line: 58, baseType: !650, size: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !921, file: !922, line: 59, baseType: !650, size: 64, offset: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !921, file: !922, line: 60, baseType: !650, size: 64, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !921, file: !922, line: 61, baseType: !650, size: 64, offset: 512)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !921, file: !922, line: 64, baseType: !650, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !921, file: !922, line: 65, baseType: !650, size: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !921, file: !922, line: 66, baseType: !650, size: 64, offset: 704)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !921, file: !922, line: 68, baseType: !937, size: 64, offset: 768)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !922, line: 36, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !921, file: !922, line: 70, baseType: !940, size: 64, offset: 832)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !921, file: !922, line: 72, baseType: !560, size: 32, offset: 896)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !921, file: !922, line: 73, baseType: !560, size: 32, offset: 928)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !921, file: !922, line: 74, baseType: !944, size: 64, offset: 960)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !700, line: 152, baseType: !701)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !921, file: !922, line: 77, baseType: !681, size: 16, offset: 1024)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !921, file: !922, line: 78, baseType: !947, size: 8, offset: 1040)
!947 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !921, file: !922, line: 79, baseType: !949, size: 8, offset: 1048)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 8, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 1)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !921, file: !922, line: 81, baseType: !953, size: 64, offset: 1088)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !922, line: 43, baseType: null)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !921, file: !922, line: 89, baseType: !956, size: 64, offset: 1152)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !700, line: 153, baseType: !701)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !921, file: !922, line: 91, baseType: !958, size: 64, offset: 1216)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !922, line: 37, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !921, file: !922, line: 92, baseType: !961, size: 64, offset: 1280)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !922, line: 38, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !921, file: !922, line: 93, baseType: !940, size: 64, offset: 1344)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !921, file: !922, line: 94, baseType: !748, size: 64, offset: 1408)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !921, file: !922, line: 95, baseType: !656, size: 64, offset: 1472)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !921, file: !922, line: 96, baseType: !560, size: 32, offset: 1536)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !921, file: !922, line: 98, baseType: !968, size: 160, offset: 1568)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 160, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 20)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !638, file: !73, line: 459, baseType: !748, size: 64, offset: 2496)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !638, file: !73, line: 462, baseType: !656, size: 64, offset: 2560)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !638, file: !73, line: 465, baseType: !836, size: 32768, offset: 2624)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !638, file: !73, line: 466, baseType: !836, size: 32768, offset: 35392)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !638, file: !73, line: 467, baseType: !836, size: 32768, offset: 68160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !638, file: !73, line: 468, baseType: !836, size: 32768, offset: 100928)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !638, file: !73, line: 471, baseType: !645, size: 32, offset: 133696)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !638, file: !73, line: 474, baseType: !650, size: 64, offset: 133760)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !638, file: !73, line: 477, baseType: !656, size: 64, offset: 133824)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !638, file: !73, line: 478, baseType: !656, size: 64, offset: 133888)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !638, file: !73, line: 481, baseType: !676, size: 64, offset: 133952)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !638, file: !73, line: 484, baseType: !656, size: 64, offset: 134016)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !638, file: !73, line: 487, baseType: !984, size: 32, offset: 134080)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !460, line: 47, baseType: !459)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !638, file: !73, line: 490, baseType: !676, size: 64, offset: 134112)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !638, file: !73, line: 493, baseType: !748, size: 64, offset: 134208)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !638, file: !73, line: 496, baseType: !645, size: 32, offset: 134272)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !481, line: 103, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !481, line: 51, size: 1216, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998, !999, !1007, !1012, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1027, !1029, !1030, !1032, !1033, !1034, !1035}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !481, line: 54, baseType: !650, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !991, file: !481, line: 55, baseType: !650, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !991, file: !481, line: 56, baseType: !650, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !991, file: !481, line: 57, baseType: !650, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !991, file: !481, line: 58, baseType: !650, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !991, file: !481, line: 61, baseType: !636, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !991, file: !481, line: 64, baseType: !1000, size: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !481, line: 43, baseType: !1002)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!709, !1004, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !991, file: !481, line: 67, baseType: !1008, size: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !481, line: 46, baseType: !1010)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!645, !1004, !709}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !991, file: !481, line: 70, baseType: !1013, size: 64, offset: 512)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !481, line: 49, baseType: !1015)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!645, !1017, !916}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !991, file: !481, line: 73, baseType: !748, size: 64, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !991, file: !481, line: 76, baseType: !645, size: 32, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !991, file: !481, line: 77, baseType: !645, size: 32, offset: 672)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !991, file: !481, line: 78, baseType: !645, size: 32, offset: 704)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !991, file: !481, line: 79, baseType: !645, size: 32, offset: 736)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !991, file: !481, line: 80, baseType: !645, size: 32, offset: 768)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !991, file: !481, line: 83, baseType: !1026, size: 32, offset: 800)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !481, line: 33, baseType: !480)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !991, file: !481, line: 86, baseType: !1028, size: 32, offset: 832)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !991, file: !481, line: 89, baseType: !645, size: 32, offset: 864)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !991, file: !481, line: 92, baseType: !1031, size: 64, offset: 896)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !991, file: !481, line: 93, baseType: !1031, size: 64, offset: 960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !991, file: !481, line: 96, baseType: !656, size: 64, offset: 1024)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !991, file: !481, line: 99, baseType: !650, size: 64, offset: 1088)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !991, file: !481, line: 102, baseType: !855, size: 64, offset: 1152)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "DelegateInfo", file: !1039, line: 53, baseType: !1040)
!1039 = !DIFile(filename: "apps/538.imagick_r/src/magick/delegate.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "154c582a7300696ba5d05ab32b045264")
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DelegateInfo", file: !1039, line: 28, size: 704, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1052, !1053, !1054}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1040, file: !1039, line: 31, baseType: !650, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1040, file: !1039, line: 32, baseType: !650, size: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !1040, file: !1039, line: 33, baseType: !650, size: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !1040, file: !1039, line: 34, baseType: !650, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1040, file: !1039, line: 37, baseType: !697, size: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !1040, file: !1039, line: 40, baseType: !645, size: 32, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "spawn", scope: !1040, file: !1039, line: 41, baseType: !645, size: 32, offset: 352)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !1040, file: !1039, line: 42, baseType: !645, size: 32, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1040, file: !1039, line: 45, baseType: !1051, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !1039, line: 46, baseType: !1051, size: 64, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1040, file: !1039, line: 49, baseType: !656, size: 64, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1040, file: !1039, line: 52, baseType: !855, size: 64, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !1058, line: 40, baseType: !1059)
!1058 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !1058, line: 29, size: 32960, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1059, file: !1058, line: 32, baseType: !836, size: 32768)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !1059, file: !1058, line: 35, baseType: !871, size: 64, offset: 32768)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1059, file: !1058, line: 38, baseType: !656, size: 64, offset: 32832)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1059, file: !1058, line: 39, baseType: !656, size: 64, offset: 32896)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!1067 = !{i32 7, !"Dwarf Version", i32 5}
!1068 = !{i32 2, !"Debug Info Version", i32 3}
!1069 = !{i32 1, !"wchar_size", i32 4}
!1070 = !{i32 7, !"PIC Level", i32 2}
!1071 = !{i32 7, !"PIE Level", i32 2}
!1072 = !{i32 7, !"uwtable", i32 2}
!1073 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1074 = distinct !DISubprogram(name: "ConstituteImage", scope: !1075, file: !1075, line: 128, type: !1076, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1080)
!1075 = !DIFile(filename: "apps/538.imagick_r/src/magick/constitute.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5218a560e948a12ed2e113a6347dbc1d")
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!709, !916, !916, !816, !1078, !914, !1006}
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorageType", file: !369, line: 35, baseType: !368)
!1080 = !{!1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088}
!1081 = !DILocalVariable(name: "columns", arg: 1, scope: !1074, file: !1075, line: 128, type: !916)
!1082 = !DILocalVariable(name: "rows", arg: 2, scope: !1074, file: !1075, line: 129, type: !916)
!1083 = !DILocalVariable(name: "map", arg: 3, scope: !1074, file: !1075, line: 129, type: !816)
!1084 = !DILocalVariable(name: "storage", arg: 4, scope: !1074, file: !1075, line: 129, type: !1078)
!1085 = !DILocalVariable(name: "pixels", arg: 5, scope: !1074, file: !1075, line: 130, type: !914)
!1086 = !DILocalVariable(name: "exception", arg: 6, scope: !1074, file: !1075, line: 130, type: !1006)
!1087 = !DILocalVariable(name: "image", scope: !1074, file: !1075, line: 133, type: !709)
!1088 = !DILocalVariable(name: "status", scope: !1074, file: !1075, line: 136, type: !645)
!1089 = !DILocation(line: 0, scope: !1074)
!1090 = !DILocation(line: 142, column: 10, scope: !1074)
!1091 = !DILocation(line: 146, column: 9, scope: !1074)
!1092 = !DILocation(line: 147, column: 13, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1074, file: !1075, line: 147, column: 7)
!1094 = !DILocation(line: 147, column: 7, scope: !1074)
!1095 = !DILocation(line: 149, column: 16, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1074, file: !1075, line: 149, column: 7)
!1097 = !DILocation(line: 149, column: 22, scope: !1096)
!1098 = !DILocation(line: 150, column: 5, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1096, file: !1075, line: 150, column: 5)
!1100 = !DILocation(line: 151, column: 10, scope: !1074)
!1101 = !DILocation(line: 151, column: 17, scope: !1074)
!1102 = !{!1103, !1106, i64 40}
!1103 = !{!"_Image", !1104, i64 0, !1104, i64 4, !1104, i64 8, !1106, i64 16, !1104, i64 24, !1104, i64 28, !1104, i64 32, !1106, i64 40, !1106, i64 48, !1106, i64 56, !1106, i64 64, !1107, i64 72, !1108, i64 80, !1108, i64 88, !1108, i64 96, !1110, i64 104, !1111, i64 112, !1104, i64 208, !1107, i64 216, !1104, i64 224, !1107, i64 232, !1107, i64 240, !1107, i64 248, !1106, i64 256, !1110, i64 264, !1110, i64 272, !1113, i64 280, !1113, i64 312, !1113, i64 344, !1110, i64 376, !1110, i64 384, !1110, i64 392, !1104, i64 400, !1104, i64 404, !1104, i64 408, !1104, i64 412, !1104, i64 416, !1104, i64 420, !1107, i64 424, !1106, i64 432, !1106, i64 440, !1106, i64 448, !1106, i64 456, !1106, i64 464, !1106, i64 472, !1114, i64 480, !1115, i64 504, !1107, i64 568, !1107, i64 576, !1107, i64 584, !1107, i64 592, !1107, i64 600, !1107, i64 608, !1104, i64 616, !1104, i64 4712, !1104, i64 8808, !1106, i64 12904, !1106, i64 12912, !1117, i64 12920, !1104, i64 12976, !1106, i64 12984, !1107, i64 12992, !1119, i64 13000, !1119, i64 13032, !1107, i64 13064, !1106, i64 13072, !1106, i64 13080, !1107, i64 13088, !1107, i64 13096, !1107, i64 13104, !1104, i64 13112, !1104, i64 13116, !1108, i64 13120, !1107, i64 13128, !1113, i64 13136, !1107, i64 13168, !1107, i64 13176, !1104, i64 13184, !1104, i64 13188, !1120, i64 13192, !1104, i64 13200, !1106, i64 13208, !1106, i64 13216, !1104, i64 13224, !1106, i64 13232}
!1104 = !{!"omnipotent char", !1105, i64 0}
!1105 = !{!"Simple C/C++ TBAA"}
!1106 = !{!"long", !1104, i64 0}
!1107 = !{!"any pointer", !1104, i64 0}
!1108 = !{!"_PixelPacket", !1109, i64 0, !1109, i64 2, !1109, i64 4, !1109, i64 6}
!1109 = !{!"short", !1104, i64 0}
!1110 = !{!"double", !1104, i64 0}
!1111 = !{!"_ChromaticityInfo", !1112, i64 0, !1112, i64 24, !1112, i64 48, !1112, i64 72}
!1112 = !{!"_PrimaryInfo", !1110, i64 0, !1110, i64 8, !1110, i64 16}
!1113 = !{!"_RectangleInfo", !1106, i64 0, !1106, i64 8, !1106, i64 16, !1106, i64 24}
!1114 = !{!"_ErrorInfo", !1110, i64 0, !1110, i64 8, !1110, i64 16}
!1115 = !{!"_TimerInfo", !1116, i64 0, !1116, i64 24, !1104, i64 48, !1106, i64 56}
!1116 = !{!"_Timer", !1110, i64 0, !1110, i64 8, !1110, i64 16}
!1117 = !{!"_ExceptionInfo", !1104, i64 0, !1118, i64 4, !1107, i64 8, !1107, i64 16, !1107, i64 24, !1104, i64 32, !1107, i64 40, !1106, i64 48}
!1118 = !{!"int", !1104, i64 0}
!1119 = !{!"_ProfileInfo", !1107, i64 0, !1106, i64 8, !1107, i64 16, !1106, i64 24}
!1120 = !{!"long long", !1104, i64 0}
!1121 = !DILocation(line: 152, column: 10, scope: !1074)
!1122 = !DILocation(line: 152, column: 14, scope: !1074)
!1123 = !{!1103, !1106, i64 48}
!1124 = !DILocation(line: 153, column: 10, scope: !1074)
!1125 = !DILocation(line: 154, column: 10, scope: !1074)
!1126 = !DILocation(line: 155, column: 14, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1074, file: !1075, line: 155, column: 7)
!1128 = !DILocation(line: 155, column: 7, scope: !1074)
!1129 = !DILocation(line: 157, column: 42, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1127, file: !1075, line: 156, column: 5)
!1131 = !DILocation(line: 157, column: 7, scope: !1130)
!1132 = !DILocation(line: 158, column: 13, scope: !1130)
!1133 = !DILocation(line: 159, column: 5, scope: !1130)
!1134 = !DILocation(line: 161, column: 1, scope: !1074)
!1135 = !DISubprogram(name: "LogMagickEvent", scope: !380, file: !380, line: 83, type: !1136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!645, !1138, !816, !816, !916, !816, null}
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !380, line: 58, baseType: !379)
!1140 = !{}
!1141 = !DISubprogram(name: "AcquireImage", scope: !73, file: !73, line: 506, type: !1142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!709, !1004}
!1144 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!645, !1006, !816, !816, !916, !1147, !816, !816, null}
!1147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!1148 = !DISubprogram(name: "SetImageBackgroundColor", scope: !73, file: !73, line: 534, type: !1149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!645, !709}
!1151 = !DISubprogram(name: "ImportImagePixels", scope: !326, file: !326, line: 169, type: !1152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!645, !709, !1154, !1154, !916, !916, !816, !1078, !914}
!1154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!1155 = !DISubprogram(name: "InheritException", scope: !253, file: !253, line: 167, type: !1156, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{null, !1006, !1158}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1160 = !DISubprogram(name: "DestroyImage", scope: !73, file: !73, line: 510, type: !1161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!709, !709}
!1163 = distinct !DISubprogram(name: "PingImage", scope: !1075, file: !1075, line: 209, type: !1002, scopeLine: 211, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1164)
!1164 = !{!1165, !1166, !1167, !1168}
!1165 = !DILocalVariable(name: "image_info", arg: 1, scope: !1163, file: !1075, line: 209, type: !1004)
!1166 = !DILocalVariable(name: "exception", arg: 2, scope: !1163, file: !1075, line: 210, type: !1006)
!1167 = !DILocalVariable(name: "image", scope: !1163, file: !1075, line: 213, type: !709)
!1168 = !DILocalVariable(name: "ping_info", scope: !1163, file: !1075, line: 216, type: !636)
!1169 = !DILocation(line: 0, scope: !1163)
!1170 = !DILocation(line: 220, column: 19, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1163, file: !1075, line: 220, column: 7)
!1172 = !{!1173, !1104, i64 16712}
!1173 = !{!"_ImageInfo", !1104, i64 0, !1104, i64 4, !1104, i64 8, !1104, i64 12, !1104, i64 16, !1104, i64 20, !1107, i64 24, !1107, i64 32, !1107, i64 40, !1107, i64 48, !1106, i64 56, !1106, i64 64, !1106, i64 72, !1104, i64 80, !1104, i64 84, !1104, i64 88, !1106, i64 96, !1107, i64 104, !1107, i64 112, !1107, i64 120, !1107, i64 128, !1107, i64 136, !1110, i64 144, !1110, i64 152, !1108, i64 160, !1108, i64 168, !1108, i64 176, !1104, i64 184, !1104, i64 188, !1106, i64 192, !1104, i64 200, !1104, i64 204, !1104, i64 208, !1106, i64 216, !1104, i64 224, !1104, i64 228, !1107, i64 232, !1107, i64 240, !1104, i64 248, !1107, i64 256, !1107, i64 264, !1107, i64 272, !1107, i64 280, !1107, i64 288, !1107, i64 296, !1107, i64 304, !1107, i64 312, !1106, i64 320, !1104, i64 328, !1104, i64 4424, !1104, i64 8520, !1104, i64 12616, !1104, i64 16712, !1107, i64 16720, !1106, i64 16728, !1106, i64 16736, !1108, i64 16744, !1106, i64 16752, !1104, i64 16760, !1108, i64 16764, !1107, i64 16776, !1104, i64 16784}
!1174 = !DILocation(line: 220, column: 25, scope: !1171)
!1175 = !DILocation(line: 220, column: 7, scope: !1163)
!1176 = !DILocation(line: 222, column: 19, scope: !1171)
!1177 = !DILocation(line: 221, column: 12, scope: !1171)
!1178 = !DILocation(line: 221, column: 5, scope: !1171)
!1179 = !DILocation(line: 224, column: 13, scope: !1163)
!1180 = !DILocation(line: 225, column: 14, scope: !1163)
!1181 = !DILocation(line: 225, column: 18, scope: !1163)
!1182 = !{!1173, !1104, i64 224}
!1183 = !DILocation(line: 226, column: 9, scope: !1163)
!1184 = !DILocation(line: 227, column: 13, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1163, file: !1075, line: 227, column: 7)
!1186 = !DILocation(line: 227, column: 7, scope: !1163)
!1187 = !DILocation(line: 229, column: 26, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1185, file: !1075, line: 228, column: 5)
!1189 = !DILocation(line: 229, column: 7, scope: !1188)
!1190 = !DILocation(line: 230, column: 22, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1188, file: !1075, line: 230, column: 11)
!1192 = !{!1173, !1104, i64 228}
!1193 = !DILocation(line: 230, column: 30, scope: !1191)
!1194 = !DILocation(line: 230, column: 11, scope: !1188)
!1195 = !DILocation(line: 231, column: 36, scope: !1191)
!1196 = !{!1107, !1107, i64 0}
!1197 = !DILocation(line: 231, column: 16, scope: !1191)
!1198 = !DILocation(line: 231, column: 9, scope: !1191)
!1199 = !DILocation(line: 233, column: 13, scope: !1163)
!1200 = !DILocation(line: 234, column: 3, scope: !1163)
!1201 = !DISubprogram(name: "CloneImageInfo", scope: !73, file: !73, line: 521, type: !1202, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!636, !1004}
!1204 = !DISubprogram(name: "ReadStream", scope: !908, file: !908, line: 29, type: !1205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!709, !1004, !907, !1006}
!1207 = distinct !DISubprogram(name: "PingStream", scope: !1075, file: !1075, line: 196, type: !910, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1208)
!1208 = !{!1209, !1210, !1211}
!1209 = !DILocalVariable(name: "image", arg: 1, scope: !1207, file: !1075, line: 196, type: !912)
!1210 = !DILocalVariable(name: "pixels", arg: 2, scope: !1207, file: !1075, line: 197, type: !914)
!1211 = !DILocalVariable(name: "columns", arg: 3, scope: !1207, file: !1075, line: 197, type: !916)
!1212 = !DILocation(line: 0, scope: !1207)
!1213 = !DILocation(line: 202, column: 3, scope: !1207)
!1214 = !DISubprogram(name: "ResetTimer", scope: !247, file: !247, line: 66, type: !1215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{null, !1217}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!1218 = !DISubprogram(name: "IdentifyImage", scope: !1219, file: !1219, line: 26, type: !1220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1219 = !DIFile(filename: "apps/538.imagick_r/src/magick/identify.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2a4868f789673e3eec7ecb8762694234")
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!645, !709, !918, !1222}
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1223 = !DISubprogram(name: "DestroyImageInfo", scope: !73, file: !73, line: 522, type: !1224, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!636, !636}
!1226 = distinct !DISubprogram(name: "PingImages", scope: !1075, file: !1075, line: 261, type: !1002, scopeLine: 263, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1233, !1234, !1237, !1238}
!1228 = !DILocalVariable(name: "image_info", arg: 1, scope: !1226, file: !1075, line: 261, type: !1004)
!1229 = !DILocalVariable(name: "exception", arg: 2, scope: !1226, file: !1075, line: 262, type: !1006)
!1230 = !DILocalVariable(name: "filename", scope: !1226, file: !1075, line: 265, type: !836)
!1231 = !DILocalVariable(name: "image", scope: !1226, file: !1075, line: 268, type: !709)
!1232 = !DILocalVariable(name: "images", scope: !1226, file: !1075, line: 269, type: !709)
!1233 = !DILocalVariable(name: "read_info", scope: !1226, file: !1075, line: 272, type: !636)
!1234 = !DILocalVariable(name: "sans", scope: !1235, file: !1075, line: 288, type: !1006)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !1075, line: 286, column: 5)
!1236 = distinct !DILexicalBlock(scope: !1226, file: !1075, line: 285, column: 7)
!1237 = !DILocalVariable(name: "extent", scope: !1235, file: !1075, line: 291, type: !697)
!1238 = !DILocalVariable(name: "scene", scope: !1235, file: !1075, line: 292, type: !697)
!1239 = !DILocation(line: 0, scope: !1226)
!1240 = !DILocation(line: 264, column: 3, scope: !1226)
!1241 = !DILocation(line: 265, column: 5, scope: !1226)
!1242 = !DILocation(line: 267, column: 3, scope: !1226)
!1243 = !DILocation(line: 279, column: 19, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1226, file: !1075, line: 279, column: 7)
!1245 = !DILocation(line: 279, column: 25, scope: !1244)
!1246 = !DILocation(line: 279, column: 7, scope: !1226)
!1247 = !DILocation(line: 281, column: 19, scope: !1244)
!1248 = !DILocation(line: 280, column: 12, scope: !1244)
!1249 = !DILocation(line: 280, column: 5, scope: !1244)
!1250 = !DILocation(line: 283, column: 71, scope: !1226)
!1251 = !DILocation(line: 284, column: 23, scope: !1226)
!1252 = !{!1173, !1106, i64 56}
!1253 = !DILocation(line: 284, column: 5, scope: !1226)
!1254 = !DILocation(line: 283, column: 10, scope: !1226)
!1255 = !DILocation(line: 285, column: 7, scope: !1236)
!1256 = !DILocation(line: 285, column: 52, scope: !1236)
!1257 = !DILocation(line: 285, column: 7, scope: !1226)
!1258 = !DILocation(line: 297, column: 17, scope: !1235)
!1259 = !DILocation(line: 298, column: 12, scope: !1235)
!1260 = !DILocation(line: 0, scope: !1235)
!1261 = !DILocation(line: 299, column: 14, scope: !1235)
!1262 = !DILocation(line: 300, column: 12, scope: !1235)
!1263 = !DILocation(line: 301, column: 22, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1235, file: !1075, line: 301, column: 11)
!1265 = !{!1173, !1106, i64 64}
!1266 = !DILocation(line: 301, column: 36, scope: !1264)
!1267 = !DILocation(line: 301, column: 11, scope: !1235)
!1268 = !DILocation(line: 303, column: 21, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1264, file: !1075, line: 302, column: 9)
!1270 = !DILocation(line: 304, column: 18, scope: !1269)
!1271 = !DILocation(line: 304, column: 11, scope: !1269)
!1272 = !DILocation(line: 306, column: 51, scope: !1235)
!1273 = !DILocation(line: 306, column: 14, scope: !1235)
!1274 = !DILocation(line: 307, column: 14, scope: !1235)
!1275 = !DILocation(line: 307, column: 13, scope: !1235)
!1276 = !DILocation(line: 308, column: 36, scope: !1235)
!1277 = !DILocation(line: 308, column: 53, scope: !1235)
!1278 = !DILocation(line: 308, column: 41, scope: !1235)
!1279 = !DILocation(line: 309, column: 52, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1281, file: !1075, line: 309, column: 7)
!1281 = distinct !DILexicalBlock(scope: !1235, file: !1075, line: 309, column: 7)
!1282 = !DILocation(line: 309, column: 7, scope: !1281)
!1283 = !DILocation(line: 311, column: 74, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1280, file: !1075, line: 310, column: 7)
!1285 = !DILocation(line: 311, column: 16, scope: !1284)
!1286 = !DILocation(line: 313, column: 15, scope: !1284)
!1287 = !DILocation(line: 314, column: 19, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1284, file: !1075, line: 314, column: 13)
!1289 = !DILocation(line: 314, column: 13, scope: !1284)
!1290 = !DILocation(line: 316, column: 9, scope: !1284)
!1291 = !DILocation(line: 317, column: 7, scope: !1284)
!1292 = !DILocation(line: 309, column: 77, scope: !1280)
!1293 = distinct !{!1293, !1282, !1294, !1295, !1296}
!1294 = !DILocation(line: 317, column: 7, scope: !1281)
!1295 = !{!"llvm.loop.mustprogress"}
!1296 = !{!"llvm.loop.unroll.disable"}
!1297 = !DILocation(line: 318, column: 17, scope: !1235)
!1298 = !DILocation(line: 319, column: 14, scope: !1235)
!1299 = !DILocation(line: 319, column: 7, scope: !1235)
!1300 = !DILocation(line: 321, column: 10, scope: !1226)
!1301 = !DILocation(line: 321, column: 3, scope: !1226)
!1302 = !DILocation(line: 322, column: 1, scope: !1226)
!1303 = !DISubprogram(name: "InterpretImageFilename", scope: !73, file: !73, line: 549, type: !1304, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!656, !1004, !709, !816, !560, !650}
!1306 = !DISubprogram(name: "LocaleCompare", scope: !1058, file: !1058, line: 66, type: !1307, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!560, !816, !816}
!1309 = !DISubprogram(name: "AcquireExceptionInfo", scope: !253, file: !253, line: 146, type: !1310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!1006}
!1312 = !DISubprogram(name: "SetImageInfo", scope: !73, file: !73, line: 538, type: !1313, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!645, !636, !1315, !1006}
!1315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!1316 = !DISubprogram(name: "DestroyExceptionInfo", scope: !253, file: !253, line: 148, type: !1317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!1006, !1006}
!1319 = !DISubprogram(name: "CopyMagickString", scope: !1058, file: !1058, line: 78, type: !1320, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!656, !650, !816, !916}
!1322 = !DISubprogram(name: "NewImageList", scope: !1323, file: !1323, line: 36, type: !1324, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1323 = !DIFile(filename: "apps/538.imagick_r/src/magick/list.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53876be9fc59b89d67d5ff7fa85db93a")
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!709}
!1326 = !DISubprogram(name: "AppendImageToList", scope: !1323, file: !1323, line: 51, type: !1327, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1140)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{null, !1329, !912}
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!1330 = distinct !DISubprogram(name: "ReadImage", scope: !1075, file: !1075, line: 352, type: !1002, scopeLine: 354, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1331)
!1331 = !{!1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1350, !1351, !1352, !1353, !1354, !1355, !1357, !1359, !1365, !1368, !1375, !1378, !1381, !1385, !1386, !1387, !1388, !1389, !1392, !1397, !1400}
!1332 = !DILocalVariable(name: "image_info", arg: 1, scope: !1330, file: !1075, line: 352, type: !1004)
!1333 = !DILocalVariable(name: "exception", arg: 2, scope: !1330, file: !1075, line: 353, type: !1006)
!1334 = !DILocalVariable(name: "filename", scope: !1330, file: !1075, line: 356, type: !836)
!1335 = !DILocalVariable(name: "magick", scope: !1330, file: !1075, line: 357, type: !836)
!1336 = !DILocalVariable(name: "magick_filename", scope: !1330, file: !1075, line: 358, type: !836)
!1337 = !DILocalVariable(name: "value", scope: !1330, file: !1075, line: 361, type: !816)
!1338 = !DILocalVariable(name: "delegate_info", scope: !1330, file: !1075, line: 364, type: !1036)
!1339 = !DILocalVariable(name: "magick_info", scope: !1330, file: !1075, line: 367, type: !988)
!1340 = !DILocalVariable(name: "sans_exception", scope: !1330, file: !1075, line: 370, type: !1006)
!1341 = !DILocalVariable(name: "geometry_info", scope: !1330, file: !1075, line: 373, type: !1342)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryInfo", file: !153, line: 112, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GeometryInfo", file: !153, line: 104, size: 320, elements: !1344)
!1344 = !{!1345, !1346, !1347, !1348, !1349}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !1343, file: !153, line: 107, baseType: !673, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !1343, file: !153, line: 108, baseType: !673, size: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !1343, file: !153, line: 109, baseType: !673, size: 64, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !1343, file: !153, line: 110, baseType: !673, size: 64, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "chi", scope: !1343, file: !153, line: 111, baseType: !673, size: 64, offset: 256)
!1350 = !DILocalVariable(name: "image", scope: !1330, file: !1075, line: 376, type: !709)
!1351 = !DILocalVariable(name: "next", scope: !1330, file: !1075, line: 377, type: !709)
!1352 = !DILocalVariable(name: "read_info", scope: !1330, file: !1075, line: 380, type: !636)
!1353 = !DILocalVariable(name: "flags", scope: !1330, file: !1075, line: 383, type: !1028)
!1354 = !DILocalVariable(name: "thread_support", scope: !1330, file: !1075, line: 384, type: !1028)
!1355 = !DILocalVariable(name: "domain", scope: !1330, file: !1075, line: 387, type: !1356)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyDomain", file: !487, line: 37, baseType: !486)
!1357 = !DILocalVariable(name: "rights", scope: !1330, file: !1075, line: 390, type: !1358)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyRights", file: !487, line: 46, baseType: !496)
!1359 = !DILocalVariable(name: "lsb_first", scope: !1360, file: !1075, line: 432, type: !656)
!1360 = distinct !DILexicalBlock(scope: !1361, file: !1075, line: 430, column: 11)
!1361 = distinct !DILexicalBlock(scope: !1362, file: !1075, line: 428, column: 13)
!1362 = distinct !DILexicalBlock(scope: !1363, file: !1075, line: 425, column: 11)
!1363 = distinct !DILexicalBlock(scope: !1364, file: !1075, line: 424, column: 5)
!1364 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 423, column: 7)
!1365 = !DILocalVariable(name: "status", scope: !1366, file: !1075, line: 443, type: !645)
!1366 = distinct !DILexicalBlock(scope: !1367, file: !1075, line: 441, column: 5)
!1367 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 439, column: 7)
!1368 = !DILocalVariable(name: "message", scope: !1369, file: !1075, line: 539, type: !650)
!1369 = distinct !DILexicalBlock(scope: !1370, file: !1075, line: 539, column: 13)
!1370 = distinct !DILexicalBlock(scope: !1371, file: !1075, line: 534, column: 15)
!1371 = distinct !DILexicalBlock(scope: !1372, file: !1075, line: 533, column: 9)
!1372 = distinct !DILexicalBlock(scope: !1373, file: !1075, line: 531, column: 11)
!1373 = distinct !DILexicalBlock(scope: !1374, file: !1075, line: 497, column: 5)
!1374 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 486, column: 7)
!1375 = !DILocalVariable(name: "clones", scope: !1376, file: !1075, line: 573, type: !709)
!1376 = distinct !DILexicalBlock(scope: !1377, file: !1075, line: 571, column: 5)
!1377 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 569, column: 7)
!1378 = !DILocalVariable(name: "message", scope: !1379, file: !1075, line: 586, type: !650)
!1379 = distinct !DILexicalBlock(scope: !1380, file: !1075, line: 586, column: 5)
!1380 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 585, column: 7)
!1381 = !DILocalVariable(name: "magick_path", scope: !1382, file: !1075, line: 591, type: !836)
!1382 = distinct !DILexicalBlock(scope: !1383, file: !1075, line: 589, column: 3)
!1383 = distinct !DILexicalBlock(scope: !1384, file: !1075, line: 588, column: 3)
!1384 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 588, column: 3)
!1385 = !DILocalVariable(name: "property", scope: !1382, file: !1075, line: 592, type: !650)
!1386 = !DILocalVariable(name: "timestamp", scope: !1382, file: !1075, line: 593, type: !836)
!1387 = !DILocalVariable(name: "option", scope: !1382, file: !1075, line: 596, type: !816)
!1388 = !DILocalVariable(name: "profile", scope: !1382, file: !1075, line: 599, type: !1055)
!1389 = !DILocalVariable(name: "geometry", scope: !1390, file: !1075, line: 682, type: !757)
!1390 = distinct !DILexicalBlock(scope: !1391, file: !1075, line: 680, column: 7)
!1391 = distinct !DILexicalBlock(scope: !1382, file: !1075, line: 678, column: 9)
!1392 = !DILocalVariable(name: "crop_image", scope: !1393, file: !1075, line: 691, type: !709)
!1393 = distinct !DILexicalBlock(scope: !1394, file: !1075, line: 689, column: 15)
!1394 = distinct !DILexicalBlock(scope: !1395, file: !1075, line: 688, column: 17)
!1395 = distinct !DILexicalBlock(scope: !1396, file: !1075, line: 687, column: 11)
!1396 = distinct !DILexicalBlock(scope: !1390, file: !1075, line: 685, column: 13)
!1397 = !DILocalVariable(name: "size_image", scope: !1398, file: !1075, line: 701, type: !709)
!1398 = distinct !DILexicalBlock(scope: !1399, file: !1075, line: 699, column: 17)
!1399 = distinct !DILexicalBlock(scope: !1394, file: !1075, line: 698, column: 19)
!1400 = !DILocalVariable(name: "geometry_info", scope: !1401, file: !1075, line: 738, type: !1342)
!1401 = distinct !DILexicalBlock(scope: !1402, file: !1075, line: 736, column: 7)
!1402 = distinct !DILexicalBlock(scope: !1382, file: !1075, line: 735, column: 9)
!1403 = !DILocation(line: 0, scope: !1330)
!1404 = !DILocation(line: 355, column: 3, scope: !1330)
!1405 = !DILocation(line: 356, column: 5, scope: !1330)
!1406 = !DILocation(line: 357, column: 5, scope: !1330)
!1407 = !DILocation(line: 358, column: 5, scope: !1330)
!1408 = !DILocation(line: 372, column: 3, scope: !1330)
!1409 = !DILocation(line: 373, column: 5, scope: !1330)
!1410 = !DILocation(line: 375, column: 3, scope: !1330)
!1411 = !DILocation(line: 398, column: 19, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 398, column: 7)
!1413 = !DILocation(line: 398, column: 25, scope: !1412)
!1414 = !DILocation(line: 398, column: 7, scope: !1330)
!1415 = !DILocation(line: 400, column: 19, scope: !1412)
!1416 = !DILocation(line: 399, column: 12, scope: !1412)
!1417 = !DILocation(line: 399, column: 5, scope: !1412)
!1418 = !DILocation(line: 402, column: 13, scope: !1330)
!1419 = !DILocation(line: 403, column: 54, scope: !1330)
!1420 = !DILocation(line: 403, column: 10, scope: !1330)
!1421 = !DILocation(line: 404, column: 10, scope: !1330)
!1422 = !DILocation(line: 405, column: 10, scope: !1330)
!1423 = !DILocation(line: 406, column: 45, scope: !1330)
!1424 = !DILocation(line: 406, column: 10, scope: !1330)
!1425 = !DILocation(line: 409, column: 7, scope: !1426)
!1426 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 409, column: 7)
!1427 = !DILocation(line: 409, column: 59, scope: !1426)
!1428 = !DILocation(line: 409, column: 7, scope: !1330)
!1429 = !DILocation(line: 411, column: 7, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1426, file: !1075, line: 410, column: 5)
!1431 = !DILocation(line: 411, column: 12, scope: !1430)
!1432 = !{!1118, !1118, i64 0}
!1433 = !DILocation(line: 412, column: 14, scope: !1430)
!1434 = !DILocation(line: 414, column: 17, scope: !1430)
!1435 = !DILocation(line: 415, column: 7, scope: !1430)
!1436 = !DILocation(line: 420, column: 18, scope: !1330)
!1437 = !DILocation(line: 421, column: 15, scope: !1330)
!1438 = !DILocation(line: 422, column: 18, scope: !1330)
!1439 = !DILocation(line: 423, column: 19, scope: !1364)
!1440 = !DILocation(line: 423, column: 7, scope: !1330)
!1441 = !DILocation(line: 425, column: 11, scope: !1362)
!1442 = !DILocation(line: 425, column: 47, scope: !1362)
!1443 = !DILocation(line: 425, column: 11, scope: !1363)
!1444 = !DILocation(line: 428, column: 26, scope: !1361)
!1445 = !{!1173, !1104, i64 84}
!1446 = !DILocation(line: 428, column: 33, scope: !1361)
!1447 = !DILocation(line: 428, column: 53, scope: !1361)
!1448 = !DILocation(line: 429, column: 14, scope: !1361)
!1449 = !DILocation(line: 429, column: 47, scope: !1361)
!1450 = !DILocation(line: 428, column: 13, scope: !1362)
!1451 = !DILocation(line: 0, scope: !1362)
!1452 = !DILocation(line: 440, column: 8, scope: !1367)
!1453 = !DILocation(line: 440, column: 45, scope: !1367)
!1454 = !DILocation(line: 439, column: 7, scope: !1330)
!1455 = !DILocation(line: 445, column: 13, scope: !1366)
!1456 = !DILocation(line: 446, column: 38, scope: !1366)
!1457 = !DILocation(line: 446, column: 14, scope: !1366)
!1458 = !DILocation(line: 448, column: 14, scope: !1366)
!1459 = !DILocation(line: 0, scope: !1366)
!1460 = !DILocation(line: 449, column: 18, scope: !1461)
!1461 = distinct !DILexicalBlock(scope: !1366, file: !1075, line: 449, column: 11)
!1462 = !DILocation(line: 449, column: 11, scope: !1366)
!1463 = !DILocation(line: 451, column: 21, scope: !1464)
!1464 = distinct !DILexicalBlock(scope: !1461, file: !1075, line: 450, column: 9)
!1465 = !DILocation(line: 452, column: 17, scope: !1464)
!1466 = !DILocation(line: 453, column: 11, scope: !1464)
!1467 = !DILocation(line: 455, column: 11, scope: !1468)
!1468 = distinct !DILexicalBlock(scope: !1366, file: !1075, line: 455, column: 11)
!1469 = !DILocation(line: 455, column: 33, scope: !1468)
!1470 = !DILocation(line: 455, column: 11, scope: !1366)
!1471 = !DILocation(line: 460, column: 31, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !1468, file: !1075, line: 456, column: 9)
!1473 = !{!1104, !1104, i64 0}
!1474 = !DILocation(line: 461, column: 18, scope: !1472)
!1475 = !DILocation(line: 462, column: 22, scope: !1476)
!1476 = distinct !DILexicalBlock(scope: !1472, file: !1075, line: 462, column: 15)
!1477 = !DILocation(line: 462, column: 15, scope: !1472)
!1478 = !DILocation(line: 464, column: 22, scope: !1479)
!1479 = distinct !DILexicalBlock(scope: !1476, file: !1075, line: 463, column: 13)
!1480 = !DILocation(line: 465, column: 25, scope: !1479)
!1481 = !DILocation(line: 466, column: 21, scope: !1479)
!1482 = !DILocation(line: 467, column: 15, scope: !1479)
!1483 = !DILocation(line: 469, column: 22, scope: !1472)
!1484 = !DILocation(line: 469, column: 31, scope: !1472)
!1485 = !{!1173, !1104, i64 8}
!1486 = !DILocation(line: 470, column: 9, scope: !1472)
!1487 = !DILocation(line: 471, column: 14, scope: !1366)
!1488 = !DILocation(line: 472, column: 13, scope: !1366)
!1489 = !DILocation(line: 474, column: 9, scope: !1330)
!1490 = !DILocation(line: 475, column: 50, scope: !1491)
!1491 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 475, column: 7)
!1492 = !DILocation(line: 476, column: 8, scope: !1491)
!1493 = !DILocation(line: 476, column: 37, scope: !1491)
!1494 = !DILocation(line: 475, column: 7, scope: !1330)
!1495 = !DILocation(line: 478, column: 21, scope: !1496)
!1496 = distinct !DILexicalBlock(scope: !1491, file: !1075, line: 477, column: 5)
!1497 = !DILocation(line: 479, column: 25, scope: !1498)
!1498 = distinct !DILexicalBlock(scope: !1496, file: !1075, line: 479, column: 11)
!1499 = !DILocation(line: 479, column: 11, scope: !1496)
!1500 = !DILocation(line: 481, column: 18, scope: !1501)
!1501 = distinct !DILexicalBlock(scope: !1498, file: !1075, line: 480, column: 9)
!1502 = !DILocation(line: 482, column: 18, scope: !1501)
!1503 = !DILocation(line: 483, column: 23, scope: !1501)
!1504 = !DILocation(line: 484, column: 9, scope: !1501)
!1505 = !DILocation(line: 486, column: 20, scope: !1374)
!1506 = !DILocation(line: 486, column: 50, scope: !1374)
!1507 = !DILocation(line: 487, column: 8, scope: !1374)
!1508 = !DILocation(line: 487, column: 37, scope: !1374)
!1509 = !DILocation(line: 486, column: 7, scope: !1330)
!1510 = !DILocation(line: 489, column: 22, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1374, file: !1075, line: 488, column: 5)
!1512 = !DILocation(line: 490, column: 27, scope: !1513)
!1513 = distinct !DILexicalBlock(scope: !1511, file: !1075, line: 490, column: 11)
!1514 = !DILocation(line: 490, column: 51, scope: !1513)
!1515 = !DILocation(line: 490, column: 11, scope: !1511)
!1516 = !DILocation(line: 491, column: 40, scope: !1513)
!1517 = !{!1518, !1107, i64 144}
!1518 = !{!"_MagickInfo", !1107, i64 0, !1107, i64 8, !1107, i64 16, !1107, i64 24, !1107, i64 32, !1107, i64 40, !1107, i64 48, !1107, i64 56, !1107, i64 64, !1107, i64 72, !1104, i64 80, !1104, i64 84, !1104, i64 88, !1104, i64 92, !1104, i64 96, !1104, i64 100, !1118, i64 104, !1104, i64 108, !1107, i64 112, !1107, i64 120, !1106, i64 128, !1107, i64 136, !1107, i64 144}
!1519 = !DILocation(line: 491, column: 9, scope: !1513)
!1520 = !DILocation(line: 492, column: 13, scope: !1511)
!1521 = !DILocation(line: 493, column: 11, scope: !1511)
!1522 = !DILocation(line: 498, column: 21, scope: !1373)
!1523 = !DILocation(line: 499, column: 25, scope: !1524)
!1524 = distinct !DILexicalBlock(scope: !1373, file: !1075, line: 499, column: 11)
!1525 = !DILocation(line: 499, column: 11, scope: !1373)
!1526 = !DILocation(line: 501, column: 18, scope: !1527)
!1527 = distinct !DILexicalBlock(scope: !1524, file: !1075, line: 500, column: 9)
!1528 = !DILocation(line: 504, column: 26, scope: !1529)
!1529 = distinct !DILexicalBlock(scope: !1527, file: !1075, line: 504, column: 15)
!1530 = !DILocation(line: 504, column: 36, scope: !1529)
!1531 = !DILocation(line: 504, column: 15, scope: !1527)
!1532 = !DILocation(line: 505, column: 20, scope: !1529)
!1533 = !DILocation(line: 505, column: 13, scope: !1529)
!1534 = !DILocation(line: 506, column: 21, scope: !1527)
!1535 = !DILocation(line: 507, column: 11, scope: !1527)
!1536 = !DILocation(line: 512, column: 13, scope: !1373)
!1537 = !DILocation(line: 513, column: 17, scope: !1538)
!1538 = distinct !DILexicalBlock(scope: !1373, file: !1075, line: 513, column: 11)
!1539 = !DILocation(line: 513, column: 11, scope: !1373)
!1540 = !DILocation(line: 515, column: 21, scope: !1541)
!1541 = distinct !DILexicalBlock(scope: !1538, file: !1075, line: 514, column: 9)
!1542 = !DILocation(line: 516, column: 11, scope: !1541)
!1543 = !DILocation(line: 518, column: 38, scope: !1373)
!1544 = !DILocation(line: 518, column: 14, scope: !1373)
!1545 = !DILocation(line: 520, column: 27, scope: !1373)
!1546 = !DILocation(line: 521, column: 11, scope: !1547)
!1547 = distinct !DILexicalBlock(scope: !1373, file: !1075, line: 521, column: 11)
!1548 = !DILocation(line: 521, column: 51, scope: !1547)
!1549 = !DILocation(line: 521, column: 11, scope: !1373)
!1550 = !DILocation(line: 522, column: 42, scope: !1547)
!1551 = !{!1552, !1107, i64 80}
!1552 = !{!"_DelegateInfo", !1107, i64 0, !1107, i64 8, !1107, i64 16, !1107, i64 24, !1106, i64 32, !1104, i64 40, !1104, i64 44, !1104, i64 48, !1107, i64 56, !1107, i64 64, !1106, i64 72, !1107, i64 80}
!1553 = !DILocation(line: 522, column: 9, scope: !1547)
!1554 = !DILocation(line: 523, column: 14, scope: !1373)
!1555 = !DILocation(line: 525, column: 11, scope: !1556)
!1556 = distinct !DILexicalBlock(scope: !1373, file: !1075, line: 525, column: 11)
!1557 = !DILocation(line: 525, column: 51, scope: !1556)
!1558 = !DILocation(line: 525, column: 11, scope: !1373)
!1559 = !DILocation(line: 526, column: 44, scope: !1556)
!1560 = !DILocation(line: 526, column: 9, scope: !1556)
!1561 = !DILocation(line: 527, column: 13, scope: !1373)
!1562 = !DILocation(line: 528, column: 18, scope: !1373)
!1563 = !DILocation(line: 528, column: 27, scope: !1373)
!1564 = !DILocation(line: 529, column: 14, scope: !1373)
!1565 = !DILocation(line: 530, column: 19, scope: !1373)
!1566 = !DILocation(line: 531, column: 24, scope: !1372)
!1567 = !DILocation(line: 531, column: 54, scope: !1372)
!1568 = !DILocation(line: 532, column: 12, scope: !1372)
!1569 = !DILocation(line: 532, column: 41, scope: !1372)
!1570 = !DILocation(line: 531, column: 11, scope: !1373)
!1571 = !DILocation(line: 534, column: 15, scope: !1370)
!1572 = !DILocation(line: 534, column: 53, scope: !1370)
!1573 = !DILocation(line: 534, column: 15, scope: !1371)
!1574 = !DILocation(line: 535, column: 20, scope: !1370)
!1575 = !DILocation(line: 535, column: 13, scope: !1370)
!1576 = !DILocation(line: 539, column: 13, scope: !1369)
!1577 = !DILocation(line: 0, scope: !1369)
!1578 = !DILocation(line: 541, column: 21, scope: !1371)
!1579 = !DILocation(line: 542, column: 11, scope: !1371)
!1580 = !DILocation(line: 544, column: 22, scope: !1373)
!1581 = !DILocation(line: 545, column: 27, scope: !1582)
!1582 = distinct !DILexicalBlock(scope: !1373, file: !1075, line: 545, column: 11)
!1583 = !DILocation(line: 545, column: 51, scope: !1582)
!1584 = !DILocation(line: 545, column: 11, scope: !1373)
!1585 = !DILocation(line: 546, column: 40, scope: !1582)
!1586 = !DILocation(line: 546, column: 9, scope: !1582)
!1587 = !DILocation(line: 547, column: 24, scope: !1373)
!1588 = !DILocation(line: 547, column: 23, scope: !1373)
!1589 = !DILocation(line: 548, column: 11, scope: !1373)
!1590 = !DILocation(line: 0, scope: !1374)
!1591 = !DILocation(line: 551, column: 18, scope: !1592)
!1592 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 551, column: 7)
!1593 = !DILocation(line: 551, column: 28, scope: !1592)
!1594 = !DILocation(line: 551, column: 7, scope: !1330)
!1595 = !DILocation(line: 553, column: 14, scope: !1596)
!1596 = distinct !DILexicalBlock(scope: !1592, file: !1075, line: 552, column: 5)
!1597 = !DILocation(line: 554, column: 27, scope: !1596)
!1598 = !DILocation(line: 555, column: 11, scope: !1596)
!1599 = !DILocation(line: 556, column: 40, scope: !1600)
!1600 = distinct !DILexicalBlock(scope: !1596, file: !1075, line: 555, column: 11)
!1601 = !DILocation(line: 556, column: 16, scope: !1600)
!1602 = !DILocation(line: 558, column: 7, scope: !1330)
!1603 = !DILocation(line: 558, column: 13, scope: !1604)
!1604 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 558, column: 7)
!1605 = !DILocation(line: 560, column: 17, scope: !1606)
!1606 = distinct !DILexicalBlock(scope: !1604, file: !1075, line: 559, column: 5)
!1607 = !DILocation(line: 561, column: 7, scope: !1606)
!1608 = !DILocation(line: 563, column: 18, scope: !1609)
!1609 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 563, column: 7)
!1610 = !{!1117, !1104, i64 0}
!1611 = !DILocation(line: 563, column: 27, scope: !1609)
!1612 = !DILocation(line: 563, column: 7, scope: !1330)
!1613 = !DILocation(line: 566, column: 38, scope: !1609)
!1614 = !DILocation(line: 564, column: 12, scope: !1609)
!1615 = !DILocation(line: 564, column: 5, scope: !1609)
!1616 = !DILocation(line: 567, column: 7, scope: !1617)
!1617 = distinct !DILexicalBlock(scope: !1330, file: !1075, line: 567, column: 7)
!1618 = !DILocation(line: 567, column: 30, scope: !1617)
!1619 = !DILocation(line: 567, column: 7, scope: !1330)
!1620 = !DILocation(line: 568, column: 12, scope: !1617)
!1621 = !DILocation(line: 568, column: 5, scope: !1617)
!1622 = !DILocation(line: 569, column: 8, scope: !1377)
!1623 = !DILocation(line: 569, column: 34, scope: !1377)
!1624 = !DILocation(line: 569, column: 53, scope: !1377)
!1625 = !DILocation(line: 570, column: 35, scope: !1377)
!1626 = !{!1173, !1107, i64 48}
!1627 = !DILocation(line: 570, column: 8, scope: !1377)
!1628 = !DILocation(line: 570, column: 55, scope: !1377)
!1629 = !DILocation(line: 569, column: 7, scope: !1330)
!1630 = !DILocation(line: 575, column: 43, scope: !1376)
!1631 = !DILocation(line: 575, column: 14, scope: !1376)
