; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/utilities/convert.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/utilities/convert.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind uwtable
define dso_local i32 @main(i32 noundef %argc, ptr noundef %argv) local_unnamed_addr #0 !dbg !456 {
entry:
  call void @llvm.dbg.value(metadata i32 %argc, metadata !462, metadata !DIExpression()), !dbg !464
  call void @llvm.dbg.value(metadata ptr %argv, metadata !463, metadata !DIExpression()), !dbg !464
  call void @llvm.dbg.value(metadata i32 %argc, metadata !465, metadata !DIExpression()) #3, !dbg !823
  call void @llvm.dbg.value(metadata ptr %argv, metadata !468, metadata !DIExpression()) #3, !dbg !823
  %0 = load ptr, ptr %argv, align 8, !dbg !825, !tbaa !826
  tail call void @MagickCoreGenesis(ptr noundef %0, i32 noundef 1) #3, !dbg !830
  %call.i = tail call ptr @AcquireExceptionInfo() #3, !dbg !831
  call void @llvm.dbg.value(metadata ptr %call.i, metadata !469, metadata !DIExpression()) #3, !dbg !823
  %call1.i = tail call ptr @AcquireImageInfo() #3, !dbg !832
  call void @llvm.dbg.value(metadata ptr %call1.i, metadata !491, metadata !DIExpression()) #3, !dbg !823

!399 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!400 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!401 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!402 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!403 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!404 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!405 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!406 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!407 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!408 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!409 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!410 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !395, line: 67, baseType: !5, size: 32, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!413 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!414 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!415 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!416 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!417 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!418 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!419 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!420 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!421 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!422 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 27, baseType: !5, size: 32, elements: !425)
!424 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!426 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!427 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!428 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!429 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!430 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!431 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!432 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!433 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!434 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!435 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!436 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!437 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!438 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!439 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!440 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!441 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!442 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!443 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!444 = !{!445, !448}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!449 = !{i32 7, !"Dwarf Version", i32 5}
!450 = !{i32 2, !"Debug Info Version", i32 3}
!451 = !{i32 1, !"wchar_size", i32 4}
!452 = !{i32 7, !"PIC Level", i32 2}
!453 = !{i32 7, !"PIE Level", i32 2}
!454 = !{i32 7, !"uwtable", i32 2}
!455 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!456 = distinct !DISubprogram(name: "main", scope: !457, file: !457, line: 90, type: !458, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !461)
!457 = !DIFile(filename: "apps/538.imagick_r/src/utilities/convert.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d9c7e339980f041635ca83701bc006")
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !460, !445}
!460 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!461 = !{!462, !463}
!462 = !DILocalVariable(name: "argc", arg: 1, scope: !456, file: !457, line: 90, type: !460)
!463 = !DILocalVariable(name: "argv", arg: 2, scope: !456, file: !457, line: 90, type: !445)
!464 = !DILocation(line: 0, scope: !456)
!465 = !DILocalVariable(name: "argc", arg: 1, scope: !466, file: !457, line: 67, type: !460)
!466 = distinct !DISubprogram(name: "ConvertMain", scope: !457, file: !457, line: 67, type: !458, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !467)
!467 = !{!465, !468, !469, !491, !822}
!468 = !DILocalVariable(name: "argv", arg: 2, scope: !466, file: !457, line: 67, type: !445)
!469 = !DILocalVariable(name: "exception", scope: !466, file: !457, line: 70, type: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !78, line: 219, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !4, line: 102, size: 448, elements: !473)
!473 = !{!474, !476, !477, !478, !479, !480, !482, !487}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !472, file: !4, line: 105, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !4, line: 100, baseType: !3)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !472, file: !4, line: 108, baseType: !460, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !472, file: !4, line: 111, baseType: !446, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !472, file: !4, line: 112, baseType: !446, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !472, file: !4, line: 115, baseType: !448, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !472, file: !4, line: 118, baseType: !481, size: 32, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !78, line: 215, baseType: !77)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !472, file: !4, line: 121, baseType: !483, size: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !485, line: 26, baseType: !486)
!485 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !485, line: 25, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !472, file: !4, line: 124, baseType: !488, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !489, line: 46, baseType: !490)
!489 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!490 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!491 = !DILocalVariable(name: "image_info", scope: !466, file: !457, line: 73, type: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !78, line: 223, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !108, line: 356, size: 134336, elements: !495)
!495 = !{!496, !498, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !513, !515, !517, !518, !519, !520, !521, !522, !523, !525, !526, !536, !537, !538, !539, !540, !541, !543, !545, !547, !553, !554, !555, !556, !557, !559, !736, !737, !738, !739, !740, !751, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !819, !820, !821}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !494, file: !108, line: 359, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !83, line: 49, baseType: !82)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !494, file: !108, line: 362, baseType: !499, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !108, line: 86, baseType: !107)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !494, file: !108, line: 365, baseType: !481, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !494, file: !108, line: 366, baseType: !481, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !494, file: !108, line: 367, baseType: !481, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !494, file: !108, line: 368, baseType: !481, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !494, file: !108, line: 371, baseType: !446, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !494, file: !108, line: 372, baseType: !446, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !494, file: !108, line: 373, baseType: !446, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !494, file: !108, line: 374, baseType: !446, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !494, file: !108, line: 377, baseType: !488, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !494, file: !108, line: 378, baseType: !488, size: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !494, file: !108, line: 379, baseType: !488, size: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !494, file: !108, line: 382, baseType: !512, size: 32, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !108, line: 73, baseType: !119)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !494, file: !108, line: 385, baseType: !514, size: 32, offset: 672)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !130, line: 35, baseType: !129)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !494, file: !108, line: 388, baseType: !516, size: 32, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !108, line: 93, baseType: !135)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !494, file: !108, line: 391, baseType: !488, size: 64, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !494, file: !108, line: 394, baseType: !446, size: 64, offset: 832)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !494, file: !108, line: 395, baseType: !446, size: 64, offset: 896)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !494, file: !108, line: 396, baseType: !446, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !494, file: !108, line: 397, baseType: !446, size: 64, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !494, file: !108, line: 398, baseType: !446, size: 64, offset: 1088)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !494, file: !108, line: 401, baseType: !524, size: 64, offset: 1152)
!524 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !494, file: !108, line: 402, baseType: !524, size: 64, offset: 1216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !494, file: !108, line: 405, baseType: !527, size: 64, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !529)
!529 = !{!530, !533, !534, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !528, file: !395, line: 143, baseType: !531, size: 16)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !78, line: 93, baseType: !532)
!532 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !528, file: !395, line: 144, baseType: !531, size: 16, offset: 16)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !528, file: !395, line: 145, baseType: !531, size: 16, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !528, file: !395, line: 146, baseType: !531, size: 16, offset: 48)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !494, file: !108, line: 406, baseType: !527, size: 64, offset: 1344)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !494, file: !108, line: 407, baseType: !527, size: 64, offset: 1408)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !494, file: !108, line: 410, baseType: !481, size: 32, offset: 1472)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !494, file: !108, line: 411, baseType: !481, size: 32, offset: 1504)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !494, file: !108, line: 414, baseType: !488, size: 64, offset: 1536)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !494, file: !108, line: 417, baseType: !542, size: 32, offset: 1600)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !141, line: 61, baseType: !140)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !494, file: !108, line: 420, baseType: !544, size: 32, offset: 1632)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !108, line: 61, baseType: !177)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !494, file: !108, line: 423, baseType: !546, size: 32, offset: 1664)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !192, line: 59, baseType: !191)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !494, file: !108, line: 426, baseType: !548, size: 64, offset: 1728)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !549, line: 77, baseType: !550)
!549 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !551, line: 193, baseType: !552)
!551 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!552 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !494, file: !108, line: 429, baseType: !481, size: 32, offset: 1792)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !494, file: !108, line: 430, baseType: !481, size: 32, offset: 1824)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !494, file: !108, line: 433, baseType: !446, size: 64, offset: 1856)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !494, file: !108, line: 434, baseType: !446, size: 64, offset: 1920)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !494, file: !108, line: 437, baseType: !558, size: 32, offset: 1984)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !78, line: 202, baseType: !224)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !494, file: !108, line: 440, baseType: !560, size: 64, offset: 2048)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !78, line: 221, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !108, line: 150, size: 105920, elements: !563)
!563 = !{!564, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !578, !579, !580, !581, !582, !596, !598, !599, !600, !601, !602, !603, !604, !605, !606, !614, !615, !616, !617, !618, !619, !621, !622, !623, !625, !627, !629, !631, !632, !633, !634, !635, !636, !637, !645, !660, !674, !675, !676, !677, !681, !685, !689, !690, !691, !692, !693, !694, !695, !697, !698, !708, !709, !711, !712, !713, !714, !715, !716, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !733, !735}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !562, file: !108, line: 153, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !78, line: 209, baseType: !246)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !562, file: !108, line: 156, baseType: !542, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !562, file: !108, line: 159, baseType: !497, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !562, file: !108, line: 162, baseType: !488, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !562, file: !108, line: 165, baseType: !499, size: 32, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !562, file: !108, line: 168, baseType: !481, size: 32, offset: 224)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !562, file: !108, line: 169, baseType: !481, size: 32, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !562, file: !108, line: 172, baseType: !488, size: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !562, file: !108, line: 173, baseType: !488, size: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !562, file: !108, line: 174, baseType: !488, size: 64, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !562, file: !108, line: 175, baseType: !488, size: 64, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !562, file: !108, line: 178, baseType: !577, size: 64, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !562, file: !108, line: 179, baseType: !527, size: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !562, file: !108, line: 180, baseType: !527, size: 64, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !562, file: !108, line: 181, baseType: !527, size: 64, offset: 768)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !562, file: !108, line: 184, baseType: !524, size: 64, offset: 832)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !562, file: !108, line: 187, baseType: !583, size: 768, offset: 896)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !108, line: 128, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !108, line: 121, size: 768, elements: !585)
!585 = !{!586, !593, !594, !595}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !584, file: !108, line: 124, baseType: !587, size: 192)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !108, line: 101, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !108, line: 95, size: 192, elements: !589)
!589 = !{!590, !591, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !588, file: !108, line: 98, baseType: !524, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !588, file: !108, line: 99, baseType: !524, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !588, file: !108, line: 100, baseType: !524, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !584, file: !108, line: 125, baseType: !587, size: 192, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !584, file: !108, line: 126, baseType: !587, size: 192, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !584, file: !108, line: 127, baseType: !587, size: 192, offset: 576)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !562, file: !108, line: 190, baseType: !597, size: 32, offset: 1664)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !252, line: 49, baseType: !251)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !562, file: !108, line: 193, baseType: !448, size: 64, offset: 1728)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !562, file: !108, line: 196, baseType: !516, size: 32, offset: 1792)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !562, file: !108, line: 199, baseType: !446, size: 64, offset: 1856)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !562, file: !108, line: 200, baseType: !446, size: 64, offset: 1920)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !562, file: !108, line: 201, baseType: !446, size: 64, offset: 1984)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !562, file: !108, line: 204, baseType: !548, size: 64, offset: 2048)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !562, file: !108, line: 207, baseType: !524, size: 64, offset: 2112)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !562, file: !108, line: 208, baseType: !524, size: 64, offset: 2176)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !562, file: !108, line: 211, baseType: !607, size: 256, offset: 2240)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !295, line: 130, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !295, line: 121, size: 256, elements: !609)
!609 = !{!610, !611, !612, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !608, file: !295, line: 124, baseType: !488, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !608, file: !295, line: 125, baseType: !488, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !608, file: !295, line: 128, baseType: !548, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !608, file: !295, line: 129, baseType: !548, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !562, file: !108, line: 212, baseType: !607, size: 256, offset: 2496)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !562, file: !108, line: 213, baseType: !607, size: 256, offset: 2752)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !562, file: !108, line: 216, baseType: !524, size: 64, offset: 3008)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !562, file: !108, line: 217, baseType: !524, size: 64, offset: 3072)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !562, file: !108, line: 218, baseType: !524, size: 64, offset: 3136)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !562, file: !108, line: 221, baseType: !620, size: 32, offset: 3200)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !260, line: 66, baseType: !259)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !562, file: !108, line: 224, baseType: !512, size: 32, offset: 3232)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !562, file: !108, line: 227, baseType: !514, size: 32, offset: 3264)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !562, file: !108, line: 230, baseType: !624, size: 32, offset: 3296)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !295, line: 91, baseType: !294)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !562, file: !108, line: 233, baseType: !626, size: 32, offset: 3328)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !310, line: 99, baseType: !309)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !562, file: !108, line: 236, baseType: !628, size: 32, offset: 3360)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !381, line: 32, baseType: !380)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !562, file: !108, line: 239, baseType: !630, size: 64, offset: 3392)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !562, file: !108, line: 242, baseType: !488, size: 64, offset: 3456)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !562, file: !108, line: 243, baseType: !488, size: 64, offset: 3520)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !562, file: !108, line: 246, baseType: !548, size: 64, offset: 3584)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !562, file: !108, line: 249, baseType: !488, size: 64, offset: 3648)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !562, file: !108, line: 250, baseType: !488, size: 64, offset: 3712)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !562, file: !108, line: 253, baseType: !548, size: 64, offset: 3776)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !562, file: !108, line: 256, baseType: !638, size: 192, offset: 3840)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !639, line: 68, baseType: !640)
!639 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !639, line: 62, size: 192, elements: !641)
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !640, file: !639, line: 65, baseType: !524, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !640, file: !639, line: 66, baseType: !524, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !640, file: !639, line: 67, baseType: !524, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !562, file: !108, line: 259, baseType: !646, size: 512, offset: 4032)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !389, line: 51, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !389, line: 40, size: 512, elements: !648)
!648 = !{!649, !656, !657, !659}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !647, file: !389, line: 43, baseType: !650, size: 192)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !389, line: 38, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !389, line: 32, size: 192, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !651, file: !389, line: 35, baseType: !524, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !651, file: !389, line: 36, baseType: !524, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !651, file: !389, line: 37, baseType: !524, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !647, file: !389, line: 44, baseType: !650, size: 192, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !647, file: !389, line: 47, baseType: !658, size: 32, offset: 384)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !389, line: 30, baseType: !388)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !647, file: !389, line: 50, baseType: !488, size: 64, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !562, file: !108, line: 262, baseType: !661, size: 64, offset: 4544)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !662, line: 26, baseType: !663)
!662 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!481, !666, !668, !671, !448}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !78, line: 150, baseType: !670)
!670 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !78, line: 151, baseType: !673)
!673 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !562, file: !108, line: 265, baseType: !448, size: 64, offset: 4608)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !562, file: !108, line: 266, baseType: !448, size: 64, offset: 4672)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !562, file: !108, line: 267, baseType: !448, size: 64, offset: 4736)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !562, file: !108, line: 270, baseType: !678, size: 64, offset: 4800)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !83, line: 52, baseType: !680)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !83, line: 51, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !562, file: !108, line: 273, baseType: !682, size: 64, offset: 4864)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !78, line: 217, baseType: !684)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !78, line: 217, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !562, file: !108, line: 276, baseType: !686, size: 32768, offset: 4928)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 32768, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 4096)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !562, file: !108, line: 277, baseType: !686, size: 32768, offset: 37696)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !562, file: !108, line: 278, baseType: !686, size: 32768, offset: 70464)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !562, file: !108, line: 281, baseType: !488, size: 64, offset: 103232)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !562, file: !108, line: 282, baseType: !488, size: 64, offset: 103296)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !562, file: !108, line: 285, baseType: !471, size: 448, offset: 103360)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !562, file: !108, line: 288, baseType: !481, size: 32, offset: 103808)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !562, file: !108, line: 291, baseType: !696, size: 64, offset: 103872)
!696 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !548)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !562, file: !108, line: 294, baseType: !483, size: 64, offset: 103936)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !562, file: !108, line: 297, baseType: !699, size: 256, offset: 104000)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !252, line: 40, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !252, line: 27, size: 256, elements: !701)
!701 = !{!702, !703, !704, !707}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !700, file: !252, line: 30, baseType: !446, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !700, file: !252, line: 33, baseType: !488, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !700, file: !252, line: 36, baseType: !705, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !700, file: !252, line: 39, baseType: !488, size: 64, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !562, file: !108, line: 298, baseType: !699, size: 256, offset: 104256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !562, file: !108, line: 299, baseType: !710, size: 64, offset: 104512)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !562, file: !108, line: 302, baseType: !488, size: 64, offset: 104576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !562, file: !108, line: 305, baseType: !488, size: 64, offset: 104640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !562, file: !108, line: 308, baseType: !630, size: 64, offset: 104704)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !562, file: !108, line: 309, baseType: !630, size: 64, offset: 104768)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !108, line: 310, baseType: !630, size: 64, offset: 104832)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !562, file: !108, line: 313, baseType: !717, size: 32, offset: 104896)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !562, file: !108, line: 316, baseType: !481, size: 32, offset: 104928)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !562, file: !108, line: 319, baseType: !527, size: 64, offset: 104960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !562, file: !108, line: 322, baseType: !630, size: 64, offset: 105024)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !562, file: !108, line: 325, baseType: !607, size: 256, offset: 105088)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !562, file: !108, line: 328, baseType: !448, size: 64, offset: 105344)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !562, file: !108, line: 329, baseType: !448, size: 64, offset: 105408)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !562, file: !108, line: 332, baseType: !544, size: 32, offset: 105472)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !562, file: !108, line: 335, baseType: !481, size: 32, offset: 105504)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !562, file: !108, line: 338, baseType: !672, size: 64, offset: 105536)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !562, file: !108, line: 341, baseType: !481, size: 32, offset: 105600)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !562, file: !108, line: 344, baseType: !488, size: 64, offset: 105664)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !562, file: !108, line: 347, baseType: !730, size: 64, offset: 105728)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !731, line: 7, baseType: !732)
!731 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !551, line: 160, baseType: !552)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !562, file: !108, line: 350, baseType: !734, size: 32, offset: 105792)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !562, file: !108, line: 353, baseType: !488, size: 64, offset: 105856)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !494, file: !108, line: 443, baseType: !448, size: 64, offset: 2112)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !494, file: !108, line: 446, baseType: !661, size: 64, offset: 2176)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !494, file: !108, line: 449, baseType: !448, size: 64, offset: 2240)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !494, file: !108, line: 450, baseType: !448, size: 64, offset: 2304)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !494, file: !108, line: 453, baseType: !741, size: 64, offset: 2368)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !742, line: 26, baseType: !743)
!742 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!488, !746, !748, !750}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !494, file: !108, line: 456, baseType: !752, size: 64, offset: 2432)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !754, line: 7, baseType: !755)
!754 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !756, line: 49, size: 1728, elements: !757)
!756 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !773, !775, !776, !777, !779, !780, !782, !786, !789, !791, !794, !797, !798, !799, !800, !801}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !755, file: !756, line: 51, baseType: !460, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !755, file: !756, line: 54, baseType: !446, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !755, file: !756, line: 55, baseType: !446, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !755, file: !756, line: 56, baseType: !446, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !755, file: !756, line: 57, baseType: !446, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !755, file: !756, line: 58, baseType: !446, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !755, file: !756, line: 59, baseType: !446, size: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !755, file: !756, line: 60, baseType: !446, size: 64, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !755, file: !756, line: 61, baseType: !446, size: 64, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !755, file: !756, line: 64, baseType: !446, size: 64, offset: 576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !755, file: !756, line: 65, baseType: !446, size: 64, offset: 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !755, file: !756, line: 66, baseType: !446, size: 64, offset: 704)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !755, file: !756, line: 68, baseType: !771, size: 64, offset: 768)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !756, line: 36, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !755, file: !756, line: 70, baseType: !774, size: 64, offset: 832)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !755, file: !756, line: 72, baseType: !460, size: 32, offset: 896)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !755, file: !756, line: 73, baseType: !460, size: 32, offset: 928)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !755, file: !756, line: 74, baseType: !778, size: 64, offset: 960)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !551, line: 152, baseType: !552)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !755, file: !756, line: 77, baseType: !532, size: 16, offset: 1024)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !755, file: !756, line: 78, baseType: !781, size: 8, offset: 1040)
!781 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !755, file: !756, line: 79, baseType: !783, size: 8, offset: 1048)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 8, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 1)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !755, file: !756, line: 81, baseType: !787, size: 64, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !756, line: 43, baseType: null)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !755, file: !756, line: 89, baseType: !790, size: 64, offset: 1152)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !551, line: 153, baseType: !552)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !755, file: !756, line: 91, baseType: !792, size: 64, offset: 1216)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !756, line: 37, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !755, file: !756, line: 92, baseType: !795, size: 64, offset: 1280)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !756, line: 38, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !755, file: !756, line: 93, baseType: !774, size: 64, offset: 1344)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !755, file: !756, line: 94, baseType: !448, size: 64, offset: 1408)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !755, file: !756, line: 95, baseType: !488, size: 64, offset: 1472)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !755, file: !756, line: 96, baseType: !460, size: 32, offset: 1536)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !755, file: !756, line: 98, baseType: !802, size: 160, offset: 1568)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 160, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 20)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !494, file: !108, line: 459, baseType: !448, size: 64, offset: 2496)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !494, file: !108, line: 462, baseType: !488, size: 64, offset: 2560)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !494, file: !108, line: 465, baseType: !686, size: 32768, offset: 2624)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !494, file: !108, line: 466, baseType: !686, size: 32768, offset: 35392)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !494, file: !108, line: 467, baseType: !686, size: 32768, offset: 68160)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !494, file: !108, line: 468, baseType: !686, size: 32768, offset: 100928)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !494, file: !108, line: 471, baseType: !481, size: 32, offset: 133696)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !494, file: !108, line: 474, baseType: !446, size: 64, offset: 133760)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !494, file: !108, line: 477, baseType: !488, size: 64, offset: 133824)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !494, file: !108, line: 478, baseType: !488, size: 64, offset: 133888)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !494, file: !108, line: 481, baseType: !527, size: 64, offset: 133952)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !494, file: !108, line: 484, baseType: !488, size: 64, offset: 134016)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !494, file: !108, line: 487, baseType: !818, size: 32, offset: 134080)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !494, file: !108, line: 490, baseType: !527, size: 64, offset: 134112)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !494, file: !108, line: 493, baseType: !448, size: 64, offset: 134208)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !494, file: !108, line: 496, baseType: !481, size: 32, offset: 134272)
!822 = !DILocalVariable(name: "status", scope: !466, file: !457, line: 76, type: !481)
!823 = !DILocation(line: 0, scope: !466, inlinedAt: !824)
!824 = distinct !DILocation(line: 92, column: 10, scope: !456)
!825 = !DILocation(line: 78, column: 21, scope: !466, inlinedAt: !824)
!826 = !{!827, !827, i64 0}
!827 = !{!"any pointer", !828, i64 0}
!828 = !{!"omnipotent char", !829, i64 0}
!829 = !{!"Simple C/C++ TBAA"}
!830 = !DILocation(line: 78, column: 3, scope: !466, inlinedAt: !824)
!831 = !DILocation(line: 79, column: 13, scope: !466, inlinedAt: !824)
!832 = !DILocation(line: 80, column: 14, scope: !466, inlinedAt: !824)
!833 = !DILocation(line: 81, column: 10, scope: !466, inlinedAt: !824)
!834 = !DILocation(line: 83, column: 14, scope: !466, inlinedAt: !824)
!835 = !DILocation(line: 84, column: 13, scope: !466, inlinedAt: !824)
!836 = !DILocation(line: 85, column: 3, scope: !466, inlinedAt: !824)
!837 = !DILocation(line: 86, column: 17, scope: !466, inlinedAt: !824)
!838 = !DILocation(line: 86, column: 10, scope: !466, inlinedAt: !824)
!839 = !DILocation(line: 92, column: 3, scope: !456)
!840 = !DISubprogram(name: "MagickCoreGenesis", scope: !841, file: !841, line: 146, type: !842, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !845)
!841 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!842 = !DISubroutineType(types: !843)
!843 = !{null, !666, !844}
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!845 = !{}
!846 = !DISubprogram(name: "AcquireExceptionInfo", scope: !4, file: !4, line: 146, type: !847, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !845)
!847 = !DISubroutineType(types: !848)
!848 = !{!470}
!849 = !DISubprogram(name: "AcquireImageInfo", scope: !108, file: !108, line: 520, type: !850, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !845)
!850 = !DISubroutineType(types: !851)
!851 = !{!492}
!852 = !DISubprogram(name: "MagickCommandGenesis", scope: !853, file: !853, line: 29, type: !854, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !845)
!853 = !DIFile(filename: "apps/538.imagick_r/src/wand/mogrify.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "943be93ef38360e0296d7d64127ec6f7")
!854 = !DISubroutineType(types: !855)
!855 = !{!481, !492, !856, !460, !445, !445, !470}
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickCommand", file: !853, line: 26, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!481, !492, !460, !445, !445, !470}
!860 = !DISubprogram(name: "DestroyImageInfo", scope: !108, file: !108, line: 522, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !845)
!861 = !DISubroutineType(types: !862)
!862 = !{!492, !492}
!863 = !DISubprogram(name: "DestroyExceptionInfo", scope: !4, file: !4, line: 148, type: !864, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !845)
!864 = !DISubroutineType(types: !865)
!865 = !{!470, !470}
!866 = !DISubprogram(name: "MagickCoreTerminus", scope: !841, file: !841, line: 147, type: !867, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !845)
!867 = !DISubroutineType(types: !868)
!868 = !{null}
