; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r/llvm-ir/544.nab_r_bc/src/database.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/database.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DICTt = type { i32, ptr }
%struct.DICT_ENTRYt = type { ptr, ptr }
%struct.DATABASEt = type { i32, ptr, [256 x i8], i32, i32, [10 x [256 x i8]], i8, ptr, i32, [1000 x i8], i32, [256 x i8], i32 }
%struct.ENTRYt = type { i64, [256 x i8], i32, i32 }

@GiDBLastError = dso_local local_unnamed_addr global i32 0, align 4, !dbg !0
@.str = private unnamed_addr constant [10 x i8] c"!%s %s %s\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"single\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"array\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"table\00", align 1
@.str.4 = private unnamed_addr constant [17 x i8] c"Unknown modifier\00", align 1
@.str.8 = private unnamed_addr constant [19 x i8] c"Unknown entry type\00", align 1
@.str.9 = private unnamed_addr constant [31 x i8] c"Tried to parse:%s: as a header\00", align 1
@.str.10 = private unnamed_addr constant [9 x i8] c"t9423848\00", align 1
@.str.11 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.12 = private unnamed_addr constant [28 x i8] c"Could not open scratch file\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GiDBLastError", scope: !2, file: !6, line: 473, type: !12, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !127, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/database.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r", checksumkind: CSK_MD5, checksum: "d16d62750ad9eb602517bad24dc3d4ab")
!4 = !{!5, !22, !14, !19, !23, !25, !26, !41, !124, !126}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "DICT", file: !6, line: 268, baseType: !7)
!6 = !DIFile(filename: "apps/544.nab_r/src/database.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d16d62750ad9eb602517bad24dc3d4ab")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "DICTt", file: !6, line: 266, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 263, size: 128, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "iEntries", scope: !9, file: !6, line: 264, baseType: !12, size: 32)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "dePEntries", scope: !9, file: !6, line: 265, baseType: !14, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "DICT_ENTRYt", file: !6, line: 261, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 258, size: 128, elements: !17)
!17 = !{!18, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "cPKey", scope: !16, file: !6, line: 259, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "vPData", scope: !16, file: !6, line: 260, baseType: !22, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENTRY", file: !27, line: 57, baseType: !28)
!27 = !DIFile(filename: "apps/544.nab_r/src/database.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d8cc1ae4cf951fbe7cfd9585ec1cbb55")
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENTRYt", file: !27, line: 55, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 50, size: 2176, elements: !31)
!31 = !{!32, !34, !39, !40}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "lFileOffset", scope: !30, file: !27, line: 51, baseType: !33, size: 64)
!33 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "sName", scope: !30, file: !27, line: 52, baseType: !35, size: 2048, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !27, line: 48, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "iType", scope: !30, file: !27, line: 53, baseType: !12, size: 32, offset: 2112)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "iRows", scope: !30, file: !27, line: 54, baseType: !12, size: 32, offset: 2144)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATABASE", file: !27, line: 84, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATABASEt", file: !27, line: 82, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 65, size: 33024, elements: !45)
!45 = !{!46, !47, !106, !107, !108, !109, !113, !115, !116, !117, !121, !122, !123}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "iAccessMode", scope: !44, file: !27, line: 66, baseType: !12, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fDataBase", scope: !44, file: !27, line: 67, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !50, line: 7, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !69, !71, !72, !73, !76, !78, !80, !84, !87, !89, !92, !95, !96, !97, !101, !102}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !51, file: !52, line: 51, baseType: !12, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !51, file: !52, line: 54, baseType: !19, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !51, file: !52, line: 55, baseType: !19, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !51, file: !52, line: 56, baseType: !19, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !51, file: !52, line: 57, baseType: !19, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !51, file: !52, line: 58, baseType: !19, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !51, file: !52, line: 59, baseType: !19, size: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !51, file: !52, line: 60, baseType: !19, size: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !51, file: !52, line: 61, baseType: !19, size: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !51, file: !52, line: 64, baseType: !19, size: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !51, file: !52, line: 65, baseType: !19, size: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !51, file: !52, line: 66, baseType: !19, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !51, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !52, line: 36, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !51, file: !52, line: 70, baseType: !70, size: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !51, file: !52, line: 72, baseType: !12, size: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !51, file: !52, line: 73, baseType: !12, size: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !51, file: !52, line: 74, baseType: !74, size: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 152, baseType: !33)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !51, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !51, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !51, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !51, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !52, line: 43, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !51, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !75, line: 153, baseType: !33)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !51, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !52, line: 37, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !51, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !52, line: 38, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !51, file: !52, line: 93, baseType: !70, size: 64, offset: 1344)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !51, file: !52, line: 94, baseType: !22, size: 64, offset: 1408)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !51, file: !52, line: 95, baseType: !98, size: 64, offset: 1472)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !99, line: 46, baseType: !100)
!99 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!100 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !51, file: !52, line: 96, baseType: !12, size: 32, offset: 1536)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !51, file: !52, line: 98, baseType: !103, size: 160, offset: 1568)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 20)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "sFileName", scope: !44, file: !27, line: 68, baseType: !35, size: 2048, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "iOpenMode", scope: !44, file: !27, line: 69, baseType: !12, size: 32, offset: 2176)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "iPrefix", scope: !44, file: !27, line: 70, baseType: !12, size: 32, offset: 2208)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "saPrefixStack", scope: !44, file: !27, line: 71, baseType: !110, size: 20480, offset: 2240)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 20480, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 10)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "bCompactFileAtClose", scope: !44, file: !27, line: 72, baseType: !114, size: 8, offset: 22720)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !27, line: 47, baseType: !20)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "dEntries", scope: !44, file: !27, line: 73, baseType: !22, size: 64, offset: 22784)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "iCurrentLine", scope: !44, file: !27, line: 74, baseType: !12, size: 32, offset: 22848)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "sLookAhead", scope: !44, file: !27, line: 75, baseType: !118, size: 8000, offset: 22880)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8000, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 1000)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "iLastSequentialOperation", scope: !44, file: !27, line: 76, baseType: !12, size: 32, offset: 30880)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sLoopPrefix", scope: !44, file: !27, line: 79, baseType: !35, size: 2048, offset: 30912)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dlEntryLoop", scope: !44, file: !27, line: 80, baseType: !12, size: 32, offset: 32960)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!127 = !{!0}
!128 = !{i32 7, !"Dwarf Version", i32 5}
!129 = !{i32 2, !"Debug Info Version", i32 3}
!130 = !{i32 1, !"wchar_size", i32 4}
!131 = !{i32 7, !"PIC Level", i32 2}
!132 = !{i32 7, !"PIE Level", i32 2}
!133 = !{i32 7, !"uwtable", i32 2}
!134 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!135 = distinct !DISubprogram(name: "sDBRemoveSpaces", scope: !6, file: !6, line: 115, type: !136, scopeLine: 118, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !138)
!136 = !DISubroutineType(types: !137)
!137 = !{!19, !19, !19}
!138 = !{!139, !140, !141}
!139 = !DILocalVariable(name: "sIn", arg: 1, scope: !135, file: !6, line: 116, type: !19)
!140 = !DILocalVariable(name: "sOut", arg: 2, scope: !135, file: !6, line: 117, type: !19)
!141 = !DILocalVariable(name: "sWrite", scope: !135, file: !6, line: 119, type: !19)
!142 = !DILocation(line: 0, scope: !135)
!143 = !DILocation(line: 125, column: 5, scope: !135)
!144 = !DILocation(line: 125, column: 14, scope: !135)
!145 = !{!146, !146, i64 0}
!146 = !{!"omnipotent char", !147, i64 0}
!147 = !{!"Simple C/C++ TBAA"}
!148 = !DILocation(line: 126, column: 36, scope: !149)
!149 = distinct !DILexicalBlock(scope: !150, file: !6, line: 126, column: 14)
!150 = distinct !DILexicalBlock(scope: !135, file: !6, line: 125, column: 29)
!151 = !DILocation(line: 126, column: 39, scope: !149)
!152 = !DILocation(line: 126, column: 28, scope: !149)
!153 = !DILocation(line: 127, column: 12, scope: !150)
!154 = distinct !{!154, !143, !155, !156, !157}
!155 = !DILocation(line: 128, column: 5, scope: !135)
!156 = !{!"llvm.loop.mustprogress"}
!157 = !{!"llvm.loop.unroll.disable"}
!158 = !DILocation(line: 129, column: 15, scope: !135)
!159 = !DILocation(line: 130, column: 5, scope: !135)
!160 = distinct !DISubprogram(name: "sDBRemoveControlAndPadding", scope: !6, file: !6, line: 148, type: !136, scopeLine: 151, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !161)
!161 = !{!162, !163, !164, !165, !166}
!162 = !DILocalVariable(name: "sRaw", arg: 1, scope: !160, file: !6, line: 149, type: !19)
!163 = !DILocalVariable(name: "sResult", arg: 2, scope: !160, file: !6, line: 150, type: !19)
!164 = !DILocalVariable(name: "sCur", scope: !160, file: !6, line: 152, type: !19)
!165 = !DILocalVariable(name: "sResultCur", scope: !160, file: !6, line: 153, type: !19)
!166 = !DILabel(scope: !160, name: "DONE", file: !6, line: 184)
!167 = !DILocation(line: 0, scope: !160)
!168 = !DILocation(line: 159, column: 5, scope: !160)
!169 = !DILocation(line: 159, column: 14, scope: !160)
!170 = !DILocation(line: 159, column: 19, scope: !160)
!171 = !DILocation(line: 159, column: 27, scope: !160)
!172 = !DILocation(line: 159, column: 49, scope: !160)
!173 = distinct !{!173, !168, !172, !156, !157}
!174 = !DILocation(line: 160, column: 16, scope: !175)
!175 = distinct !DILexicalBlock(scope: !160, file: !6, line: 160, column: 10)
!176 = !DILocation(line: 160, column: 10, scope: !160)
!177 = !DILocation(line: 168, column: 20, scope: !178)
!178 = distinct !DILexicalBlock(scope: !179, file: !6, line: 168, column: 14)
!179 = distinct !DILexicalBlock(scope: !160, file: !6, line: 167, column: 27)
!180 = !DILocation(line: 168, column: 14, scope: !179)
!181 = !DILocation(line: 169, column: 25, scope: !182)
!182 = distinct !DILexicalBlock(scope: !178, file: !6, line: 168, column: 29)
!183 = !DILocation(line: 170, column: 23, scope: !182)
!184 = !DILocation(line: 171, column: 9, scope: !182)
!185 = !DILocation(line: 172, column: 13, scope: !179)
