; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/common/deblock.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/deblock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [129 x ptr], i32, i32, i32, i32, i32, %struct.anon.2, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [92 x ptr], [92 x [4 x ptr]], ptr, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, ptr, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], ptr, [2 x [3 x ptr]], [2 x ptr], [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], ptr, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, ptr, [8 x i8] }

!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 26, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !43, line: 42, baseType: !7)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!44 = !{!45}
!45 = !DISubrange(count: 6)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !41, line: 25, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !43, line: 40, baseType: !48)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !51, line: 89, baseType: !52)
!51 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !51, line: 89, size: 32, elements: !53)
!53 = !{!54, !55, !59}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !52, file: !51, line: 89, baseType: !40, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !52, file: !51, line: 89, baseType: !56, size: 32)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 2)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !52, file: !51, line: 89, baseType: !60, size: 32)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !41, line: 24, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !43, line: 38, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!65}
!65 = !DISubrange(count: 4)
!66 = !{!0, !67, !74}
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "i_beta_table", scope: !2, file: !69, line: 79, type: !70, isLocal: true, isDefinition: true)
!69 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/deblock.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "6a351fa075ae4fa4953b93e96f39a58f")
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 608, elements: !72)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!72 = !{!73}
!73 = !DISubrange(count: 76)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "i_tc0_table", scope: !2, file: !69, line: 90, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2432, elements: !82)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !79, line: 24, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !43, line: 37, baseType: !81)
!81 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!82 = !{!73, !65}
!83 = !{i32 7, !"Dwarf Version", i32 5}
!84 = !{i32 2, !"Debug Info Version", i32 3}
!85 = !{i32 1, !"wchar_size", i32 4}
!86 = !{i32 7, !"PIC Level", i32 2}
!87 = !{i32 7, !"PIE Level", i32 2}
!88 = !{i32 7, !"uwtable", i32 2}
!89 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!90 = distinct !DISubprogram(name: "x264_frame_deblock_row", scope: !69, file: !69, line: 339, type: !91, scopeLine: 340, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1386)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93, !104}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !95, line: 46, baseType: !96)
!95 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !51, line: 381, size: 266752, elements: !97)
!97 = !{!98, !268, !272, !273, !274, !275, !276, !277, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !413, !415, !440, !442, !443, !444, !448, !452, !453, !454, !458, !462, !463, !464, !469, !472, !473, !551, !568, !729, !730, !731, !732, !736, !737, !738, !739, !740, !741, !742, !757, !950, !954, !1015, !1018, !1020, !1022, !1023, !1026, !1031, !1040, !1041, !1049, !1051, !1056, !1132, !1218, !1262, !1284, !1333, !1362}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !96, file: !51, line: 384, baseType: !99, size: 5632)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !95, line: 376, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !95, line: 176, size: 5632, elements: !101)
!101 = !{!102, !103, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !146, !150, !151, !152, !153, !157, !158, !173, !174, !175, !176, !177, !206, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !100, file: !95, line: 179, baseType: !7, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !100, file: !95, line: 180, baseType: !104, size: 32, offset: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !100, file: !95, line: 181, baseType: !104, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !100, file: !95, line: 182, baseType: !104, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !100, file: !95, line: 183, baseType: !104, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !100, file: !95, line: 186, baseType: !104, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !100, file: !95, line: 187, baseType: !104, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !100, file: !95, line: 188, baseType: !104, size: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !100, file: !95, line: 189, baseType: !104, size: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !100, file: !95, line: 190, baseType: !104, size: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !100, file: !95, line: 198, baseType: !104, size: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !100, file: !95, line: 215, baseType: !115, size: 288, offset: 352)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !95, line: 200, size: 288, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !115, file: !95, line: 203, baseType: !104, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !115, file: !95, line: 204, baseType: !104, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !115, file: !95, line: 206, baseType: !104, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !115, file: !95, line: 209, baseType: !104, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !115, file: !95, line: 210, baseType: !104, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !115, file: !95, line: 211, baseType: !104, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !115, file: !95, line: 212, baseType: !104, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !115, file: !95, line: 213, baseType: !104, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !115, file: !95, line: 214, baseType: !104, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !100, file: !95, line: 218, baseType: !104, size: 32, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !100, file: !95, line: 219, baseType: !104, size: 32, offset: 672)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !100, file: !95, line: 220, baseType: !104, size: 32, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !100, file: !95, line: 221, baseType: !104, size: 32, offset: 736)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !100, file: !95, line: 222, baseType: !104, size: 32, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !100, file: !95, line: 224, baseType: !104, size: 32, offset: 800)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !100, file: !95, line: 225, baseType: !104, size: 32, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !100, file: !95, line: 226, baseType: !104, size: 32, offset: 864)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !100, file: !95, line: 227, baseType: !104, size: 32, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !100, file: !95, line: 229, baseType: !104, size: 32, offset: 928)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !100, file: !95, line: 230, baseType: !104, size: 32, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !100, file: !95, line: 231, baseType: !104, size: 32, offset: 992)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !100, file: !95, line: 233, baseType: !104, size: 32, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !100, file: !95, line: 234, baseType: !104, size: 32, offset: 1056)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !100, file: !95, line: 236, baseType: !104, size: 32, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !100, file: !95, line: 237, baseType: !104, size: 32, offset: 1120)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !100, file: !95, line: 239, baseType: !104, size: 32, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !100, file: !95, line: 240, baseType: !144, size: 64, offset: 1216)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !100, file: !95, line: 241, baseType: !147, size: 128, offset: 1280)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 16)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !100, file: !95, line: 242, baseType: !147, size: 128, offset: 1408)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !100, file: !95, line: 243, baseType: !147, size: 128, offset: 1536)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !100, file: !95, line: 244, baseType: !147, size: 128, offset: 1664)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !100, file: !95, line: 245, baseType: !154, size: 512, offset: 1792)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !100, file: !95, line: 246, baseType: !154, size: 512, offset: 2304)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !100, file: !95, line: 249, baseType: !159, size: 64, offset: 2816)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !162, !104, !163, !165}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !167)
!167 = !{!168, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !166, file: !169, baseType: !7, size: 32)
!169 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/deblock.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !166, file: !169, baseType: !7, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !166, file: !169, baseType: !162, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !166, file: !169, baseType: !162, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !100, file: !95, line: 250, baseType: !162, size: 64, offset: 2880)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !100, file: !95, line: 251, baseType: !104, size: 32, offset: 2944)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !100, file: !95, line: 252, baseType: !104, size: 32, offset: 2976)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !100, file: !95, line: 253, baseType: !144, size: 64, offset: 3008)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !100, file: !95, line: 287, baseType: !178, size: 800, offset: 3072)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !95, line: 256, size: 800, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !200, !201, !202, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !178, file: !95, line: 258, baseType: !7, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !178, file: !95, line: 259, baseType: !7, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !178, file: !95, line: 261, baseType: !104, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !178, file: !95, line: 262, baseType: !104, size: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !178, file: !95, line: 263, baseType: !104, size: 32, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !178, file: !95, line: 264, baseType: !104, size: 32, offset: 160)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !178, file: !95, line: 265, baseType: !104, size: 32, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !178, file: !95, line: 267, baseType: !104, size: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !178, file: !95, line: 268, baseType: !104, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !178, file: !95, line: 269, baseType: !104, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !178, file: !95, line: 270, baseType: !104, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !178, file: !95, line: 271, baseType: !104, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !178, file: !95, line: 272, baseType: !104, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !178, file: !95, line: 273, baseType: !104, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !178, file: !95, line: 274, baseType: !104, size: 32, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !178, file: !95, line: 275, baseType: !104, size: 32, offset: 480)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !178, file: !95, line: 276, baseType: !104, size: 32, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !178, file: !95, line: 277, baseType: !104, size: 32, offset: 544)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !178, file: !95, line: 278, baseType: !199, size: 32, offset: 576)
!199 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !178, file: !95, line: 279, baseType: !199, size: 32, offset: 608)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !178, file: !95, line: 280, baseType: !104, size: 32, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !178, file: !95, line: 283, baseType: !203, size: 64, offset: 672)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 64, elements: !57)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !178, file: !95, line: 285, baseType: !104, size: 32, offset: 736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !178, file: !95, line: 286, baseType: !104, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !100, file: !95, line: 327, baseType: !207, size: 1152, offset: 3904)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !95, line: 290, size: 1152, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !246, !247}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !207, file: !95, line: 292, baseType: !104, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !207, file: !95, line: 294, baseType: !104, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !207, file: !95, line: 295, baseType: !104, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !207, file: !95, line: 296, baseType: !104, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !207, file: !95, line: 297, baseType: !104, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !207, file: !95, line: 299, baseType: !104, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !207, file: !95, line: 300, baseType: !199, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !207, file: !95, line: 301, baseType: !199, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !207, file: !95, line: 302, baseType: !199, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !207, file: !95, line: 303, baseType: !104, size: 32, offset: 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !207, file: !95, line: 304, baseType: !104, size: 32, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !207, file: !95, line: 305, baseType: !199, size: 32, offset: 352)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !207, file: !95, line: 306, baseType: !199, size: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !207, file: !95, line: 307, baseType: !199, size: 32, offset: 416)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !207, file: !95, line: 309, baseType: !104, size: 32, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !207, file: !95, line: 310, baseType: !199, size: 32, offset: 480)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !207, file: !95, line: 311, baseType: !104, size: 32, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !207, file: !95, line: 312, baseType: !104, size: 32, offset: 544)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !207, file: !95, line: 315, baseType: !104, size: 32, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !207, file: !95, line: 316, baseType: !144, size: 64, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !207, file: !95, line: 317, baseType: !104, size: 32, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !207, file: !95, line: 318, baseType: !144, size: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !207, file: !95, line: 321, baseType: !199, size: 32, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !207, file: !95, line: 322, baseType: !199, size: 32, offset: 864)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !207, file: !95, line: 323, baseType: !199, size: 32, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !207, file: !95, line: 324, baseType: !235, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !95, line: 174, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 167, size: 256, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !237, file: !95, line: 169, baseType: !104, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !237, file: !95, line: 169, baseType: !104, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !237, file: !95, line: 170, baseType: !104, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !237, file: !95, line: 171, baseType: !104, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !237, file: !95, line: 172, baseType: !199, size: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !237, file: !95, line: 173, baseType: !245, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !207, file: !95, line: 325, baseType: !104, size: 32, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !207, file: !95, line: 326, baseType: !144, size: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !100, file: !95, line: 330, baseType: !104, size: 32, offset: 5056)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !100, file: !95, line: 331, baseType: !104, size: 32, offset: 5088)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !100, file: !95, line: 332, baseType: !104, size: 32, offset: 5120)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !100, file: !95, line: 334, baseType: !104, size: 32, offset: 5152)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !100, file: !95, line: 335, baseType: !104, size: 32, offset: 5184)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !100, file: !95, line: 336, baseType: !40, size: 32, offset: 5216)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !100, file: !95, line: 337, baseType: !40, size: 32, offset: 5248)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !100, file: !95, line: 338, baseType: !40, size: 32, offset: 5280)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !100, file: !95, line: 339, baseType: !40, size: 32, offset: 5312)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !100, file: !95, line: 340, baseType: !104, size: 32, offset: 5344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !100, file: !95, line: 344, baseType: !104, size: 32, offset: 5376)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !100, file: !95, line: 356, baseType: !104, size: 32, offset: 5408)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !100, file: !95, line: 364, baseType: !104, size: 32, offset: 5440)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !100, file: !95, line: 367, baseType: !104, size: 32, offset: 5472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !100, file: !95, line: 368, baseType: !104, size: 32, offset: 5504)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !100, file: !95, line: 369, baseType: !104, size: 32, offset: 5536)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !100, file: !95, line: 375, baseType: !265, size: 64, offset: 5568)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !162}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !96, file: !51, line: 386, baseType: !269, size: 8256, offset: 5632)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8256, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 129)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !96, file: !51, line: 387, baseType: !104, size: 32, offset: 13888)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !96, file: !51, line: 388, baseType: !104, size: 32, offset: 13920)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !96, file: !51, line: 389, baseType: !104, size: 32, offset: 13952)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !96, file: !51, line: 390, baseType: !104, size: 32, offset: 13984)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !96, file: !51, line: 391, baseType: !104, size: 32, offset: 14016)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !96, file: !51, line: 402, baseType: !278, size: 576, offset: 14080)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !51, line: 394, size: 576, elements: !279)
!279 = !{!280, !281, !282, !292, !293, !294}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !278, file: !51, line: 396, baseType: !104, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !278, file: !51, line: 397, baseType: !104, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !278, file: !51, line: 398, baseType: !283, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !95, line: 604, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 593, size: 192, elements: !286)
!286 = !{!287, !288, !289, !290}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !285, file: !95, line: 595, baseType: !104, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !285, file: !95, line: 596, baseType: !104, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !285, file: !95, line: 599, baseType: !104, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !285, file: !95, line: 603, baseType: !291, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !278, file: !51, line: 399, baseType: !104, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !278, file: !51, line: 400, baseType: !291, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !278, file: !51, line: 401, baseType: !295, size: 320, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !296, line: 56, baseType: !297)
!296 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !296, line: 47, size: 320, elements: !298)
!298 = !{!299, !300, !301, !302, !306, !307}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !297, file: !296, line: 49, baseType: !291, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !297, file: !296, line: 50, baseType: !291, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !297, file: !296, line: 51, baseType: !291, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !297, file: !296, line: 53, baseType: !303, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !304, line: 87, baseType: !305)
!304 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!305 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !297, file: !296, line: 54, baseType: !104, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !297, file: !296, line: 55, baseType: !104, size: 32, offset: 288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !96, file: !51, line: 404, baseType: !291, size: 64, offset: 14656)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !96, file: !51, line: 405, baseType: !104, size: 32, offset: 14720)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !96, file: !51, line: 410, baseType: !104, size: 32, offset: 14752)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !96, file: !51, line: 411, baseType: !104, size: 32, offset: 14784)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !96, file: !51, line: 413, baseType: !104, size: 32, offset: 14816)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !96, file: !51, line: 415, baseType: !104, size: 32, offset: 14848)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !96, file: !51, line: 416, baseType: !104, size: 32, offset: 14880)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !96, file: !51, line: 418, baseType: !104, size: 32, offset: 14912)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !96, file: !51, line: 419, baseType: !104, size: 32, offset: 14944)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !96, file: !51, line: 420, baseType: !104, size: 32, offset: 14976)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !96, file: !51, line: 421, baseType: !104, size: 32, offset: 15008)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !96, file: !51, line: 422, baseType: !104, size: 32, offset: 15040)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !96, file: !51, line: 424, baseType: !104, size: 32, offset: 15072)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !96, file: !51, line: 425, baseType: !104, size: 32, offset: 15104)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !96, file: !51, line: 427, baseType: !104, size: 32, offset: 15136)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !96, file: !51, line: 430, baseType: !324, size: 10400, offset: 15168)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 10400, elements: !411)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !326, line: 154, baseType: !327)
!326 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 52, size: 10400, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !346, !347, !348, !349, !350, !351, !352, !353, !354, !361, !362, !410}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !327, file: !326, line: 54, baseType: !104, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !327, file: !326, line: 56, baseType: !104, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !327, file: !326, line: 57, baseType: !104, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !327, file: !326, line: 59, baseType: !104, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !327, file: !326, line: 60, baseType: !104, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !327, file: !326, line: 61, baseType: !104, size: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !327, file: !326, line: 63, baseType: !104, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !327, file: !326, line: 65, baseType: !104, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !327, file: !326, line: 67, baseType: !104, size: 32, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !327, file: !326, line: 69, baseType: !104, size: 32, offset: 288)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !327, file: !326, line: 70, baseType: !104, size: 32, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !327, file: !326, line: 71, baseType: !104, size: 32, offset: 352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !327, file: !326, line: 72, baseType: !104, size: 32, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !327, file: !326, line: 73, baseType: !343, size: 8192, offset: 416)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 8192, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !327, file: !326, line: 75, baseType: !104, size: 32, offset: 8608)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !327, file: !326, line: 76, baseType: !104, size: 32, offset: 8640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !327, file: !326, line: 77, baseType: !104, size: 32, offset: 8672)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !327, file: !326, line: 78, baseType: !104, size: 32, offset: 8704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !327, file: !326, line: 79, baseType: !104, size: 32, offset: 8736)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !327, file: !326, line: 80, baseType: !104, size: 32, offset: 8768)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !327, file: !326, line: 81, baseType: !104, size: 32, offset: 8800)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !327, file: !326, line: 83, baseType: !104, size: 32, offset: 8832)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !327, file: !326, line: 90, baseType: !355, size: 128, offset: 8864)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !326, line: 84, size: 128, elements: !356)
!356 = !{!357, !358, !359, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !355, file: !326, line: 86, baseType: !104, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !355, file: !326, line: 87, baseType: !104, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !355, file: !326, line: 88, baseType: !104, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !355, file: !326, line: 89, baseType: !104, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !327, file: !326, line: 92, baseType: !104, size: 32, offset: 8992)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !327, file: !326, line: 150, baseType: !363, size: 1344, offset: 9024)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !326, line: 93, size: 1344, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !363, file: !326, line: 95, baseType: !104, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !363, file: !326, line: 96, baseType: !104, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !363, file: !326, line: 97, baseType: !104, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !363, file: !326, line: 99, baseType: !104, size: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !363, file: !326, line: 100, baseType: !104, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !363, file: !326, line: 102, baseType: !104, size: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !363, file: !326, line: 103, baseType: !104, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !363, file: !326, line: 104, baseType: !104, size: 32, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !363, file: !326, line: 105, baseType: !104, size: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !363, file: !326, line: 106, baseType: !104, size: 32, offset: 288)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !363, file: !326, line: 107, baseType: !104, size: 32, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !363, file: !326, line: 108, baseType: !104, size: 32, offset: 352)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !363, file: !326, line: 110, baseType: !104, size: 32, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !363, file: !326, line: 111, baseType: !104, size: 32, offset: 416)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !363, file: !326, line: 112, baseType: !104, size: 32, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !363, file: !326, line: 114, baseType: !104, size: 32, offset: 480)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !363, file: !326, line: 115, baseType: !40, size: 32, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !363, file: !326, line: 116, baseType: !40, size: 32, offset: 544)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !363, file: !326, line: 117, baseType: !104, size: 32, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !363, file: !326, line: 119, baseType: !104, size: 32, offset: 608)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !363, file: !326, line: 120, baseType: !104, size: 32, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !363, file: !326, line: 137, baseType: !387, size: 384, offset: 672)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !363, file: !326, line: 122, size: 384, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !387, file: !326, line: 124, baseType: !104, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !387, file: !326, line: 125, baseType: !104, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !387, file: !326, line: 126, baseType: !104, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !387, file: !326, line: 127, baseType: !104, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !387, file: !326, line: 128, baseType: !104, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !387, file: !326, line: 129, baseType: !104, size: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !387, file: !326, line: 130, baseType: !104, size: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !387, file: !326, line: 131, baseType: !104, size: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !387, file: !326, line: 133, baseType: !104, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !387, file: !326, line: 134, baseType: !104, size: 32, offset: 288)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !387, file: !326, line: 135, baseType: !104, size: 32, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !387, file: !326, line: 136, baseType: !104, size: 32, offset: 352)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !363, file: !326, line: 139, baseType: !104, size: 32, offset: 1056)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !363, file: !326, line: 140, baseType: !104, size: 32, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !363, file: !326, line: 141, baseType: !104, size: 32, offset: 1120)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !363, file: !326, line: 142, baseType: !104, size: 32, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !363, file: !326, line: 143, baseType: !104, size: 32, offset: 1184)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !363, file: !326, line: 144, baseType: !104, size: 32, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !363, file: !326, line: 145, baseType: !104, size: 32, offset: 1248)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !363, file: !326, line: 146, baseType: !104, size: 32, offset: 1280)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !363, file: !326, line: 147, baseType: !104, size: 32, offset: 1312)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !327, file: !326, line: 152, baseType: !104, size: 32, offset: 10368)
!411 = !{!412}
!412 = !DISubrange(count: 1)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !96, file: !51, line: 431, baseType: !414, size: 64, offset: 25600)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !96, file: !51, line: 432, baseType: !416, size: 960, offset: 25664)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 960, elements: !411)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !326, line: 186, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 156, size: 960, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !418, file: !326, line: 158, baseType: !104, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !418, file: !326, line: 159, baseType: !104, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !418, file: !326, line: 161, baseType: !104, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !418, file: !326, line: 163, baseType: !104, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !418, file: !326, line: 164, baseType: !104, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !418, file: !326, line: 166, baseType: !104, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !418, file: !326, line: 167, baseType: !104, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !418, file: !326, line: 169, baseType: !104, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !418, file: !326, line: 170, baseType: !104, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !418, file: !326, line: 172, baseType: !104, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !418, file: !326, line: 173, baseType: !104, size: 32, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !418, file: !326, line: 175, baseType: !104, size: 32, offset: 352)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !418, file: !326, line: 177, baseType: !104, size: 32, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !418, file: !326, line: 178, baseType: !104, size: 32, offset: 416)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !418, file: !326, line: 179, baseType: !104, size: 32, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !418, file: !326, line: 181, baseType: !104, size: 32, offset: 480)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !418, file: !326, line: 183, baseType: !104, size: 32, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !418, file: !326, line: 184, baseType: !438, size: 384, offset: 576)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 384, elements: !44)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !96, file: !51, line: 433, baseType: !441, size: 64, offset: 26624)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !96, file: !51, line: 434, baseType: !104, size: 32, offset: 26688)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !96, file: !51, line: 437, baseType: !104, size: 32, offset: 26720)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !96, file: !51, line: 440, baseType: !445, size: 256, offset: 26752)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 256, elements: !64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 512, elements: !148)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !96, file: !51, line: 441, baseType: !449, size: 128, offset: 27008)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 128, elements: !57)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2048, elements: !155)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !96, file: !51, line: 443, baseType: !445, size: 256, offset: 27136)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !96, file: !51, line: 444, baseType: !449, size: 128, offset: 27392)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !96, file: !51, line: 446, baseType: !455, size: 256, offset: 27520)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 256, elements: !64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 256, elements: !148)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !96, file: !51, line: 447, baseType: !459, size: 128, offset: 27776)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 128, elements: !57)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1024, elements: !155)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !96, file: !51, line: 448, baseType: !455, size: 256, offset: 27904)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !96, file: !51, line: 449, baseType: !459, size: 128, offset: 28160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !96, file: !51, line: 454, baseType: !465, size: 5888, offset: 28288)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 5888, elements: !467)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!467 = !{!468}
!468 = !DISubrange(count: 92)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !96, file: !51, line: 455, baseType: !470, size: 23552, offset: 34176)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 23552, elements: !471)
!471 = !{!468, !65}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !96, file: !51, line: 457, baseType: !439, size: 64, offset: 57728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !96, file: !51, line: 460, baseType: !474, size: 53376, offset: 57856)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !51, line: 364, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 302, size: 53376, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !505, !535, !536, !537, !543, !544, !545, !546, !547, !548, !549, !550}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !475, file: !51, line: 304, baseType: !414, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !475, file: !51, line: 305, baseType: !441, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !475, file: !51, line: 307, baseType: !104, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !475, file: !51, line: 308, baseType: !104, size: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !475, file: !51, line: 309, baseType: !104, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !475, file: !51, line: 311, baseType: !104, size: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !475, file: !51, line: 313, baseType: !104, size: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !475, file: !51, line: 315, baseType: !104, size: 32, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !475, file: !51, line: 316, baseType: !104, size: 32, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !475, file: !51, line: 317, baseType: !104, size: 32, offset: 352)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !475, file: !51, line: 319, baseType: !104, size: 32, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !475, file: !51, line: 321, baseType: !104, size: 32, offset: 416)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !475, file: !51, line: 322, baseType: !104, size: 32, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !475, file: !51, line: 324, baseType: !203, size: 64, offset: 480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !475, file: !51, line: 325, baseType: !104, size: 32, offset: 544)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !475, file: !51, line: 327, baseType: !104, size: 32, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !475, file: !51, line: 329, baseType: !104, size: 32, offset: 608)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !475, file: !51, line: 330, baseType: !104, size: 32, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !475, file: !51, line: 331, baseType: !104, size: 32, offset: 672)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !475, file: !51, line: 333, baseType: !104, size: 32, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !475, file: !51, line: 334, baseType: !104, size: 32, offset: 736)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !475, file: !51, line: 339, baseType: !499, size: 2048, offset: 768)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 2048, elements: !504)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !51, line: 335, size: 64, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !500, file: !51, line: 337, baseType: !104, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !500, file: !51, line: 338, baseType: !104, size: 32, offset: 32)
!504 = !{!58, !149}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !475, file: !51, line: 342, baseType: !506, size: 49152, align: 128, offset: 2816)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 49152, align: 128, elements: !532)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !508, line: 36, baseType: !509, align: 128)
!508 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !508, line: 26, size: 512, elements: !510)
!510 = !{!511, !518, !519, !522, !523, !524}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !509, file: !508, line: 30, baseType: !512, size: 128, align: 128)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 128, elements: !516)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !79, line: 25, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !43, line: 39, baseType: !515)
!515 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!516 = !{!517}
!517 = !DISubrange(count: 8)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !509, file: !508, line: 31, baseType: !512, size: 128, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !509, file: !508, line: 32, baseType: !520, size: 32, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !79, line: 26, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !43, line: 41, baseType: !104)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !509, file: !508, line: 33, baseType: !520, size: 32, offset: 288)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !509, file: !508, line: 34, baseType: !520, size: 32, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !509, file: !508, line: 35, baseType: !525, size: 64, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !508, line: 25, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !291, !104, !291, !104, !530, !104}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!532 = !{!533, !534}
!533 = !DISubrange(count: 32)
!534 = !DISubrange(count: 3)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !475, file: !51, line: 344, baseType: !104, size: 32, offset: 51968)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !475, file: !51, line: 345, baseType: !104, size: 32, offset: 52000)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !475, file: !51, line: 350, baseType: !538, size: 1024, offset: 52032)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 1024, elements: !148)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !51, line: 346, size: 64, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !539, file: !51, line: 348, baseType: !104, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !539, file: !51, line: 349, baseType: !104, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !475, file: !51, line: 352, baseType: !104, size: 32, offset: 53056)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !475, file: !51, line: 354, baseType: !104, size: 32, offset: 53088)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !475, file: !51, line: 355, baseType: !104, size: 32, offset: 53120)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !475, file: !51, line: 356, baseType: !104, size: 32, offset: 53152)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !475, file: !51, line: 357, baseType: !104, size: 32, offset: 53184)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !475, file: !51, line: 360, baseType: !104, size: 32, offset: 53216)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !475, file: !51, line: 361, baseType: !104, size: 32, offset: 53248)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !475, file: !51, line: 362, baseType: !104, size: 32, offset: 53280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !96, file: !51, line: 463, baseType: !552, size: 4096, offset: 111232)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !553, line: 46, baseType: !554)
!553 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 27, size: 4096, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !554, file: !553, line: 30, baseType: !104, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !554, file: !553, line: 31, baseType: !104, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !554, file: !553, line: 34, baseType: !104, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !554, file: !553, line: 35, baseType: !104, size: 32, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !554, file: !553, line: 37, baseType: !291, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !554, file: !553, line: 38, baseType: !291, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !554, file: !553, line: 39, baseType: !291, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !554, file: !553, line: 42, baseType: !104, size: 32, align: 128, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !554, file: !553, line: 45, baseType: !565, size: 3680, offset: 416)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 3680, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 460)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !96, file: !51, line: 494, baseType: !569, size: 2112, offset: 115328)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !51, line: 465, size: 2112, elements: !570)
!570 = !{!571, !709, !711, !712, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !725, !726, !727, !728}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !569, file: !51, line: 468, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !575, line: 146, baseType: !576)
!575 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !575, line: 31, size: 125056, elements: !577)
!577 = !{!578, !579, !580, !581, !584, !585, !586, !587, !588, !589, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !608, !609, !610, !611, !612, !613, !615, !617, !618, !619, !620, !621, !624, !626, !627, !629, !631, !632, !636, !637, !641, !645, !648, !650, !651, !653, !654, !656, !657, !658, !661, !663, !664, !665, !667, !668, !669, !670, !671, !672, !673, !674, !676, !677, !681, !690, !694, !696, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !576, file: !575, line: 34, baseType: !104, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !576, file: !575, line: 35, baseType: !104, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !576, file: !575, line: 36, baseType: !104, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !576, file: !575, line: 37, baseType: !582, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !79, line: 27, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !43, line: 44, baseType: !305)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !576, file: !575, line: 38, baseType: !582, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !576, file: !575, line: 39, baseType: !104, size: 32, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !576, file: !575, line: 40, baseType: !104, size: 32, offset: 288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !576, file: !575, line: 41, baseType: !104, size: 32, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !576, file: !575, line: 42, baseType: !104, size: 32, offset: 352)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !576, file: !575, line: 43, baseType: !590, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !576, file: !575, line: 45, baseType: !104, size: 32, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !576, file: !575, line: 46, baseType: !104, size: 32, offset: 480)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !576, file: !575, line: 47, baseType: !104, size: 32, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !576, file: !575, line: 48, baseType: !104, size: 32, offset: 544)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !576, file: !575, line: 49, baseType: !104, size: 32, offset: 576)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !576, file: !575, line: 50, baseType: !104, size: 32, offset: 608)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !576, file: !575, line: 51, baseType: !104, size: 32, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !576, file: !575, line: 52, baseType: !61, size: 8, offset: 672)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !576, file: !575, line: 53, baseType: !61, size: 8, offset: 680)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !576, file: !575, line: 54, baseType: !61, size: 8, offset: 688)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !576, file: !575, line: 55, baseType: !199, size: 32, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !576, file: !575, line: 56, baseType: !199, size: 32, offset: 736)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !576, file: !575, line: 57, baseType: !104, size: 32, offset: 768)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !576, file: !575, line: 60, baseType: !104, size: 32, offset: 800)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !576, file: !575, line: 61, baseType: !606, size: 96, offset: 832)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 96, elements: !607)
!607 = !{!534}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !576, file: !575, line: 62, baseType: !606, size: 96, offset: 928)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !576, file: !575, line: 63, baseType: !606, size: 96, offset: 1024)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !576, file: !575, line: 64, baseType: !104, size: 32, offset: 1120)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !576, file: !575, line: 65, baseType: !104, size: 32, offset: 1152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !576, file: !575, line: 66, baseType: !104, size: 32, offset: 1184)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !576, file: !575, line: 67, baseType: !614, size: 192, offset: 1216)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 192, elements: !607)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !576, file: !575, line: 68, baseType: !616, size: 256, offset: 1408)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 256, elements: !64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !576, file: !575, line: 69, baseType: !616, size: 256, offset: 1664)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !576, file: !575, line: 70, baseType: !466, size: 64, offset: 1920)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !576, file: !575, line: 74, baseType: !616, size: 256, offset: 1984)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !576, file: !575, line: 75, baseType: !616, size: 256, offset: 2240)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !576, file: !575, line: 77, baseType: !622, size: 24576, align: 128, offset: 2560)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 24576, align: 128, elements: !623)
!623 = !{!149, !534}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !576, file: !575, line: 78, baseType: !625, size: 1024, offset: 27136)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 1024, elements: !148)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !576, file: !575, line: 79, baseType: !104, size: 32, offset: 28160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !576, file: !575, line: 80, baseType: !628, size: 64, offset: 28224)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !576, file: !575, line: 83, baseType: !630, size: 64, offset: 28288)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !576, file: !575, line: 84, baseType: !291, size: 64, offset: 28352)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !576, file: !575, line: 85, baseType: !633, size: 128, offset: 28416)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 128, elements: !57)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 32, elements: !57)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !576, file: !575, line: 86, baseType: !634, size: 64, offset: 28544)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !576, file: !575, line: 87, baseType: !638, size: 2176, offset: 28608)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 2176, elements: !639)
!639 = !{!58, !640}
!640 = !DISubrange(count: 17)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !576, file: !575, line: 92, baseType: !642, size: 20736, offset: 30784)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 20736, elements: !643)
!643 = !{!644, !644}
!644 = !DISubrange(count: 18)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !576, file: !575, line: 96, baseType: !646, size: 2176, offset: 51520)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 2176, elements: !639)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !576, file: !575, line: 97, baseType: !649, size: 128, offset: 53696)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 128, elements: !57)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !576, file: !575, line: 98, baseType: !203, size: 64, offset: 53824)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !576, file: !575, line: 99, baseType: !652, size: 1024, offset: 53888)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 1024, elements: !504)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !576, file: !575, line: 100, baseType: !635, size: 32, offset: 54912)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !576, file: !575, line: 105, baseType: !655, size: 10368, offset: 54944)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 10368, elements: !643)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !576, file: !575, line: 106, baseType: !655, size: 10368, offset: 65312)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !576, file: !575, line: 107, baseType: !104, size: 32, offset: 75680)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !576, file: !575, line: 108, baseType: !659, size: 576, offset: 75712)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 576, elements: !660)
!660 = !{!644}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !576, file: !575, line: 109, baseType: !662, size: 20736, offset: 76288)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 20736, elements: !643)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !576, file: !575, line: 110, baseType: !647, size: 64, offset: 97024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !576, file: !575, line: 111, baseType: !647, size: 64, offset: 97088)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !576, file: !575, line: 112, baseType: !666, size: 64, offset: 97152)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !576, file: !575, line: 113, baseType: !666, size: 64, offset: 97216)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !576, file: !575, line: 114, baseType: !666, size: 64, offset: 97280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !576, file: !575, line: 115, baseType: !104, size: 32, offset: 97344)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !576, file: !575, line: 116, baseType: !466, size: 64, offset: 97408)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !576, file: !575, line: 117, baseType: !466, size: 64, offset: 97472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !576, file: !575, line: 118, baseType: !466, size: 64, offset: 97536)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !576, file: !575, line: 119, baseType: !104, size: 32, offset: 97600)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !576, file: !575, line: 120, baseType: !675, size: 576, offset: 97632)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 576, elements: !660)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !576, file: !575, line: 121, baseType: !40, size: 32, offset: 98208)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !576, file: !575, line: 122, baseType: !678, size: 64, offset: 98240)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !41, line: 27, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !43, line: 45, baseType: !680)
!680 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !576, file: !575, line: 125, baseType: !682, size: 256, offset: 98304)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !95, line: 503, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 496, size: 256, elements: !684)
!684 = !{!685, !687, !688, !689}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !683, file: !95, line: 498, baseType: !686, size: 64)
!686 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !683, file: !95, line: 499, baseType: !686, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !683, file: !95, line: 500, baseType: !686, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !683, file: !95, line: 502, baseType: !686, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !576, file: !575, line: 128, baseType: !691, size: 2008, offset: 98560)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2008, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 251)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !576, file: !575, line: 129, baseType: !695, size: 8032, offset: 100576)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 8032, elements: !692)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !576, file: !575, line: 130, baseType: !697, size: 16064, offset: 108608)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 16064, elements: !692)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !576, file: !575, line: 131, baseType: !104, size: 32, offset: 124672)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !576, file: !575, line: 132, baseType: !104, size: 32, offset: 124704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !576, file: !575, line: 135, baseType: !104, size: 32, offset: 124736)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !576, file: !575, line: 136, baseType: !104, size: 32, offset: 124768)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !576, file: !575, line: 137, baseType: !104, size: 32, offset: 124800)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !576, file: !575, line: 138, baseType: !104, size: 32, offset: 124832)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !576, file: !575, line: 139, baseType: !104, size: 32, offset: 124864)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !576, file: !575, line: 142, baseType: !199, size: 32, offset: 124896)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !576, file: !575, line: 143, baseType: !104, size: 32, offset: 124928)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !576, file: !575, line: 144, baseType: !104, size: 32, offset: 124960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !576, file: !575, line: 145, baseType: !104, size: 32, offset: 124992)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !569, file: !51, line: 470, baseType: !710, size: 128, offset: 64)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 128, elements: !57)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !569, file: !51, line: 473, baseType: !572, size: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !569, file: !51, line: 476, baseType: !713, size: 1152, offset: 256)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 1152, elements: !660)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !569, file: !51, line: 478, baseType: !104, size: 32, offset: 1408)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !569, file: !51, line: 480, baseType: !104, size: 32, offset: 1440)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !569, file: !51, line: 482, baseType: !104, size: 32, offset: 1472)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !569, file: !51, line: 483, baseType: !104, size: 32, offset: 1504)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !569, file: !51, line: 484, baseType: !104, size: 32, offset: 1536)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !569, file: !51, line: 485, baseType: !104, size: 32, offset: 1568)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !569, file: !51, line: 486, baseType: !104, size: 32, offset: 1600)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !569, file: !51, line: 487, baseType: !582, size: 64, offset: 1664)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !569, file: !51, line: 488, baseType: !582, size: 64, offset: 1728)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !569, file: !51, line: 489, baseType: !724, size: 128, offset: 1792)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 128, elements: !57)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !569, file: !51, line: 490, baseType: !582, size: 64, offset: 1920)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !569, file: !51, line: 491, baseType: !582, size: 64, offset: 1984)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !569, file: !51, line: 492, baseType: !104, size: 32, offset: 2048)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !569, file: !51, line: 493, baseType: !104, size: 32, offset: 2080)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !96, file: !51, line: 497, baseType: !573, size: 64, offset: 117440)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !96, file: !51, line: 500, baseType: !573, size: 64, offset: 117504)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !96, file: !51, line: 503, baseType: !104, size: 32, offset: 117568)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !96, file: !51, line: 504, baseType: !733, size: 1216, offset: 117632)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 1216, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 19)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !96, file: !51, line: 505, baseType: !104, size: 32, offset: 118848)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !96, file: !51, line: 506, baseType: !733, size: 1216, offset: 118912)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !96, file: !51, line: 507, baseType: !203, size: 64, offset: 120128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !96, file: !51, line: 510, baseType: !104, size: 32, offset: 120192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !96, file: !51, line: 511, baseType: !104, size: 32, offset: 120224)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !96, file: !51, line: 512, baseType: !582, size: 64, offset: 120256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !96, file: !51, line: 522, baseType: !743, size: 10624, offset: 120320)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !51, line: 515, size: 10624, elements: !744)
!744 = !{!745, !747, !750, !753}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !743, file: !51, line: 517, baseType: !746, size: 256, align: 128)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 256, elements: !148)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !743, file: !51, line: 518, baseType: !748, size: 128, align: 128, offset: 256)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 128, elements: !749)
!749 = !{!58, !65}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !743, file: !51, line: 520, baseType: !751, size: 4096, align: 128, offset: 384)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 4096, elements: !752)
!752 = !{!65, !156}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !743, file: !51, line: 521, baseType: !754, size: 6144, align: 128, offset: 4480)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 6144, elements: !755)
!755 = !{!756, !149}
!756 = !DISubrange(count: 24)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !96, file: !51, line: 732, baseType: !758, size: 82688, offset: 130944)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !51, line: 525, size: 82688, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !787, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !805, !808, !812, !813, !814, !819, !820, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !888, !919, !920, !921, !922, !923, !924, !925, !926, !927, !930, !931, !932, !935, !938, !940, !943, !945, !946}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !758, file: !51, line: 527, baseType: !104, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !758, file: !51, line: 530, baseType: !104, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !758, file: !51, line: 531, baseType: !104, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !758, file: !51, line: 532, baseType: !104, size: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !758, file: !51, line: 535, baseType: !104, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !758, file: !51, line: 536, baseType: !104, size: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !758, file: !51, line: 537, baseType: !104, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !758, file: !51, line: 538, baseType: !104, size: 32, offset: 224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !758, file: !51, line: 539, baseType: !104, size: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !758, file: !51, line: 542, baseType: !104, size: 32, offset: 288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !758, file: !51, line: 543, baseType: !104, size: 32, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !758, file: !51, line: 544, baseType: !104, size: 32, offset: 352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !758, file: !51, line: 545, baseType: !104, size: 32, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !758, file: !51, line: 546, baseType: !104, size: 32, offset: 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !758, file: !51, line: 547, baseType: !104, size: 32, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !758, file: !51, line: 548, baseType: !104, size: 32, offset: 480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !758, file: !51, line: 549, baseType: !104, size: 32, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !758, file: !51, line: 551, baseType: !104, size: 32, offset: 544)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !758, file: !51, line: 554, baseType: !203, size: 64, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !758, file: !51, line: 555, baseType: !203, size: 64, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !758, file: !51, line: 558, baseType: !203, size: 64, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !758, file: !51, line: 559, baseType: !203, size: 64, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !758, file: !51, line: 561, baseType: !203, size: 64, offset: 832)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !758, file: !51, line: 562, baseType: !203, size: 64, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !758, file: !51, line: 565, baseType: !7, size: 32, offset: 960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !758, file: !51, line: 566, baseType: !786, size: 128, offset: 992)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !758, file: !51, line: 567, baseType: !788, size: 512, offset: 1120)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !148)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !758, file: !51, line: 568, baseType: !7, size: 32, offset: 1632)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !758, file: !51, line: 569, baseType: !7, size: 32, offset: 1664)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !758, file: !51, line: 570, baseType: !104, size: 32, offset: 1696)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !758, file: !51, line: 571, baseType: !104, size: 32, offset: 1728)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !758, file: !51, line: 572, baseType: !104, size: 32, offset: 1760)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !758, file: !51, line: 573, baseType: !104, size: 32, offset: 1792)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !758, file: !51, line: 574, baseType: !104, size: 32, offset: 1824)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !758, file: !51, line: 575, baseType: !104, size: 32, offset: 1856)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !758, file: !51, line: 576, baseType: !104, size: 32, offset: 1888)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !758, file: !51, line: 577, baseType: !104, size: 32, offset: 1920)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !758, file: !51, line: 578, baseType: !104, size: 32, offset: 1952)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !758, file: !51, line: 585, baseType: !630, size: 64, offset: 1984)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !758, file: !51, line: 586, baseType: !291, size: 64, offset: 2048)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !758, file: !51, line: 587, baseType: !630, size: 64, offset: 2112)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !758, file: !51, line: 588, baseType: !804, size: 64, offset: 2176)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !758, file: !51, line: 589, baseType: !806, size: 64, offset: 2240)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !516)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !758, file: !51, line: 591, baseType: !809, size: 64, offset: 2304)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 192, elements: !811)
!811 = !{!756}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !758, file: !51, line: 592, baseType: !630, size: 64, offset: 2368)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !758, file: !51, line: 593, baseType: !633, size: 128, offset: 2432)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !758, file: !51, line: 594, baseType: !815, size: 128, offset: 2560)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 128, elements: !57)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !818)
!818 = !{!517, !58}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !758, file: !51, line: 595, baseType: !649, size: 128, offset: 2688)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !758, file: !51, line: 596, baseType: !821, size: 4096, offset: 2816)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 4096, elements: !822)
!822 = !{!58, !533}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !758, file: !51, line: 597, baseType: !630, size: 64, offset: 6912)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !758, file: !51, line: 598, baseType: !630, size: 64, offset: 6976)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !758, file: !51, line: 599, baseType: !466, size: 64, offset: 7040)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !758, file: !51, line: 603, baseType: !625, size: 1024, offset: 7104)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !758, file: !51, line: 606, baseType: !104, size: 32, offset: 8128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !758, file: !51, line: 607, baseType: !104, size: 32, offset: 8160)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !758, file: !51, line: 608, baseType: !60, size: 32, align: 32, offset: 8192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !758, file: !51, line: 609, baseType: !104, size: 32, offset: 8224)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !758, file: !51, line: 611, baseType: !104, size: 32, offset: 8256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !758, file: !51, line: 612, baseType: !104, size: 32, offset: 8288)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !758, file: !51, line: 614, baseType: !104, size: 32, offset: 8320)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !758, file: !51, line: 615, baseType: !104, size: 32, offset: 8352)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !758, file: !51, line: 621, baseType: !104, size: 32, offset: 8384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !758, file: !51, line: 624, baseType: !104, size: 32, offset: 8416)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !758, file: !51, line: 626, baseType: !104, size: 32, offset: 8448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !758, file: !51, line: 627, baseType: !104, size: 32, offset: 8480)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !758, file: !51, line: 671, baseType: !840, size: 60672, offset: 8576)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !51, line: 629, size: 60672, elements: !841)
!841 = !{!842, !846, !850, !852, !853, !856, !860, !862, !863, !864, !865, !866, !869, !873, !876, !877, !878, !879, !880, !883, !885, !887}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !840, file: !51, line: 634, baseType: !843, size: 3072, align: 128)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 3072, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !840, file: !51, line: 635, baseType: !847, size: 6912, align: 128, offset: 3072)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 6912, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 864)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !840, file: !51, line: 638, baseType: !851, size: 2048, align: 128, offset: 9984)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, elements: !344)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !840, file: !51, line: 639, baseType: !851, size: 2048, align: 128, offset: 12032)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !840, file: !51, line: 640, baseType: !854, size: 3072, align: 128, offset: 14080)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 3072, elements: !855)
!855 = !{!534, !156}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !840, file: !51, line: 641, baseType: !857, size: 3840, align: 128, offset: 17152)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 3840, elements: !858)
!858 = !{!859, !149}
!859 = !DISubrange(count: 15)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !840, file: !51, line: 642, baseType: !861, size: 128, offset: 20992)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !840, file: !51, line: 643, baseType: !861, size: 128, offset: 21120)
