; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/delegate.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/delegate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: mustprogress nofree norecurse nosync nounwind readnone willreturn uwtable
define dso_local i32 @ListDelegateInfo(ptr nocapture noundef readnone %file, ptr nocapture noundef readnone %exception) local_unnamed_addr #0 !dbg !488 {
entry:
  call void @llvm.dbg.value(metadata ptr %file, metadata !561, metadata !DIExpression()), !dbg !563
  call void @llvm.dbg.value(metadata ptr %exception, metadata !562, metadata !DIExpression()), !dbg !563
  ret i32 0, !dbg !564
}

; Function Attrs: mustprogress nofree norecurse nosync nounwind readnone willreturn uwtable
define dso_local noalias ptr @GetDelegateList(ptr nocapture noundef readnone %pattern, ptr nocapture noundef readnone %number_delegates, ptr nocapture noundef readnone %exception) local_unnamed_addr #0 !dbg !565 {
entry:
  call void @llvm.dbg.value(metadata ptr %pattern, metadata !572, metadata !DIExpression()), !dbg !575
  call void @llvm.dbg.value(metadata ptr %number_delegates, metadata !573, metadata !DIExpression()), !dbg !575
  call void @llvm.dbg.value(metadata ptr %exception, metadata !574, metadata !DIExpression()), !dbg !575

!381 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!382 = !{!383, !384, !385, !386, !387}
!383 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!384 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!385 = !DIEnumerator(name: "NoneDispose", value: 1)
!386 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!387 = !DIEnumerator(name: "PreviousDispose", value: 3)
!388 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !389, line: 25, baseType: !5, size: 32, elements: !390)
!389 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!390 = !{!391, !392, !393}
!391 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!392 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!393 = !DIEnumerator(name: "RunningTimerState", value: 2)
!394 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !395, line: 31, baseType: !5, size: 32, elements: !396)
!395 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!396 = !{!397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!397 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!398 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!399 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!400 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!401 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!402 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!403 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!404 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!405 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!406 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!407 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!408 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!409 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!410 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !395, line: 67, baseType: !5, size: 32, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!413 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!414 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!415 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!416 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!417 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!418 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!419 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!420 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!421 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!422 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 27, baseType: !5, size: 32, elements: !425)
!424 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!426 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!427 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!428 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!429 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!430 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!431 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!432 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!433 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!434 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!435 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!436 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!437 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!438 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!439 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!440 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!441 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!442 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!443 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!444 = !{!445, !448, !449}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "DelegateInfo", file: !452, line: 53, baseType: !453)
!452 = !DIFile(filename: "apps/538.imagick_r/src/magick/delegate.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "154c582a7300696ba5d05ab32b045264")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DelegateInfo", file: !452, line: 28, size: 704, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !465, !467, !468, !469, !471, !472, !476}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !453, file: !452, line: 31, baseType: !446, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !453, file: !452, line: 32, baseType: !446, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !453, file: !452, line: 33, baseType: !446, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !453, file: !452, line: 34, baseType: !446, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !453, file: !452, line: 37, baseType: !460, size: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !461, line: 77, baseType: !462)
!461 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !463, line: 193, baseType: !464)
!463 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!464 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !453, file: !452, line: 40, baseType: !466, size: 32, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "spawn", scope: !453, file: !452, line: 41, baseType: !466, size: 32, offset: 352)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !453, file: !452, line: 42, baseType: !466, size: 32, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !453, file: !452, line: 45, baseType: !470, size: 64, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !452, line: 46, baseType: !470, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !453, file: !452, line: 49, baseType: !473, size: 64, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !474, line: 46, baseType: !475)
!474 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!475 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !453, file: !452, line: 52, baseType: !477, size: 64, offset: 640)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !479, line: 26, baseType: !480)
!479 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !479, line: 25, flags: DIFlagFwdDecl)
!481 = !{i32 7, !"Dwarf Version", i32 5}
!482 = !{i32 2, !"Debug Info Version", i32 3}
!483 = !{i32 1, !"wchar_size", i32 4}
!484 = !{i32 7, !"PIC Level", i32 2}
!485 = !{i32 7, !"PIE Level", i32 2}
!486 = !{i32 7, !"uwtable", i32 2}
!487 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!488 = distinct !DISubprogram(name: "ListDelegateInfo", scope: !489, file: !489, line: 1505, type: !490, scopeLine: 1507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !560)
!489 = !DIFile(filename: "apps/538.imagick_r/src/magick/delegate.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3292ed3e5eb7d3226741a5431e5b8664")
!490 = !DISubroutineType(types: !491)
!491 = !{!466, !492, !547}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !494, line: 7, baseType: !495)
!494 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !496, line: 49, size: 1728, elements: !497)
!496 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!497 = !{!498, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !514, !516, !517, !518, !520, !522, !524, !528, !531, !533, !536, !539, !540, !541, !542, !543}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !495, file: !496, line: 51, baseType: !499, size: 32)
!499 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !495, file: !496, line: 54, baseType: !446, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !495, file: !496, line: 55, baseType: !446, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !495, file: !496, line: 56, baseType: !446, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !495, file: !496, line: 57, baseType: !446, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !495, file: !496, line: 58, baseType: !446, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !495, file: !496, line: 59, baseType: !446, size: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !495, file: !496, line: 60, baseType: !446, size: 64, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !495, file: !496, line: 61, baseType: !446, size: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !495, file: !496, line: 64, baseType: !446, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !495, file: !496, line: 65, baseType: !446, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !495, file: !496, line: 66, baseType: !446, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !495, file: !496, line: 68, baseType: !512, size: 64, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !496, line: 36, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !495, file: !496, line: 70, baseType: !515, size: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !495, file: !496, line: 72, baseType: !499, size: 32, offset: 896)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !495, file: !496, line: 73, baseType: !499, size: 32, offset: 928)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !495, file: !496, line: 74, baseType: !519, size: 64, offset: 960)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !463, line: 152, baseType: !464)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !495, file: !496, line: 77, baseType: !521, size: 16, offset: 1024)
!521 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !495, file: !496, line: 78, baseType: !523, size: 8, offset: 1040)
!523 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !495, file: !496, line: 79, baseType: !525, size: 8, offset: 1048)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 8, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 1)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !495, file: !496, line: 81, baseType: !529, size: 64, offset: 1088)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !496, line: 43, baseType: null)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !495, file: !496, line: 89, baseType: !532, size: 64, offset: 1152)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !463, line: 153, baseType: !464)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !495, file: !496, line: 91, baseType: !534, size: 64, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !496, line: 37, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !495, file: !496, line: 92, baseType: !537, size: 64, offset: 1280)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !496, line: 38, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !495, file: !496, line: 93, baseType: !515, size: 64, offset: 1344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !495, file: !496, line: 94, baseType: !448, size: 64, offset: 1408)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !495, file: !496, line: 95, baseType: !473, size: 64, offset: 1472)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !495, file: !496, line: 96, baseType: !499, size: 32, offset: 1536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !495, file: !496, line: 98, baseType: !544, size: 160, offset: 1568)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 160, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 20)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !10, line: 102, size: 448, elements: !550)
!550 = !{!551, !553, !554, !555, !556, !557, !558, !559}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !549, file: !10, line: 105, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !10, line: 100, baseType: !9)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !549, file: !10, line: 108, baseType: !499, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !549, file: !10, line: 111, baseType: !446, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !549, file: !10, line: 112, baseType: !446, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !549, file: !10, line: 115, baseType: !448, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !549, file: !10, line: 118, baseType: !466, size: 32, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !549, file: !10, line: 121, baseType: !477, size: 64, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !549, file: !10, line: 124, baseType: !473, size: 64, offset: 384)
!560 = !{!561, !562}
!561 = !DILocalVariable(name: "file", arg: 1, scope: !488, file: !489, line: 1505, type: !492)
!562 = !DILocalVariable(name: "exception", arg: 2, scope: !488, file: !489, line: 1506, type: !547)
!563 = !DILocation(line: 0, scope: !488)
!564 = !DILocation(line: 1508, column: 7, scope: !488)
!565 = distinct !DISubprogram(name: "GetDelegateList", scope: !489, file: !489, line: 1511, type: !566, scopeLine: 1513, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !571)
!566 = !DISubroutineType(types: !567)
!567 = !{!445, !568, !570, !547}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!571 = !{!572, !573, !574}
!572 = !DILocalVariable(name: "pattern", arg: 1, scope: !565, file: !489, line: 1511, type: !568)
!573 = !DILocalVariable(name: "number_delegates", arg: 2, scope: !565, file: !489, line: 1512, type: !570)
!574 = !DILocalVariable(name: "exception", arg: 3, scope: !565, file: !489, line: 1512, type: !547)
!575 = !DILocation(line: 0, scope: !565)
!576 = !DILocation(line: 1514, column: 7, scope: !565)
!577 = distinct !DISubprogram(name: "InvokeDelegate", scope: !489, file: !489, line: 1517, type: !578, scopeLine: 1519, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !849)
!578 = !DISubroutineType(types: !579)
!579 = !{!466, !580, !642, !568, !568, !547}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !108, line: 356, size: 134336, elements: !583)
!583 = !{!584, !586, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !601, !603, !605, !606, !607, !608, !609, !610, !611, !613, !614, !623, !624, !625, !626, !627, !628, !630, !632, !634, !635, !636, !637, !638, !639, !641, !816, !817, !818, !819, !820, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !846, !847, !848}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !582, file: !108, line: 359, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !83, line: 49, baseType: !82)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !582, file: !108, line: 362, baseType: !587, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !108, line: 86, baseType: !107)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !582, file: !108, line: 365, baseType: !466, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !582, file: !108, line: 366, baseType: !466, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !582, file: !108, line: 367, baseType: !466, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !582, file: !108, line: 368, baseType: !466, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !582, file: !108, line: 371, baseType: !446, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !582, file: !108, line: 372, baseType: !446, size: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !582, file: !108, line: 373, baseType: !446, size: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !582, file: !108, line: 374, baseType: !446, size: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !582, file: !108, line: 377, baseType: !473, size: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !582, file: !108, line: 378, baseType: !473, size: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !582, file: !108, line: 379, baseType: !473, size: 64, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !582, file: !108, line: 382, baseType: !600, size: 32, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !108, line: 73, baseType: !119)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !582, file: !108, line: 385, baseType: !602, size: 32, offset: 672)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !130, line: 35, baseType: !129)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !582, file: !108, line: 388, baseType: !604, size: 32, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !108, line: 93, baseType: !135)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !582, file: !108, line: 391, baseType: !473, size: 64, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !582, file: !108, line: 394, baseType: !446, size: 64, offset: 832)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !582, file: !108, line: 395, baseType: !446, size: 64, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !582, file: !108, line: 396, baseType: !446, size: 64, offset: 960)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !582, file: !108, line: 397, baseType: !446, size: 64, offset: 1024)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !582, file: !108, line: 398, baseType: !446, size: 64, offset: 1088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !582, file: !108, line: 401, baseType: !612, size: 64, offset: 1152)
!612 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !582, file: !108, line: 402, baseType: !612, size: 64, offset: 1216)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !582, file: !108, line: 405, baseType: !615, size: 64, offset: 1280)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !617)
!617 = !{!618, !620, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !616, file: !395, line: 143, baseType: !619, size: 16)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !521)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !616, file: !395, line: 144, baseType: !619, size: 16, offset: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !616, file: !395, line: 145, baseType: !619, size: 16, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !616, file: !395, line: 146, baseType: !619, size: 16, offset: 48)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !582, file: !108, line: 406, baseType: !615, size: 64, offset: 1344)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !582, file: !108, line: 407, baseType: !615, size: 64, offset: 1408)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !582, file: !108, line: 410, baseType: !466, size: 32, offset: 1472)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !582, file: !108, line: 411, baseType: !466, size: 32, offset: 1504)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !582, file: !108, line: 414, baseType: !473, size: 64, offset: 1536)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !582, file: !108, line: 417, baseType: !629, size: 32, offset: 1600)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !141, line: 61, baseType: !140)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !582, file: !108, line: 420, baseType: !631, size: 32, offset: 1632)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !108, line: 61, baseType: !177)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !582, file: !108, line: 423, baseType: !633, size: 32, offset: 1664)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !192, line: 59, baseType: !191)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !582, file: !108, line: 426, baseType: !460, size: 64, offset: 1728)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !582, file: !108, line: 429, baseType: !466, size: 32, offset: 1792)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !582, file: !108, line: 430, baseType: !466, size: 32, offset: 1824)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !582, file: !108, line: 433, baseType: !446, size: 64, offset: 1856)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !582, file: !108, line: 434, baseType: !446, size: 64, offset: 1920)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !582, file: !108, line: 437, baseType: !640, size: 32, offset: 1984)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !224)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !582, file: !108, line: 440, baseType: !642, size: 64, offset: 2048)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !108, line: 150, size: 105920, elements: !645)
!645 = !{!646, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !660, !661, !662, !663, !664, !678, !680, !681, !682, !683, !684, !685, !686, !687, !688, !696, !697, !698, !699, !700, !701, !703, !704, !705, !707, !709, !711, !713, !714, !715, !716, !717, !718, !719, !727, !742, !754, !755, !756, !757, !761, !765, !769, !770, !771, !772, !773, !774, !775, !777, !778, !788, !789, !791, !792, !793, !794, !795, !796, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !813, !815}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !644, file: !108, line: 153, baseType: !647, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !246)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !644, file: !108, line: 156, baseType: !629, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !644, file: !108, line: 159, baseType: !585, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !644, file: !108, line: 162, baseType: !473, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !644, file: !108, line: 165, baseType: !587, size: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !644, file: !108, line: 168, baseType: !466, size: 32, offset: 224)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !644, file: !108, line: 169, baseType: !466, size: 32, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !644, file: !108, line: 172, baseType: !473, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !644, file: !108, line: 173, baseType: !473, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !644, file: !108, line: 174, baseType: !473, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !644, file: !108, line: 175, baseType: !473, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !644, file: !108, line: 178, baseType: !659, size: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !644, file: !108, line: 179, baseType: !615, size: 64, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !644, file: !108, line: 180, baseType: !615, size: 64, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !644, file: !108, line: 181, baseType: !615, size: 64, offset: 768)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !644, file: !108, line: 184, baseType: !612, size: 64, offset: 832)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !644, file: !108, line: 187, baseType: !665, size: 768, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !108, line: 128, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !108, line: 121, size: 768, elements: !667)
!667 = !{!668, !675, !676, !677}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !666, file: !108, line: 124, baseType: !669, size: 192)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !108, line: 101, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !108, line: 95, size: 192, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !670, file: !108, line: 98, baseType: !612, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !670, file: !108, line: 99, baseType: !612, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !670, file: !108, line: 100, baseType: !612, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !666, file: !108, line: 125, baseType: !669, size: 192, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !666, file: !108, line: 126, baseType: !669, size: 192, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !666, file: !108, line: 127, baseType: !669, size: 192, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !644, file: !108, line: 190, baseType: !679, size: 32, offset: 1664)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !252, line: 49, baseType: !251)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !644, file: !108, line: 193, baseType: !448, size: 64, offset: 1728)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !644, file: !108, line: 196, baseType: !604, size: 32, offset: 1792)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !644, file: !108, line: 199, baseType: !446, size: 64, offset: 1856)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !644, file: !108, line: 200, baseType: !446, size: 64, offset: 1920)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !644, file: !108, line: 201, baseType: !446, size: 64, offset: 1984)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !644, file: !108, line: 204, baseType: !460, size: 64, offset: 2048)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !644, file: !108, line: 207, baseType: !612, size: 64, offset: 2112)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !644, file: !108, line: 208, baseType: !612, size: 64, offset: 2176)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !644, file: !108, line: 211, baseType: !689, size: 256, offset: 2240)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !295, line: 130, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !295, line: 121, size: 256, elements: !691)
!691 = !{!692, !693, !694, !695}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !690, file: !295, line: 124, baseType: !473, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !690, file: !295, line: 125, baseType: !473, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !690, file: !295, line: 128, baseType: !460, size: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !690, file: !295, line: 129, baseType: !460, size: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !644, file: !108, line: 212, baseType: !689, size: 256, offset: 2496)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !644, file: !108, line: 213, baseType: !689, size: 256, offset: 2752)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !644, file: !108, line: 216, baseType: !612, size: 64, offset: 3008)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !644, file: !108, line: 217, baseType: !612, size: 64, offset: 3072)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !644, file: !108, line: 218, baseType: !612, size: 64, offset: 3136)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !644, file: !108, line: 221, baseType: !702, size: 32, offset: 3200)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !260, line: 66, baseType: !259)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !644, file: !108, line: 224, baseType: !600, size: 32, offset: 3232)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !644, file: !108, line: 227, baseType: !602, size: 32, offset: 3264)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !644, file: !108, line: 230, baseType: !706, size: 32, offset: 3296)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !295, line: 91, baseType: !294)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !644, file: !108, line: 233, baseType: !708, size: 32, offset: 3328)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !310, line: 99, baseType: !309)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !644, file: !108, line: 236, baseType: !710, size: 32, offset: 3360)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !381, line: 32, baseType: !380)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !644, file: !108, line: 239, baseType: !712, size: 64, offset: 3392)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !644, file: !108, line: 242, baseType: !473, size: 64, offset: 3456)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !644, file: !108, line: 243, baseType: !473, size: 64, offset: 3520)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !644, file: !108, line: 246, baseType: !460, size: 64, offset: 3584)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !644, file: !108, line: 249, baseType: !473, size: 64, offset: 3648)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !644, file: !108, line: 250, baseType: !473, size: 64, offset: 3712)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !644, file: !108, line: 253, baseType: !460, size: 64, offset: 3776)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !644, file: !108, line: 256, baseType: !720, size: 192, offset: 3840)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !721, line: 68, baseType: !722)
!721 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !721, line: 62, size: 192, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !722, file: !721, line: 65, baseType: !612, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !722, file: !721, line: 66, baseType: !612, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !722, file: !721, line: 67, baseType: !612, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !644, file: !108, line: 259, baseType: !728, size: 512, offset: 4032)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !389, line: 51, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !389, line: 40, size: 512, elements: !730)
!730 = !{!731, !738, !739, !741}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !729, file: !389, line: 43, baseType: !732, size: 192)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !389, line: 38, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !389, line: 32, size: 192, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !733, file: !389, line: 35, baseType: !612, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !733, file: !389, line: 36, baseType: !612, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !733, file: !389, line: 37, baseType: !612, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !729, file: !389, line: 44, baseType: !732, size: 192, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !729, file: !389, line: 47, baseType: !740, size: 32, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !389, line: 30, baseType: !388)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !729, file: !389, line: 50, baseType: !473, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !644, file: !108, line: 262, baseType: !743, size: 64, offset: 4544)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !744, line: 26, baseType: !745)
!744 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!466, !568, !748, !751, !448}
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !750)
!750 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !753)
!753 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !644, file: !108, line: 265, baseType: !448, size: 64, offset: 4608)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !644, file: !108, line: 266, baseType: !448, size: 64, offset: 4672)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !644, file: !108, line: 267, baseType: !448, size: 64, offset: 4736)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !644, file: !108, line: 270, baseType: !758, size: 64, offset: 4800)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !83, line: 52, baseType: !760)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !83, line: 51, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !644, file: !108, line: 273, baseType: !762, size: 64, offset: 4864)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !764)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !644, file: !108, line: 276, baseType: !766, size: 32768, offset: 4928)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 32768, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 4096)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !644, file: !108, line: 277, baseType: !766, size: 32768, offset: 37696)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !644, file: !108, line: 278, baseType: !766, size: 32768, offset: 70464)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !644, file: !108, line: 281, baseType: !473, size: 64, offset: 103232)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !644, file: !108, line: 282, baseType: !473, size: 64, offset: 103296)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !644, file: !108, line: 285, baseType: !548, size: 448, offset: 103360)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !644, file: !108, line: 288, baseType: !466, size: 32, offset: 103808)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !644, file: !108, line: 291, baseType: !776, size: 64, offset: 103872)
!776 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !460)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !644, file: !108, line: 294, baseType: !477, size: 64, offset: 103936)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !644, file: !108, line: 297, baseType: !779, size: 256, offset: 104000)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !252, line: 40, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !252, line: 27, size: 256, elements: !781)
!781 = !{!782, !783, !784, !787}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !780, file: !252, line: 30, baseType: !446, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !780, file: !252, line: 33, baseType: !473, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !780, file: !252, line: 36, baseType: !785, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !780, file: !252, line: 39, baseType: !473, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !644, file: !108, line: 298, baseType: !779, size: 256, offset: 104256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !644, file: !108, line: 299, baseType: !790, size: 64, offset: 104512)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !644, file: !108, line: 302, baseType: !473, size: 64, offset: 104576)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !644, file: !108, line: 305, baseType: !473, size: 64, offset: 104640)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !644, file: !108, line: 308, baseType: !712, size: 64, offset: 104704)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !644, file: !108, line: 309, baseType: !712, size: 64, offset: 104768)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !644, file: !108, line: 310, baseType: !712, size: 64, offset: 104832)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !644, file: !108, line: 313, baseType: !797, size: 32, offset: 104896)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !644, file: !108, line: 316, baseType: !466, size: 32, offset: 104928)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !644, file: !108, line: 319, baseType: !615, size: 64, offset: 104960)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !644, file: !108, line: 322, baseType: !712, size: 64, offset: 105024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !644, file: !108, line: 325, baseType: !689, size: 256, offset: 105088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !644, file: !108, line: 328, baseType: !448, size: 64, offset: 105344)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !644, file: !108, line: 329, baseType: !448, size: 64, offset: 105408)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !644, file: !108, line: 332, baseType: !631, size: 32, offset: 105472)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !644, file: !108, line: 335, baseType: !466, size: 32, offset: 105504)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !644, file: !108, line: 338, baseType: !752, size: 64, offset: 105536)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !644, file: !108, line: 341, baseType: !466, size: 32, offset: 105600)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !644, file: !108, line: 344, baseType: !473, size: 64, offset: 105664)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !644, file: !108, line: 347, baseType: !810, size: 64, offset: 105728)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !811, line: 7, baseType: !812)
!811 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !463, line: 160, baseType: !464)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !644, file: !108, line: 350, baseType: !814, size: 32, offset: 105792)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !644, file: !108, line: 353, baseType: !473, size: 64, offset: 105856)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !582, file: !108, line: 443, baseType: !448, size: 64, offset: 2112)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !582, file: !108, line: 446, baseType: !743, size: 64, offset: 2176)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !582, file: !108, line: 449, baseType: !448, size: 64, offset: 2240)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !582, file: !108, line: 450, baseType: !448, size: 64, offset: 2304)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !582, file: !108, line: 453, baseType: !821, size: 64, offset: 2368)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !822, line: 26, baseType: !823)
!822 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!473, !826, !828, !830}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !582, file: !108, line: 456, baseType: !492, size: 64, offset: 2432)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !582, file: !108, line: 459, baseType: !448, size: 64, offset: 2496)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !582, file: !108, line: 462, baseType: !473, size: 64, offset: 2560)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !582, file: !108, line: 465, baseType: !766, size: 32768, offset: 2624)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !582, file: !108, line: 466, baseType: !766, size: 32768, offset: 35392)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !582, file: !108, line: 467, baseType: !766, size: 32768, offset: 68160)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !582, file: !108, line: 468, baseType: !766, size: 32768, offset: 100928)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !582, file: !108, line: 471, baseType: !466, size: 32, offset: 133696)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !582, file: !108, line: 474, baseType: !446, size: 64, offset: 133760)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !582, file: !108, line: 477, baseType: !473, size: 64, offset: 133824)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !582, file: !108, line: 478, baseType: !473, size: 64, offset: 133888)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !582, file: !108, line: 481, baseType: !615, size: 64, offset: 133952)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !582, file: !108, line: 484, baseType: !473, size: 64, offset: 134016)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !582, file: !108, line: 487, baseType: !845, size: 32, offset: 134080)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !582, file: !108, line: 490, baseType: !615, size: 64, offset: 134112)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !582, file: !108, line: 493, baseType: !448, size: 64, offset: 134208)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !582, file: !108, line: 496, baseType: !466, size: 32, offset: 134272)
!849 = !{!850, !851, !852, !853, !854}
!850 = !DILocalVariable(name: "image_info", arg: 1, scope: !577, file: !489, line: 1517, type: !580)
!851 = !DILocalVariable(name: "image", arg: 2, scope: !577, file: !489, line: 1518, type: !642)
!852 = !DILocalVariable(name: "decode", arg: 3, scope: !577, file: !489, line: 1518, type: !568)
!853 = !DILocalVariable(name: "encode", arg: 4, scope: !577, file: !489, line: 1518, type: !568)
!854 = !DILocalVariable(name: "exception", arg: 5, scope: !577, file: !489, line: 1518, type: !547)
!855 = !DILocation(line: 0, scope: !577)
!856 = !DILocation(line: 1520, column: 7, scope: !577)
!857 = distinct !DISubprogram(name: "GetDelegateThreadSupport", scope: !489, file: !489, line: 1523, type: !858, scopeLine: 1525, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{!466, !449}
!860 = !{!861}
!861 = !DILocalVariable(name: "delegate_info", arg: 1, scope: !857, file: !489, line: 1524, type: !449)
!862 = !DILocation(line: 0, scope: !857)
!863 = !DILocation(line: 1526, column: 7, scope: !857)
!864 = distinct !DISubprogram(name: "GetDelegateMode", scope: !489, file: !489, line: 1529, type: !865, scopeLine: 1530, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !867)
!865 = !DISubroutineType(types: !866)
!866 = !{!460, !449}
!867 = !{!868}
!868 = !DILocalVariable(name: "delegate_info", arg: 1, scope: !864, file: !489, line: 1529, type: !449)
!869 = !DILocation(line: 0, scope: !864)
!870 = !DILocation(line: 1531, column: 7, scope: !864)
!871 = distinct !DISubprogram(name: "DelegateComponentGenesis", scope: !489, file: !489, line: 1534, type: !872, scopeLine: 1535, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !874)
!872 = !DISubroutineType(types: !873)
!873 = !{!466}
!874 = !{}
!875 = !DILocation(line: 1536, column: 7, scope: !871)
!876 = distinct !DISubprogram(name: "DelegateComponentTerminus", scope: !489, file: !489, line: 1539, type: !877, scopeLine: 1540, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !874)
!877 = !DISubroutineType(types: !878)
!878 = !{null}
!879 = !DILocation(line: 1541, column: 1, scope: !876)
!880 = distinct !DISubprogram(name: "GetDelegateInfo", scope: !489, file: !489, line: 1543, type: !881, scopeLine: 1545, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !883)
!881 = !DISubroutineType(types: !882)
!882 = !{!449, !568, !568, !547}
!883 = !{!884, !885, !886}
!884 = !DILocalVariable(name: "decode", arg: 1, scope: !880, file: !489, line: 1543, type: !568)
!885 = !DILocalVariable(name: "encode", arg: 2, scope: !880, file: !489, line: 1544, type: !568)
!886 = !DILocalVariable(name: "exception", arg: 3, scope: !880, file: !489, line: 1544, type: !547)
!887 = !DILocation(line: 0, scope: !880)
!888 = !DILocation(line: 1546, column: 5, scope: !880)
