; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/deprecate.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/deprecate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._PixelPacket = type { i16, i16, i16, i16 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._GeometryInfo = type { double, double, double, double, double }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }

!751 = !DIEnumerator(name: "OctagonKernel", value: 17)
!752 = !DIEnumerator(name: "DiskKernel", value: 18)
!753 = !DIEnumerator(name: "PlusKernel", value: 19)
!754 = !DIEnumerator(name: "CrossKernel", value: 20)
!755 = !DIEnumerator(name: "RingKernel", value: 21)
!756 = !DIEnumerator(name: "PeaksKernel", value: 22)
!757 = !DIEnumerator(name: "EdgesKernel", value: 23)
!758 = !DIEnumerator(name: "CornersKernel", value: 24)
!759 = !DIEnumerator(name: "DiagonalsKernel", value: 25)
!760 = !DIEnumerator(name: "LineEndsKernel", value: 26)
!761 = !DIEnumerator(name: "LineJunctionsKernel", value: 27)
!762 = !DIEnumerator(name: "RidgesKernel", value: 28)
!763 = !DIEnumerator(name: "ConvexHullKernel", value: 29)
!764 = !DIEnumerator(name: "ThinSEKernel", value: 30)
!765 = !DIEnumerator(name: "SkeletonKernel", value: 31)
!766 = !DIEnumerator(name: "ChebyshevKernel", value: 32)
!767 = !DIEnumerator(name: "ManhattanKernel", value: 33)
!768 = !DIEnumerator(name: "OctagonalKernel", value: 34)
!769 = !DIEnumerator(name: "EuclideanKernel", value: 35)
!770 = !DIEnumerator(name: "UserDefinedKernel", value: 36)
!771 = !DIEnumerator(name: "BinomialKernel", value: 37)
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !773, line: 25, baseType: !7, size: 32, elements: !774)
!773 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783}
!775 = !DIEnumerator(name: "UndefinedResource", value: 0)
!776 = !DIEnumerator(name: "AreaResource", value: 1)
!777 = !DIEnumerator(name: "DiskResource", value: 2)
!778 = !DIEnumerator(name: "FileResource", value: 3)
!779 = !DIEnumerator(name: "MapResource", value: 4)
!780 = !DIEnumerator(name: "MemoryResource", value: 5)
!781 = !DIEnumerator(name: "ThreadResource", value: 6)
!782 = !DIEnumerator(name: "TimeResource", value: 7)
!783 = !DIEnumerator(name: "ThrottleResource", value: 8)
!784 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !785, line: 46, baseType: !7, size: 32, elements: !786)
!785 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!787 = !DIEnumerator(name: "_ISupper", value: 256)
!788 = !DIEnumerator(name: "_ISlower", value: 512)
!789 = !DIEnumerator(name: "_ISalpha", value: 1024)
!790 = !DIEnumerator(name: "_ISdigit", value: 2048)
!791 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!792 = !DIEnumerator(name: "_ISspace", value: 8192)
!793 = !DIEnumerator(name: "_ISprint", value: 16384)
!794 = !DIEnumerator(name: "_ISgraph", value: 32768)
!795 = !DIEnumerator(name: "_ISblank", value: 1)
!796 = !DIEnumerator(name: "_IScntrl", value: 2)
!797 = !DIEnumerator(name: "_ISpunct", value: 4)
!798 = !DIEnumerator(name: "_ISalnum", value: 8)
!799 = !{!800, !801, !805, !806, !808, !809, !812, !813, !818, !1024, !855, !829, !1032, !841, !846, !1034, !1036, !943, !1040, !1052, !7, !1053, !946, !1058, !1111, !1191, !1225, !1229, !1230, !1231, !1232, !1243, !811, !847, !1252, !938}
!800 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !803, line: 26, baseType: !804)
!803 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !803, line: 25, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!808 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !811)
!811 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !814, line: 77, baseType: !815)
!814 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !816, line: 193, baseType: !817)
!816 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!817 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !80, line: 221, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !152, line: 150, size: 105920, elements: !821)
!821 = !{!822, !824, !826, !828, !831, !833, !835, !836, !837, !838, !839, !840, !851, !852, !853, !854, !856, !870, !872, !873, !875, !876, !877, !878, !879, !880, !881, !889, !890, !891, !892, !893, !894, !896, !898, !900, !902, !904, !906, !908, !909, !910, !911, !912, !913, !914, !922, !937, !951, !952, !953, !954, !958, !962, !966, !967, !968, !969, !970, !983, !984, !986, !987, !995, !996, !998, !999, !1000, !1001, !1002, !1003, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1013, !1014, !1015, !1016, !1017, !1021, !1023}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !820, file: !152, line: 153, baseType: !823, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !80, line: 209, baseType: !84)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !820, file: !152, line: 156, baseType: !825, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !90, line: 61, baseType: !89)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !820, file: !152, line: 159, baseType: !827, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !127, line: 49, baseType: !126)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !820, file: !152, line: 162, baseType: !829, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !830, line: 46, baseType: !800)
!830 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!831 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !820, file: !152, line: 165, baseType: !832, size: 32, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !152, line: 86, baseType: !151)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !820, file: !152, line: 168, baseType: !834, size: 32, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !80, line: 215, baseType: !79)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !820, file: !152, line: 169, baseType: !834, size: 32, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !820, file: !152, line: 172, baseType: !829, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !820, file: !152, line: 173, baseType: !829, size: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !820, file: !152, line: 174, baseType: !829, size: 64, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !820, file: !152, line: 175, baseType: !829, size: 64, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !820, file: !152, line: 178, baseType: !841, size: 64, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !328, line: 148, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !328, line: 131, size: 64, elements: !844)
!844 = !{!845, !848, !849, !850}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !843, file: !328, line: 143, baseType: !846, size: 16)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !80, line: 93, baseType: !847)
!847 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !843, file: !328, line: 144, baseType: !846, size: 16, offset: 16)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !843, file: !328, line: 145, baseType: !846, size: 16, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !843, file: !328, line: 146, baseType: !846, size: 16, offset: 48)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !820, file: !152, line: 179, baseType: !842, size: 64, offset: 640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !820, file: !152, line: 180, baseType: !842, size: 64, offset: 704)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !820, file: !152, line: 181, baseType: !842, size: 64, offset: 768)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !820, file: !152, line: 184, baseType: !855, size: 64, offset: 832)
!855 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !820, file: !152, line: 187, baseType: !857, size: 768, offset: 896)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !152, line: 128, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !152, line: 121, size: 768, elements: !859)
!859 = !{!860, !867, !868, !869}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !858, file: !152, line: 124, baseType: !861, size: 192)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !152, line: 101, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !152, line: 95, size: 192, elements: !863)
!863 = !{!864, !865, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !862, file: !152, line: 98, baseType: !855, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !862, file: !152, line: 99, baseType: !855, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !862, file: !152, line: 100, baseType: !855, size: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !858, file: !152, line: 125, baseType: !861, size: 192, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !858, file: !152, line: 126, baseType: !861, size: 192, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !858, file: !152, line: 127, baseType: !861, size: 192, offset: 576)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !820, file: !152, line: 190, baseType: !871, size: 32, offset: 1664)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !164, line: 49, baseType: !163)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !820, file: !152, line: 193, baseType: !805, size: 64, offset: 1728)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !820, file: !152, line: 196, baseType: !874, size: 32, offset: 1792)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !152, line: 93, baseType: !171)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !820, file: !152, line: 199, baseType: !806, size: 64, offset: 1856)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !820, file: !152, line: 200, baseType: !806, size: 64, offset: 1920)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !820, file: !152, line: 201, baseType: !806, size: 64, offset: 1984)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !820, file: !152, line: 204, baseType: !813, size: 64, offset: 2048)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !820, file: !152, line: 207, baseType: !855, size: 64, offset: 2112)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !820, file: !152, line: 208, baseType: !855, size: 64, offset: 2176)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !820, file: !152, line: 211, baseType: !882, size: 256, offset: 2240)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !228, line: 130, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !228, line: 121, size: 256, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !883, file: !228, line: 124, baseType: !829, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !883, file: !228, line: 125, baseType: !829, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !883, file: !228, line: 128, baseType: !813, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !883, file: !228, line: 129, baseType: !813, size: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !820, file: !152, line: 212, baseType: !882, size: 256, offset: 2496)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !820, file: !152, line: 213, baseType: !882, size: 256, offset: 2752)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !820, file: !152, line: 216, baseType: !855, size: 64, offset: 3008)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !820, file: !152, line: 217, baseType: !855, size: 64, offset: 3072)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !820, file: !152, line: 218, baseType: !855, size: 64, offset: 3136)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !820, file: !152, line: 221, baseType: !895, size: 32, offset: 3200)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !177, line: 66, baseType: !176)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !820, file: !152, line: 224, baseType: !897, size: 32, offset: 3232)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !152, line: 73, baseType: !211)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !820, file: !152, line: 227, baseType: !899, size: 32, offset: 3264)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !222, line: 35, baseType: !221)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !820, file: !152, line: 230, baseType: !901, size: 32, offset: 3296)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !228, line: 91, baseType: !227)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !820, file: !152, line: 233, baseType: !903, size: 32, offset: 3328)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !243, line: 99, baseType: !242)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !820, file: !152, line: 236, baseType: !905, size: 32, offset: 3360)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !314, line: 32, baseType: !313)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !820, file: !152, line: 239, baseType: !907, size: 64, offset: 3392)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !820, file: !152, line: 242, baseType: !829, size: 64, offset: 3456)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !820, file: !152, line: 243, baseType: !829, size: 64, offset: 3520)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !820, file: !152, line: 246, baseType: !813, size: 64, offset: 3584)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !820, file: !152, line: 249, baseType: !829, size: 64, offset: 3648)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !820, file: !152, line: 250, baseType: !829, size: 64, offset: 3712)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !820, file: !152, line: 253, baseType: !813, size: 64, offset: 3776)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !820, file: !152, line: 256, baseType: !915, size: 192, offset: 3840)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !916, line: 68, baseType: !917)
!916 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !916, line: 62, size: 192, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !917, file: !916, line: 65, baseType: !855, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !917, file: !916, line: 66, baseType: !855, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !917, file: !916, line: 67, baseType: !855, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !820, file: !152, line: 259, baseType: !923, size: 512, offset: 4032)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !322, line: 51, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !322, line: 40, size: 512, elements: !925)
!925 = !{!926, !933, !934, !936}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !924, file: !322, line: 43, baseType: !927, size: 192)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !322, line: 38, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !322, line: 32, size: 192, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !928, file: !322, line: 35, baseType: !855, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !928, file: !322, line: 36, baseType: !855, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !928, file: !322, line: 37, baseType: !855, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !924, file: !322, line: 44, baseType: !927, size: 192, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !924, file: !322, line: 47, baseType: !935, size: 32, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !322, line: 30, baseType: !321)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !924, file: !322, line: 50, baseType: !829, size: 64, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !820, file: !152, line: 262, baseType: !938, size: 64, offset: 4544)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !939, line: 26, baseType: !940)
!939 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!834, !943, !945, !948, !805}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !80, line: 150, baseType: !947)
!947 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !80, line: 151, baseType: !950)
!950 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !820, file: !152, line: 265, baseType: !805, size: 64, offset: 4608)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !820, file: !152, line: 266, baseType: !805, size: 64, offset: 4672)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !820, file: !152, line: 267, baseType: !805, size: 64, offset: 4736)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !820, file: !152, line: 270, baseType: !955, size: 64, offset: 4800)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !127, line: 52, baseType: !957)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !127, line: 51, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !820, file: !152, line: 273, baseType: !959, size: 64, offset: 4864)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !80, line: 217, baseType: !961)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !80, line: 217, flags: DIFlagFwdDecl)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !820, file: !152, line: 276, baseType: !963, size: 32768, offset: 4928)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 32768, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 4096)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !820, file: !152, line: 277, baseType: !963, size: 32768, offset: 37696)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !820, file: !152, line: 278, baseType: !963, size: 32768, offset: 70464)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !820, file: !152, line: 281, baseType: !829, size: 64, offset: 103232)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !820, file: !152, line: 282, baseType: !829, size: 64, offset: 103296)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !820, file: !152, line: 285, baseType: !971, size: 448, offset: 103360)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !80, line: 219, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !6, line: 102, size: 448, elements: !973)
!973 = !{!974, !976, !977, !978, !979, !980, !981, !982}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !972, file: !6, line: 105, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !6, line: 100, baseType: !5)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !972, file: !6, line: 108, baseType: !808, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !972, file: !6, line: 111, baseType: !806, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !972, file: !6, line: 112, baseType: !806, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !972, file: !6, line: 115, baseType: !805, size: 64, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !972, file: !6, line: 118, baseType: !834, size: 32, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !972, file: !6, line: 121, baseType: !801, size: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !972, file: !6, line: 124, baseType: !829, size: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !820, file: !152, line: 288, baseType: !834, size: 32, offset: 103808)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !820, file: !152, line: 291, baseType: !985, size: 64, offset: 103872)
!985 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !813)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !820, file: !152, line: 294, baseType: !801, size: 64, offset: 103936)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !820, file: !152, line: 297, baseType: !988, size: 256, offset: 104000)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !164, line: 40, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !164, line: 27, size: 256, elements: !990)
!990 = !{!991, !992, !993, !994}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !164, line: 30, baseType: !806, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !989, file: !164, line: 33, baseType: !829, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !989, file: !164, line: 36, baseType: !812, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !989, file: !164, line: 39, baseType: !829, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !820, file: !152, line: 298, baseType: !988, size: 256, offset: 104256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !820, file: !152, line: 299, baseType: !997, size: 64, offset: 104512)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !820, file: !152, line: 302, baseType: !829, size: 64, offset: 104576)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !820, file: !152, line: 305, baseType: !829, size: 64, offset: 104640)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !820, file: !152, line: 308, baseType: !907, size: 64, offset: 104704)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !820, file: !152, line: 309, baseType: !907, size: 64, offset: 104768)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !152, line: 310, baseType: !907, size: 64, offset: 104832)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !820, file: !152, line: 313, baseType: !1004, size: 32, offset: 104896)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !328, line: 47, baseType: !327)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !820, file: !152, line: 316, baseType: !834, size: 32, offset: 104928)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !820, file: !152, line: 319, baseType: !842, size: 64, offset: 104960)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !820, file: !152, line: 322, baseType: !907, size: 64, offset: 105024)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !820, file: !152, line: 325, baseType: !882, size: 256, offset: 105088)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !820, file: !152, line: 328, baseType: !805, size: 64, offset: 105344)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !820, file: !152, line: 329, baseType: !805, size: 64, offset: 105408)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !820, file: !152, line: 332, baseType: !1012, size: 32, offset: 105472)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !152, line: 61, baseType: !344)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !820, file: !152, line: 335, baseType: !834, size: 32, offset: 105504)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !820, file: !152, line: 338, baseType: !949, size: 64, offset: 105536)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !820, file: !152, line: 341, baseType: !834, size: 32, offset: 105600)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !820, file: !152, line: 344, baseType: !829, size: 64, offset: 105664)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !820, file: !152, line: 347, baseType: !1018, size: 64, offset: 105728)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1019, line: 7, baseType: !1020)
!1019 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !816, line: 160, baseType: !817)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !820, file: !152, line: 350, baseType: !1022, size: 32, offset: 105792)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !328, line: 79, baseType: !358)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !820, file: !152, line: 353, baseType: !829, size: 64, offset: 105856)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !152, line: 110, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !152, line: 103, size: 256, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !1026, file: !152, line: 106, baseType: !855, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !1026, file: !152, line: 107, baseType: !855, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !1026, file: !152, line: 108, baseType: !855, size: 64, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !1026, file: !152, line: 109, baseType: !855, size: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !80, line: 78, baseType: !1035)
!1035 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !1038, line: 26, baseType: !1039)
!1038 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !1038, line: 25, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageAttribute", file: !1043, line: 92, baseType: !1044)
!1043 = !DIFile(filename: "apps/538.imagick_r/src/magick/deprecate.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2d6afa9b821e0ac883ed87b773444171")
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageAttribute", file: !1043, line: 80, size: 320, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1051}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1044, file: !1043, line: 83, baseType: !806, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1044, file: !1043, line: 84, baseType: !806, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1044, file: !1043, line: 87, baseType: !834, size: 32, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1044, file: !1043, line: 90, baseType: !1050, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1044, file: !1043, line: 91, baseType: !1050, size: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "MonitorHandler", file: !1043, line: 77, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!834, !943, !945, !948, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1060, line: 7, baseType: !1061)
!1060 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1062, line: 49, size: 1728, elements: !1063)
!1062 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1079, !1081, !1082, !1083, !1085, !1086, !1088, !1092, !1095, !1097, !1100, !1103, !1104, !1105, !1106, !1107}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1061, file: !1062, line: 51, baseType: !808, size: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1061, file: !1062, line: 54, baseType: !806, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1061, file: !1062, line: 55, baseType: !806, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1061, file: !1062, line: 56, baseType: !806, size: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1061, file: !1062, line: 57, baseType: !806, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1061, file: !1062, line: 58, baseType: !806, size: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1061, file: !1062, line: 59, baseType: !806, size: 64, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1061, file: !1062, line: 60, baseType: !806, size: 64, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1061, file: !1062, line: 61, baseType: !806, size: 64, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1061, file: !1062, line: 64, baseType: !806, size: 64, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1061, file: !1062, line: 65, baseType: !806, size: 64, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1061, file: !1062, line: 66, baseType: !806, size: 64, offset: 704)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1061, file: !1062, line: 68, baseType: !1077, size: 64, offset: 768)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1062, line: 36, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1061, file: !1062, line: 70, baseType: !1080, size: 64, offset: 832)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1061, file: !1062, line: 72, baseType: !808, size: 32, offset: 896)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1061, file: !1062, line: 73, baseType: !808, size: 32, offset: 928)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1061, file: !1062, line: 74, baseType: !1084, size: 64, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !816, line: 152, baseType: !817)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1061, file: !1062, line: 77, baseType: !847, size: 16, offset: 1024)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1061, file: !1062, line: 78, baseType: !1087, size: 8, offset: 1040)
!1087 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1061, file: !1062, line: 79, baseType: !1089, size: 8, offset: 1048)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 8, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 1)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1061, file: !1062, line: 81, baseType: !1093, size: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1062, line: 43, baseType: null)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1061, file: !1062, line: 89, baseType: !1096, size: 64, offset: 1152)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !816, line: 153, baseType: !817)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1061, file: !1062, line: 91, baseType: !1098, size: 64, offset: 1216)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1062, line: 37, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1061, file: !1062, line: 92, baseType: !1101, size: 64, offset: 1280)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1062, line: 38, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1061, file: !1062, line: 93, baseType: !1080, size: 64, offset: 1344)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1061, file: !1062, line: 94, baseType: !805, size: 64, offset: 1408)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1061, file: !1062, line: 95, baseType: !829, size: 64, offset: 1472)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1061, file: !1062, line: 96, baseType: !808, size: 32, offset: 1536)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1061, file: !1062, line: 98, baseType: !1108, size: 160, offset: 1568)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 160, elements: !1109)
!1109 = !{!1110}
!1110 = !DISubrange(count: 20)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !80, line: 223, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !152, line: 356, size: 134336, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1150, !1151, !1152, !1153, !1154, !1155, !1157, !1158, !1159, !1160, !1161, !1162, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1188, !1189, !1190}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1114, file: !152, line: 359, baseType: !827, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !1114, file: !152, line: 362, baseType: !832, size: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !1114, file: !152, line: 365, baseType: !834, size: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !1114, file: !152, line: 366, baseType: !834, size: 32, offset: 96)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !1114, file: !152, line: 367, baseType: !834, size: 32, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !1114, file: !152, line: 368, baseType: !834, size: 32, offset: 160)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !152, line: 371, baseType: !806, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !1114, file: !152, line: 372, baseType: !806, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !1114, file: !152, line: 373, baseType: !806, size: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !1114, file: !152, line: 374, baseType: !806, size: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1114, file: !152, line: 377, baseType: !829, size: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !1114, file: !152, line: 378, baseType: !829, size: 64, offset: 512)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1114, file: !152, line: 379, baseType: !829, size: 64, offset: 576)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !1114, file: !152, line: 382, baseType: !897, size: 32, offset: 640)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !1114, file: !152, line: 385, baseType: !899, size: 32, offset: 672)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1114, file: !152, line: 388, baseType: !874, size: 32, offset: 704)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1114, file: !152, line: 391, baseType: !829, size: 64, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !1114, file: !152, line: 394, baseType: !806, size: 64, offset: 832)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !1114, file: !152, line: 395, baseType: !806, size: 64, offset: 896)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1114, file: !152, line: 396, baseType: !806, size: 64, offset: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !1114, file: !152, line: 397, baseType: !806, size: 64, offset: 1024)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1114, file: !152, line: 398, baseType: !806, size: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !1114, file: !152, line: 401, baseType: !855, size: 64, offset: 1152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1114, file: !152, line: 402, baseType: !855, size: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !1114, file: !152, line: 405, baseType: !842, size: 64, offset: 1280)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1114, file: !152, line: 406, baseType: !842, size: 64, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !1114, file: !152, line: 407, baseType: !842, size: 64, offset: 1408)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1114, file: !152, line: 410, baseType: !834, size: 32, offset: 1472)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !1114, file: !152, line: 411, baseType: !834, size: 32, offset: 1504)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1114, file: !152, line: 414, baseType: !829, size: 64, offset: 1536)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1114, file: !152, line: 417, baseType: !825, size: 32, offset: 1600)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1114, file: !152, line: 420, baseType: !1012, size: 32, offset: 1632)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !1114, file: !152, line: 423, baseType: !1149, size: 32, offset: 1664)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !424, line: 59, baseType: !423)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1114, file: !152, line: 426, baseType: !813, size: 64, offset: 1728)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !1114, file: !152, line: 429, baseType: !834, size: 32, offset: 1792)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !1114, file: !152, line: 430, baseType: !834, size: 32, offset: 1824)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1114, file: !152, line: 433, baseType: !806, size: 64, offset: 1856)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !1114, file: !152, line: 434, baseType: !806, size: 64, offset: 1920)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !1114, file: !152, line: 437, baseType: !1156, size: 32, offset: 1984)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !80, line: 202, baseType: !456)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1114, file: !152, line: 440, baseType: !818, size: 64, offset: 2048)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1114, file: !152, line: 443, baseType: !805, size: 64, offset: 2112)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !1114, file: !152, line: 446, baseType: !938, size: 64, offset: 2176)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1114, file: !152, line: 449, baseType: !805, size: 64, offset: 2240)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1114, file: !152, line: 450, baseType: !805, size: 64, offset: 2304)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1114, file: !152, line: 453, baseType: !1163, size: 64, offset: 2368)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1164, line: 26, baseType: !1165)
!1164 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!829, !1168, !1170, !1172}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1114, file: !152, line: 456, baseType: !1058, size: 64, offset: 2432)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !1114, file: !152, line: 459, baseType: !805, size: 64, offset: 2496)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1114, file: !152, line: 462, baseType: !829, size: 64, offset: 2560)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !1114, file: !152, line: 465, baseType: !963, size: 32768, offset: 2624)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !1114, file: !152, line: 466, baseType: !963, size: 32768, offset: 35392)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !1114, file: !152, line: 467, baseType: !963, size: 32768, offset: 68160)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1114, file: !152, line: 468, baseType: !963, size: 32768, offset: 100928)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1114, file: !152, line: 471, baseType: !834, size: 32, offset: 133696)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1114, file: !152, line: 474, baseType: !806, size: 64, offset: 133760)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !1114, file: !152, line: 477, baseType: !829, size: 64, offset: 133824)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !1114, file: !152, line: 478, baseType: !829, size: 64, offset: 133888)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !1114, file: !152, line: 481, baseType: !842, size: 64, offset: 133952)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1114, file: !152, line: 484, baseType: !829, size: 64, offset: 134016)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !1114, file: !152, line: 487, baseType: !1187, size: 32, offset: 134080)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !396, line: 47, baseType: !395)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !1114, file: !152, line: 490, baseType: !842, size: 64, offset: 134112)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1114, file: !152, line: 493, baseType: !805, size: 64, offset: 134208)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !1114, file: !152, line: 496, baseType: !834, size: 32, offset: 134272)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumInfo", file: !222, line: 85, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumInfo", file: !1194, line: 42, size: 1216, elements: !1195)
!1194 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!1195 = !{!1196, !1197, !1198, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1208, !1209, !1211, !1212, !1213, !1223, !1224}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1193, file: !1194, line: 45, baseType: !829, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !1193, file: !1194, line: 46, baseType: !829, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1193, file: !1194, line: 49, baseType: !1199, size: 32, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumFormatType", file: !222, line: 50, baseType: !720)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !1193, file: !1194, line: 52, baseType: !855, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !1193, file: !1194, line: 53, baseType: !855, size: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1193, file: !1194, line: 54, baseType: !855, size: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1193, file: !1194, line: 57, baseType: !829, size: 64, offset: 384)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "min_is_white", scope: !1193, file: !1194, line: 60, baseType: !834, size: 32, offset: 448)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !1193, file: !1194, line: 61, baseType: !834, size: 32, offset: 480)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_type", scope: !1193, file: !1194, line: 64, baseType: !1207, size: 32, offset: 512)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAlphaType", file: !222, line: 42, baseType: !726)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !1193, file: !1194, line: 67, baseType: !829, size: 64, offset: 576)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !1193, file: !1194, line: 70, baseType: !1210, size: 64, offset: 640)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !1193, file: !1194, line: 73, baseType: !829, size: 64, offset: 704)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !1193, file: !1194, line: 76, baseType: !899, size: 32, offset: 768)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1193, file: !1194, line: 79, baseType: !1214, size: 256, offset: 832)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumState", file: !1194, line: 40, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumState", file: !1194, line: 27, size: 256, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_scale", scope: !1215, file: !1194, line: 30, baseType: !855, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !1215, file: !1194, line: 33, baseType: !7, size: 32, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1215, file: !1194, line: 36, baseType: !829, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1215, file: !1194, line: 39, baseType: !1221, size: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1193, file: !1194, line: 82, baseType: !801, size: 64, offset: 1088)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1193, file: !1194, line: 85, baseType: !829, size: 64, offset: 1152)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !396, line: 50, baseType: !1228)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !328, line: 160, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !328, line: 129, baseType: !846)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfo", file: !732, line: 128, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernelInfo", file: !732, line: 102, size: 832, elements: !1235)
!1235 = !{!1236, !1238, !1239, !1240, !1241, !1242, !1244, !1245, !1246, !1247, !1248, !1249, !1251}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1234, file: !732, line: 105, baseType: !1237, size: 32)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfoType", file: !732, line: 67, baseType: !731)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1234, file: !732, line: 108, baseType: !829, size: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1234, file: !732, line: 109, baseType: !829, size: 64, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1234, file: !732, line: 112, baseType: !813, size: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1234, file: !732, line: 113, baseType: !813, size: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1234, file: !732, line: 116, baseType: !1243, size: 64, offset: 320)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !1234, file: !732, line: 117, baseType: !855, size: 64, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !1234, file: !732, line: 118, baseType: !855, size: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "negative_range", scope: !1234, file: !732, line: 119, baseType: !855, size: 64, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "positive_range", scope: !1234, file: !732, line: 120, baseType: !855, size: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !1234, file: !732, line: 121, baseType: !855, size: 64, offset: 640)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1234, file: !732, line: 124, baseType: !1250, size: 64, offset: 704)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1234, file: !732, line: 127, baseType: !829, size: 64, offset: 768)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1230)
!1254 = !{!1255, !1294, !1299, !1304, !1306, !1320, !0}
!1255 = !DIGlobalVariableExpression(var: !1256, expr: !DIExpression())
!1256 = distinct !DIGlobalVariable(name: "o2", scope: !1257, file: !1258, line: 5896, type: !1291, isLocal: true, isDefinition: true)
!1257 = distinct !DISubprogram(name: "RandomChannelThresholdImage", scope: !1258, file: !1258, line: 5879, type: !1259, scopeLine: 5881, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1261)
!1258 = !DIFile(filename: "apps/538.imagick_r/src/magick/deprecate.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ea0f0ba6b5a3137b5a56e726fe3abc42")
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!7, !818, !943, !943, !1057}
!1261 = !{!1262, !1263, !1264, !1265, !1266, !1267, !1268, !1273, !1274, !1275, !1276, !1280, !1281, !1283, !1285}
!1262 = !DILocalVariable(name: "image", arg: 1, scope: !1257, file: !1258, line: 5879, type: !818)
!1263 = !DILocalVariable(name: "channel", arg: 2, scope: !1257, file: !1258, line: 5880, type: !943)
!1264 = !DILocalVariable(name: "thresholds", arg: 3, scope: !1257, file: !1258, line: 5880, type: !943)
!1265 = !DILocalVariable(name: "exception", arg: 4, scope: !1257, file: !1258, line: 5880, type: !1057)
!1266 = !DILocalVariable(name: "lower_threshold", scope: !1257, file: !1258, line: 5885, type: !855)
!1267 = !DILocalVariable(name: "upper_threshold", scope: !1257, file: !1258, line: 5886, type: !855)
!1268 = !DILocalVariable(name: "random_info", scope: !1257, file: !1258, line: 5889, type: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !1271, line: 31, baseType: !1272)
!1271 = !DIFile(filename: "apps/538.imagick_r/src/magick/random_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "95f31caf92e8a7cab5b1bf8cc3698f31")
!1272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !1271, line: 30, flags: DIFlagFwdDecl)
!1273 = !DILocalVariable(name: "count", scope: !1257, file: !1258, line: 5892, type: !813)
!1274 = !DILocalVariable(name: "y", scope: !1257, file: !1258, line: 5893, type: !813)
!1275 = !DILocalVariable(name: "order", scope: !1257, file: !1258, line: 5903, type: !829)
!1276 = !DILocalVariable(name: "x", scope: !1277, file: !1258, line: 5956, type: !813)
!1277 = distinct !DILexicalBlock(scope: !1278, file: !1258, line: 5954, column: 3)
!1278 = distinct !DILexicalBlock(scope: !1279, file: !1258, line: 5953, column: 3)
!1279 = distinct !DILexicalBlock(scope: !1257, file: !1258, line: 5953, column: 3)
!1280 = !DILocalVariable(name: "index", scope: !1277, file: !1258, line: 5959, type: !1230)
!1281 = !DILocalVariable(name: "indexes", scope: !1277, file: !1258, line: 5960, type: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1231)
!1283 = !DILocalVariable(name: "q", scope: !1277, file: !1258, line: 5963, type: !1284)
!1284 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !841)
!1285 = !DILocalVariable(name: "intensity", scope: !1286, file: !1258, line: 5975, type: !1034)
!1286 = distinct !DILexicalBlock(scope: !1287, file: !1258, line: 5973, column: 9)
!1287 = distinct !DILexicalBlock(scope: !1288, file: !1258, line: 5972, column: 9)
!1288 = distinct !DILexicalBlock(scope: !1289, file: !1258, line: 5972, column: 9)
!1289 = distinct !DILexicalBlock(scope: !1290, file: !1258, line: 5970, column: 7)
!1290 = distinct !DILexicalBlock(scope: !1277, file: !1258, line: 5968, column: 9)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 128, elements: !1292)
!1292 = !{!1293}
!1293 = !DISubrange(count: 4)
!1294 = !DIGlobalVariableExpression(var: !1295, expr: !DIExpression())
!1295 = distinct !DIGlobalVariable(name: "o3", scope: !1257, file: !1258, line: 5897, type: !1296, isLocal: true, isDefinition: true)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 288, elements: !1297)
!1297 = !{!1298}
!1298 = !DISubrange(count: 9)
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(name: "o4", scope: !1257, file: !1258, line: 5898, type: !1301, isLocal: true, isDefinition: true)
!1301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 512, elements: !1302)
!1302 = !{!1303}
!1303 = !DISubrange(count: 16)
!1304 = !DIGlobalVariableExpression(var: !1305, expr: !DIExpression())
!1305 = distinct !DIGlobalVariable(name: "threshold", scope: !1257, file: !1258, line: 5900, type: !1034, isLocal: true, isDefinition: true)
!1306 = !DIGlobalVariableExpression(var: !1307, expr: !DIExpression())
!1307 = distinct !DIGlobalVariable(name: "id", scope: !1308, file: !1258, line: 6659, type: !813, isLocal: true, isDefinition: true)
!1308 = distinct !DISubprogram(name: "SetMagickRegistry", scope: !1258, file: !1258, line: 6649, type: !1309, scopeLine: 6651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1313)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!813, !1311, !1170, !1172, !1057}
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegistryType", file: !673, line: 31, baseType: !672)
!1313 = !{!1314, !1315, !1316, !1317, !1318, !1319}
!1314 = !DILocalVariable(name: "type", arg: 1, scope: !1308, file: !1258, line: 6649, type: !1311)
!1315 = !DILocalVariable(name: "blob", arg: 2, scope: !1308, file: !1258, line: 6649, type: !1170)
!1316 = !DILocalVariable(name: "length", arg: 3, scope: !1308, file: !1258, line: 6650, type: !1172)
!1317 = !DILocalVariable(name: "exception", arg: 4, scope: !1308, file: !1258, line: 6650, type: !1057)
!1318 = !DILocalVariable(name: "key", scope: !1308, file: !1258, line: 6653, type: !963)
!1319 = !DILocalVariable(name: "status", scope: !1308, file: !1258, line: 6656, type: !834)
!1320 = !DIGlobalVariableExpression(var: !1321, expr: !DIExpression())
!1321 = distinct !DIGlobalVariable(name: "active_mutex", scope: !2, file: !1322, line: 40, type: !834, isLocal: true, isDefinition: true)
!1322 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "25c836cd0948f430546708db695ca37c")
!1323 = !{i32 7, !"Dwarf Version", i32 5}
!1324 = !{i32 2, !"Debug Info Version", i32 3}
!1325 = !{i32 1, !"wchar_size", i32 4}
!1326 = !{i32 7, !"PIC Level", i32 2}
!1327 = !{i32 7, !"PIE Level", i32 2}
!1328 = !{i32 7, !"uwtable", i32 2}
!1329 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1330 = distinct !DISubprogram(name: "AcquireCacheViewIndexes", scope: !1258, file: !1258, line: 129, type: !1331, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1333)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!1252, !1225}
!1333 = !{!1334}
!1334 = !DILocalVariable(name: "cache_view", arg: 1, scope: !1330, file: !1258, line: 130, type: !1225)
!1335 = !DILocation(line: 0, scope: !1330)
!1336 = !DILocation(line: 132, column: 10, scope: !1330)
!1337 = !DILocation(line: 132, column: 3, scope: !1330)
!1338 = !DISubprogram(name: "GetCacheViewVirtualIndexQueue", scope: !396, file: !396, line: 66, type: !1331, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1339 = !{}
!1340 = distinct !DISubprogram(name: "AcquireCacheViewPixels", scope: !1258, file: !1258, line: 170, type: !1341, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1344)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!1032, !1225, !1343, !1343, !1172, !1172, !1057}
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!1344 = !{!1345, !1346, !1347, !1348, !1349, !1350}
!1345 = !DILocalVariable(name: "cache_view", arg: 1, scope: !1340, file: !1258, line: 171, type: !1225)
!1346 = !DILocalVariable(name: "x", arg: 2, scope: !1340, file: !1258, line: 171, type: !1343)
!1347 = !DILocalVariable(name: "y", arg: 3, scope: !1340, file: !1258, line: 171, type: !1343)
!1348 = !DILocalVariable(name: "columns", arg: 4, scope: !1340, file: !1258, line: 172, type: !1172)
!1349 = !DILocalVariable(name: "rows", arg: 5, scope: !1340, file: !1258, line: 172, type: !1172)
!1350 = !DILocalVariable(name: "exception", arg: 6, scope: !1340, file: !1258, line: 172, type: !1057)
!1351 = !DILocation(line: 0, scope: !1340)
!1352 = !DILocation(line: 174, column: 10, scope: !1340)
!1353 = !DILocation(line: 174, column: 3, scope: !1340)
!1354 = !DISubprogram(name: "GetCacheViewVirtualPixels", scope: !396, file: !396, line: 69, type: !1341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1355 = distinct !DISubprogram(name: "AcquireImagePixels", scope: !1258, file: !1258, line: 229, type: !1356, scopeLine: 232, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1358)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!1032, !1168, !1343, !1343, !1172, !1172, !1057}
!1358 = !{!1359, !1360, !1361, !1362, !1363, !1364}
!1359 = !DILocalVariable(name: "image", arg: 1, scope: !1355, file: !1258, line: 229, type: !1168)
!1360 = !DILocalVariable(name: "x", arg: 2, scope: !1355, file: !1258, line: 230, type: !1343)
!1361 = !DILocalVariable(name: "y", arg: 3, scope: !1355, file: !1258, line: 230, type: !1343)
!1362 = !DILocalVariable(name: "columns", arg: 4, scope: !1355, file: !1258, line: 230, type: !1172)
!1363 = !DILocalVariable(name: "rows", arg: 5, scope: !1355, file: !1258, line: 231, type: !1172)
!1364 = !DILocalVariable(name: "exception", arg: 6, scope: !1355, file: !1258, line: 231, type: !1057)
!1365 = !DILocation(line: 0, scope: !1355)
!1366 = !DILocation(line: 233, column: 10, scope: !1355)
!1367 = !DILocation(line: 233, column: 3, scope: !1355)
!1368 = !DISubprogram(name: "GetVirtualPixels", scope: !1369, file: !1369, line: 44, type: !1356, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1369 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "71eb387e577d57b17607c7f6f5128e97")
!1370 = distinct !DISubprogram(name: "AcquireIndexes", scope: !1258, file: !1258, line: 268, type: !1371, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1373)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!1252, !1168}
!1373 = !{!1374}
!1374 = !DILocalVariable(name: "image", arg: 1, scope: !1370, file: !1258, line: 268, type: !1168)
!1375 = !DILocation(line: 0, scope: !1370)
!1376 = !DILocation(line: 270, column: 10, scope: !1370)
!1377 = !DILocation(line: 270, column: 3, scope: !1370)
!1378 = !DISubprogram(name: "GetVirtualIndexQueue", scope: !1369, file: !1369, line: 41, type: !1371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1379 = distinct !DISubprogram(name: "AcquireMemory", scope: !1258, file: !1258, line: 296, type: !1380, scopeLine: 297, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1382)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{!805, !1172}
!1382 = !{!1383, !1384}
!1383 = !DILocalVariable(name: "size", arg: 1, scope: !1379, file: !1258, line: 296, type: !1172)
!1384 = !DILocalVariable(name: "allocation", scope: !1379, file: !1258, line: 299, type: !805)
!1385 = !DILocation(line: 0, scope: !1379)
!1386 = !DILocation(line: 302, column: 10, scope: !1379)
!1387 = !DILocation(line: 303, column: 14, scope: !1379)
!1388 = !DILocation(line: 304, column: 3, scope: !1379)
!1389 = !DISubprogram(name: "LogMagickEvent", scope: !371, file: !371, line: 83, type: !1390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!834, !1392, !943, !943, !1172, !943, null}
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1393)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !371, line: 58, baseType: !370)
!1394 = distinct !DISubprogram(name: "AcquireOneCacheViewPixel", scope: !1258, file: !1258, line: 343, type: !1395, scopeLine: 346, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1397)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!834, !1225, !1343, !1343, !841, !1057}
!1397 = !{!1398, !1399, !1400, !1401, !1402}
!1398 = !DILocalVariable(name: "cache_view", arg: 1, scope: !1394, file: !1258, line: 344, type: !1225)
!1399 = !DILocalVariable(name: "x", arg: 2, scope: !1394, file: !1258, line: 344, type: !1343)
!1400 = !DILocalVariable(name: "y", arg: 3, scope: !1394, file: !1258, line: 344, type: !1343)
!1401 = !DILocalVariable(name: "pixel", arg: 4, scope: !1394, file: !1258, line: 345, type: !841)
!1402 = !DILocalVariable(name: "exception", arg: 5, scope: !1394, file: !1258, line: 345, type: !1057)
!1403 = !DILocation(line: 0, scope: !1394)
!1404 = !DILocation(line: 347, column: 10, scope: !1394)
!1405 = !DILocation(line: 347, column: 3, scope: !1394)
!1406 = !DISubprogram(name: "GetOneCacheViewVirtualPixel", scope: !396, file: !396, line: 80, type: !1395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1407 = distinct !DISubprogram(name: "AcquireOneCacheViewVirtualPixel", scope: !1258, file: !1258, line: 390, type: !1408, scopeLine: 393, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1411)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!834, !1225, !1410, !1343, !1343, !841, !1057}
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1187)
!1411 = !{!1412, !1413, !1414, !1415, !1416, !1417, !1418}
!1412 = !DILocalVariable(name: "cache_view", arg: 1, scope: !1407, file: !1258, line: 391, type: !1225)
!1413 = !DILocalVariable(name: "virtual_pixel_method", arg: 2, scope: !1407, file: !1258, line: 391, type: !1410)
!1414 = !DILocalVariable(name: "x", arg: 3, scope: !1407, file: !1258, line: 392, type: !1343)
!1415 = !DILocalVariable(name: "y", arg: 4, scope: !1407, file: !1258, line: 392, type: !1343)
!1416 = !DILocalVariable(name: "pixel", arg: 5, scope: !1407, file: !1258, line: 392, type: !841)
!1417 = !DILocalVariable(name: "exception", arg: 6, scope: !1407, file: !1258, line: 392, type: !1057)
!1418 = !DILocalVariable(name: "status", scope: !1407, file: !1258, line: 395, type: !834)
!1419 = !DILocation(line: 0, scope: !1407)
!1420 = !DILocation(line: 397, column: 10, scope: !1407)
!1421 = !DILocation(line: 399, column: 3, scope: !1407)
!1422 = !DISubprogram(name: "GetOneCacheViewVirtualMethodPixel", scope: !396, file: !396, line: 82, type: !1408, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1423 = distinct !DISubprogram(name: "AcquireOneMagickPixel", scope: !1258, file: !1258, line: 436, type: !1424, scopeLine: 438, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1439)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!1426, !1168, !1343, !1343, !1057}
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !328, line: 127, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !328, line: 104, size: 448, elements: !1428)
!1428 = !{!1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !1427, file: !328, line: 107, baseType: !823, size: 32)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1427, file: !328, line: 110, baseType: !825, size: 32, offset: 32)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1427, file: !328, line: 113, baseType: !834, size: 32, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1427, file: !328, line: 116, baseType: !855, size: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1427, file: !328, line: 119, baseType: !829, size: 64, offset: 192)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1427, file: !328, line: 122, baseType: !1034, size: 32, offset: 256)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1427, file: !328, line: 123, baseType: !1034, size: 32, offset: 288)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1427, file: !328, line: 124, baseType: !1034, size: 32, offset: 320)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1427, file: !328, line: 125, baseType: !1034, size: 32, offset: 352)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1427, file: !328, line: 126, baseType: !1034, size: 32, offset: 384)
!1439 = !{!1440, !1441, !1442, !1443, !1444}
!1440 = !DILocalVariable(name: "image", arg: 1, scope: !1423, file: !1258, line: 436, type: !1168)
!1441 = !DILocalVariable(name: "x", arg: 2, scope: !1423, file: !1258, line: 437, type: !1343)
!1442 = !DILocalVariable(name: "y", arg: 3, scope: !1423, file: !1258, line: 437, type: !1343)
!1443 = !DILocalVariable(name: "exception", arg: 4, scope: !1423, file: !1258, line: 437, type: !1057)
!1444 = !DILocalVariable(name: "pixel", scope: !1423, file: !1258, line: 440, type: !1426)
!1445 = !DILocation(line: 0, scope: !1423)
!1446 = !DILocation(line: 440, column: 5, scope: !1423)
!1447 = !DILocation(line: 442, column: 10, scope: !1423)
!1448 = !DILocation(line: 443, column: 3, scope: !1423)
!1449 = !DISubprogram(name: "GetOneVirtualMagickPixel", scope: !1369, file: !1369, line: 56, type: !1450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!834, !1168, !1343, !1343, !1452, !1057}
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1453 = distinct !DISubprogram(name: "AcquireOnePixel", scope: !1258, file: !1258, line: 480, type: !1454, scopeLine: 482, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1456)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!842, !1168, !1343, !1343, !1057}
!1456 = !{!1457, !1458, !1459, !1460, !1461}
!1457 = !DILocalVariable(name: "image", arg: 1, scope: !1453, file: !1258, line: 480, type: !1168)
!1458 = !DILocalVariable(name: "x", arg: 2, scope: !1453, file: !1258, line: 480, type: !1343)
!1459 = !DILocalVariable(name: "y", arg: 3, scope: !1453, file: !1258, line: 481, type: !1343)
!1460 = !DILocalVariable(name: "exception", arg: 4, scope: !1453, file: !1258, line: 481, type: !1057)
!1461 = !DILocalVariable(name: "pixel", scope: !1453, file: !1258, line: 484, type: !842)
!1462 = !DILocation(line: 0, scope: !1453)
!1463 = !DILocation(line: 484, column: 5, scope: !1453)
!1464 = !DILocation(line: 486, column: 10, scope: !1453)
!1465 = !DILocation(line: 487, column: 3, scope: !1453)
!1466 = !DISubprogram(name: "GetOneVirtualPixel", scope: !1369, file: !1369, line: 58, type: !1467, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!834, !1168, !1343, !1343, !841, !1057}
!1469 = distinct !DISubprogram(name: "AcquireOneVirtualPixel", scope: !1258, file: !1258, line: 528, type: !1470, scopeLine: 531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1472)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!842, !1168, !1410, !1343, !1343, !1057}
!1472 = !{!1473, !1474, !1475, !1476, !1477, !1478}
!1473 = !DILocalVariable(name: "image", arg: 1, scope: !1469, file: !1258, line: 528, type: !1168)
!1474 = !DILocalVariable(name: "virtual_pixel_method", arg: 2, scope: !1469, file: !1258, line: 529, type: !1410)
!1475 = !DILocalVariable(name: "x", arg: 3, scope: !1469, file: !1258, line: 529, type: !1343)
!1476 = !DILocalVariable(name: "y", arg: 4, scope: !1469, file: !1258, line: 529, type: !1343)
!1477 = !DILocalVariable(name: "exception", arg: 5, scope: !1469, file: !1258, line: 530, type: !1057)
!1478 = !DILocalVariable(name: "pixel", scope: !1469, file: !1258, line: 533, type: !842)
!1479 = !DILocation(line: 0, scope: !1469)
!1480 = !DILocation(line: 533, column: 5, scope: !1469)
!1481 = !DILocation(line: 535, column: 10, scope: !1469)
!1482 = !DILocation(line: 537, column: 3, scope: !1469)
!1483 = !DISubprogram(name: "GetOneVirtualMethodPixel", scope: !1369, file: !1369, line: 60, type: !1484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!834, !1168, !1410, !1343, !1343, !841, !1057}
!1486 = distinct !DISubprogram(name: "AcquirePixels", scope: !1258, file: !1258, line: 567, type: !1487, scopeLine: 568, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1489)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!1032, !1168}
!1489 = !{!1490}
!1490 = !DILocalVariable(name: "image", arg: 1, scope: !1486, file: !1258, line: 567, type: !1168)
!1491 = !DILocation(line: 0, scope: !1486)
!1492 = !DILocation(line: 569, column: 10, scope: !1486)
!1493 = !DILocation(line: 569, column: 3, scope: !1486)
!1494 = !DISubprogram(name: "GetVirtualPixelQueue", scope: !1369, file: !1369, line: 46, type: !1487, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1495 = distinct !DISubprogram(name: "AcquireSemaphoreInfo", scope: !1258, file: !1258, line: 594, type: !1496, scopeLine: 595, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1499)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{null, !1498}
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!1499 = !{!1500}
!1500 = !DILocalVariable(name: "semaphore_info", arg: 1, scope: !1495, file: !1258, line: 594, type: !1498)
!1501 = !DILocation(line: 0, scope: !1495)
!1502 = !DILocation(line: 597, column: 7, scope: !1503)
!1503 = distinct !DILexicalBlock(scope: !1495, file: !1258, line: 597, column: 7)
!1504 = !{!1505, !1505, i64 0}
!1505 = !{!"any pointer", !1506, i64 0}
!1506 = !{!"omnipotent char", !1507, i64 0}
!1507 = !{!"Simple C/C++ TBAA"}
!1508 = !DILocation(line: 597, column: 23, scope: !1503)
!1509 = !DILocation(line: 597, column: 7, scope: !1495)
!1510 = !DILocation(line: 602, column: 25, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1512, file: !1258, line: 601, column: 11)
!1512 = distinct !DILexicalBlock(scope: !1503, file: !1258, line: 598, column: 5)
!1513 = !DILocation(line: 602, column: 24, scope: !1511)
!1514 = !DILocation(line: 604, column: 5, scope: !1512)
!1515 = !DILocation(line: 605, column: 1, scope: !1495)
!1516 = !DISubprogram(name: "AllocateSemaphoreInfo", scope: !803, file: !803, line: 32, type: !1517, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!801}
!1519 = distinct !DISubprogram(name: "AffinityImage", scope: !1258, file: !1258, line: 639, type: !1520, scopeLine: 641, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1535)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!834, !1522, !818, !1168}
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64)
!1523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1524)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantizeInfo", file: !417, line: 57, baseType: !1525)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantizeInfo", file: !417, line: 35, size: 384, elements: !1526)
!1526 = !{!1527, !1528, !1529, !1530, !1531, !1532, !1533}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "number_colors", scope: !1525, file: !417, line: 38, baseType: !829, size: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "tree_depth", scope: !1525, file: !417, line: 41, baseType: !829, size: 64, offset: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1525, file: !417, line: 44, baseType: !834, size: 32, offset: 128)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1525, file: !417, line: 47, baseType: !825, size: 32, offset: 160)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "measure_error", scope: !1525, file: !417, line: 50, baseType: !834, size: 32, offset: 192)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1525, file: !417, line: 53, baseType: !829, size: 64, offset: 256)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "dither_method", scope: !1525, file: !417, line: 56, baseType: !1534, size: 32, offset: 320)
!1534 = !DIDerivedType(tag: DW_TAG_typedef, name: "DitherMethod", file: !417, line: 33, baseType: !416)
!1535 = !{!1536, !1537, !1538}
!1536 = !DILocalVariable(name: "quantize_info", arg: 1, scope: !1519, file: !1258, line: 639, type: !1522)
!1537 = !DILocalVariable(name: "image", arg: 2, scope: !1519, file: !1258, line: 640, type: !818)
!1538 = !DILocalVariable(name: "affinity_image", arg: 3, scope: !1519, file: !1258, line: 640, type: !1168)
!1539 = !DILocation(line: 0, scope: !1519)
!1540 = !DILocation(line: 642, column: 10, scope: !1519)
!1541 = !DILocation(line: 642, column: 3, scope: !1519)
!1542 = !DISubprogram(name: "RemapImage", scope: !417, file: !417, line: 67, type: !1520, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1543 = distinct !DISubprogram(name: "AffinityImages", scope: !1258, file: !1258, line: 677, type: !1520, scopeLine: 679, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1544)
!1544 = !{!1545, !1546, !1547}
!1545 = !DILocalVariable(name: "quantize_info", arg: 1, scope: !1543, file: !1258, line: 677, type: !1522)
!1546 = !DILocalVariable(name: "images", arg: 2, scope: !1543, file: !1258, line: 678, type: !818)
!1547 = !DILocalVariable(name: "affinity_image", arg: 3, scope: !1543, file: !1258, line: 678, type: !1168)
!1548 = !DILocation(line: 0, scope: !1543)
!1549 = !DILocation(line: 680, column: 10, scope: !1543)
!1550 = !DILocation(line: 680, column: 3, scope: !1543)
!1551 = !DISubprogram(name: "RemapImages", scope: !417, file: !417, line: 68, type: !1520, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1552 = distinct !DISubprogram(name: "AllocateImage", scope: !1258, file: !1258, line: 712, type: !1553, scopeLine: 713, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1555)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!818, !1111}
!1555 = !{!1556}
!1556 = !DILocalVariable(name: "image_info", arg: 1, scope: !1552, file: !1258, line: 712, type: !1111)
!1557 = !DILocation(line: 0, scope: !1552)
!1558 = !DILocation(line: 714, column: 10, scope: !1552)
!1559 = !DILocation(line: 714, column: 3, scope: !1552)
!1560 = !DISubprogram(name: "AcquireImage", scope: !152, file: !152, line: 506, type: !1553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1561 = distinct !DISubprogram(name: "AllocateImageColormap", scope: !1258, file: !1258, line: 749, type: !1562, scopeLine: 751, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1564)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!834, !818, !1172}
!1564 = !{!1565, !1566}
!1565 = !DILocalVariable(name: "image", arg: 1, scope: !1561, file: !1258, line: 749, type: !818)
!1566 = !DILocalVariable(name: "colors", arg: 2, scope: !1561, file: !1258, line: 750, type: !1172)
!1567 = !DILocation(line: 0, scope: !1561)
!1568 = !DILocation(line: 752, column: 10, scope: !1561)
!1569 = !DILocation(line: 752, column: 3, scope: !1561)
!1570 = !DISubprogram(name: "AcquireImageColormap", scope: !1571, file: !1571, line: 26, type: !1562, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1571 = !DIFile(filename: "apps/538.imagick_r/src/magick/colormap.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9bbb8514638ae332109008c420bdb541")
!1572 = distinct !DISubprogram(name: "AllocateNextImage", scope: !1258, file: !1258, line: 787, type: !1573, scopeLine: 788, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1575)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{null, !1111, !818}
!1575 = !{!1576, !1577}
!1576 = !DILocalVariable(name: "image_info", arg: 1, scope: !1572, file: !1258, line: 787, type: !1111)
!1577 = !DILocalVariable(name: "image", arg: 2, scope: !1572, file: !1258, line: 787, type: !818)
!1578 = !DILocation(line: 0, scope: !1572)
!1579 = !DILocation(line: 789, column: 3, scope: !1572)
!1580 = !DILocation(line: 790, column: 1, scope: !1572)
!1581 = !DISubprogram(name: "AcquireNextImage", scope: !152, file: !152, line: 562, type: !1573, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1582 = distinct !DISubprogram(name: "AllocateString", scope: !1258, file: !1258, line: 815, type: !1583, scopeLine: 816, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1585)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!806, !943}
!1585 = !{!1586, !1587, !1588, !1589, !1592}
!1586 = !DILocalVariable(name: "source", arg: 1, scope: !1582, file: !1258, line: 815, type: !943)
!1587 = !DILocalVariable(name: "destination", scope: !1582, file: !1258, line: 818, type: !806)
!1588 = !DILocalVariable(name: "length", scope: !1582, file: !1258, line: 821, type: !829)
!1589 = !DILocalVariable(name: "message", scope: !1590, file: !1258, line: 828, type: !806)
!1590 = distinct !DILexicalBlock(scope: !1591, file: !1258, line: 828, column: 5)
!1591 = distinct !DILexicalBlock(scope: !1582, file: !1258, line: 827, column: 7)
!1592 = !DILocalVariable(name: "exception", scope: !1590, file: !1258, line: 828, type: !971)
!1593 = !DILocation(line: 0, scope: !1582)
!1594 = !DILocation(line: 824, column: 10, scope: !1582)
!1595 = !DILocation(line: 825, column: 10, scope: !1582)
!1596 = !DILocation(line: 825, column: 38, scope: !1582)
!1597 = !DILocation(line: 826, column: 24, scope: !1582)
!1598 = !DILocation(line: 827, column: 19, scope: !1591)
!1599 = !DILocation(line: 827, column: 7, scope: !1582)
!1600 = !DILocation(line: 828, column: 5, scope: !1590)
!1601 = !{!1602, !1602, i64 0}
!1602 = !{!"int", !1506, i64 0}
!1603 = !DILocation(line: 0, scope: !1590)
!1604 = !DILocation(line: 829, column: 15, scope: !1582)
!1605 = !{!1506, !1506, i64 0}
!1606 = !DILocation(line: 830, column: 14, scope: !1607)
!1607 = distinct !DILexicalBlock(scope: !1582, file: !1258, line: 830, column: 7)
!1608 = !DILocation(line: 830, column: 7, scope: !1582)
!1609 = !DILocation(line: 831, column: 12, scope: !1607)
!1610 = !DILocation(line: 831, column: 5, scope: !1607)
!1611 = !DILocation(line: 832, column: 3, scope: !1582)
!1612 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1613, file: !1613, line: 42, type: !1614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1613 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!805, !1172, !1172}
!1616 = !DISubprogram(name: "GetExceptionInfo", scope: !6, file: !6, line: 166, type: !1617, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{null, !1057}
!1619 = !DISubprogram(name: "GetExceptionMessage", scope: !6, file: !6, line: 137, type: !1620, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{!806, !1622}
!1622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!1623 = !DISubprogram(name: "ThrowMagickException", scope: !6, file: !6, line: 156, type: !1624, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!834, !1057, !943, !943, !1172, !1626, !943, !943, null}
!1626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1627 = !DISubprogram(name: "DestroyString", scope: !1628, file: !1628, line: 46, type: !1629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1628 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!806, !806}
!1631 = !DISubprogram(name: "CatchException", scope: !6, file: !6, line: 164, type: !1617, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1632 = !DISubprogram(name: "DestroyExceptionInfo", scope: !6, file: !6, line: 148, type: !1633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!1057, !1057}
!1635 = !DISubprogram(name: "MagickCoreTerminus", scope: !1636, file: !1636, line: 147, type: !1637, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1636 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!1637 = !DISubroutineType(types: !1638)
!1638 = !{null}
!1639 = !DISubprogram(name: "CopyMagickString", scope: !1628, file: !1628, line: 78, type: !1640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!829, !806, !943, !1172}
!1642 = distinct !DISubprogram(name: "AverageImages", scope: !1258, file: !1258, line: 867, type: !1643, scopeLine: 868, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1645)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!818, !1168, !1057}
!1645 = !{!1646, !1647}
!1646 = !DILocalVariable(name: "images", arg: 1, scope: !1642, file: !1258, line: 867, type: !1168)
!1647 = !DILocalVariable(name: "exception", arg: 2, scope: !1642, file: !1258, line: 867, type: !1057)
!1648 = !DILocation(line: 0, scope: !1642)
!1649 = !DILocation(line: 869, column: 10, scope: !1642)
!1650 = !DILocation(line: 869, column: 3, scope: !1642)
!1651 = !DISubprogram(name: "EvaluateImages", scope: !479, file: !479, line: 136, type: !1652, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!818, !1168, !1654, !1057}
!1654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1655)
!1655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickEvaluateOperator", file: !479, line: 102, baseType: !478)
!1656 = distinct !DISubprogram(name: "ChannelImage", scope: !1258, file: !1258, line: 903, type: !1657, scopeLine: 904, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1660)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!7, !818, !1659}
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1156)
!1660 = !{!1661, !1662}
!1661 = !DILocalVariable(name: "image", arg: 1, scope: !1656, file: !1258, line: 903, type: !818)
!1662 = !DILocalVariable(name: "channel", arg: 2, scope: !1656, file: !1258, line: 903, type: !1659)
!1663 = !DILocation(line: 0, scope: !1656)
!1664 = !DILocation(line: 905, column: 10, scope: !1656)
!1665 = !DILocation(line: 905, column: 3, scope: !1656)
!1666 = !DISubprogram(name: "SeparateImageChannel", scope: !1667, file: !1667, line: 34, type: !1668, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1339)
!1667 = !DIFile(filename: "apps/538.imagick_r/src/magick/channel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b0e4d3ce1a18bfe1ebfd6b5ca2d6cbf3")
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!834, !818, !1659}
!1670 = distinct !DISubprogram(name: "ChannelThresholdImage", scope: !1258, file: !1258, line: 933, type: !1671, scopeLine: 934, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1673)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!7, !818, !943}
!1673 = !{!1674, !1675, !1676, !1677, !1686, !1687}
!1674 = !DILocalVariable(name: "image", arg: 1, scope: !1670, file: !1258, line: 933, type: !818)
!1675 = !DILocalVariable(name: "level", arg: 2, scope: !1670, file: !1258, line: 933, type: !943)
!1676 = !DILocalVariable(name: "threshold", scope: !1670, file: !1258, line: 936, type: !1426)
!1677 = !DILocalVariable(name: "geometry_info", scope: !1670, file: !1258, line: 939, type: !1678)
!1678 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryInfo", file: !228, line: 112, baseType: !1679)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GeometryInfo", file: !228, line: 104, size: 320, elements: !1680)
!1680 = !{!1681, !1682, !1683, !1684, !1685}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !1679, file: !228, line: 107, baseType: !855, size: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !1679, file: !228, line: 108, baseType: !855, size: 64, offset: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !1679, file: !228, line: 109, baseType: !855, size: 64, offset: 128)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !1679, file: !228, line: 110, baseType: !855, size: 64, offset: 192)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "chi", scope: !1679, file: !228, line: 111, baseType: !855, size: 64, offset: 256)
!1686 = !DILocalVariable(name: "flags", scope: !1670, file: !1258, line: 942, type: !7)
!1687 = !DILocalVariable(name: "status", scope: !1670, file: !1258, line: 943, type: !7)
!1688 = !DILocation(line: 936, column: 5, scope: !1670)
!1689 = !DILocation(line: 0, scope: !1670)
!1690 = !DILocation(line: 938, column: 3, scope: !1670)
!1691 = !DILocation(line: 939, column: 5, scope: !1670)
!1692 = !DILocation(line: 947, column: 14, scope: !1693)
!1693 = distinct !DILexicalBlock(scope: !1670, file: !1258, line: 947, column: 7)
!1694 = !{!1695, !1506, i64 12976}
!1695 = !{!"_Image", !1506, i64 0, !1506, i64 4, !1506, i64 8, !1696, i64 16, !1506, i64 24, !1506, i64 28, !1506, i64 32, !1696, i64 40, !1696, i64 48, !1696, i64 56, !1696, i64 64, !1505, i64 72, !1697, i64 80, !1697, i64 88, !1697, i64 96, !1699, i64 104, !1700, i64 112, !1506, i64 208, !1505, i64 216, !1506, i64 224, !1505, i64 232, !1505, i64 240, !1505, i64 248, !1696, i64 256, !1699, i64 264, !1699, i64 272, !1702, i64 280, !1702, i64 312, !1702, i64 344, !1699, i64 376, !1699, i64 384, !1699, i64 392, !1506, i64 400, !1506, i64 404, !1506, i64 408, !1506, i64 412, !1506, i64 416, !1506, i64 420, !1505, i64 424, !1696, i64 432, !1696, i64 440, !1696, i64 448, !1696, i64 456, !1696, i64 464, !1696, i64 472, !1703, i64 480, !1704, i64 504, !1505, i64 568, !1505, i64 576, !1505, i64 584, !1505, i64 592, !1505, i64 600, !1505, i64 608, !1506, i64 616, !1506, i64 4712, !1506, i64 8808, !1696, i64 12904, !1696, i64 12912, !1706, i64 12920, !1506, i64 12976, !1696, i64 12984, !1505, i64 12992, !1707, i64 13000, !1707, i64 13032, !1505, i64 13064, !1696, i64 13072, !1696, i64 13080, !1505, i64 13088, !1505, i64 13096, !1505, i64 13104, !1506, i64 13112, !1506, i64 13116, !1697, i64 13120, !1505, i64 13128, !1702, i64 13136, !1505, i64 13168, !1505, i64 13176, !1506, i64 13184, !1506, i64 13188, !1708, i64 13192, !1506, i64 13200, !1696, i64 13208, !1696, i64 13216, !1506, i64 13224, !1696, i64 13232}
!1696 = !{!"long", !1506, i64 0}
!1697 = !{!"_PixelPacket", !1698, i64 0, !1698, i64 2, !1698, i64 4, !1698, i64 6}
!1698 = !{!"short", !1506, i64 0}
!1699 = !{!"double", !1506, i64 0}
!1700 = !{!"_ChromaticityInfo", !1701, i64 0, !1701, i64 24, !1701, i64 48, !1701, i64 72}
!1701 = !{!"_PrimaryInfo", !1699, i64 0, !1699, i64 8, !1699, i64 16}
!1702 = !{!"_RectangleInfo", !1696, i64 0, !1696, i64 8, !1696, i64 16, !1696, i64 24}
!1703 = !{!"_ErrorInfo", !1699, i64 0, !1699, i64 8, !1699, i64 16}
!1704 = !{!"_TimerInfo", !1705, i64 0, !1705, i64 24, !1506, i64 48, !1696, i64 56}
