; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/draw.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._DrawInfo = type { ptr, ptr, %struct._RectangleInfo, %struct._AffineMatrix, i32, %struct._PixelPacket, %struct._PixelPacket, double, %struct._GradientInfo, ptr, ptr, ptr, i32, i32, i32, i32, i32, i64, double, i32, i32, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, double, ptr, i32, %struct._PixelPacket, %struct._PixelPacket, ptr, ptr, ptr, %struct._SegmentInfo, i32, i16, i32, %struct._ElementReference, i32, i64, double, double, double, i32 }
%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._AffineMatrix = type { double, double, double, double, double, double }
%struct._GradientInfo = type { i32, %struct._RectangleInfo, %struct._SegmentInfo, ptr, i64, i32, i32, i64, %struct._PointInfo, float }
%struct._PointInfo = type { double, double }
%struct._PixelPacket = type { i16, i16, i16, i16 }
%struct._SegmentInfo = type { double, double, double, double }
%struct._ElementReference = type { ptr, i32, %struct._GradientInfo, i64, ptr, ptr }

!627 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!628 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!629 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!630 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!631 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!632 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!633 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!634 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!635 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!636 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!637 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!638 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!639 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!640 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!641 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!642 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!643 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!644 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!645 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!646 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!647 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!648 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 30, baseType: !5, size: 32, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!651 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!652 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!653 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!654 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!655 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!656 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!657 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!658 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!659 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!660 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!661 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!662 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!663 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !665, line: 143, baseType: !5, size: 32, elements: !666)
!665 = !DIFile(filename: "apps/538.imagick_r/src/magick/draw.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "be9e58bad39ddd4cc0b1825625045ddf")
!666 = !{!667, !668, !669, !670, !671}
!667 = !DIEnumerator(name: "MoveToCode", value: 0)
!668 = !DIEnumerator(name: "OpenCode", value: 1)
!669 = !DIEnumerator(name: "GhostlineCode", value: 2)
!670 = !DIEnumerator(name: "LineToCode", value: 3)
!671 = !DIEnumerator(name: "EndCode", value: 4)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 25, baseType: !5, size: 32, elements: !674)
!673 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683}
!675 = !DIEnumerator(name: "UndefinedResource", value: 0)
!676 = !DIEnumerator(name: "AreaResource", value: 1)
!677 = !DIEnumerator(name: "DiskResource", value: 2)
!678 = !DIEnumerator(name: "FileResource", value: 3)
!679 = !DIEnumerator(name: "MapResource", value: 4)
!680 = !DIEnumerator(name: "MemoryResource", value: 5)
!681 = !DIEnumerator(name: "ThreadResource", value: 6)
!682 = !DIEnumerator(name: "TimeResource", value: 7)
!683 = !DIEnumerator(name: "ThrottleResource", value: 8)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !685, line: 46, baseType: !5, size: 32, elements: !686)
!685 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!687 = !DIEnumerator(name: "_ISupper", value: 256)
!688 = !DIEnumerator(name: "_ISlower", value: 512)
!689 = !DIEnumerator(name: "_ISalpha", value: 1024)
!690 = !DIEnumerator(name: "_ISdigit", value: 2048)
!691 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!692 = !DIEnumerator(name: "_ISspace", value: 8192)
!693 = !DIEnumerator(name: "_ISprint", value: 16384)
!694 = !DIEnumerator(name: "_ISgraph", value: 32768)
!695 = !DIEnumerator(name: "_ISblank", value: 1)
!696 = !DIEnumerator(name: "_IScntrl", value: 2)
!697 = !DIEnumerator(name: "_ISpunct", value: 4)
!698 = !DIEnumerator(name: "_ISalnum", value: 8)
!699 = !{!700, !842, !715, !575, !1052, !705, !802, !1026, !713, !765, !729, !718, !820, !905, !742, !1184, !1185, !1196, !997, !1030, !1005, !1051, !782, !1015, !1013, !736, !865, !1197, !999, !1001, !1021, !1194, !911, !900, !1198, !1201, !1200, !1202, !1221, !1203, !1208, !1215, !1228, !961, !743}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawInfo", file: !20, line: 333, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DrawInfo", file: !20, line: 205, size: 5760, elements: !703)
!703 = !{!704, !707, !708, !724, !735, !737, !747, !748, !749, !801, !992, !993, !994, !995, !996, !998, !1000, !1002, !1003, !1004, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1014, !1016, !1017, !1018, !1019, !1020, !1022, !1023, !1024, !1025, !1027, !1028, !1029, !1031, !1032, !1033, !1045, !1046, !1047, !1048, !1049, !1050}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !702, file: !20, line: 208, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !702, file: !20, line: 209, baseType: !705, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "viewbox", scope: !702, file: !20, line: 212, baseType: !709, size: 256, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !4, line: 130, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !4, line: 121, size: 256, elements: !711)
!711 = !{!712, !716, !717, !723}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !710, file: !4, line: 124, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !714, line: 46, baseType: !715)
!714 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!715 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !710, file: !4, line: 125, baseType: !713, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !710, file: !4, line: 128, baseType: !718, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !719, line: 77, baseType: !720)
!719 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !721, line: 193, baseType: !722)
!721 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!722 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !710, file: !4, line: 129, baseType: !718, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "affine", scope: !702, file: !20, line: 215, baseType: !725, size: 384, offset: 384)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !4, line: 102, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !4, line: 93, size: 384, elements: !727)
!727 = !{!728, !730, !731, !732, !733, !734}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !726, file: !4, line: 96, baseType: !729, size: 64)
!729 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !726, file: !4, line: 97, baseType: !729, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !726, file: !4, line: 98, baseType: !729, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !726, file: !4, line: 99, baseType: !729, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !726, file: !4, line: 100, baseType: !729, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !726, file: !4, line: 101, baseType: !729, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !702, file: !20, line: 218, baseType: !736, size: 32, offset: 768)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !4, line: 91, baseType: !3)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !702, file: !20, line: 221, baseType: !738, size: 64, offset: 800)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !338, line: 148, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !338, line: 131, size: 64, elements: !740)
!740 = !{!741, !744, !745, !746}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !739, file: !338, line: 143, baseType: !742, size: 16)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !26, line: 93, baseType: !743)
!743 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !739, file: !338, line: 144, baseType: !742, size: 16, offset: 16)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !739, file: !338, line: 145, baseType: !742, size: 16, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !739, file: !338, line: 146, baseType: !742, size: 16, offset: 48)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !702, file: !20, line: 222, baseType: !738, size: 64, offset: 864)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_width", scope: !702, file: !20, line: 225, baseType: !729, size: 64, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !702, file: !20, line: 228, baseType: !750, size: 1024, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientInfo", file: !20, line: 184, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GradientInfo", file: !20, line: 153, size: 1024, elements: !752)
!752 = !{!753, !755, !756, !764, !789, !790, !792, !793, !794, !800}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !751, file: !20, line: 156, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientType", file: !20, line: 75, baseType: !19)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "bounding_box", scope: !751, file: !20, line: 159, baseType: !709, size: 256, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_vector", scope: !751, file: !20, line: 162, baseType: !757, size: 256, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !104, line: 110, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !104, line: 103, size: 256, elements: !759)
!759 = !{!760, !761, !762, !763}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !758, file: !104, line: 106, baseType: !729, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !758, file: !104, line: 107, baseType: !729, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !758, file: !104, line: 108, baseType: !729, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !758, file: !104, line: 109, baseType: !729, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "stops", scope: !751, file: !20, line: 165, baseType: !765, size: 64, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "StopInfo", file: !20, line: 151, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StopInfo", file: !20, line: 144, size: 512, elements: !768)
!768 = !{!769, !788}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !767, file: !20, line: 147, baseType: !770, size: 448)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !338, line: 127, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !338, line: 104, size: 448, elements: !772)
!772 = !{!773, !775, !777, !779, !780, !781, !784, !785, !786, !787}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !771, file: !338, line: 107, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !26, line: 209, baseType: !25)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !771, file: !338, line: 110, baseType: !776, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !32, line: 61, baseType: !31)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !771, file: !338, line: 113, baseType: !778, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !26, line: 215, baseType: !68)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !771, file: !338, line: 116, baseType: !729, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !771, file: !338, line: 119, baseType: !713, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !771, file: !338, line: 122, baseType: !782, size: 32, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !26, line: 78, baseType: !783)
!783 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !771, file: !338, line: 123, baseType: !782, size: 32, offset: 288)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !771, file: !338, line: 124, baseType: !782, size: 32, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !771, file: !338, line: 125, baseType: !782, size: 32, offset: 352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !771, file: !338, line: 126, baseType: !782, size: 32, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !767, file: !20, line: 150, baseType: !782, size: 32, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "number_stops", scope: !751, file: !20, line: 168, baseType: !713, size: 64, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !751, file: !20, line: 171, baseType: !791, size: 32, offset: 704)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpreadMethod", file: !20, line: 135, baseType: !72)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !751, file: !20, line: 174, baseType: !778, size: 32, offset: 736)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !751, file: !20, line: 177, baseType: !713, size: 64, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !751, file: !20, line: 180, baseType: !795, size: 128, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !20, line: 142, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !20, line: 137, size: 128, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !796, file: !20, line: 140, baseType: !729, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !796, file: !20, line: 141, baseType: !729, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !751, file: !20, line: 183, baseType: !782, size: 32, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fill_pattern", scope: !702, file: !20, line: 231, baseType: !802, size: 64, offset: 2048)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !26, line: 221, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !104, line: 150, size: 105920, elements: !805)
!805 = !{!806, !807, !808, !810, !811, !813, !814, !815, !816, !817, !818, !819, !821, !822, !823, !824, !825, !839, !841, !843, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !859, !861, !863, !864, !866, !868, !870, !871, !872, !873, !874, !875, !876, !884, !899, !913, !914, !915, !916, !920, !924, !928, !929, !930, !931, !932, !949, !950, !952, !953, !963, !964, !966, !967, !968, !969, !970, !971, !973, !974, !975, !976, !977, !978, !979, !981, !982, !983, !984, !985, !989, !991}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !804, file: !104, line: 153, baseType: !774, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !804, file: !104, line: 156, baseType: !776, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !804, file: !104, line: 159, baseType: !809, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !79, line: 49, baseType: !78)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !804, file: !104, line: 162, baseType: !713, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !804, file: !104, line: 165, baseType: !812, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !104, line: 86, baseType: !103)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !804, file: !104, line: 168, baseType: !778, size: 32, offset: 224)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !804, file: !104, line: 169, baseType: !778, size: 32, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !804, file: !104, line: 172, baseType: !713, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !804, file: !104, line: 173, baseType: !713, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !804, file: !104, line: 174, baseType: !713, size: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !804, file: !104, line: 175, baseType: !713, size: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !804, file: !104, line: 178, baseType: !820, size: 64, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !804, file: !104, line: 179, baseType: !738, size: 64, offset: 640)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !804, file: !104, line: 180, baseType: !738, size: 64, offset: 704)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !804, file: !104, line: 181, baseType: !738, size: 64, offset: 768)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !804, file: !104, line: 184, baseType: !729, size: 64, offset: 832)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !804, file: !104, line: 187, baseType: !826, size: 768, offset: 896)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !104, line: 128, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !104, line: 121, size: 768, elements: !828)
!828 = !{!829, !836, !837, !838}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !827, file: !104, line: 124, baseType: !830, size: 192)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !104, line: 101, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !104, line: 95, size: 192, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !831, file: !104, line: 98, baseType: !729, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !831, file: !104, line: 99, baseType: !729, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !831, file: !104, line: 100, baseType: !729, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !827, file: !104, line: 125, baseType: !830, size: 192, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !827, file: !104, line: 126, baseType: !830, size: 192, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !827, file: !104, line: 127, baseType: !830, size: 192, offset: 576)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !804, file: !104, line: 190, baseType: !840, size: 32, offset: 1664)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !116, line: 49, baseType: !115)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !804, file: !104, line: 193, baseType: !842, size: 64, offset: 1728)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !804, file: !104, line: 196, baseType: !844, size: 32, offset: 1792)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !104, line: 93, baseType: !123)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !804, file: !104, line: 199, baseType: !705, size: 64, offset: 1856)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !804, file: !104, line: 200, baseType: !705, size: 64, offset: 1920)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !804, file: !104, line: 201, baseType: !705, size: 64, offset: 1984)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !804, file: !104, line: 204, baseType: !718, size: 64, offset: 2048)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !804, file: !104, line: 207, baseType: !729, size: 64, offset: 2112)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !804, file: !104, line: 208, baseType: !729, size: 64, offset: 2176)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !804, file: !104, line: 211, baseType: !709, size: 256, offset: 2240)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !804, file: !104, line: 212, baseType: !709, size: 256, offset: 2496)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !804, file: !104, line: 213, baseType: !709, size: 256, offset: 2752)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !804, file: !104, line: 216, baseType: !729, size: 64, offset: 3008)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !804, file: !104, line: 217, baseType: !729, size: 64, offset: 3072)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !804, file: !104, line: 218, baseType: !729, size: 64, offset: 3136)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !804, file: !104, line: 221, baseType: !858, size: 32, offset: 3200)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !129, line: 66, baseType: !128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !804, file: !104, line: 224, baseType: !860, size: 32, offset: 3232)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !104, line: 73, baseType: !163)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !804, file: !104, line: 227, baseType: !862, size: 32, offset: 3264)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !174, line: 35, baseType: !173)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !804, file: !104, line: 230, baseType: !736, size: 32, offset: 3296)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !804, file: !104, line: 233, baseType: !865, size: 32, offset: 3328)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !180, line: 99, baseType: !179)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !804, file: !104, line: 236, baseType: !867, size: 32, offset: 3360)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !251, line: 32, baseType: !250)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !804, file: !104, line: 239, baseType: !869, size: 64, offset: 3392)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !804, file: !104, line: 242, baseType: !713, size: 64, offset: 3456)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !804, file: !104, line: 243, baseType: !713, size: 64, offset: 3520)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !804, file: !104, line: 246, baseType: !718, size: 64, offset: 3584)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !804, file: !104, line: 249, baseType: !713, size: 64, offset: 3648)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !804, file: !104, line: 250, baseType: !713, size: 64, offset: 3712)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !804, file: !104, line: 253, baseType: !718, size: 64, offset: 3776)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !804, file: !104, line: 256, baseType: !877, size: 192, offset: 3840)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !878, line: 68, baseType: !879)
!878 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !878, line: 62, size: 192, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !879, file: !878, line: 65, baseType: !729, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !879, file: !878, line: 66, baseType: !729, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !879, file: !878, line: 67, baseType: !729, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !804, file: !104, line: 259, baseType: !885, size: 512, offset: 4032)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !259, line: 51, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !259, line: 40, size: 512, elements: !887)
!887 = !{!888, !895, !896, !898}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !886, file: !259, line: 43, baseType: !889, size: 192)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !259, line: 38, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !259, line: 32, size: 192, elements: !891)
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !890, file: !259, line: 35, baseType: !729, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !890, file: !259, line: 36, baseType: !729, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !890, file: !259, line: 37, baseType: !729, size: 64, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !886, file: !259, line: 44, baseType: !889, size: 192, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !886, file: !259, line: 47, baseType: !897, size: 32, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !259, line: 30, baseType: !258)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !886, file: !259, line: 50, baseType: !713, size: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !804, file: !104, line: 262, baseType: !900, size: 64, offset: 4544)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !901, line: 26, baseType: !902)
!901 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!778, !905, !907, !910, !842}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !26, line: 150, baseType: !909)
!909 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !26, line: 151, baseType: !912)
!912 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !804, file: !104, line: 265, baseType: !842, size: 64, offset: 4608)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !804, file: !104, line: 266, baseType: !842, size: 64, offset: 4672)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !804, file: !104, line: 267, baseType: !842, size: 64, offset: 4736)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !804, file: !104, line: 270, baseType: !917, size: 64, offset: 4800)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !79, line: 52, baseType: !919)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !79, line: 51, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !804, file: !104, line: 273, baseType: !921, size: 64, offset: 4864)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !26, line: 217, baseType: !923)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !26, line: 217, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !804, file: !104, line: 276, baseType: !925, size: 32768, offset: 4928)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 32768, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 4096)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !804, file: !104, line: 277, baseType: !925, size: 32768, offset: 37696)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !804, file: !104, line: 278, baseType: !925, size: 32768, offset: 70464)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !804, file: !104, line: 281, baseType: !713, size: 64, offset: 103232)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !804, file: !104, line: 282, baseType: !713, size: 64, offset: 103296)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !804, file: !104, line: 285, baseType: !933, size: 448, offset: 103360)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !26, line: 219, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !265, line: 102, size: 448, elements: !935)
!935 = !{!936, !938, !939, !940, !941, !942, !943, !948}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !934, file: !265, line: 105, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !265, line: 100, baseType: !264)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !934, file: !265, line: 108, baseType: !575, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !934, file: !265, line: 111, baseType: !705, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !934, file: !265, line: 112, baseType: !705, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !934, file: !265, line: 115, baseType: !842, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !934, file: !265, line: 118, baseType: !778, size: 32, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !934, file: !265, line: 121, baseType: !944, size: 64, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !946, line: 26, baseType: !947)
!946 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !946, line: 25, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !934, file: !265, line: 124, baseType: !713, size: 64, offset: 384)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !804, file: !104, line: 288, baseType: !778, size: 32, offset: 103808)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !804, file: !104, line: 291, baseType: !951, size: 64, offset: 103872)
!951 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !718)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !804, file: !104, line: 294, baseType: !944, size: 64, offset: 103936)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !804, file: !104, line: 297, baseType: !954, size: 256, offset: 104000)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !116, line: 40, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !116, line: 27, size: 256, elements: !956)
!956 = !{!957, !958, !959, !962}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !955, file: !116, line: 30, baseType: !705, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !955, file: !116, line: 33, baseType: !713, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !955, file: !116, line: 36, baseType: !960, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !955, file: !116, line: 39, baseType: !713, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !804, file: !104, line: 298, baseType: !954, size: 256, offset: 104256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !804, file: !104, line: 299, baseType: !965, size: 64, offset: 104512)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !804, file: !104, line: 302, baseType: !713, size: 64, offset: 104576)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !804, file: !104, line: 305, baseType: !713, size: 64, offset: 104640)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !804, file: !104, line: 308, baseType: !869, size: 64, offset: 104704)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !804, file: !104, line: 309, baseType: !869, size: 64, offset: 104768)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !804, file: !104, line: 310, baseType: !869, size: 64, offset: 104832)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !804, file: !104, line: 313, baseType: !972, size: 32, offset: 104896)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !338, line: 47, baseType: !337)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !804, file: !104, line: 316, baseType: !778, size: 32, offset: 104928)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !804, file: !104, line: 319, baseType: !738, size: 64, offset: 104960)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !804, file: !104, line: 322, baseType: !869, size: 64, offset: 105024)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !804, file: !104, line: 325, baseType: !709, size: 256, offset: 105088)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !804, file: !104, line: 328, baseType: !842, size: 64, offset: 105344)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !804, file: !104, line: 329, baseType: !842, size: 64, offset: 105408)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !804, file: !104, line: 332, baseType: !980, size: 32, offset: 105472)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !104, line: 61, baseType: !354)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !804, file: !104, line: 335, baseType: !778, size: 32, offset: 105504)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !804, file: !104, line: 338, baseType: !911, size: 64, offset: 105536)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !804, file: !104, line: 341, baseType: !778, size: 32, offset: 105600)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !804, file: !104, line: 344, baseType: !713, size: 64, offset: 105664)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !804, file: !104, line: 347, baseType: !986, size: 64, offset: 105728)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !987, line: 7, baseType: !988)
!987 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !721, line: 160, baseType: !722)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !804, file: !104, line: 350, baseType: !990, size: 32, offset: 105792)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !338, line: 79, baseType: !368)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !804, file: !104, line: 353, baseType: !713, size: 64, offset: 105856)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !702, file: !20, line: 232, baseType: !802, size: 64, offset: 2112)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_pattern", scope: !702, file: !20, line: 233, baseType: !802, size: 64, offset: 2176)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_antialias", scope: !702, file: !20, line: 236, baseType: !778, size: 32, offset: 2240)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "text_antialias", scope: !702, file: !20, line: 237, baseType: !778, size: 32, offset: 2272)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !702, file: !20, line: 240, baseType: !997, size: 32, offset: 2304)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "FillRule", file: !20, line: 68, baseType: !380)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "linecap", scope: !702, file: !20, line: 243, baseType: !999, size: 32, offset: 2336)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineCap", file: !20, line: 83, baseType: !385)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "linejoin", scope: !702, file: !20, line: 246, baseType: !1001, size: 32, offset: 2368)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineJoin", file: !20, line: 91, baseType: !391)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "miterlimit", scope: !702, file: !20, line: 249, baseType: !713, size: 64, offset: 2432)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !702, file: !20, line: 252, baseType: !729, size: 64, offset: 2496)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "decorate", scope: !702, file: !20, line: 255, baseType: !1005, size: 32, offset: 2560)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecorationType", file: !20, line: 53, baseType: !397)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !702, file: !20, line: 258, baseType: !865, size: 32, offset: 2592)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !702, file: !20, line: 261, baseType: !705, size: 64, offset: 2624)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !702, file: !20, line: 264, baseType: !713, size: 64, offset: 2688)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !702, file: !20, line: 267, baseType: !705, size: 64, offset: 2752)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !702, file: !20, line: 268, baseType: !705, size: 64, offset: 2816)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !702, file: !20, line: 269, baseType: !705, size: 64, offset: 2880)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !702, file: !20, line: 272, baseType: !1013, size: 32, offset: 2944)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleType", file: !405, line: 47, baseType: !404)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !702, file: !20, line: 275, baseType: !1015, size: 32, offset: 2976)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "StretchType", file: !405, line: 38, baseType: !412)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !702, file: !20, line: 278, baseType: !713, size: 64, offset: 3008)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !702, file: !20, line: 281, baseType: !705, size: 64, offset: 3072)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !702, file: !20, line: 284, baseType: !729, size: 64, offset: 3136)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !702, file: !20, line: 287, baseType: !705, size: 64, offset: 3200)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !702, file: !20, line: 290, baseType: !1021, size: 32, offset: 3264)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlignType", file: !20, line: 36, baseType: !425)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "undercolor", scope: !702, file: !20, line: 293, baseType: !738, size: 64, offset: 3296)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !702, file: !20, line: 294, baseType: !738, size: 64, offset: 3360)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !702, file: !20, line: 297, baseType: !705, size: 64, offset: 3456)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "dash_pattern", scope: !702, file: !20, line: 300, baseType: !1026, size: 64, offset: 3520)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !702, file: !20, line: 303, baseType: !705, size: 64, offset: 3584)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !702, file: !20, line: 306, baseType: !757, size: 256, offset: 3648)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "clip_units", scope: !702, file: !20, line: 309, baseType: !1030, size: 32, offset: 3904)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClipPathUnits", file: !20, line: 44, baseType: !431)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !702, file: !20, line: 312, baseType: !742, size: 16, offset: 3936)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "render", scope: !702, file: !20, line: 315, baseType: !778, size: 32, offset: 3968)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "element_reference", scope: !702, file: !20, line: 318, baseType: !1034, size: 1344, offset: 4032)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementReference", file: !20, line: 203, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ElementReference", file: !20, line: 186, size: 1344, elements: !1036)
!1036 = !{!1037, !1038, !1040, !1041, !1042, !1044}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1035, file: !20, line: 189, baseType: !705, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1035, file: !20, line: 192, baseType: !1039, size: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReferenceType", file: !20, line: 127, baseType: !437)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !1035, file: !20, line: 195, baseType: !750, size: 1024, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1035, file: !20, line: 198, baseType: !713, size: 64, offset: 1152)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1035, file: !20, line: 201, baseType: !1043, size: 64, offset: 1216)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1035, file: !20, line: 202, baseType: !1043, size: 64, offset: 1280)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !702, file: !20, line: 321, baseType: !778, size: 32, offset: 5376)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !702, file: !20, line: 324, baseType: !713, size: 64, offset: 5440)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !702, file: !20, line: 327, baseType: !729, size: 64, offset: 5504)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "interword_spacing", scope: !702, file: !20, line: 328, baseType: !729, size: 64, offset: 5568)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "interline_spacing", scope: !702, file: !20, line: 329, baseType: !729, size: 64, offset: 5632)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !702, file: !20, line: 332, baseType: !1051, size: 32, offset: 5696)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectionType", file: !20, line: 60, baseType: !441)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !26, line: 223, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !104, line: 356, size: 134336, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1090, !1091, !1092, !1093, !1094, !1095, !1097, !1098, !1099, !1100, !1101, !1102, !1113, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1181, !1182, !1183}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1054, file: !104, line: 359, baseType: !809, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !1054, file: !104, line: 362, baseType: !812, size: 32, offset: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !1054, file: !104, line: 365, baseType: !778, size: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !1054, file: !104, line: 366, baseType: !778, size: 32, offset: 96)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !1054, file: !104, line: 367, baseType: !778, size: 32, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !1054, file: !104, line: 368, baseType: !778, size: 32, offset: 160)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1054, file: !104, line: 371, baseType: !705, size: 64, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !1054, file: !104, line: 372, baseType: !705, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !1054, file: !104, line: 373, baseType: !705, size: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !1054, file: !104, line: 374, baseType: !705, size: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1054, file: !104, line: 377, baseType: !713, size: 64, offset: 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !1054, file: !104, line: 378, baseType: !713, size: 64, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1054, file: !104, line: 379, baseType: !713, size: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !1054, file: !104, line: 382, baseType: !860, size: 32, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !1054, file: !104, line: 385, baseType: !862, size: 32, offset: 672)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1054, file: !104, line: 388, baseType: !844, size: 32, offset: 704)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1054, file: !104, line: 391, baseType: !713, size: 64, offset: 768)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !1054, file: !104, line: 394, baseType: !705, size: 64, offset: 832)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !1054, file: !104, line: 395, baseType: !705, size: 64, offset: 896)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1054, file: !104, line: 396, baseType: !705, size: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !1054, file: !104, line: 397, baseType: !705, size: 64, offset: 1024)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1054, file: !104, line: 398, baseType: !705, size: 64, offset: 1088)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !1054, file: !104, line: 401, baseType: !729, size: 64, offset: 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1054, file: !104, line: 402, baseType: !729, size: 64, offset: 1216)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !1054, file: !104, line: 405, baseType: !738, size: 64, offset: 1280)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1054, file: !104, line: 406, baseType: !738, size: 64, offset: 1344)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !1054, file: !104, line: 407, baseType: !738, size: 64, offset: 1408)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1054, file: !104, line: 410, baseType: !778, size: 32, offset: 1472)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !1054, file: !104, line: 411, baseType: !778, size: 32, offset: 1504)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1054, file: !104, line: 414, baseType: !713, size: 64, offset: 1536)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1054, file: !104, line: 417, baseType: !776, size: 32, offset: 1600)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1054, file: !104, line: 420, baseType: !980, size: 32, offset: 1632)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !1054, file: !104, line: 423, baseType: !1089, size: 32, offset: 1664)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !447, line: 59, baseType: !446)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1054, file: !104, line: 426, baseType: !718, size: 64, offset: 1728)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !1054, file: !104, line: 429, baseType: !778, size: 32, offset: 1792)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !1054, file: !104, line: 430, baseType: !778, size: 32, offset: 1824)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1054, file: !104, line: 433, baseType: !705, size: 64, offset: 1856)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !1054, file: !104, line: 434, baseType: !705, size: 64, offset: 1920)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !1054, file: !104, line: 437, baseType: !1096, size: 32, offset: 1984)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !26, line: 202, baseType: !479)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1054, file: !104, line: 440, baseType: !802, size: 64, offset: 2048)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1054, file: !104, line: 443, baseType: !842, size: 64, offset: 2112)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !1054, file: !104, line: 446, baseType: !900, size: 64, offset: 2176)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1054, file: !104, line: 449, baseType: !842, size: 64, offset: 2240)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1054, file: !104, line: 450, baseType: !842, size: 64, offset: 2304)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1054, file: !104, line: 453, baseType: !1103, size: 64, offset: 2368)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1104, line: 26, baseType: !1105)
!1104 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!713, !1108, !1110, !1112}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1054, file: !104, line: 456, baseType: !1114, size: 64, offset: 2432)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1116, line: 7, baseType: !1117)
!1116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1118, line: 49, size: 1728, elements: !1119)
!1118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1135, !1137, !1138, !1139, !1141, !1142, !1144, !1148, !1151, !1153, !1156, !1159, !1160, !1161, !1162, !1163}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1117, file: !1118, line: 51, baseType: !575, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1117, file: !1118, line: 54, baseType: !705, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1117, file: !1118, line: 55, baseType: !705, size: 64, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1117, file: !1118, line: 56, baseType: !705, size: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1117, file: !1118, line: 57, baseType: !705, size: 64, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1117, file: !1118, line: 58, baseType: !705, size: 64, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1117, file: !1118, line: 59, baseType: !705, size: 64, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1117, file: !1118, line: 60, baseType: !705, size: 64, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1117, file: !1118, line: 61, baseType: !705, size: 64, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1117, file: !1118, line: 64, baseType: !705, size: 64, offset: 576)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1117, file: !1118, line: 65, baseType: !705, size: 64, offset: 640)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1117, file: !1118, line: 66, baseType: !705, size: 64, offset: 704)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1117, file: !1118, line: 68, baseType: !1133, size: 64, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1118, line: 36, flags: DIFlagFwdDecl)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1117, file: !1118, line: 70, baseType: !1136, size: 64, offset: 832)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1117, file: !1118, line: 72, baseType: !575, size: 32, offset: 896)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1117, file: !1118, line: 73, baseType: !575, size: 32, offset: 928)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1117, file: !1118, line: 74, baseType: !1140, size: 64, offset: 960)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !721, line: 152, baseType: !722)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1117, file: !1118, line: 77, baseType: !743, size: 16, offset: 1024)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1117, file: !1118, line: 78, baseType: !1143, size: 8, offset: 1040)
!1143 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1117, file: !1118, line: 79, baseType: !1145, size: 8, offset: 1048)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 8, elements: !1146)
!1146 = !{!1147}
!1147 = !DISubrange(count: 1)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1117, file: !1118, line: 81, baseType: !1149, size: 64, offset: 1088)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1118, line: 43, baseType: null)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1117, file: !1118, line: 89, baseType: !1152, size: 64, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !721, line: 153, baseType: !722)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1117, file: !1118, line: 91, baseType: !1154, size: 64, offset: 1216)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1118, line: 37, flags: DIFlagFwdDecl)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1117, file: !1118, line: 92, baseType: !1157, size: 64, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1118, line: 38, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1117, file: !1118, line: 93, baseType: !1136, size: 64, offset: 1344)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1117, file: !1118, line: 94, baseType: !842, size: 64, offset: 1408)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1117, file: !1118, line: 95, baseType: !713, size: 64, offset: 1472)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1117, file: !1118, line: 96, baseType: !575, size: 32, offset: 1536)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1117, file: !1118, line: 98, baseType: !1164, size: 160, offset: 1568)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 160, elements: !1165)
!1165 = !{!1166}
!1166 = !DISubrange(count: 20)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !1054, file: !104, line: 459, baseType: !842, size: 64, offset: 2496)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1054, file: !104, line: 462, baseType: !713, size: 64, offset: 2560)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !1054, file: !104, line: 465, baseType: !925, size: 32768, offset: 2624)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !1054, file: !104, line: 466, baseType: !925, size: 32768, offset: 35392)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !1054, file: !104, line: 467, baseType: !925, size: 32768, offset: 68160)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1054, file: !104, line: 468, baseType: !925, size: 32768, offset: 100928)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1054, file: !104, line: 471, baseType: !778, size: 32, offset: 133696)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1054, file: !104, line: 474, baseType: !705, size: 64, offset: 133760)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !1054, file: !104, line: 477, baseType: !713, size: 64, offset: 133824)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !1054, file: !104, line: 478, baseType: !713, size: 64, offset: 133888)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !1054, file: !104, line: 481, baseType: !738, size: 64, offset: 133952)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1054, file: !104, line: 484, baseType: !713, size: 64, offset: 134016)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !1054, file: !104, line: 487, baseType: !1180, size: 32, offset: 134080)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !502, line: 47, baseType: !501)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !1054, file: !104, line: 490, baseType: !738, size: 64, offset: 134112)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1054, file: !104, line: 493, baseType: !842, size: 64, offset: 134208)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !1054, file: !104, line: 496, baseType: !778, size: 32, offset: 134272)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimitiveInfo", file: !20, line: 351, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimitiveInfo", file: !20, line: 335, size: 320, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1193, !1195}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !1187, file: !20, line: 338, baseType: !795, size: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !1187, file: !20, line: 341, baseType: !713, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !1187, file: !20, line: 344, baseType: !1192, size: 32, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimitiveType", file: !20, line: 121, baseType: !547)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !1187, file: !20, line: 347, baseType: !1194, size: 32, offset: 224)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PaintMethod", file: !20, line: 101, baseType: !565)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1187, file: !20, line: 350, baseType: !705, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1200)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !338, line: 129, baseType: !742)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolygonInfo", file: !665, line: 141, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PolygonInfo", file: !665, line: 134, size: 128, elements: !1206)
!1206 = !{!1207, !1220}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !1205, file: !665, line: 137, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "EdgeInfo", file: !665, line: 122, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EdgeInfo", file: !665, line: 100, size: 640, elements: !1211)
!1211 = !{!1212, !1213, !1214, !1216, !1217, !1218, !1219}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1210, file: !665, line: 103, baseType: !757, size: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "scanline", scope: !1210, file: !665, line: 106, baseType: !729, size: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1210, file: !665, line: 109, baseType: !1215, size: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "number_points", scope: !1210, file: !665, line: 112, baseType: !713, size: 64, offset: 384)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1210, file: !665, line: 115, baseType: !718, size: 64, offset: 448)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "ghostline", scope: !1210, file: !665, line: 118, baseType: !778, size: 32, offset: 512)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "highwater", scope: !1210, file: !665, line: 121, baseType: !713, size: 64, offset: 576)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "number_edges", scope: !1205, file: !665, line: 140, baseType: !713, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathInfo", file: !665, line: 159, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PathInfo", file: !665, line: 152, size: 192, elements: !1224)
!1224 = !{!1225, !1226}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !1223, file: !665, line: 155, baseType: !795, size: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1223, file: !665, line: 158, baseType: !1227, size: 32, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathInfoCode", file: !665, line: 150, baseType: !664)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1209)
!1230 = !{i32 7, !"Dwarf Version", i32 5}
!1231 = !{i32 2, !"Debug Info Version", i32 3}
!1232 = !{i32 1, !"wchar_size", i32 4}
!1233 = !{i32 7, !"PIC Level", i32 2}
!1234 = !{i32 7, !"PIE Level", i32 2}
!1235 = !{i32 7, !"uwtable", i32 2}
!1236 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1237 = distinct !DISubprogram(name: "AcquireDrawInfo", scope: !665, file: !665, line: 206, type: !1238, scopeLine: 207, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1240)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!700}
!1240 = !{!1241, !1242, !1245}
!1241 = !DILocalVariable(name: "draw_info", scope: !1237, file: !665, line: 209, type: !700)
!1242 = !DILocalVariable(name: "message", scope: !1243, file: !665, line: 213, type: !705)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !665, line: 213, column: 5)
!1244 = distinct !DILexicalBlock(scope: !1237, file: !665, line: 212, column: 7)
!1245 = !DILocalVariable(name: "exception", scope: !1243, file: !665, line: 213, type: !933)
!1246 = !DILocation(line: 211, column: 26, scope: !1237)
!1247 = !DILocation(line: 0, scope: !1237)
!1248 = !DILocation(line: 212, column: 17, scope: !1244)
!1249 = !DILocation(line: 212, column: 7, scope: !1237)
!1250 = !DILocation(line: 213, column: 5, scope: !1243)
!1251 = !{!1252, !1252, i64 0}
!1252 = !{!"int", !1253, i64 0}
!1253 = !{!"omnipotent char", !1254, i64 0}
!1254 = !{!"Simple C/C++ TBAA"}
!1255 = !DILocation(line: 0, scope: !1243)
!1256 = !DILocation(line: 214, column: 3, scope: !1237)
!1257 = !DILocation(line: 215, column: 3, scope: !1237)
!1258 = !DISubprogram(name: "AcquireMagickMemory", scope: !1259, file: !1259, line: 40, type: !1260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1262)
!1259 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!842, !1112}
!1262 = !{}
!1263 = !DISubprogram(name: "GetExceptionInfo", scope: !265, file: !265, line: 166, type: !1264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1262)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!1267 = !DISubprogram(name: "GetExceptionMessage", scope: !265, file: !265, line: 137, type: !1268, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1262)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!705, !1270}
!1270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!1271 = !DISubprogram(name: "ThrowMagickException", scope: !265, file: !265, line: 156, type: !1272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1262)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!778, !1266, !905, !905, !1112, !1274, !905, !905, null}
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!1275 = !DISubprogram(name: "DestroyString", scope: !1276, file: !1276, line: 46, type: !1277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1262)
!1276 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!705, !705}
!1279 = !DISubprogram(name: "CatchException", scope: !265, file: !265, line: 164, type: !1264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1262)
!1280 = !DISubprogram(name: "DestroyExceptionInfo", scope: !265, file: !265, line: 148, type: !1281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1262)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!1266, !1266}
!1283 = !DISubprogram(name: "MagickCoreTerminus", scope: !1284, file: !1284, line: 147, type: !1285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1262)
!1284 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!1285 = !DISubroutineType(types: !1286)
!1286 = !{null}
!1287 = distinct !DISubprogram(name: "GetDrawInfo", scope: !665, file: !665, line: 4811, type: !1288, scopeLine: 4812, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1292)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{null, !1290, !700}
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1292 = !{!1293, !1294, !1295, !1296, !1297}
!1293 = !DILocalVariable(name: "image_info", arg: 1, scope: !1287, file: !665, line: 4811, type: !1290)
!1294 = !DILocalVariable(name: "draw_info", arg: 2, scope: !1287, file: !665, line: 4811, type: !700)
!1295 = !DILocalVariable(name: "option", scope: !1287, file: !665, line: 4814, type: !905)
!1296 = !DILocalVariable(name: "exception", scope: !1287, file: !665, line: 4817, type: !1266)
!1297 = !DILocalVariable(name: "clone_info", scope: !1287, file: !665, line: 4820, type: !1052)
!1298 = !DILocation(line: 0, scope: !1287)
!1299 = !DILocation(line: 4825, column: 10, scope: !1287)
!1300 = !DILocation(line: 4827, column: 10, scope: !1287)
!1301 = !DILocation(line: 4828, column: 14, scope: !1287)
!1302 = !DILocation(line: 4829, column: 31, scope: !1287)
!1303 = !DILocalVariable(name: "affine_matrix", arg: 1, scope: !1304, file: !665, line: 4777, type: !1307)
!1304 = distinct !DISubprogram(name: "GetAffineMatrix", scope: !665, file: !665, line: 4777, type: !1305, scopeLine: 4778, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1308)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{null, !1307}
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!1308 = !{!1303}
!1309 = !DILocation(line: 0, scope: !1304, inlinedAt: !1310)
!1310 = distinct !DILocation(line: 4829, column: 3, scope: !1287)
!1311 = !DILocation(line: 4779, column: 10, scope: !1304, inlinedAt: !1310)
!1312 = !DILocation(line: 4781, column: 10, scope: !1304, inlinedAt: !1310)
!1313 = !DILocation(line: 4782, column: 20, scope: !1304, inlinedAt: !1310)
!1314 = !{!1315, !1316, i64 0}
!1315 = !{!"_AffineMatrix", !1316, i64 0, !1316, i64 8, !1316, i64 16, !1316, i64 24, !1316, i64 32, !1316, i64 40}
!1316 = !{!"double", !1253, i64 0}
!1317 = !DILocation(line: 4783, column: 18, scope: !1304, inlinedAt: !1310)
!1318 = !DILocation(line: 4783, column: 20, scope: !1304, inlinedAt: !1310)
!1319 = !{!1315, !1316, i64 24}
!1320 = !DILocation(line: 4830, column: 13, scope: !1287)
!1321 = !DILocation(line: 4831, column: 49, scope: !1287)
!1322 = !DILocation(line: 4831, column: 10, scope: !1287)
!1323 = !DILocation(line: 4832, column: 49, scope: !1287)
!1324 = !DILocation(line: 4832, column: 10, scope: !1287)
!1325 = !DILocation(line: 4833, column: 43, scope: !1287)
!1326 = !{!1327, !1253, i64 20}
!1327 = !{!"_ImageInfo", !1253, i64 0, !1253, i64 4, !1253, i64 8, !1253, i64 12, !1253, i64 16, !1253, i64 20, !1328, i64 24, !1328, i64 32, !1328, i64 40, !1328, i64 48, !1329, i64 56, !1329, i64 64, !1329, i64 72, !1253, i64 80, !1253, i64 84, !1253, i64 88, !1329, i64 96, !1328, i64 104, !1328, i64 112, !1328, i64 120, !1328, i64 128, !1328, i64 136, !1316, i64 144, !1316, i64 152, !1330, i64 160, !1330, i64 168, !1330, i64 176, !1253, i64 184, !1253, i64 188, !1329, i64 192, !1253, i64 200, !1253, i64 204, !1253, i64 208, !1329, i64 216, !1253, i64 224, !1253, i64 228, !1328, i64 232, !1328, i64 240, !1253, i64 248, !1328, i64 256, !1328, i64 264, !1328, i64 272, !1328, i64 280, !1328, i64 288, !1328, i64 296, !1328, i64 304, !1328, i64 312, !1329, i64 320, !1253, i64 328, !1253, i64 4424, !1253, i64 8520, !1253, i64 12616, !1253, i64 16712, !1328, i64 16720, !1329, i64 16728, !1329, i64 16736, !1330, i64 16744, !1329, i64 16752, !1253, i64 16760, !1330, i64 16764, !1328, i64 16776, !1253, i64 16784}
!1328 = !{!"any pointer", !1253, i64 0}
!1329 = !{!"long", !1253, i64 0}
!1330 = !{!"_PixelPacket", !1331, i64 0, !1331, i64 2, !1331, i64 4, !1331, i64 6}
!1331 = !{!"short", !1253, i64 0}
!1332 = !DILocation(line: 4833, column: 14, scope: !1287)
!1333 = !DILocation(line: 4833, column: 30, scope: !1287)
!1334 = !{!1335, !1253, i64 280}
!1335 = !{!"_DrawInfo", !1328, i64 0, !1328, i64 8, !1336, i64 16, !1315, i64 48, !1253, i64 96, !1330, i64 100, !1330, i64 108, !1316, i64 120, !1337, i64 128, !1328, i64 256, !1328, i64 264, !1328, i64 272, !1253, i64 280, !1253, i64 284, !1253, i64 288, !1253, i64 292, !1253, i64 296, !1329, i64 304, !1316, i64 312, !1253, i64 320, !1253, i64 324, !1328, i64 328, !1329, i64 336, !1328, i64 344, !1328, i64 352, !1328, i64 360, !1253, i64 368, !1253, i64 372, !1329, i64 376, !1328, i64 384, !1316, i64 392, !1328, i64 400, !1253, i64 408, !1330, i64 412, !1330, i64 420, !1328, i64 432, !1328, i64 440, !1328, i64 448, !1338, i64 456, !1253, i64 488, !1331, i64 492, !1253, i64 496, !1341, i64 504, !1253, i64 672, !1329, i64 680, !1316, i64 688, !1316, i64 696, !1316, i64 704, !1253, i64 712}
!1336 = !{!"_RectangleInfo", !1329, i64 0, !1329, i64 8, !1329, i64 16, !1329, i64 24}
!1337 = !{!"_GradientInfo", !1253, i64 0, !1336, i64 8, !1338, i64 40, !1328, i64 72, !1329, i64 80, !1253, i64 88, !1253, i64 92, !1329, i64 96, !1339, i64 104, !1340, i64 120}
!1338 = !{!"_SegmentInfo", !1316, i64 0, !1316, i64 8, !1316, i64 16, !1316, i64 24}
!1339 = !{!"_PointInfo", !1316, i64 0, !1316, i64 8}
!1340 = !{!"float", !1253, i64 0}
!1341 = !{!"_ElementReference", !1328, i64 0, !1253, i64 8, !1337, i64 16, !1329, i64 144, !1328, i64 152, !1328, i64 160}
!1342 = !DILocation(line: 4834, column: 14, scope: !1287)
!1343 = !DILocation(line: 4834, column: 26, scope: !1287)
!1344 = !{!1335, !1316, i64 120}
!1345 = !DILocation(line: 4835, column: 14, scope: !1287)
!1346 = !DILocation(line: 4835, column: 21, scope: !1287)
!1347 = !{!1335, !1331, i64 492}
!1348 = !DILocation(line: 4836, column: 14, scope: !1287)
!1349 = !DILocation(line: 4836, column: 23, scope: !1287)
!1350 = !{!1335, !1253, i64 288}
!1351 = !DILocation(line: 4837, column: 14, scope: !1287)
!1352 = !DILocation(line: 4837, column: 21, scope: !1287)
!1353 = !{!1335, !1253, i64 292}
!1354 = !DILocation(line: 4838, column: 14, scope: !1287)
!1355 = !DILocation(line: 4838, column: 22, scope: !1287)
!1356 = !{!1335, !1253, i64 296}
!1357 = !DILocation(line: 4839, column: 14, scope: !1287)
!1358 = !DILocation(line: 4839, column: 24, scope: !1287)
!1359 = !{!1335, !1329, i64 304}
!1360 = !DILocation(line: 4840, column: 14, scope: !1287)
!1361 = !DILocation(line: 4840, column: 22, scope: !1287)
!1362 = !{!1335, !1253, i64 320}
!1363 = !DILocation(line: 4841, column: 19, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4841, column: 7)
!1365 = !{!1327, !1328, i64 120}
!1366 = !DILocation(line: 4841, column: 24, scope: !1364)
!1367 = !DILocation(line: 4841, column: 7, scope: !1287)
!1368 = !DILocation(line: 4842, column: 21, scope: !1364)
!1369 = !DILocation(line: 4842, column: 16, scope: !1364)
!1370 = !DILocation(line: 4842, column: 20, scope: !1364)
!1371 = !{!1335, !1328, i64 344}
!1372 = !DILocation(line: 4842, column: 5, scope: !1364)
!1373 = !DILocation(line: 4843, column: 19, scope: !1374)
!1374 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4843, column: 7)
!1375 = !{!1327, !1328, i64 136}
!1376 = !DILocation(line: 4843, column: 27, scope: !1374)
!1377 = !DILocation(line: 4843, column: 7, scope: !1287)
!1378 = !DILocation(line: 4844, column: 24, scope: !1374)
!1379 = !DILocation(line: 4844, column: 16, scope: !1374)
!1380 = !DILocation(line: 4844, column: 23, scope: !1374)
!1381 = !{!1335, !1328, i64 400}
!1382 = !DILocation(line: 4844, column: 5, scope: !1374)
!1383 = !DILocation(line: 4845, column: 41, scope: !1287)
!1384 = !DILocation(line: 4845, column: 14, scope: !1287)
!1385 = !DILocation(line: 4845, column: 28, scope: !1287)
!1386 = !{!1335, !1253, i64 284}
!1387 = !DILocation(line: 4846, column: 14, scope: !1287)
!1388 = !DILocation(line: 4846, column: 23, scope: !1287)
!1389 = !{!1335, !1316, i64 392}
!1390 = !DILocation(line: 4847, column: 19, scope: !1391)
!1391 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4847, column: 7)
!1392 = !{!1327, !1316, i64 144}
!1393 = !DILocation(line: 4847, column: 29, scope: !1391)
!1394 = !DILocation(line: 4847, column: 7, scope: !1287)
!1395 = !DILocation(line: 4848, column: 25, scope: !1391)
!1396 = !DILocation(line: 4848, column: 5, scope: !1391)
!1397 = !DILocation(line: 4849, column: 14, scope: !1287)
!1398 = !DILocation(line: 4849, column: 25, scope: !1287)
!1399 = !DILocation(line: 4849, column: 32, scope: !1287)
!1400 = !{!1335, !1331, i64 418}
!1401 = !DILocation(line: 4850, column: 14, scope: !1287)
!1402 = !DILocation(line: 4850, column: 39, scope: !1287)
!1403 = !DILocation(line: 4851, column: 14, scope: !1287)
!1404 = !DILocation(line: 4851, column: 21, scope: !1287)
!1405 = !{!1335, !1253, i64 324}
!1406 = !DILocation(line: 4852, column: 19, scope: !1407)
!1407 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4852, column: 7)
!1408 = !{!1327, !1328, i64 112}
!1409 = !DILocation(line: 4852, column: 31, scope: !1407)
!1410 = !DILocation(line: 4852, column: 7, scope: !1287)
!1411 = !DILocation(line: 4853, column: 28, scope: !1407)
!1412 = !DILocation(line: 4853, column: 16, scope: !1407)
!1413 = !DILocation(line: 4853, column: 27, scope: !1407)
!1414 = !{!1335, !1328, i64 432}
!1415 = !DILocation(line: 4853, column: 5, scope: !1407)
!1416 = !DILocation(line: 4854, column: 14, scope: !1287)
!1417 = !DILocation(line: 4854, column: 20, scope: !1287)
!1418 = !{!1335, !1253, i64 496}
!1419 = !DILocation(line: 4855, column: 20, scope: !1287)
!1420 = !DILocation(line: 4855, column: 14, scope: !1287)
!1421 = !DILocation(line: 4855, column: 19, scope: !1287)
!1422 = !{!1335, !1253, i64 672}
!1423 = !DILocation(line: 4856, column: 10, scope: !1287)
!1424 = !DILocation(line: 4857, column: 14, scope: !1425)
!1425 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4857, column: 7)
!1426 = !DILocation(line: 4857, column: 7, scope: !1287)
!1427 = !DILocation(line: 4858, column: 36, scope: !1425)
!1428 = !DILocation(line: 4858, column: 12, scope: !1425)
!1429 = !DILocation(line: 4858, column: 5, scope: !1425)
!1430 = !DILocation(line: 4859, column: 10, scope: !1287)
!1431 = !DILocation(line: 4860, column: 14, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4860, column: 7)
!1433 = !DILocation(line: 4860, column: 7, scope: !1287)
!1434 = !DILocalVariable(name: "string", arg: 1, scope: !1435, file: !1436, line: 42, type: !1439)
!1435 = distinct !DISubprogram(name: "StringToDouble", scope: !1436, file: !1436, line: 42, type: !1437, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1441)
!1436 = !DIFile(filename: "apps/538.imagick_r/src/magick/string-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "af275f9a9b26a4e8bc1a481724207dee")
!1437 = !DISubroutineType(types: !1438)
!1438 = !{!729, !1439, !1440}
!1439 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !905)
!1440 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1196)
!1441 = !{!1434, !1442}
!1442 = !DILocalVariable(name: "sentinal", arg: 2, scope: !1435, file: !1436, line: 43, type: !1440)
!1443 = !DILocation(line: 0, scope: !1435, inlinedAt: !1444)
!1444 = distinct !DILocation(line: 4861, column: 24, scope: !1432)
!1445 = !DILocation(line: 45, column: 10, scope: !1435, inlinedAt: !1444)
!1446 = !DILocation(line: 4861, column: 16, scope: !1432)
!1447 = !DILocation(line: 4861, column: 23, scope: !1432)
!1448 = !{!1335, !1316, i64 688}
!1449 = !DILocation(line: 4861, column: 5, scope: !1432)
!1450 = !DILocation(line: 4862, column: 10, scope: !1287)
!1451 = !DILocation(line: 4863, column: 14, scope: !1452)
!1452 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4863, column: 7)
!1453 = !DILocation(line: 4863, column: 7, scope: !1287)
!1454 = !DILocation(line: 0, scope: !1435, inlinedAt: !1455)
!1455 = distinct !DILocation(line: 4864, column: 34, scope: !1452)
!1456 = !DILocation(line: 45, column: 10, scope: !1435, inlinedAt: !1455)
!1457 = !DILocation(line: 4864, column: 16, scope: !1452)
!1458 = !DILocation(line: 4864, column: 33, scope: !1452)
!1459 = !{!1335, !1316, i64 704}
!1460 = !DILocation(line: 4864, column: 5, scope: !1452)
!1461 = !DILocation(line: 4865, column: 14, scope: !1287)
!1462 = !DILocation(line: 4865, column: 23, scope: !1287)
!1463 = !{!1335, !1253, i64 712}
!1464 = !DILocation(line: 4866, column: 10, scope: !1287)
!1465 = !DILocation(line: 4867, column: 14, scope: !1466)
!1466 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4867, column: 7)
!1467 = !DILocation(line: 4867, column: 7, scope: !1287)
!1468 = !DILocation(line: 0, scope: !1435, inlinedAt: !1469)
!1469 = distinct !DILocation(line: 4868, column: 34, scope: !1466)
!1470 = !DILocation(line: 45, column: 10, scope: !1435, inlinedAt: !1469)
!1471 = !DILocation(line: 4868, column: 16, scope: !1466)
!1472 = !DILocation(line: 4868, column: 33, scope: !1466)
!1473 = !{!1335, !1316, i64 696}
!1474 = !DILocation(line: 4868, column: 5, scope: !1466)
!1475 = !DILocation(line: 4869, column: 10, scope: !1287)
!1476 = !DILocation(line: 4870, column: 14, scope: !1477)
!1477 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4870, column: 7)
!1478 = !DILocation(line: 4870, column: 7, scope: !1287)
!1479 = !DILocation(line: 4871, column: 42, scope: !1477)
!1480 = !DILocation(line: 4871, column: 26, scope: !1477)
!1481 = !DILocation(line: 4871, column: 25, scope: !1477)
!1482 = !DILocation(line: 4871, column: 5, scope: !1477)
!1483 = !DILocation(line: 4873, column: 10, scope: !1287)
!1484 = !DILocation(line: 4874, column: 14, scope: !1485)
!1485 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4874, column: 7)
!1486 = !DILocation(line: 4874, column: 7, scope: !1287)
!1487 = !DILocation(line: 4875, column: 12, scope: !1485)
!1488 = !DILocation(line: 4875, column: 5, scope: !1485)
!1489 = !DILocation(line: 4876, column: 10, scope: !1287)
!1490 = !DILocation(line: 4877, column: 14, scope: !1491)
!1491 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4877, column: 7)
!1492 = !DILocation(line: 4877, column: 7, scope: !1287)
!1493 = !DILocation(line: 4878, column: 12, scope: !1491)
!1494 = !DILocation(line: 4878, column: 5, scope: !1491)
!1495 = !DILocation(line: 4879, column: 10, scope: !1287)
!1496 = !DILocation(line: 4880, column: 14, scope: !1497)
!1497 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4880, column: 7)
!1498 = !DILocation(line: 4880, column: 7, scope: !1287)
!1499 = !DILocation(line: 0, scope: !1435, inlinedAt: !1500)
!1500 = distinct !DILocation(line: 4881, column: 29, scope: !1497)
!1501 = !DILocation(line: 45, column: 10, scope: !1435, inlinedAt: !1500)
!1502 = !DILocation(line: 4881, column: 28, scope: !1497)
!1503 = !DILocation(line: 4881, column: 5, scope: !1497)
!1504 = !DILocation(line: 4882, column: 10, scope: !1287)
!1505 = !DILocation(line: 4883, column: 14, scope: !1506)
!1506 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4883, column: 7)
!1507 = !DILocation(line: 4883, column: 7, scope: !1287)
!1508 = !DILocation(line: 4884, column: 12, scope: !1506)
!1509 = !DILocation(line: 4884, column: 5, scope: !1506)
!1510 = !DILocation(line: 4885, column: 10, scope: !1287)
!1511 = !DILocation(line: 4886, column: 14, scope: !1512)
!1512 = distinct !DILexicalBlock(scope: !1287, file: !665, line: 4886, column: 7)
!1513 = !DILocation(line: 4886, column: 7, scope: !1287)
!1514 = !DILocation(line: 4887, column: 38, scope: !1512)
!1515 = !DILocation(line: 4887, column: 24, scope: !1512)
!1516 = !DILocation(line: 4887, column: 16, scope: !1512)
!1517 = !DILocation(line: 4887, column: 23, scope: !1512)
!1518 = !{!1335, !1253, i64 96}
!1519 = !DILocation(line: 4887, column: 5, scope: !1512)
!1520 = !DILocation(line: 4889, column: 13, scope: !1287)
!1521 = !DILocation(line: 4890, column: 14, scope: !1287)
!1522 = !DILocation(line: 4890, column: 23, scope: !1287)
!1523 = !{!1335, !1329, i64 680}
!1524 = !DILocation(line: 4891, column: 14, scope: !1287)
!1525 = !DILocation(line: 4892, column: 1, scope: !1287)
!1526 = distinct !DISubprogram(name: "CloneDrawInfo", scope: !665, file: !665, line: 246, type: !1527, scopeLine: 248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1531)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!700, !1290, !1529}
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64)
!1530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!1531 = !{!1532, !1533, !1534, !1535, !1538, !1539, !1542, !1545, !1546, !1549, !1552}
!1532 = !DILocalVariable(name: "image_info", arg: 1, scope: !1526, file: !665, line: 246, type: !1290)
!1533 = !DILocalVariable(name: "draw_info", arg: 2, scope: !1526, file: !665, line: 247, type: !1529)
!1534 = !DILocalVariable(name: "clone_info", scope: !1526, file: !665, line: 250, type: !700)
!1535 = !DILocalVariable(name: "message", scope: !1536, file: !665, line: 254, type: !705)
!1536 = distinct !DILexicalBlock(scope: !1537, file: !665, line: 254, column: 5)
!1537 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 253, column: 7)
!1538 = !DILocalVariable(name: "exception", scope: !1536, file: !665, line: 254, type: !933)
!1539 = !DILocalVariable(name: "x", scope: !1540, file: !665, line: 316, type: !718)
!1540 = distinct !DILexicalBlock(scope: !1541, file: !665, line: 314, column: 5)
!1541 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 313, column: 7)
!1542 = !DILocalVariable(name: "message", scope: !1543, file: !665, line: 322, type: !705)
!1543 = distinct !DILexicalBlock(scope: !1544, file: !665, line: 322, column: 9)
!1544 = distinct !DILexicalBlock(scope: !1540, file: !665, line: 321, column: 11)
!1545 = !DILocalVariable(name: "exception", scope: !1543, file: !665, line: 322, type: !933)
!1546 = !DILocalVariable(name: "number_stops", scope: !1547, file: !665, line: 331, type: !713)
!1547 = distinct !DILexicalBlock(scope: !1548, file: !665, line: 329, column: 5)
!1548 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 328, column: 7)
!1549 = !DILocalVariable(name: "message", scope: !1550, file: !665, line: 337, type: !705)
!1550 = distinct !DILexicalBlock(scope: !1551, file: !665, line: 337, column: 9)
!1551 = distinct !DILexicalBlock(scope: !1547, file: !665, line: 336, column: 11)
!1552 = !DILocalVariable(name: "exception", scope: !1550, file: !665, line: 337, type: !933)
!1553 = !DILocation(line: 0, scope: !1526)
!1554 = !DILocation(line: 252, column: 27, scope: !1526)
!1555 = !DILocation(line: 253, column: 18, scope: !1537)
!1556 = !DILocation(line: 253, column: 7, scope: !1526)
!1557 = !DILocation(line: 254, column: 5, scope: !1536)
!1558 = !DILocation(line: 0, scope: !1536)
!1559 = !DILocation(line: 255, column: 3, scope: !1526)
!1560 = !DILocation(line: 256, column: 17, scope: !1561)
!1561 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 256, column: 7)
!1562 = !DILocation(line: 256, column: 7, scope: !1526)
!1563 = !DILocation(line: 258, column: 19, scope: !1564)
!1564 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 258, column: 7)
!1565 = !{!1335, !1328, i64 0}
!1566 = !DILocation(line: 258, column: 29, scope: !1564)
!1567 = !DILocation(line: 258, column: 7, scope: !1526)
!1568 = !DILocation(line: 259, column: 58, scope: !1564)
!1569 = !DILocation(line: 259, column: 12, scope: !1564)
!1570 = !DILocation(line: 259, column: 5, scope: !1564)
!1571 = !DILocation(line: 260, column: 18, scope: !1572)
!1572 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 260, column: 7)
!1573 = !{!1335, !1328, i64 8}
!1574 = !DILocation(line: 260, column: 27, scope: !1572)
!1575 = !DILocation(line: 260, column: 7, scope: !1526)
!1576 = !DILocation(line: 261, column: 37, scope: !1572)
!1577 = !DILocation(line: 261, column: 12, scope: !1572)
!1578 = !DILocation(line: 261, column: 5, scope: !1572)
!1579 = !DILocation(line: 262, column: 15, scope: !1526)
!1580 = !DILocation(line: 262, column: 34, scope: !1526)
!1581 = !{i64 0, i64 8, !1582, i64 8, i64 8, !1582, i64 16, i64 8, !1582, i64 24, i64 8, !1582}
!1582 = !{!1329, !1329, i64 0}
!1583 = !DILocation(line: 263, column: 15, scope: !1526)
!1584 = !DILocation(line: 263, column: 33, scope: !1526)
!1585 = !{i64 0, i64 8, !1586, i64 8, i64 8, !1586, i64 16, i64 8, !1586, i64 24, i64 8, !1586, i64 32, i64 8, !1586, i64 40, i64 8, !1586}
!1586 = !{!1316, !1316, i64 0}
!1587 = !DILocation(line: 264, column: 34, scope: !1526)
!1588 = !DILocation(line: 264, column: 15, scope: !1526)
!1589 = !DILocation(line: 264, column: 22, scope: !1526)
!1590 = !DILocation(line: 265, column: 15, scope: !1526)
!1591 = !DILocation(line: 265, column: 31, scope: !1526)
!1592 = !DILocation(line: 266, column: 15, scope: !1526)
!1593 = !DILocation(line: 266, column: 33, scope: !1526)
!1594 = !DILocation(line: 267, column: 39, scope: !1526)
!1595 = !DILocation(line: 267, column: 15, scope: !1526)
!1596 = !DILocation(line: 267, column: 27, scope: !1526)
!1597 = !DILocation(line: 268, column: 18, scope: !1598)
!1598 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 268, column: 7)
!1599 = !{!1335, !1328, i64 256}
!1600 = !DILocation(line: 268, column: 31, scope: !1598)
!1601 = !DILocation(line: 268, column: 7, scope: !1526)
!1602 = !DILocation(line: 272, column: 20, scope: !1603)
!1603 = distinct !DILexicalBlock(scope: !1598, file: !665, line: 272, column: 9)
!1604 = !{!1335, !1328, i64 264}
!1605 = !DILocation(line: 272, column: 25, scope: !1603)
!1606 = !DILocation(line: 272, column: 9, scope: !1598)
!1607 = !DILocation(line: 0, scope: !1598)
!1608 = !DILocation(line: 275, column: 20, scope: !1526)
!1609 = !DILocation(line: 275, column: 15, scope: !1526)
!1610 = !DILocation(line: 275, column: 19, scope: !1526)
!1611 = !DILocation(line: 276, column: 18, scope: !1612)
!1612 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 276, column: 7)
!1613 = !{!1335, !1328, i64 272}
!1614 = !DILocation(line: 276, column: 33, scope: !1612)
!1615 = !DILocation(line: 276, column: 7, scope: !1526)
!1616 = !DILocation(line: 278, column: 46, scope: !1612)
!1617 = !DILocation(line: 277, column: 32, scope: !1612)
!1618 = !DILocation(line: 277, column: 17, scope: !1612)
!1619 = !DILocation(line: 277, column: 31, scope: !1612)
!1620 = !DILocation(line: 277, column: 5, scope: !1612)
!1621 = !DILocation(line: 279, column: 43, scope: !1526)
!1622 = !DILocation(line: 279, column: 15, scope: !1526)
!1623 = !DILocation(line: 279, column: 31, scope: !1526)
!1624 = !DILocation(line: 280, column: 41, scope: !1526)
!1625 = !DILocation(line: 280, column: 15, scope: !1526)
!1626 = !DILocation(line: 280, column: 29, scope: !1526)
!1627 = !DILocation(line: 281, column: 36, scope: !1526)
!1628 = !DILocation(line: 281, column: 15, scope: !1526)
!1629 = !DILocation(line: 281, column: 24, scope: !1526)
!1630 = !DILocation(line: 282, column: 34, scope: !1526)
!1631 = !DILocation(line: 282, column: 15, scope: !1526)
!1632 = !DILocation(line: 282, column: 22, scope: !1526)
!1633 = !DILocation(line: 283, column: 35, scope: !1526)
!1634 = !DILocation(line: 283, column: 15, scope: !1526)
!1635 = !DILocation(line: 283, column: 23, scope: !1526)
!1636 = !DILocation(line: 284, column: 37, scope: !1526)
!1637 = !DILocation(line: 284, column: 15, scope: !1526)
!1638 = !DILocation(line: 284, column: 25, scope: !1526)
!1639 = !DILocation(line: 285, column: 38, scope: !1526)
!1640 = !{!1335, !1316, i64 312}
!1641 = !DILocation(line: 285, column: 15, scope: !1526)
!1642 = !DILocation(line: 285, column: 26, scope: !1526)
!1643 = !DILocation(line: 286, column: 35, scope: !1526)
!1644 = !DILocation(line: 286, column: 15, scope: !1526)
!1645 = !DILocation(line: 286, column: 23, scope: !1526)
!1646 = !DILocation(line: 287, column: 34, scope: !1526)
!1647 = !DILocation(line: 287, column: 15, scope: !1526)
!1648 = !DILocation(line: 287, column: 22, scope: !1526)
!1649 = !DILocation(line: 288, column: 18, scope: !1650)
!1650 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 288, column: 7)
!1651 = !{!1335, !1328, i64 328}
!1652 = !DILocation(line: 288, column: 23, scope: !1650)
!1653 = !DILocation(line: 288, column: 7, scope: !1526)
!1654 = !DILocation(line: 289, column: 37, scope: !1650)
!1655 = !DILocation(line: 289, column: 12, scope: !1650)
!1656 = !DILocation(line: 289, column: 5, scope: !1650)
!1657 = !DILocation(line: 290, column: 18, scope: !1658)
!1658 = distinct !DILexicalBlock(scope: !1526, file: !665, line: 290, column: 7)
!1659 = !DILocation(line: 290, column: 23, scope: !1658)
!1660 = !DILocation(line: 290, column: 7, scope: !1526)
!1661 = !DILocation(line: 291, column: 37, scope: !1658)
!1662 = !DILocation(line: 291, column: 12, scope: !1658)
!1663 = !DILocation(line: 291, column: 5, scope: !1658)
!1664 = !DILocation(line: 292, column: 18, scope: !1665)
