; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/wand/drawing-wand.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/wand/drawing-wand.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._DrawingWand = type { i64, [4096 x i8], ptr, ptr, ptr, i64, i64, i64, ptr, %struct._RectangleInfo, i64, i64, ptr, i32, i64, i32, i32, i32, i32, i64 }
%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._AffineMatrix = type { double, double, double, double, double, double }
%struct._DrawInfo = type { ptr, ptr, %struct._RectangleInfo, %struct._AffineMatrix, i32, %struct._PixelPacket, %struct._PixelPacket, double, %struct._GradientInfo, ptr, ptr, ptr, i32, i32, i32, i32, i32, i64, double, i32, i32, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, double, ptr, i32, %struct._PixelPacket, %struct._PixelPacket, ptr, ptr, ptr, %struct._SegmentInfo, i32, i16, i32, %struct._ElementReference, i32, i64, double, double, double, i32 }
%struct._GradientInfo = type { i32, %struct._RectangleInfo, %struct._SegmentInfo, ptr, i64, i32, i32, i64, %struct._PointInfo, float }
%struct._PointInfo = type { double, double }
%struct._PixelPacket = type { i16, i16, i16, i16 }
%struct._SegmentInfo = type { double, double, double, double }

!608 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!609 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!610 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!611 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!612 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!613 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!614 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!615 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!616 = !DIEnumerator(name: "MagickListOptions", value: 38)
!617 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!618 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!619 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!620 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!621 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!622 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!623 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!624 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!625 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!626 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!627 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!628 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!629 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!630 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!631 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!632 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!633 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!634 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!635 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!636 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!637 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!638 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!639 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!640 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!641 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!642 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!643 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!644 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!645 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!646 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!647 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!648 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 93, baseType: !5, size: 32, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656}
!651 = !DIEnumerator(name: "UndefinedMethod", value: 0)
!652 = !DIEnumerator(name: "PointMethod", value: 1)
!653 = !DIEnumerator(name: "ReplaceMethod", value: 2)
!654 = !DIEnumerator(name: "FloodfillMethod", value: 3)
!655 = !DIEnumerator(name: "FillToBorderMethod", value: 4)
!656 = !DIEnumerator(name: "ResetMethod", value: 5)
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !153, line: 25, baseType: !5, size: 32, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!659 = !DIEnumerator(name: "NoValue", value: 0)
!660 = !DIEnumerator(name: "XValue", value: 1)
!661 = !DIEnumerator(name: "XiValue", value: 1)
!662 = !DIEnumerator(name: "YValue", value: 2)
!663 = !DIEnumerator(name: "PsiValue", value: 2)
!664 = !DIEnumerator(name: "WidthValue", value: 4)
!665 = !DIEnumerator(name: "RhoValue", value: 4)
!666 = !DIEnumerator(name: "HeightValue", value: 8)
!667 = !DIEnumerator(name: "SigmaValue", value: 8)
!668 = !DIEnumerator(name: "ChiValue", value: 16)
!669 = !DIEnumerator(name: "XiNegative", value: 32)
!670 = !DIEnumerator(name: "XNegative", value: 32)
!671 = !DIEnumerator(name: "PsiNegative", value: 64)
!672 = !DIEnumerator(name: "YNegative", value: 64)
!673 = !DIEnumerator(name: "ChiNegative", value: 128)
!674 = !DIEnumerator(name: "PercentValue", value: 4096)
!675 = !DIEnumerator(name: "AspectValue", value: 8192)
!676 = !DIEnumerator(name: "NormalizeValue", value: 8192)
!677 = !DIEnumerator(name: "LessValue", value: 16384)
!678 = !DIEnumerator(name: "GreaterValue", value: 32768)
!679 = !DIEnumerator(name: "MinimumValue", value: 65536)
!680 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536)
!681 = !DIEnumerator(name: "AreaValue", value: 131072)
!682 = !DIEnumerator(name: "DecimalValue", value: 262144)
!683 = !DIEnumerator(name: "SeparatorValue", value: 524288)
!684 = !DIEnumerator(name: "AllValues", value: 2147483647)
!685 = !{!686, !687, !693, !829, !789, !1039, !688, !1171, !1173, !575, !716, !701, !705, !1201, !892, !947, !729, !1203, !1013, !1205, !1209, !1017, !992, !769, !1212, !984, !1002, !1000, !723, !986, !988, !1008, !1213}
!686 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawInfo", file: !369, line: 333, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DrawInfo", file: !369, line: 205, size: 5760, elements: !691)
!691 = !{!692, !695, !696, !711, !722, !724, !734, !735, !736, !788, !979, !980, !981, !982, !983, !985, !987, !989, !990, !991, !993, !994, !995, !996, !997, !998, !999, !1001, !1003, !1004, !1005, !1006, !1007, !1009, !1010, !1011, !1012, !1014, !1015, !1016, !1018, !1019, !1020, !1032, !1033, !1034, !1035, !1036, !1037}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !690, file: !369, line: 208, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !690, file: !369, line: 209, baseType: !693, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "viewbox", scope: !690, file: !369, line: 212, baseType: !697, size: 256, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !699)
!699 = !{!700, !703, !704, !710}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !698, file: !153, line: 124, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !702, line: 46, baseType: !686)
!702 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!703 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !698, file: !153, line: 125, baseType: !701, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !698, file: !153, line: 128, baseType: !705, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !706, line: 77, baseType: !707)
!706 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !708, line: 193, baseType: !709)
!708 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!709 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !698, file: !153, line: 129, baseType: !705, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "affine", scope: !690, file: !369, line: 215, baseType: !712, size: 384, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !153, line: 102, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !153, line: 93, size: 384, elements: !714)
!714 = !{!715, !717, !718, !719, !720, !721}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !713, file: !153, line: 96, baseType: !716, size: 64)
!716 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !713, file: !153, line: 97, baseType: !716, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !713, file: !153, line: 98, baseType: !716, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !713, file: !153, line: 99, baseType: !716, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !713, file: !153, line: 100, baseType: !716, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !713, file: !153, line: 101, baseType: !716, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !690, file: !369, line: 218, baseType: !723, size: 32, offset: 768)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !690, file: !369, line: 221, baseType: !725, size: 64, offset: 800)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !727)
!727 = !{!728, !731, !732, !733}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !726, file: !326, line: 143, baseType: !729, size: 16)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !730)
!730 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !726, file: !326, line: 144, baseType: !729, size: 16, offset: 16)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !726, file: !326, line: 145, baseType: !729, size: 16, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !726, file: !326, line: 146, baseType: !729, size: 16, offset: 48)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !690, file: !369, line: 222, baseType: !725, size: 64, offset: 864)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_width", scope: !690, file: !369, line: 225, baseType: !716, size: 64, offset: 960)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !690, file: !369, line: 228, baseType: !737, size: 1024, offset: 1024)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientInfo", file: !369, line: 184, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GradientInfo", file: !369, line: 153, size: 1024, elements: !739)
!739 = !{!740, !742, !743, !751, !776, !777, !779, !780, !781, !787}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !738, file: !369, line: 156, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientType", file: !369, line: 75, baseType: !368)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bounding_box", scope: !738, file: !369, line: 159, baseType: !697, size: 256, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_vector", scope: !738, file: !369, line: 162, baseType: !744, size: 256, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !73, line: 110, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !73, line: 103, size: 256, elements: !746)
!746 = !{!747, !748, !749, !750}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !745, file: !73, line: 106, baseType: !716, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !745, file: !73, line: 107, baseType: !716, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !745, file: !73, line: 108, baseType: !716, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !745, file: !73, line: 109, baseType: !716, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "stops", scope: !738, file: !369, line: 165, baseType: !752, size: 64, offset: 576)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "StopInfo", file: !369, line: 151, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StopInfo", file: !369, line: 144, size: 512, elements: !755)
!755 = !{!756, !775}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !754, file: !369, line: 147, baseType: !757, size: 448)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !759)
!759 = !{!760, !762, !764, !766, !767, !768, !771, !772, !773, !774}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !758, file: !326, line: 107, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !758, file: !326, line: 110, baseType: !763, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !758, file: !326, line: 113, baseType: !765, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !758, file: !326, line: 116, baseType: !716, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !758, file: !326, line: 119, baseType: !701, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !758, file: !326, line: 122, baseType: !769, size: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !770)
!770 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !758, file: !326, line: 123, baseType: !769, size: 32, offset: 288)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !758, file: !326, line: 124, baseType: !769, size: 32, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !758, file: !326, line: 125, baseType: !769, size: 32, offset: 352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !758, file: !326, line: 126, baseType: !769, size: 32, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !754, file: !369, line: 150, baseType: !769, size: 32, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "number_stops", scope: !738, file: !369, line: 168, baseType: !701, size: 64, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !738, file: !369, line: 171, baseType: !778, size: 32, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpreadMethod", file: !369, line: 135, baseType: !374)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !738, file: !369, line: 174, baseType: !765, size: 32, offset: 736)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !738, file: !369, line: 177, baseType: !701, size: 64, offset: 768)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !738, file: !369, line: 180, baseType: !782, size: 128, offset: 832)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !369, line: 142, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !369, line: 137, size: 128, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !783, file: !369, line: 140, baseType: !716, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !783, file: !369, line: 141, baseType: !716, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !738, file: !369, line: 183, baseType: !769, size: 32, offset: 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fill_pattern", scope: !690, file: !369, line: 231, baseType: !789, size: 64, offset: 2048)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !792)
!792 = !{!793, !794, !795, !797, !798, !800, !801, !802, !803, !804, !805, !806, !808, !809, !810, !811, !812, !826, !828, !830, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !846, !848, !850, !851, !853, !855, !857, !858, !859, !860, !861, !862, !863, !871, !886, !900, !901, !902, !903, !907, !911, !915, !916, !917, !918, !919, !936, !937, !939, !940, !950, !951, !953, !954, !955, !956, !957, !958, !960, !961, !962, !963, !964, !965, !966, !968, !969, !970, !971, !972, !976, !978}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !791, file: !73, line: 153, baseType: !761, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !791, file: !73, line: 156, baseType: !763, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !791, file: !73, line: 159, baseType: !796, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !791, file: !73, line: 162, baseType: !701, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !791, file: !73, line: 165, baseType: !799, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !791, file: !73, line: 168, baseType: !765, size: 32, offset: 224)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !791, file: !73, line: 169, baseType: !765, size: 32, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !791, file: !73, line: 172, baseType: !701, size: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !791, file: !73, line: 173, baseType: !701, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !791, file: !73, line: 174, baseType: !701, size: 64, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !791, file: !73, line: 175, baseType: !701, size: 64, offset: 512)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !791, file: !73, line: 178, baseType: !807, size: 64, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !791, file: !73, line: 179, baseType: !725, size: 64, offset: 640)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !791, file: !73, line: 180, baseType: !725, size: 64, offset: 704)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !791, file: !73, line: 181, baseType: !725, size: 64, offset: 768)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !791, file: !73, line: 184, baseType: !716, size: 64, offset: 832)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !791, file: !73, line: 187, baseType: !813, size: 768, offset: 896)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !815)
!815 = !{!816, !823, !824, !825}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !814, file: !73, line: 124, baseType: !817, size: 192)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !818, file: !73, line: 98, baseType: !716, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !818, file: !73, line: 99, baseType: !716, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !818, file: !73, line: 100, baseType: !716, size: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !814, file: !73, line: 125, baseType: !817, size: 192, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !814, file: !73, line: 126, baseType: !817, size: 192, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !814, file: !73, line: 127, baseType: !817, size: 192, offset: 576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !791, file: !73, line: 190, baseType: !827, size: 32, offset: 1664)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !791, file: !73, line: 193, baseType: !829, size: 64, offset: 1728)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !791, file: !73, line: 196, baseType: !831, size: 32, offset: 1792)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !791, file: !73, line: 199, baseType: !693, size: 64, offset: 1856)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !791, file: !73, line: 200, baseType: !693, size: 64, offset: 1920)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !791, file: !73, line: 201, baseType: !693, size: 64, offset: 1984)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !791, file: !73, line: 204, baseType: !705, size: 64, offset: 2048)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !791, file: !73, line: 207, baseType: !716, size: 64, offset: 2112)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !791, file: !73, line: 208, baseType: !716, size: 64, offset: 2176)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !791, file: !73, line: 211, baseType: !697, size: 256, offset: 2240)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !791, file: !73, line: 212, baseType: !697, size: 256, offset: 2496)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !791, file: !73, line: 213, baseType: !697, size: 256, offset: 2752)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !791, file: !73, line: 216, baseType: !716, size: 64, offset: 3008)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !791, file: !73, line: 217, baseType: !716, size: 64, offset: 3072)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !791, file: !73, line: 218, baseType: !716, size: 64, offset: 3136)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !791, file: !73, line: 221, baseType: !845, size: 32, offset: 3200)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !791, file: !73, line: 224, baseType: !847, size: 32, offset: 3232)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !791, file: !73, line: 227, baseType: !849, size: 32, offset: 3264)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !791, file: !73, line: 230, baseType: !723, size: 32, offset: 3296)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !791, file: !73, line: 233, baseType: !852, size: 32, offset: 3328)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !791, file: !73, line: 236, baseType: !854, size: 32, offset: 3360)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !791, file: !73, line: 239, baseType: !856, size: 64, offset: 3392)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !791, file: !73, line: 242, baseType: !701, size: 64, offset: 3456)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !791, file: !73, line: 243, baseType: !701, size: 64, offset: 3520)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !791, file: !73, line: 246, baseType: !705, size: 64, offset: 3584)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !791, file: !73, line: 249, baseType: !701, size: 64, offset: 3648)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !791, file: !73, line: 250, baseType: !701, size: 64, offset: 3712)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !791, file: !73, line: 253, baseType: !705, size: 64, offset: 3776)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !791, file: !73, line: 256, baseType: !864, size: 192, offset: 3840)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !865, line: 68, baseType: !866)
!865 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !865, line: 62, size: 192, elements: !867)
!867 = !{!868, !869, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !866, file: !865, line: 65, baseType: !716, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !866, file: !865, line: 66, baseType: !716, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !866, file: !865, line: 67, baseType: !716, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !791, file: !73, line: 259, baseType: !872, size: 512, offset: 4032)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !874)
!874 = !{!875, !882, !883, !885}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !873, file: !247, line: 43, baseType: !876, size: 192)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !878)
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !877, file: !247, line: 35, baseType: !716, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !877, file: !247, line: 36, baseType: !716, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !877, file: !247, line: 37, baseType: !716, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !873, file: !247, line: 44, baseType: !876, size: 192, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !873, file: !247, line: 47, baseType: !884, size: 32, offset: 384)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !873, file: !247, line: 50, baseType: !701, size: 64, offset: 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !791, file: !73, line: 262, baseType: !887, size: 64, offset: 4544)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !888, line: 26, baseType: !889)
!888 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!765, !892, !894, !897, !829}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !896)
!896 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !899)
!899 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !791, file: !73, line: 265, baseType: !829, size: 64, offset: 4608)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !791, file: !73, line: 266, baseType: !829, size: 64, offset: 4672)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !791, file: !73, line: 267, baseType: !829, size: 64, offset: 4736)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !791, file: !73, line: 270, baseType: !904, size: 64, offset: 4800)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !906)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !791, file: !73, line: 273, baseType: !908, size: 64, offset: 4864)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !910)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !791, file: !73, line: 276, baseType: !912, size: 32768, offset: 4928)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 32768, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 4096)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !791, file: !73, line: 277, baseType: !912, size: 32768, offset: 37696)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !791, file: !73, line: 278, baseType: !912, size: 32768, offset: 70464)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !791, file: !73, line: 281, baseType: !701, size: 64, offset: 103232)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !791, file: !73, line: 282, baseType: !701, size: 64, offset: 103296)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !791, file: !73, line: 285, baseType: !920, size: 448, offset: 103360)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !922)
!922 = !{!923, !925, !926, !927, !928, !929, !930, !935}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !921, file: !253, line: 105, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !921, file: !253, line: 108, baseType: !575, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !921, file: !253, line: 111, baseType: !693, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !921, file: !253, line: 112, baseType: !693, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !921, file: !253, line: 115, baseType: !829, size: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !921, file: !253, line: 118, baseType: !765, size: 32, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !921, file: !253, line: 121, baseType: !931, size: 64, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !933, line: 26, baseType: !934)
!933 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !933, line: 25, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !921, file: !253, line: 124, baseType: !701, size: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !791, file: !73, line: 288, baseType: !765, size: 32, offset: 103808)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !791, file: !73, line: 291, baseType: !938, size: 64, offset: 103872)
!938 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !705)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !791, file: !73, line: 294, baseType: !931, size: 64, offset: 103936)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !791, file: !73, line: 297, baseType: !941, size: 256, offset: 104000)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !943)
!943 = !{!944, !945, !946, !949}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !89, line: 30, baseType: !693, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !942, file: !89, line: 33, baseType: !701, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !942, file: !89, line: 36, baseType: !947, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !942, file: !89, line: 39, baseType: !701, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !791, file: !73, line: 298, baseType: !941, size: 256, offset: 104256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !791, file: !73, line: 299, baseType: !952, size: 64, offset: 104512)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !791, file: !73, line: 302, baseType: !701, size: 64, offset: 104576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !791, file: !73, line: 305, baseType: !701, size: 64, offset: 104640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !791, file: !73, line: 308, baseType: !856, size: 64, offset: 104704)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !791, file: !73, line: 309, baseType: !856, size: 64, offset: 104768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !791, file: !73, line: 310, baseType: !856, size: 64, offset: 104832)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !791, file: !73, line: 313, baseType: !959, size: 32, offset: 104896)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !791, file: !73, line: 316, baseType: !765, size: 32, offset: 104928)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !791, file: !73, line: 319, baseType: !725, size: 64, offset: 104960)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !791, file: !73, line: 322, baseType: !856, size: 64, offset: 105024)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !791, file: !73, line: 325, baseType: !697, size: 256, offset: 105088)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !791, file: !73, line: 328, baseType: !829, size: 64, offset: 105344)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !791, file: !73, line: 329, baseType: !829, size: 64, offset: 105408)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !791, file: !73, line: 332, baseType: !967, size: 32, offset: 105472)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !791, file: !73, line: 335, baseType: !765, size: 32, offset: 105504)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !791, file: !73, line: 338, baseType: !898, size: 64, offset: 105536)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !791, file: !73, line: 341, baseType: !765, size: 32, offset: 105600)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !791, file: !73, line: 344, baseType: !701, size: 64, offset: 105664)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !791, file: !73, line: 347, baseType: !973, size: 64, offset: 105728)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !974, line: 7, baseType: !975)
!974 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !708, line: 160, baseType: !709)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !791, file: !73, line: 350, baseType: !977, size: 32, offset: 105792)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !791, file: !73, line: 353, baseType: !701, size: 64, offset: 105856)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !690, file: !369, line: 232, baseType: !789, size: 64, offset: 2112)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_pattern", scope: !690, file: !369, line: 233, baseType: !789, size: 64, offset: 2176)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_antialias", scope: !690, file: !369, line: 236, baseType: !765, size: 32, offset: 2240)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "text_antialias", scope: !690, file: !369, line: 237, baseType: !765, size: 32, offset: 2272)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !690, file: !369, line: 240, baseType: !984, size: 32, offset: 2304)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "FillRule", file: !369, line: 68, baseType: !380)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "linecap", scope: !690, file: !369, line: 243, baseType: !986, size: 32, offset: 2336)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineCap", file: !369, line: 83, baseType: !385)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "linejoin", scope: !690, file: !369, line: 246, baseType: !988, size: 32, offset: 2368)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineJoin", file: !369, line: 91, baseType: !391)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "miterlimit", scope: !690, file: !369, line: 249, baseType: !701, size: 64, offset: 2432)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !690, file: !369, line: 252, baseType: !716, size: 64, offset: 2496)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "decorate", scope: !690, file: !369, line: 255, baseType: !992, size: 32, offset: 2560)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecorationType", file: !369, line: 53, baseType: !397)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !690, file: !369, line: 258, baseType: !852, size: 32, offset: 2592)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !690, file: !369, line: 261, baseType: !693, size: 64, offset: 2624)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !690, file: !369, line: 264, baseType: !701, size: 64, offset: 2688)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !690, file: !369, line: 267, baseType: !693, size: 64, offset: 2752)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !690, file: !369, line: 268, baseType: !693, size: 64, offset: 2816)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !690, file: !369, line: 269, baseType: !693, size: 64, offset: 2880)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !690, file: !369, line: 272, baseType: !1000, size: 32, offset: 2944)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleType", file: !405, line: 47, baseType: !404)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !690, file: !369, line: 275, baseType: !1002, size: 32, offset: 2976)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "StretchType", file: !405, line: 38, baseType: !412)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !690, file: !369, line: 278, baseType: !701, size: 64, offset: 3008)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !690, file: !369, line: 281, baseType: !693, size: 64, offset: 3072)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !690, file: !369, line: 284, baseType: !716, size: 64, offset: 3136)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !690, file: !369, line: 287, baseType: !693, size: 64, offset: 3200)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !690, file: !369, line: 290, baseType: !1008, size: 32, offset: 3264)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlignType", file: !369, line: 36, baseType: !425)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "undercolor", scope: !690, file: !369, line: 293, baseType: !725, size: 64, offset: 3296)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !690, file: !369, line: 294, baseType: !725, size: 64, offset: 3360)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !690, file: !369, line: 297, baseType: !693, size: 64, offset: 3456)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "dash_pattern", scope: !690, file: !369, line: 300, baseType: !1013, size: 64, offset: 3520)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !690, file: !369, line: 303, baseType: !693, size: 64, offset: 3584)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !690, file: !369, line: 306, baseType: !744, size: 256, offset: 3648)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "clip_units", scope: !690, file: !369, line: 309, baseType: !1017, size: 32, offset: 3904)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClipPathUnits", file: !369, line: 44, baseType: !431)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !690, file: !369, line: 312, baseType: !729, size: 16, offset: 3936)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "render", scope: !690, file: !369, line: 315, baseType: !765, size: 32, offset: 3968)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "element_reference", scope: !690, file: !369, line: 318, baseType: !1021, size: 1344, offset: 4032)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementReference", file: !369, line: 203, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ElementReference", file: !369, line: 186, size: 1344, elements: !1023)
!1023 = !{!1024, !1025, !1027, !1028, !1029, !1031}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1022, file: !369, line: 189, baseType: !693, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1022, file: !369, line: 192, baseType: !1026, size: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReferenceType", file: !369, line: 127, baseType: !437)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !1022, file: !369, line: 195, baseType: !737, size: 1024, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1022, file: !369, line: 198, baseType: !701, size: 64, offset: 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1022, file: !369, line: 201, baseType: !1030, size: 64, offset: 1216)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1022, file: !369, line: 202, baseType: !1030, size: 64, offset: 1280)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !690, file: !369, line: 321, baseType: !765, size: 32, offset: 5376)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !690, file: !369, line: 324, baseType: !701, size: 64, offset: 5440)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !690, file: !369, line: 327, baseType: !716, size: 64, offset: 5504)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "interword_spacing", scope: !690, file: !369, line: 328, baseType: !716, size: 64, offset: 5568)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "interline_spacing", scope: !690, file: !369, line: 329, baseType: !716, size: 64, offset: 5632)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !690, file: !369, line: 332, baseType: !1038, size: 32, offset: 5696)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectionType", file: !369, line: 60, baseType: !441)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !73, line: 356, size: 134336, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1077, !1078, !1079, !1080, !1081, !1082, !1084, !1085, !1086, !1087, !1088, !1089, !1100, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1168, !1169, !1170}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1041, file: !73, line: 359, baseType: !796, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !1041, file: !73, line: 362, baseType: !799, size: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !1041, file: !73, line: 365, baseType: !765, size: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !1041, file: !73, line: 366, baseType: !765, size: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !1041, file: !73, line: 367, baseType: !765, size: 32, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !1041, file: !73, line: 368, baseType: !765, size: 32, offset: 160)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1041, file: !73, line: 371, baseType: !693, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !1041, file: !73, line: 372, baseType: !693, size: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !1041, file: !73, line: 373, baseType: !693, size: 64, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !1041, file: !73, line: 374, baseType: !693, size: 64, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1041, file: !73, line: 377, baseType: !701, size: 64, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !1041, file: !73, line: 378, baseType: !701, size: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1041, file: !73, line: 379, baseType: !701, size: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !1041, file: !73, line: 382, baseType: !847, size: 32, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !1041, file: !73, line: 385, baseType: !849, size: 32, offset: 672)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1041, file: !73, line: 388, baseType: !831, size: 32, offset: 704)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1041, file: !73, line: 391, baseType: !701, size: 64, offset: 768)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !1041, file: !73, line: 394, baseType: !693, size: 64, offset: 832)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !1041, file: !73, line: 395, baseType: !693, size: 64, offset: 896)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1041, file: !73, line: 396, baseType: !693, size: 64, offset: 960)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !1041, file: !73, line: 397, baseType: !693, size: 64, offset: 1024)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1041, file: !73, line: 398, baseType: !693, size: 64, offset: 1088)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !1041, file: !73, line: 401, baseType: !716, size: 64, offset: 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1041, file: !73, line: 402, baseType: !716, size: 64, offset: 1216)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !1041, file: !73, line: 405, baseType: !725, size: 64, offset: 1280)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1041, file: !73, line: 406, baseType: !725, size: 64, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !1041, file: !73, line: 407, baseType: !725, size: 64, offset: 1408)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1041, file: !73, line: 410, baseType: !765, size: 32, offset: 1472)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !1041, file: !73, line: 411, baseType: !765, size: 32, offset: 1504)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1041, file: !73, line: 414, baseType: !701, size: 64, offset: 1536)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1041, file: !73, line: 417, baseType: !763, size: 32, offset: 1600)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1041, file: !73, line: 420, baseType: !967, size: 32, offset: 1632)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !1041, file: !73, line: 423, baseType: !1076, size: 32, offset: 1664)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !491, line: 59, baseType: !490)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1041, file: !73, line: 426, baseType: !705, size: 64, offset: 1728)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !1041, file: !73, line: 429, baseType: !765, size: 32, offset: 1792)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !1041, file: !73, line: 430, baseType: !765, size: 32, offset: 1824)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1041, file: !73, line: 433, baseType: !693, size: 64, offset: 1856)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !1041, file: !73, line: 434, baseType: !693, size: 64, offset: 1920)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !1041, file: !73, line: 437, baseType: !1083, size: 32, offset: 1984)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !523)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1041, file: !73, line: 440, baseType: !789, size: 64, offset: 2048)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1041, file: !73, line: 443, baseType: !829, size: 64, offset: 2112)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !1041, file: !73, line: 446, baseType: !887, size: 64, offset: 2176)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1041, file: !73, line: 449, baseType: !829, size: 64, offset: 2240)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1041, file: !73, line: 450, baseType: !829, size: 64, offset: 2304)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1041, file: !73, line: 453, baseType: !1090, size: 64, offset: 2368)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1091, line: 26, baseType: !1092)
!1091 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!701, !1095, !1097, !1099}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1041, file: !73, line: 456, baseType: !1101, size: 64, offset: 2432)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1103, line: 7, baseType: !1104)
!1103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1105, line: 49, size: 1728, elements: !1106)
!1105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1122, !1124, !1125, !1126, !1128, !1129, !1131, !1135, !1138, !1140, !1143, !1146, !1147, !1148, !1149, !1150}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1104, file: !1105, line: 51, baseType: !575, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1104, file: !1105, line: 54, baseType: !693, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1104, file: !1105, line: 55, baseType: !693, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1104, file: !1105, line: 56, baseType: !693, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1104, file: !1105, line: 57, baseType: !693, size: 64, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1104, file: !1105, line: 58, baseType: !693, size: 64, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1104, file: !1105, line: 59, baseType: !693, size: 64, offset: 384)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1104, file: !1105, line: 60, baseType: !693, size: 64, offset: 448)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1104, file: !1105, line: 61, baseType: !693, size: 64, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1104, file: !1105, line: 64, baseType: !693, size: 64, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1104, file: !1105, line: 65, baseType: !693, size: 64, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1104, file: !1105, line: 66, baseType: !693, size: 64, offset: 704)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1104, file: !1105, line: 68, baseType: !1120, size: 64, offset: 768)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1105, line: 36, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1104, file: !1105, line: 70, baseType: !1123, size: 64, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1104, file: !1105, line: 72, baseType: !575, size: 32, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1104, file: !1105, line: 73, baseType: !575, size: 32, offset: 928)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1104, file: !1105, line: 74, baseType: !1127, size: 64, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !708, line: 152, baseType: !709)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1104, file: !1105, line: 77, baseType: !730, size: 16, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1104, file: !1105, line: 78, baseType: !1130, size: 8, offset: 1040)
!1130 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1104, file: !1105, line: 79, baseType: !1132, size: 8, offset: 1048)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 8, elements: !1133)
!1133 = !{!1134}
!1134 = !DISubrange(count: 1)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1104, file: !1105, line: 81, baseType: !1136, size: 64, offset: 1088)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1105, line: 43, baseType: null)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1104, file: !1105, line: 89, baseType: !1139, size: 64, offset: 1152)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !708, line: 153, baseType: !709)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1104, file: !1105, line: 91, baseType: !1141, size: 64, offset: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1105, line: 37, flags: DIFlagFwdDecl)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1104, file: !1105, line: 92, baseType: !1144, size: 64, offset: 1280)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1105, line: 38, flags: DIFlagFwdDecl)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1104, file: !1105, line: 93, baseType: !1123, size: 64, offset: 1344)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1104, file: !1105, line: 94, baseType: !829, size: 64, offset: 1408)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1104, file: !1105, line: 95, baseType: !701, size: 64, offset: 1472)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1104, file: !1105, line: 96, baseType: !575, size: 32, offset: 1536)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1104, file: !1105, line: 98, baseType: !1151, size: 160, offset: 1568)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 160, elements: !1152)
!1152 = !{!1153}
!1153 = !DISubrange(count: 20)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !1041, file: !73, line: 459, baseType: !829, size: 64, offset: 2496)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1041, file: !73, line: 462, baseType: !701, size: 64, offset: 2560)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !1041, file: !73, line: 465, baseType: !912, size: 32768, offset: 2624)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !1041, file: !73, line: 466, baseType: !912, size: 32768, offset: 35392)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !1041, file: !73, line: 467, baseType: !912, size: 32768, offset: 68160)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1041, file: !73, line: 468, baseType: !912, size: 32768, offset: 100928)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1041, file: !73, line: 471, baseType: !765, size: 32, offset: 133696)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1041, file: !73, line: 474, baseType: !693, size: 64, offset: 133760)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !1041, file: !73, line: 477, baseType: !701, size: 64, offset: 133824)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !1041, file: !73, line: 478, baseType: !701, size: 64, offset: 133888)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !1041, file: !73, line: 481, baseType: !725, size: 64, offset: 133952)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1041, file: !73, line: 484, baseType: !701, size: 64, offset: 134016)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !1041, file: !73, line: 487, baseType: !1167, size: 32, offset: 134080)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !546, line: 47, baseType: !545)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !1041, file: !73, line: 490, baseType: !725, size: 64, offset: 134112)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1041, file: !73, line: 493, baseType: !829, size: 64, offset: 134208)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !1041, file: !73, line: 496, baseType: !765, size: 32, offset: 134272)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawingWand", file: !1175, line: 28, baseType: !1176)
!1175 = !DIFile(filename: "apps/538.imagick_r/src/wand/drawing-wand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "441f6e8459fa09d8c2e29ef53b62f3d8")
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DrawingWand", file: !447, line: 90, size: 34048, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1196, !1198, !1199, !1200}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1176, file: !447, line: 93, baseType: !701, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1176, file: !447, line: 96, baseType: !912, size: 32768, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1176, file: !447, line: 100, baseType: !789, size: 64, offset: 32832)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !1176, file: !447, line: 103, baseType: !1182, size: 64, offset: 32896)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "mvg", scope: !1176, file: !447, line: 107, baseType: !693, size: 64, offset: 32960)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "mvg_alloc", scope: !1176, file: !447, line: 110, baseType: !701, size: 64, offset: 33024)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "mvg_length", scope: !1176, file: !447, line: 111, baseType: !701, size: 64, offset: 33088)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "mvg_width", scope: !1176, file: !447, line: 114, baseType: !701, size: 64, offset: 33152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_id", scope: !1176, file: !447, line: 118, baseType: !693, size: 64, offset: 33216)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_bounds", scope: !1176, file: !447, line: 121, baseType: !697, size: 256, offset: 33280)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_offset", scope: !1176, file: !447, line: 124, baseType: !701, size: 64, offset: 33536)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1176, file: !447, line: 128, baseType: !701, size: 64, offset: 33600)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "graphic_context", scope: !1176, file: !447, line: 131, baseType: !687, size: 64, offset: 33664)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "filter_off", scope: !1176, file: !447, line: 134, baseType: !765, size: 32, offset: 33728)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "indent_depth", scope: !1176, file: !447, line: 138, baseType: !701, size: 64, offset: 33792)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "path_operation", scope: !1176, file: !447, line: 142, baseType: !1195, size: 32, offset: 33856)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathOperation", file: !447, line: 81, baseType: !446)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "path_mode", scope: !1176, file: !447, line: 145, baseType: !1197, size: 32, offset: 33888)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathMode", file: !447, line: 88, baseType: !460)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1176, file: !447, line: 148, baseType: !765, size: 32, offset: 33920)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1176, file: !447, line: 149, baseType: !765, size: 32, offset: 33952)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1176, file: !447, line: 152, baseType: !701, size: 64, offset: 33984)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLTreeInfo", file: !1207, line: 29, baseType: !1208)
!1207 = !DIFile(filename: "apps/538.imagick_r/src/magick/xml-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e544995a74b1ca30ba5edadca4a5927")
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XMLTreeInfo", file: !1207, line: 28, flags: DIFlagFwdDecl)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !729)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1215 = !{i32 7, !"Dwarf Version", i32 5}
!1216 = !{i32 2, !"Debug Info Version", i32 3}
!1217 = !{i32 1, !"wchar_size", i32 4}
!1218 = !{i32 7, !"PIC Level", i32 2}
!1219 = !{i32 7, !"PIE Level", i32 2}
!1220 = !{i32 7, !"uwtable", i32 2}
!1221 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1222 = distinct !DISubprogram(name: "ClearDrawingWand", scope: !447, file: !447, line: 479, type: !1223, scopeLine: 480, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1225)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{null, !1173}
!1225 = !{!1226}
!1226 = !DILocalVariable(name: "wand", arg: 1, scope: !1222, file: !447, line: 479, type: !1173)
!1227 = !DILocation(line: 0, scope: !1222)
!1228 = !DILocation(line: 483, column: 13, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1222, file: !447, line: 483, column: 7)
!1230 = !{!1231, !1233, i64 4244}
!1231 = !{!"_DrawingWand", !1232, i64 0, !1233, i64 8, !1235, i64 4104, !1235, i64 4112, !1235, i64 4120, !1232, i64 4128, !1232, i64 4136, !1232, i64 4144, !1235, i64 4152, !1236, i64 4160, !1232, i64 4192, !1232, i64 4200, !1235, i64 4208, !1233, i64 4216, !1232, i64 4224, !1233, i64 4232, !1233, i64 4236, !1233, i64 4240, !1233, i64 4244, !1232, i64 4248}
!1232 = !{!"long", !1233, i64 0}
!1233 = !{!"omnipotent char", !1234, i64 0}
!1234 = !{!"Simple C/C++ TBAA"}
!1235 = !{!"any pointer", !1233, i64 0}
!1236 = !{!"_RectangleInfo", !1232, i64 0, !1232, i64 8, !1232, i64 16, !1232, i64 24}
!1237 = !DILocation(line: 483, column: 19, scope: !1229)
!1238 = !DILocation(line: 483, column: 7, scope: !1222)
!1239 = !DILocation(line: 484, column: 66, scope: !1229)
!1240 = !DILocation(line: 484, column: 12, scope: !1229)
!1241 = !DILocation(line: 484, column: 5, scope: !1229)
!1242 = !DILocation(line: 485, column: 17, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !447, line: 485, column: 3)
!1244 = distinct !DILexicalBlock(scope: !1222, file: !447, line: 485, column: 3)
!1245 = !{!1231, !1232, i64 4200}
!1246 = !DILocation(line: 485, column: 23, scope: !1243)
!1247 = !DILocation(line: 485, column: 3, scope: !1244)
!1248 = !DILocation(line: 486, column: 36, scope: !1243)
!1249 = !{!1231, !1235, i64 4208}
!1250 = !{!1235, !1235, i64 0}
!1251 = !DILocation(line: 486, column: 20, scope: !1243)
!1252 = !DILocation(line: 486, column: 5, scope: !1243)
!1253 = !DILocation(line: 486, column: 19, scope: !1243)
!1254 = !DILocation(line: 485, column: 39, scope: !1243)
!1255 = distinct !{!1255, !1247, !1256, !1257, !1258}
!1256 = !DILocation(line: 486, column: 50, scope: !1244)
!1257 = !{!"llvm.loop.mustprogress"}
!1258 = !{!"llvm.loop.unroll.disable"}
!1259 = !DILocation(line: 487, column: 34, scope: !1222)
!1260 = !DILocation(line: 487, column: 18, scope: !1222)
!1261 = !DILocation(line: 487, column: 3, scope: !1222)
!1262 = !DILocation(line: 487, column: 17, scope: !1222)
!1263 = !DILocation(line: 489, column: 11, scope: !1222)
!1264 = !DILocation(line: 488, column: 39, scope: !1222)
!1265 = !DILocation(line: 488, column: 24, scope: !1222)
!1266 = !DILocation(line: 490, column: 13, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1222, file: !447, line: 490, column: 7)
!1268 = !{!1231, !1235, i64 4152}
!1269 = !DILocation(line: 490, column: 24, scope: !1267)
!1270 = !DILocation(line: 490, column: 7, scope: !1222)
!1271 = !DILocation(line: 491, column: 22, scope: !1267)
!1272 = !DILocation(line: 491, column: 21, scope: !1267)
!1273 = !DILocation(line: 491, column: 5, scope: !1267)
!1274 = !DILocation(line: 492, column: 33, scope: !1222)
!1275 = !{!1231, !1235, i64 4120}
!1276 = !DILocation(line: 492, column: 13, scope: !1222)
!1277 = !DILocation(line: 492, column: 12, scope: !1222)
!1278 = !DILocation(line: 493, column: 14, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1222, file: !447, line: 493, column: 7)
!1280 = !{!1231, !1233, i64 4240}
!1281 = !DILocation(line: 493, column: 22, scope: !1279)
!1282 = !DILocation(line: 493, column: 38, scope: !1279)
!1283 = !DILocation(line: 493, column: 48, scope: !1279)
!1284 = !{!1231, !1235, i64 4104}
!1285 = !DILocation(line: 493, column: 54, scope: !1279)
!1286 = !DILocation(line: 493, column: 7, scope: !1222)
!1287 = !DILocation(line: 494, column: 17, scope: !1279)
!1288 = !DILocation(line: 494, column: 16, scope: !1279)
!1289 = !DILocation(line: 494, column: 5, scope: !1279)
!1290 = !DILocation(line: 496, column: 11, scope: !1279)
!1291 = !DILocation(line: 496, column: 16, scope: !1279)
!1292 = !DILocation(line: 498, column: 18, scope: !1222)
!1293 = !DILocation(line: 508, column: 39, scope: !1222)
!1294 = !DILocation(line: 508, column: 24, scope: !1222)
!1295 = !DILocation(line: 510, column: 29, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1222, file: !447, line: 510, column: 7)
!1297 = !DILocation(line: 510, column: 7, scope: !1222)
!1298 = !DILocation(line: 512, column: 7, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1296, file: !447, line: 511, column: 5)
!1300 = !{!1231, !1235, i64 4112}
!1301 = !DILocation(line: 514, column: 7, scope: !1299)
!1302 = !DILocation(line: 516, column: 18, scope: !1222)
!1303 = !DILocation(line: 516, column: 3, scope: !1222)
!1304 = !DILocation(line: 516, column: 17, scope: !1222)
!1305 = !DILocation(line: 517, column: 9, scope: !1222)
!1306 = !DILocation(line: 517, column: 19, scope: !1222)
!1307 = !{!1231, !1233, i64 4216}
!1308 = !DILocation(line: 518, column: 9, scope: !1222)
!1309 = !DILocation(line: 519, column: 23, scope: !1222)
!1310 = !DILocation(line: 521, column: 15, scope: !1222)
!1311 = !DILocation(line: 521, column: 9, scope: !1222)
!1312 = !DILocation(line: 521, column: 14, scope: !1222)
!1313 = !DILocation(line: 522, column: 30, scope: !1222)
!1314 = !DILocation(line: 522, column: 3, scope: !1222)
!1315 = !DILocation(line: 523, column: 16, scope: !1222)
!1316 = !DILocation(line: 524, column: 15, scope: !1222)
!1317 = !DILocation(line: 524, column: 14, scope: !1222)
!1318 = !DILocation(line: 525, column: 1, scope: !1222)
!1319 = !DISubprogram(name: "LogMagickEvent", scope: !466, file: !466, line: 83, type: !1320, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!765, !1322, !892, !892, !1099, !892, null}
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1323)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !466, line: 58, baseType: !465)
!1324 = !{}
!1325 = !DISubprogram(name: "DestroyDrawInfo", scope: !369, file: !369, line: 377, type: !1326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!688, !688}
!1328 = !DISubprogram(name: "RelinquishMagickMemory", scope: !1329, file: !1329, line: 51, type: !1330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1329 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!829, !829}
!1332 = !DISubprogram(name: "DestroyString", scope: !1333, file: !1333, line: 46, type: !1334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1333 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!693, !693}
!1336 = !DISubprogram(name: "DestroyImage", scope: !73, file: !73, line: 510, type: !1337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!789, !789}
!1339 = !DISubprogram(name: "AcquireMagickMemory", scope: !1329, file: !1329, line: 40, type: !1340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{!829, !1099}
!1342 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1343, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!765, !1182, !892, !892, !1099, !1345, !892, !892, null}
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!1346 = !DISubprogram(name: "CloneDrawInfo", scope: !369, file: !369, line: 376, type: !1347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!688, !1171, !1201}
!1349 = !DISubprogram(name: "AcquireImage", scope: !73, file: !73, line: 506, type: !1350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!789, !1171}
!1352 = !DISubprogram(name: "ClearMagickException", scope: !253, file: !253, line: 165, type: !1353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{null, !1182}
!1355 = !DISubprogram(name: "IsEventLogging", scope: !466, file: !466, line: 80, type: !1356, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!765}
!1358 = distinct !DISubprogram(name: "CloneDrawingWand", scope: !447, file: !447, line: 549, type: !1359, scopeLine: 550, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1361)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!1173, !1213}
!1361 = !{!1362, !1363, !1364, !1365, !1368}
!1362 = !DILocalVariable(name: "wand", arg: 1, scope: !1358, file: !447, line: 549, type: !1213)
!1363 = !DILocalVariable(name: "clone_wand", scope: !1358, file: !447, line: 552, type: !1173)
!1364 = !DILocalVariable(name: "i", scope: !1358, file: !447, line: 555, type: !705)
!1365 = !DILocalVariable(name: "exception", scope: !1366, file: !447, line: 563, type: !920)
!1366 = distinct !DILexicalBlock(scope: !1367, file: !447, line: 563, column: 5)
!1367 = distinct !DILexicalBlock(scope: !1358, file: !447, line: 562, column: 7)
!1368 = !DILocalVariable(name: "exception", scope: !1369, file: !447, line: 582, type: !920)
!1369 = distinct !DILexicalBlock(scope: !1370, file: !447, line: 582, column: 5)
!1370 = distinct !DILexicalBlock(scope: !1358, file: !447, line: 581, column: 7)
!1371 = !DILocation(line: 0, scope: !1358)
!1372 = !DILocation(line: 559, column: 13, scope: !1373)
!1373 = distinct !DILexicalBlock(scope: !1358, file: !447, line: 559, column: 7)
!1374 = !DILocation(line: 559, column: 19, scope: !1373)
!1375 = !DILocation(line: 559, column: 7, scope: !1358)
!1376 = !DILocation(line: 560, column: 66, scope: !1373)
!1377 = !DILocation(line: 560, column: 12, scope: !1373)
!1378 = !DILocation(line: 560, column: 5, scope: !1373)
!1379 = !DILocation(line: 561, column: 30, scope: !1358)
!1380 = !DILocation(line: 562, column: 18, scope: !1367)
!1381 = !DILocation(line: 562, column: 7, scope: !1358)
!1382 = !DILocation(line: 563, column: 5, scope: !1366)
!1383 = !{!1384, !1384, i64 0}
!1384 = !{!"int", !1233, i64 0}
!1385 = !DILocation(line: 565, column: 10, scope: !1358)
!1386 = !DILocation(line: 566, column: 18, scope: !1358)
!1387 = !DILocation(line: 566, column: 17, scope: !1358)
!1388 = !{!1231, !1232, i64 0}
!1389 = !DILocation(line: 567, column: 41, scope: !1358)
!1390 = !DILocation(line: 568, column: 5, scope: !1358)
!1391 = !DILocation(line: 567, column: 10, scope: !1358)
!1392 = !DILocation(line: 569, column: 25, scope: !1358)
!1393 = !DILocation(line: 569, column: 15, scope: !1358)
!1394 = !DILocation(line: 569, column: 24, scope: !1358)
!1395 = !DILocation(line: 570, column: 48, scope: !1358)
!1396 = !DILocation(line: 570, column: 3, scope: !1358)
!1397 = !DILocation(line: 571, column: 39, scope: !1358)
!1398 = !DILocation(line: 571, column: 19, scope: !1358)
!1399 = !DILocation(line: 571, column: 15, scope: !1358)
!1400 = !DILocation(line: 571, column: 18, scope: !1358)
!1401 = !DILocation(line: 572, column: 26, scope: !1358)
!1402 = !DILocation(line: 572, column: 15, scope: !1358)
!1403 = !DILocation(line: 572, column: 25, scope: !1358)
!1404 = !{!1231, !1232, i64 4136}
!1405 = !DILocation(line: 573, column: 31, scope: !1358)
!1406 = !DILocation(line: 573, column: 41, scope: !1358)
!1407 = !DILocation(line: 573, column: 15, scope: !1358)
!1408 = !DILocation(line: 573, column: 24, scope: !1358)
!1409 = !{!1231, !1232, i64 4128}
!1410 = !DILocation(line: 574, column: 31, scope: !1358)
!1411 = !{!1231, !1232, i64 4144}
!1412 = !DILocation(line: 574, column: 15, scope: !1358)
!1413 = !DILocation(line: 574, column: 24, scope: !1358)
!1414 = !DILocation(line: 575, column: 46, scope: !1358)
!1415 = !DILocation(line: 575, column: 26, scope: !1358)
!1416 = !DILocation(line: 575, column: 15, scope: !1358)
!1417 = !DILocation(line: 575, column: 25, scope: !1358)
!1418 = !DILocation(line: 576, column: 36, scope: !1358)
!1419 = !{!1231, !1232, i64 4192}
!1420 = !DILocation(line: 576, column: 15, scope: !1358)
!1421 = !DILocation(line: 576, column: 29, scope: !1358)
!1422 = !DILocation(line: 577, column: 15, scope: !1358)
!1423 = !DILocation(line: 577, column: 36, scope: !1358)
!1424 = !{i64 0, i64 8, !1425, i64 8, i64 8, !1425, i64 16, i64 8, !1425, i64 24, i64 8, !1425}
!1425 = !{!1232, !1232, i64 0}
!1426 = !DILocation(line: 578, column: 27, scope: !1358)
!1427 = !DILocation(line: 578, column: 15, scope: !1358)
!1428 = !DILocation(line: 578, column: 20, scope: !1358)
!1429 = !DILocation(line: 580, column: 11, scope: !1358)
!1430 = !DILocation(line: 580, column: 16, scope: !1358)
!1431 = !DILocation(line: 579, column: 45, scope: !1358)
!1432 = !DILocation(line: 579, column: 15, scope: !1358)
!1433 = !DILocation(line: 579, column: 30, scope: !1358)
!1434 = !DILocation(line: 581, column: 35, scope: !1370)
!1435 = !DILocation(line: 581, column: 7, scope: !1358)
!1436 = !DILocation(line: 584, column: 34, scope: !1437)
!1437 = distinct !DILexicalBlock(scope: !1438, file: !447, line: 584, column: 3)
!1438 = distinct !DILexicalBlock(scope: !1358, file: !447, line: 584, column: 3)
!1439 = !DILocation(line: 584, column: 15, scope: !1437)
!1440 = !DILocation(line: 584, column: 3, scope: !1438)
!1441 = !DILocation(line: 582, column: 5, scope: !1369)
!1442 = !DILocation(line: 586, column: 46, scope: !1437)
!1443 = !DILocation(line: 586, column: 40, scope: !1437)
!1444 = !DILocation(line: 586, column: 7, scope: !1437)
!1445 = !DILocation(line: 585, column: 17, scope: !1437)
!1446 = !DILocation(line: 585, column: 5, scope: !1437)
!1447 = !DILocation(line: 585, column: 35, scope: !1437)
!1448 = !DILocation(line: 584, column: 42, scope: !1437)
!1449 = distinct !{!1449, !1440, !1450, !1257, !1258}
!1450 = !DILocation(line: 586, column: 64, scope: !1438)
!1451 = !DILocation(line: 587, column: 32, scope: !1358)
!1452 = !DILocation(line: 587, column: 15, scope: !1358)
!1453 = !DILocation(line: 587, column: 25, scope: !1358)
!1454 = !DILocation(line: 588, column: 34, scope: !1358)
!1455 = !{!1231, !1232, i64 4224}
!1456 = !DILocation(line: 588, column: 15, scope: !1358)
!1457 = !DILocation(line: 588, column: 27, scope: !1358)
!1458 = !DILocation(line: 589, column: 36, scope: !1358)
!1459 = !{!1231, !1233, i64 4232}
!1460 = !DILocation(line: 589, column: 15, scope: !1358)
!1461 = !DILocation(line: 589, column: 29, scope: !1358)
!1462 = !DILocation(line: 590, column: 31, scope: !1358)
!1463 = !{!1231, !1233, i64 4236}
!1464 = !DILocation(line: 590, column: 15, scope: !1358)
!1465 = !DILocation(line: 590, column: 24, scope: !1358)
!1466 = !DILocation(line: 591, column: 27, scope: !1358)
!1467 = !DILocation(line: 591, column: 15, scope: !1358)
!1468 = !DILocation(line: 591, column: 20, scope: !1358)
!1469 = !DILocation(line: 592, column: 13, scope: !1470)
!1470 = distinct !DILexicalBlock(scope: !1358, file: !447, line: 592, column: 7)
!1471 = !DILocation(line: 592, column: 19, scope: !1470)
!1472 = !DILocation(line: 592, column: 7, scope: !1358)
!1473 = !DILocation(line: 594, column: 19, scope: !1470)
!1474 = !DILocation(line: 593, column: 23, scope: !1470)
!1475 = !DILocation(line: 593, column: 22, scope: !1470)
!1476 = !DILocation(line: 593, column: 5, scope: !1470)
!1477 = !DILocation(line: 595, column: 15, scope: !1358)
!1478 = !DILocation(line: 595, column: 22, scope: !1358)
!1479 = !DILocation(line: 596, column: 21, scope: !1358)
!1480 = !DILocation(line: 596, column: 15, scope: !1358)
!1481 = !DILocation(line: 596, column: 20, scope: !1358)
!1482 = !DILocation(line: 597, column: 25, scope: !1483)
!1483 = distinct !DILexicalBlock(scope: !1358, file: !447, line: 597, column: 7)
!1484 = !DILocation(line: 597, column: 7, scope: !1358)
!1485 = !DILocation(line: 598, column: 12, scope: !1483)
!1486 = !DILocation(line: 598, column: 5, scope: !1483)
!1487 = !DILocation(line: 599, column: 15, scope: !1358)
!1488 = !DILocation(line: 599, column: 24, scope: !1358)
!1489 = !{!1231, !1232, i64 4248}
!1490 = !DILocation(line: 600, column: 3, scope: !1358)
!1491 = !DISubprogram(name: "GetExceptionInfo", scope: !253, file: !253, line: 166, type: !1353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1492 = !DISubprogram(name: "GetExceptionMessage", scope: !253, file: !253, line: 137, type: !1493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!693, !1495}
!1495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!1496 = !DISubprogram(name: "CatchException", scope: !253, file: !253, line: 164, type: !1353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1497 = !DISubprogram(name: "DestroyExceptionInfo", scope: !253, file: !253, line: 148, type: !1498, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!1182, !1182}
!1500 = !DISubprogram(name: "MagickWandTerminus", scope: !1501, file: !1501, line: 116, type: !1502, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1501 = !DIFile(filename: "apps/538.imagick_r/src/wand/MagickWand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ffc9981fe595b674b5932183b4455d96")
!1502 = !DISubroutineType(types: !1503)
!1503 = !{null}
!1504 = !DISubprogram(name: "ResetMagickMemory", scope: !1329, file: !1329, line: 52, type: !1505, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!829, !829, !575, !1099}
!1507 = !DISubprogram(name: "AcquireWandId", scope: !1508, file: !1508, line: 26, type: !1509, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1508 = !DIFile(filename: "apps/538.imagick_r/src/wand/wand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04fee0d7de953bb2b067eac76943bcb6")
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!701}
!1511 = !DISubprogram(name: "FormatLocaleString", scope: !1512, file: !1512, line: 71, type: !1513, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1512 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "156c27c5fb4b55284e5f6c924766571a")
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!705, !1515, !1099, !1516, null}
!1515 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !693)
!1516 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !892)
!1517 = !DISubprogram(name: "AcquireExceptionInfo", scope: !253, file: !253, line: 146, type: !1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!1182}
!1520 = !DISubprogram(name: "InheritException", scope: !253, file: !253, line: 167, type: !1521, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{null, !1182, !1523}
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64)
!1524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!1525 = !DISubprogram(name: "AcquireString", scope: !1333, file: !1333, line: 43, type: !1526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!693, !892}
!1528 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1329, file: !1329, line: 42, type: !1529, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!829, !1099, !1099}
!1531 = !DISubprogram(name: "CloneImage", scope: !73, file: !73, line: 508, type: !1532, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{!789, !1095, !1099, !1099, !1534, !1182}
!1534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !765)
!1535 = distinct !DISubprogram(name: "DestroyDrawingWand", scope: !447, file: !447, line: 627, type: !1536, scopeLine: 628, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1538)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!1173, !1173}
!1538 = !{!1539}
!1539 = !DILocalVariable(name: "wand", arg: 1, scope: !1535, file: !447, line: 627, type: !1173)
!1540 = !DILocation(line: 0, scope: !1535)
!1541 = !DILocation(line: 631, column: 13, scope: !1542)
!1542 = distinct !DILexicalBlock(scope: !1535, file: !447, line: 631, column: 7)
!1543 = !DILocation(line: 631, column: 19, scope: !1542)
!1544 = !DILocation(line: 631, column: 7, scope: !1535)
!1545 = !DILocation(line: 632, column: 66, scope: !1542)
!1546 = !DILocation(line: 632, column: 12, scope: !1542)
!1547 = !DILocation(line: 632, column: 5, scope: !1542)
!1548 = !DILocation(line: 633, column: 17, scope: !1549)
!1549 = distinct !DILexicalBlock(scope: !1550, file: !447, line: 633, column: 3)
!1550 = distinct !DILexicalBlock(scope: !1535, file: !447, line: 633, column: 3)
!1551 = !DILocation(line: 633, column: 23, scope: !1549)
!1552 = !DILocation(line: 633, column: 3, scope: !1550)
!1553 = !DILocation(line: 634, column: 36, scope: !1549)
!1554 = !DILocation(line: 634, column: 20, scope: !1549)
!1555 = !DILocation(line: 634, column: 5, scope: !1549)
!1556 = !DILocation(line: 634, column: 19, scope: !1549)
!1557 = !DILocation(line: 633, column: 39, scope: !1549)
!1558 = distinct !{!1558, !1552, !1559, !1257, !1258}
!1559 = !DILocation(line: 634, column: 50, scope: !1550)
!1560 = !DILocation(line: 635, column: 34, scope: !1535)
!1561 = !DILocation(line: 635, column: 18, scope: !1535)
!1562 = !DILocation(line: 635, column: 3, scope: !1535)
!1563 = !DILocation(line: 635, column: 17, scope: !1535)
!1564 = !DILocation(line: 637, column: 11, scope: !1535)
!1565 = !DILocation(line: 636, column: 39, scope: !1535)
!1566 = !DILocation(line: 636, column: 24, scope: !1535)
!1567 = !DILocation(line: 638, column: 13, scope: !1568)
!1568 = distinct !DILexicalBlock(scope: !1535, file: !447, line: 638, column: 7)
!1569 = !DILocation(line: 638, column: 24, scope: !1568)
!1570 = !DILocation(line: 638, column: 7, scope: !1535)
!1571 = !DILocation(line: 639, column: 22, scope: !1568)
!1572 = !DILocation(line: 639, column: 21, scope: !1568)
!1573 = !DILocation(line: 639, column: 5, scope: !1568)
!1574 = !DILocation(line: 640, column: 33, scope: !1535)
!1575 = !DILocation(line: 640, column: 13, scope: !1535)
!1576 = !DILocation(line: 640, column: 12, scope: !1535)
!1577 = !DILocation(line: 641, column: 14, scope: !1578)
!1578 = distinct !DILexicalBlock(scope: !1535, file: !447, line: 641, column: 7)
!1579 = !DILocation(line: 641, column: 22, scope: !1578)
!1580 = !DILocation(line: 641, column: 38, scope: !1578)
!1581 = !DILocation(line: 641, column: 48, scope: !1578)
!1582 = !DILocation(line: 641, column: 54, scope: !1578)
!1583 = !DILocation(line: 641, column: 7, scope: !1535)
!1584 = !DILocation(line: 642, column: 17, scope: !1578)
!1585 = !DILocation(line: 642, column: 5, scope: !1578)
!1586 = !DILocation(line: 643, column: 9, scope: !1535)
!1587 = !DILocation(line: 643, column: 14, scope: !1535)
!1588 = !DILocation(line: 644, column: 46, scope: !1535)
!1589 = !DILocation(line: 644, column: 19, scope: !1535)
!1590 = !DILocation(line: 644, column: 18, scope: !1535)
!1591 = !DILocation(line: 645, column: 9, scope: !1535)
!1592 = !DILocation(line: 645, column: 18, scope: !1535)
!1593 = !DILocation(line: 646, column: 26, scope: !1535)
!1594 = !DILocation(line: 646, column: 3, scope: !1535)
!1595 = !DILocation(line: 647, column: 24, scope: !1535)
!1596 = !DILocation(line: 648, column: 3, scope: !1535)
!1597 = !DISubprogram(name: "RelinquishWandId", scope: !1508, file: !1508, line: 30, type: !1598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1324)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{null, !1099}
!1600 = distinct !DISubprogram(name: "DrawAffine", scope: !447, file: !447, line: 677, type: !1601, scopeLine: 678, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1605)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1173, !1603}
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64)
!1604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!1605 = !{!1606, !1607}
!1606 = !DILocalVariable(name: "wand", arg: 1, scope: !1600, file: !447, line: 677, type: !1173)
!1607 = !DILocalVariable(name: "affine", arg: 2, scope: !1600, file: !447, line: 677, type: !1603)
!1608 = !DILocation(line: 0, scope: !1600)
!1609 = !DILocation(line: 681, column: 13, scope: !1610)
!1610 = distinct !DILexicalBlock(scope: !1600, file: !447, line: 681, column: 7)
!1611 = !DILocation(line: 681, column: 19, scope: !1610)
!1612 = !DILocation(line: 681, column: 7, scope: !1600)
!1613 = !DILocation(line: 682, column: 66, scope: !1610)
!1614 = !DILocation(line: 682, column: 12, scope: !1610)
!1615 = !DILocation(line: 682, column: 5, scope: !1610)
!1616 = !DILocation(line: 684, column: 3, scope: !1600)
!1617 = !DILocation(line: 686, column: 13, scope: !1600)
!1618 = !{!1619, !1620, i64 0}
!1619 = !{!"_AffineMatrix", !1620, i64 0, !1620, i64 8, !1620, i64 16, !1620, i64 24, !1620, i64 32, !1620, i64 40}
!1620 = !{!"double", !1233, i64 0}
!1621 = !DILocation(line: 686, column: 24, scope: !1600)
!1622 = !{!1619, !1620, i64 8}
!1623 = !DILocation(line: 686, column: 35, scope: !1600)
!1624 = !{!1619, !1620, i64 16}
!1625 = !DILocation(line: 686, column: 46, scope: !1600)
!1626 = !{!1619, !1620, i64 24}
!1627 = !DILocation(line: 686, column: 57, scope: !1600)
!1628 = !{!1619, !1620, i64 32}
!1629 = !DILocation(line: 686, column: 68, scope: !1600)
!1630 = !{!1619, !1620, i64 40}
!1631 = !DILocation(line: 685, column: 10, scope: !1600)
!1632 = !DILocation(line: 687, column: 1, scope: !1600)
!1633 = distinct !DISubprogram(name: "AdjustAffine", scope: !447, file: !447, line: 433, type: !1601, scopeLine: 434, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1634)
!1634 = !{!1635, !1636, !1637}
!1635 = !DILocalVariable(name: "wand", arg: 1, scope: !1633, file: !447, line: 433, type: !1173)
!1636 = !DILocalVariable(name: "affine", arg: 2, scope: !1633, file: !447, line: 433, type: !1603)
!1637 = !DILocalVariable(name: "current", scope: !1638, file: !447, line: 443, type: !712)
!1638 = distinct !DILexicalBlock(scope: !1639, file: !447, line: 441, column: 5)
!1639 = distinct !DILexicalBlock(scope: !1633, file: !447, line: 439, column: 7)
!1640 = !DILocation(line: 0, scope: !1633)
!1641 = !DILocation(line: 437, column: 13, scope: !1642)
!1642 = distinct !DILexicalBlock(scope: !1633, file: !447, line: 437, column: 7)
!1643 = !DILocation(line: 437, column: 19, scope: !1642)
!1644 = !DILocation(line: 437, column: 7, scope: !1633)
!1645 = !DILocation(line: 438, column: 66, scope: !1642)
!1646 = !DILocation(line: 438, column: 12, scope: !1642)
!1647 = !DILocation(line: 438, column: 5, scope: !1642)
!1648 = !DILocation(line: 439, column: 16, scope: !1639)
!1649 = !DILocation(line: 439, column: 19, scope: !1639)
!1650 = !DILocation(line: 0, scope: !1639)
!1651 = !DILocation(line: 439, column: 27, scope: !1639)
!1652 = !DILocation(line: 439, column: 62, scope: !1639)
!1653 = !DILocation(line: 439, column: 65, scope: !1639)
!1654 = !DILocation(line: 439, column: 73, scope: !1639)
!1655 = !DILocation(line: 440, column: 16, scope: !1639)
!1656 = !DILocation(line: 440, column: 19, scope: !1639)
!1657 = !DILocation(line: 440, column: 27, scope: !1639)
!1658 = !DILocation(line: 440, column: 39, scope: !1639)
!1659 = !DILocation(line: 440, column: 42, scope: !1639)
!1660 = !DILocation(line: 440, column: 50, scope: !1639)
!1661 = !DILocation(line: 440, column: 62, scope: !1639)
!1662 = !DILocation(line: 440, column: 65, scope: !1639)
