; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/effect.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/effect.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "X", scope: !2, file: !3, line: 1074, type: !872, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "DespeckleImage", scope: !3, file: !3, line: 1044, type: !4, scopeLine: 1045, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !596, retainedNodes: !876)
!3 = !DIFile(filename: "apps/538.imagick_r/src/magick/effect.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1cfdd71c77c116a91fdc4437858ec754")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !593, !595}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !8, line: 221, baseType: !9)
!8 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !10, line: 150, size: 105920, elements: !11)
!10 = !DIFile(filename: "apps/538.imagick_r/src/magick/image.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9408eec9abffe54016aa20ae735786b")
!11 = !{!12, !20, !59, !86, !90, !103, !109, !110, !111, !112, !113, !114, !126, !127, !128, !129, !131, !145, !155, !157, !164, !167, !168, !169, !175, !176, !177, !186, !187, !188, !189, !190, !191, !228, !240, !248, !264, !337, !347, !349, !350, !351, !352, !353, !354, !355, !363, !384, !398, !399, !400, !401, !405, !409, !413, !414, !415, !416, !417, !508, !509, !511, !512, !522, !523, !525, !526, !527, !528, !529, !530, !548, !549, !550, !551, !552, !553, !554, !570, !571, !572, !573, !574, !578, !592}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !9, file: !10, line: 153, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !8, line: 209, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 204, baseType: !15, size: 32, elements: !16)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "UndefinedClass", value: 0)
!18 = !DIEnumerator(name: "DirectClass", value: 1)
!19 = !DIEnumerator(name: "PseudoClass", value: 2)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !9, file: !10, line: 156, baseType: !21, size: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !22, line: 61, baseType: !23)
!22 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4f032944b177fc61244445fe3a234334")
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 25, baseType: !15, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!25 = !DIEnumerator(name: "UndefinedColorspace", value: 0)
!26 = !DIEnumerator(name: "RGBColorspace", value: 1)
!27 = !DIEnumerator(name: "GRAYColorspace", value: 2)
!28 = !DIEnumerator(name: "TransparentColorspace", value: 3)
!29 = !DIEnumerator(name: "OHTAColorspace", value: 4)
!30 = !DIEnumerator(name: "LabColorspace", value: 5)
!31 = !DIEnumerator(name: "XYZColorspace", value: 6)
!32 = !DIEnumerator(name: "YCbCrColorspace", value: 7)
!33 = !DIEnumerator(name: "YCCColorspace", value: 8)
!34 = !DIEnumerator(name: "YIQColorspace", value: 9)
!35 = !DIEnumerator(name: "YPbPrColorspace", value: 10)
!36 = !DIEnumerator(name: "YUVColorspace", value: 11)
!37 = !DIEnumerator(name: "CMYKColorspace", value: 12)
!38 = !DIEnumerator(name: "sRGBColorspace", value: 13)
!39 = !DIEnumerator(name: "HSBColorspace", value: 14)
!40 = !DIEnumerator(name: "HSLColorspace", value: 15)
!41 = !DIEnumerator(name: "HWBColorspace", value: 16)
!42 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17)
!43 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18)
!44 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19)
!45 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20)
!46 = !DIEnumerator(name: "LogColorspace", value: 21)
!47 = !DIEnumerator(name: "CMYColorspace", value: 22)
!48 = !DIEnumerator(name: "LuvColorspace", value: 23)
!49 = !DIEnumerator(name: "HCLColorspace", value: 24)
!50 = !DIEnumerator(name: "LCHColorspace", value: 25)
!51 = !DIEnumerator(name: "LMSColorspace", value: 26)
!52 = !DIEnumerator(name: "LCHabColorspace", value: 27)
!53 = !DIEnumerator(name: "LCHuvColorspace", value: 28)
!54 = !DIEnumerator(name: "scRGBColorspace", value: 29)
!55 = !DIEnumerator(name: "HSIColorspace", value: 30)
!56 = !DIEnumerator(name: "HSVColorspace", value: 31)
!57 = !DIEnumerator(name: "HCLpColorspace", value: 32)
!58 = !DIEnumerator(name: "YDbDrColorspace", value: 33)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !9, file: !10, line: 159, baseType: !60, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !61, line: 49, baseType: !62)
!61 = !DIFile(filename: "apps/538.imagick_r/src/magick/compress.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "359677d10ff2e6d05d86b0a6c5af7465")
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 25, baseType: !15, size: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85}
!64 = !DIEnumerator(name: "UndefinedCompression", value: 0)
!65 = !DIEnumerator(name: "NoCompression", value: 1)
!66 = !DIEnumerator(name: "BZipCompression", value: 2)
!67 = !DIEnumerator(name: "DXT1Compression", value: 3)
!68 = !DIEnumerator(name: "DXT3Compression", value: 4)
!69 = !DIEnumerator(name: "DXT5Compression", value: 5)
!70 = !DIEnumerator(name: "FaxCompression", value: 6)
!71 = !DIEnumerator(name: "Group4Compression", value: 7)
!72 = !DIEnumerator(name: "JPEGCompression", value: 8)
!73 = !DIEnumerator(name: "JPEG2000Compression", value: 9)
!74 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10)
!75 = !DIEnumerator(name: "LZWCompression", value: 11)
!76 = !DIEnumerator(name: "RLECompression", value: 12)
!77 = !DIEnumerator(name: "ZipCompression", value: 13)
!78 = !DIEnumerator(name: "ZipSCompression", value: 14)
!79 = !DIEnumerator(name: "PizCompression", value: 15)
!80 = !DIEnumerator(name: "Pxr24Compression", value: 16)
!81 = !DIEnumerator(name: "B44Compression", value: 17)
!82 = !DIEnumerator(name: "B44ACompression", value: 18)
!83 = !DIEnumerator(name: "LZMACompression", value: 19)
!84 = !DIEnumerator(name: "JBIG1Compression", value: 20)
!85 = !DIEnumerator(name: "JBIG2Compression", value: 21)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !9, file: !10, line: 162, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 46, baseType: !89)
!88 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!89 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !9, file: !10, line: 165, baseType: !91, size: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !10, line: 86, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 75, baseType: !15, size: 32, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102}
!94 = !DIEnumerator(name: "UndefinedOrientation", value: 0)
!95 = !DIEnumerator(name: "TopLeftOrientation", value: 1)
!96 = !DIEnumerator(name: "TopRightOrientation", value: 2)
!97 = !DIEnumerator(name: "BottomRightOrientation", value: 3)
!98 = !DIEnumerator(name: "BottomLeftOrientation", value: 4)
!99 = !DIEnumerator(name: "LeftTopOrientation", value: 5)
!100 = !DIEnumerator(name: "RightTopOrientation", value: 6)
!101 = !DIEnumerator(name: "RightBottomOrientation", value: 7)
!102 = !DIEnumerator(name: "LeftBottomOrientation", value: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !9, file: !10, line: 168, baseType: !104, size: 32, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !8, line: 215, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 211, baseType: !15, size: 32, elements: !106)
!106 = !{!107, !108}
!107 = !DIEnumerator(name: "MagickFalse", value: 0)
!108 = !DIEnumerator(name: "MagickTrue", value: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !9, file: !10, line: 169, baseType: !104, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !9, file: !10, line: 172, baseType: !87, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !9, file: !10, line: 173, baseType: !87, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !9, file: !10, line: 174, baseType: !87, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !9, file: !10, line: 175, baseType: !87, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !9, file: !10, line: 178, baseType: !115, size: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !117, line: 148, baseType: !118)
!117 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !117, line: 131, size: 64, elements: !119)
!119 = !{!120, !123, !124, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !118, file: !117, line: 143, baseType: !121, size: 16)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !8, line: 93, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !118, file: !117, line: 144, baseType: !121, size: 16, offset: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !118, file: !117, line: 145, baseType: !121, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !118, file: !117, line: 146, baseType: !121, size: 16, offset: 48)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !9, file: !10, line: 179, baseType: !116, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !9, file: !10, line: 180, baseType: !116, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !9, file: !10, line: 181, baseType: !116, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !9, file: !10, line: 184, baseType: !130, size: 64, offset: 832)
!130 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !9, file: !10, line: 187, baseType: !132, size: 768, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !10, line: 128, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !10, line: 121, size: 768, elements: !134)
!134 = !{!135, !142, !143, !144}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !133, file: !10, line: 124, baseType: !136, size: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !10, line: 101, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !10, line: 95, size: 192, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !137, file: !10, line: 98, baseType: !130, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !137, file: !10, line: 99, baseType: !130, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !137, file: !10, line: 100, baseType: !130, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !133, file: !10, line: 125, baseType: !136, size: 192, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !133, file: !10, line: 126, baseType: !136, size: 192, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !133, file: !10, line: 127, baseType: !136, size: 192, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !9, file: !10, line: 190, baseType: !146, size: 32, offset: 1664)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !147, line: 49, baseType: !148)
!147 = !DIFile(filename: "apps/538.imagick_r/src/magick/profile.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fb61c1ae348c42a2b68ac081d4b39ee3")
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 42, baseType: !15, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153, !154}
!150 = !DIEnumerator(name: "UndefinedIntent", value: 0)
!151 = !DIEnumerator(name: "SaturationIntent", value: 1)
!152 = !DIEnumerator(name: "PerceptualIntent", value: 2)
!153 = !DIEnumerator(name: "AbsoluteIntent", value: 3)
!154 = !DIEnumerator(name: "RelativeIntent", value: 4)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !9, file: !10, line: 193, baseType: !156, size: 64, offset: 1728)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !9, file: !10, line: 196, baseType: !158, size: 32, offset: 1792)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !10, line: 93, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 88, baseType: !15, size: 32, elements: !160)
!160 = !{!161, !162, !163}
!161 = !DIEnumerator(name: "UndefinedResolution", value: 0)
!162 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1)
!163 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !9, file: !10, line: 199, baseType: !165, size: 64, offset: 1856)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !9, file: !10, line: 200, baseType: !165, size: 64, offset: 1920)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !9, file: !10, line: 201, baseType: !165, size: 64, offset: 1984)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !9, file: !10, line: 204, baseType: !170, size: 64, offset: 2048)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !171, line: 77, baseType: !172)
!171 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !173, line: 193, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!174 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !9, file: !10, line: 207, baseType: !130, size: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !9, file: !10, line: 208, baseType: !130, size: 64, offset: 2176)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !9, file: !10, line: 211, baseType: !178, size: 256, offset: 2240)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !179, line: 130, baseType: !180)
!179 = !DIFile(filename: "apps/538.imagick_r/src/magick/geometry.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "889bed117eb2a2fce6e2622bd130bcd2")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !179, line: 121, size: 256, elements: !181)
!181 = !{!182, !183, !184, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !180, file: !179, line: 124, baseType: !87, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !180, file: !179, line: 125, baseType: !87, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !180, file: !179, line: 128, baseType: !170, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !180, file: !179, line: 129, baseType: !170, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !9, file: !10, line: 212, baseType: !178, size: 256, offset: 2496)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !9, file: !10, line: 213, baseType: !178, size: 256, offset: 2752)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !9, file: !10, line: 216, baseType: !130, size: 64, offset: 3008)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !9, file: !10, line: 217, baseType: !130, size: 64, offset: 3072)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !9, file: !10, line: 218, baseType: !130, size: 64, offset: 3136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !9, file: !10, line: 221, baseType: !192, size: 32, offset: 3200)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !193, line: 66, baseType: !194)
!193 = !DIFile(filename: "apps/538.imagick_r/src/magick/resample.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "722fed6aaf07c122ede72839e4dadc42")
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 32, baseType: !15, size: 32, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!196 = !DIEnumerator(name: "UndefinedFilter", value: 0)
!197 = !DIEnumerator(name: "PointFilter", value: 1)
!198 = !DIEnumerator(name: "BoxFilter", value: 2)
!199 = !DIEnumerator(name: "TriangleFilter", value: 3)
!200 = !DIEnumerator(name: "HermiteFilter", value: 4)
!201 = !DIEnumerator(name: "HanningFilter", value: 5)
!202 = !DIEnumerator(name: "HammingFilter", value: 6)
!203 = !DIEnumerator(name: "BlackmanFilter", value: 7)
!204 = !DIEnumerator(name: "GaussianFilter", value: 8)
!205 = !DIEnumerator(name: "QuadraticFilter", value: 9)
!206 = !DIEnumerator(name: "CubicFilter", value: 10)
!207 = !DIEnumerator(name: "CatromFilter", value: 11)
!208 = !DIEnumerator(name: "MitchellFilter", value: 12)
!209 = !DIEnumerator(name: "JincFilter", value: 13)
!210 = !DIEnumerator(name: "SincFilter", value: 14)
!211 = !DIEnumerator(name: "SincFastFilter", value: 15)
!212 = !DIEnumerator(name: "KaiserFilter", value: 16)
!213 = !DIEnumerator(name: "WelshFilter", value: 17)
!214 = !DIEnumerator(name: "ParzenFilter", value: 18)
!215 = !DIEnumerator(name: "BohmanFilter", value: 19)
!216 = !DIEnumerator(name: "BartlettFilter", value: 20)
!217 = !DIEnumerator(name: "LagrangeFilter", value: 21)
!218 = !DIEnumerator(name: "LanczosFilter", value: 22)
!219 = !DIEnumerator(name: "LanczosSharpFilter", value: 23)
!220 = !DIEnumerator(name: "Lanczos2Filter", value: 24)
!221 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25)
!222 = !DIEnumerator(name: "RobidouxFilter", value: 26)
!223 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27)
!224 = !DIEnumerator(name: "CosineFilter", value: 28)
!225 = !DIEnumerator(name: "SplineFilter", value: 29)
!226 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30)
!227 = !DIEnumerator(name: "SentinelFilter", value: 31)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !9, file: !10, line: 224, baseType: !229, size: 32, offset: 3232)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !10, line: 73, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 63, baseType: !15, size: 32, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239}
!232 = !DIEnumerator(name: "UndefinedInterlace", value: 0)
!233 = !DIEnumerator(name: "NoInterlace", value: 1)
!234 = !DIEnumerator(name: "LineInterlace", value: 2)
!235 = !DIEnumerator(name: "PlaneInterlace", value: 3)
!236 = !DIEnumerator(name: "PartitionInterlace", value: 4)
!237 = !DIEnumerator(name: "GIFInterlace", value: 5)
!238 = !DIEnumerator(name: "JPEGInterlace", value: 6)
!239 = !DIEnumerator(name: "PNGInterlace", value: 7)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !9, file: !10, line: 227, baseType: !241, size: 32, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !242, line: 35, baseType: !243)
!242 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1f6eaed79d9a4eaf712cd066f6ff022a")
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !242, line: 30, baseType: !15, size: 32, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIEnumerator(name: "UndefinedEndian", value: 0)
!246 = !DIEnumerator(name: "LSBEndian", value: 1)
!247 = !DIEnumerator(name: "MSBEndian", value: 2)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !9, file: !10, line: 230, baseType: !249, size: 32, offset: 3296)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !179, line: 91, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !179, line: 77, baseType: !15, size: 32, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!252 = !DIEnumerator(name: "UndefinedGravity", value: 0)
!253 = !DIEnumerator(name: "ForgetGravity", value: 0)
!254 = !DIEnumerator(name: "NorthWestGravity", value: 1)
!255 = !DIEnumerator(name: "NorthGravity", value: 2)
!256 = !DIEnumerator(name: "NorthEastGravity", value: 3)
!257 = !DIEnumerator(name: "WestGravity", value: 4)
!258 = !DIEnumerator(name: "CenterGravity", value: 5)
!259 = !DIEnumerator(name: "EastGravity", value: 6)
!260 = !DIEnumerator(name: "SouthWestGravity", value: 7)
!261 = !DIEnumerator(name: "SouthGravity", value: 8)
!262 = !DIEnumerator(name: "SouthEastGravity", value: 9)
!263 = !DIEnumerator(name: "StaticGravity", value: 10)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !9, file: !10, line: 233, baseType: !265, size: 32, offset: 3328)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !266, line: 99, baseType: !267)
!266 = !DIFile(filename: "apps/538.imagick_r/src/magick/composite.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "837959ddb1dc628f80f1f9b5cdda1fb4")
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !266, line: 25, baseType: !15, size: 32, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!269 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0)
!270 = !DIEnumerator(name: "NoCompositeOp", value: 1)
!271 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2)
!272 = !DIEnumerator(name: "AtopCompositeOp", value: 3)
!273 = !DIEnumerator(name: "BlendCompositeOp", value: 4)
!274 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5)
!275 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6)
!276 = !DIEnumerator(name: "ClearCompositeOp", value: 7)
!277 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8)
!278 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9)
!279 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10)
!280 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11)
!281 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12)
!282 = !DIEnumerator(name: "CopyCompositeOp", value: 13)
!283 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14)
!284 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15)
!285 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16)
!286 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17)
!287 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18)
!288 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19)
!289 = !DIEnumerator(name: "DarkenCompositeOp", value: 20)
!290 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21)
!291 = !DIEnumerator(name: "DstCompositeOp", value: 22)
!292 = !DIEnumerator(name: "DstInCompositeOp", value: 23)
!293 = !DIEnumerator(name: "DstOutCompositeOp", value: 24)
!294 = !DIEnumerator(name: "DstOverCompositeOp", value: 25)
!295 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26)
!296 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27)
!297 = !DIEnumerator(name: "DissolveCompositeOp", value: 28)
!298 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29)
!299 = !DIEnumerator(name: "HardLightCompositeOp", value: 30)
!300 = !DIEnumerator(name: "HueCompositeOp", value: 31)
!301 = !DIEnumerator(name: "InCompositeOp", value: 32)
!302 = !DIEnumerator(name: "LightenCompositeOp", value: 33)
!303 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34)
!304 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35)
!305 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36)
!306 = !DIEnumerator(name: "ModulateCompositeOp", value: 37)
!307 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38)
!308 = !DIEnumerator(name: "OutCompositeOp", value: 39)
!309 = !DIEnumerator(name: "OverCompositeOp", value: 40)
!310 = !DIEnumerator(name: "OverlayCompositeOp", value: 41)
!311 = !DIEnumerator(name: "PlusCompositeOp", value: 42)
!312 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43)
!313 = !DIEnumerator(name: "SaturateCompositeOp", value: 44)
!314 = !DIEnumerator(name: "ScreenCompositeOp", value: 45)
!315 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46)
!316 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47)
!317 = !DIEnumerator(name: "SrcCompositeOp", value: 48)
!318 = !DIEnumerator(name: "SrcInCompositeOp", value: 49)
!319 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50)
!320 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51)
!321 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52)
!322 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53)
!323 = !DIEnumerator(name: "XorCompositeOp", value: 54)
!324 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55)
!325 = !DIEnumerator(name: "DistortCompositeOp", value: 56)
!326 = !DIEnumerator(name: "BlurCompositeOp", value: 57)
!327 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58)
!328 = !DIEnumerator(name: "VividLightCompositeOp", value: 59)
!329 = !DIEnumerator(name: "PinLightCompositeOp", value: 60)
!330 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61)
!331 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62)
!332 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63)
!333 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64)
!334 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65)
!335 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66)
!336 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !9, file: !10, line: 236, baseType: !338, size: 32, offset: 3360)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !339, line: 32, baseType: !340)
!339 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !339, line: 25, baseType: !15, size: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346}
!342 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!343 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!344 = !DIEnumerator(name: "NoneDispose", value: 1)
!345 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!346 = !DIEnumerator(name: "PreviousDispose", value: 3)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !9, file: !10, line: 239, baseType: !348, size: 64, offset: 3392)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !9, file: !10, line: 242, baseType: !87, size: 64, offset: 3456)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !9, file: !10, line: 243, baseType: !87, size: 64, offset: 3520)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !9, file: !10, line: 246, baseType: !170, size: 64, offset: 3584)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !9, file: !10, line: 249, baseType: !87, size: 64, offset: 3648)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !9, file: !10, line: 250, baseType: !87, size: 64, offset: 3712)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !9, file: !10, line: 253, baseType: !170, size: 64, offset: 3776)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !9, file: !10, line: 256, baseType: !356, size: 192, offset: 3840)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !357, line: 68, baseType: !358)
!357 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !357, line: 62, size: 192, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !358, file: !357, line: 65, baseType: !130, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !358, file: !357, line: 66, baseType: !130, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !358, file: !357, line: 67, baseType: !130, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !9, file: !10, line: 259, baseType: !364, size: 512, offset: 4032)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !365, line: 51, baseType: !366)
!365 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !365, line: 40, size: 512, elements: !367)
!367 = !{!368, !375, !376, !383}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !366, file: !365, line: 43, baseType: !369, size: 192)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !365, line: 38, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !365, line: 32, size: 192, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !370, file: !365, line: 35, baseType: !130, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !370, file: !365, line: 36, baseType: !130, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !370, file: !365, line: 37, baseType: !130, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !366, file: !365, line: 44, baseType: !369, size: 192, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !366, file: !365, line: 47, baseType: !377, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !365, line: 30, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 25, baseType: !15, size: 32, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!381 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!382 = !DIEnumerator(name: "RunningTimerState", value: 2)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !366, file: !365, line: 50, baseType: !87, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !9, file: !10, line: 262, baseType: !385, size: 64, offset: 4544)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !386, line: 26, baseType: !387)
!386 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!104, !390, !392, !395, !156}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !8, line: 150, baseType: !394)
!394 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !8, line: 151, baseType: !397)
!397 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !9, file: !10, line: 265, baseType: !156, size: 64, offset: 4608)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !9, file: !10, line: 266, baseType: !156, size: 64, offset: 4672)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !9, file: !10, line: 267, baseType: !156, size: 64, offset: 4736)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !9, file: !10, line: 270, baseType: !402, size: 64, offset: 4800)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !61, line: 52, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !61, line: 51, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !9, file: !10, line: 273, baseType: !406, size: 64, offset: 4864)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !8, line: 217, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !8, line: 217, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !9, file: !10, line: 276, baseType: !410, size: 32768, offset: 4928)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 32768, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 4096)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !9, file: !10, line: 277, baseType: !410, size: 32768, offset: 37696)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !9, file: !10, line: 278, baseType: !410, size: 32768, offset: 70464)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !9, file: !10, line: 281, baseType: !87, size: 64, offset: 103232)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !9, file: !10, line: 282, baseType: !87, size: 64, offset: 103296)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !9, file: !10, line: 285, baseType: !418, size: 448, offset: 103360)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !8, line: 219, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !420, line: 102, size: 448, elements: !421)
!420 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cd97c70c025a9cff45f4138c27a79124")
!421 = !{!422, !496, !498, !499, !500, !501, !502, !507}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !419, file: !420, line: 105, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !420, line: 100, baseType: !424)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 28, baseType: !15, size: 32, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!426 = !DIEnumerator(name: "UndefinedException", value: 0)
!427 = !DIEnumerator(name: "WarningException", value: 300)
!428 = !DIEnumerator(name: "ResourceLimitWarning", value: 300)
!429 = !DIEnumerator(name: "TypeWarning", value: 305)
!430 = !DIEnumerator(name: "OptionWarning", value: 310)
!431 = !DIEnumerator(name: "DelegateWarning", value: 315)
!432 = !DIEnumerator(name: "MissingDelegateWarning", value: 320)
!433 = !DIEnumerator(name: "CorruptImageWarning", value: 325)
!434 = !DIEnumerator(name: "FileOpenWarning", value: 330)
!435 = !DIEnumerator(name: "BlobWarning", value: 335)
!436 = !DIEnumerator(name: "StreamWarning", value: 340)
!437 = !DIEnumerator(name: "CacheWarning", value: 345)
!438 = !DIEnumerator(name: "CoderWarning", value: 350)
!439 = !DIEnumerator(name: "FilterWarning", value: 352)
!440 = !DIEnumerator(name: "ModuleWarning", value: 355)
!441 = !DIEnumerator(name: "DrawWarning", value: 360)
!442 = !DIEnumerator(name: "ImageWarning", value: 365)
!443 = !DIEnumerator(name: "WandWarning", value: 370)
!444 = !DIEnumerator(name: "RandomWarning", value: 375)
!445 = !DIEnumerator(name: "XServerWarning", value: 380)
!446 = !DIEnumerator(name: "MonitorWarning", value: 385)
!447 = !DIEnumerator(name: "RegistryWarning", value: 390)
!448 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!449 = !DIEnumerator(name: "PolicyWarning", value: 399)
!450 = !DIEnumerator(name: "ErrorException", value: 400)
!451 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!452 = !DIEnumerator(name: "TypeError", value: 405)
!453 = !DIEnumerator(name: "OptionError", value: 410)
!454 = !DIEnumerator(name: "DelegateError", value: 415)
!455 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!456 = !DIEnumerator(name: "CorruptImageError", value: 425)
!457 = !DIEnumerator(name: "FileOpenError", value: 430)
!458 = !DIEnumerator(name: "BlobError", value: 435)
!459 = !DIEnumerator(name: "StreamError", value: 440)
!460 = !DIEnumerator(name: "CacheError", value: 445)
!461 = !DIEnumerator(name: "CoderError", value: 450)
!462 = !DIEnumerator(name: "FilterError", value: 452)
!463 = !DIEnumerator(name: "ModuleError", value: 455)
!464 = !DIEnumerator(name: "DrawError", value: 460)
!465 = !DIEnumerator(name: "ImageError", value: 465)
!466 = !DIEnumerator(name: "WandError", value: 470)
!467 = !DIEnumerator(name: "RandomError", value: 475)
!468 = !DIEnumerator(name: "XServerError", value: 480)
!469 = !DIEnumerator(name: "MonitorError", value: 485)
!470 = !DIEnumerator(name: "RegistryError", value: 490)
!471 = !DIEnumerator(name: "ConfigureError", value: 495)
!472 = !DIEnumerator(name: "PolicyError", value: 499)
!473 = !DIEnumerator(name: "FatalErrorException", value: 700)
!474 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!475 = !DIEnumerator(name: "TypeFatalError", value: 705)
!476 = !DIEnumerator(name: "OptionFatalError", value: 710)
!477 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!478 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!479 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!480 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!481 = !DIEnumerator(name: "BlobFatalError", value: 735)
!482 = !DIEnumerator(name: "StreamFatalError", value: 740)
!483 = !DIEnumerator(name: "CacheFatalError", value: 745)
!484 = !DIEnumerator(name: "CoderFatalError", value: 750)
!485 = !DIEnumerator(name: "FilterFatalError", value: 752)
!486 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!487 = !DIEnumerator(name: "DrawFatalError", value: 760)
!488 = !DIEnumerator(name: "ImageFatalError", value: 765)
!489 = !DIEnumerator(name: "WandFatalError", value: 770)
!490 = !DIEnumerator(name: "RandomFatalError", value: 775)
!491 = !DIEnumerator(name: "XServerFatalError", value: 780)
!492 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!493 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!494 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!495 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !419, file: !420, line: 108, baseType: !497, size: 32, offset: 32)
!497 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !419, file: !420, line: 111, baseType: !165, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !419, file: !420, line: 112, baseType: !165, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !419, file: !420, line: 115, baseType: !156, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !419, file: !420, line: 118, baseType: !104, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !419, file: !420, line: 121, baseType: !503, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !505, line: 26, baseType: !506)
!505 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !505, line: 25, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !419, file: !420, line: 124, baseType: !87, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !9, file: !10, line: 288, baseType: !104, size: 32, offset: 103808)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !9, file: !10, line: 291, baseType: !510, size: 64, offset: 103872)
!510 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !9, file: !10, line: 294, baseType: !503, size: 64, offset: 103936)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !9, file: !10, line: 297, baseType: !513, size: 256, offset: 104000)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !147, line: 40, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !147, line: 27, size: 256, elements: !515)
!515 = !{!516, !517, !518, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !514, file: !147, line: 30, baseType: !165, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !514, file: !147, line: 33, baseType: !87, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !514, file: !147, line: 36, baseType: !519, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !514, file: !147, line: 39, baseType: !87, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !9, file: !10, line: 298, baseType: !513, size: 256, offset: 104256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !9, file: !10, line: 299, baseType: !524, size: 64, offset: 104512)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !9, file: !10, line: 302, baseType: !87, size: 64, offset: 104576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !9, file: !10, line: 305, baseType: !87, size: 64, offset: 104640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !9, file: !10, line: 308, baseType: !348, size: 64, offset: 104704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !9, file: !10, line: 309, baseType: !348, size: 64, offset: 104768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !10, line: 310, baseType: !348, size: 64, offset: 104832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !9, file: !10, line: 313, baseType: !531, size: 32, offset: 104896)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !117, line: 47, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 31, baseType: !15, size: 32, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!534 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!535 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!536 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!537 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!538 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!539 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!540 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!541 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!542 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!543 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!544 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!545 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!546 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!547 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !9, file: !10, line: 316, baseType: !104, size: 32, offset: 104928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !9, file: !10, line: 319, baseType: !116, size: 64, offset: 104960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !9, file: !10, line: 322, baseType: !348, size: 64, offset: 105024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !9, file: !10, line: 325, baseType: !178, size: 256, offset: 105088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !9, file: !10, line: 328, baseType: !156, size: 64, offset: 105344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !9, file: !10, line: 329, baseType: !156, size: 64, offset: 105408)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !10, line: 332, baseType: !555, size: 32, offset: 105472)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !10, line: 61, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 47, baseType: !15, size: 32, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!558 = !DIEnumerator(name: "UndefinedType", value: 0)
!559 = !DIEnumerator(name: "BilevelType", value: 1)
!560 = !DIEnumerator(name: "GrayscaleType", value: 2)
!561 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!562 = !DIEnumerator(name: "PaletteType", value: 4)
!563 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!564 = !DIEnumerator(name: "TrueColorType", value: 6)
!565 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!566 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!567 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!568 = !DIEnumerator(name: "OptimizeType", value: 10)
!569 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !9, file: !10, line: 335, baseType: !104, size: 32, offset: 105504)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !9, file: !10, line: 338, baseType: !396, size: 64, offset: 105536)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !9, file: !10, line: 341, baseType: !104, size: 32, offset: 105600)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !9, file: !10, line: 344, baseType: !87, size: 64, offset: 105664)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !9, file: !10, line: 347, baseType: !575, size: 64, offset: 105728)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !576, line: 7, baseType: !577)
!576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !173, line: 160, baseType: !174)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !9, file: !10, line: 350, baseType: !579, size: 32, offset: 105792)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !117, line: 79, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 67, baseType: !15, size: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!582 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!583 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!584 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!585 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!586 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!587 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!588 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!589 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!590 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!591 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !9, file: !10, line: 353, baseType: !87, size: 64, offset: 105856)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !598, retainedTypes: !797, globals: !869, splitDebugInlining: false, nameTableKind: None)
!597 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/effect.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r", checksumkind: CSK_MD5, checksum: "1cfdd71c77c116a91fdc4437858ec754")
!598 = !{!14, !23, !62, !92, !105, !148, !159, !194, !230, !243, !250, !267, !340, !378, !424, !532, !556, !580, !599, !621, !646, !687, !712, !745, !766, !773, !785}
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 177, baseType: !15, size: 32, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!601 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!602 = !DIEnumerator(name: "RedChannel", value: 1)
!603 = !DIEnumerator(name: "GrayChannel", value: 1)
!604 = !DIEnumerator(name: "CyanChannel", value: 1)
!605 = !DIEnumerator(name: "GreenChannel", value: 2)
!606 = !DIEnumerator(name: "MagentaChannel", value: 2)
!607 = !DIEnumerator(name: "BlueChannel", value: 4)
!608 = !DIEnumerator(name: "YellowChannel", value: 4)
!609 = !DIEnumerator(name: "AlphaChannel", value: 8)
!610 = !DIEnumerator(name: "OpacityChannel", value: 8)
!611 = !DIEnumerator(name: "MatteChannel", value: 8)
!612 = !DIEnumerator(name: "BlackChannel", value: 32)
!613 = !DIEnumerator(name: "IndexChannel", value: 32)
!614 = !DIEnumerator(name: "CompositeChannels", value: 47)
!615 = !DIEnumerator(name: "AllChannels", value: 134217727)
!616 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!617 = !DIEnumerator(name: "RGBChannels", value: 128)
!618 = !DIEnumerator(name: "GrayChannels", value: 128)
!619 = !DIEnumerator(name: "SyncChannels", value: 256)
!620 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!621 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !622, line: 34, baseType: !15, size: 32, elements: !623)
!622 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!624 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!625 = !DIEnumerator(name: "NoEvents", value: 0)
!626 = !DIEnumerator(name: "TraceEvent", value: 1)
!627 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!628 = !DIEnumerator(name: "BlobEvent", value: 4)
!629 = !DIEnumerator(name: "CacheEvent", value: 8)
!630 = !DIEnumerator(name: "CoderEvent", value: 16)
!631 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!632 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!633 = !DIEnumerator(name: "DrawEvent", value: 128)
!634 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!635 = !DIEnumerator(name: "ImageEvent", value: 512)
!636 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!637 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!638 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!639 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!640 = !DIEnumerator(name: "TransformEvent", value: 16384)
!641 = !DIEnumerator(name: "UserEvent", value: 36864)
!642 = !DIEnumerator(name: "WandEvent", value: 65536)
!643 = !DIEnumerator(name: "X11Event", value: 131072)
!644 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!645 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!646 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !647, line: 27, baseType: !15, size: 32, elements: !648)
!647 = !DIFile(filename: "apps/538.imagick_r/src/magick/morphology.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c6a894945ec2a897d86b4fa1dd783082")
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!649 = !DIEnumerator(name: "UndefinedKernel", value: 0)
!650 = !DIEnumerator(name: "UnityKernel", value: 1)
!651 = !DIEnumerator(name: "GaussianKernel", value: 2)
!652 = !DIEnumerator(name: "DoGKernel", value: 3)
!653 = !DIEnumerator(name: "LoGKernel", value: 4)
!654 = !DIEnumerator(name: "BlurKernel", value: 5)
!655 = !DIEnumerator(name: "CometKernel", value: 6)
!656 = !DIEnumerator(name: "LaplacianKernel", value: 7)
!657 = !DIEnumerator(name: "SobelKernel", value: 8)
!658 = !DIEnumerator(name: "FreiChenKernel", value: 9)
!659 = !DIEnumerator(name: "RobertsKernel", value: 10)
!660 = !DIEnumerator(name: "PrewittKernel", value: 11)
!661 = !DIEnumerator(name: "CompassKernel", value: 12)
!662 = !DIEnumerator(name: "KirschKernel", value: 13)
!663 = !DIEnumerator(name: "DiamondKernel", value: 14)
!664 = !DIEnumerator(name: "SquareKernel", value: 15)
!665 = !DIEnumerator(name: "RectangleKernel", value: 16)
!666 = !DIEnumerator(name: "OctagonKernel", value: 17)
!667 = !DIEnumerator(name: "DiskKernel", value: 18)
!668 = !DIEnumerator(name: "PlusKernel", value: 19)
!669 = !DIEnumerator(name: "CrossKernel", value: 20)
!670 = !DIEnumerator(name: "RingKernel", value: 21)
!671 = !DIEnumerator(name: "PeaksKernel", value: 22)
!672 = !DIEnumerator(name: "EdgesKernel", value: 23)
!673 = !DIEnumerator(name: "CornersKernel", value: 24)
!674 = !DIEnumerator(name: "DiagonalsKernel", value: 25)
!675 = !DIEnumerator(name: "LineEndsKernel", value: 26)
!676 = !DIEnumerator(name: "LineJunctionsKernel", value: 27)
!677 = !DIEnumerator(name: "RidgesKernel", value: 28)
!678 = !DIEnumerator(name: "ConvexHullKernel", value: 29)
!679 = !DIEnumerator(name: "ThinSEKernel", value: 30)
!680 = !DIEnumerator(name: "SkeletonKernel", value: 31)
!681 = !DIEnumerator(name: "ChebyshevKernel", value: 32)
!682 = !DIEnumerator(name: "ManhattanKernel", value: 33)
!683 = !DIEnumerator(name: "OctagonalKernel", value: 34)
!684 = !DIEnumerator(name: "EuclideanKernel", value: 35)
!685 = !DIEnumerator(name: "UserDefinedKernel", value: 36)
!686 = !DIEnumerator(name: "BinomialKernel", value: 37)
!687 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !647, line: 69, baseType: !15, size: 32, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!689 = !DIEnumerator(name: "UndefinedMorphology", value: 0)
!690 = !DIEnumerator(name: "ConvolveMorphology", value: 1)
!691 = !DIEnumerator(name: "CorrelateMorphology", value: 2)
!692 = !DIEnumerator(name: "ErodeMorphology", value: 3)
!693 = !DIEnumerator(name: "DilateMorphology", value: 4)
!694 = !DIEnumerator(name: "ErodeIntensityMorphology", value: 5)
!695 = !DIEnumerator(name: "DilateIntensityMorphology", value: 6)
!696 = !DIEnumerator(name: "DistanceMorphology", value: 7)
!697 = !DIEnumerator(name: "OpenMorphology", value: 8)
!698 = !DIEnumerator(name: "CloseMorphology", value: 9)
!699 = !DIEnumerator(name: "OpenIntensityMorphology", value: 10)
!700 = !DIEnumerator(name: "CloseIntensityMorphology", value: 11)
!701 = !DIEnumerator(name: "SmoothMorphology", value: 12)
!702 = !DIEnumerator(name: "EdgeInMorphology", value: 13)
!703 = !DIEnumerator(name: "EdgeOutMorphology", value: 14)
!704 = !DIEnumerator(name: "EdgeMorphology", value: 15)
!705 = !DIEnumerator(name: "TopHatMorphology", value: 16)
!706 = !DIEnumerator(name: "BottomHatMorphology", value: 17)
!707 = !DIEnumerator(name: "HitAndMissMorphology", value: 18)
!708 = !DIEnumerator(name: "ThinningMorphology", value: 19)
!709 = !DIEnumerator(name: "ThickenMorphology", value: 20)
!710 = !DIEnumerator(name: "VoronoiMorphology", value: 21)
!711 = !DIEnumerator(name: "IterativeDistanceMorphology", value: 22)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !713, line: 27, baseType: !15, size: 32, elements: !714)
!713 = !DIFile(filename: "apps/538.imagick_r/src/magick/effect.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "85233add4591bd6d6001c51d4fa6a546")
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!715 = !DIEnumerator(name: "UndefinedPreview", value: 0)
!716 = !DIEnumerator(name: "RotatePreview", value: 1)
!717 = !DIEnumerator(name: "ShearPreview", value: 2)
!718 = !DIEnumerator(name: "RollPreview", value: 3)
!719 = !DIEnumerator(name: "HuePreview", value: 4)
!720 = !DIEnumerator(name: "SaturationPreview", value: 5)
!721 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!722 = !DIEnumerator(name: "GammaPreview", value: 7)
!723 = !DIEnumerator(name: "SpiffPreview", value: 8)
!724 = !DIEnumerator(name: "DullPreview", value: 9)
!725 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!726 = !DIEnumerator(name: "QuantizePreview", value: 11)
!727 = !DIEnumerator(name: "DespecklePreview", value: 12)
!728 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!729 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!730 = !DIEnumerator(name: "SharpenPreview", value: 15)
!731 = !DIEnumerator(name: "BlurPreview", value: 16)
!732 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!733 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!734 = !DIEnumerator(name: "SpreadPreview", value: 19)
!735 = !DIEnumerator(name: "SolarizePreview", value: 20)
!736 = !DIEnumerator(name: "ShadePreview", value: 21)
!737 = !DIEnumerator(name: "RaisePreview", value: 22)
!738 = !DIEnumerator(name: "SegmentPreview", value: 23)
!739 = !DIEnumerator(name: "SwirlPreview", value: 24)
!740 = !DIEnumerator(name: "ImplodePreview", value: 25)
!741 = !DIEnumerator(name: "WavePreview", value: 26)
!742 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!743 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!744 = !DIEnumerator(name: "JPEGPreview", value: 29)
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !746, line: 27, baseType: !15, size: 32, elements: !747)
!746 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!748 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!749 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!750 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!751 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!752 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!753 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!754 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!755 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!756 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!757 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!758 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!759 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!760 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!761 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!762 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!763 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!764 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!765 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!766 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !767, line: 27, baseType: !15, size: 32, elements: !768)
!767 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantize.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3eab4066ac81fc10b9d90b7cb7db1009")
!768 = !{!769, !770, !771, !772}
!769 = !DIEnumerator(name: "UndefinedDitherMethod", value: 0)
!770 = !DIEnumerator(name: "NoDitherMethod", value: 1)
!771 = !DIEnumerator(name: "RiemersmaDitherMethod", value: 2)
!772 = !DIEnumerator(name: "FloydSteinbergDitherMethod", value: 3)
!773 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !774, line: 113, baseType: !15, size: 32, elements: !775)
!774 = !DIFile(filename: "apps/538.imagick_r/src/magick/statistic.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cc0a772b8e2f514bf6d24321fcc65365")
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784}
!776 = !DIEnumerator(name: "UndefinedStatistic", value: 0)
!777 = !DIEnumerator(name: "GradientStatistic", value: 1)
!778 = !DIEnumerator(name: "MaximumStatistic", value: 2)
!779 = !DIEnumerator(name: "MeanStatistic", value: 3)
!780 = !DIEnumerator(name: "MedianStatistic", value: 4)
!781 = !DIEnumerator(name: "MinimumStatistic", value: 5)
!782 = !DIEnumerator(name: "ModeStatistic", value: 6)
!783 = !DIEnumerator(name: "NonpeakStatistic", value: 7)
!784 = !DIEnumerator(name: "StandardDeviationStatistic", value: 8)
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !786, line: 25, baseType: !15, size: 32, elements: !787)
!786 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796}
!788 = !DIEnumerator(name: "UndefinedResource", value: 0)
!789 = !DIEnumerator(name: "AreaResource", value: 1)
!790 = !DIEnumerator(name: "DiskResource", value: 2)
!791 = !DIEnumerator(name: "FileResource", value: 3)
!792 = !DIEnumerator(name: "MapResource", value: 4)
!793 = !DIEnumerator(name: "MemoryResource", value: 5)
!794 = !DIEnumerator(name: "ThreadResource", value: 6)
!795 = !DIEnumerator(name: "TimeResource", value: 7)
!796 = !DIEnumerator(name: "ThrottleResource", value: 8)
!797 = !{!89, !6, !156, !798, !87, !170, !799, !130, !800, !115, !121, !802, !804, !807, !806, !385, !808, !390, !827, !831, !393, !832, !833, !834, !497, !840, !165, !863, !864, !865}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !8, line: 78, baseType: !803)
!803 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !117, line: 129, baseType: !121)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfo", file: !647, line: 128, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernelInfo", file: !647, line: 102, size: 832, elements: !811)
!811 = !{!812, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !826}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !810, file: !647, line: 105, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfoType", file: !647, line: 67, baseType: !646)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !810, file: !647, line: 108, baseType: !87, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !810, file: !647, line: 109, baseType: !87, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !810, file: !647, line: 112, baseType: !170, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !810, file: !647, line: 113, baseType: !170, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !810, file: !647, line: 116, baseType: !799, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !810, file: !647, line: 117, baseType: !130, size: 64, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !810, file: !647, line: 118, baseType: !130, size: 64, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "negative_range", scope: !810, file: !647, line: 119, baseType: !130, size: 64, offset: 512)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "positive_range", scope: !810, file: !647, line: 120, baseType: !130, size: 64, offset: 576)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !810, file: !647, line: 121, baseType: !130, size: 64, offset: 640)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !647, line: 124, baseType: !825, size: 64, offset: 704)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !810, file: !647, line: 127, baseType: !87, size: 64, offset: 768)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryInfo", file: !829, line: 26, baseType: !830)
!829 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MemoryInfo", file: !829, line: 25, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !8, line: 202, baseType: !599)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "OffsetInfo", file: !179, line: 119, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_OffsetInfo", file: !179, line: 114, size: 128, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !836, file: !179, line: 117, baseType: !170, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !836, file: !179, line: 118, baseType: !170, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "MontageInfo", file: !842, line: 70, baseType: !843)
!842 = !DIFile(filename: "apps/538.imagick_r/src/magick/montage.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "8b3bd6166a2c89122d4b47913872e309")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MontageInfo", file: !842, line: 33, size: 33792, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !843, file: !842, line: 36, baseType: !165, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !843, file: !842, line: 37, baseType: !165, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !843, file: !842, line: 38, baseType: !165, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !843, file: !842, line: 39, baseType: !165, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !843, file: !842, line: 40, baseType: !165, size: 64, offset: 256)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !843, file: !842, line: 41, baseType: !165, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !843, file: !842, line: 44, baseType: !130, size: 64, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !843, file: !842, line: 47, baseType: !87, size: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !843, file: !842, line: 50, baseType: !104, size: 32, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !843, file: !842, line: 53, baseType: !116, size: 64, offset: 544)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !843, file: !842, line: 54, baseType: !116, size: 64, offset: 608)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !843, file: !842, line: 55, baseType: !116, size: 64, offset: 672)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !843, file: !842, line: 56, baseType: !116, size: 64, offset: 736)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !843, file: !842, line: 57, baseType: !116, size: 64, offset: 800)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !843, file: !842, line: 60, baseType: !249, size: 32, offset: 864)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !843, file: !842, line: 63, baseType: !410, size: 32768, offset: 896)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !843, file: !842, line: 66, baseType: !104, size: 32, offset: 33664)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !843, file: !842, line: 69, baseType: !87, size: 64, offset: 33728)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignedQuantum", file: !8, line: 87, baseType: !170)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !867, line: 31, baseType: !868)
!867 = !DIFile(filename: "apps/538.imagick_r/src/magick/random_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "95f31caf92e8a7cab5b1bf8cc3698f31")
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !867, line: 30, flags: DIFlagFwdDecl)
!869 = !{!0, !870}
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "Y", scope: !2, file: !3, line: 1075, type: !872, isLocal: true, isDefinition: true)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !873, size: 256, elements: !874)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!874 = !{!875}
!875 = !DISubrange(count: 4)
!876 = !{!877, !878, !879, !883, !884, !885, !886, !887, !888, !889, !891, !892, !893, !894, !898, !899, !900, !901, !906, !908, !912, !914, !916}
!877 = !DILocalVariable(name: "image", arg: 1, scope: !2, file: !3, line: 1044, type: !593)
!878 = !DILocalVariable(name: "exception", arg: 2, scope: !2, file: !3, line: 1044, type: !595)
!879 = !DILocalVariable(name: "despeckle_view", scope: !2, file: !3, line: 1049, type: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !746, line: 50, baseType: !882)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !117, line: 160, flags: DIFlagFwdDecl)
!883 = !DILocalVariable(name: "image_view", scope: !2, file: !3, line: 1050, type: !880)
!884 = !DILocalVariable(name: "despeckle_image", scope: !2, file: !3, line: 1053, type: !6)
!885 = !DILocalVariable(name: "status", scope: !2, file: !3, line: 1056, type: !104)
!886 = !DILocalVariable(name: "buffer_info", scope: !2, file: !3, line: 1059, type: !827)
!887 = !DILocalVariable(name: "pixel_info", scope: !2, file: !3, line: 1060, type: !827)
!888 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 1063, type: !170)
!889 = !DILocalVariable(name: "buffer", scope: !2, file: !3, line: 1066, type: !890)
!890 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !831)
!891 = !DILocalVariable(name: "pixels", scope: !2, file: !3, line: 1067, type: !890)
!892 = !DILocalVariable(name: "length", scope: !2, file: !3, line: 1070, type: !87)
!893 = !DILocalVariable(name: "number_channels", scope: !2, file: !3, line: 1071, type: !87)
!894 = !DILocalVariable(name: "k", scope: !895, file: !3, line: 1127, type: !170)
!895 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1125, column: 3)
!896 = distinct !DILexicalBlock(scope: !897, file: !3, line: 1124, column: 3)
!897 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1124, column: 3)
!898 = !DILocalVariable(name: "x", scope: !895, file: !3, line: 1128, type: !170)
!899 = !DILocalVariable(name: "j", scope: !895, file: !3, line: 1131, type: !170)
!900 = !DILocalVariable(name: "y", scope: !895, file: !3, line: 1132, type: !170)
!901 = !DILocalVariable(name: "indexes", scope: !902, file: !3, line: 1143, type: !905)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 1141, column: 5)
!903 = distinct !DILexicalBlock(scope: !904, file: !3, line: 1140, column: 5)
!904 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1140, column: 5)
!905 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !804)
!906 = !DILocalVariable(name: "p", scope: !902, file: !3, line: 1146, type: !907)
!907 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !800)
!908 = !DILocalVariable(name: "sync", scope: !909, file: !3, line: 1181, type: !104)
!909 = distinct !DILexicalBlock(scope: !910, file: !3, line: 1179, column: 5)
!910 = distinct !DILexicalBlock(scope: !911, file: !3, line: 1178, column: 5)
!911 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1178, column: 5)
!912 = !DILocalVariable(name: "indexes", scope: !909, file: !3, line: 1184, type: !913)
!913 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !807)
!914 = !DILocalVariable(name: "q", scope: !909, file: !3, line: 1187, type: !915)
!915 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !115)
!916 = !DILocalVariable(name: "proceed", scope: !917, file: !3, line: 1220, type: !104)
!917 = distinct !DILexicalBlock(scope: !918, file: !3, line: 1218, column: 7)
!918 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1217, column: 9)
!919 = !{i32 7, !"Dwarf Version", i32 5}
!920 = !{i32 2, !"Debug Info Version", i32 3}
!921 = !{i32 1, !"wchar_size", i32 4}
!922 = !{i32 7, !"PIC Level", i32 2}
!923 = !{i32 7, !"PIE Level", i32 2}
!924 = !{i32 7, !"uwtable", i32 2}
!925 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!926 = distinct !DISubprogram(name: "AdaptiveBlurImage", scope: !3, file: !3, line: 138, type: !927, scopeLine: 140, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !596, retainedNodes: !930)
!927 = !DISubroutineType(types: !928)
!928 = !{!6, !593, !929, !929, !595}
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!930 = !{!931, !932, !933, !934, !935}
!931 = !DILocalVariable(name: "image", arg: 1, scope: !926, file: !3, line: 138, type: !593)
!932 = !DILocalVariable(name: "radius", arg: 2, scope: !926, file: !3, line: 138, type: !929)
!933 = !DILocalVariable(name: "sigma", arg: 3, scope: !926, file: !3, line: 139, type: !929)
!934 = !DILocalVariable(name: "exception", arg: 4, scope: !926, file: !3, line: 139, type: !595)
!935 = !DILocalVariable(name: "blur_image", scope: !926, file: !3, line: 142, type: !6)
!936 = !DILocation(line: 0, scope: !926)
!937 = !DILocation(line: 144, column: 14, scope: !926)
!938 = !DILocation(line: 146, column: 3, scope: !926)
!939 = distinct !DISubprogram(name: "AdaptiveBlurImageChannel", scope: !3, file: !3, line: 149, type: !940, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !596, retainedNodes: !943)
!940 = !DISubroutineType(types: !941)
!941 = !{!6, !593, !942, !929, !929, !595}
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !973, !974, !975, !976, !977, !978, !979, !980, !984, !985, !986, !987, !988, !989, !993, !994, !1003, !1006, !1007, !1008, !1009}
!944 = !DILocalVariable(name: "image", arg: 1, scope: !939, file: !3, line: 149, type: !593)
!945 = !DILocalVariable(name: "channel", arg: 2, scope: !939, file: !3, line: 150, type: !942)
!946 = !DILocalVariable(name: "radius", arg: 3, scope: !939, file: !3, line: 150, type: !929)
!947 = !DILocalVariable(name: "sigma", arg: 4, scope: !939, file: !3, line: 150, type: !929)
!948 = !DILocalVariable(name: "exception", arg: 5, scope: !939, file: !3, line: 151, type: !595)
!949 = !DILocalVariable(name: "blur_view", scope: !939, file: !3, line: 157, type: !880)
!950 = !DILocalVariable(name: "edge_view", scope: !939, file: !3, line: 158, type: !880)
!951 = !DILocalVariable(name: "image_view", scope: !939, file: !3, line: 159, type: !880)
!952 = !DILocalVariable(name: "kernel", scope: !939, file: !3, line: 162, type: !798)
!953 = !DILocalVariable(name: "normalize", scope: !939, file: !3, line: 163, type: !130)
!954 = !DILocalVariable(name: "blur_image", scope: !939, file: !3, line: 166, type: !6)
!955 = !DILocalVariable(name: "edge_image", scope: !939, file: !3, line: 167, type: !6)
!956 = !DILocalVariable(name: "gaussian_image", scope: !939, file: !3, line: 168, type: !6)
!957 = !DILocalVariable(name: "status", scope: !939, file: !3, line: 171, type: !104)
!958 = !DILocalVariable(name: "progress", scope: !939, file: !3, line: 174, type: !393)
!959 = !DILocalVariable(name: "bias", scope: !939, file: !3, line: 177, type: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !117, line: 127, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !117, line: 104, size: 448, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !969, !970, !971, !972}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !961, file: !117, line: 107, baseType: !13, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !961, file: !117, line: 110, baseType: !21, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !961, file: !117, line: 113, baseType: !104, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !961, file: !117, line: 116, baseType: !130, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !961, file: !117, line: 119, baseType: !87, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !961, file: !117, line: 122, baseType: !802, size: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !961, file: !117, line: 123, baseType: !802, size: 32, offset: 288)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !961, file: !117, line: 124, baseType: !802, size: 32, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !961, file: !117, line: 125, baseType: !802, size: 32, offset: 352)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !961, file: !117, line: 126, baseType: !802, size: 32, offset: 384)
!973 = !DILocalVariable(name: "i", scope: !939, file: !3, line: 180, type: !170)
!974 = !DILocalVariable(name: "width", scope: !939, file: !3, line: 183, type: !87)
!975 = !DILocalVariable(name: "j", scope: !939, file: !3, line: 186, type: !170)
!976 = !DILocalVariable(name: "k", scope: !939, file: !3, line: 187, type: !170)
!977 = !DILocalVariable(name: "u", scope: !939, file: !3, line: 188, type: !170)
!978 = !DILocalVariable(name: "v", scope: !939, file: !3, line: 189, type: !170)
!979 = !DILocalVariable(name: "y", scope: !939, file: !3, line: 190, type: !170)
!980 = !DILocalVariable(name: "indexes", scope: !981, file: !3, line: 288, type: !905)
!981 = distinct !DILexicalBlock(scope: !982, file: !3, line: 286, column: 3)
!982 = distinct !DILexicalBlock(scope: !983, file: !3, line: 285, column: 3)
!983 = distinct !DILexicalBlock(scope: !939, file: !3, line: 285, column: 3)
!984 = !DILocalVariable(name: "p", scope: !981, file: !3, line: 291, type: !907)
!985 = !DILocalVariable(name: "r", scope: !981, file: !3, line: 292, type: !907)
!986 = !DILocalVariable(name: "blur_indexes", scope: !981, file: !3, line: 295, type: !913)
!987 = !DILocalVariable(name: "q", scope: !981, file: !3, line: 298, type: !915)
!988 = !DILocalVariable(name: "x", scope: !981, file: !3, line: 301, type: !170)
!989 = !DILocalVariable(name: "alpha", scope: !990, file: !3, line: 317, type: !130)
!990 = distinct !DILexicalBlock(scope: !991, file: !3, line: 315, column: 5)
!991 = distinct !DILexicalBlock(scope: !992, file: !3, line: 314, column: 5)
!992 = distinct !DILexicalBlock(scope: !981, file: !3, line: 314, column: 5)
!993 = !DILocalVariable(name: "gamma", scope: !990, file: !3, line: 318, type: !130)
!994 = !DILocalVariable(name: "pixel", scope: !990, file: !3, line: 321, type: !995)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "DoublePixelPacket", file: !117, line: 92, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DoublePixelPacket", file: !117, line: 84, size: 320, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !996, file: !117, line: 87, baseType: !130, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !996, file: !117, line: 88, baseType: !130, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !996, file: !117, line: 89, baseType: !130, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !996, file: !117, line: 90, baseType: !130, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !996, file: !117, line: 91, baseType: !130, size: 64, offset: 256)
!1003 = !DILocalVariable(name: "k", scope: !990, file: !3, line: 324, type: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!1006 = !DILocalVariable(name: "i", scope: !990, file: !3, line: 327, type: !170)
!1007 = !DILocalVariable(name: "u", scope: !990, file: !3, line: 328, type: !170)
!1008 = !DILocalVariable(name: "v", scope: !990, file: !3, line: 329, type: !170)
!1009 = !DILocalVariable(name: "proceed", scope: !1010, file: !3, line: 399, type: !104)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 397, column: 7)
!1011 = distinct !DILexicalBlock(scope: !981, file: !3, line: 396, column: 9)
!1012 = !DILocation(line: 0, scope: !939)
!1013 = !DILocation(line: 176, column: 3, scope: !939)
!1014 = !DILocation(line: 177, column: 5, scope: !939)
!1015 = !DILocation(line: 194, column: 14, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !939, file: !3, line: 194, column: 7)
!1017 = !{!1018, !1019, i64 12976}
!1018 = !{!"_Image", !1019, i64 0, !1019, i64 4, !1019, i64 8, !1021, i64 16, !1019, i64 24, !1019, i64 28, !1019, i64 32, !1021, i64 40, !1021, i64 48, !1021, i64 56, !1021, i64 64, !1022, i64 72, !1023, i64 80, !1023, i64 88, !1023, i64 96, !1025, i64 104, !1026, i64 112, !1019, i64 208, !1022, i64 216, !1019, i64 224, !1022, i64 232, !1022, i64 240, !1022, i64 248, !1021, i64 256, !1025, i64 264, !1025, i64 272, !1028, i64 280, !1028, i64 312, !1028, i64 344, !1025, i64 376, !1025, i64 384, !1025, i64 392, !1019, i64 400, !1019, i64 404, !1019, i64 408, !1019, i64 412, !1019, i64 416, !1019, i64 420, !1022, i64 424, !1021, i64 432, !1021, i64 440, !1021, i64 448, !1021, i64 456, !1021, i64 464, !1021, i64 472, !1029, i64 480, !1030, i64 504, !1022, i64 568, !1022, i64 576, !1022, i64 584, !1022, i64 592, !1022, i64 600, !1022, i64 608, !1019, i64 616, !1019, i64 4712, !1019, i64 8808, !1021, i64 12904, !1021, i64 12912, !1032, i64 12920, !1019, i64 12976, !1021, i64 12984, !1022, i64 12992, !1034, i64 13000, !1034, i64 13032, !1022, i64 13064, !1021, i64 13072, !1021, i64 13080, !1022, i64 13088, !1022, i64 13096, !1022, i64 13104, !1019, i64 13112, !1019, i64 13116, !1023, i64 13120, !1022, i64 13128, !1028, i64 13136, !1022, i64 13168, !1022, i64 13176, !1019, i64 13184, !1019, i64 13188, !1035, i64 13192, !1019, i64 13200, !1021, i64 13208, !1021, i64 13216, !1019, i64 13224, !1021, i64 13232}
!1019 = !{!"omnipotent char", !1020, i64 0}
!1020 = !{!"Simple C/C++ TBAA"}
!1021 = !{!"long", !1019, i64 0}
!1022 = !{!"any pointer", !1019, i64 0}
!1023 = !{!"_PixelPacket", !1024, i64 0, !1024, i64 2, !1024, i64 4, !1024, i64 6}
!1024 = !{!"short", !1019, i64 0}
!1025 = !{!"double", !1019, i64 0}
!1026 = !{!"_ChromaticityInfo", !1027, i64 0, !1027, i64 24, !1027, i64 48, !1027, i64 72}
!1027 = !{!"_PrimaryInfo", !1025, i64 0, !1025, i64 8, !1025, i64 16}
!1028 = !{!"_RectangleInfo", !1021, i64 0, !1021, i64 8, !1021, i64 16, !1021, i64 24}
!1029 = !{!"_ErrorInfo", !1025, i64 0, !1025, i64 8, !1025, i64 16}
!1030 = !{!"_TimerInfo", !1031, i64 0, !1031, i64 24, !1019, i64 48, !1021, i64 56}
!1031 = !{!"_Timer", !1025, i64 0, !1025, i64 8, !1025, i64 16}
!1032 = !{!"_ExceptionInfo", !1019, i64 0, !1033, i64 4, !1022, i64 8, !1022, i64 16, !1022, i64 24, !1019, i64 32, !1022, i64 40, !1021, i64 48}
!1033 = !{!"int", !1019, i64 0}
!1034 = !{!"_ProfileInfo", !1022, i64 0, !1021, i64 8, !1022, i64 16, !1021, i64 24}
!1035 = !{!"long long", !1019, i64 0}
!1036 = !DILocation(line: 194, column: 20, scope: !1016)
!1037 = !DILocation(line: 194, column: 7, scope: !939)
!1038 = !DILocation(line: 195, column: 68, scope: !1016)
!1039 = !DILocation(line: 195, column: 12, scope: !1016)
!1040 = !DILocation(line: 195, column: 5, scope: !1016)
!1041 = !DILocation(line: 198, column: 38, scope: !939)
!1042 = !{!1018, !1021, i64 40}
!1043 = !DILocation(line: 198, column: 53, scope: !939)
!1044 = !{!1018, !1021, i64 48}
!1045 = !DILocation(line: 198, column: 14, scope: !939)
!1046 = !DILocation(line: 199, column: 18, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !939, file: !3, line: 199, column: 7)
!1048 = !DILocation(line: 199, column: 7, scope: !939)
!1049 = !DILocation(line: 201, column: 7, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !939, file: !3, line: 201, column: 7)
!1051 = !DILocation(line: 201, column: 19, scope: !1050)
!1052 = !DILocation(line: 201, column: 7, scope: !939)
!1053 = !DILocation(line: 203, column: 7, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !939, file: !3, line: 203, column: 7)
!1055 = !DILocation(line: 203, column: 52, scope: !1054)
!1056 = !DILocation(line: 203, column: 7, scope: !939)
!1057 = !DILocation(line: 205, column: 47, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 204, column: 5)
!1059 = !DILocation(line: 205, column: 7, scope: !1058)
!1060 = !DILocation(line: 206, column: 18, scope: !1058)
!1061 = !DILocation(line: 207, column: 7, scope: !1058)
!1062 = !DILocation(line: 212, column: 14, scope: !939)
!1063 = !DILocation(line: 213, column: 18, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !939, file: !3, line: 213, column: 7)
!1065 = !DILocation(line: 213, column: 7, scope: !939)
!1066 = !DILocation(line: 215, column: 18, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 214, column: 5)
!1068 = !DILocation(line: 216, column: 7, scope: !1067)
!1069 = !DILocation(line: 218, column: 10, scope: !939)
!1070 = !DILocalVariable(name: "image", arg: 1, scope: !1071, file: !3, line: 786, type: !593)
!1071 = distinct !DISubprogram(name: "BlurImage", scope: !3, file: !3, line: 786, type: !927, scopeLine: 788, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !596, retainedNodes: !1072)
!1072 = !{!1070, !1073, !1074, !1075, !1076}
!1073 = !DILocalVariable(name: "radius", arg: 2, scope: !1071, file: !3, line: 786, type: !929)
!1074 = !DILocalVariable(name: "sigma", arg: 3, scope: !1071, file: !3, line: 787, type: !929)
!1075 = !DILocalVariable(name: "exception", arg: 4, scope: !1071, file: !3, line: 787, type: !595)
!1076 = !DILocalVariable(name: "blur_image", scope: !1071, file: !3, line: 790, type: !6)
!1077 = !DILocation(line: 0, scope: !1071, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 219, column: 18, scope: !939)
!1079 = !DILocation(line: 792, column: 14, scope: !1071, inlinedAt: !1078)
!1080 = !DILocation(line: 220, column: 22, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !939, file: !3, line: 220, column: 7)
!1082 = !DILocation(line: 220, column: 7, scope: !939)
!1083 = !DILocation(line: 222, column: 18, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 221, column: 5)
!1085 = !DILocation(line: 224, column: 5, scope: !1084)
!1086 = !DILocation(line: 225, column: 10, scope: !939)
!1087 = !DILocation(line: 229, column: 9, scope: !939)
!1088 = !DILocation(line: 230, column: 22, scope: !939)
!1089 = !DILocation(line: 232, column: 14, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !939, file: !3, line: 232, column: 7)
!1091 = !DILocation(line: 232, column: 7, scope: !939)
!1092 = !DILocation(line: 234, column: 18, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 233, column: 5)
!1094 = !DILocation(line: 235, column: 18, scope: !1093)
!1095 = !DILocation(line: 236, column: 7, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 236, column: 7)
!1097 = !DILocation(line: 238, column: 51, scope: !939)
!1098 = !DILocation(line: 238, column: 10, scope: !939)
!1099 = !DILocation(line: 239, column: 15, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 239, column: 3)
!1101 = distinct !DILexicalBlock(scope: !939, file: !3, line: 239, column: 3)
!1102 = !DILocation(line: 239, column: 3, scope: !1101)
!1103 = !DILocation(line: 241, column: 26, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 240, column: 3)
!1105 = !DILocation(line: 241, column: 5, scope: !1104)
!1106 = !DILocation(line: 241, column: 14, scope: !1104)
!1107 = !{!1022, !1022, i64 0}
!1108 = !DILocation(line: 243, column: 19, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 243, column: 9)
!1110 = !DILocation(line: 243, column: 9, scope: !1104)
!1111 = !DILocation(line: 264, column: 20, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 264, column: 7)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 264, column: 7)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !3, line: 263, column: 5)
!1115 = distinct !DILexicalBlock(scope: !939, file: !3, line: 262, column: 7)
!1116 = !DILocation(line: 264, column: 7, scope: !1113)
!1117 = !DILocation(line: 246, column: 26, scope: !1104)
!1118 = !DILocation(line: 248, column: 13, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 248, column: 5)
!1120 = !DILocation(line: 248, column: 20, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 248, column: 5)
!1122 = !DILocation(line: 248, column: 5, scope: !1119)
!1123 = !DILocation(line: 252, column: 61, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 251, column: 7)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 250, column: 7)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 250, column: 7)
!1127 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 249, column: 5)
!1128 = !DILocation(line: 250, column: 7, scope: !1126)
!1129 = !DILocation(line: 252, column: 38, scope: !1124)
!1130 = !DILocation(line: 252, column: 50, scope: !1124)
!1131 = !DILocation(line: 252, column: 55, scope: !1124)
!1132 = !DILocation(line: 252, column: 32, scope: !1124)
!1133 = !DILocation(line: 253, column: 24, scope: !1124)
!1134 = !DILocation(line: 252, column: 9, scope: !1124)
!1135 = !DILocation(line: 252, column: 21, scope: !1124)
!1136 = !{!1025, !1025, i64 0}
!1137 = !DILocation(line: 254, column: 18, scope: !1124)
!1138 = !DILocation(line: 255, column: 10, scope: !1124)
!1139 = !DILocation(line: 250, column: 29, scope: !1125)
!1140 = !DILocation(line: 250, column: 22, scope: !1125)
!1141 = distinct !{!1141, !1128, !1142, !1143, !1144}
!1142 = !DILocation(line: 256, column: 7, scope: !1126)
!1143 = !{!"llvm.loop.mustprogress"}
!1144 = !{!"llvm.loop.unroll.disable"}
!1145 = !DILocation(line: 248, column: 27, scope: !1121)
!1146 = distinct !{!1146, !1122, !1147, !1143, !1144}
!1147 = !DILocation(line: 257, column: 5, scope: !1119)
!1148 = !DILocation(line: 252, column: 36, scope: !1124)
!1149 = !DILocation(line: 258, column: 5, scope: !1104)
!1150 = !DILocation(line: 245, column: 14, scope: !1104)
!1151 = !DILocation(line: 247, column: 6, scope: !1104)
!1152 = !DILocation(line: 258, column: 29, scope: !1104)
!1153 = !DILocation(line: 258, column: 17, scope: !1104)
!1154 = !DILocation(line: 258, column: 20, scope: !1104)
!1155 = !DILocation(line: 258, column: 23, scope: !1104)
!1156 = !DILocation(line: 259, column: 9, scope: !1104)
!1157 = !DILocation(line: 260, column: 7, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 259, column: 9)
!1159 = !DILocation(line: 0, scope: !1104)
!1160 = !DILocation(line: 239, column: 35, scope: !1100)
!1161 = distinct !{!1161, !1102, !1162, !1143, !1144}
!1162 = !DILocation(line: 261, column: 3, scope: !1101)
!1163 = !DILocation(line: 0, scope: !1113)
!1164 = !DILocation(line: 265, column: 54, scope: !1112)
!1165 = !DILocation(line: 265, column: 30, scope: !1112)
!1166 = !DILocation(line: 265, column: 18, scope: !1112)
!1167 = distinct !{!1167, !1116, !1168, !1143, !1144}
!1168 = !DILocation(line: 265, column: 63, scope: !1113)
!1169 = !DILocation(line: 266, column: 26, scope: !1114)
!1170 = !DILocation(line: 267, column: 18, scope: !1114)
!1171 = !DILocation(line: 268, column: 18, scope: !1114)
!1172 = !DILocation(line: 269, column: 7, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 269, column: 7)
!1174 = !DILocation(line: 276, column: 3, scope: !939)
