; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/encoder/encoder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/encoder/encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_cpu_name_t = type { [16 x i8], i32 }
%struct.x264_level_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, ptr, [8 x i8] }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, float, float, float, i32, float, i32, i32, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }

!135 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "intra_chroma_pred_e", file: !112, line: 31, baseType: !7, size: 32, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143}
!137 = !DIEnumerator(name: "I_PRED_CHROMA_DC", value: 0)
!138 = !DIEnumerator(name: "I_PRED_CHROMA_H", value: 1)
!139 = !DIEnumerator(name: "I_PRED_CHROMA_V", value: 2)
!140 = !DIEnumerator(name: "I_PRED_CHROMA_P", value: 3)
!141 = !DIEnumerator(name: "I_PRED_CHROMA_DC_LEFT", value: 4)
!142 = !DIEnumerator(name: "I_PRED_CHROMA_DC_TOP", value: 5)
!143 = !DIEnumerator(name: "I_PRED_CHROMA_DC_128", value: 6)
!144 = !{!145, !146, !147, !148, !151, !152, !158, !176, !179}
!145 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !149, line: 87, baseType: !150)
!149 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!150 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!151 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !154, line: 24, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !156, line: 38, baseType: !157)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!157 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !48, line: 89, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !48, line: 89, size: 32, elements: !161)
!161 = !{!162, !165, !172}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !160, file: !48, line: 89, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !154, line: 26, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !156, line: 42, baseType: !7)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !160, file: !48, line: 89, baseType: !166, size: 32)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 32, elements: !170)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !154, line: 25, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !156, line: 40, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !{!171}
!171 = !DISubrange(count: 2)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !160, file: !48, line: 89, baseType: !173, size: 32)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 32, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 4)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !154, line: 27, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !156, line: 45, baseType: !178)
!178 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!180 = !{!181, !1586, !1590, !0, !1592, !1595, !1600, !1603, !1607, !1610, !1615}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "slice_order", scope: !183, file: !184, line: 2876, type: !1585, isLocal: true, isDefinition: true)
!183 = distinct !DISubprogram(name: "x264_encoder_close", scope: !184, file: !184, line: 2838, type: !185, scopeLine: 2839, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1471)
!184 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/encoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "11d332f3cd54995855f9b0a3c96f40a5")
!185 = !DISubroutineType(types: !186)
!186 = !{null, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !18, line: 46, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !48, line: 381, size: 266752, elements: !190)
!190 = !{!191, !358, !362, !363, !364, !365, !366, !367, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !498, !500, !528, !530, !531, !532, !536, !540, !541, !542, !546, !550, !551, !552, !557, !560, !561, !640, !657, !816, !817, !818, !819, !823, !824, !825, !826, !827, !828, !829, !844, !1037, !1041, !1102, !1105, !1107, !1109, !1110, !1113, !1118, !1126, !1127, !1135, !1137, !1142, !1217, !1303, !1347, !1369, !1418, !1447}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !189, file: !48, line: 384, baseType: !192, size: 5632)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !18, line: 376, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !18, line: 176, size: 5632, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !238, !242, !243, !244, !245, !249, !250, !264, !265, !266, !267, !268, !296, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !193, file: !18, line: 179, baseType: !7, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !193, file: !18, line: 180, baseType: !145, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !193, file: !18, line: 181, baseType: !145, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !193, file: !18, line: 182, baseType: !145, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !193, file: !18, line: 183, baseType: !145, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !193, file: !18, line: 186, baseType: !145, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !193, file: !18, line: 187, baseType: !145, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !193, file: !18, line: 188, baseType: !145, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !193, file: !18, line: 189, baseType: !145, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !193, file: !18, line: 190, baseType: !145, size: 32, offset: 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !193, file: !18, line: 198, baseType: !145, size: 32, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !193, file: !18, line: 215, baseType: !207, size: 288, offset: 352)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !193, file: !18, line: 200, size: 288, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !207, file: !18, line: 203, baseType: !145, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !207, file: !18, line: 204, baseType: !145, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !207, file: !18, line: 206, baseType: !145, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !207, file: !18, line: 209, baseType: !145, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !207, file: !18, line: 210, baseType: !145, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !207, file: !18, line: 211, baseType: !145, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !207, file: !18, line: 212, baseType: !145, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !207, file: !18, line: 213, baseType: !145, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !207, file: !18, line: 214, baseType: !145, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !193, file: !18, line: 218, baseType: !145, size: 32, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !193, file: !18, line: 219, baseType: !145, size: 32, offset: 672)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !193, file: !18, line: 220, baseType: !145, size: 32, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !193, file: !18, line: 221, baseType: !145, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !193, file: !18, line: 222, baseType: !145, size: 32, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !193, file: !18, line: 224, baseType: !145, size: 32, offset: 800)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !193, file: !18, line: 225, baseType: !145, size: 32, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !193, file: !18, line: 226, baseType: !145, size: 32, offset: 864)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !193, file: !18, line: 227, baseType: !145, size: 32, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !193, file: !18, line: 229, baseType: !145, size: 32, offset: 928)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !193, file: !18, line: 230, baseType: !145, size: 32, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !193, file: !18, line: 231, baseType: !145, size: 32, offset: 992)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !193, file: !18, line: 233, baseType: !145, size: 32, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !193, file: !18, line: 234, baseType: !145, size: 32, offset: 1056)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !193, file: !18, line: 236, baseType: !145, size: 32, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !193, file: !18, line: 237, baseType: !145, size: 32, offset: 1120)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !193, file: !18, line: 239, baseType: !145, size: 32, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !193, file: !18, line: 240, baseType: !236, size: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !193, file: !18, line: 241, baseType: !239, size: 128, offset: 1280)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !193, file: !18, line: 242, baseType: !239, size: 128, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !193, file: !18, line: 243, baseType: !239, size: 128, offset: 1536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !193, file: !18, line: 244, baseType: !239, size: 128, offset: 1664)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !193, file: !18, line: 245, baseType: !246, size: 512, offset: 1792)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 512, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !193, file: !18, line: 246, baseType: !246, size: 512, offset: 2304)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !193, file: !18, line: 249, baseType: !251, size: 64, offset: 2816)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !146, !145, !254, !256}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !258)
!258 = !{!259, !261, !262, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !257, file: !260, baseType: !7, size: 32)
!260 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/encoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!261 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !257, file: !260, baseType: !7, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !257, file: !260, baseType: !146, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !257, file: !260, baseType: !146, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !193, file: !18, line: 250, baseType: !146, size: 64, offset: 2880)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !193, file: !18, line: 251, baseType: !145, size: 32, offset: 2944)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !193, file: !18, line: 252, baseType: !145, size: 32, offset: 2976)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !193, file: !18, line: 253, baseType: !236, size: 64, offset: 3008)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !193, file: !18, line: 287, baseType: !269, size: 800, offset: 3072)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !193, file: !18, line: 256, size: 800, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !294, !295}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !269, file: !18, line: 258, baseType: !7, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !269, file: !18, line: 259, baseType: !7, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !269, file: !18, line: 261, baseType: !145, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !269, file: !18, line: 262, baseType: !145, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !269, file: !18, line: 263, baseType: !145, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !269, file: !18, line: 264, baseType: !145, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !269, file: !18, line: 265, baseType: !145, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !269, file: !18, line: 267, baseType: !145, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !269, file: !18, line: 268, baseType: !145, size: 32, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !269, file: !18, line: 269, baseType: !145, size: 32, offset: 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !269, file: !18, line: 270, baseType: !145, size: 32, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !269, file: !18, line: 271, baseType: !145, size: 32, offset: 352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !269, file: !18, line: 272, baseType: !145, size: 32, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !269, file: !18, line: 273, baseType: !145, size: 32, offset: 416)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !269, file: !18, line: 274, baseType: !145, size: 32, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !269, file: !18, line: 275, baseType: !145, size: 32, offset: 480)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !269, file: !18, line: 276, baseType: !145, size: 32, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !269, file: !18, line: 277, baseType: !145, size: 32, offset: 544)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !269, file: !18, line: 278, baseType: !147, size: 32, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !269, file: !18, line: 279, baseType: !147, size: 32, offset: 608)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !269, file: !18, line: 280, baseType: !145, size: 32, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !269, file: !18, line: 283, baseType: !293, size: 64, offset: 672)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 64, elements: !170)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !269, file: !18, line: 285, baseType: !145, size: 32, offset: 736)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !269, file: !18, line: 286, baseType: !145, size: 32, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !193, file: !18, line: 327, baseType: !297, size: 1152, offset: 3904)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !193, file: !18, line: 290, size: 1152, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !336, !337}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !297, file: !18, line: 292, baseType: !145, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !297, file: !18, line: 294, baseType: !145, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !297, file: !18, line: 295, baseType: !145, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !297, file: !18, line: 296, baseType: !145, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !297, file: !18, line: 297, baseType: !145, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !297, file: !18, line: 299, baseType: !145, size: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !297, file: !18, line: 300, baseType: !147, size: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !297, file: !18, line: 301, baseType: !147, size: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !297, file: !18, line: 302, baseType: !147, size: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !297, file: !18, line: 303, baseType: !145, size: 32, offset: 288)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !297, file: !18, line: 304, baseType: !145, size: 32, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !297, file: !18, line: 305, baseType: !147, size: 32, offset: 352)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !297, file: !18, line: 306, baseType: !147, size: 32, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !297, file: !18, line: 307, baseType: !147, size: 32, offset: 416)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !297, file: !18, line: 309, baseType: !145, size: 32, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !297, file: !18, line: 310, baseType: !147, size: 32, offset: 480)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !297, file: !18, line: 311, baseType: !145, size: 32, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !297, file: !18, line: 312, baseType: !145, size: 32, offset: 544)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !297, file: !18, line: 315, baseType: !145, size: 32, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !297, file: !18, line: 316, baseType: !236, size: 64, offset: 640)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !297, file: !18, line: 317, baseType: !145, size: 32, offset: 704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !297, file: !18, line: 318, baseType: !236, size: 64, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !297, file: !18, line: 321, baseType: !147, size: 32, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !297, file: !18, line: 322, baseType: !147, size: 32, offset: 864)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !297, file: !18, line: 323, baseType: !147, size: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !297, file: !18, line: 324, baseType: !325, size: 64, offset: 960)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !18, line: 174, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 167, size: 256, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !327, file: !18, line: 169, baseType: !145, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !327, file: !18, line: 169, baseType: !145, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !327, file: !18, line: 170, baseType: !145, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !327, file: !18, line: 171, baseType: !145, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !327, file: !18, line: 172, baseType: !147, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !327, file: !18, line: 173, baseType: !335, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !297, file: !18, line: 325, baseType: !145, size: 32, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !297, file: !18, line: 326, baseType: !236, size: 64, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !193, file: !18, line: 330, baseType: !145, size: 32, offset: 5056)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !193, file: !18, line: 331, baseType: !145, size: 32, offset: 5088)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !193, file: !18, line: 332, baseType: !145, size: 32, offset: 5120)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !193, file: !18, line: 334, baseType: !145, size: 32, offset: 5152)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !193, file: !18, line: 335, baseType: !145, size: 32, offset: 5184)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !193, file: !18, line: 336, baseType: !163, size: 32, offset: 5216)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !193, file: !18, line: 337, baseType: !163, size: 32, offset: 5248)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !193, file: !18, line: 338, baseType: !163, size: 32, offset: 5280)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !193, file: !18, line: 339, baseType: !163, size: 32, offset: 5312)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !193, file: !18, line: 340, baseType: !145, size: 32, offset: 5344)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !193, file: !18, line: 344, baseType: !145, size: 32, offset: 5376)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !193, file: !18, line: 356, baseType: !145, size: 32, offset: 5408)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !193, file: !18, line: 364, baseType: !145, size: 32, offset: 5440)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !193, file: !18, line: 367, baseType: !145, size: 32, offset: 5472)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !193, file: !18, line: 368, baseType: !145, size: 32, offset: 5504)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !193, file: !18, line: 369, baseType: !145, size: 32, offset: 5536)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !193, file: !18, line: 375, baseType: !355, size: 64, offset: 5568)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !146}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !189, file: !48, line: 386, baseType: !359, size: 8256, offset: 5632)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 8256, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 129)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !189, file: !48, line: 387, baseType: !145, size: 32, offset: 13888)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !189, file: !48, line: 388, baseType: !145, size: 32, offset: 13920)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !189, file: !48, line: 389, baseType: !145, size: 32, offset: 13952)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !189, file: !48, line: 390, baseType: !145, size: 32, offset: 13984)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !189, file: !48, line: 391, baseType: !145, size: 32, offset: 14016)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !189, file: !48, line: 402, baseType: !368, size: 576, offset: 14080)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !48, line: 394, size: 576, elements: !369)
!369 = !{!370, !371, !372, !381, !382, !383}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !368, file: !48, line: 396, baseType: !145, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !368, file: !48, line: 397, baseType: !145, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !368, file: !48, line: 398, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !18, line: 604, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 593, size: 192, elements: !376)
!376 = !{!377, !378, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !375, file: !18, line: 595, baseType: !145, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !375, file: !18, line: 596, baseType: !145, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !375, file: !18, line: 599, baseType: !145, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !375, file: !18, line: 603, baseType: !152, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !368, file: !48, line: 399, baseType: !145, size: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !368, file: !48, line: 400, baseType: !152, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !368, file: !48, line: 401, baseType: !384, size: 320, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !385, line: 56, baseType: !386)
!385 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !385, line: 47, size: 320, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !386, file: !385, line: 49, baseType: !152, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !386, file: !385, line: 50, baseType: !152, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !386, file: !385, line: 51, baseType: !152, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !386, file: !385, line: 53, baseType: !148, size: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !386, file: !385, line: 54, baseType: !145, size: 32, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !386, file: !385, line: 55, baseType: !145, size: 32, offset: 288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !189, file: !48, line: 404, baseType: !152, size: 64, offset: 14656)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !189, file: !48, line: 405, baseType: !145, size: 32, offset: 14720)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !189, file: !48, line: 410, baseType: !145, size: 32, offset: 14752)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !189, file: !48, line: 411, baseType: !145, size: 32, offset: 14784)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !189, file: !48, line: 413, baseType: !145, size: 32, offset: 14816)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !189, file: !48, line: 415, baseType: !145, size: 32, offset: 14848)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !189, file: !48, line: 416, baseType: !145, size: 32, offset: 14880)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !189, file: !48, line: 418, baseType: !145, size: 32, offset: 14912)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !189, file: !48, line: 419, baseType: !145, size: 32, offset: 14944)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !189, file: !48, line: 420, baseType: !145, size: 32, offset: 14976)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !189, file: !48, line: 421, baseType: !145, size: 32, offset: 15008)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !189, file: !48, line: 422, baseType: !145, size: 32, offset: 15040)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !189, file: !48, line: 424, baseType: !145, size: 32, offset: 15072)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !189, file: !48, line: 425, baseType: !145, size: 32, offset: 15104)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !189, file: !48, line: 427, baseType: !145, size: 32, offset: 15136)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !189, file: !48, line: 430, baseType: !410, size: 10400, offset: 15168)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 10400, elements: !496)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !6, line: 154, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 52, size: 10400, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !431, !432, !433, !434, !435, !436, !437, !438, !439, !446, !447, !495}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !412, file: !6, line: 54, baseType: !145, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !412, file: !6, line: 56, baseType: !145, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !412, file: !6, line: 57, baseType: !145, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !412, file: !6, line: 59, baseType: !145, size: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !412, file: !6, line: 60, baseType: !145, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !412, file: !6, line: 61, baseType: !145, size: 32, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !412, file: !6, line: 63, baseType: !145, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !412, file: !6, line: 65, baseType: !145, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !412, file: !6, line: 67, baseType: !145, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !412, file: !6, line: 69, baseType: !145, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !412, file: !6, line: 70, baseType: !145, size: 32, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !412, file: !6, line: 71, baseType: !145, size: 32, offset: 352)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !412, file: !6, line: 72, baseType: !145, size: 32, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !412, file: !6, line: 73, baseType: !428, size: 8192, offset: 416)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8192, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !412, file: !6, line: 75, baseType: !145, size: 32, offset: 8608)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !412, file: !6, line: 76, baseType: !145, size: 32, offset: 8640)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !412, file: !6, line: 77, baseType: !145, size: 32, offset: 8672)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !412, file: !6, line: 78, baseType: !145, size: 32, offset: 8704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !412, file: !6, line: 79, baseType: !145, size: 32, offset: 8736)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !412, file: !6, line: 80, baseType: !145, size: 32, offset: 8768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !412, file: !6, line: 81, baseType: !145, size: 32, offset: 8800)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !412, file: !6, line: 83, baseType: !145, size: 32, offset: 8832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !412, file: !6, line: 90, baseType: !440, size: 128, offset: 8864)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !412, file: !6, line: 84, size: 128, elements: !441)
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !440, file: !6, line: 86, baseType: !145, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !440, file: !6, line: 87, baseType: !145, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !440, file: !6, line: 88, baseType: !145, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !440, file: !6, line: 89, baseType: !145, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !412, file: !6, line: 92, baseType: !145, size: 32, offset: 8992)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !412, file: !6, line: 150, baseType: !448, size: 1344, offset: 9024)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !412, file: !6, line: 93, size: 1344, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !448, file: !6, line: 95, baseType: !145, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !448, file: !6, line: 96, baseType: !145, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !448, file: !6, line: 97, baseType: !145, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !448, file: !6, line: 99, baseType: !145, size: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !448, file: !6, line: 100, baseType: !145, size: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !448, file: !6, line: 102, baseType: !145, size: 32, offset: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !448, file: !6, line: 103, baseType: !145, size: 32, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !448, file: !6, line: 104, baseType: !145, size: 32, offset: 224)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !448, file: !6, line: 105, baseType: !145, size: 32, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !448, file: !6, line: 106, baseType: !145, size: 32, offset: 288)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !448, file: !6, line: 107, baseType: !145, size: 32, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !448, file: !6, line: 108, baseType: !145, size: 32, offset: 352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !448, file: !6, line: 110, baseType: !145, size: 32, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !448, file: !6, line: 111, baseType: !145, size: 32, offset: 416)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !448, file: !6, line: 112, baseType: !145, size: 32, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !448, file: !6, line: 114, baseType: !145, size: 32, offset: 480)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !448, file: !6, line: 115, baseType: !163, size: 32, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !448, file: !6, line: 116, baseType: !163, size: 32, offset: 544)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !448, file: !6, line: 117, baseType: !145, size: 32, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !448, file: !6, line: 119, baseType: !145, size: 32, offset: 608)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !448, file: !6, line: 120, baseType: !145, size: 32, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !448, file: !6, line: 137, baseType: !472, size: 384, offset: 672)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !448, file: !6, line: 122, size: 384, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !472, file: !6, line: 124, baseType: !145, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !472, file: !6, line: 125, baseType: !145, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !472, file: !6, line: 126, baseType: !145, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !472, file: !6, line: 127, baseType: !145, size: 32, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !472, file: !6, line: 128, baseType: !145, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !472, file: !6, line: 129, baseType: !145, size: 32, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !472, file: !6, line: 130, baseType: !145, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !472, file: !6, line: 131, baseType: !145, size: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !472, file: !6, line: 133, baseType: !145, size: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !472, file: !6, line: 134, baseType: !145, size: 32, offset: 288)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !472, file: !6, line: 135, baseType: !145, size: 32, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !472, file: !6, line: 136, baseType: !145, size: 32, offset: 352)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !448, file: !6, line: 139, baseType: !145, size: 32, offset: 1056)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !448, file: !6, line: 140, baseType: !145, size: 32, offset: 1088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !448, file: !6, line: 141, baseType: !145, size: 32, offset: 1120)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !448, file: !6, line: 142, baseType: !145, size: 32, offset: 1152)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !448, file: !6, line: 143, baseType: !145, size: 32, offset: 1184)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !448, file: !6, line: 144, baseType: !145, size: 32, offset: 1216)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !448, file: !6, line: 145, baseType: !145, size: 32, offset: 1248)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !448, file: !6, line: 146, baseType: !145, size: 32, offset: 1280)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !448, file: !6, line: 147, baseType: !145, size: 32, offset: 1312)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !412, file: !6, line: 152, baseType: !145, size: 32, offset: 10368)
!496 = !{!497}
!497 = !DISubrange(count: 1)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !189, file: !48, line: 431, baseType: !499, size: 64, offset: 25600)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !189, file: !48, line: 432, baseType: !501, size: 960, offset: 25664)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 960, elements: !496)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !6, line: 186, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 156, size: 960, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !503, file: !6, line: 158, baseType: !145, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !503, file: !6, line: 159, baseType: !145, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !503, file: !6, line: 161, baseType: !145, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !503, file: !6, line: 163, baseType: !145, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !503, file: !6, line: 164, baseType: !145, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !503, file: !6, line: 166, baseType: !145, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !503, file: !6, line: 167, baseType: !145, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !503, file: !6, line: 169, baseType: !145, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !503, file: !6, line: 170, baseType: !145, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !503, file: !6, line: 172, baseType: !145, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !503, file: !6, line: 173, baseType: !145, size: 32, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !503, file: !6, line: 175, baseType: !145, size: 32, offset: 352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !503, file: !6, line: 177, baseType: !145, size: 32, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !503, file: !6, line: 178, baseType: !145, size: 32, offset: 416)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !503, file: !6, line: 179, baseType: !145, size: 32, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !503, file: !6, line: 181, baseType: !145, size: 32, offset: 480)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !503, file: !6, line: 183, baseType: !145, size: 32, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !503, file: !6, line: 184, baseType: !523, size: 384, offset: 576)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 384, elements: !526)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!526 = !{!527}
!527 = !DISubrange(count: 6)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !189, file: !48, line: 433, baseType: !529, size: 64, offset: 26624)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !189, file: !48, line: 434, baseType: !145, size: 32, offset: 26688)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !189, file: !48, line: 437, baseType: !145, size: 32, offset: 26720)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !189, file: !48, line: 440, baseType: !533, size: 256, offset: 26752)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 256, elements: !174)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 512, elements: !240)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !189, file: !48, line: 441, baseType: !537, size: 128, offset: 27008)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 128, elements: !170)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 2048, elements: !247)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !189, file: !48, line: 443, baseType: !533, size: 256, offset: 27136)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !189, file: !48, line: 444, baseType: !537, size: 128, offset: 27392)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !189, file: !48, line: 446, baseType: !543, size: 256, offset: 27520)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 256, elements: !174)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 256, elements: !240)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !189, file: !48, line: 447, baseType: !547, size: 128, offset: 27776)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 128, elements: !170)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1024, elements: !247)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !189, file: !48, line: 448, baseType: !543, size: 256, offset: 27904)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !189, file: !48, line: 449, baseType: !547, size: 128, offset: 28160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !189, file: !48, line: 454, baseType: !553, size: 5888, offset: 28288)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 5888, elements: !555)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!555 = !{!556}
!556 = !DISubrange(count: 92)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !189, file: !48, line: 455, baseType: !558, size: 23552, offset: 34176)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 23552, elements: !559)
!559 = !{!556, !175}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !189, file: !48, line: 457, baseType: !524, size: 64, offset: 57728)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !189, file: !48, line: 460, baseType: !562, size: 53376, offset: 57856)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !48, line: 364, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 302, size: 53376, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !593, !624, !625, !626, !632, !633, !634, !635, !636, !637, !638, !639}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !563, file: !48, line: 304, baseType: !499, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !563, file: !48, line: 305, baseType: !529, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !563, file: !48, line: 307, baseType: !145, size: 32, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !563, file: !48, line: 308, baseType: !145, size: 32, offset: 160)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !563, file: !48, line: 309, baseType: !145, size: 32, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !563, file: !48, line: 311, baseType: !145, size: 32, offset: 224)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !563, file: !48, line: 313, baseType: !145, size: 32, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !563, file: !48, line: 315, baseType: !145, size: 32, offset: 288)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !563, file: !48, line: 316, baseType: !145, size: 32, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !563, file: !48, line: 317, baseType: !145, size: 32, offset: 352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !563, file: !48, line: 319, baseType: !145, size: 32, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !563, file: !48, line: 321, baseType: !145, size: 32, offset: 416)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !563, file: !48, line: 322, baseType: !145, size: 32, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !563, file: !48, line: 324, baseType: !293, size: 64, offset: 480)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !563, file: !48, line: 325, baseType: !145, size: 32, offset: 544)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !563, file: !48, line: 327, baseType: !145, size: 32, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !563, file: !48, line: 329, baseType: !145, size: 32, offset: 608)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !563, file: !48, line: 330, baseType: !145, size: 32, offset: 640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !563, file: !48, line: 331, baseType: !145, size: 32, offset: 672)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !563, file: !48, line: 333, baseType: !145, size: 32, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !563, file: !48, line: 334, baseType: !145, size: 32, offset: 736)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !563, file: !48, line: 339, baseType: !587, size: 2048, offset: 768)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 2048, elements: !592)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !563, file: !48, line: 335, size: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !588, file: !48, line: 337, baseType: !145, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !588, file: !48, line: 338, baseType: !145, size: 32, offset: 32)
!592 = !{!171, !241}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !563, file: !48, line: 342, baseType: !594, size: 49152, align: 128, offset: 2816)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 49152, align: 128, elements: !621)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !596, line: 36, baseType: !597, align: 128)
!596 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !596, line: 26, size: 512, elements: !598)
!598 = !{!599, !607, !608, !611, !612, !613}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !597, file: !596, line: 30, baseType: !600, size: 128, align: 128)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 128, elements: !605)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !602, line: 25, baseType: !603)
!602 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !156, line: 39, baseType: !604)
!604 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!605 = !{!606}
!606 = !DISubrange(count: 8)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !597, file: !596, line: 31, baseType: !600, size: 128, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !597, file: !596, line: 32, baseType: !609, size: 32, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !602, line: 26, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !156, line: 41, baseType: !145)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !597, file: !596, line: 33, baseType: !609, size: 32, offset: 288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !597, file: !596, line: 34, baseType: !609, size: 32, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !597, file: !596, line: 35, baseType: !614, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !596, line: 25, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !152, !145, !152, !145, !619, !145}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!621 = !{!622, !623}
!622 = !DISubrange(count: 32)
!623 = !DISubrange(count: 3)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !563, file: !48, line: 344, baseType: !145, size: 32, offset: 51968)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !563, file: !48, line: 345, baseType: !145, size: 32, offset: 52000)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !563, file: !48, line: 350, baseType: !627, size: 1024, offset: 52032)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 1024, elements: !240)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !563, file: !48, line: 346, size: 64, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !628, file: !48, line: 348, baseType: !145, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !628, file: !48, line: 349, baseType: !145, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !563, file: !48, line: 352, baseType: !145, size: 32, offset: 53056)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !563, file: !48, line: 354, baseType: !145, size: 32, offset: 53088)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !563, file: !48, line: 355, baseType: !145, size: 32, offset: 53120)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !563, file: !48, line: 356, baseType: !145, size: 32, offset: 53152)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !563, file: !48, line: 357, baseType: !145, size: 32, offset: 53184)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !563, file: !48, line: 360, baseType: !145, size: 32, offset: 53216)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !563, file: !48, line: 361, baseType: !145, size: 32, offset: 53248)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !563, file: !48, line: 362, baseType: !145, size: 32, offset: 53280)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !189, file: !48, line: 463, baseType: !641, size: 4096, offset: 111232)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !642, line: 46, baseType: !643)
!642 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !642, line: 27, size: 4096, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !643, file: !642, line: 30, baseType: !145, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !643, file: !642, line: 31, baseType: !145, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !643, file: !642, line: 34, baseType: !145, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !643, file: !642, line: 35, baseType: !145, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !643, file: !642, line: 37, baseType: !152, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !643, file: !642, line: 38, baseType: !152, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !643, file: !642, line: 39, baseType: !152, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !643, file: !642, line: 42, baseType: !145, size: 32, align: 128, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !643, file: !642, line: 45, baseType: !654, size: 3680, offset: 416)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 3680, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 460)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !189, file: !48, line: 494, baseType: !658, size: 2112, offset: 115328)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !48, line: 465, size: 2112, elements: !659)
!659 = !{!660, !796, !798, !799, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !812, !813, !814, !815}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !658, file: !48, line: 468, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !664, line: 146, baseType: !665)
!664 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !664, line: 31, size: 125056, elements: !666)
!666 = !{!667, !668, !669, !670, !673, !674, !675, !676, !677, !678, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !697, !698, !699, !700, !701, !702, !704, !706, !707, !708, !709, !710, !713, !715, !716, !718, !723, !724, !728, !729, !733, !737, !739, !741, !742, !744, !745, !747, !748, !749, !752, !754, !755, !756, !758, !759, !760, !761, !762, !763, !764, !765, !767, !768, !769, !777, !781, !783, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !665, file: !664, line: 34, baseType: !145, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !665, file: !664, line: 35, baseType: !145, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !665, file: !664, line: 36, baseType: !145, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !665, file: !664, line: 37, baseType: !671, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !602, line: 27, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !156, line: 44, baseType: !150)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !665, file: !664, line: 38, baseType: !671, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !665, file: !664, line: 39, baseType: !145, size: 32, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !665, file: !664, line: 40, baseType: !145, size: 32, offset: 288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !665, file: !664, line: 41, baseType: !145, size: 32, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !665, file: !664, line: 42, baseType: !145, size: 32, offset: 352)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !665, file: !664, line: 43, baseType: !679, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !665, file: !664, line: 45, baseType: !145, size: 32, offset: 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !665, file: !664, line: 46, baseType: !145, size: 32, offset: 480)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !665, file: !664, line: 47, baseType: !145, size: 32, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !665, file: !664, line: 48, baseType: !145, size: 32, offset: 544)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !665, file: !664, line: 49, baseType: !145, size: 32, offset: 576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !665, file: !664, line: 50, baseType: !145, size: 32, offset: 608)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !665, file: !664, line: 51, baseType: !145, size: 32, offset: 640)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !665, file: !664, line: 52, baseType: !153, size: 8, offset: 672)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !665, file: !664, line: 53, baseType: !153, size: 8, offset: 680)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !665, file: !664, line: 54, baseType: !153, size: 8, offset: 688)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !665, file: !664, line: 55, baseType: !147, size: 32, offset: 704)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !665, file: !664, line: 56, baseType: !147, size: 32, offset: 736)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !665, file: !664, line: 57, baseType: !145, size: 32, offset: 768)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !665, file: !664, line: 60, baseType: !145, size: 32, offset: 800)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !665, file: !664, line: 61, baseType: !695, size: 96, offset: 832)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 96, elements: !696)
!696 = !{!623}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !665, file: !664, line: 62, baseType: !695, size: 96, offset: 928)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !665, file: !664, line: 63, baseType: !695, size: 96, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !665, file: !664, line: 64, baseType: !145, size: 32, offset: 1120)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !665, file: !664, line: 65, baseType: !145, size: 32, offset: 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !665, file: !664, line: 66, baseType: !145, size: 32, offset: 1184)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !665, file: !664, line: 67, baseType: !703, size: 192, offset: 1216)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 192, elements: !696)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !665, file: !664, line: 68, baseType: !705, size: 256, offset: 1408)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 256, elements: !174)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !665, file: !664, line: 69, baseType: !705, size: 256, offset: 1664)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !665, file: !664, line: 70, baseType: !554, size: 64, offset: 1920)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !665, file: !664, line: 74, baseType: !705, size: 256, offset: 1984)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !665, file: !664, line: 75, baseType: !705, size: 256, offset: 2240)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !665, file: !664, line: 77, baseType: !711, size: 24576, align: 128, offset: 2560)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 24576, align: 128, elements: !712)
!712 = !{!241, !623}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !665, file: !664, line: 78, baseType: !714, size: 1024, offset: 27136)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 1024, elements: !240)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !665, file: !664, line: 79, baseType: !145, size: 32, offset: 28160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !665, file: !664, line: 80, baseType: !717, size: 64, offset: 28224)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !665, file: !664, line: 83, baseType: !719, size: 64, offset: 28288)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !602, line: 24, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !156, line: 37, baseType: !722)
!722 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !665, file: !664, line: 84, baseType: !152, size: 64, offset: 28352)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !665, file: !664, line: 85, baseType: !725, size: 128, offset: 28416)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 128, elements: !170)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 32, elements: !170)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !665, file: !664, line: 86, baseType: !726, size: 64, offset: 28544)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !665, file: !664, line: 87, baseType: !730, size: 2176, offset: 28608)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 2176, elements: !731)
!731 = !{!171, !732}
!732 = !DISubrange(count: 17)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !665, file: !664, line: 92, baseType: !734, size: 20736, offset: 30784)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 20736, elements: !735)
!735 = !{!736, !736}
!736 = !DISubrange(count: 18)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !665, file: !664, line: 96, baseType: !738, size: 2176, offset: 51520)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 2176, elements: !731)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !665, file: !664, line: 97, baseType: !740, size: 128, offset: 53696)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 128, elements: !170)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !665, file: !664, line: 98, baseType: !293, size: 64, offset: 53824)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !665, file: !664, line: 99, baseType: !743, size: 1024, offset: 53888)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 1024, elements: !592)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !665, file: !664, line: 100, baseType: !727, size: 32, offset: 54912)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !665, file: !664, line: 105, baseType: !746, size: 10368, offset: 54944)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 10368, elements: !735)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !665, file: !664, line: 106, baseType: !746, size: 10368, offset: 65312)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !665, file: !664, line: 107, baseType: !145, size: 32, offset: 75680)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !665, file: !664, line: 108, baseType: !750, size: 576, offset: 75712)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 576, elements: !751)
!751 = !{!736}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !665, file: !664, line: 109, baseType: !753, size: 20736, offset: 76288)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 20736, elements: !735)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !665, file: !664, line: 110, baseType: !179, size: 64, offset: 97024)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !665, file: !664, line: 111, baseType: !179, size: 64, offset: 97088)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !665, file: !664, line: 112, baseType: !757, size: 64, offset: 97152)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !665, file: !664, line: 113, baseType: !757, size: 64, offset: 97216)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !665, file: !664, line: 114, baseType: !757, size: 64, offset: 97280)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !665, file: !664, line: 115, baseType: !145, size: 32, offset: 97344)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !665, file: !664, line: 116, baseType: !554, size: 64, offset: 97408)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !665, file: !664, line: 117, baseType: !554, size: 64, offset: 97472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !665, file: !664, line: 118, baseType: !554, size: 64, offset: 97536)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !665, file: !664, line: 119, baseType: !145, size: 32, offset: 97600)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !665, file: !664, line: 120, baseType: !766, size: 576, offset: 97632)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 576, elements: !751)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !665, file: !664, line: 121, baseType: !163, size: 32, offset: 98208)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !665, file: !664, line: 122, baseType: !176, size: 64, offset: 98240)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !665, file: !664, line: 125, baseType: !770, size: 256, offset: 98304)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !18, line: 503, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 496, size: 256, elements: !772)
!772 = !{!773, !774, !775, !776}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !771, file: !18, line: 498, baseType: !151, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !771, file: !18, line: 499, baseType: !151, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !771, file: !18, line: 500, baseType: !151, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !771, file: !18, line: 502, baseType: !151, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !665, file: !664, line: 128, baseType: !778, size: 2008, offset: 98560)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 2008, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 251)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !665, file: !664, line: 129, baseType: !782, size: 8032, offset: 100576)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8032, elements: !779)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !665, file: !664, line: 130, baseType: !784, size: 16064, offset: 108608)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 16064, elements: !779)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !665, file: !664, line: 131, baseType: !145, size: 32, offset: 124672)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !665, file: !664, line: 132, baseType: !145, size: 32, offset: 124704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !665, file: !664, line: 135, baseType: !145, size: 32, offset: 124736)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !665, file: !664, line: 136, baseType: !145, size: 32, offset: 124768)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !665, file: !664, line: 137, baseType: !145, size: 32, offset: 124800)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !665, file: !664, line: 138, baseType: !145, size: 32, offset: 124832)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !665, file: !664, line: 139, baseType: !145, size: 32, offset: 124864)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !665, file: !664, line: 142, baseType: !147, size: 32, offset: 124896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !665, file: !664, line: 143, baseType: !145, size: 32, offset: 124928)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !665, file: !664, line: 144, baseType: !145, size: 32, offset: 124960)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !665, file: !664, line: 145, baseType: !145, size: 32, offset: 124992)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !658, file: !48, line: 470, baseType: !797, size: 128, offset: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 128, elements: !170)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !658, file: !48, line: 473, baseType: !661, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !658, file: !48, line: 476, baseType: !800, size: 1152, offset: 256)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 1152, elements: !751)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !658, file: !48, line: 478, baseType: !145, size: 32, offset: 1408)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !658, file: !48, line: 480, baseType: !145, size: 32, offset: 1440)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !658, file: !48, line: 482, baseType: !145, size: 32, offset: 1472)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !658, file: !48, line: 483, baseType: !145, size: 32, offset: 1504)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !658, file: !48, line: 484, baseType: !145, size: 32, offset: 1536)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !658, file: !48, line: 485, baseType: !145, size: 32, offset: 1568)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !658, file: !48, line: 486, baseType: !145, size: 32, offset: 1600)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !658, file: !48, line: 487, baseType: !671, size: 64, offset: 1664)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !658, file: !48, line: 488, baseType: !671, size: 64, offset: 1728)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !658, file: !48, line: 489, baseType: !811, size: 128, offset: 1792)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 128, elements: !170)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !658, file: !48, line: 490, baseType: !671, size: 64, offset: 1920)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !658, file: !48, line: 491, baseType: !671, size: 64, offset: 1984)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !658, file: !48, line: 492, baseType: !145, size: 32, offset: 2048)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !658, file: !48, line: 493, baseType: !145, size: 32, offset: 2080)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !189, file: !48, line: 497, baseType: !662, size: 64, offset: 117440)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !189, file: !48, line: 500, baseType: !662, size: 64, offset: 117504)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !189, file: !48, line: 503, baseType: !145, size: 32, offset: 117568)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !189, file: !48, line: 504, baseType: !820, size: 1216, offset: 117632)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 1216, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 19)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !189, file: !48, line: 505, baseType: !145, size: 32, offset: 118848)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !189, file: !48, line: 506, baseType: !820, size: 1216, offset: 118912)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !189, file: !48, line: 507, baseType: !293, size: 64, offset: 120128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !189, file: !48, line: 510, baseType: !145, size: 32, offset: 120192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !189, file: !48, line: 511, baseType: !145, size: 32, offset: 120224)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !189, file: !48, line: 512, baseType: !671, size: 64, offset: 120256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !189, file: !48, line: 522, baseType: !830, size: 10624, offset: 120320)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !48, line: 515, size: 10624, elements: !831)
!831 = !{!832, !834, !837, !840}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !830, file: !48, line: 517, baseType: !833, size: 256, align: 128)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 256, elements: !240)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !830, file: !48, line: 518, baseType: !835, size: 128, align: 128, offset: 256)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 128, elements: !836)
!836 = !{!171, !175}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !830, file: !48, line: 520, baseType: !838, size: 4096, align: 128, offset: 384)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 4096, elements: !839)
!839 = !{!175, !248}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !830, file: !48, line: 521, baseType: !841, size: 6144, align: 128, offset: 4480)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 6144, elements: !842)
!842 = !{!843, !241}
!843 = !DISubrange(count: 24)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !189, file: !48, line: 732, baseType: !845, size: 82688, offset: 130944)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !48, line: 525, size: 82688, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !874, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !892, !895, !899, !900, !901, !906, !907, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !975, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1017, !1018, !1019, !1022, !1025, !1027, !1030, !1032, !1033}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !845, file: !48, line: 527, baseType: !145, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !845, file: !48, line: 530, baseType: !145, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !845, file: !48, line: 531, baseType: !145, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !845, file: !48, line: 532, baseType: !145, size: 32, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !845, file: !48, line: 535, baseType: !145, size: 32, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !845, file: !48, line: 536, baseType: !145, size: 32, offset: 160)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !845, file: !48, line: 537, baseType: !145, size: 32, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !845, file: !48, line: 538, baseType: !145, size: 32, offset: 224)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !845, file: !48, line: 539, baseType: !145, size: 32, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !845, file: !48, line: 542, baseType: !145, size: 32, offset: 288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !845, file: !48, line: 543, baseType: !145, size: 32, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !845, file: !48, line: 544, baseType: !145, size: 32, offset: 352)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !845, file: !48, line: 545, baseType: !145, size: 32, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !845, file: !48, line: 546, baseType: !145, size: 32, offset: 416)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !845, file: !48, line: 547, baseType: !145, size: 32, offset: 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !845, file: !48, line: 548, baseType: !145, size: 32, offset: 480)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !845, file: !48, line: 549, baseType: !145, size: 32, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !845, file: !48, line: 551, baseType: !145, size: 32, offset: 544)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !845, file: !48, line: 554, baseType: !293, size: 64, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !845, file: !48, line: 555, baseType: !293, size: 64, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !845, file: !48, line: 558, baseType: !293, size: 64, offset: 704)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !845, file: !48, line: 559, baseType: !293, size: 64, offset: 768)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !845, file: !48, line: 561, baseType: !293, size: 64, offset: 832)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !845, file: !48, line: 562, baseType: !293, size: 64, offset: 896)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !845, file: !48, line: 565, baseType: !7, size: 32, offset: 960)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !845, file: !48, line: 566, baseType: !873, size: 128, offset: 992)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !174)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !845, file: !48, line: 567, baseType: !875, size: 512, offset: 1120)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !240)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !845, file: !48, line: 568, baseType: !7, size: 32, offset: 1632)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !845, file: !48, line: 569, baseType: !7, size: 32, offset: 1664)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !845, file: !48, line: 570, baseType: !145, size: 32, offset: 1696)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !845, file: !48, line: 571, baseType: !145, size: 32, offset: 1728)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !845, file: !48, line: 572, baseType: !145, size: 32, offset: 1760)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !845, file: !48, line: 573, baseType: !145, size: 32, offset: 1792)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !845, file: !48, line: 574, baseType: !145, size: 32, offset: 1824)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !845, file: !48, line: 575, baseType: !145, size: 32, offset: 1856)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !845, file: !48, line: 576, baseType: !145, size: 32, offset: 1888)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !845, file: !48, line: 577, baseType: !145, size: 32, offset: 1920)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !845, file: !48, line: 578, baseType: !145, size: 32, offset: 1952)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !845, file: !48, line: 585, baseType: !719, size: 64, offset: 1984)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !845, file: !48, line: 586, baseType: !152, size: 64, offset: 2048)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !845, file: !48, line: 587, baseType: !719, size: 64, offset: 2112)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !845, file: !48, line: 588, baseType: !891, size: 64, offset: 2176)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !845, file: !48, line: 589, baseType: !893, size: 64, offset: 2240)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 64, elements: !605)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !845, file: !48, line: 591, baseType: !896, size: 64, offset: 2304)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 192, elements: !898)
!898 = !{!843}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !845, file: !48, line: 592, baseType: !719, size: 64, offset: 2368)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !845, file: !48, line: 593, baseType: !725, size: 128, offset: 2432)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !845, file: !48, line: 594, baseType: !902, size: 128, offset: 2560)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 128, elements: !170)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, elements: !905)
!905 = !{!606, !171}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !845, file: !48, line: 595, baseType: !740, size: 128, offset: 2688)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !845, file: !48, line: 596, baseType: !908, size: 4096, offset: 2816)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 4096, elements: !909)
!909 = !{!171, !622}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !845, file: !48, line: 597, baseType: !719, size: 64, offset: 6912)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !845, file: !48, line: 598, baseType: !719, size: 64, offset: 6976)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !845, file: !48, line: 599, baseType: !554, size: 64, offset: 7040)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !845, file: !48, line: 603, baseType: !714, size: 1024, offset: 7104)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !845, file: !48, line: 606, baseType: !145, size: 32, offset: 8128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !845, file: !48, line: 607, baseType: !145, size: 32, offset: 8160)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !845, file: !48, line: 608, baseType: !173, size: 32, align: 32, offset: 8192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !845, file: !48, line: 609, baseType: !145, size: 32, offset: 8224)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !845, file: !48, line: 611, baseType: !145, size: 32, offset: 8256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !845, file: !48, line: 612, baseType: !145, size: 32, offset: 8288)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !845, file: !48, line: 614, baseType: !145, size: 32, offset: 8320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !845, file: !48, line: 615, baseType: !145, size: 32, offset: 8352)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !845, file: !48, line: 621, baseType: !145, size: 32, offset: 8384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !845, file: !48, line: 624, baseType: !145, size: 32, offset: 8416)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !845, file: !48, line: 626, baseType: !145, size: 32, offset: 8448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !845, file: !48, line: 627, baseType: !145, size: 32, offset: 8480)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !845, file: !48, line: 671, baseType: !927, size: 60672, offset: 8576)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !845, file: !48, line: 629, size: 60672, elements: !928)
!928 = !{!929, !933, !937, !939, !940, !943, !947, !949, !950, !951, !952, !953, !956, !960, !963, !964, !965, !966, !967, !970, !972, !974}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !927, file: !48, line: 634, baseType: !930, size: 3072, align: 128)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 3072, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !927, file: !48, line: 635, baseType: !934, size: 6912, align: 128, offset: 3072)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 6912, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 864)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !927, file: !48, line: 638, baseType: !938, size: 2048, align: 128, offset: 9984)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 2048, elements: !429)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !927, file: !48, line: 639, baseType: !938, size: 2048, align: 128, offset: 12032)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !927, file: !48, line: 640, baseType: !941, size: 3072, align: 128, offset: 14080)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 3072, elements: !942)
!942 = !{!623, !248}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !927, file: !48, line: 641, baseType: !944, size: 3840, align: 128, offset: 17152)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 3840, elements: !945)
!945 = !{!946, !241}
!946 = !DISubrange(count: 15)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !927, file: !48, line: 642, baseType: !948, size: 128, offset: 20992)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, elements: !174)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !927, file: !48, line: 643, baseType: !948, size: 128, offset: 21120)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !927, file: !48, line: 644, baseType: !145, size: 32, offset: 21248)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !927, file: !48, line: 645, baseType: !145, size: 32, offset: 21280)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !927, file: !48, line: 648, baseType: !838, size: 4096, align: 128, offset: 21376)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !927, file: !48, line: 649, baseType: !954, size: 4096, align: 128, offset: 25472)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 4096, elements: !955)
