; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/enhance.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/enhance.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!476 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!477 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!478 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!479 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!480 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!481 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!482 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!483 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!484 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!485 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!486 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!487 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!488 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!489 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!490 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!491 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!492 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!493 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!494 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!495 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!496 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!497 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!498 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!499 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!500 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!501 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!502 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!503 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!504 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!505 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!506 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!507 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!508 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!509 = !DIEnumerator(name: "MagickListOptions", value: 38)
!510 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!511 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!512 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!513 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!514 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!515 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!516 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!517 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!518 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!519 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!520 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!521 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!522 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!523 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!524 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!525 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!526 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!527 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!528 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!529 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!530 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!531 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!532 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!533 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!534 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!535 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!536 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!537 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!538 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!539 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!540 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!541 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!542 = !{!543, !544, !546, !547, !550, !551, !555, !557, !565, !615, !769, !679, !771, !785, !786, !787, !556, !789, !798, !468, !800, !801, !576, !802, !572, !5}
!543 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !545)
!545 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!546 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLTreeInfo", file: !553, line: 29, baseType: !554)
!553 = !DIFile(filename: "apps/538.imagick_r/src/magick/xml-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e544995a74b1ca30ba5edadca4a5927")
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XMLTreeInfo", file: !553, line: 28, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !560)
!560 = !{!561, !562, !563, !564}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !559, file: !326, line: 143, baseType: !544, size: 16)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !559, file: !326, line: 144, baseType: !544, size: 16, offset: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !559, file: !326, line: 145, baseType: !544, size: 16, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !559, file: !326, line: 146, baseType: !544, size: 16, offset: 48)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !568)
!568 = !{!569, !571, !573, !575, !578, !580, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !606, !608, !609, !611, !612, !613, !614, !620, !621, !622, !630, !631, !632, !633, !634, !635, !637, !639, !641, !643, !645, !647, !649, !650, !651, !652, !653, !654, !655, !663, !678, !690, !691, !692, !693, !697, !701, !705, !706, !707, !708, !709, !726, !727, !729, !730, !740, !741, !743, !744, !745, !746, !747, !748, !750, !751, !752, !753, !754, !755, !756, !758, !759, !760, !761, !762, !766, !768}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !567, file: !77, line: 153, baseType: !570, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !567, file: !77, line: 156, baseType: !572, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !567, file: !77, line: 159, baseType: !574, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !567, file: !77, line: 162, baseType: !576, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !577, line: 46, baseType: !546)
!577 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!578 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !567, file: !77, line: 165, baseType: !579, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !567, file: !77, line: 168, baseType: !581, size: 32, offset: 224)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !567, file: !77, line: 169, baseType: !581, size: 32, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !567, file: !77, line: 172, baseType: !576, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !567, file: !77, line: 173, baseType: !576, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !567, file: !77, line: 174, baseType: !576, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !567, file: !77, line: 175, baseType: !576, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !567, file: !77, line: 178, baseType: !557, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !567, file: !77, line: 179, baseType: !558, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !567, file: !77, line: 180, baseType: !558, size: 64, offset: 704)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !567, file: !77, line: 181, baseType: !558, size: 64, offset: 768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !567, file: !77, line: 184, baseType: !543, size: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !567, file: !77, line: 187, baseType: !593, size: 768, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !595)
!595 = !{!596, !603, !604, !605}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !594, file: !77, line: 124, baseType: !597, size: 192)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !598, file: !77, line: 98, baseType: !543, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !598, file: !77, line: 99, baseType: !543, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !598, file: !77, line: 100, baseType: !543, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !594, file: !77, line: 125, baseType: !597, size: 192, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !594, file: !77, line: 126, baseType: !597, size: 192, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !594, file: !77, line: 127, baseType: !597, size: 192, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !567, file: !77, line: 190, baseType: !607, size: 32, offset: 1664)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !567, file: !77, line: 193, baseType: !550, size: 64, offset: 1728)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !567, file: !77, line: 196, baseType: !610, size: 32, offset: 1792)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !567, file: !77, line: 199, baseType: !556, size: 64, offset: 1856)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !567, file: !77, line: 200, baseType: !556, size: 64, offset: 1920)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !567, file: !77, line: 201, baseType: !556, size: 64, offset: 1984)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !567, file: !77, line: 204, baseType: !615, size: 64, offset: 2048)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !616, line: 77, baseType: !617)
!616 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !618, line: 193, baseType: !619)
!618 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!619 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !567, file: !77, line: 207, baseType: !543, size: 64, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !567, file: !77, line: 208, baseType: !543, size: 64, offset: 2176)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !567, file: !77, line: 211, baseType: !623, size: 256, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !624, file: !153, line: 124, baseType: !576, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !624, file: !153, line: 125, baseType: !576, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !624, file: !153, line: 128, baseType: !615, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !624, file: !153, line: 129, baseType: !615, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !567, file: !77, line: 212, baseType: !623, size: 256, offset: 2496)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !567, file: !77, line: 213, baseType: !623, size: 256, offset: 2752)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !567, file: !77, line: 216, baseType: !543, size: 64, offset: 3008)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !567, file: !77, line: 217, baseType: !543, size: 64, offset: 3072)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !567, file: !77, line: 218, baseType: !543, size: 64, offset: 3136)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !567, file: !77, line: 221, baseType: !636, size: 32, offset: 3200)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !567, file: !77, line: 224, baseType: !638, size: 32, offset: 3232)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !567, file: !77, line: 227, baseType: !640, size: 32, offset: 3264)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !567, file: !77, line: 230, baseType: !642, size: 32, offset: 3296)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !567, file: !77, line: 233, baseType: !644, size: 32, offset: 3328)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !567, file: !77, line: 236, baseType: !646, size: 32, offset: 3360)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !567, file: !77, line: 239, baseType: !648, size: 64, offset: 3392)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !567, file: !77, line: 242, baseType: !576, size: 64, offset: 3456)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !567, file: !77, line: 243, baseType: !576, size: 64, offset: 3520)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !567, file: !77, line: 246, baseType: !615, size: 64, offset: 3584)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !567, file: !77, line: 249, baseType: !576, size: 64, offset: 3648)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !567, file: !77, line: 250, baseType: !576, size: 64, offset: 3712)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !567, file: !77, line: 253, baseType: !615, size: 64, offset: 3776)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !567, file: !77, line: 256, baseType: !656, size: 192, offset: 3840)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !657, line: 68, baseType: !658)
!657 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !657, line: 62, size: 192, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !658, file: !657, line: 65, baseType: !543, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !658, file: !657, line: 66, baseType: !543, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !658, file: !657, line: 67, baseType: !543, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !567, file: !77, line: 259, baseType: !664, size: 512, offset: 4032)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !666)
!666 = !{!667, !674, !675, !677}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !665, file: !247, line: 43, baseType: !668, size: 192)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !670)
!670 = !{!671, !672, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !669, file: !247, line: 35, baseType: !543, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !669, file: !247, line: 36, baseType: !543, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !669, file: !247, line: 37, baseType: !543, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !665, file: !247, line: 44, baseType: !668, size: 192, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !665, file: !247, line: 47, baseType: !676, size: 32, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !665, file: !247, line: 50, baseType: !576, size: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !567, file: !77, line: 262, baseType: !679, size: 64, offset: 4544)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !680, line: 26, baseType: !681)
!680 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!581, !547, !684, !687, !550}
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !686)
!686 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !689)
!689 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !567, file: !77, line: 265, baseType: !550, size: 64, offset: 4608)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !567, file: !77, line: 266, baseType: !550, size: 64, offset: 4672)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !567, file: !77, line: 267, baseType: !550, size: 64, offset: 4736)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !567, file: !77, line: 270, baseType: !694, size: 64, offset: 4800)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !696)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !567, file: !77, line: 273, baseType: !698, size: 64, offset: 4864)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !700)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !567, file: !77, line: 276, baseType: !702, size: 32768, offset: 4928)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 32768, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 4096)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !567, file: !77, line: 277, baseType: !702, size: 32768, offset: 37696)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !567, file: !77, line: 278, baseType: !702, size: 32768, offset: 70464)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !567, file: !77, line: 281, baseType: !576, size: 64, offset: 103232)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !567, file: !77, line: 282, baseType: !576, size: 64, offset: 103296)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !567, file: !77, line: 285, baseType: !710, size: 448, offset: 103360)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !712)
!712 = !{!713, !715, !716, !717, !718, !719, !720, !725}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !711, file: !253, line: 105, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !711, file: !253, line: 108, baseType: !468, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !711, file: !253, line: 111, baseType: !556, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !711, file: !253, line: 112, baseType: !556, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !711, file: !253, line: 115, baseType: !550, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !711, file: !253, line: 118, baseType: !581, size: 32, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !711, file: !253, line: 121, baseType: !721, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !723, line: 26, baseType: !724)
!723 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !723, line: 25, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !711, file: !253, line: 124, baseType: !576, size: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !567, file: !77, line: 288, baseType: !581, size: 32, offset: 103808)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !567, file: !77, line: 291, baseType: !728, size: 64, offset: 103872)
!728 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !615)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !567, file: !77, line: 294, baseType: !721, size: 64, offset: 103936)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !567, file: !77, line: 297, baseType: !731, size: 256, offset: 104000)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !733)
!733 = !{!734, !735, !736, !739}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !732, file: !89, line: 30, baseType: !556, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !732, file: !89, line: 33, baseType: !576, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !732, file: !89, line: 36, baseType: !737, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !732, file: !89, line: 39, baseType: !576, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !567, file: !77, line: 298, baseType: !731, size: 256, offset: 104256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !567, file: !77, line: 299, baseType: !742, size: 64, offset: 104512)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !567, file: !77, line: 302, baseType: !576, size: 64, offset: 104576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !567, file: !77, line: 305, baseType: !576, size: 64, offset: 104640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !567, file: !77, line: 308, baseType: !648, size: 64, offset: 104704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !567, file: !77, line: 309, baseType: !648, size: 64, offset: 104768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !567, file: !77, line: 310, baseType: !648, size: 64, offset: 104832)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !567, file: !77, line: 313, baseType: !749, size: 32, offset: 104896)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !567, file: !77, line: 316, baseType: !581, size: 32, offset: 104928)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !567, file: !77, line: 319, baseType: !558, size: 64, offset: 104960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !567, file: !77, line: 322, baseType: !648, size: 64, offset: 105024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !567, file: !77, line: 325, baseType: !623, size: 256, offset: 105088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !567, file: !77, line: 328, baseType: !550, size: 64, offset: 105344)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !567, file: !77, line: 329, baseType: !550, size: 64, offset: 105408)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !567, file: !77, line: 332, baseType: !757, size: 32, offset: 105472)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !567, file: !77, line: 335, baseType: !581, size: 32, offset: 105504)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !567, file: !77, line: 338, baseType: !688, size: 64, offset: 105536)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !567, file: !77, line: 341, baseType: !581, size: 32, offset: 105600)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !567, file: !77, line: 344, baseType: !576, size: 64, offset: 105664)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !567, file: !77, line: 347, baseType: !763, size: 64, offset: 105728)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !764, line: 7, baseType: !765)
!764 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !618, line: 160, baseType: !619)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !567, file: !77, line: 350, baseType: !767, size: 32, offset: 105792)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !567, file: !77, line: 353, baseType: !576, size: 64, offset: 105856)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !770)
!770 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !773, file: !326, line: 107, baseType: !570, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !773, file: !326, line: 110, baseType: !572, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !773, file: !326, line: 113, baseType: !581, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !773, file: !326, line: 116, baseType: !543, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !773, file: !326, line: 119, baseType: !576, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !773, file: !326, line: 122, baseType: !769, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !773, file: !326, line: 123, baseType: !769, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !773, file: !326, line: 124, baseType: !769, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !773, file: !326, line: 125, baseType: !769, size: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !773, file: !326, line: 126, baseType: !769, size: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !544)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumPixelPacket", file: !326, line: 158, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumPixelPacket", file: !326, line: 150, size: 80, elements: !792)
!792 = !{!793, !794, !795, !796, !797}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !791, file: !326, line: 153, baseType: !544, size: 16)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !791, file: !326, line: 154, baseType: !544, size: 16, offset: 16)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !791, file: !326, line: 155, baseType: !544, size: 16, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !791, file: !326, line: 156, baseType: !544, size: 16, offset: 48)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !791, file: !326, line: 157, baseType: !544, size: 16, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !368)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!803 = !{i32 7, !"Dwarf Version", i32 5}
!804 = !{i32 2, !"Debug Info Version", i32 3}
!805 = !{i32 1, !"wchar_size", i32 4}
!806 = !{i32 7, !"PIC Level", i32 2}
!807 = !{i32 7, !"PIE Level", i32 2}
!808 = !{i32 7, !"uwtable", i32 2}
!809 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!810 = distinct !DISubprogram(name: "AutoGammaImage", scope: !811, file: !811, line: 115, type: !812, scopeLine: 116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !814)
!811 = !DIFile(filename: "apps/538.imagick_r/src/magick/enhance.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d21e2bfe41ab717b08d42ac962576acf")
!812 = !DISubroutineType(types: !813)
!813 = !{!581, !565}
!814 = !{!815}
!815 = !DILocalVariable(name: "image", arg: 1, scope: !810, file: !811, line: 115, type: !565)
!816 = !DILocation(line: 0, scope: !810)
!817 = !DILocalVariable(name: "image", arg: 1, scope: !818, file: !811, line: 120, type: !565)
!818 = distinct !DISubprogram(name: "AutoGammaImageChannel", scope: !811, file: !811, line: 120, type: !819, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !822)
!819 = !DISubroutineType(types: !820)
!820 = !{!581, !565, !821}
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!822 = !{!817, !823, !824, !825, !826, !827, !828}
!823 = !DILocalVariable(name: "channel", arg: 2, scope: !818, file: !811, line: 121, type: !821)
!824 = !DILocalVariable(name: "gamma", scope: !818, file: !811, line: 124, type: !543)
!825 = !DILocalVariable(name: "mean", scope: !818, file: !811, line: 125, type: !543)
!826 = !DILocalVariable(name: "logmean", scope: !818, file: !811, line: 126, type: !543)
!827 = !DILocalVariable(name: "sans", scope: !818, file: !811, line: 127, type: !543)
!828 = !DILocalVariable(name: "status", scope: !818, file: !811, line: 130, type: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!830 = !DILocation(line: 0, scope: !818, inlinedAt: !831)
!831 = distinct !DILocation(line: 117, column: 10, scope: !810)
!832 = !DILocation(line: 123, column: 3, scope: !818, inlinedAt: !831)
!833 = !DILocation(line: 138, column: 68, scope: !834, inlinedAt: !831)
!834 = distinct !DILexicalBlock(scope: !835, file: !811, line: 134, column: 5)
!835 = distinct !DILexicalBlock(scope: !818, file: !811, line: 133, column: 7)
!836 = !DILocation(line: 138, column: 14, scope: !834, inlinedAt: !831)
!837 = !DILocation(line: 139, column: 17, scope: !834, inlinedAt: !831)
!838 = !{!839, !839, i64 0}
!839 = !{!"double", !840, i64 0}
!840 = !{!"omnipotent char", !841, i64 0}
!841 = !{!"Simple C/C++ TBAA"}
!842 = !DILocation(line: 139, column: 21, scope: !834, inlinedAt: !831)
!843 = !DILocation(line: 139, column: 13, scope: !834, inlinedAt: !831)
!844 = !DILocation(line: 139, column: 35, scope: !834, inlinedAt: !831)
!845 = !DILocation(line: 140, column: 14, scope: !834, inlinedAt: !831)
!846 = !DILocation(line: 189, column: 1, scope: !818, inlinedAt: !831)
!847 = !DILocation(line: 117, column: 3, scope: !810)
!848 = !DILocation(line: 0, scope: !818)
!849 = !DILocation(line: 123, column: 3, scope: !818)
!850 = !DILocation(line: 133, column: 16, scope: !835)
!851 = !DILocation(line: 133, column: 32, scope: !835)
!852 = !DILocation(line: 133, column: 7, scope: !818)
!853 = !DILocation(line: 138, column: 68, scope: !834)
!854 = !DILocation(line: 138, column: 14, scope: !834)
!855 = !DILocation(line: 139, column: 17, scope: !834)
!856 = !DILocation(line: 139, column: 21, scope: !834)
!857 = !DILocation(line: 139, column: 13, scope: !834)
!858 = !DILocation(line: 139, column: 35, scope: !834)
!859 = !DILocation(line: 140, column: 14, scope: !834)
!860 = !DILocation(line: 140, column: 7, scope: !834)
!861 = !DILocation(line: 146, column: 16, scope: !862)
!862 = distinct !DILexicalBlock(scope: !818, file: !811, line: 146, column: 7)
!863 = !DILocation(line: 146, column: 30, scope: !862)
!864 = !DILocation(line: 146, column: 7, scope: !818)
!865 = !DILocation(line: 149, column: 17, scope: !866)
!866 = distinct !DILexicalBlock(scope: !862, file: !811, line: 147, column: 5)
!867 = !DILocation(line: 148, column: 14, scope: !866)
!868 = !DILocation(line: 150, column: 17, scope: !866)
!869 = !DILocation(line: 150, column: 21, scope: !866)
!870 = !DILocation(line: 150, column: 13, scope: !866)
!871 = !DILocation(line: 150, column: 35, scope: !866)
!872 = !DILocation(line: 151, column: 15, scope: !866)
!873 = !DILocation(line: 151, column: 13, scope: !866)
!874 = !DILocation(line: 153, column: 5, scope: !866)
!875 = !DILocation(line: 154, column: 16, scope: !876)
!876 = distinct !DILexicalBlock(scope: !818, file: !811, line: 154, column: 7)
!877 = !DILocation(line: 154, column: 32, scope: !876)
!878 = !DILocation(line: 154, column: 7, scope: !818)
!879 = !DILocation(line: 157, column: 17, scope: !880)
!880 = distinct !DILexicalBlock(scope: !876, file: !811, line: 155, column: 5)
!881 = !DILocation(line: 156, column: 14, scope: !880)
!882 = !DILocation(line: 158, column: 17, scope: !880)
!883 = !DILocation(line: 158, column: 21, scope: !880)
!884 = !DILocation(line: 158, column: 13, scope: !880)
!885 = !DILocation(line: 158, column: 35, scope: !880)
!886 = !DILocation(line: 159, column: 15, scope: !880)
!887 = !DILocation(line: 159, column: 13, scope: !880)
!888 = !DILocation(line: 161, column: 5, scope: !880)
!889 = !DILocation(line: 162, column: 16, scope: !890)
!890 = distinct !DILexicalBlock(scope: !818, file: !811, line: 162, column: 7)
!891 = !DILocation(line: 162, column: 31, scope: !890)
!892 = !DILocation(line: 162, column: 7, scope: !818)
!893 = !DILocation(line: 165, column: 17, scope: !894)
!894 = distinct !DILexicalBlock(scope: !890, file: !811, line: 163, column: 5)
!895 = !DILocation(line: 164, column: 14, scope: !894)
!896 = !DILocation(line: 166, column: 17, scope: !894)
!897 = !DILocation(line: 166, column: 21, scope: !894)
!898 = !DILocation(line: 166, column: 13, scope: !894)
!899 = !DILocation(line: 166, column: 35, scope: !894)
!900 = !DILocation(line: 167, column: 15, scope: !894)
!901 = !DILocation(line: 167, column: 13, scope: !894)
!902 = !DILocation(line: 169, column: 5, scope: !894)
!903 = !DILocation(line: 170, column: 17, scope: !904)
!904 = distinct !DILexicalBlock(scope: !818, file: !811, line: 170, column: 7)
!905 = !DILocation(line: 170, column: 35, scope: !904)
!906 = !DILocation(line: 170, column: 41, scope: !904)
!907 = !DILocation(line: 171, column: 15, scope: !904)
!908 = !{!909, !840, i64 32}
!909 = !{!"_Image", !840, i64 0, !840, i64 4, !840, i64 8, !910, i64 16, !840, i64 24, !840, i64 28, !840, i64 32, !910, i64 40, !910, i64 48, !910, i64 56, !910, i64 64, !911, i64 72, !912, i64 80, !912, i64 88, !912, i64 96, !839, i64 104, !914, i64 112, !840, i64 208, !911, i64 216, !840, i64 224, !911, i64 232, !911, i64 240, !911, i64 248, !910, i64 256, !839, i64 264, !839, i64 272, !916, i64 280, !916, i64 312, !916, i64 344, !839, i64 376, !839, i64 384, !839, i64 392, !840, i64 400, !840, i64 404, !840, i64 408, !840, i64 412, !840, i64 416, !840, i64 420, !911, i64 424, !910, i64 432, !910, i64 440, !910, i64 448, !910, i64 456, !910, i64 464, !910, i64 472, !917, i64 480, !918, i64 504, !911, i64 568, !911, i64 576, !911, i64 584, !911, i64 592, !911, i64 600, !911, i64 608, !840, i64 616, !840, i64 4712, !840, i64 8808, !910, i64 12904, !910, i64 12912, !920, i64 12920, !840, i64 12976, !910, i64 12984, !911, i64 12992, !922, i64 13000, !922, i64 13032, !911, i64 13064, !910, i64 13072, !910, i64 13080, !911, i64 13088, !911, i64 13096, !911, i64 13104, !840, i64 13112, !840, i64 13116, !912, i64 13120, !911, i64 13128, !916, i64 13136, !911, i64 13168, !911, i64 13176, !840, i64 13184, !840, i64 13188, !923, i64 13192, !840, i64 13200, !910, i64 13208, !910, i64 13216, !840, i64 13224, !910, i64 13232}
!910 = !{!"long", !840, i64 0}
!911 = !{!"any pointer", !840, i64 0}
!912 = !{!"_PixelPacket", !913, i64 0, !913, i64 2, !913, i64 4, !913, i64 6}
!913 = !{!"short", !840, i64 0}
!914 = !{!"_ChromaticityInfo", !915, i64 0, !915, i64 24, !915, i64 48, !915, i64 72}
!915 = !{!"_PrimaryInfo", !839, i64 0, !839, i64 8, !839, i64 16}
!916 = !{!"_RectangleInfo", !910, i64 0, !910, i64 8, !910, i64 16, !910, i64 24}
!917 = !{!"_ErrorInfo", !839, i64 0, !839, i64 8, !839, i64 16}
!918 = !{!"_TimerInfo", !919, i64 0, !919, i64 24, !840, i64 48, !910, i64 56}
!919 = !{!"_Timer", !839, i64 0, !839, i64 8, !839, i64 16}
!920 = !{!"_ExceptionInfo", !840, i64 0, !921, i64 4, !911, i64 8, !911, i64 16, !911, i64 24, !840, i64 32, !911, i64 40, !910, i64 48}
!921 = !{!"int", !840, i64 0}
!922 = !{!"_ProfileInfo", !911, i64 0, !910, i64 8, !911, i64 16, !910, i64 24}
!923 = !{!"long long", !840, i64 0}
!924 = !DILocation(line: 171, column: 21, scope: !904)
!925 = !DILocation(line: 170, column: 7, scope: !818)
!926 = !DILocation(line: 174, column: 17, scope: !927)
!927 = distinct !DILexicalBlock(scope: !904, file: !811, line: 172, column: 5)
!928 = !DILocation(line: 173, column: 14, scope: !927)
!929 = !DILocation(line: 175, column: 17, scope: !927)
!930 = !DILocation(line: 175, column: 21, scope: !927)
!931 = !DILocation(line: 175, column: 13, scope: !927)
!932 = !DILocation(line: 175, column: 35, scope: !927)
!933 = !DILocation(line: 176, column: 15, scope: !927)
!934 = !DILocation(line: 176, column: 13, scope: !927)
!935 = !DILocation(line: 178, column: 5, scope: !927)
!936 = !DILocation(line: 179, column: 17, scope: !937)
!937 = distinct !DILexicalBlock(scope: !818, file: !811, line: 179, column: 7)
!938 = !DILocation(line: 179, column: 33, scope: !937)
!939 = !DILocation(line: 179, column: 39, scope: !937)
!940 = !DILocation(line: 180, column: 15, scope: !937)
!941 = !{!909, !840, i64 4}
!942 = !DILocation(line: 180, column: 26, scope: !937)
!943 = !DILocation(line: 179, column: 7, scope: !818)
!944 = !DILocation(line: 183, column: 17, scope: !945)
!945 = distinct !DILexicalBlock(scope: !937, file: !811, line: 181, column: 5)
!946 = !DILocation(line: 182, column: 14, scope: !945)
!947 = !DILocation(line: 184, column: 17, scope: !945)
!948 = !DILocation(line: 184, column: 21, scope: !945)
!949 = !DILocation(line: 184, column: 13, scope: !945)
!950 = !DILocation(line: 184, column: 35, scope: !945)
!951 = !DILocation(line: 185, column: 15, scope: !945)
!952 = !DILocation(line: 185, column: 13, scope: !945)
!953 = !DILocation(line: 187, column: 5, scope: !945)
!954 = !DILocation(line: 188, column: 17, scope: !818)
!955 = !DILocation(line: 188, column: 10, scope: !818)
!956 = !DILocation(line: 188, column: 3, scope: !818)
!957 = !DILocation(line: 189, column: 1, scope: !818)
!958 = !DISubprogram(name: "GetImageChannelMean", scope: !416, file: !416, line: 156, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !965)
!959 = !DISubroutineType(types: !960)
!960 = !{!581, !961, !821, !963, !963, !964}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!965 = !{}
!966 = distinct !DISubprogram(name: "LevelImageChannel", scope: !811, file: !811, line: 2931, type: !967, scopeLine: 2934, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !970)
!967 = !DISubroutineType(types: !968)
!968 = !{!581, !565, !821, !969, !969, !969}
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!970 = !{!971, !972, !973, !974, !975, !976, !981, !982, !983, !984, !985, !986, !991, !993, !994}
!971 = !DILocalVariable(name: "image", arg: 1, scope: !966, file: !811, line: 2931, type: !565)
!972 = !DILocalVariable(name: "channel", arg: 2, scope: !966, file: !811, line: 2932, type: !821)
!973 = !DILocalVariable(name: "black_point", arg: 3, scope: !966, file: !811, line: 2932, type: !969)
!974 = !DILocalVariable(name: "white_point", arg: 4, scope: !966, file: !811, line: 2932, type: !969)
!975 = !DILocalVariable(name: "gamma", arg: 5, scope: !966, file: !811, line: 2933, type: !969)
!976 = !DILocalVariable(name: "image_view", scope: !966, file: !811, line: 2938, type: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !979, line: 50, baseType: !980)
!979 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!981 = !DILocalVariable(name: "exception", scope: !966, file: !811, line: 2941, type: !964)
!982 = !DILocalVariable(name: "status", scope: !966, file: !811, line: 2944, type: !581)
!983 = !DILocalVariable(name: "progress", scope: !966, file: !811, line: 2947, type: !685)
!984 = !DILocalVariable(name: "i", scope: !966, file: !811, line: 2950, type: !615)
!985 = !DILocalVariable(name: "y", scope: !966, file: !811, line: 2953, type: !615)
!986 = !DILocalVariable(name: "indexes", scope: !987, file: !811, line: 2997, type: !990)
!987 = distinct !DILexicalBlock(scope: !988, file: !811, line: 2995, column: 3)
!988 = distinct !DILexicalBlock(scope: !989, file: !811, line: 2994, column: 3)
!989 = distinct !DILexicalBlock(scope: !966, file: !811, line: 2994, column: 3)
!990 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !785)
!991 = !DILocalVariable(name: "q", scope: !987, file: !811, line: 3000, type: !992)
!992 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !557)
!993 = !DILocalVariable(name: "x", scope: !987, file: !811, line: 3003, type: !615)
!994 = !DILocalVariable(name: "proceed", scope: !995, file: !811, line: 3040, type: !581)
!995 = distinct !DILexicalBlock(scope: !996, file: !811, line: 3038, column: 7)
!996 = distinct !DILexicalBlock(scope: !987, file: !811, line: 3037, column: 9)
!997 = !DILocation(line: 0, scope: !966)
!998 = !DILocation(line: 2960, column: 14, scope: !999)
!999 = distinct !DILexicalBlock(scope: !966, file: !811, line: 2960, column: 7)
!1000 = !{!909, !840, i64 12976}
!1001 = !DILocation(line: 2960, column: 20, scope: !999)
!1002 = !DILocation(line: 2960, column: 7, scope: !966)
!1003 = !DILocation(line: 2961, column: 68, scope: !999)
!1004 = !DILocation(line: 2961, column: 12, scope: !999)
!1005 = !DILocation(line: 2961, column: 5, scope: !999)
!1006 = !DILocation(line: 2962, column: 14, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !966, file: !811, line: 2962, column: 7)
!1008 = !{!909, !840, i64 0}
!1009 = !DILocation(line: 2962, column: 28, scope: !1007)
!1010 = !DILocation(line: 2962, column: 7, scope: !966)
!1011 = !DILocation(line: 2963, column: 36, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !811, line: 2963, column: 5)
!1013 = distinct !DILexicalBlock(scope: !1007, file: !811, line: 2963, column: 5)
!1014 = !{!909, !910, i64 64}
!1015 = !DILocation(line: 2963, column: 17, scope: !1012)
!1016 = !DILocation(line: 2963, column: 5, scope: !1013)
!1017 = !DILocation(line: 2968, column: 11, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1012, file: !811, line: 2964, column: 5)
!1019 = !DILocation(line: 2970, column: 53, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1018, file: !811, line: 2968, column: 11)
!1021 = !{!909, !911, i64 72}
!1022 = !DILocation(line: 2970, column: 65, scope: !1020)
!1023 = !{!912, !913, i64 4}
!1024 = !DILocalVariable(name: "black_point", arg: 1, scope: !1025, file: !811, line: 2918, type: !969)
!1025 = distinct !DISubprogram(name: "LevelPixel", scope: !811, file: !811, line: 2918, type: !1026, scopeLine: 2920, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1029)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!543, !969, !969, !969, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!1029 = !{!1024, !1030, !1031, !1032, !1033, !1034}
!1030 = !DILocalVariable(name: "white_point", arg: 2, scope: !1025, file: !811, line: 2919, type: !969)
!1031 = !DILocalVariable(name: "gamma", arg: 3, scope: !1025, file: !811, line: 2919, type: !969)
!1032 = !DILocalVariable(name: "pixel", arg: 4, scope: !1025, file: !811, line: 2919, type: !1028)
!1033 = !DILocalVariable(name: "level_pixel", scope: !1025, file: !811, line: 2922, type: !543)
!1034 = !DILocalVariable(name: "scale", scope: !1025, file: !811, line: 2923, type: !543)
!1035 = !DILocation(line: 0, scope: !1025, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 2969, column: 57, scope: !1020)
!1037 = !DILocation(line: 2925, column: 9, scope: !1025, inlinedAt: !1036)
!1038 = !DILocation(line: 2926, column: 45, scope: !1025, inlinedAt: !1036)
!1039 = !DILocation(line: 2926, column: 59, scope: !1025, inlinedAt: !1036)
!1040 = !DILocation(line: 2926, column: 43, scope: !1025, inlinedAt: !1036)
!1041 = !DILocalVariable(name: "value", arg: 1, scope: !1042, file: !811, line: 2102, type: !969)
!1042 = distinct !DISubprogram(name: "gamma_pow", scope: !811, file: !811, line: 2102, type: !1043, scopeLine: 2103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1045)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!543, !969, !969}
!1045 = !{!1041, !1046}
!1046 = !DILocalVariable(name: "gamma", arg: 2, scope: !1042, file: !811, line: 2102, type: !969)
!1047 = !DILocation(line: 0, scope: !1042, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 2926, column: 28, scope: !1025, inlinedAt: !1036)
!1049 = !DILocation(line: 2104, column: 16, scope: !1042, inlinedAt: !1048)
!1050 = !DILocation(line: 2104, column: 10, scope: !1042, inlinedAt: !1048)
!1051 = !DILocation(line: 2104, column: 32, scope: !1042, inlinedAt: !1048)
!1052 = !DILocation(line: 2926, column: 27, scope: !1025, inlinedAt: !1036)
!1053 = !DILocation(line: 2969, column: 57, scope: !1020)
!1054 = !DILocalVariable(name: "value", arg: 1, scope: !1055, file: !147, line: 87, type: !1028)
!1055 = distinct !DISubprogram(name: "ClampToQuantum", scope: !147, file: !147, line: 87, type: !1056, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1058)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!544, !1028}
!1058 = !{!1054}
!1059 = !DILocation(line: 0, scope: !1055, inlinedAt: !1060)
!1060 = distinct !DILocation(line: 2969, column: 42, scope: !1020)
!1061 = !DILocation(line: 92, column: 13, scope: !1062, inlinedAt: !1060)
!1062 = distinct !DILexicalBlock(scope: !1055, file: !147, line: 92, column: 7)
!1063 = !DILocation(line: 92, column: 7, scope: !1055, inlinedAt: !1060)
!1064 = !DILocation(line: 94, column: 13, scope: !1065, inlinedAt: !1060)
!1065 = distinct !DILexicalBlock(scope: !1055, file: !147, line: 94, column: 7)
!1066 = !DILocation(line: 94, column: 7, scope: !1055, inlinedAt: !1060)
!1067 = !DILocation(line: 96, column: 26, scope: !1055, inlinedAt: !1060)
!1068 = !DILocation(line: 96, column: 10, scope: !1055, inlinedAt: !1060)
!1069 = !DILocation(line: 96, column: 3, scope: !1055, inlinedAt: !1060)
!1070 = !DILocation(line: 2969, column: 16, scope: !1020)
!1071 = !DILocation(line: 2969, column: 28, scope: !1020)
!1072 = !DILocation(line: 2969, column: 31, scope: !1020)
!1073 = !DILocation(line: 2969, column: 9, scope: !1020)
!1074 = !DILocation(line: 2971, column: 11, scope: !1018)
!1075 = !DILocation(line: 2974, column: 18, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1018, file: !811, line: 2971, column: 11)
!1077 = !DILocation(line: 2974, column: 30, scope: !1076)
!1078 = !{!912, !913, i64 2}
!1079 = !DILocation(line: 0, scope: !1025, inlinedAt: !1080)
!1080 = distinct !DILocation(line: 2972, column: 59, scope: !1076)
!1081 = !DILocation(line: 2925, column: 9, scope: !1025, inlinedAt: !1080)
!1082 = !DILocation(line: 2926, column: 45, scope: !1025, inlinedAt: !1080)
!1083 = !DILocation(line: 2926, column: 59, scope: !1025, inlinedAt: !1080)
!1084 = !DILocation(line: 2926, column: 43, scope: !1025, inlinedAt: !1080)
!1085 = !DILocation(line: 0, scope: !1042, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 2926, column: 28, scope: !1025, inlinedAt: !1080)
!1087 = !DILocation(line: 2104, column: 16, scope: !1042, inlinedAt: !1086)
!1088 = !DILocation(line: 2104, column: 10, scope: !1042, inlinedAt: !1086)
!1089 = !DILocation(line: 2104, column: 32, scope: !1042, inlinedAt: !1086)
!1090 = !DILocation(line: 2926, column: 27, scope: !1025, inlinedAt: !1080)
!1091 = !DILocation(line: 2972, column: 59, scope: !1076)
!1092 = !DILocation(line: 0, scope: !1055, inlinedAt: !1093)
!1093 = distinct !DILocation(line: 2972, column: 44, scope: !1076)
!1094 = !DILocation(line: 92, column: 13, scope: !1062, inlinedAt: !1093)
!1095 = !DILocation(line: 92, column: 7, scope: !1055, inlinedAt: !1093)
!1096 = !DILocation(line: 94, column: 13, scope: !1065, inlinedAt: !1093)
!1097 = !DILocation(line: 94, column: 7, scope: !1055, inlinedAt: !1093)
!1098 = !DILocation(line: 96, column: 26, scope: !1055, inlinedAt: !1093)
!1099 = !DILocation(line: 96, column: 10, scope: !1055, inlinedAt: !1093)
!1100 = !DILocation(line: 96, column: 3, scope: !1055, inlinedAt: !1093)
!1101 = !DILocation(line: 2972, column: 16, scope: !1076)
!1102 = !DILocation(line: 2972, column: 28, scope: !1076)
!1103 = !DILocation(line: 2972, column: 33, scope: !1076)
!1104 = !DILocation(line: 2972, column: 9, scope: !1076)
!1105 = !DILocation(line: 2975, column: 11, scope: !1018)
!1106 = !DILocation(line: 2977, column: 53, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1018, file: !811, line: 2975, column: 11)
!1108 = !DILocation(line: 2977, column: 46, scope: !1107)
!1109 = !DILocation(line: 2977, column: 65, scope: !1107)
!1110 = !{!912, !913, i64 0}
!1111 = !DILocation(line: 0, scope: !1025, inlinedAt: !1112)
!1112 = distinct !DILocation(line: 2976, column: 58, scope: !1107)
!1113 = !DILocation(line: 2925, column: 9, scope: !1025, inlinedAt: !1112)
!1114 = !DILocation(line: 2926, column: 45, scope: !1025, inlinedAt: !1112)
!1115 = !DILocation(line: 2926, column: 59, scope: !1025, inlinedAt: !1112)
!1116 = !DILocation(line: 2926, column: 43, scope: !1025, inlinedAt: !1112)
!1117 = !DILocation(line: 0, scope: !1042, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 2926, column: 28, scope: !1025, inlinedAt: !1112)
!1119 = !DILocation(line: 2104, column: 16, scope: !1042, inlinedAt: !1118)
!1120 = !DILocation(line: 2104, column: 10, scope: !1042, inlinedAt: !1118)
!1121 = !DILocation(line: 2104, column: 32, scope: !1042, inlinedAt: !1118)
!1122 = !DILocation(line: 2926, column: 27, scope: !1025, inlinedAt: !1112)
!1123 = !DILocation(line: 2976, column: 58, scope: !1107)
!1124 = !DILocation(line: 0, scope: !1055, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 2976, column: 43, scope: !1107)
!1126 = !DILocation(line: 92, column: 13, scope: !1062, inlinedAt: !1125)
!1127 = !DILocation(line: 92, column: 7, scope: !1055, inlinedAt: !1125)
!1128 = !DILocation(line: 94, column: 13, scope: !1065, inlinedAt: !1125)
!1129 = !DILocation(line: 94, column: 7, scope: !1055, inlinedAt: !1125)
!1130 = !DILocation(line: 96, column: 26, scope: !1055, inlinedAt: !1125)
!1131 = !DILocation(line: 96, column: 10, scope: !1055, inlinedAt: !1125)
!1132 = !DILocation(line: 96, column: 3, scope: !1055, inlinedAt: !1125)
!1133 = !DILocation(line: 2976, column: 16, scope: !1107)
!1134 = !DILocation(line: 2976, column: 9, scope: !1107)
!1135 = !DILocation(line: 2976, column: 32, scope: !1107)
!1136 = !DILocation(line: 2978, column: 11, scope: !1018)
!1137 = !DILocation(line: 2981, column: 49, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1018, file: !811, line: 2978, column: 11)
!1139 = !DILocation(line: 2981, column: 61, scope: !1138)
!1140 = !{!912, !913, i64 6}
!1141 = !DILocation(line: 2981, column: 41, scope: !1138)
!1142 = !DILocation(line: 0, scope: !1025, inlinedAt: !1143)
!1143 = distinct !DILocation(line: 2980, column: 26, scope: !1138)
!1144 = !DILocation(line: 2925, column: 9, scope: !1025, inlinedAt: !1143)
!1145 = !DILocation(line: 2926, column: 45, scope: !1025, inlinedAt: !1143)
!1146 = !DILocation(line: 2926, column: 59, scope: !1025, inlinedAt: !1143)
!1147 = !DILocation(line: 2926, column: 43, scope: !1025, inlinedAt: !1143)
!1148 = !DILocation(line: 0, scope: !1042, inlinedAt: !1149)
!1149 = distinct !DILocation(line: 2926, column: 28, scope: !1025, inlinedAt: !1143)
!1150 = !DILocation(line: 2104, column: 16, scope: !1042, inlinedAt: !1149)
!1151 = !DILocation(line: 2104, column: 10, scope: !1042, inlinedAt: !1149)
!1152 = !DILocation(line: 2104, column: 32, scope: !1042, inlinedAt: !1149)
!1153 = !DILocation(line: 2926, column: 27, scope: !1025, inlinedAt: !1143)
!1154 = !DILocation(line: 2980, column: 26, scope: !1138)
!1155 = !DILocation(line: 0, scope: !1055, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 2980, column: 11, scope: !1138)
!1157 = !DILocation(line: 92, column: 13, scope: !1062, inlinedAt: !1156)
!1158 = !DILocation(line: 92, column: 7, scope: !1055, inlinedAt: !1156)
!1159 = !DILocation(line: 94, column: 13, scope: !1065, inlinedAt: !1156)
!1160 = !DILocation(line: 94, column: 7, scope: !1055, inlinedAt: !1156)
!1161 = !DILocation(line: 96, column: 26, scope: !1055, inlinedAt: !1156)
!1162 = !DILocation(line: 96, column: 10, scope: !1055, inlinedAt: !1156)
!1163 = !DILocation(line: 96, column: 3, scope: !1055, inlinedAt: !1156)
!1164 = !DILocation(line: 2979, column: 59, scope: !1138)
!1165 = !DILocation(line: 2979, column: 16, scope: !1138)
!1166 = !DILocation(line: 2979, column: 28, scope: !1138)
!1167 = !DILocation(line: 2979, column: 35, scope: !1138)
!1168 = !DILocation(line: 2979, column: 9, scope: !1138)
!1169 = !DILocation(line: 2963, column: 45, scope: !1012)
!1170 = distinct !{!1170, !1016, !1171, !1172, !1173}
!1171 = !DILocation(line: 2982, column: 5, scope: !1013)
!1172 = !{!"llvm.loop.mustprogress"}
!1173 = !{!"llvm.loop.unroll.disable"}
!1174 = !DILocation(line: 2988, column: 22, scope: !966)
!1175 = !DILocation(line: 2989, column: 14, scope: !966)
!1176 = !DILocation(line: 2994, column: 34, scope: !988)
!1177 = !{!909, !910, i64 48}
!1178 = !DILocation(line: 2994, column: 15, scope: !988)
!1179 = !DILocation(line: 2994, column: 3, scope: !989)
!1180 = !DILocation(line: 3005, column: 16, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !987, file: !811, line: 3005, column: 9)
!1182 = !DILocation(line: 3005, column: 9, scope: !987)
!1183 = !DILocation(line: 3007, column: 57, scope: !987)
!1184 = !{!909, !910, i64 40}
!1185 = !DILocation(line: 3007, column: 7, scope: !987)
!1186 = !DILocation(line: 0, scope: !987)
!1187 = !DILocation(line: 3008, column: 11, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !987, file: !811, line: 3008, column: 9)
!1189 = !DILocation(line: 3008, column: 9, scope: !987)
!1190 = !DILocation(line: 3013, column: 13, scope: !987)
!1191 = !DILocation(line: 3014, column: 36, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !811, line: 3014, column: 5)
!1193 = distinct !DILexicalBlock(scope: !987, file: !811, line: 3014, column: 5)
!1194 = !DILocation(line: 3014, column: 17, scope: !1192)
!1195 = !DILocation(line: 3014, column: 5, scope: !1193)
!1196 = !DILocation(line: 3016, column: 11, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1192, file: !811, line: 3015, column: 5)
!1198 = !DILocation(line: 3017, column: 9, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1197, file: !811, line: 3016, column: 11)
!1200 = !DILocation(line: 0, scope: !1025, inlinedAt: !1201)
!1201 = distinct !DILocation(line: 3017, column: 9, scope: !1199)
!1202 = !DILocation(line: 2925, column: 9, scope: !1025, inlinedAt: !1201)
!1203 = !DILocation(line: 2926, column: 45, scope: !1025, inlinedAt: !1201)
!1204 = !DILocation(line: 2926, column: 59, scope: !1025, inlinedAt: !1201)
!1205 = !DILocation(line: 2926, column: 43, scope: !1025, inlinedAt: !1201)
!1206 = !DILocation(line: 0, scope: !1042, inlinedAt: !1207)
!1207 = distinct !DILocation(line: 2926, column: 28, scope: !1025, inlinedAt: !1201)
!1208 = !DILocation(line: 2104, column: 16, scope: !1042, inlinedAt: !1207)
!1209 = !DILocation(line: 2104, column: 10, scope: !1042, inlinedAt: !1207)
!1210 = !DILocation(line: 2104, column: 32, scope: !1042, inlinedAt: !1207)
!1211 = !DILocation(line: 2926, column: 27, scope: !1025, inlinedAt: !1201)
!1212 = !DILocation(line: 0, scope: !1055, inlinedAt: !1213)
!1213 = distinct !DILocation(line: 3017, column: 9, scope: !1199)
!1214 = !DILocation(line: 92, column: 13, scope: !1062, inlinedAt: !1213)
!1215 = !DILocation(line: 92, column: 7, scope: !1055, inlinedAt: !1213)
!1216 = !DILocation(line: 94, column: 13, scope: !1065, inlinedAt: !1213)
!1217 = !DILocation(line: 94, column: 7, scope: !1055, inlinedAt: !1213)
!1218 = !DILocation(line: 96, column: 26, scope: !1055, inlinedAt: !1213)
!1219 = !DILocation(line: 96, column: 10, scope: !1055, inlinedAt: !1213)
!1220 = !DILocation(line: 96, column: 3, scope: !1055, inlinedAt: !1213)
!1221 = !DILocation(line: 3019, column: 11, scope: !1197)
!1222 = !DILocation(line: 3020, column: 9, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1197, file: !811, line: 3019, column: 11)
!1224 = !DILocation(line: 0, scope: !1025, inlinedAt: !1225)
!1225 = distinct !DILocation(line: 3020, column: 9, scope: !1223)
!1226 = !DILocation(line: 2925, column: 9, scope: !1025, inlinedAt: !1225)
!1227 = !DILocation(line: 2926, column: 45, scope: !1025, inlinedAt: !1225)
!1228 = !DILocation(line: 2926, column: 59, scope: !1025, inlinedAt: !1225)
!1229 = !DILocation(line: 2926, column: 43, scope: !1025, inlinedAt: !1225)
!1230 = !DILocation(line: 0, scope: !1042, inlinedAt: !1231)
!1231 = distinct !DILocation(line: 2926, column: 28, scope: !1025, inlinedAt: !1225)
!1232 = !DILocation(line: 2104, column: 16, scope: !1042, inlinedAt: !1231)
!1233 = !DILocation(line: 2104, column: 10, scope: !1042, inlinedAt: !1231)
!1234 = !DILocation(line: 2104, column: 32, scope: !1042, inlinedAt: !1231)
!1235 = !DILocation(line: 2926, column: 27, scope: !1025, inlinedAt: !1225)
!1236 = !DILocation(line: 0, scope: !1055, inlinedAt: !1237)
!1237 = distinct !DILocation(line: 3020, column: 9, scope: !1223)
!1238 = !DILocation(line: 92, column: 13, scope: !1062, inlinedAt: !1237)
!1239 = !DILocation(line: 92, column: 7, scope: !1055, inlinedAt: !1237)
!1240 = !DILocation(line: 94, column: 13, scope: !1065, inlinedAt: !1237)
!1241 = !DILocation(line: 94, column: 7, scope: !1055, inlinedAt: !1237)
!1242 = !DILocation(line: 96, column: 26, scope: !1055, inlinedAt: !1237)
!1243 = !DILocation(line: 96, column: 10, scope: !1055, inlinedAt: !1237)
!1244 = !DILocation(line: 96, column: 3, scope: !1055, inlinedAt: !1237)
!1245 = !DILocation(line: 3022, column: 11, scope: !1197)
!1246 = !DILocation(line: 3023, column: 9, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1197, file: !811, line: 3022, column: 11)
!1248 = !DILocation(line: 0, scope: !1025, inlinedAt: !1249)
!1249 = distinct !DILocation(line: 3023, column: 9, scope: !1247)
!1250 = !DILocation(line: 2925, column: 9, scope: !1025, inlinedAt: !1249)
!1251 = !DILocation(line: 2926, column: 45, scope: !1025, inlinedAt: !1249)
!1252 = !DILocation(line: 2926, column: 59, scope: !1025, inlinedAt: !1249)
!1253 = !DILocation(line: 2926, column: 43, scope: !1025, inlinedAt: !1249)
!1254 = !DILocation(line: 0, scope: !1042, inlinedAt: !1255)
!1255 = distinct !DILocation(line: 2926, column: 28, scope: !1025, inlinedAt: !1249)
!1256 = !DILocation(line: 2104, column: 16, scope: !1042, inlinedAt: !1255)
!1257 = !DILocation(line: 2104, column: 10, scope: !1042, inlinedAt: !1255)
!1258 = !DILocation(line: 2104, column: 32, scope: !1042, inlinedAt: !1255)
!1259 = !DILocation(line: 2926, column: 27, scope: !1025, inlinedAt: !1249)
!1260 = !DILocation(line: 0, scope: !1055, inlinedAt: !1261)
!1261 = distinct !DILocation(line: 3023, column: 9, scope: !1247)
!1262 = !DILocation(line: 92, column: 13, scope: !1062, inlinedAt: !1261)
!1263 = !DILocation(line: 92, column: 7, scope: !1055, inlinedAt: !1261)
!1264 = !DILocation(line: 94, column: 13, scope: !1065, inlinedAt: !1261)
!1265 = !DILocation(line: 94, column: 7, scope: !1055, inlinedAt: !1261)
!1266 = !DILocation(line: 96, column: 26, scope: !1055, inlinedAt: !1261)
!1267 = !DILocation(line: 96, column: 10, scope: !1055, inlinedAt: !1261)
!1268 = !DILocation(line: 96, column: 3, scope: !1055, inlinedAt: !1261)
!1269 = !DILocation(line: 3025, column: 45, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1197, file: !811, line: 3025, column: 11)
!1271 = !DILocation(line: 3026, column: 19, scope: !1270)
!1272 = !DILocation(line: 3026, column: 25, scope: !1270)
!1273 = !DILocation(line: 3025, column: 11, scope: !1197)
!1274 = !DILocation(line: 3027, column: 9, scope: !1270)
!1275 = !DILocation(line: 0, scope: !1025, inlinedAt: !1276)
!1276 = distinct !DILocation(line: 3027, column: 9, scope: !1270)
!1277 = !DILocation(line: 2925, column: 9, scope: !1025, inlinedAt: !1276)
!1278 = !DILocation(line: 2926, column: 45, scope: !1025, inlinedAt: !1276)
!1279 = !DILocation(line: 2926, column: 59, scope: !1025, inlinedAt: !1276)
!1280 = !DILocation(line: 2926, column: 43, scope: !1025, inlinedAt: !1276)
!1281 = !DILocation(line: 0, scope: !1042, inlinedAt: !1282)
!1282 = distinct !DILocation(line: 2926, column: 28, scope: !1025, inlinedAt: !1276)
!1283 = !DILocation(line: 2104, column: 16, scope: !1042, inlinedAt: !1282)
!1284 = !DILocation(line: 2104, column: 10, scope: !1042, inlinedAt: !1282)
!1285 = !DILocation(line: 2104, column: 32, scope: !1042, inlinedAt: !1282)
!1286 = !DILocation(line: 2926, column: 27, scope: !1025, inlinedAt: !1276)
!1287 = !DILocation(line: 0, scope: !1055, inlinedAt: !1288)
!1288 = distinct !DILocation(line: 3027, column: 9, scope: !1270)
!1289 = !DILocation(line: 92, column: 13, scope: !1062, inlinedAt: !1288)
!1290 = !DILocation(line: 92, column: 7, scope: !1055, inlinedAt: !1288)
!1291 = !DILocation(line: 94, column: 13, scope: !1065, inlinedAt: !1288)
!1292 = !DILocation(line: 94, column: 7, scope: !1055, inlinedAt: !1288)
!1293 = !DILocation(line: 96, column: 26, scope: !1055, inlinedAt: !1288)
!1294 = !DILocation(line: 96, column: 10, scope: !1055, inlinedAt: !1288)
!1295 = !DILocation(line: 96, column: 3, scope: !1055, inlinedAt: !1288)
!1296 = !DILocation(line: 3029, column: 43, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1197, file: !811, line: 3029, column: 11)
!1298 = !DILocation(line: 3030, column: 19, scope: !1297)
!1299 = !DILocation(line: 3030, column: 30, scope: !1297)
!1300 = !DILocation(line: 3029, column: 11, scope: !1197)
!1301 = !DILocation(line: 3031, column: 9, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1303, file: !811, line: 3031, column: 9)
!1303 = distinct !DILexicalBlock(scope: !1297, file: !811, line: 3031, column: 9)
!1304 = !DILocation(line: 3031, column: 9, scope: !1303)
!1305 = !{!913, !913, i64 0}
!1306 = !DILocation(line: 0, scope: !1025, inlinedAt: !1307)
!1307 = distinct !DILocation(line: 3031, column: 9, scope: !1302)
!1308 = !DILocation(line: 2925, column: 9, scope: !1025, inlinedAt: !1307)
!1309 = !DILocation(line: 2926, column: 45, scope: !1025, inlinedAt: !1307)
!1310 = !DILocation(line: 2926, column: 59, scope: !1025, inlinedAt: !1307)
!1311 = !DILocation(line: 2926, column: 43, scope: !1025, inlinedAt: !1307)
!1312 = !DILocation(line: 0, scope: !1042, inlinedAt: !1313)
!1313 = distinct !DILocation(line: 2926, column: 28, scope: !1025, inlinedAt: !1307)
!1314 = !DILocation(line: 2104, column: 16, scope: !1042, inlinedAt: !1313)
!1315 = !DILocation(line: 2104, column: 10, scope: !1042, inlinedAt: !1313)
!1316 = !DILocation(line: 2104, column: 32, scope: !1042, inlinedAt: !1313)
!1317 = !DILocation(line: 2926, column: 27, scope: !1025, inlinedAt: !1307)
!1318 = !DILocation(line: 0, scope: !1055, inlinedAt: !1319)
!1319 = distinct !DILocation(line: 3031, column: 9, scope: !1302)
!1320 = !DILocation(line: 92, column: 13, scope: !1062, inlinedAt: !1319)
!1321 = !DILocation(line: 92, column: 7, scope: !1055, inlinedAt: !1319)
!1322 = !DILocation(line: 94, column: 13, scope: !1065, inlinedAt: !1319)
!1323 = !DILocation(line: 94, column: 7, scope: !1055, inlinedAt: !1319)
!1324 = !DILocation(line: 96, column: 26, scope: !1055, inlinedAt: !1319)
!1325 = !DILocation(line: 96, column: 10, scope: !1055, inlinedAt: !1319)
!1326 = !DILocation(line: 96, column: 3, scope: !1055, inlinedAt: !1319)
!1327 = !DILocation(line: 3033, column: 8, scope: !1197)
!1328 = !DILocation(line: 3014, column: 46, scope: !1192)
!1329 = distinct !{!1329, !1195, !1330, !1172, !1173}
!1330 = !DILocation(line: 3034, column: 5, scope: !1193)
!1331 = !DILocation(line: 3035, column: 9, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !987, file: !811, line: 3035, column: 9)
!1333 = !DILocation(line: 3035, column: 60, scope: !1332)
!1334 = !DILocation(line: 3035, column: 9, scope: !987)
!1335 = !DILocation(line: 3037, column: 16, scope: !996)
!1336 = !{!909, !911, i64 568}
!1337 = !DILocation(line: 3037, column: 33, scope: !996)
!1338 = !DILocation(line: 3037, column: 9, scope: !987)
!1339 = !DILocation(line: 3045, column: 62, scope: !995)
!1340 = !DILocation(line: 3045, column: 72, scope: !995)
!1341 = !DILocalVariable(name: "image", arg: 1, scope: !1342, file: !1343, line: 27, type: !961)
!1342 = distinct !DISubprogram(name: "SetImageProgress", scope: !1343, file: !1343, line: 27, type: !1344, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1346)
!1343 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a84e9021f92665a913f9cbc20a804774")
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!581, !961, !547, !684, !687}
!1346 = !{!1341, !1347, !1348, !1349, !1350}
!1347 = !DILocalVariable(name: "tag", arg: 2, scope: !1342, file: !1343, line: 28, type: !547)
!1348 = !DILocalVariable(name: "offset", arg: 3, scope: !1342, file: !1343, line: 28, type: !684)
!1349 = !DILocalVariable(name: "extent", arg: 4, scope: !1342, file: !1343, line: 28, type: !687)
!1350 = !DILocalVariable(name: "message", scope: !1342, file: !1343, line: 31, type: !702)
!1351 = !DILocation(line: 0, scope: !1342, inlinedAt: !1352)
!1352 = distinct !DILocation(line: 3045, column: 17, scope: !995)
!1353 = !DILocation(line: 30, column: 3, scope: !1342, inlinedAt: !1352)
!1354 = !DILocation(line: 31, column: 5, scope: !1342, inlinedAt: !1352)
!1355 = !DILocation(line: 35, column: 10, scope: !1342, inlinedAt: !1352)
!1356 = !DILocation(line: 36, column: 17, scope: !1342, inlinedAt: !1352)
!1357 = !DILocation(line: 36, column: 63, scope: !1342, inlinedAt: !1352)
!1358 = !{!909, !911, i64 576}
!1359 = !DILocation(line: 36, column: 10, scope: !1342, inlinedAt: !1352)
!1360 = !DILocation(line: 37, column: 1, scope: !1342, inlinedAt: !1352)
!1361 = !DILocation(line: 0, scope: !995)
!1362 = !DILocation(line: 3046, column: 21, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !995, file: !811, line: 3046, column: 13)
!1364 = !DILocation(line: 3046, column: 13, scope: !995)
!1365 = !DILocation(line: 3048, column: 7, scope: !995)
!1366 = !DILocation(line: 2994, column: 41, scope: !988)
!1367 = distinct !{!1367, !1179, !1368, !1172, !1173}
!1368 = !DILocation(line: 3049, column: 3, scope: !989)
!1369 = !DILocation(line: 2986, column: 9, scope: !966)
!1370 = !DILocation(line: 3050, column: 14, scope: !966)
!1371 = !DILocation(line: 3051, column: 10, scope: !966)
!1372 = !DILocation(line: 3052, column: 3, scope: !966)
!1373 = distinct !DISubprogram(name: "AutoLevelImage", scope: !811, file: !811, line: 221, type: !812, scopeLine: 222, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1374)
!1374 = !{!1375}
!1375 = !DILocalVariable(name: "image", arg: 1, scope: !1373, file: !811, line: 221, type: !565)
!1376 = !DILocation(line: 0, scope: !1373)
!1377 = !DILocalVariable(name: "image", arg: 1, scope: !1378, file: !811, line: 226, type: !565)
!1378 = distinct !DISubprogram(name: "AutoLevelImageChannel", scope: !811, file: !811, line: 226, type: !819, scopeLine: 228, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1379)
!1379 = !{!1377, !1380}
!1380 = !DILocalVariable(name: "channel", arg: 2, scope: !1378, file: !811, line: 227, type: !821)
!1381 = !DILocation(line: 0, scope: !1378, inlinedAt: !1382)
!1382 = distinct !DILocation(line: 223, column: 10, scope: !1373)
!1383 = !DILocation(line: 232, column: 10, scope: !1378, inlinedAt: !1382)
!1384 = !DILocation(line: 223, column: 3, scope: !1373)
!1385 = !DILocation(line: 0, scope: !1378)
!1386 = !DILocation(line: 232, column: 10, scope: !1378)
!1387 = !DILocation(line: 232, column: 3, scope: !1378)
!1388 = !DISubprogram(name: "MinMaxStretchImage", scope: !1389, file: !1389, line: 46, type: !1390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !965)
!1389 = !DIFile(filename: "apps/538.imagick_r/src/magick/histogram.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2cf116c94f52893f7dbbcaa9072de9d3")
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!581, !565, !821, !969, !969}
!1392 = distinct !DISubprogram(name: "BrightnessContrastImage", scope: !811, file: !811, line: 270, type: !1393, scopeLine: 272, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1395)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!581, !565, !969, !969}
!1395 = !{!1396, !1397, !1398, !1399}
!1396 = !DILocalVariable(name: "image", arg: 1, scope: !1392, file: !811, line: 270, type: !565)
!1397 = !DILocalVariable(name: "brightness", arg: 2, scope: !1392, file: !811, line: 271, type: !969)
!1398 = !DILocalVariable(name: "contrast", arg: 3, scope: !1392, file: !811, line: 271, type: !969)
!1399 = !DILocalVariable(name: "status", scope: !1392, file: !811, line: 274, type: !581)
!1400 = !DILocation(line: 0, scope: !1392)
!1401 = !DILocalVariable(name: "image", arg: 1, scope: !1402, file: !811, line: 281, type: !565)
!1402 = distinct !DISubprogram(name: "BrightnessContrastImageChannel", scope: !811, file: !811, line: 281, type: !1390, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1403)
!1403 = !{!1401, !1404, !1405, !1406, !1407, !1408, !1409, !1413, !1414}
!1404 = !DILocalVariable(name: "channel", arg: 2, scope: !1402, file: !811, line: 282, type: !821)
!1405 = !DILocalVariable(name: "brightness", arg: 3, scope: !1402, file: !811, line: 282, type: !969)
!1406 = !DILocalVariable(name: "contrast", arg: 4, scope: !1402, file: !811, line: 282, type: !969)
!1407 = !DILocalVariable(name: "alpha", scope: !1402, file: !811, line: 287, type: !543)
!1408 = !DILocalVariable(name: "intercept", scope: !1402, file: !811, line: 288, type: !543)
!1409 = !DILocalVariable(name: "coefficients", scope: !1402, file: !811, line: 289, type: !1410)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 128, elements: !1411)
!1411 = !{!1412}
!1412 = !DISubrange(count: 2)
!1413 = !DILocalVariable(name: "slope", scope: !1402, file: !811, line: 290, type: !543)
!1414 = !DILocalVariable(name: "status", scope: !1402, file: !811, line: 293, type: !581)
!1415 = !DILocation(line: 0, scope: !1402, inlinedAt: !1416)
!1416 = distinct !DILocation(line: 276, column: 10, scope: !1392)
!1417 = !DILocation(line: 286, column: 3, scope: !1402, inlinedAt: !1416)
!1418 = !DILocation(line: 289, column: 5, scope: !1402, inlinedAt: !1416)
!1419 = !DILocation(line: 300, column: 14, scope: !1420, inlinedAt: !1416)
!1420 = distinct !DILexicalBlock(scope: !1402, file: !811, line: 300, column: 7)
!1421 = !DILocation(line: 300, column: 20, scope: !1420, inlinedAt: !1416)
!1422 = !DILocation(line: 300, column: 7, scope: !1402, inlinedAt: !1416)
!1423 = !DILocation(line: 301, column: 68, scope: !1420, inlinedAt: !1416)
!1424 = !DILocation(line: 301, column: 12, scope: !1420, inlinedAt: !1416)
!1425 = !DILocation(line: 301, column: 5, scope: !1420, inlinedAt: !1416)
!1426 = !DILocation(line: 303, column: 38, scope: !1402, inlinedAt: !1416)
!1427 = !DILocation(line: 303, column: 44, scope: !1402, inlinedAt: !1416)
!1428 = !DILocation(line: 303, column: 31, scope: !1402, inlinedAt: !1416)
!1429 = !DILocation(line: 303, column: 49, scope: !1402, inlinedAt: !1416)
!1430 = !DILocation(line: 303, column: 9, scope: !1402, inlinedAt: !1416)
!1431 = !DILocation(line: 304, column: 13, scope: !1432, inlinedAt: !1416)
!1432 = distinct !DILexicalBlock(scope: !1402, file: !811, line: 304, column: 7)
!1433 = !DILocation(line: 304, column: 7, scope: !1402, inlinedAt: !1416)
!1434 = !DILocation(line: 305, column: 5, scope: !1432, inlinedAt: !1416)
!1435 = !DILocation(line: 306, column: 23, scope: !1402, inlinedAt: !1416)
!1436 = !DILocation(line: 306, column: 35, scope: !1402, inlinedAt: !1416)
!1437 = !DILocation(line: 306, column: 47, scope: !1402, inlinedAt: !1416)
!1438 = !DILocation(line: 306, column: 59, scope: !1402, inlinedAt: !1416)
!1439 = !DILocation(line: 306, column: 29, scope: !1402, inlinedAt: !1416)
!1440 = !DILocation(line: 307, column: 18, scope: !1402, inlinedAt: !1416)
!1441 = !DILocation(line: 308, column: 3, scope: !1402, inlinedAt: !1416)
!1442 = !DILocation(line: 308, column: 18, scope: !1402, inlinedAt: !1416)
!1443 = !DILocation(line: 310, column: 13, scope: !1402, inlinedAt: !1416)
!1444 = !DILocation(line: 309, column: 10, scope: !1402, inlinedAt: !1416)
!1445 = !DILocation(line: 312, column: 1, scope: !1402, inlinedAt: !1416)
!1446 = !DILocation(line: 278, column: 3, scope: !1392)
!1447 = !DILocation(line: 0, scope: !1402)
!1448 = !DILocation(line: 286, column: 3, scope: !1402)
!1449 = !DILocation(line: 289, column: 5, scope: !1402)
!1450 = !DILocation(line: 300, column: 14, scope: !1420)
!1451 = !DILocation(line: 300, column: 20, scope: !1420)
!1452 = !DILocation(line: 300, column: 7, scope: !1402)
!1453 = !DILocation(line: 301, column: 68, scope: !1420)
!1454 = !DILocation(line: 301, column: 12, scope: !1420)
!1455 = !DILocation(line: 301, column: 5, scope: !1420)
!1456 = !DILocation(line: 303, column: 38, scope: !1402)
!1457 = !DILocation(line: 303, column: 44, scope: !1402)
!1458 = !DILocation(line: 303, column: 31, scope: !1402)
!1459 = !DILocation(line: 303, column: 49, scope: !1402)
!1460 = !DILocation(line: 303, column: 9, scope: !1402)
!1461 = !DILocation(line: 304, column: 13, scope: !1432)
!1462 = !DILocation(line: 304, column: 7, scope: !1402)
!1463 = !DILocation(line: 305, column: 5, scope: !1432)
!1464 = !DILocation(line: 306, column: 23, scope: !1402)
!1465 = !DILocation(line: 306, column: 35, scope: !1402)
!1466 = !DILocation(line: 306, column: 47, scope: !1402)
!1467 = !DILocation(line: 306, column: 59, scope: !1402)
!1468 = !DILocation(line: 306, column: 29, scope: !1402)
!1469 = !DILocation(line: 307, column: 18, scope: !1402)
!1470 = !DILocation(line: 308, column: 3, scope: !1402)
!1471 = !DILocation(line: 308, column: 18, scope: !1402)
!1472 = !DILocation(line: 310, column: 13, scope: !1402)
!1473 = !DILocation(line: 309, column: 10, scope: !1402)
!1474 = !DILocation(line: 312, column: 1, scope: !1402)
!1475 = !DILocation(line: 311, column: 3, scope: !1402)
!1476 = !DISubprogram(name: "LogMagickEvent", scope: !391, file: !391, line: 83, type: !1477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !965)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!581, !1479, !547, !547, !1481, !547, null}
!1479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1480)
!1480 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !391, line: 58, baseType: !390)
!1481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!1482 = !DISubprogram(name: "FunctionImageChannel", scope: !416, file: !416, line: 152, type: !1483, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !965)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!581, !565, !821, !1485, !1481, !1487, !964}
!1485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1486)
!1486 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFunction", file: !416, line: 111, baseType: !415)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!1488 = distinct !DISubprogram(name: "ColorDecisionListImage", scope: !811, file: !811, line: 357, type: !1489, scopeLine: 359, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1491)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!581, !565, !547}
!1491 = !{!1492, !1493, !1494, !1495, !1496, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1525, !1526, !1527, !1530, !1536, !1540, !1541, !1542}
!1492 = !DILocalVariable(name: "image", arg: 1, scope: !1488, file: !811, line: 357, type: !565)
!1493 = !DILocalVariable(name: "color_correction_collection", arg: 2, scope: !1488, file: !811, line: 358, type: !547)
!1494 = !DILocalVariable(name: "image_view", scope: !1488, file: !811, line: 382, type: !977)
!1495 = !DILocalVariable(name: "token", scope: !1488, file: !811, line: 385, type: !702)
!1496 = !DILocalVariable(name: "color_correction", scope: !1488, file: !811, line: 388, type: !1497)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorCorrection", scope: !1488, file: !811, line: 379, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ColorCorrection", scope: !1488, file: !811, line: 370, size: 640, elements: !1499)
!1499 = !{!1500, !1507, !1508, !1509}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1498, file: !811, line: 373, baseType: !1501, size: 192)
!1501 = !DIDerivedType(tag: DW_TAG_typedef, name: "Correction", scope: !1488, file: !811, line: 368, baseType: !1502)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Correction", scope: !1488, file: !811, line: 362, size: 192, elements: !1503)
!1503 = !{!1504, !1505, !1506}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "slope", scope: !1502, file: !811, line: 365, baseType: !543, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1502, file: !811, line: 366, baseType: !543, size: 64, offset: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !1502, file: !811, line: 367, baseType: !543, size: 64, offset: 128)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1498, file: !811, line: 374, baseType: !1501, size: 192, offset: 192)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1498, file: !811, line: 375, baseType: !1501, size: 192, offset: 384)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1498, file: !811, line: 378, baseType: !543, size: 64, offset: 576)
!1510 = !DILocalVariable(name: "content", scope: !1488, file: !811, line: 391, type: !547)
!1511 = !DILocalVariable(name: "p", scope: !1488, file: !811, line: 392, type: !547)
!1512 = !DILocalVariable(name: "exception", scope: !1488, file: !811, line: 395, type: !964)
!1513 = !DILocalVariable(name: "status", scope: !1488, file: !811, line: 398, type: !581)
!1514 = !DILocalVariable(name: "progress", scope: !1488, file: !811, line: 401, type: !685)
!1515 = !DILocalVariable(name: "cdl_map", scope: !1488, file: !811, line: 404, type: !557)
!1516 = !DILocalVariable(name: "i", scope: !1488, file: !811, line: 407, type: !615)
!1517 = !DILocalVariable(name: "y", scope: !1488, file: !811, line: 410, type: !615)
!1518 = !DILocalVariable(name: "cc", scope: !1488, file: !811, line: 413, type: !551)
!1519 = !DILocalVariable(name: "ccc", scope: !1488, file: !811, line: 414, type: !551)
!1520 = !DILocalVariable(name: "sat", scope: !1488, file: !811, line: 415, type: !551)
!1521 = !DILocalVariable(name: "sop", scope: !1488, file: !811, line: 416, type: !551)
!1522 = !DILocalVariable(name: "offset", scope: !1523, file: !811, line: 450, type: !551)
!1523 = distinct !DILexicalBlock(scope: !1524, file: !811, line: 448, column: 5)
!1524 = distinct !DILexicalBlock(scope: !1488, file: !811, line: 447, column: 7)
!1525 = !DILocalVariable(name: "power", scope: !1523, file: !811, line: 451, type: !551)
!1526 = !DILocalVariable(name: "slope", scope: !1523, file: !811, line: 452, type: !551)
!1527 = !DILocalVariable(name: "saturation", scope: !1528, file: !811, line: 556, type: !551)
!1528 = distinct !DILexicalBlock(scope: !1529, file: !811, line: 554, column: 5)
!1529 = distinct !DILexicalBlock(scope: !1488, file: !811, line: 553, column: 7)
!1530 = !DILocalVariable(name: "luma", scope: !1531, file: !811, line: 617, type: !543)
!1531 = distinct !DILexicalBlock(scope: !1532, file: !811, line: 615, column: 7)
!1532 = distinct !DILexicalBlock(scope: !1533, file: !811, line: 614, column: 7)
!1533 = distinct !DILexicalBlock(scope: !1534, file: !811, line: 614, column: 7)
!1534 = distinct !DILexicalBlock(scope: !1535, file: !811, line: 610, column: 5)
!1535 = distinct !DILexicalBlock(scope: !1488, file: !811, line: 609, column: 7)
!1536 = !DILocalVariable(name: "luma", scope: !1537, file: !811, line: 644, type: !543)
!1537 = distinct !DILexicalBlock(scope: !1538, file: !811, line: 642, column: 3)
!1538 = distinct !DILexicalBlock(scope: !1539, file: !811, line: 641, column: 3)
!1539 = distinct !DILexicalBlock(scope: !1488, file: !811, line: 641, column: 3)
!1540 = !DILocalVariable(name: "q", scope: !1537, file: !811, line: 647, type: !992)
!1541 = !DILocalVariable(name: "x", scope: !1537, file: !811, line: 650, type: !615)
!1542 = !DILocalVariable(name: "proceed", scope: !1543, file: !811, line: 677, type: !581)
!1543 = distinct !DILexicalBlock(scope: !1544, file: !811, line: 675, column: 7)
!1544 = distinct !DILexicalBlock(scope: !1537, file: !811, line: 674, column: 9)
!1545 = !DILocation(line: 0, scope: !1488)
!1546 = !DILocation(line: 384, column: 3, scope: !1488)
!1547 = !DILocation(line: 385, column: 5, scope: !1488)
!1548 = !DILocation(line: 390, column: 3, scope: !1488)
!1549 = !DILocation(line: 423, column: 14, scope: !1550)
!1550 = distinct !DILexicalBlock(scope: !1488, file: !811, line: 423, column: 7)
!1551 = !DILocation(line: 423, column: 20, scope: !1550)
!1552 = !DILocation(line: 423, column: 7, scope: !1488)
!1553 = !DILocation(line: 424, column: 68, scope: !1550)
!1554 = !DILocation(line: 424, column: 12, scope: !1550)
!1555 = !DILocation(line: 424, column: 5, scope: !1550)
!1556 = !DILocation(line: 425, column: 35, scope: !1557)
!1557 = distinct !DILexicalBlock(scope: !1488, file: !811, line: 425, column: 7)
!1558 = !DILocation(line: 425, column: 7, scope: !1488)
!1559 = !DILocation(line: 427, column: 69, scope: !1488)
!1560 = !DILocation(line: 427, column: 7, scope: !1488)
!1561 = !DILocation(line: 428, column: 11, scope: !1562)
!1562 = distinct !DILexicalBlock(scope: !1488, file: !811, line: 428, column: 7)
!1563 = !DILocation(line: 428, column: 7, scope: !1488)
!1564 = !DILocation(line: 430, column: 6, scope: !1488)
!1565 = !DILocation(line: 431, column: 10, scope: !1566)
!1566 = distinct !DILexicalBlock(scope: !1488, file: !811, line: 431, column: 7)
!1567 = !DILocation(line: 431, column: 7, scope: !1488)
!1568 = !DILocation(line: 433, column: 11, scope: !1569)
!1569 = distinct !DILexicalBlock(scope: !1566, file: !811, line: 432, column: 5)
!1570 = !DILocation(line: 434, column: 7, scope: !1569)
!1571 = !DILocation(line: 446, column: 7, scope: !1488)
!1572 = !DILocation(line: 447, column: 11, scope: !1524)
!1573 = !DILocation(line: 447, column: 7, scope: !1488)
!1574 = !DILocation(line: 454, column: 13, scope: !1523)
!1575 = !DILocation(line: 0, scope: !1523)
!1576 = !DILocation(line: 455, column: 17, scope: !1577)
!1577 = distinct !DILexicalBlock(scope: !1523, file: !811, line: 455, column: 11)
!1578 = !DILocation(line: 455, column: 11, scope: !1523)
!1579 = !DILocation(line: 457, column: 19, scope: !1580)
!1580 = distinct !DILexicalBlock(scope: !1577, file: !811, line: 456, column: 9)
!1581 = !DILocation(line: 458, column: 12, scope: !1580)
!1582 = !{!911, !911, i64 0}
!1583 = !DILocation(line: 459, column: 22, scope: !1584)
!1584 = distinct !DILexicalBlock(scope: !1585, file: !811, line: 459, column: 11)
!1585 = distinct !DILexicalBlock(scope: !1580, file: !811, line: 459, column: 11)
!1586 = !{!840, !840, i64 0}
!1587 = !DILocation(line: 459, column: 25, scope: !1584)
!1588 = !DILocation(line: 459, column: 34, scope: !1584)
!1589 = !DILocation(line: 461, column: 13, scope: !1590)
!1590 = distinct !DILexicalBlock(scope: !1584, file: !811, line: 460, column: 11)
!1591 = !DILocation(line: 462, column: 17, scope: !1592)
!1592 = distinct !DILexicalBlock(scope: !1590, file: !811, line: 462, column: 17)
!1593 = !DILocation(line: 462, column: 24, scope: !1592)
!1594 = !DILocation(line: 462, column: 17, scope: !1590)
!1595 = !DILocation(line: 463, column: 30, scope: !1592)
!1596 = !DILocation(line: 463, column: 15, scope: !1592)
!1597 = !DILocation(line: 464, column: 13, scope: !1590)
!1598 = !DILocalVariable(name: "string", arg: 1, scope: !1599, file: !1600, line: 42, type: !1603)
!1599 = distinct !DISubprogram(name: "StringToDouble", scope: !1600, file: !1600, line: 42, type: !1601, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1605)
!1600 = !DIFile(filename: "apps/538.imagick_r/src/magick/string-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "af275f9a9b26a4e8bc1a481724207dee")
!1601 = !DISubroutineType(types: !1602)
!1602 = !{!543, !1603, !1604}
!1603 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !547)
!1604 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !555)
!1605 = !{!1598, !1606}
!1606 = !DILocalVariable(name: "sentinal", arg: 2, scope: !1599, file: !1600, line: 43, type: !1604)
!1607 = !DILocation(line: 0, scope: !1599, inlinedAt: !1608)
!1608 = distinct !DILocation(line: 468, column: 44, scope: !1609)
!1609 = distinct !DILexicalBlock(scope: !1610, file: !811, line: 467, column: 15)
!1610 = distinct !DILexicalBlock(scope: !1590, file: !811, line: 465, column: 13)
!1611 = !DILocation(line: 45, column: 10, scope: !1599, inlinedAt: !1608)
!1612 = !DILocation(line: 469, column: 17, scope: !1609)
!1613 = !DILocation(line: 0, scope: !1599, inlinedAt: !1614)
!1614 = distinct !DILocation(line: 473, column: 46, scope: !1615)
!1615 = distinct !DILexicalBlock(scope: !1610, file: !811, line: 472, column: 15)
!1616 = !DILocation(line: 45, column: 10, scope: !1599, inlinedAt: !1614)
!1617 = !DILocation(line: 475, column: 17, scope: !1615)
!1618 = !DILocation(line: 0, scope: !1599, inlinedAt: !1619)
!1619 = distinct !DILocation(line: 479, column: 45, scope: !1620)
!1620 = distinct !DILexicalBlock(scope: !1610, file: !811, line: 478, column: 15)
!1621 = !DILocation(line: 45, column: 10, scope: !1599, inlinedAt: !1619)
!1622 = !DILocation(line: 481, column: 17, scope: !1620)
!1623 = !DILocation(line: 459, column: 47, scope: !1584)
!1624 = !DILocation(line: 459, column: 23, scope: !1584)
!1625 = distinct !{!1625, !1626, !1627, !1172, !1173}
!1626 = !DILocation(line: 459, column: 11, scope: !1585)
!1627 = !DILocation(line: 484, column: 11, scope: !1585)
!1628 = !DILocation(line: 436, column: 29, scope: !1488)
!1629 = !DILocation(line: 439, column: 31, scope: !1488)
!1630 = !DILocation(line: 442, column: 30, scope: !1488)
!1631 = !DILocation(line: 486, column: 14, scope: !1523)
!1632 = !DILocation(line: 487, column: 18, scope: !1633)
!1633 = distinct !DILexicalBlock(scope: !1523, file: !811, line: 487, column: 11)
!1634 = !DILocation(line: 487, column: 11, scope: !1523)
!1635 = !DILocation(line: 489, column: 19, scope: !1636)
!1636 = distinct !DILexicalBlock(scope: !1633, file: !811, line: 488, column: 9)
!1637 = !DILocation(line: 490, column: 12, scope: !1636)
!1638 = !DILocation(line: 491, column: 22, scope: !1639)
!1639 = distinct !DILexicalBlock(scope: !1640, file: !811, line: 491, column: 11)
!1640 = distinct !DILexicalBlock(scope: !1636, file: !811, line: 491, column: 11)
!1641 = !DILocation(line: 491, column: 25, scope: !1639)
!1642 = !DILocation(line: 491, column: 34, scope: !1639)
!1643 = !DILocation(line: 493, column: 13, scope: !1644)
!1644 = distinct !DILexicalBlock(scope: !1639, file: !811, line: 492, column: 11)
!1645 = !DILocation(line: 494, column: 17, scope: !1646)
!1646 = distinct !DILexicalBlock(scope: !1644, file: !811, line: 494, column: 17)
!1647 = !DILocation(line: 494, column: 24, scope: !1646)
!1648 = !DILocation(line: 494, column: 17, scope: !1644)
!1649 = !DILocation(line: 495, column: 30, scope: !1646)
!1650 = !DILocation(line: 495, column: 15, scope: !1646)
!1651 = !DILocation(line: 496, column: 13, scope: !1644)
!1652 = !DILocation(line: 0, scope: !1599, inlinedAt: !1653)
!1653 = distinct !DILocation(line: 500, column: 45, scope: !1654)
!1654 = distinct !DILexicalBlock(scope: !1655, file: !811, line: 499, column: 15)
!1655 = distinct !DILexicalBlock(scope: !1644, file: !811, line: 497, column: 13)
!1656 = !DILocation(line: 45, column: 10, scope: !1599, inlinedAt: !1653)
!1657 = !DILocation(line: 502, column: 17, scope: !1654)
!1658 = !DILocation(line: 0, scope: !1599, inlinedAt: !1659)
!1659 = distinct !DILocation(line: 506, column: 47, scope: !1660)
!1660 = distinct !DILexicalBlock(scope: !1655, file: !811, line: 505, column: 15)
!1661 = !DILocation(line: 45, column: 10, scope: !1599, inlinedAt: !1659)
!1662 = !DILocation(line: 508, column: 17, scope: !1660)
!1663 = !DILocation(line: 0, scope: !1599, inlinedAt: !1664)
!1664 = distinct !DILocation(line: 512, column: 46, scope: !1665)
!1665 = distinct !DILexicalBlock(scope: !1655, file: !811, line: 511, column: 15)
!1666 = !DILocation(line: 45, column: 10, scope: !1599, inlinedAt: !1664)
!1667 = !DILocation(line: 514, column: 17, scope: !1665)
!1668 = !DILocation(line: 491, column: 47, scope: !1639)
!1669 = !DILocation(line: 491, column: 23, scope: !1639)
!1670 = distinct !{!1670, !1671, !1672, !1172, !1173}
!1671 = !DILocation(line: 491, column: 11, scope: !1640)
!1672 = !DILocation(line: 517, column: 11, scope: !1640)
!1673 = !DILocation(line: 437, column: 30, scope: !1488)
!1674 = !DILocation(line: 440, column: 32, scope: !1488)
!1675 = !DILocation(line: 443, column: 31, scope: !1488)
!1676 = !DILocation(line: 519, column: 13, scope: !1523)
!1677 = !DILocation(line: 520, column: 17, scope: !1678)
!1678 = distinct !DILexicalBlock(scope: !1523, file: !811, line: 520, column: 11)
!1679 = !DILocation(line: 520, column: 11, scope: !1523)
!1680 = !DILocation(line: 522, column: 19, scope: !1681)
!1681 = distinct !DILexicalBlock(scope: !1678, file: !811, line: 521, column: 9)
!1682 = !DILocation(line: 523, column: 12, scope: !1681)
!1683 = !DILocation(line: 524, column: 22, scope: !1684)
