; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/exception.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/exception.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [88 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/exception.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [23 x i8] c"MemoryAllocationFailed\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1
@.str.4 = private unnamed_addr constant [15 x i8] c"Exception/%s%s\00", align 1
@error_handler = internal unnamed_addr global ptr @DefaultErrorHandler, align 8, !dbg !0
@fatal_error_handler = internal unnamed_addr global ptr @DefaultFatalErrorHandler, align 8, !dbg !163
@warning_handler = internal unnamed_addr global ptr @DefaultWarningHandler, align 8, !dbg !167
@.str.5 = private unnamed_addr constant [2 x i8] c" \00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"undefined\00", align 1

!36 = !DIEnumerator(name: "OptionError", value: 410)
!37 = !DIEnumerator(name: "DelegateError", value: 415)
!38 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!39 = !DIEnumerator(name: "CorruptImageError", value: 425)
!40 = !DIEnumerator(name: "FileOpenError", value: 430)
!41 = !DIEnumerator(name: "BlobError", value: 435)
!42 = !DIEnumerator(name: "StreamError", value: 440)
!43 = !DIEnumerator(name: "CacheError", value: 445)
!44 = !DIEnumerator(name: "CoderError", value: 450)
!45 = !DIEnumerator(name: "FilterError", value: 452)
!46 = !DIEnumerator(name: "ModuleError", value: 455)
!47 = !DIEnumerator(name: "DrawError", value: 460)
!48 = !DIEnumerator(name: "ImageError", value: 465)
!49 = !DIEnumerator(name: "WandError", value: 470)
!50 = !DIEnumerator(name: "RandomError", value: 475)
!51 = !DIEnumerator(name: "XServerError", value: 480)
!52 = !DIEnumerator(name: "MonitorError", value: 485)
!53 = !DIEnumerator(name: "RegistryError", value: 490)
!54 = !DIEnumerator(name: "ConfigureError", value: 495)
!55 = !DIEnumerator(name: "PolicyError", value: 499)
!56 = !DIEnumerator(name: "FatalErrorException", value: 700)
!57 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!58 = !DIEnumerator(name: "TypeFatalError", value: 705)
!59 = !DIEnumerator(name: "OptionFatalError", value: 710)
!60 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!61 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!62 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!63 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!64 = !DIEnumerator(name: "BlobFatalError", value: 735)
!65 = !DIEnumerator(name: "StreamFatalError", value: 740)
!66 = !DIEnumerator(name: "CacheFatalError", value: 745)
!67 = !DIEnumerator(name: "CoderFatalError", value: 750)
!68 = !DIEnumerator(name: "FilterFatalError", value: 752)
!69 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!70 = !DIEnumerator(name: "DrawFatalError", value: 760)
!71 = !DIEnumerator(name: "ImageFatalError", value: 765)
!72 = !DIEnumerator(name: "WandFatalError", value: 770)
!73 = !DIEnumerator(name: "RandomFatalError", value: 775)
!74 = !DIEnumerator(name: "XServerFatalError", value: 780)
!75 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!76 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!77 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!78 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 211, baseType: !7, size: 32, elements: !81)
!80 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!81 = !{!82, !83}
!82 = !DIEnumerator(name: "MagickFalse", value: 0)
!83 = !DIEnumerator(name: "MagickTrue", value: 1)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 34, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!87 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!88 = !DIEnumerator(name: "NoEvents", value: 0)
!89 = !DIEnumerator(name: "TraceEvent", value: 1)
!90 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!91 = !DIEnumerator(name: "BlobEvent", value: 4)
!92 = !DIEnumerator(name: "CacheEvent", value: 8)
!93 = !DIEnumerator(name: "CoderEvent", value: 16)
!94 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!95 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!96 = !DIEnumerator(name: "DrawEvent", value: 128)
!97 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!98 = !DIEnumerator(name: "ImageEvent", value: 512)
!99 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!100 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!101 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!102 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!103 = !DIEnumerator(name: "TransformEvent", value: 16384)
!104 = !DIEnumerator(name: "UserEvent", value: 36864)
!105 = !DIEnumerator(name: "WandEvent", value: 65536)
!106 = !DIEnumerator(name: "X11Event", value: 131072)
!107 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!108 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 25, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120}
!112 = !DIEnumerator(name: "UndefinedPath", value: 0)
!113 = !DIEnumerator(name: "MagickPath", value: 1)
!114 = !DIEnumerator(name: "RootPath", value: 2)
!115 = !DIEnumerator(name: "HeadPath", value: 3)
!116 = !DIEnumerator(name: "TailPath", value: 4)
!117 = !DIEnumerator(name: "BasePath", value: 5)
!118 = !DIEnumerator(name: "ExtensionPath", value: 6)
!119 = !DIEnumerator(name: "SubimagePath", value: 7)
!120 = !DIEnumerator(name: "CanonicalPath", value: 8)
!121 = !{!122, !135, !146, !129, !147, !131, !151, !139, !153, !155, !160, !161}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !80, line: 219, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !6, line: 102, size: 448, elements: !125)
!125 = !{!126, !128, !130, !133, !134, !136, !138, !143}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !124, file: !6, line: 105, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !6, line: 100, baseType: !5)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !124, file: !6, line: 108, baseType: !129, size: 32, offset: 32)
!129 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !124, file: !6, line: 111, baseType: !131, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !124, file: !6, line: 112, baseType: !131, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !124, file: !6, line: 115, baseType: !135, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !124, file: !6, line: 118, baseType: !137, size: 32, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !80, line: 215, baseType: !79)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !124, file: !6, line: 121, baseType: !139, size: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !141, line: 26, baseType: !142)
!141 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !141, line: 25, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !124, file: !6, line: 124, baseType: !144, size: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !145, line: 46, baseType: !146)
!145 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!146 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !149, line: 34, baseType: !150)
!149 = !DIFile(filename: "apps/538.imagick_r/src/magick/hashmap.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "683c2bd26601474466c188c023adadf2")
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !149, line: 33, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorHandler", file: !6, line: 128, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !159, !153, !153}
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "WarningHandler", file: !6, line: 134, baseType: !156)
!161 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!162 = !{!0, !163, !167}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "fatal_error_handler", scope: !2, file: !165, line: 78, type: !166, isLocal: true, isDefinition: true)
!165 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ccb02a5343f02e5c3fbd69da93f10869")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "FatalErrorHandler", file: !6, line: 131, baseType: !156)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "warning_handler", scope: !2, file: !165, line: 81, type: !160, isLocal: true, isDefinition: true)
!169 = !{i32 7, !"Dwarf Version", i32 5}
!170 = !{i32 2, !"Debug Info Version", i32 3}
!171 = !{i32 1, !"wchar_size", i32 4}
!172 = !{i32 7, !"PIC Level", i32 2}
!173 = !{i32 7, !"PIE Level", i32 2}
!174 = !{i32 7, !"uwtable", i32 2}
!175 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!176 = distinct !DISubprogram(name: "AcquireExceptionInfo", scope: !165, file: !165, line: 101, type: !177, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !179)
!177 = !DISubroutineType(types: !178)
!178 = !{!122}
!179 = !{!180, !181, !184}
!180 = !DILocalVariable(name: "exception", scope: !176, file: !165, line: 104, type: !122)
!181 = !DILocalVariable(name: "message", scope: !182, file: !165, line: 108, type: !131)
!182 = distinct !DILexicalBlock(scope: !183, file: !165, line: 108, column: 5)
!183 = distinct !DILexicalBlock(scope: !176, file: !165, line: 107, column: 7)
!184 = !DILocalVariable(name: "exception", scope: !182, file: !165, line: 108, type: !123)
!185 = !DILocation(line: 106, column: 31, scope: !176)
!186 = !DILocation(line: 0, scope: !176)
!187 = !DILocation(line: 107, column: 17, scope: !183)
!188 = !DILocation(line: 107, column: 7, scope: !176)
!189 = !DILocation(line: 108, column: 5, scope: !182)
!190 = !{!191, !191, i64 0}
!191 = !{!"int", !192, i64 0}
!192 = !{!"omnipotent char", !193, i64 0}
!193 = !{!"Simple C/C++ TBAA"}
!194 = !DILocation(line: 0, scope: !182)
!195 = !DILocalVariable(name: "exception", arg: 1, scope: !196, file: !165, line: 456, type: !122)
!196 = distinct !DISubprogram(name: "GetExceptionInfo", scope: !165, file: !165, line: 456, type: !197, scopeLine: 457, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !199)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !122}
!199 = !{!195}
!200 = !DILocation(line: 0, scope: !196, inlinedAt: !201)
!201 = distinct !DILocation(line: 109, column: 3, scope: !176)
!202 = !DILocation(line: 459, column: 10, scope: !196, inlinedAt: !201)
!203 = !DILocation(line: 460, column: 22, scope: !196, inlinedAt: !201)
!204 = !{!205, !192, i64 0}
!205 = !{!"_ExceptionInfo", !192, i64 0, !191, i64 4, !206, i64 8, !206, i64 16, !206, i64 24, !192, i64 32, !206, i64 40, !207, i64 48}
!206 = !{!"any pointer", !192, i64 0}
!207 = !{!"long", !192, i64 0}
!208 = !DILocation(line: 461, column: 34, scope: !196, inlinedAt: !201)
!209 = !DILocation(line: 461, column: 14, scope: !196, inlinedAt: !201)
!210 = !DILocation(line: 461, column: 24, scope: !196, inlinedAt: !201)
!211 = !{!205, !206, i64 24}
!212 = !DILocation(line: 462, column: 24, scope: !196, inlinedAt: !201)
!213 = !DILocation(line: 462, column: 14, scope: !196, inlinedAt: !201)
!214 = !DILocation(line: 462, column: 23, scope: !196, inlinedAt: !201)
!215 = !{!205, !206, i64 40}
!216 = !DILocation(line: 463, column: 14, scope: !196, inlinedAt: !201)
!217 = !DILocation(line: 463, column: 23, scope: !196, inlinedAt: !201)
!218 = !{!205, !207, i64 48}
!219 = !DILocation(line: 110, column: 14, scope: !176)
!220 = !DILocation(line: 110, column: 24, scope: !176)
!221 = !{!205, !192, i64 32}
!222 = !DILocation(line: 111, column: 3, scope: !176)
!223 = !DISubprogram(name: "AcquireMagickMemory", scope: !224, file: !224, line: 40, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!224 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!225 = !DISubroutineType(types: !226)
!226 = !{!135, !227}
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!228 = !{}
!229 = !DILocation(line: 0, scope: !196)
!230 = !DILocation(line: 459, column: 10, scope: !196)
!231 = !DILocation(line: 460, column: 22, scope: !196)
!232 = !DILocation(line: 461, column: 34, scope: !196)
!233 = !DILocation(line: 461, column: 14, scope: !196)
!234 = !DILocation(line: 461, column: 24, scope: !196)
!235 = !DILocation(line: 462, column: 24, scope: !196)
!236 = !DILocation(line: 462, column: 14, scope: !196)
!237 = !DILocation(line: 462, column: 23, scope: !196)
!238 = !DILocation(line: 463, column: 14, scope: !196)
!239 = !DILocation(line: 463, column: 23, scope: !196)
!240 = !DILocation(line: 464, column: 1, scope: !196)
!241 = distinct !DISubprogram(name: "GetExceptionMessage", scope: !165, file: !165, line: 489, type: !242, scopeLine: 490, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !245)
!242 = !DISubroutineType(types: !243)
!243 = !{!131, !244}
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!245 = !{!246, !247}
!246 = !DILocalVariable(name: "error", arg: 1, scope: !241, file: !165, line: 489, type: !244)
!247 = !DILocalVariable(name: "exception", scope: !241, file: !165, line: 492, type: !248)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32768, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 4096)
!251 = !DILocation(line: 0, scope: !241)
!252 = !DILocation(line: 491, column: 3, scope: !241)
!253 = !DILocation(line: 492, column: 5, scope: !241)
!254 = !DILocation(line: 494, column: 13, scope: !241)
!255 = !{!192, !192, i64 0}
!256 = !DILocation(line: 503, column: 37, scope: !241)
!257 = !DILocation(line: 503, column: 10, scope: !241)
!258 = !DILocation(line: 505, column: 10, scope: !241)
!259 = !DILocation(line: 506, column: 1, scope: !241)
!260 = !DILocation(line: 505, column: 3, scope: !241)
!261 = distinct !DISubprogram(name: "ThrowMagickException", scope: !165, file: !165, line: 1042, type: !262, scopeLine: 1045, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !264)
!262 = !DISubroutineType(types: !263)
!263 = !{!137, !122, !153, !153, !227, !159, !153, !153, null}
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273}
!265 = !DILocalVariable(name: "exception", arg: 1, scope: !261, file: !165, line: 1042, type: !122)
!266 = !DILocalVariable(name: "module", arg: 2, scope: !261, file: !165, line: 1043, type: !153)
!267 = !DILocalVariable(name: "function", arg: 3, scope: !261, file: !165, line: 1043, type: !153)
!268 = !DILocalVariable(name: "line", arg: 4, scope: !261, file: !165, line: 1043, type: !227)
!269 = !DILocalVariable(name: "severity", arg: 5, scope: !261, file: !165, line: 1044, type: !159)
!270 = !DILocalVariable(name: "tag", arg: 6, scope: !261, file: !165, line: 1044, type: !153)
!271 = !DILocalVariable(name: "format", arg: 7, scope: !261, file: !165, line: 1044, type: !153)
!272 = !DILocalVariable(name: "status", scope: !261, file: !165, line: 1047, type: !137)
!273 = !DILocalVariable(name: "operands", scope: !261, file: !165, line: 1050, type: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !275, line: 52, baseType: !276)
!275 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !277, line: 32, baseType: !278)
!277 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stdarg.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !279, baseType: !280)
!279 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 192, elements: !287)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !282)
!282 = !{!283, !284, !285, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !281, file: !279, line: 951, baseType: !7, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !281, file: !279, line: 951, baseType: !7, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !281, file: !279, line: 951, baseType: !135, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !281, file: !279, line: 951, baseType: !135, size: 64, offset: 128)
!287 = !{!288}
!288 = !DISubrange(count: 1)
!289 = !DILocation(line: 0, scope: !261)
!290 = !DILocation(line: 1049, column: 3, scope: !261)
!291 = !DILocation(line: 1050, column: 5, scope: !261)
!292 = !DILocation(line: 1052, column: 3, scope: !261)
!293 = !DILocation(line: 1053, column: 10, scope: !261)
!294 = !DILocation(line: 1055, column: 3, scope: !261)
!295 = !DILocation(line: 1057, column: 1, scope: !261)
!296 = !DILocation(line: 1056, column: 3, scope: !261)
!297 = !DISubprogram(name: "DestroyString", scope: !298, file: !298, line: 46, type: !299, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!298 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!299 = !DISubroutineType(types: !300)
!300 = !{!131, !131}
!301 = distinct !DISubprogram(name: "CatchException", scope: !165, file: !165, line: 191, type: !197, scopeLine: 192, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!302 = !{!303, !304}
!303 = !DILocalVariable(name: "exception", arg: 1, scope: !301, file: !165, line: 191, type: !122)
!304 = !DILocalVariable(name: "p", scope: !301, file: !165, line: 194, type: !151)
!305 = !DILocation(line: 0, scope: !301)
!306 = !DILocation(line: 198, column: 18, scope: !307)
!307 = distinct !DILexicalBlock(scope: !301, file: !165, line: 198, column: 7)
!308 = !DILocation(line: 198, column: 30, scope: !307)
!309 = !DILocation(line: 198, column: 7, scope: !301)
!310 = !DILocation(line: 200, column: 32, scope: !301)
!311 = !DILocation(line: 200, column: 3, scope: !301)
!312 = !DILocation(line: 201, column: 57, scope: !301)
!313 = !DILocation(line: 201, column: 3, scope: !301)
!314 = !DILocation(line: 203, column: 16, scope: !301)
!315 = !DILocation(line: 202, column: 29, scope: !301)
!316 = !DILocation(line: 204, column: 12, scope: !301)
!317 = !DILocation(line: 204, column: 3, scope: !301)
!318 = !DILocation(line: 206, column: 13, scope: !319)
!319 = distinct !DILexicalBlock(scope: !320, file: !165, line: 206, column: 9)
!320 = distinct !DILexicalBlock(scope: !301, file: !165, line: 205, column: 3)
!321 = !DILocation(line: 206, column: 43, scope: !319)
!322 = !DILocalVariable(name: "warning", arg: 1, scope: !323, file: !165, line: 774, type: !159)
!323 = distinct !DISubprogram(name: "MagickWarning", scope: !165, file: !165, line: 774, type: !157, scopeLine: 776, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !324)
!324 = !{!322, !325, !326}
!325 = !DILocalVariable(name: "reason", arg: 2, scope: !323, file: !165, line: 774, type: !153)
!326 = !DILocalVariable(name: "description", arg: 3, scope: !323, file: !165, line: 775, type: !153)
!327 = !DILocation(line: 0, scope: !323, inlinedAt: !328)
!328 = distinct !DILocation(line: 207, column: 7, scope: !319)
!329 = !DILocation(line: 777, column: 7, scope: !330, inlinedAt: !328)
!330 = distinct !DILexicalBlock(scope: !323, file: !165, line: 777, column: 7)
!331 = !{!206, !206, i64 0}
!332 = !DILocation(line: 777, column: 23, scope: !330, inlinedAt: !328)
!333 = !DILocation(line: 777, column: 7, scope: !323, inlinedAt: !328)
!334 = !DILocation(line: 207, column: 46, scope: !319)
!335 = !{!205, !206, i64 16}
!336 = !DILocation(line: 207, column: 36, scope: !319)
!337 = !{!205, !206, i64 8}
!338 = !DILocation(line: 778, column: 5, scope: !330, inlinedAt: !328)
!339 = !DILocation(line: 208, column: 13, scope: !340)
!340 = distinct !DILexicalBlock(scope: !320, file: !165, line: 208, column: 9)
!341 = !DILocation(line: 208, column: 41, scope: !340)
!342 = !DILocalVariable(name: "error", arg: 1, scope: !343, file: !165, line: 704, type: !159)
!343 = distinct !DISubprogram(name: "MagickError", scope: !165, file: !165, line: 704, type: !157, scopeLine: 706, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !344)
!344 = !{!342, !345, !346}
!345 = !DILocalVariable(name: "reason", arg: 2, scope: !343, file: !165, line: 704, type: !153)
!346 = !DILocalVariable(name: "description", arg: 3, scope: !343, file: !165, line: 705, type: !153)
!347 = !DILocation(line: 0, scope: !343, inlinedAt: !348)
!348 = distinct !DILocation(line: 209, column: 7, scope: !340)
!349 = !DILocation(line: 707, column: 7, scope: !350, inlinedAt: !348)
!350 = distinct !DILexicalBlock(scope: !343, file: !165, line: 707, column: 7)
!351 = !DILocation(line: 707, column: 21, scope: !350, inlinedAt: !348)
!352 = !DILocation(line: 707, column: 7, scope: !343, inlinedAt: !348)
!353 = !DILocation(line: 209, column: 44, scope: !340)
!354 = !DILocation(line: 209, column: 34, scope: !340)
!355 = !DILocation(line: 708, column: 5, scope: !350, inlinedAt: !348)
!356 = !DILocation(line: 210, column: 12, scope: !357)
!357 = distinct !DILexicalBlock(scope: !320, file: !165, line: 210, column: 9)
!358 = !DILocation(line: 210, column: 21, scope: !357)
!359 = !DILocation(line: 210, column: 9, scope: !320)
!360 = !DILocalVariable(name: "error", arg: 1, scope: !361, file: !165, line: 740, type: !159)
!361 = distinct !DISubprogram(name: "MagickFatalError", scope: !165, file: !165, line: 740, type: !157, scopeLine: 742, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !362)
!362 = !{!360, !363, !364}
!363 = !DILocalVariable(name: "reason", arg: 2, scope: !361, file: !165, line: 740, type: !153)
!364 = !DILocalVariable(name: "description", arg: 3, scope: !361, file: !165, line: 741, type: !153)
!365 = !DILocation(line: 0, scope: !361, inlinedAt: !366)
!366 = distinct !DILocation(line: 211, column: 7, scope: !357)
!367 = !DILocation(line: 743, column: 7, scope: !368, inlinedAt: !366)
!368 = distinct !DILexicalBlock(scope: !361, file: !165, line: 743, column: 7)
!369 = !DILocation(line: 743, column: 27, scope: !368, inlinedAt: !366)
!370 = !DILocation(line: 743, column: 7, scope: !361, inlinedAt: !366)
!371 = !DILocation(line: 211, column: 49, scope: !357)
!372 = !DILocation(line: 211, column: 39, scope: !357)
!373 = !DILocation(line: 744, column: 5, scope: !368, inlinedAt: !366)
!374 = !DILocation(line: 213, column: 18, scope: !320)
!375 = !DILocation(line: 212, column: 31, scope: !320)
!376 = distinct !{!376, !317, !377, !378, !379}
!377 = !DILocation(line: 214, column: 3, scope: !301)
!378 = !{!"llvm.loop.mustprogress"}
!379 = !{!"llvm.loop.unroll.disable"}
!380 = !DILocation(line: 215, column: 34, scope: !301)
!381 = !DILocation(line: 215, column: 3, scope: !301)
!382 = !DILocalVariable(name: "exception", arg: 1, scope: !383, file: !165, line: 152, type: !122)
!383 = distinct !DISubprogram(name: "ClearMagickException", scope: !165, file: !165, line: 152, type: !197, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !384)
!384 = !{!382}
!385 = !DILocation(line: 0, scope: !383, inlinedAt: !386)
!386 = distinct !DILocation(line: 216, column: 3, scope: !301)
!387 = !DILocation(line: 156, column: 18, scope: !388, inlinedAt: !386)
!388 = distinct !DILexicalBlock(scope: !383, file: !165, line: 156, column: 7)
!389 = !DILocation(line: 156, column: 29, scope: !388, inlinedAt: !386)
!390 = !DILocation(line: 156, column: 7, scope: !383, inlinedAt: !386)
!391 = !DILocation(line: 158, column: 32, scope: !383, inlinedAt: !386)
!392 = !DILocation(line: 158, column: 3, scope: !383, inlinedAt: !386)
!393 = !DILocation(line: 159, column: 49, scope: !383, inlinedAt: !386)
!394 = !DILocation(line: 159, column: 3, scope: !383, inlinedAt: !386)
!395 = !DILocation(line: 161, column: 22, scope: !383, inlinedAt: !386)
!396 = !DILocation(line: 162, column: 14, scope: !383, inlinedAt: !386)
!397 = !DILocation(line: 162, column: 20, scope: !383, inlinedAt: !386)
!398 = !DILocation(line: 164, column: 34, scope: !383, inlinedAt: !386)
!399 = !DILocation(line: 164, column: 3, scope: !383, inlinedAt: !386)
!400 = !DILocation(line: 165, column: 3, scope: !383, inlinedAt: !386)
!401 = !DILocation(line: 165, column: 8, scope: !383, inlinedAt: !386)
!402 = !DILocation(line: 166, column: 1, scope: !383, inlinedAt: !386)
!403 = !DILocation(line: 217, column: 1, scope: !301)
!404 = distinct !DISubprogram(name: "DestroyExceptionInfo", scope: !165, file: !165, line: 403, type: !405, scopeLine: 404, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !407)
!405 = !DISubroutineType(types: !406)
!406 = !{!122, !122}
!407 = !{!408, !409}
!408 = !DILocalVariable(name: "exception", arg: 1, scope: !404, file: !165, line: 403, type: !122)
!409 = !DILocalVariable(name: "relinquish", scope: !404, file: !165, line: 406, type: !137)
!410 = !DILocation(line: 0, scope: !404)
!411 = !DILocation(line: 410, column: 18, scope: !412)
!412 = distinct !DILexicalBlock(scope: !404, file: !165, line: 410, column: 7)
!413 = !DILocation(line: 410, column: 28, scope: !412)
!414 = !DILocation(line: 410, column: 7, scope: !404)
!415 = !DILocation(line: 411, column: 5, scope: !412)
!416 = !DILocation(line: 412, column: 32, scope: !404)
!417 = !DILocation(line: 412, column: 3, scope: !404)
!418 = !DILocation(line: 413, column: 22, scope: !404)
!419 = !DILocation(line: 414, column: 18, scope: !420)
!420 = distinct !DILexicalBlock(scope: !404, file: !165, line: 414, column: 7)
!421 = !DILocation(line: 414, column: 29, scope: !420)
!422 = !DILocation(line: 414, column: 7, scope: !404)
!423 = !DILocation(line: 416, column: 18, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !165, line: 415, column: 5)
!425 = !DILocation(line: 416, column: 27, scope: !424)
!426 = !DILocation(line: 417, column: 22, scope: !427)
!427 = distinct !DILexicalBlock(scope: !424, file: !165, line: 417, column: 11)
!428 = !DILocation(line: 417, column: 33, scope: !427)
!429 = !DILocation(line: 417, column: 11, scope: !424)
!430 = !DILocation(line: 418, column: 40, scope: !427)
!431 = !DILocation(line: 418, column: 30, scope: !427)
!432 = !DILocation(line: 418, column: 9, scope: !427)
!433 = !DILocation(line: 421, column: 23, scope: !434)
!434 = distinct !DILexicalBlock(scope: !420, file: !165, line: 421, column: 12)
!435 = !DILocation(line: 421, column: 34, scope: !434)
!436 = !DILocation(line: 421, column: 12, scope: !420)
!437 = !DILocation(line: 422, column: 5, scope: !434)
!438 = !DILocation(line: 424, column: 25, scope: !404)
!439 = !DILocation(line: 425, column: 34, scope: !404)
!440 = !DILocation(line: 425, column: 3, scope: !404)
!441 = !DILocation(line: 426, column: 18, scope: !442)
!442 = distinct !DILexicalBlock(scope: !404, file: !165, line: 426, column: 7)
!443 = !DILocation(line: 426, column: 7, scope: !404)
!444 = !DILocation(line: 428, column: 7, scope: !445)
!445 = distinct !DILexicalBlock(scope: !442, file: !165, line: 427, column: 5)
!446 = !DILocation(line: 429, column: 35, scope: !445)
!447 = !DILocation(line: 430, column: 5, scope: !445)
!448 = !DILocation(line: 431, column: 3, scope: !404)
!449 = !DISubprogram(name: "MagickCoreTerminus", scope: !450, file: !450, line: 147, type: !451, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!450 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!451 = !DISubroutineType(types: !452)
!452 = !{null}
!453 = !DILocation(line: 0, scope: !383)
!454 = !DILocation(line: 156, column: 18, scope: !388)
!455 = !DILocation(line: 156, column: 29, scope: !388)
!456 = !DILocation(line: 156, column: 7, scope: !383)
!457 = !DILocation(line: 158, column: 32, scope: !383)
!458 = !DILocation(line: 158, column: 3, scope: !383)
!459 = !DILocation(line: 159, column: 49, scope: !383)
!460 = !DILocation(line: 159, column: 3, scope: !383)
!461 = !DILocation(line: 161, column: 22, scope: !383)
!462 = !DILocation(line: 162, column: 14, scope: !383)
!463 = !DILocation(line: 162, column: 20, scope: !383)
!464 = !DILocation(line: 164, column: 34, scope: !383)
!465 = !DILocation(line: 164, column: 3, scope: !383)
!466 = !DILocation(line: 165, column: 3, scope: !383)
!467 = !DILocation(line: 165, column: 8, scope: !383)
!468 = !DILocation(line: 166, column: 1, scope: !383)
!469 = !DISubprogram(name: "LockSemaphoreInfo", scope: !141, file: !141, line: 37, type: !470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !139}
!472 = !DISubprogram(name: "ClearLinkedList", scope: !149, file: !149, line: 65, type: !473, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !147, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!135, !135}
!478 = distinct !DISubprogram(name: "DestroyExceptionElement", scope: !165, file: !165, line: 138, type: !476, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !479)
!479 = !{!480, !481}
!480 = !DILocalVariable(name: "exception", arg: 1, scope: !478, file: !165, line: 138, type: !135)
!481 = !DILocalVariable(name: "p", scope: !478, file: !165, line: 141, type: !122)
!482 = !DILocation(line: 0, scope: !478)
!483 = !DILocation(line: 144, column: 10, scope: !484)
!484 = distinct !DILexicalBlock(scope: !478, file: !165, line: 144, column: 7)
!485 = !DILocation(line: 144, column: 17, scope: !484)
!486 = !DILocation(line: 144, column: 7, scope: !478)
!487 = !DILocation(line: 145, column: 15, scope: !484)
!488 = !DILocation(line: 145, column: 14, scope: !484)
!489 = !DILocation(line: 145, column: 5, scope: !484)
!490 = !DILocation(line: 146, column: 10, scope: !491)
!491 = distinct !DILexicalBlock(scope: !478, file: !165, line: 146, column: 7)
!492 = !DILocation(line: 146, column: 22, scope: !491)
!493 = !DILocation(line: 146, column: 7, scope: !478)
!494 = !DILocation(line: 147, column: 20, scope: !491)
!495 = !DILocation(line: 147, column: 19, scope: !491)
!496 = !DILocation(line: 147, column: 5, scope: !491)
!497 = !DILocation(line: 148, column: 23, scope: !478)
!498 = !DILocation(line: 149, column: 3, scope: !478)
!499 = !DISubprogram(name: "UnlockSemaphoreInfo", scope: !141, file: !141, line: 39, type: !470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!500 = !DISubprogram(name: "ResetLinkedListIterator", scope: !149, file: !149, line: 77, type: !501, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !147}
!503 = !DISubprogram(name: "GetNextValueInLinkedList", scope: !149, file: !149, line: 69, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!504 = !DISubroutineType(types: !505)
!505 = !{!135, !147}
!506 = !DILocation(line: 0, scope: !323)
!507 = !DILocation(line: 777, column: 7, scope: !330)
!508 = !DILocation(line: 777, column: 23, scope: !330)
!509 = !DILocation(line: 777, column: 7, scope: !323)
!510 = !DILocation(line: 778, column: 5, scope: !330)
!511 = !DILocation(line: 779, column: 1, scope: !323)
!512 = !DILocation(line: 0, scope: !343)
!513 = !DILocation(line: 707, column: 7, scope: !350)
!514 = !DILocation(line: 707, column: 21, scope: !350)
!515 = !DILocation(line: 707, column: 7, scope: !343)
!516 = !DILocation(line: 708, column: 5, scope: !350)
!517 = !DILocation(line: 709, column: 1, scope: !343)
!518 = !DILocation(line: 0, scope: !361)
!519 = !DILocation(line: 743, column: 7, scope: !368)
!520 = !DILocation(line: 743, column: 27, scope: !368)
!521 = !DILocation(line: 743, column: 7, scope: !361)
!522 = !DILocation(line: 744, column: 5, scope: !368)
!523 = !DILocation(line: 745, column: 1, scope: !361)
!524 = distinct !DISubprogram(name: "CloneExceptionInfo", scope: !165, file: !165, line: 241, type: !405, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !525)
!525 = !{!526, !527, !528, !531}
!526 = !DILocalVariable(name: "exception", arg: 1, scope: !524, file: !165, line: 241, type: !122)
!527 = !DILocalVariable(name: "clone_exception", scope: !524, file: !165, line: 244, type: !122)
!528 = !DILocalVariable(name: "message", scope: !529, file: !165, line: 248, type: !131)
!529 = distinct !DILexicalBlock(scope: !530, file: !165, line: 248, column: 5)
!530 = distinct !DILexicalBlock(scope: !524, file: !165, line: 247, column: 7)
!531 = !DILocalVariable(name: "exception", scope: !529, file: !165, line: 248, type: !123)
!532 = !DILocation(line: 0, scope: !524)
!533 = !DILocation(line: 246, column: 37, scope: !524)
!534 = !DILocation(line: 247, column: 23, scope: !530)
!535 = !DILocation(line: 247, column: 7, scope: !524)
!536 = !DILocation(line: 248, column: 5, scope: !529)
!537 = !DILocation(line: 0, scope: !529)
!538 = !DILocation(line: 0, scope: !196, inlinedAt: !539)
!539 = distinct !DILocation(line: 249, column: 3, scope: !524)
!540 = !DILocation(line: 459, column: 10, scope: !196, inlinedAt: !539)
!541 = !DILocation(line: 460, column: 22, scope: !196, inlinedAt: !539)
!542 = !DILocation(line: 461, column: 34, scope: !196, inlinedAt: !539)
!543 = !DILocation(line: 461, column: 14, scope: !196, inlinedAt: !539)
!544 = !DILocation(line: 461, column: 24, scope: !196, inlinedAt: !539)
!545 = !DILocation(line: 462, column: 24, scope: !196, inlinedAt: !539)
!546 = !DILocation(line: 462, column: 14, scope: !196, inlinedAt: !539)
!547 = !DILocation(line: 462, column: 23, scope: !196, inlinedAt: !539)
!548 = !DILocation(line: 463, column: 14, scope: !196, inlinedAt: !539)
!549 = !DILocation(line: 463, column: 23, scope: !196, inlinedAt: !539)
!550 = !DILocation(line: 250, column: 3, scope: !524)
!551 = !DILocation(line: 251, column: 20, scope: !524)
!552 = !DILocation(line: 251, column: 30, scope: !524)
!553 = !DILocation(line: 252, column: 3, scope: !524)
!554 = distinct !DISubprogram(name: "InheritException", scope: !165, file: !165, line: 651, type: !555, scopeLine: 653, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !122, !151}
!557 = !{!558, !559, !560}
!558 = !DILocalVariable(name: "exception", arg: 1, scope: !554, file: !165, line: 651, type: !122)
!559 = !DILocalVariable(name: "relative", arg: 2, scope: !554, file: !165, line: 652, type: !151)
!560 = !DILocalVariable(name: "p", scope: !554, file: !165, line: 655, type: !151)
!561 = !DILocation(line: 0, scope: !554)
!562 = !DILocation(line: 661, column: 17, scope: !563)
!563 = distinct !DILexicalBlock(scope: !554, file: !165, line: 661, column: 7)
!564 = !DILocation(line: 661, column: 28, scope: !563)
!565 = !DILocation(line: 661, column: 7, scope: !554)
!566 = !DILocation(line: 663, column: 31, scope: !554)
!567 = !DILocation(line: 663, column: 3, scope: !554)
!568 = !DILocation(line: 664, column: 56, scope: !554)
!569 = !DILocation(line: 664, column: 3, scope: !554)
!570 = !DILocation(line: 666, column: 15, scope: !554)
!571 = !DILocation(line: 665, column: 29, scope: !554)
!572 = !DILocation(line: 667, column: 12, scope: !554)
!573 = !DILocation(line: 667, column: 3, scope: !554)
!574 = !DILocation(line: 669, column: 40, scope: !575)
!575 = distinct !DILexicalBlock(scope: !554, file: !165, line: 668, column: 3)
!576 = !DILocation(line: 669, column: 52, scope: !575)
!577 = !DILocation(line: 669, column: 62, scope: !575)
!578 = !DILocation(line: 669, column: 12, scope: !575)
!579 = !DILocation(line: 671, column: 17, scope: !575)
!580 = !DILocation(line: 670, column: 31, scope: !575)
!581 = distinct !{!581, !573, !582, !378, !379}
!582 = !DILocation(line: 672, column: 3, scope: !554)
!583 = !DILocation(line: 673, column: 33, scope: !554)
!584 = !DILocation(line: 673, column: 3, scope: !554)
!585 = !DILocation(line: 674, column: 1, scope: !554)
!586 = !DISubprogram(name: "ActivateSemaphoreInfo", scope: !141, file: !141, line: 35, type: !587, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !589}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!590 = !DISubprogram(name: "DestroyLinkedList", scope: !149, file: !149, line: 42, type: !591, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!591 = !DISubroutineType(types: !592)
!592 = !{!147, !147, !475}
!593 = !DISubprogram(name: "DestroySemaphoreInfo", scope: !141, file: !141, line: 36, type: !587, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!594 = !DISubprogram(name: "RelinquishMagickMemory", scope: !224, file: !224, line: 51, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!595 = !DISubprogram(name: "ResetMagickMemory", scope: !224, file: !224, line: 52, type: !596, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!596 = !DISubroutineType(types: !597)
!597 = !{!135, !135, !129, !227}
!598 = !DISubprogram(name: "NewLinkedList", scope: !149, file: !149, line: 43, type: !599, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!599 = !DISubroutineType(types: !600)
!600 = !{!147, !227}
!601 = !DISubprogram(name: "AllocateSemaphoreInfo", scope: !141, file: !141, line: 32, type: !602, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!602 = !DISubroutineType(types: !603)
!603 = !{!139}
!604 = !DISubprogram(name: "CopyMagickString", scope: !298, file: !298, line: 78, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!605 = !DISubroutineType(types: !606)
!606 = !{!144, !131, !153, !227}
!607 = !DISubprogram(name: "ConstantString", scope: !298, file: !298, line: 45, type: !608, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!608 = !DISubroutineType(types: !609)
!609 = !{!131, !153}
!610 = distinct !DISubprogram(name: "GetLocaleExceptionMessage", scope: !165, file: !165, line: 607, type: !611, scopeLine: 609, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !613)
!611 = !DISubroutineType(types: !612)
!612 = !{!153, !159, !153}
!613 = !{!614, !615, !616, !617}
!614 = !DILocalVariable(name: "severity", arg: 1, scope: !610, file: !165, line: 607, type: !159)
!615 = !DILocalVariable(name: "tag", arg: 2, scope: !610, file: !165, line: 608, type: !153)
!616 = !DILocalVariable(name: "message", scope: !610, file: !165, line: 611, type: !248)
!617 = !DILocalVariable(name: "locale_message", scope: !610, file: !165, line: 614, type: !153)
!618 = !DILocation(line: 0, scope: !610)
!619 = !DILocation(line: 610, column: 3, scope: !610)
!620 = !DILocation(line: 611, column: 5, scope: !610)
!621 = !DILocalVariable(name: "severity", arg: 1, scope: !622, file: !165, line: 535, type: !159)
!622 = distinct !DISubprogram(name: "ExceptionSeverityToTag", scope: !165, file: !165, line: 535, type: !623, scopeLine: 536, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !625)
!623 = !DISubroutineType(types: !624)
!624 = !{!153, !159}
!625 = !{!621}
!626 = !DILocation(line: 0, scope: !622, inlinedAt: !627)
!627 = distinct !DILocation(line: 618, column: 5, scope: !610)
!628 = !DILocation(line: 537, column: 3, scope: !622, inlinedAt: !627)
!629 = !DILocation(line: 540, column: 23, scope: !630, inlinedAt: !627)
!630 = distinct !DILexicalBlock(scope: !622, file: !165, line: 538, column: 3)
!631 = !DILocation(line: 541, column: 25, scope: !630, inlinedAt: !627)
!632 = !DILocation(line: 542, column: 27, scope: !630, inlinedAt: !627)
!633 = !DILocation(line: 543, column: 34, scope: !630, inlinedAt: !627)
!634 = !DILocation(line: 544, column: 31, scope: !630, inlinedAt: !627)
!635 = !DILocation(line: 545, column: 27, scope: !630, inlinedAt: !627)
!636 = !DILocation(line: 546, column: 23, scope: !630, inlinedAt: !627)
!637 = !DILocation(line: 547, column: 25, scope: !630, inlinedAt: !627)
!638 = !DILocation(line: 548, column: 24, scope: !630, inlinedAt: !627)
!639 = !DILocation(line: 549, column: 24, scope: !630, inlinedAt: !627)
!640 = !DILocation(line: 550, column: 25, scope: !630, inlinedAt: !627)
!641 = !DILocation(line: 551, column: 25, scope: !630, inlinedAt: !627)
!642 = !DILocation(line: 552, column: 23, scope: !630, inlinedAt: !627)
!643 = !DILocation(line: 553, column: 24, scope: !630, inlinedAt: !627)
!644 = !DILocation(line: 554, column: 23, scope: !630, inlinedAt: !627)
!645 = !DILocation(line: 555, column: 26, scope: !630, inlinedAt: !627)
!646 = !DILocation(line: 556, column: 26, scope: !630, inlinedAt: !627)
!647 = !DILocation(line: 557, column: 27, scope: !630, inlinedAt: !627)
!648 = !DILocation(line: 558, column: 28, scope: !630, inlinedAt: !627)
!649 = !DILocation(line: 559, column: 25, scope: !630, inlinedAt: !627)
!650 = !DILocation(line: 560, column: 30, scope: !630, inlinedAt: !627)
!651 = !DILocation(line: 561, column: 21, scope: !630, inlinedAt: !627)
!652 = !DILocation(line: 562, column: 23, scope: !630, inlinedAt: !627)
!653 = !DILocation(line: 563, column: 25, scope: !630, inlinedAt: !627)
!654 = !DILocation(line: 564, column: 32, scope: !630, inlinedAt: !627)
!655 = !DILocation(line: 565, column: 29, scope: !630, inlinedAt: !627)
!656 = !DILocation(line: 566, column: 25, scope: !630, inlinedAt: !627)
!657 = !DILocation(line: 567, column: 21, scope: !630, inlinedAt: !627)
!658 = !DILocation(line: 568, column: 23, scope: !630, inlinedAt: !627)
!659 = !DILocation(line: 569, column: 22, scope: !630, inlinedAt: !627)
!660 = !DILocation(line: 570, column: 22, scope: !630, inlinedAt: !627)
!661 = !DILocation(line: 571, column: 23, scope: !630, inlinedAt: !627)
!662 = !DILocation(line: 572, column: 23, scope: !630, inlinedAt: !627)
!663 = !DILocation(line: 573, column: 21, scope: !630, inlinedAt: !627)
!664 = !DILocation(line: 574, column: 22, scope: !630, inlinedAt: !627)
!665 = !DILocation(line: 575, column: 21, scope: !630, inlinedAt: !627)
!666 = !DILocation(line: 576, column: 24, scope: !630, inlinedAt: !627)
!667 = !DILocation(line: 577, column: 24, scope: !630, inlinedAt: !627)
!668 = !DILocation(line: 578, column: 25, scope: !630, inlinedAt: !627)
!669 = !DILocation(line: 579, column: 26, scope: !630, inlinedAt: !627)
!670 = !DILocation(line: 580, column: 23, scope: !630, inlinedAt: !627)
!671 = !DILocation(line: 581, column: 35, scope: !630, inlinedAt: !627)
!672 = !DILocation(line: 582, column: 26, scope: !630, inlinedAt: !627)
!673 = !DILocation(line: 583, column: 28, scope: !630, inlinedAt: !627)
!674 = !DILocation(line: 584, column: 30, scope: !630, inlinedAt: !627)
!675 = !DILocation(line: 585, column: 37, scope: !630, inlinedAt: !627)
!676 = !DILocation(line: 586, column: 34, scope: !630, inlinedAt: !627)
!677 = !DILocation(line: 587, column: 30, scope: !630, inlinedAt: !627)
!678 = !DILocation(line: 588, column: 26, scope: !630, inlinedAt: !627)
!679 = !DILocation(line: 589, column: 28, scope: !630, inlinedAt: !627)
!680 = !DILocation(line: 590, column: 27, scope: !630, inlinedAt: !627)
!681 = !DILocation(line: 591, column: 27, scope: !630, inlinedAt: !627)
!682 = !DILocation(line: 592, column: 28, scope: !630, inlinedAt: !627)
!683 = !DILocation(line: 593, column: 28, scope: !630, inlinedAt: !627)
!684 = !DILocation(line: 594, column: 26, scope: !630, inlinedAt: !627)
!685 = !DILocation(line: 595, column: 27, scope: !630, inlinedAt: !627)
!686 = !DILocation(line: 596, column: 26, scope: !630, inlinedAt: !627)
!687 = !DILocation(line: 597, column: 29, scope: !630, inlinedAt: !627)
!688 = !DILocation(line: 598, column: 29, scope: !630, inlinedAt: !627)
!689 = !DILocation(line: 599, column: 30, scope: !630, inlinedAt: !627)
!690 = !DILocation(line: 600, column: 31, scope: !630, inlinedAt: !627)
!691 = !DILocation(line: 601, column: 28, scope: !630, inlinedAt: !627)
!692 = !DILocation(line: 604, column: 3, scope: !622, inlinedAt: !627)
!693 = !DILocation(line: 617, column: 10, scope: !610)
!694 = !DILocation(line: 619, column: 18, scope: !610)
!695 = !DILocation(line: 620, column: 22, scope: !696)
!696 = distinct !DILexicalBlock(scope: !610, file: !165, line: 620, column: 7)
!697 = !DILocation(line: 620, column: 7, scope: !610)
!698 = !DILocation(line: 622, column: 22, scope: !699)
!699 = distinct !DILexicalBlock(scope: !610, file: !165, line: 622, column: 7)
!700 = !DILocation(line: 625, column: 1, scope: !610)
!701 = !DISubprogram(name: "FormatLocaleString", scope: !702, file: !702, line: 71, type: !703, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!702 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "156c27c5fb4b55284e5f6c924766571a")
!703 = !DISubroutineType(types: !704)
!704 = !{!705, !709, !227, !710, null}
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !275, line: 77, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !707, line: 193, baseType: !708)
!707 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!708 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!709 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !131)
!710 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !153)
!711 = !DISubprogram(name: "GetLocaleMessage", scope: !702, file: !702, line: 49, type: !712, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!712 = !DISubroutineType(types: !713)
!713 = !{!153, !153}
!714 = distinct !DISubprogram(name: "ThrowException", scope: !165, file: !165, line: 911, type: !715, scopeLine: 913, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{!137, !122, !159, !153, !153}
!717 = !{!718, !719, !720, !721, !722, !723, !727}
!718 = !DILocalVariable(name: "exception", arg: 1, scope: !714, file: !165, line: 911, type: !122)
!719 = !DILocalVariable(name: "severity", arg: 2, scope: !714, file: !165, line: 912, type: !159)
!720 = !DILocalVariable(name: "reason", arg: 3, scope: !714, file: !165, line: 912, type: !153)
!721 = !DILocalVariable(name: "description", arg: 4, scope: !714, file: !165, line: 912, type: !153)
!722 = !DILocalVariable(name: "p", scope: !714, file: !165, line: 915, type: !122)
!723 = !DILocalVariable(name: "message", scope: !724, file: !165, line: 933, type: !131)
!724 = distinct !DILexicalBlock(scope: !725, file: !165, line: 933, column: 7)
!725 = distinct !DILexicalBlock(scope: !726, file: !165, line: 931, column: 5)
!726 = distinct !DILexicalBlock(scope: !714, file: !165, line: 930, column: 7)
!727 = !DILocalVariable(name: "exception", scope: !724, file: !165, line: 933, type: !123)
!728 = !DILocation(line: 0, scope: !714)
!729 = !DILocation(line: 919, column: 32, scope: !714)
!730 = !DILocation(line: 919, column: 3, scope: !714)
!731 = !DILocation(line: 921, column: 16, scope: !714)
!732 = !DILocation(line: 920, column: 23, scope: !714)
!733 = !DILocation(line: 922, column: 10, scope: !734)
!734 = distinct !DILexicalBlock(scope: !714, file: !165, line: 922, column: 7)
!735 = !DILocation(line: 922, column: 37, scope: !734)
!736 = !DILocation(line: 922, column: 44, scope: !734)
!737 = !DILocation(line: 922, column: 53, scope: !734)
!738 = !DILocation(line: 922, column: 66, scope: !734)
!739 = !DILocation(line: 923, column: 33, scope: !734)
!740 = !DILocation(line: 923, column: 8, scope: !734)
!741 = !DILocation(line: 923, column: 48, scope: !734)
!742 = !DILocation(line: 923, column: 54, scope: !734)
!743 = !DILocation(line: 924, column: 33, scope: !734)
!744 = !DILocation(line: 924, column: 8, scope: !734)
!745 = !DILocation(line: 924, column: 58, scope: !734)
!746 = !DILocation(line: 922, column: 7, scope: !714)
!747 = !DILocation(line: 929, column: 23, scope: !714)
!748 = !DILocation(line: 930, column: 9, scope: !726)
!749 = !DILocation(line: 930, column: 7, scope: !714)
!750 = !DILocation(line: 932, column: 38, scope: !725)
!751 = !DILocation(line: 932, column: 7, scope: !725)
!752 = !DILocation(line: 933, column: 7, scope: !724)
!753 = !DILocation(line: 0, scope: !724)
!754 = !DILocation(line: 935, column: 10, scope: !714)
!755 = !DILocation(line: 936, column: 14, scope: !714)
!756 = !DILocation(line: 937, column: 14, scope: !757)
!757 = distinct !DILexicalBlock(scope: !714, file: !165, line: 937, column: 7)
!758 = !DILocation(line: 937, column: 7, scope: !714)
!759 = !DILocation(line: 938, column: 15, scope: !757)
!760 = !DILocation(line: 938, column: 8, scope: !757)
!761 = !DILocation(line: 938, column: 14, scope: !757)
!762 = !DILocation(line: 938, column: 5, scope: !757)
!763 = !DILocation(line: 939, column: 19, scope: !764)
!764 = distinct !DILexicalBlock(scope: !714, file: !165, line: 939, column: 7)
!765 = !DILocation(line: 939, column: 7, scope: !714)
!766 = !DILocation(line: 940, column: 20, scope: !764)
!767 = !DILocation(line: 940, column: 8, scope: !764)
!768 = !DILocation(line: 940, column: 19, scope: !764)
!769 = !DILocation(line: 940, column: 5, scope: !764)
!770 = !DILocation(line: 941, column: 6, scope: !714)
!771 = !DILocation(line: 941, column: 15, scope: !714)
!772 = !DILocation(line: 942, column: 64, scope: !714)
!773 = !DILocation(line: 942, column: 10, scope: !714)
!774 = !DILocation(line: 943, column: 10, scope: !775)
!775 = distinct !DILexicalBlock(scope: !714, file: !165, line: 943, column: 7)
!776 = !DILocation(line: 943, column: 33, scope: !775)
!777 = !DILocation(line: 943, column: 19, scope: !775)
!778 = !DILocation(line: 943, column: 7, scope: !714)
!779 = !DILocation(line: 945, column: 26, scope: !780)
!780 = distinct !DILexicalBlock(scope: !775, file: !165, line: 944, column: 5)
!781 = !DILocation(line: 946, column: 28, scope: !780)
!782 = !DILocation(line: 946, column: 18, scope: !780)
!783 = !DILocation(line: 946, column: 24, scope: !780)
!784 = !DILocation(line: 947, column: 33, scope: !780)
!785 = !DILocation(line: 947, column: 18, scope: !780)
!786 = !DILocation(line: 947, column: 29, scope: !780)
!787 = !DILocation(line: 948, column: 5, scope: !780)
!788 = !DILocation(line: 951, column: 1, scope: !714)
!789 = distinct !DISubprogram(name: "SetErrorHandler", scope: !165, file: !165, line: 804, type: !790, scopeLine: 805, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !792)
!790 = !DISubroutineType(types: !791)
!791 = !{!155, !155}
!792 = !{!793, !794}
!793 = !DILocalVariable(name: "handler", arg: 1, scope: !789, file: !165, line: 804, type: !155)
!794 = !DILocalVariable(name: "previous_handler", scope: !789, file: !165, line: 807, type: !155)
!795 = !DILocation(line: 0, scope: !789)
!796 = !DILocation(line: 809, column: 20, scope: !789)
!797 = !DILocation(line: 810, column: 16, scope: !789)
!798 = !DILocation(line: 811, column: 3, scope: !789)
!799 = distinct !DISubprogram(name: "SetFatalErrorHandler", scope: !165, file: !165, line: 837, type: !800, scopeLine: 838, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !802)
!800 = !DISubroutineType(types: !801)
!801 = !{!166, !166}
!802 = !{!803, !804}
!803 = !DILocalVariable(name: "handler", arg: 1, scope: !799, file: !165, line: 837, type: !166)
!804 = !DILocalVariable(name: "previous_handler", scope: !799, file: !165, line: 840, type: !166)
!805 = !DILocation(line: 0, scope: !799)
!806 = !DILocation(line: 842, column: 20, scope: !799)
!807 = !DILocation(line: 843, column: 22, scope: !799)
!808 = !DILocation(line: 844, column: 3, scope: !799)
!809 = distinct !DISubprogram(name: "SetWarningHandler", scope: !165, file: !165, line: 870, type: !810, scopeLine: 871, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !812)
!810 = !DISubroutineType(types: !811)
!811 = !{!160, !160}
!812 = !{!813, !814}
!813 = !DILocalVariable(name: "handler", arg: 1, scope: !809, file: !165, line: 870, type: !160)
!814 = !DILocalVariable(name: "previous_handler", scope: !809, file: !165, line: 873, type: !160)
!815 = !DILocation(line: 0, scope: !809)
!816 = !DILocation(line: 875, column: 20, scope: !809)
!817 = !DILocation(line: 876, column: 18, scope: !809)
!818 = !DILocation(line: 877, column: 3, scope: !809)
!819 = !DISubprogram(name: "GetLastValueInLinkedList", scope: !149, file: !149, line: 66, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!820 = !DISubprogram(name: "LocaleCompare", scope: !298, file: !298, line: 66, type: !821, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!821 = !DISubroutineType(types: !822)
!822 = !{!129, !153, !153}
!823 = !DISubprogram(name: "AppendValueToLinkedList", scope: !149, file: !149, line: 46, type: !824, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!824 = !DISubroutineType(types: !825)
!825 = !{!137, !147, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!828 = distinct !DISubprogram(name: "ThrowMagickExceptionList", scope: !165, file: !165, line: 991, type: !829, scopeLine: 995, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !832)
!829 = !DISubroutineType(types: !830)
!830 = !{!137, !122, !153, !153, !227, !159, !153, !153, !831}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!833 = !DILocalVariable(name: "exception", arg: 1, scope: !828, file: !165, line: 992, type: !122)
!834 = !DILocalVariable(name: "module", arg: 2, scope: !828, file: !165, line: 992, type: !153)
!835 = !DILocalVariable(name: "function", arg: 3, scope: !828, file: !165, line: 992, type: !153)
!836 = !DILocalVariable(name: "line", arg: 4, scope: !828, file: !165, line: 993, type: !227)
!837 = !DILocalVariable(name: "severity", arg: 5, scope: !828, file: !165, line: 993, type: !159)
!838 = !DILocalVariable(name: "tag", arg: 6, scope: !828, file: !165, line: 993, type: !153)
!839 = !DILocalVariable(name: "format", arg: 7, scope: !828, file: !165, line: 994, type: !153)
!840 = !DILocalVariable(name: "operands", arg: 8, scope: !828, file: !165, line: 994, type: !831)
!841 = !DILocalVariable(name: "message", scope: !828, file: !165, line: 997, type: !248)
!842 = !DILocalVariable(name: "path", scope: !828, file: !165, line: 998, type: !248)
!843 = !DILocalVariable(name: "reason", scope: !828, file: !165, line: 999, type: !248)
!844 = !DILocalVariable(name: "locale", scope: !828, file: !165, line: 1002, type: !153)
!845 = !DILocalVariable(name: "type", scope: !828, file: !165, line: 1003, type: !153)
!846 = !DILocalVariable(name: "n", scope: !828, file: !165, line: 1006, type: !129)
!847 = !DILocalVariable(name: "status", scope: !828, file: !165, line: 1009, type: !137)
!848 = !DILocalVariable(name: "length", scope: !828, file: !165, line: 1012, type: !144)
!849 = !DILocation(line: 0, scope: !828)
!850 = !DILocation(line: 996, column: 3, scope: !828)
!851 = !DILocation(line: 997, column: 5, scope: !828)
!852 = !DILocation(line: 998, column: 5, scope: !828)
!853 = !DILocation(line: 999, column: 5, scope: !828)
!854 = !DILocation(line: 1016, column: 10, scope: !828)
!855 = !DILocation(line: 1017, column: 10, scope: !828)
!856 = !DILocation(line: 1018, column: 10, scope: !828)
!857 = !DILocation(line: 1019, column: 10, scope: !828)
!858 = !DILocation(line: 1021, column: 21, scope: !828)
!859 = !DILocation(line: 1021, column: 42, scope: !828)
!860 = !DILocation(line: 1021, column: 5, scope: !828)
!861 = !DILocation(line: 1025, column: 9, scope: !862)
!862 = distinct !DILexicalBlock(scope: !828, file: !165, line: 1025, column: 7)
!863 = !DILocation(line: 1025, column: 7, scope: !828)
!864 = !DILocation(line: 1026, column: 5, scope: !862)
!865 = !DILocation(line: 1026, column: 28, scope: !862)
!866 = !DILocation(line: 1027, column: 10, scope: !828)
!867 = !DILocation(line: 1028, column: 3, scope: !828)
!868 = !DILocation(line: 1030, column: 38, scope: !869)
!869 = distinct !DILexicalBlock(scope: !828, file: !165, line: 1030, column: 7)
!870 = !DILocation(line: 1032, column: 36, scope: !871)
!871 = distinct !DILexicalBlock(scope: !828, file: !165, line: 1032, column: 7)
!872 = !DILocation(line: 1034, column: 16, scope: !873)
!873 = distinct !DILexicalBlock(scope: !828, file: !165, line: 1034, column: 7)
!874 = !DILocation(line: 1034, column: 7, scope: !828)
!875 = !DILocation(line: 1037, column: 24, scope: !828)
!876 = !DILocation(line: 1036, column: 10, scope: !828)
!877 = !DILocation(line: 1038, column: 10, scope: !828)
!878 = !DILocation(line: 1040, column: 1, scope: !828)
!879 = !DILocation(line: 1039, column: 3, scope: !828)
!880 = !DISubprogram(name: "ConcatenateMagickString", scope: !298, file: !298, line: 76, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!881 = !DISubprogram(name: "LogMagickEvent", scope: !85, file: !85, line: 83, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!882 = !DISubroutineType(types: !883)
!883 = !{!137, !884, !153, !153, !227, !153, null}
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !85, line: 58, baseType: !84)
!886 = !DISubprogram(name: "GetPathComponent", scope: !110, file: !110, line: 68, type: !887, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !153, !889, !131}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathType", file: !110, line: 36, baseType: !109)
!890 = distinct !DISubprogram(name: "DefaultErrorHandler", scope: !165, file: !165, line: 283, type: !157, scopeLine: 285, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !891)
!891 = !{!892, !893, !894}
!892 = !DILocalVariable(name: "severity", arg: 1, scope: !890, file: !165, line: 283, type: !159)
!893 = !DILocalVariable(name: "reason", arg: 2, scope: !890, file: !165, line: 284, type: !153)
!894 = !DILocalVariable(name: "description", arg: 3, scope: !890, file: !165, line: 284, type: !153)
!895 = !DILocation(line: 0, scope: !890)
!896 = !DILocation(line: 288, column: 14, scope: !897)
!897 = distinct !DILexicalBlock(scope: !890, file: !165, line: 288, column: 7)
!898 = !DILocation(line: 288, column: 7, scope: !890)
!899 = !DILocation(line: 290, column: 27, scope: !890)
!900 = !DILocation(line: 290, column: 43, scope: !890)
!901 = !DILocation(line: 290, column: 10, scope: !890)
!902 = !DILocation(line: 291, column: 19, scope: !903)
!903 = distinct !DILexicalBlock(scope: !890, file: !165, line: 291, column: 7)
!904 = !DILocation(line: 291, column: 7, scope: !890)
!905 = !DILocation(line: 292, column: 29, scope: !903)
!906 = !DILocation(line: 292, column: 12, scope: !903)
!907 = !DILocation(line: 292, column: 5, scope: !903)
!908 = !DILocation(line: 293, column: 27, scope: !890)
!909 = !DILocation(line: 293, column: 10, scope: !890)
!910 = !DILocation(line: 294, column: 17, scope: !890)
!911 = !DILocation(line: 294, column: 10, scope: !890)
!912 = !DILocation(line: 295, column: 1, scope: !890)
!913 = !DISubprogram(name: "FormatLocaleFile", scope: !702, file: !702, line: 67, type: !914, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!914 = !DISubroutineType(types: !915)
!915 = !{!705, !916, !710, null}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !918, line: 7, baseType: !919)
!918 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !920, line: 49, size: 1728, elements: !921)
!920 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !937, !939, !940, !941, !943, !945, !947, !949, !952, !954, !957, !960, !961, !962, !963, !964}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !919, file: !920, line: 51, baseType: !129, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !919, file: !920, line: 54, baseType: !131, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !919, file: !920, line: 55, baseType: !131, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !919, file: !920, line: 56, baseType: !131, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !919, file: !920, line: 57, baseType: !131, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !919, file: !920, line: 58, baseType: !131, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !919, file: !920, line: 59, baseType: !131, size: 64, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !919, file: !920, line: 60, baseType: !131, size: 64, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !919, file: !920, line: 61, baseType: !131, size: 64, offset: 512)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !919, file: !920, line: 64, baseType: !131, size: 64, offset: 576)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !919, file: !920, line: 65, baseType: !131, size: 64, offset: 640)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !919, file: !920, line: 66, baseType: !131, size: 64, offset: 704)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !919, file: !920, line: 68, baseType: !935, size: 64, offset: 768)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !920, line: 36, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !919, file: !920, line: 70, baseType: !938, size: 64, offset: 832)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !919, file: !920, line: 72, baseType: !129, size: 32, offset: 896)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !919, file: !920, line: 73, baseType: !129, size: 32, offset: 928)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !919, file: !920, line: 74, baseType: !942, size: 64, offset: 960)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !707, line: 152, baseType: !708)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !919, file: !920, line: 77, baseType: !944, size: 16, offset: 1024)
!944 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !919, file: !920, line: 78, baseType: !946, size: 8, offset: 1040)
!946 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !919, file: !920, line: 79, baseType: !948, size: 8, offset: 1048)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8, elements: !287)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !919, file: !920, line: 81, baseType: !950, size: 64, offset: 1088)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !920, line: 43, baseType: null)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !919, file: !920, line: 89, baseType: !953, size: 64, offset: 1152)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !707, line: 153, baseType: !708)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !919, file: !920, line: 91, baseType: !955, size: 64, offset: 1216)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !920, line: 37, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !919, file: !920, line: 92, baseType: !958, size: 64, offset: 1280)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !920, line: 38, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !919, file: !920, line: 93, baseType: !938, size: 64, offset: 1344)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !919, file: !920, line: 94, baseType: !135, size: 64, offset: 1408)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !919, file: !920, line: 95, baseType: !144, size: 64, offset: 1472)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !919, file: !920, line: 96, baseType: !129, size: 32, offset: 1536)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !919, file: !920, line: 98, baseType: !965, size: 160, offset: 1568)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 160, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 20)
!968 = !DISubprogram(name: "GetClientName", scope: !969, file: !969, line: 27, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!969 = !DIFile(filename: "apps/538.imagick_r/src/magick/client.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "344c97aae512d59869dffffe3d724c6b")
!970 = !DISubroutineType(types: !971)
!971 = !{!153}
!972 = !DISubprogram(name: "fflush", scope: !275, file: !275, line: 218, type: !973, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !228)
!973 = !DISubroutineType(types: !974)
!974 = !{!129, !916}
!975 = distinct !DISubprogram(name: "DefaultFatalErrorHandler", scope: !165, file: !165, line: 325, type: !157, scopeLine: 327, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !976)
!976 = !{!977, !978, !979}
!977 = !DILocalVariable(name: "severity", arg: 1, scope: !975, file: !165, line: 325, type: !159)
!978 = !DILocalVariable(name: "reason", arg: 2, scope: !975, file: !165, line: 326, type: !153)
!979 = !DILocalVariable(name: "description", arg: 3, scope: !975, file: !165, line: 326, type: !153)
!980 = !DILocation(line: 0, scope: !975)
!981 = !DILocation(line: 328, column: 14, scope: !982)
!982 = distinct !DILexicalBlock(scope: !975, file: !165, line: 328, column: 7)
!983 = !DILocation(line: 328, column: 7, scope: !975)
!984 = !DILocation(line: 329, column: 5, scope: !982)
!985 = !DILocation(line: 330, column: 27, scope: !975)
!986 = !DILocation(line: 330, column: 43, scope: !975)
!987 = !DILocation(line: 330, column: 10, scope: !975)
!988 = !DILocation(line: 331, column: 19, scope: !989)
!989 = distinct !DILexicalBlock(scope: !975, file: !165, line: 331, column: 7)
!990 = !DILocation(line: 331, column: 7, scope: !975)
!991 = !DILocation(line: 332, column: 29, scope: !989)
!992 = !DILocation(line: 332, column: 12, scope: !989)
!993 = !DILocation(line: 332, column: 5, scope: !989)
!994 = !DILocation(line: 333, column: 27, scope: !975)
!995 = !DILocation(line: 333, column: 10, scope: !975)
!996 = !DILocation(line: 334, column: 17, scope: !975)
!997 = !DILocation(line: 334, column: 10, scope: !975)
!998 = !DILocation(line: 335, column: 3, scope: !975)
!999 = !DILocation(line: 336, column: 44, scope: !975)
!1000 = !DILocation(line: 336, column: 3, scope: !975)
!1001 = distinct !DISubprogram(name: "DefaultWarningHandler", scope: !165, file: !165, line: 367, type: !157, scopeLine: 369, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DILocalVariable(name: "severity", arg: 1, scope: !1001, file: !165, line: 367, type: !159)
!1004 = !DILocalVariable(name: "reason", arg: 2, scope: !1001, file: !165, line: 368, type: !153)
!1005 = !DILocalVariable(name: "description", arg: 3, scope: !1001, file: !165, line: 368, type: !153)
!1006 = !DILocation(line: 0, scope: !1001)
!1007 = !DILocation(line: 372, column: 14, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1001, file: !165, line: 372, column: 7)
!1009 = !DILocation(line: 372, column: 7, scope: !1001)
!1010 = !DILocation(line: 374, column: 27, scope: !1001)
!1011 = !DILocation(line: 374, column: 43, scope: !1001)
!1012 = !DILocation(line: 374, column: 10, scope: !1001)
!1013 = !DILocation(line: 375, column: 19, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1001, file: !165, line: 375, column: 7)
!1015 = !DILocation(line: 375, column: 7, scope: !1001)
!1016 = !DILocation(line: 376, column: 29, scope: !1014)
!1017 = !DILocation(line: 376, column: 12, scope: !1014)
