; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/feature.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/feature.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._CannyInfo = type { double, double, i32, i64, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Gx", scope: !2, file: !3, line: 353, type: !951, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "CannyEdgeImage", scope: !3, file: !3, line: 241, type: !4, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !597, retainedNodes: !954)
!3 = !DIFile(filename: "apps/538.imagick_r/src/magick/feature.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "8eef5e07433f798bbf5319ab0084c861")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !593, !595, !595, !595, !595, !596}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !8, line: 221, baseType: !9)
!8 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !10, line: 150, size: 105920, elements: !11)
!10 = !DIFile(filename: "apps/538.imagick_r/src/magick/image.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9408eec9abffe54016aa20ae735786b")
!11 = !{!12, !20, !59, !86, !90, !103, !109, !110, !111, !112, !113, !114, !126, !127, !128, !129, !131, !145, !155, !157, !164, !167, !168, !169, !175, !176, !177, !186, !187, !188, !189, !190, !191, !228, !240, !248, !264, !337, !347, !349, !350, !351, !352, !353, !354, !355, !363, !384, !398, !399, !400, !401, !405, !409, !413, !414, !415, !416, !417, !508, !509, !511, !512, !522, !523, !525, !526, !527, !528, !529, !530, !548, !549, !550, !551, !552, !553, !554, !570, !571, !572, !573, !574, !578, !592}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !9, file: !10, line: 153, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !8, line: 209, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 204, baseType: !15, size: 32, elements: !16)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "UndefinedClass", value: 0)
!18 = !DIEnumerator(name: "DirectClass", value: 1)
!19 = !DIEnumerator(name: "PseudoClass", value: 2)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !9, file: !10, line: 156, baseType: !21, size: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !22, line: 61, baseType: !23)
!22 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4f032944b177fc61244445fe3a234334")
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 25, baseType: !15, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!25 = !DIEnumerator(name: "UndefinedColorspace", value: 0)
!26 = !DIEnumerator(name: "RGBColorspace", value: 1)
!27 = !DIEnumerator(name: "GRAYColorspace", value: 2)
!28 = !DIEnumerator(name: "TransparentColorspace", value: 3)
!29 = !DIEnumerator(name: "OHTAColorspace", value: 4)
!30 = !DIEnumerator(name: "LabColorspace", value: 5)
!31 = !DIEnumerator(name: "XYZColorspace", value: 6)
!32 = !DIEnumerator(name: "YCbCrColorspace", value: 7)
!33 = !DIEnumerator(name: "YCCColorspace", value: 8)
!34 = !DIEnumerator(name: "YIQColorspace", value: 9)
!35 = !DIEnumerator(name: "YPbPrColorspace", value: 10)
!36 = !DIEnumerator(name: "YUVColorspace", value: 11)
!37 = !DIEnumerator(name: "CMYKColorspace", value: 12)
!38 = !DIEnumerator(name: "sRGBColorspace", value: 13)
!39 = !DIEnumerator(name: "HSBColorspace", value: 14)
!40 = !DIEnumerator(name: "HSLColorspace", value: 15)
!41 = !DIEnumerator(name: "HWBColorspace", value: 16)
!42 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17)
!43 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18)
!44 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19)
!45 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20)
!46 = !DIEnumerator(name: "LogColorspace", value: 21)
!47 = !DIEnumerator(name: "CMYColorspace", value: 22)
!48 = !DIEnumerator(name: "LuvColorspace", value: 23)
!49 = !DIEnumerator(name: "HCLColorspace", value: 24)
!50 = !DIEnumerator(name: "LCHColorspace", value: 25)
!51 = !DIEnumerator(name: "LMSColorspace", value: 26)
!52 = !DIEnumerator(name: "LCHabColorspace", value: 27)
!53 = !DIEnumerator(name: "LCHuvColorspace", value: 28)
!54 = !DIEnumerator(name: "scRGBColorspace", value: 29)
!55 = !DIEnumerator(name: "HSIColorspace", value: 30)
!56 = !DIEnumerator(name: "HSVColorspace", value: 31)
!57 = !DIEnumerator(name: "HCLpColorspace", value: 32)
!58 = !DIEnumerator(name: "YDbDrColorspace", value: 33)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !9, file: !10, line: 159, baseType: !60, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !61, line: 49, baseType: !62)
!61 = !DIFile(filename: "apps/538.imagick_r/src/magick/compress.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "359677d10ff2e6d05d86b0a6c5af7465")
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 25, baseType: !15, size: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85}
!64 = !DIEnumerator(name: "UndefinedCompression", value: 0)
!65 = !DIEnumerator(name: "NoCompression", value: 1)
!66 = !DIEnumerator(name: "BZipCompression", value: 2)
!67 = !DIEnumerator(name: "DXT1Compression", value: 3)
!68 = !DIEnumerator(name: "DXT3Compression", value: 4)
!69 = !DIEnumerator(name: "DXT5Compression", value: 5)
!70 = !DIEnumerator(name: "FaxCompression", value: 6)
!71 = !DIEnumerator(name: "Group4Compression", value: 7)
!72 = !DIEnumerator(name: "JPEGCompression", value: 8)
!73 = !DIEnumerator(name: "JPEG2000Compression", value: 9)
!74 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10)
!75 = !DIEnumerator(name: "LZWCompression", value: 11)
!76 = !DIEnumerator(name: "RLECompression", value: 12)
!77 = !DIEnumerator(name: "ZipCompression", value: 13)
!78 = !DIEnumerator(name: "ZipSCompression", value: 14)
!79 = !DIEnumerator(name: "PizCompression", value: 15)
!80 = !DIEnumerator(name: "Pxr24Compression", value: 16)
!81 = !DIEnumerator(name: "B44Compression", value: 17)
!82 = !DIEnumerator(name: "B44ACompression", value: 18)
!83 = !DIEnumerator(name: "LZMACompression", value: 19)
!84 = !DIEnumerator(name: "JBIG1Compression", value: 20)
!85 = !DIEnumerator(name: "JBIG2Compression", value: 21)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !9, file: !10, line: 162, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 46, baseType: !89)
!88 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!89 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !9, file: !10, line: 165, baseType: !91, size: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !10, line: 86, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 75, baseType: !15, size: 32, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102}
!94 = !DIEnumerator(name: "UndefinedOrientation", value: 0)
!95 = !DIEnumerator(name: "TopLeftOrientation", value: 1)
!96 = !DIEnumerator(name: "TopRightOrientation", value: 2)
!97 = !DIEnumerator(name: "BottomRightOrientation", value: 3)
!98 = !DIEnumerator(name: "BottomLeftOrientation", value: 4)
!99 = !DIEnumerator(name: "LeftTopOrientation", value: 5)
!100 = !DIEnumerator(name: "RightTopOrientation", value: 6)
!101 = !DIEnumerator(name: "RightBottomOrientation", value: 7)
!102 = !DIEnumerator(name: "LeftBottomOrientation", value: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !9, file: !10, line: 168, baseType: !104, size: 32, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !8, line: 215, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 211, baseType: !15, size: 32, elements: !106)
!106 = !{!107, !108}
!107 = !DIEnumerator(name: "MagickFalse", value: 0)
!108 = !DIEnumerator(name: "MagickTrue", value: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !9, file: !10, line: 169, baseType: !104, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !9, file: !10, line: 172, baseType: !87, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !9, file: !10, line: 173, baseType: !87, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !9, file: !10, line: 174, baseType: !87, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !9, file: !10, line: 175, baseType: !87, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !9, file: !10, line: 178, baseType: !115, size: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !117, line: 148, baseType: !118)
!117 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !117, line: 131, size: 64, elements: !119)
!119 = !{!120, !123, !124, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !118, file: !117, line: 143, baseType: !121, size: 16)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !8, line: 93, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !118, file: !117, line: 144, baseType: !121, size: 16, offset: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !118, file: !117, line: 145, baseType: !121, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !118, file: !117, line: 146, baseType: !121, size: 16, offset: 48)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !9, file: !10, line: 179, baseType: !116, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !9, file: !10, line: 180, baseType: !116, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !9, file: !10, line: 181, baseType: !116, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !9, file: !10, line: 184, baseType: !130, size: 64, offset: 832)
!130 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !9, file: !10, line: 187, baseType: !132, size: 768, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !10, line: 128, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !10, line: 121, size: 768, elements: !134)
!134 = !{!135, !142, !143, !144}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !133, file: !10, line: 124, baseType: !136, size: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !10, line: 101, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !10, line: 95, size: 192, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !137, file: !10, line: 98, baseType: !130, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !137, file: !10, line: 99, baseType: !130, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !137, file: !10, line: 100, baseType: !130, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !133, file: !10, line: 125, baseType: !136, size: 192, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !133, file: !10, line: 126, baseType: !136, size: 192, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !133, file: !10, line: 127, baseType: !136, size: 192, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !9, file: !10, line: 190, baseType: !146, size: 32, offset: 1664)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !147, line: 49, baseType: !148)
!147 = !DIFile(filename: "apps/538.imagick_r/src/magick/profile.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fb61c1ae348c42a2b68ac081d4b39ee3")
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 42, baseType: !15, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153, !154}
!150 = !DIEnumerator(name: "UndefinedIntent", value: 0)
!151 = !DIEnumerator(name: "SaturationIntent", value: 1)
!152 = !DIEnumerator(name: "PerceptualIntent", value: 2)
!153 = !DIEnumerator(name: "AbsoluteIntent", value: 3)
!154 = !DIEnumerator(name: "RelativeIntent", value: 4)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !9, file: !10, line: 193, baseType: !156, size: 64, offset: 1728)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !9, file: !10, line: 196, baseType: !158, size: 32, offset: 1792)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !10, line: 93, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 88, baseType: !15, size: 32, elements: !160)
!160 = !{!161, !162, !163}
!161 = !DIEnumerator(name: "UndefinedResolution", value: 0)
!162 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1)
!163 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !9, file: !10, line: 199, baseType: !165, size: 64, offset: 1856)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !9, file: !10, line: 200, baseType: !165, size: 64, offset: 1920)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !9, file: !10, line: 201, baseType: !165, size: 64, offset: 1984)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !9, file: !10, line: 204, baseType: !170, size: 64, offset: 2048)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !171, line: 77, baseType: !172)
!171 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !173, line: 193, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!174 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !9, file: !10, line: 207, baseType: !130, size: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !9, file: !10, line: 208, baseType: !130, size: 64, offset: 2176)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !9, file: !10, line: 211, baseType: !178, size: 256, offset: 2240)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !179, line: 130, baseType: !180)
!179 = !DIFile(filename: "apps/538.imagick_r/src/magick/geometry.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "889bed117eb2a2fce6e2622bd130bcd2")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !179, line: 121, size: 256, elements: !181)
!181 = !{!182, !183, !184, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !180, file: !179, line: 124, baseType: !87, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !180, file: !179, line: 125, baseType: !87, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !180, file: !179, line: 128, baseType: !170, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !180, file: !179, line: 129, baseType: !170, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !9, file: !10, line: 212, baseType: !178, size: 256, offset: 2496)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !9, file: !10, line: 213, baseType: !178, size: 256, offset: 2752)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !9, file: !10, line: 216, baseType: !130, size: 64, offset: 3008)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !9, file: !10, line: 217, baseType: !130, size: 64, offset: 3072)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !9, file: !10, line: 218, baseType: !130, size: 64, offset: 3136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !9, file: !10, line: 221, baseType: !192, size: 32, offset: 3200)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !193, line: 66, baseType: !194)
!193 = !DIFile(filename: "apps/538.imagick_r/src/magick/resample.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "722fed6aaf07c122ede72839e4dadc42")
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 32, baseType: !15, size: 32, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!196 = !DIEnumerator(name: "UndefinedFilter", value: 0)
!197 = !DIEnumerator(name: "PointFilter", value: 1)
!198 = !DIEnumerator(name: "BoxFilter", value: 2)
!199 = !DIEnumerator(name: "TriangleFilter", value: 3)
!200 = !DIEnumerator(name: "HermiteFilter", value: 4)
!201 = !DIEnumerator(name: "HanningFilter", value: 5)
!202 = !DIEnumerator(name: "HammingFilter", value: 6)
!203 = !DIEnumerator(name: "BlackmanFilter", value: 7)
!204 = !DIEnumerator(name: "GaussianFilter", value: 8)
!205 = !DIEnumerator(name: "QuadraticFilter", value: 9)
!206 = !DIEnumerator(name: "CubicFilter", value: 10)
!207 = !DIEnumerator(name: "CatromFilter", value: 11)
!208 = !DIEnumerator(name: "MitchellFilter", value: 12)
!209 = !DIEnumerator(name: "JincFilter", value: 13)
!210 = !DIEnumerator(name: "SincFilter", value: 14)
!211 = !DIEnumerator(name: "SincFastFilter", value: 15)
!212 = !DIEnumerator(name: "KaiserFilter", value: 16)
!213 = !DIEnumerator(name: "WelshFilter", value: 17)
!214 = !DIEnumerator(name: "ParzenFilter", value: 18)
!215 = !DIEnumerator(name: "BohmanFilter", value: 19)
!216 = !DIEnumerator(name: "BartlettFilter", value: 20)
!217 = !DIEnumerator(name: "LagrangeFilter", value: 21)
!218 = !DIEnumerator(name: "LanczosFilter", value: 22)
!219 = !DIEnumerator(name: "LanczosSharpFilter", value: 23)
!220 = !DIEnumerator(name: "Lanczos2Filter", value: 24)
!221 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25)
!222 = !DIEnumerator(name: "RobidouxFilter", value: 26)
!223 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27)
!224 = !DIEnumerator(name: "CosineFilter", value: 28)
!225 = !DIEnumerator(name: "SplineFilter", value: 29)
!226 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30)
!227 = !DIEnumerator(name: "SentinelFilter", value: 31)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !9, file: !10, line: 224, baseType: !229, size: 32, offset: 3232)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !10, line: 73, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 63, baseType: !15, size: 32, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239}
!232 = !DIEnumerator(name: "UndefinedInterlace", value: 0)
!233 = !DIEnumerator(name: "NoInterlace", value: 1)
!234 = !DIEnumerator(name: "LineInterlace", value: 2)
!235 = !DIEnumerator(name: "PlaneInterlace", value: 3)
!236 = !DIEnumerator(name: "PartitionInterlace", value: 4)
!237 = !DIEnumerator(name: "GIFInterlace", value: 5)
!238 = !DIEnumerator(name: "JPEGInterlace", value: 6)
!239 = !DIEnumerator(name: "PNGInterlace", value: 7)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !9, file: !10, line: 227, baseType: !241, size: 32, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !242, line: 35, baseType: !243)
!242 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1f6eaed79d9a4eaf712cd066f6ff022a")
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !242, line: 30, baseType: !15, size: 32, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIEnumerator(name: "UndefinedEndian", value: 0)
!246 = !DIEnumerator(name: "LSBEndian", value: 1)
!247 = !DIEnumerator(name: "MSBEndian", value: 2)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !9, file: !10, line: 230, baseType: !249, size: 32, offset: 3296)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !179, line: 91, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !179, line: 77, baseType: !15, size: 32, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!252 = !DIEnumerator(name: "UndefinedGravity", value: 0)
!253 = !DIEnumerator(name: "ForgetGravity", value: 0)
!254 = !DIEnumerator(name: "NorthWestGravity", value: 1)
!255 = !DIEnumerator(name: "NorthGravity", value: 2)
!256 = !DIEnumerator(name: "NorthEastGravity", value: 3)
!257 = !DIEnumerator(name: "WestGravity", value: 4)
!258 = !DIEnumerator(name: "CenterGravity", value: 5)
!259 = !DIEnumerator(name: "EastGravity", value: 6)
!260 = !DIEnumerator(name: "SouthWestGravity", value: 7)
!261 = !DIEnumerator(name: "SouthGravity", value: 8)
!262 = !DIEnumerator(name: "SouthEastGravity", value: 9)
!263 = !DIEnumerator(name: "StaticGravity", value: 10)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !9, file: !10, line: 233, baseType: !265, size: 32, offset: 3328)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !266, line: 99, baseType: !267)
!266 = !DIFile(filename: "apps/538.imagick_r/src/magick/composite.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "837959ddb1dc628f80f1f9b5cdda1fb4")
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !266, line: 25, baseType: !15, size: 32, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!269 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0)
!270 = !DIEnumerator(name: "NoCompositeOp", value: 1)
!271 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2)
!272 = !DIEnumerator(name: "AtopCompositeOp", value: 3)
!273 = !DIEnumerator(name: "BlendCompositeOp", value: 4)
!274 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5)
!275 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6)
!276 = !DIEnumerator(name: "ClearCompositeOp", value: 7)
!277 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8)
!278 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9)
!279 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10)
!280 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11)
!281 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12)
!282 = !DIEnumerator(name: "CopyCompositeOp", value: 13)
!283 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14)
!284 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15)
!285 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16)
!286 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17)
!287 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18)
!288 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19)
!289 = !DIEnumerator(name: "DarkenCompositeOp", value: 20)
!290 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21)
!291 = !DIEnumerator(name: "DstCompositeOp", value: 22)
!292 = !DIEnumerator(name: "DstInCompositeOp", value: 23)
!293 = !DIEnumerator(name: "DstOutCompositeOp", value: 24)
!294 = !DIEnumerator(name: "DstOverCompositeOp", value: 25)
!295 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26)
!296 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27)
!297 = !DIEnumerator(name: "DissolveCompositeOp", value: 28)
!298 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29)
!299 = !DIEnumerator(name: "HardLightCompositeOp", value: 30)
!300 = !DIEnumerator(name: "HueCompositeOp", value: 31)
!301 = !DIEnumerator(name: "InCompositeOp", value: 32)
!302 = !DIEnumerator(name: "LightenCompositeOp", value: 33)
!303 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34)
!304 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35)
!305 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36)
!306 = !DIEnumerator(name: "ModulateCompositeOp", value: 37)
!307 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38)
!308 = !DIEnumerator(name: "OutCompositeOp", value: 39)
!309 = !DIEnumerator(name: "OverCompositeOp", value: 40)
!310 = !DIEnumerator(name: "OverlayCompositeOp", value: 41)
!311 = !DIEnumerator(name: "PlusCompositeOp", value: 42)
!312 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43)
!313 = !DIEnumerator(name: "SaturateCompositeOp", value: 44)
!314 = !DIEnumerator(name: "ScreenCompositeOp", value: 45)
!315 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46)
!316 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47)
!317 = !DIEnumerator(name: "SrcCompositeOp", value: 48)
!318 = !DIEnumerator(name: "SrcInCompositeOp", value: 49)
!319 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50)
!320 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51)
!321 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52)
!322 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53)
!323 = !DIEnumerator(name: "XorCompositeOp", value: 54)
!324 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55)
!325 = !DIEnumerator(name: "DistortCompositeOp", value: 56)
!326 = !DIEnumerator(name: "BlurCompositeOp", value: 57)
!327 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58)
!328 = !DIEnumerator(name: "VividLightCompositeOp", value: 59)
!329 = !DIEnumerator(name: "PinLightCompositeOp", value: 60)
!330 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61)
!331 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62)
!332 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63)
!333 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64)
!334 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65)
!335 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66)
!336 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !9, file: !10, line: 236, baseType: !338, size: 32, offset: 3360)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !339, line: 32, baseType: !340)
!339 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !339, line: 25, baseType: !15, size: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346}
!342 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!343 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!344 = !DIEnumerator(name: "NoneDispose", value: 1)
!345 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!346 = !DIEnumerator(name: "PreviousDispose", value: 3)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !9, file: !10, line: 239, baseType: !348, size: 64, offset: 3392)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !9, file: !10, line: 242, baseType: !87, size: 64, offset: 3456)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !9, file: !10, line: 243, baseType: !87, size: 64, offset: 3520)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !9, file: !10, line: 246, baseType: !170, size: 64, offset: 3584)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !9, file: !10, line: 249, baseType: !87, size: 64, offset: 3648)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !9, file: !10, line: 250, baseType: !87, size: 64, offset: 3712)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !9, file: !10, line: 253, baseType: !170, size: 64, offset: 3776)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !9, file: !10, line: 256, baseType: !356, size: 192, offset: 3840)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !357, line: 68, baseType: !358)
!357 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !357, line: 62, size: 192, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !358, file: !357, line: 65, baseType: !130, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !358, file: !357, line: 66, baseType: !130, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !358, file: !357, line: 67, baseType: !130, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !9, file: !10, line: 259, baseType: !364, size: 512, offset: 4032)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !365, line: 51, baseType: !366)
!365 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !365, line: 40, size: 512, elements: !367)
!367 = !{!368, !375, !376, !383}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !366, file: !365, line: 43, baseType: !369, size: 192)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !365, line: 38, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !365, line: 32, size: 192, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !370, file: !365, line: 35, baseType: !130, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !370, file: !365, line: 36, baseType: !130, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !370, file: !365, line: 37, baseType: !130, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !366, file: !365, line: 44, baseType: !369, size: 192, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !366, file: !365, line: 47, baseType: !377, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !365, line: 30, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 25, baseType: !15, size: 32, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!381 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!382 = !DIEnumerator(name: "RunningTimerState", value: 2)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !366, file: !365, line: 50, baseType: !87, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !9, file: !10, line: 262, baseType: !385, size: 64, offset: 4544)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !386, line: 26, baseType: !387)
!386 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!104, !390, !392, !395, !156}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !8, line: 150, baseType: !394)
!394 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !8, line: 151, baseType: !397)
!397 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !9, file: !10, line: 265, baseType: !156, size: 64, offset: 4608)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !9, file: !10, line: 266, baseType: !156, size: 64, offset: 4672)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !9, file: !10, line: 267, baseType: !156, size: 64, offset: 4736)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !9, file: !10, line: 270, baseType: !402, size: 64, offset: 4800)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !61, line: 52, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !61, line: 51, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !9, file: !10, line: 273, baseType: !406, size: 64, offset: 4864)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !8, line: 217, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !8, line: 217, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !9, file: !10, line: 276, baseType: !410, size: 32768, offset: 4928)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 32768, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 4096)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !9, file: !10, line: 277, baseType: !410, size: 32768, offset: 37696)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !9, file: !10, line: 278, baseType: !410, size: 32768, offset: 70464)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !9, file: !10, line: 281, baseType: !87, size: 64, offset: 103232)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !9, file: !10, line: 282, baseType: !87, size: 64, offset: 103296)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !9, file: !10, line: 285, baseType: !418, size: 448, offset: 103360)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !8, line: 219, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !420, line: 102, size: 448, elements: !421)
!420 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cd97c70c025a9cff45f4138c27a79124")
!421 = !{!422, !496, !498, !499, !500, !501, !502, !507}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !419, file: !420, line: 105, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !420, line: 100, baseType: !424)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 28, baseType: !15, size: 32, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!426 = !DIEnumerator(name: "UndefinedException", value: 0)
!427 = !DIEnumerator(name: "WarningException", value: 300)
!428 = !DIEnumerator(name: "ResourceLimitWarning", value: 300)
!429 = !DIEnumerator(name: "TypeWarning", value: 305)
!430 = !DIEnumerator(name: "OptionWarning", value: 310)
!431 = !DIEnumerator(name: "DelegateWarning", value: 315)
!432 = !DIEnumerator(name: "MissingDelegateWarning", value: 320)
!433 = !DIEnumerator(name: "CorruptImageWarning", value: 325)
!434 = !DIEnumerator(name: "FileOpenWarning", value: 330)
!435 = !DIEnumerator(name: "BlobWarning", value: 335)
!436 = !DIEnumerator(name: "StreamWarning", value: 340)
!437 = !DIEnumerator(name: "CacheWarning", value: 345)
!438 = !DIEnumerator(name: "CoderWarning", value: 350)
!439 = !DIEnumerator(name: "FilterWarning", value: 352)
!440 = !DIEnumerator(name: "ModuleWarning", value: 355)
!441 = !DIEnumerator(name: "DrawWarning", value: 360)
!442 = !DIEnumerator(name: "ImageWarning", value: 365)
!443 = !DIEnumerator(name: "WandWarning", value: 370)
!444 = !DIEnumerator(name: "RandomWarning", value: 375)
!445 = !DIEnumerator(name: "XServerWarning", value: 380)
!446 = !DIEnumerator(name: "MonitorWarning", value: 385)
!447 = !DIEnumerator(name: "RegistryWarning", value: 390)
!448 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!449 = !DIEnumerator(name: "PolicyWarning", value: 399)
!450 = !DIEnumerator(name: "ErrorException", value: 400)
!451 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!452 = !DIEnumerator(name: "TypeError", value: 405)
!453 = !DIEnumerator(name: "OptionError", value: 410)
!454 = !DIEnumerator(name: "DelegateError", value: 415)
!455 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!456 = !DIEnumerator(name: "CorruptImageError", value: 425)
!457 = !DIEnumerator(name: "FileOpenError", value: 430)
!458 = !DIEnumerator(name: "BlobError", value: 435)
!459 = !DIEnumerator(name: "StreamError", value: 440)
!460 = !DIEnumerator(name: "CacheError", value: 445)
!461 = !DIEnumerator(name: "CoderError", value: 450)
!462 = !DIEnumerator(name: "FilterError", value: 452)
!463 = !DIEnumerator(name: "ModuleError", value: 455)
!464 = !DIEnumerator(name: "DrawError", value: 460)
!465 = !DIEnumerator(name: "ImageError", value: 465)
!466 = !DIEnumerator(name: "WandError", value: 470)
!467 = !DIEnumerator(name: "RandomError", value: 475)
!468 = !DIEnumerator(name: "XServerError", value: 480)
!469 = !DIEnumerator(name: "MonitorError", value: 485)
!470 = !DIEnumerator(name: "RegistryError", value: 490)
!471 = !DIEnumerator(name: "ConfigureError", value: 495)
!472 = !DIEnumerator(name: "PolicyError", value: 499)
!473 = !DIEnumerator(name: "FatalErrorException", value: 700)
!474 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!475 = !DIEnumerator(name: "TypeFatalError", value: 705)
!476 = !DIEnumerator(name: "OptionFatalError", value: 710)
!477 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!478 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!479 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!480 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!481 = !DIEnumerator(name: "BlobFatalError", value: 735)
!482 = !DIEnumerator(name: "StreamFatalError", value: 740)
!483 = !DIEnumerator(name: "CacheFatalError", value: 745)
!484 = !DIEnumerator(name: "CoderFatalError", value: 750)
!485 = !DIEnumerator(name: "FilterFatalError", value: 752)
!486 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!487 = !DIEnumerator(name: "DrawFatalError", value: 760)
!488 = !DIEnumerator(name: "ImageFatalError", value: 765)
!489 = !DIEnumerator(name: "WandFatalError", value: 770)
!490 = !DIEnumerator(name: "RandomFatalError", value: 775)
!491 = !DIEnumerator(name: "XServerFatalError", value: 780)
!492 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!493 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!494 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!495 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !419, file: !420, line: 108, baseType: !497, size: 32, offset: 32)
!497 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !419, file: !420, line: 111, baseType: !165, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !419, file: !420, line: 112, baseType: !165, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !419, file: !420, line: 115, baseType: !156, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !419, file: !420, line: 118, baseType: !104, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !419, file: !420, line: 121, baseType: !503, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !505, line: 26, baseType: !506)
!505 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !505, line: 25, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !419, file: !420, line: 124, baseType: !87, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !9, file: !10, line: 288, baseType: !104, size: 32, offset: 103808)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !9, file: !10, line: 291, baseType: !510, size: 64, offset: 103872)
!510 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !9, file: !10, line: 294, baseType: !503, size: 64, offset: 103936)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !9, file: !10, line: 297, baseType: !513, size: 256, offset: 104000)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !147, line: 40, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !147, line: 27, size: 256, elements: !515)
!515 = !{!516, !517, !518, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !514, file: !147, line: 30, baseType: !165, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !514, file: !147, line: 33, baseType: !87, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !514, file: !147, line: 36, baseType: !519, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !514, file: !147, line: 39, baseType: !87, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !9, file: !10, line: 298, baseType: !513, size: 256, offset: 104256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !9, file: !10, line: 299, baseType: !524, size: 64, offset: 104512)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !9, file: !10, line: 302, baseType: !87, size: 64, offset: 104576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !9, file: !10, line: 305, baseType: !87, size: 64, offset: 104640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !9, file: !10, line: 308, baseType: !348, size: 64, offset: 104704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !9, file: !10, line: 309, baseType: !348, size: 64, offset: 104768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !10, line: 310, baseType: !348, size: 64, offset: 104832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !9, file: !10, line: 313, baseType: !531, size: 32, offset: 104896)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !117, line: 47, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 31, baseType: !15, size: 32, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!534 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!535 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!536 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!537 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!538 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!539 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!540 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!541 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!542 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!543 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!544 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!545 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!546 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!547 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !9, file: !10, line: 316, baseType: !104, size: 32, offset: 104928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !9, file: !10, line: 319, baseType: !116, size: 64, offset: 104960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !9, file: !10, line: 322, baseType: !348, size: 64, offset: 105024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !9, file: !10, line: 325, baseType: !178, size: 256, offset: 105088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !9, file: !10, line: 328, baseType: !156, size: 64, offset: 105344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !9, file: !10, line: 329, baseType: !156, size: 64, offset: 105408)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !10, line: 332, baseType: !555, size: 32, offset: 105472)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !10, line: 61, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 47, baseType: !15, size: 32, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!558 = !DIEnumerator(name: "UndefinedType", value: 0)
!559 = !DIEnumerator(name: "BilevelType", value: 1)
!560 = !DIEnumerator(name: "GrayscaleType", value: 2)
!561 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!562 = !DIEnumerator(name: "PaletteType", value: 4)
!563 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!564 = !DIEnumerator(name: "TrueColorType", value: 6)
!565 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!566 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!567 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!568 = !DIEnumerator(name: "OptimizeType", value: 10)
!569 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !9, file: !10, line: 335, baseType: !104, size: 32, offset: 105504)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !9, file: !10, line: 338, baseType: !396, size: 64, offset: 105536)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !9, file: !10, line: 341, baseType: !104, size: 32, offset: 105600)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !9, file: !10, line: 344, baseType: !87, size: 64, offset: 105664)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !9, file: !10, line: 347, baseType: !575, size: 64, offset: 105728)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !576, line: 7, baseType: !577)
!576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !173, line: 160, baseType: !174)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !9, file: !10, line: 350, baseType: !579, size: 32, offset: 105792)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !117, line: 79, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 67, baseType: !15, size: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!582 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!583 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!584 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!585 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!586 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!587 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!588 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!589 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!590 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!591 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !9, file: !10, line: 353, baseType: !87, size: 64, offset: 105856)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !599, retainedTypes: !767, globals: !948, splitDebugInlining: false, nameTableKind: None)
!598 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/feature.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r", checksumkind: CSK_MD5, checksum: "8eef5e07433f798bbf5319ab0084c861")
!599 = !{!14, !23, !62, !92, !105, !148, !159, !194, !230, !243, !250, !267, !340, !378, !424, !532, !556, !580, !600, !641, !666, !688, !713, !746}
!600 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !601, line: 27, baseType: !15, size: 32, elements: !602)
!601 = !DIFile(filename: "apps/538.imagick_r/src/magick/morphology.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c6a894945ec2a897d86b4fa1dd783082")
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!603 = !DIEnumerator(name: "UndefinedKernel", value: 0)
!604 = !DIEnumerator(name: "UnityKernel", value: 1)
!605 = !DIEnumerator(name: "GaussianKernel", value: 2)
!606 = !DIEnumerator(name: "DoGKernel", value: 3)
!607 = !DIEnumerator(name: "LoGKernel", value: 4)
!608 = !DIEnumerator(name: "BlurKernel", value: 5)
!609 = !DIEnumerator(name: "CometKernel", value: 6)
!610 = !DIEnumerator(name: "LaplacianKernel", value: 7)
!611 = !DIEnumerator(name: "SobelKernel", value: 8)
!612 = !DIEnumerator(name: "FreiChenKernel", value: 9)
!613 = !DIEnumerator(name: "RobertsKernel", value: 10)
!614 = !DIEnumerator(name: "PrewittKernel", value: 11)
!615 = !DIEnumerator(name: "CompassKernel", value: 12)
!616 = !DIEnumerator(name: "KirschKernel", value: 13)
!617 = !DIEnumerator(name: "DiamondKernel", value: 14)
!618 = !DIEnumerator(name: "SquareKernel", value: 15)
!619 = !DIEnumerator(name: "RectangleKernel", value: 16)
!620 = !DIEnumerator(name: "OctagonKernel", value: 17)
!621 = !DIEnumerator(name: "DiskKernel", value: 18)
!622 = !DIEnumerator(name: "PlusKernel", value: 19)
!623 = !DIEnumerator(name: "CrossKernel", value: 20)
!624 = !DIEnumerator(name: "RingKernel", value: 21)
!625 = !DIEnumerator(name: "PeaksKernel", value: 22)
!626 = !DIEnumerator(name: "EdgesKernel", value: 23)
!627 = !DIEnumerator(name: "CornersKernel", value: 24)
!628 = !DIEnumerator(name: "DiagonalsKernel", value: 25)
!629 = !DIEnumerator(name: "LineEndsKernel", value: 26)
!630 = !DIEnumerator(name: "LineJunctionsKernel", value: 27)
!631 = !DIEnumerator(name: "RidgesKernel", value: 28)
!632 = !DIEnumerator(name: "ConvexHullKernel", value: 29)
!633 = !DIEnumerator(name: "ThinSEKernel", value: 30)
!634 = !DIEnumerator(name: "SkeletonKernel", value: 31)
!635 = !DIEnumerator(name: "ChebyshevKernel", value: 32)
!636 = !DIEnumerator(name: "ManhattanKernel", value: 33)
!637 = !DIEnumerator(name: "OctagonalKernel", value: 34)
!638 = !DIEnumerator(name: "EuclideanKernel", value: 35)
!639 = !DIEnumerator(name: "UserDefinedKernel", value: 36)
!640 = !DIEnumerator(name: "BinomialKernel", value: 37)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !642, line: 34, baseType: !15, size: 32, elements: !643)
!642 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!644 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!645 = !DIEnumerator(name: "NoEvents", value: 0)
!646 = !DIEnumerator(name: "TraceEvent", value: 1)
!647 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!648 = !DIEnumerator(name: "BlobEvent", value: 4)
!649 = !DIEnumerator(name: "CacheEvent", value: 8)
!650 = !DIEnumerator(name: "CoderEvent", value: 16)
!651 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!652 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!653 = !DIEnumerator(name: "DrawEvent", value: 128)
!654 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!655 = !DIEnumerator(name: "ImageEvent", value: 512)
!656 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!657 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!658 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!659 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!660 = !DIEnumerator(name: "TransformEvent", value: 16384)
!661 = !DIEnumerator(name: "UserEvent", value: 36864)
!662 = !DIEnumerator(name: "WandEvent", value: 65536)
!663 = !DIEnumerator(name: "X11Event", value: 131072)
!664 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!665 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!666 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 177, baseType: !15, size: 32, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!668 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!669 = !DIEnumerator(name: "RedChannel", value: 1)
!670 = !DIEnumerator(name: "GrayChannel", value: 1)
!671 = !DIEnumerator(name: "CyanChannel", value: 1)
!672 = !DIEnumerator(name: "GreenChannel", value: 2)
!673 = !DIEnumerator(name: "MagentaChannel", value: 2)
!674 = !DIEnumerator(name: "BlueChannel", value: 4)
!675 = !DIEnumerator(name: "YellowChannel", value: 4)
!676 = !DIEnumerator(name: "AlphaChannel", value: 8)
!677 = !DIEnumerator(name: "OpacityChannel", value: 8)
!678 = !DIEnumerator(name: "MatteChannel", value: 8)
!679 = !DIEnumerator(name: "BlackChannel", value: 32)
!680 = !DIEnumerator(name: "IndexChannel", value: 32)
!681 = !DIEnumerator(name: "CompositeChannels", value: 47)
!682 = !DIEnumerator(name: "AllChannels", value: 134217727)
!683 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!684 = !DIEnumerator(name: "RGBChannels", value: 128)
!685 = !DIEnumerator(name: "GrayChannels", value: 128)
!686 = !DIEnumerator(name: "SyncChannels", value: 256)
!687 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !601, line: 69, baseType: !15, size: 32, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!690 = !DIEnumerator(name: "UndefinedMorphology", value: 0)
!691 = !DIEnumerator(name: "ConvolveMorphology", value: 1)
!692 = !DIEnumerator(name: "CorrelateMorphology", value: 2)
!693 = !DIEnumerator(name: "ErodeMorphology", value: 3)
!694 = !DIEnumerator(name: "DilateMorphology", value: 4)
!695 = !DIEnumerator(name: "ErodeIntensityMorphology", value: 5)
!696 = !DIEnumerator(name: "DilateIntensityMorphology", value: 6)
!697 = !DIEnumerator(name: "DistanceMorphology", value: 7)
!698 = !DIEnumerator(name: "OpenMorphology", value: 8)
!699 = !DIEnumerator(name: "CloseMorphology", value: 9)
!700 = !DIEnumerator(name: "OpenIntensityMorphology", value: 10)
!701 = !DIEnumerator(name: "CloseIntensityMorphology", value: 11)
!702 = !DIEnumerator(name: "SmoothMorphology", value: 12)
!703 = !DIEnumerator(name: "EdgeInMorphology", value: 13)
!704 = !DIEnumerator(name: "EdgeOutMorphology", value: 14)
!705 = !DIEnumerator(name: "EdgeMorphology", value: 15)
!706 = !DIEnumerator(name: "TopHatMorphology", value: 16)
!707 = !DIEnumerator(name: "BottomHatMorphology", value: 17)
!708 = !DIEnumerator(name: "HitAndMissMorphology", value: 18)
!709 = !DIEnumerator(name: "ThinningMorphology", value: 19)
!710 = !DIEnumerator(name: "ThickenMorphology", value: 20)
!711 = !DIEnumerator(name: "VoronoiMorphology", value: 21)
!712 = !DIEnumerator(name: "IterativeDistanceMorphology", value: 22)
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 27, baseType: !15, size: 32, elements: !715)
!714 = !DIFile(filename: "apps/538.imagick_r/src/magick/effect.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "85233add4591bd6d6001c51d4fa6a546")
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!716 = !DIEnumerator(name: "UndefinedPreview", value: 0)
!717 = !DIEnumerator(name: "RotatePreview", value: 1)
!718 = !DIEnumerator(name: "ShearPreview", value: 2)
!719 = !DIEnumerator(name: "RollPreview", value: 3)
!720 = !DIEnumerator(name: "HuePreview", value: 4)
!721 = !DIEnumerator(name: "SaturationPreview", value: 5)
!722 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!723 = !DIEnumerator(name: "GammaPreview", value: 7)
!724 = !DIEnumerator(name: "SpiffPreview", value: 8)
!725 = !DIEnumerator(name: "DullPreview", value: 9)
!726 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!727 = !DIEnumerator(name: "QuantizePreview", value: 11)
!728 = !DIEnumerator(name: "DespecklePreview", value: 12)
!729 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!730 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!731 = !DIEnumerator(name: "SharpenPreview", value: 15)
!732 = !DIEnumerator(name: "BlurPreview", value: 16)
!733 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!734 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!735 = !DIEnumerator(name: "SpreadPreview", value: 19)
!736 = !DIEnumerator(name: "SolarizePreview", value: 20)
!737 = !DIEnumerator(name: "ShadePreview", value: 21)
!738 = !DIEnumerator(name: "RaisePreview", value: 22)
!739 = !DIEnumerator(name: "SegmentPreview", value: 23)
!740 = !DIEnumerator(name: "SwirlPreview", value: 24)
!741 = !DIEnumerator(name: "ImplodePreview", value: 25)
!742 = !DIEnumerator(name: "WavePreview", value: 26)
!743 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!744 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!745 = !DIEnumerator(name: "JPEGPreview", value: 29)
!746 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !747, line: 27, baseType: !15, size: 32, elements: !748)
!747 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!749 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!750 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!751 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!752 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!753 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!754 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!755 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!756 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!757 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!758 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!759 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!760 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!761 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!762 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!763 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!764 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!765 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!766 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!767 = !{!89, !768, !156, !6, !788, !170, !792, !115, !385, !794, !497, !816, !825, !828, !829, !130, !87, !121, !390, !15, !946}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfo", file: !601, line: 128, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernelInfo", file: !601, line: 102, size: 832, elements: !771)
!771 = !{!772, !774, !775, !776, !777, !778, !780, !781, !782, !783, !784, !785, !787}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !770, file: !601, line: 105, baseType: !773, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfoType", file: !601, line: 67, baseType: !600)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !770, file: !601, line: 108, baseType: !87, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !770, file: !601, line: 109, baseType: !87, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !770, file: !601, line: 112, baseType: !170, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !770, file: !601, line: 113, baseType: !170, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !770, file: !601, line: 116, baseType: !779, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !770, file: !601, line: 117, baseType: !130, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !770, file: !601, line: 118, baseType: !130, size: 64, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "negative_range", scope: !770, file: !601, line: 119, baseType: !130, size: 64, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "positive_range", scope: !770, file: !601, line: 120, baseType: !130, size: 64, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !770, file: !601, line: 121, baseType: !130, size: 64, offset: 640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !770, file: !601, line: 124, baseType: !786, size: 64, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !770, file: !601, line: 127, baseType: !87, size: 64, offset: 768)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatrixInfo", file: !790, line: 26, baseType: !791)
!790 = !DIFile(filename: "apps/538.imagick_r/src/magick/matrix.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "eb3e46c8fbd61488836928d66ca395c0")
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MatrixInfo", file: !790, line: 25, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelFeatures", file: !796, line: 45, baseType: !797)
!796 = !DIFile(filename: "apps/538.imagick_r/src/magick/feature.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "dbe73de8fac9b3b50939c7a0dc145cd9")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelFeatures", file: !796, line: 28, size: 3584, elements: !798)
!798 = !{!799, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "angular_second_moment", scope: !797, file: !796, line: 31, baseType: !800, size: 256)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 256, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 4)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !797, file: !796, line: 32, baseType: !800, size: 256, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "correlation", scope: !797, file: !796, line: 33, baseType: !800, size: 256, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "variance_sum_of_squares", scope: !797, file: !796, line: 34, baseType: !800, size: 256, offset: 768)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_difference_moment", scope: !797, file: !796, line: 35, baseType: !800, size: 256, offset: 1024)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sum_average", scope: !797, file: !796, line: 36, baseType: !800, size: 256, offset: 1280)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sum_variance", scope: !797, file: !796, line: 37, baseType: !800, size: 256, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "sum_entropy", scope: !797, file: !796, line: 38, baseType: !800, size: 256, offset: 1792)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !797, file: !796, line: 39, baseType: !800, size: 256, offset: 2048)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "difference_variance", scope: !797, file: !796, line: 40, baseType: !800, size: 256, offset: 2304)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "difference_entropy", scope: !797, file: !796, line: 41, baseType: !800, size: 256, offset: 2560)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "measure_of_correlation_1", scope: !797, file: !796, line: 42, baseType: !800, size: 256, offset: 2816)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "measure_of_correlation_2", scope: !797, file: !796, line: 43, baseType: !800, size: 256, offset: 3072)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_correlation_coefficient", scope: !797, file: !796, line: 44, baseType: !800, size: 256, offset: 3328)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "LongPixelPacket", file: !117, line: 102, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LongPixelPacket", file: !117, line: 94, size: 160, elements: !819)
!819 = !{!820, !821, !822, !823, !824}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !818, file: !117, line: 97, baseType: !15, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !818, file: !117, line: 98, baseType: !15, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !818, file: !117, line: 99, baseType: !15, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !818, file: !117, line: 100, baseType: !15, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !818, file: !117, line: 101, baseType: !15, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !117, line: 129, baseType: !121)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelStatistics", scope: !831, file: !3, line: 642, baseType: !934)
!831 = distinct !DISubprogram(name: "GetImageChannelFeatures", scope: !3, file: !3, line: 635, type: !832, scopeLine: 637, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !597, retainedNodes: !835)
!832 = !DISubroutineType(types: !833)
!833 = !{!794, !593, !834, !596}
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!835 = !{!836, !837, !838, !839, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !869, !870, !875, !877, !878, !882, !883, !884, !885, !886, !887, !888, !892, !893, !897, !901, !905, !909, !913, !917, !921, !925, !929, !930}
!836 = !DILocalVariable(name: "image", arg: 1, scope: !831, file: !3, line: 635, type: !593)
!837 = !DILocalVariable(name: "distance", arg: 2, scope: !831, file: !3, line: 636, type: !834)
!838 = !DILocalVariable(name: "exception", arg: 3, scope: !831, file: !3, line: 636, type: !596)
!839 = !DILocalVariable(name: "image_view", scope: !831, file: !3, line: 645, type: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !747, line: 50, baseType: !842)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !117, line: 160, flags: DIFlagFwdDecl)
!843 = !DILocalVariable(name: "channel_features", scope: !831, file: !3, line: 648, type: !794)
!844 = !DILocalVariable(name: "cooccurrence", scope: !831, file: !3, line: 651, type: !828)
!845 = !DILocalVariable(name: "correlation", scope: !831, file: !3, line: 652, type: !830)
!846 = !DILocalVariable(name: "density_x", scope: !831, file: !3, line: 653, type: !829)
!847 = !DILocalVariable(name: "density_xy", scope: !831, file: !3, line: 654, type: !829)
!848 = !DILocalVariable(name: "density_y", scope: !831, file: !3, line: 655, type: !829)
!849 = !DILocalVariable(name: "entropy_x", scope: !831, file: !3, line: 656, type: !830)
!850 = !DILocalVariable(name: "entropy_xy", scope: !831, file: !3, line: 657, type: !830)
!851 = !DILocalVariable(name: "entropy_xy1", scope: !831, file: !3, line: 658, type: !830)
!852 = !DILocalVariable(name: "entropy_xy2", scope: !831, file: !3, line: 659, type: !830)
!853 = !DILocalVariable(name: "entropy_y", scope: !831, file: !3, line: 660, type: !830)
!854 = !DILocalVariable(name: "mean", scope: !831, file: !3, line: 661, type: !830)
!855 = !DILocalVariable(name: "Q", scope: !831, file: !3, line: 662, type: !828)
!856 = !DILocalVariable(name: "sum", scope: !831, file: !3, line: 663, type: !829)
!857 = !DILocalVariable(name: "sum_squares", scope: !831, file: !3, line: 664, type: !830)
!858 = !DILocalVariable(name: "variance", scope: !831, file: !3, line: 665, type: !830)
!859 = !DILocalVariable(name: "gray", scope: !831, file: !3, line: 668, type: !817)
!860 = !DILocalVariable(name: "grays", scope: !831, file: !3, line: 669, type: !816)
!861 = !DILocalVariable(name: "status", scope: !831, file: !3, line: 672, type: !104)
!862 = !DILocalVariable(name: "i", scope: !831, file: !3, line: 675, type: !170)
!863 = !DILocalVariable(name: "length", scope: !831, file: !3, line: 678, type: !87)
!864 = !DILocalVariable(name: "y", scope: !831, file: !3, line: 681, type: !170)
!865 = !DILocalVariable(name: "number_grays", scope: !831, file: !3, line: 684, type: !15)
!866 = !DILocalVariable(name: "message", scope: !867, file: !3, line: 696, type: !165)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 696, column: 5)
!868 = distinct !DILexicalBlock(scope: !831, file: !3, line: 695, column: 7)
!869 = !DILocalVariable(name: "exception", scope: !867, file: !3, line: 696, type: !418)
!870 = !DILocalVariable(name: "indexes", scope: !871, file: !3, line: 728, type: !874)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 726, column: 3)
!872 = distinct !DILexicalBlock(scope: !873, file: !3, line: 725, column: 3)
!873 = distinct !DILexicalBlock(scope: !831, file: !3, line: 725, column: 3)
!874 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !825)
!875 = !DILocalVariable(name: "p", scope: !871, file: !3, line: 731, type: !876)
!876 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !792)
!877 = !DILocalVariable(name: "x", scope: !871, file: !3, line: 734, type: !170)
!878 = !DILocalVariable(name: "indexes", scope: !879, file: !3, line: 903, type: !874)
!879 = distinct !DILexicalBlock(scope: !880, file: !3, line: 901, column: 3)
!880 = distinct !DILexicalBlock(scope: !881, file: !3, line: 900, column: 3)
!881 = distinct !DILexicalBlock(scope: !831, file: !3, line: 900, column: 3)
!882 = !DILocalVariable(name: "p", scope: !879, file: !3, line: 906, type: !876)
!883 = !DILocalVariable(name: "x", scope: !879, file: !3, line: 909, type: !170)
!884 = !DILocalVariable(name: "i", scope: !879, file: !3, line: 912, type: !170)
!885 = !DILocalVariable(name: "offset", scope: !879, file: !3, line: 913, type: !170)
!886 = !DILocalVariable(name: "u", scope: !879, file: !3, line: 914, type: !170)
!887 = !DILocalVariable(name: "v", scope: !879, file: !3, line: 915, type: !170)
!888 = !DILocalVariable(name: "normalize", scope: !889, file: !3, line: 1039, type: !130)
!889 = distinct !DILexicalBlock(scope: !890, file: !3, line: 1037, column: 3)
!890 = distinct !DILexicalBlock(scope: !891, file: !3, line: 1036, column: 3)
!891 = distinct !DILexicalBlock(scope: !831, file: !3, line: 1036, column: 3)
!892 = !DILocalVariable(name: "y", scope: !889, file: !3, line: 1042, type: !170)
!893 = !DILocalVariable(name: "x", scope: !894, file: !3, line: 1084, type: !170)
!894 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1082, column: 5)
!895 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1081, column: 5)
!896 = distinct !DILexicalBlock(scope: !889, file: !3, line: 1081, column: 5)
!897 = !DILocalVariable(name: "y", scope: !898, file: !3, line: 1108, type: !170)
!898 = distinct !DILexicalBlock(scope: !899, file: !3, line: 1106, column: 3)
!899 = distinct !DILexicalBlock(scope: !900, file: !3, line: 1105, column: 3)
!900 = distinct !DILexicalBlock(scope: !831, file: !3, line: 1105, column: 3)
!901 = !DILocalVariable(name: "x", scope: !902, file: !3, line: 1113, type: !170)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 1111, column: 5)
!903 = distinct !DILexicalBlock(scope: !904, file: !3, line: 1110, column: 5)
!904 = distinct !DILexicalBlock(scope: !898, file: !3, line: 1110, column: 5)
!905 = !DILocalVariable(name: "x", scope: !906, file: !3, line: 1293, type: !170)
!906 = distinct !DILexicalBlock(scope: !907, file: !3, line: 1291, column: 3)
!907 = distinct !DILexicalBlock(scope: !908, file: !3, line: 1290, column: 3)
!908 = distinct !DILexicalBlock(scope: !831, file: !3, line: 1290, column: 3)
!909 = !DILocalVariable(name: "y", scope: !910, file: !3, line: 1369, type: !170)
!910 = distinct !DILexicalBlock(scope: !911, file: !3, line: 1367, column: 3)
!911 = distinct !DILexicalBlock(scope: !912, file: !3, line: 1366, column: 3)
!912 = distinct !DILexicalBlock(scope: !831, file: !3, line: 1366, column: 3)
!913 = !DILocalVariable(name: "x", scope: !914, file: !3, line: 1374, type: !170)
!914 = distinct !DILexicalBlock(scope: !915, file: !3, line: 1372, column: 5)
!915 = distinct !DILexicalBlock(scope: !916, file: !3, line: 1371, column: 5)
!916 = distinct !DILexicalBlock(scope: !910, file: !3, line: 1371, column: 5)
!917 = !DILocalVariable(name: "x", scope: !918, file: !3, line: 1488, type: !170)
!918 = distinct !DILexicalBlock(scope: !919, file: !3, line: 1486, column: 3)
!919 = distinct !DILexicalBlock(scope: !920, file: !3, line: 1485, column: 3)
!920 = distinct !DILexicalBlock(scope: !831, file: !3, line: 1485, column: 3)
!921 = !DILocalVariable(name: "z", scope: !922, file: !3, line: 1640, type: !170)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 1638, column: 3)
!923 = distinct !DILexicalBlock(scope: !924, file: !3, line: 1637, column: 3)
!924 = distinct !DILexicalBlock(scope: !831, file: !3, line: 1637, column: 3)
!925 = !DILocalVariable(name: "y", scope: !926, file: !3, line: 1645, type: !170)
!926 = distinct !DILexicalBlock(scope: !927, file: !3, line: 1643, column: 5)
!927 = distinct !DILexicalBlock(scope: !928, file: !3, line: 1642, column: 5)
!928 = distinct !DILexicalBlock(scope: !922, file: !3, line: 1642, column: 5)
!929 = !DILocalVariable(name: "pixel", scope: !926, file: !3, line: 1648, type: !830)
!930 = !DILocalVariable(name: "x", scope: !931, file: !3, line: 1654, type: !170)
!931 = distinct !DILexicalBlock(scope: !932, file: !3, line: 1652, column: 7)
!932 = distinct !DILexicalBlock(scope: !933, file: !3, line: 1651, column: 7)
!933 = distinct !DILexicalBlock(scope: !926, file: !3, line: 1651, column: 7)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelStatistics", scope: !831, file: !3, line: 638, size: 1280, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !934, file: !3, line: 641, baseType: !937, size: 1280)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 1280, elements: !801)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "DoublePixelPacket", file: !117, line: 92, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DoublePixelPacket", file: !117, line: 84, size: 320, elements: !940)
!940 = !{!941, !942, !943, !944, !945}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !939, file: !117, line: 87, baseType: !130, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !939, file: !117, line: 88, baseType: !130, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !939, file: !117, line: 89, baseType: !130, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !939, file: !117, line: 90, baseType: !130, size: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !939, file: !117, line: 91, baseType: !130, size: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !8, line: 78, baseType: !947)
!947 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!948 = !{!0, !949}
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "Gy", scope: !2, file: !3, line: 358, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 256, elements: !952)
!952 = !{!953, !953}
!953 = !DISubrange(count: 2)
!954 = !{!955, !956, !957, !958, !959, !960, !961, !962, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !986, !987, !991, !992, !993, !994, !995, !999, !1003, !1006, !1011, !1012, !1016, !1017, !1018, !1021, !1025, !1029}
!955 = !DILocalVariable(name: "image", arg: 1, scope: !2, file: !3, line: 241, type: !593)
!956 = !DILocalVariable(name: "radius", arg: 2, scope: !2, file: !3, line: 241, type: !595)
!957 = !DILocalVariable(name: "sigma", arg: 3, scope: !2, file: !3, line: 242, type: !595)
!958 = !DILocalVariable(name: "lower_percent", arg: 4, scope: !2, file: !3, line: 242, type: !595)
!959 = !DILocalVariable(name: "upper_percent", arg: 5, scope: !2, file: !3, line: 242, type: !595)
!960 = !DILocalVariable(name: "exception", arg: 6, scope: !2, file: !3, line: 243, type: !596)
!961 = !DILocalVariable(name: "edge_view", scope: !2, file: !3, line: 248, type: !840)
!962 = !DILocalVariable(name: "pixel", scope: !2, file: !3, line: 251, type: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "CannyInfo", file: !3, line: 145, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CannyInfo", file: !3, line: 133, size: 320, elements: !965)
!965 = !{!966, !967, !968, !969, !970}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "magnitude", scope: !964, file: !3, line: 136, baseType: !130, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !964, file: !3, line: 137, baseType: !130, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !964, file: !3, line: 140, baseType: !497, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !964, file: !3, line: 143, baseType: !170, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !964, file: !3, line: 144, baseType: !170, size: 64, offset: 256)
!971 = !DILocalVariable(name: "geometry", scope: !2, file: !3, line: 254, type: !410)
!972 = !DILocalVariable(name: "lower_threshold", scope: !2, file: !3, line: 257, type: !130)
!973 = !DILocalVariable(name: "max", scope: !2, file: !3, line: 258, type: !130)
!974 = !DILocalVariable(name: "min", scope: !2, file: !3, line: 259, type: !130)
!975 = !DILocalVariable(name: "upper_threshold", scope: !2, file: !3, line: 260, type: !130)
!976 = !DILocalVariable(name: "edge_image", scope: !2, file: !3, line: 263, type: !6)
!977 = !DILocalVariable(name: "kernel_info", scope: !2, file: !3, line: 266, type: !768)
!978 = !DILocalVariable(name: "status", scope: !2, file: !3, line: 269, type: !104)
!979 = !DILocalVariable(name: "progress", scope: !2, file: !3, line: 272, type: !393)
!980 = !DILocalVariable(name: "canny_cache", scope: !2, file: !3, line: 275, type: !788)
!981 = !DILocalVariable(name: "y", scope: !2, file: !3, line: 278, type: !170)
!982 = !DILocalVariable(name: "p", scope: !983, file: !3, line: 323, type: !876)
!983 = distinct !DILexicalBlock(scope: !984, file: !3, line: 321, column: 3)
!984 = distinct !DILexicalBlock(scope: !985, file: !3, line: 320, column: 3)
!985 = distinct !DILexicalBlock(scope: !2, file: !3, line: 320, column: 3)
!986 = !DILocalVariable(name: "x", scope: !983, file: !3, line: 326, type: !170)
!987 = !DILocalVariable(name: "pixel", scope: !988, file: !3, line: 340, type: !963)
!988 = distinct !DILexicalBlock(scope: !989, file: !3, line: 338, column: 5)
!989 = distinct !DILexicalBlock(scope: !990, file: !3, line: 337, column: 5)
!990 = distinct !DILexicalBlock(scope: !983, file: !3, line: 337, column: 5)
!991 = !DILocalVariable(name: "dx", scope: !988, file: !3, line: 343, type: !130)
!992 = !DILocalVariable(name: "dy", scope: !988, file: !3, line: 344, type: !130)
!993 = !DILocalVariable(name: "kernel_pixels", scope: !988, file: !3, line: 347, type: !876)
!994 = !DILocalVariable(name: "v", scope: !988, file: !3, line: 350, type: !170)
!995 = !DILocalVariable(name: "u", scope: !996, file: !3, line: 371, type: !170)
!996 = distinct !DILexicalBlock(scope: !997, file: !3, line: 369, column: 7)
!997 = distinct !DILexicalBlock(scope: !998, file: !3, line: 368, column: 7)
!998 = distinct !DILexicalBlock(scope: !988, file: !3, line: 368, column: 7)
!999 = !DILocalVariable(name: "intensity", scope: !1000, file: !3, line: 376, type: !130)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 374, column: 9)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 373, column: 9)
!1002 = distinct !DILexicalBlock(scope: !996, file: !3, line: 373, column: 9)
!1003 = !DILocalVariable(name: "slope", scope: !1004, file: !3, line: 389, type: !130)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 387, column: 9)
!1005 = distinct !DILexicalBlock(scope: !988, file: !3, line: 386, column: 11)
!1006 = !DILocalVariable(name: "q", scope: !1007, file: !3, line: 435, type: !1010)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 433, column: 3)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 432, column: 3)
!1009 = distinct !DILexicalBlock(scope: !2, file: !3, line: 432, column: 3)
!1010 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !115)
!1011 = !DILocalVariable(name: "x", scope: !1007, file: !3, line: 438, type: !170)
!1012 = !DILocalVariable(name: "alpha_pixel", scope: !1013, file: !3, line: 452, type: !963)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 450, column: 5)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 449, column: 5)
!1015 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 449, column: 5)
!1016 = !DILocalVariable(name: "beta_pixel", scope: !1013, file: !3, line: 453, type: !963)
!1017 = !DILocalVariable(name: "pixel", scope: !1013, file: !3, line: 454, type: !963)
!1018 = !DILocalVariable(name: "proceed", scope: !1019, file: !3, line: 521, type: !104)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 519, column: 7)
!1020 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 518, column: 9)
!1021 = !DILocalVariable(name: "x", scope: !1022, file: !3, line: 545, type: !170)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 543, column: 3)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 542, column: 3)
!1024 = distinct !DILexicalBlock(scope: !2, file: !3, line: 542, column: 3)
!1025 = !DILocalVariable(name: "pixel", scope: !1026, file: !3, line: 552, type: !963)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 550, column: 5)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 549, column: 5)
!1028 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 549, column: 5)
!1029 = !DILocalVariable(name: "p", scope: !1026, file: !3, line: 555, type: !876)
!1030 = !{i32 7, !"Dwarf Version", i32 5}
!1031 = !{i32 2, !"Debug Info Version", i32 3}
!1032 = !{i32 1, !"wchar_size", i32 4}
!1033 = !{i32 7, !"PIC Level", i32 2}
!1034 = !{i32 7, !"PIE Level", i32 2}
!1035 = !{i32 7, !"uwtable", i32 2}
!1036 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1037 = !DILocation(line: 0, scope: !2)
!1038 = !DILocation(line: 250, column: 3, scope: !2)
!1039 = !DILocation(line: 251, column: 5, scope: !2)
!1040 = !DILocation(line: 253, column: 3, scope: !2)
!1041 = !DILocation(line: 254, column: 5, scope: !2)
!1042 = !DILocation(line: 282, column: 14, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !2, file: !3, line: 282, column: 7)
!1044 = !{!1045, !1046, i64 12976}
!1045 = !{!"_Image", !1046, i64 0, !1046, i64 4, !1046, i64 8, !1048, i64 16, !1046, i64 24, !1046, i64 28, !1046, i64 32, !1048, i64 40, !1048, i64 48, !1048, i64 56, !1048, i64 64, !1049, i64 72, !1050, i64 80, !1050, i64 88, !1050, i64 96, !1052, i64 104, !1053, i64 112, !1046, i64 208, !1049, i64 216, !1046, i64 224, !1049, i64 232, !1049, i64 240, !1049, i64 248, !1048, i64 256, !1052, i64 264, !1052, i64 272, !1055, i64 280, !1055, i64 312, !1055, i64 344, !1052, i64 376, !1052, i64 384, !1052, i64 392, !1046, i64 400, !1046, i64 404, !1046, i64 408, !1046, i64 412, !1046, i64 416, !1046, i64 420, !1049, i64 424, !1048, i64 432, !1048, i64 440, !1048, i64 448, !1048, i64 456, !1048, i64 464, !1048, i64 472, !1056, i64 480, !1057, i64 504, !1049, i64 568, !1049, i64 576, !1049, i64 584, !1049, i64 592, !1049, i64 600, !1049, i64 608, !1046, i64 616, !1046, i64 4712, !1046, i64 8808, !1048, i64 12904, !1048, i64 12912, !1059, i64 12920, !1046, i64 12976, !1048, i64 12984, !1049, i64 12992, !1061, i64 13000, !1061, i64 13032, !1049, i64 13064, !1048, i64 13072, !1048, i64 13080, !1049, i64 13088, !1049, i64 13096, !1049, i64 13104, !1046, i64 13112, !1046, i64 13116, !1050, i64 13120, !1049, i64 13128, !1055, i64 13136, !1049, i64 13168, !1049, i64 13176, !1046, i64 13184, !1046, i64 13188, !1062, i64 13192, !1046, i64 13200, !1048, i64 13208, !1048, i64 13216, !1046, i64 13224, !1048, i64 13232}
!1046 = !{!"omnipotent char", !1047, i64 0}
!1047 = !{!"Simple C/C++ TBAA"}
!1048 = !{!"long", !1046, i64 0}
!1049 = !{!"any pointer", !1046, i64 0}
!1050 = !{!"_PixelPacket", !1051, i64 0, !1051, i64 2, !1051, i64 4, !1051, i64 6}
!1051 = !{!"short", !1046, i64 0}
!1052 = !{!"double", !1046, i64 0}
!1053 = !{!"_ChromaticityInfo", !1054, i64 0, !1054, i64 24, !1054, i64 48, !1054, i64 72}
!1054 = !{!"_PrimaryInfo", !1052, i64 0, !1052, i64 8, !1052, i64 16}
!1055 = !{!"_RectangleInfo", !1048, i64 0, !1048, i64 8, !1048, i64 16, !1048, i64 24}
!1056 = !{!"_ErrorInfo", !1052, i64 0, !1052, i64 8, !1052, i64 16}
!1057 = !{!"_TimerInfo", !1058, i64 0, !1058, i64 24, !1046, i64 48, !1048, i64 56}
!1058 = !{!"_Timer", !1052, i64 0, !1052, i64 8, !1052, i64 16}
!1059 = !{!"_ExceptionInfo", !1046, i64 0, !1060, i64 4, !1049, i64 8, !1049, i64 16, !1049, i64 24, !1046, i64 32, !1049, i64 40, !1048, i64 48}
!1060 = !{!"int", !1046, i64 0}
!1061 = !{!"_ProfileInfo", !1049, i64 0, !1048, i64 8, !1049, i64 16, !1048, i64 24}
!1062 = !{!"long long", !1046, i64 0}
!1063 = !DILocation(line: 282, column: 20, scope: !1043)
!1064 = !DILocation(line: 282, column: 7, scope: !2)
!1065 = !DILocation(line: 283, column: 68, scope: !1043)
!1066 = !DILocation(line: 283, column: 12, scope: !1043)
!1067 = !DILocation(line: 283, column: 5, scope: !1043)
!1068 = !DILocation(line: 289, column: 10, scope: !2)
!1069 = !DILocation(line: 291, column: 15, scope: !2)
!1070 = !DILocation(line: 292, column: 19, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !2, file: !3, line: 292, column: 7)
!1072 = !DILocation(line: 292, column: 7, scope: !2)
!1073 = !DILocation(line: 293, column: 5, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 293, column: 5)
!1075 = !DILocation(line: 294, column: 14, scope: !2)
!1076 = !DILocation(line: 296, column: 15, scope: !2)
!1077 = !DILocation(line: 297, column: 18, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !2, file: !3, line: 297, column: 7)
!1079 = !DILocation(line: 297, column: 7, scope: !2)
!1080 = !DILocation(line: 299, column: 7, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !2, file: !3, line: 299, column: 7)
!1082 = !DILocation(line: 299, column: 53, scope: !1081)
!1083 = !DILocation(line: 299, column: 7, scope: !2)
!1084 = !DILocation(line: 301, column: 18, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 300, column: 5)
!1086 = !DILocation(line: 302, column: 7, scope: !1085)
!1087 = !DILocation(line: 307, column: 45, scope: !2)
!1088 = !{!1045, !1048, i64 40}
!1089 = !DILocation(line: 307, column: 65, scope: !2)
!1090 = !{!1045, !1048, i64 48}
!1091 = !DILocation(line: 307, column: 15, scope: !2)
!1092 = !DILocation(line: 309, column: 19, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !2, file: !3, line: 309, column: 7)
!1094 = !DILocation(line: 309, column: 7, scope: !2)
!1095 = !DILocation(line: 311, column: 18, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 310, column: 5)
!1097 = !DILocation(line: 312, column: 7, scope: !1096)
!1098 = !DILocation(line: 315, column: 13, scope: !2)
!1099 = !DILocation(line: 320, column: 39, scope: !984)
!1100 = !DILocation(line: 320, column: 15, scope: !984)
!1101 = !DILocation(line: 320, column: 3, scope: !985)
!1102 = !DILocation(line: 328, column: 16, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !983, file: !3, line: 328, column: 9)
!1104 = !DILocation(line: 328, column: 9, scope: !983)
!1105 = !DILocation(line: 330, column: 59, scope: !983)
!1106 = !DILocation(line: 330, column: 66, scope: !983)
!1107 = !DILocation(line: 330, column: 7, scope: !983)
!1108 = !DILocation(line: 0, scope: !983)
!1109 = !DILocation(line: 332, column: 11, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !983, file: !3, line: 332, column: 9)
!1111 = !DILocation(line: 332, column: 9, scope: !983)
!1112 = !DILocation(line: 337, column: 41, scope: !989)
!1113 = !DILocation(line: 337, column: 17, scope: !989)
!1114 = !DILocation(line: 337, column: 5, scope: !990)
!1115 = !DILocation(line: 339, column: 7, scope: !988)
!1116 = !DILocation(line: 340, column: 9, scope: !988)
!1117 = !DILocation(line: 364, column: 14, scope: !988)
!1118 = !DILocation(line: 0, scope: !988)
!1119 = !DILocation(line: 368, column: 7, scope: !998)
!1120 = !DILocation(line: 0, scope: !996)
!1121 = !DILocation(line: 373, column: 9, scope: !1002)
!1122 = !DILocation(line: 378, column: 63, scope: !1000)
!1123 = !DILocation(line: 378, column: 21, scope: !1000)
!1124 = !DILocation(line: 0, scope: !1000)
!1125 = !DILocation(line: 379, column: 19, scope: !1000)
!1126 = !{!1052, !1052, i64 0}
!1127 = !DILocation(line: 379, column: 18, scope: !1000)
!1128 = !DILocation(line: 379, column: 13, scope: !1000)
!1129 = !DILocation(line: 380, column: 19, scope: !1000)
!1130 = !DILocation(line: 380, column: 18, scope: !1000)
!1131 = !DILocation(line: 380, column: 13, scope: !1000)
!1132 = distinct !{!1132, !1121, !1133, !1134, !1135}
!1133 = !DILocation(line: 381, column: 9, scope: !1002)
!1134 = !{!"llvm.loop.mustprogress"}
!1135 = !{!"llvm.loop.unroll.disable"}
!1136 = !DILocation(line: 382, column: 36, scope: !996)
!1137 = !DILocation(line: 382, column: 43, scope: !996)
!1138 = !DILocation(line: 382, column: 22, scope: !996)
!1139 = distinct !{!1139, !1119, !1140, !1134, !1135}
!1140 = !DILocation(line: 383, column: 7, scope: !998)
!1141 = !DILocation(line: 384, column: 23, scope: !988)
!1142 = !DILocation(line: 384, column: 22, scope: !988)
!1143 = !{!1144, !1052, i64 0}
!1144 = !{!"_CannyInfo", !1052, i64 0, !1052, i64 8, !1060, i64 16, !1048, i64 24, !1048, i64 32}
!1145 = !DILocation(line: 385, column: 24, scope: !988)
!1146 = !{!1144, !1060, i64 16}
!1147 = !DILocation(line: 386, column: 11, scope: !1005)
!1148 = !DILocation(line: 386, column: 20, scope: !1005)
!1149 = !DILocation(line: 386, column: 11, scope: !988)
!1150 = !DILocation(line: 391, column: 19, scope: !1004)
!1151 = !DILocation(line: 0, scope: !1004)
!1152 = !DILocation(line: 392, column: 21, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 392, column: 15)
!1154 = !DILocation(line: 392, column: 15, scope: !1004)
!1155 = !DILocation(line: 394, column: 25, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 394, column: 19)
!1157 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 393, column: 13)
!1158 = !DILocation(line: 394, column: 19, scope: !1157)
!1159 = !DILocation(line: 397, column: 27, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 397, column: 21)
!1161 = !DILocation(line: 404, column: 25, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 404, column: 19)
!1163 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 403, column: 13)
!1164 = !DILocation(line: 404, column: 19, scope: !1163)
!1165 = !DILocation(line: 407, column: 27, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1162, file: !3, line: 407, column: 21)
!1167 = !DILocation(line: 0, scope: !1153)
!1168 = !DILocation(line: 413, column: 11, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !988, file: !3, line: 413, column: 11)
!1170 = !DILocation(line: 413, column: 52, scope: !1169)
!1171 = !DILocation(line: 413, column: 11, scope: !988)
!1172 = !DILocation(line: 416, column: 5, scope: !989)
!1173 = !DILocation(line: 337, column: 51, scope: !989)
!1174 = distinct !{!1174, !1114, !1175, !1134, !1135}
!1175 = !DILocation(line: 416, column: 5, scope: !990)
!1176 = !DILocation(line: 320, column: 46, scope: !984)
