; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/common/filter_encoder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/filter_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_filter_encoder = type { i64, ptr, ptr, ptr, ptr, i32, ptr }
%struct.lzma_filter = type { i64, ptr }
%struct.lzma_stream = type { ptr, i64, i64, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i32, i32 }
%struct.lzma_next_coder_s = type { ptr, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "encoders", scope: !2, file: !169, line: 56, type: !170, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !136, globals: !168, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/filter_encoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "fc5fadddba740b28186eb750b5e2aebe")
!4 = !{!5, !21, !27, !34, !133}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 57, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "LZMA_OK", value: 0)
!10 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!11 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!12 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!13 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!14 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!15 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!16 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!17 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!18 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!19 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!20 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 250, baseType: !7, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!24 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!25 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!26 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 27, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!31 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!32 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!33 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !36, file: !35, line: 187, baseType: !7, size: 32, elements: !126)
!35 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !35, line: 179, size: 704, elements: !37)
!37 = !{!38, !118, !119, !120, !125}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !35, line: 181, baseType: !39, size: 512)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !35, line: 80, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !35, line: 124, size: 512, elements: !41)
!41 = !{!42, !45, !53, !56, !89, !94, !101, !106}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !40, file: !35, line: 126, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !35, line: 78, baseType: null)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !35, line: 130, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !47, line: 63, baseType: !48)
!47 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !49, line: 27, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !51, line: 45, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!52 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !40, file: !35, line: 136, baseType: !54, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !55, line: 90, baseType: !52)
!55 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !40, file: !35, line: 139, baseType: !57, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !35, line: 94, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !43, !62, !78, !84, !71, !86, !84, !71, !88}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !6, line: 237, baseType: !5)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !6, line: 403, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 341, size: 192, elements: !65)
!65 = !{!66, !73, !77}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !64, file: !6, line: 376, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !70, !71, !71}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 46, baseType: !52)
!72 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !64, file: !6, line: 390, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !70, !70}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !64, file: !6, line: 401, baseType: !70, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !49, line: 24, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !51, line: 38, baseType: !83)
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !6, line: 322, baseType: !21)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !40, file: !35, line: 144, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !35, line: 102, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !43, !62}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !40, file: !35, line: 148, baseType: !95, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !28, line: 55, baseType: !27)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !40, file: !35, line: 152, baseType: !102, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!61, !43, !105, !105, !48}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !40, file: !35, line: 157, baseType: !107, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!61, !43, !62, !110, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !113, line: 65, baseType: !114)
!113 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 43, size: 128, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !114, file: !113, line: 54, baseType: !46, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !114, file: !113, line: 63, baseType: !70, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !36, file: !35, line: 194, baseType: !34, size: 32, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !36, file: !35, line: 199, baseType: !71, size: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !36, file: !35, line: 202, baseType: !121, size: 32, offset: 640)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 32, elements: !123)
!122 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!123 = !{!124}
!124 = !DISubrange(count: 4)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !36, file: !35, line: 206, baseType: !122, size: 8, offset: 672)
!126 = !{!127, !128, !129, !130, !131, !132}
!127 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!128 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!129 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!130 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!131 = !DIEnumerator(name: "ISEQ_END", value: 4)
!132 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 44, baseType: !7, size: 32, elements: !134)
!134 = !{!135}
!135 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!136 = !{!70, !137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_find", file: !138, line: 35, baseType: !139)
!138 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/filter_common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2b3d0d0ae4b0d967ddcb9fa677c708ca")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !46}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_coder", file: !138, line: 32, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 20, size: 192, elements: !146)
!146 = !{!147, !148, !162}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !138, line: 22, baseType: !46, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !145, file: !138, line: 26, baseType: !149, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !35, line: 86, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!61, !153, !62, !154}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !35, line: 82, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !35, line: 109, size: 192, elements: !158)
!158 = !{!159, !160, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !157, file: !35, line: 112, baseType: !46, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !157, file: !35, line: 116, baseType: !149, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !157, file: !35, line: 119, baseType: !70, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !145, file: !138, line: 30, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!48, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!168 = !{!0}
!169 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/filter_encoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fc5fadddba740b28186eb750b5e2aebe")
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 4032, elements: !194)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_encoder", file: !169, line: 53, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !169, line: 21, size: 448, elements: !174)
!174 = !{!175, !176, !177, !178, !182, !189, !190}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !173, file: !169, line: 23, baseType: !46, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !169, line: 27, baseType: !149, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !173, file: !169, line: 31, baseType: !163, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !173, file: !169, line: 37, baseType: !179, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!46, !166}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "props_size_get", scope: !173, file: !169, line: 42, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!61, !186, !166}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 26, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !51, line: 42, baseType: !7)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "props_size_fixed", scope: !173, file: !169, line: 43, baseType: !187, size: 32, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "props_encode", scope: !173, file: !169, line: 51, baseType: !191, size: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!61, !166, !87}
!194 = !{!195}
!195 = !DISubrange(count: 9)
!196 = !{i32 7, !"Dwarf Version", i32 5}
!197 = !{i32 2, !"Debug Info Version", i32 3}
!198 = !{i32 1, !"wchar_size", i32 4}
!199 = !{i32 7, !"PIC Level", i32 2}
!200 = !{i32 7, !"PIE Level", i32 2}
!201 = !{i32 7, !"uwtable", i32 2}
!202 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!203 = distinct !DISubprogram(name: "lzma_filter_encoder_is_supported", scope: !169, file: !169, line: 165, type: !204, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !207)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !46}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !6, line: 29, baseType: !83)
!207 = !{!208}
!208 = !DILocalVariable(name: "id", arg: 1, scope: !203, file: !169, line: 165, type: !46)
!209 = !DILocation(line: 0, scope: !203)
!210 = !DILocalVariable(name: "id", arg: 1, scope: !211, file: !169, line: 154, type: !46)
!211 = distinct !DISubprogram(name: "encoder_find", scope: !169, file: !169, line: 154, type: !212, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !215)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !46}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!215 = !{!210, !216}
!216 = !DILocalVariable(name: "i", scope: !217, file: !169, line: 156, type: !71)
!217 = distinct !DILexicalBlock(scope: !211, file: !169, line: 156, column: 2)
!218 = !DILocation(line: 0, scope: !211, inlinedAt: !219)
!219 = distinct !DILocation(line: 167, column: 9, scope: !203)
!220 = !DILocation(line: 0, scope: !217, inlinedAt: !219)
!221 = !DILocation(line: 156, column: 2, scope: !217, inlinedAt: !219)
!222 = !DILocation(line: 157, column: 7, scope: !223, inlinedAt: !219)
!223 = distinct !DILexicalBlock(scope: !224, file: !169, line: 157, column: 7)
!224 = distinct !DILexicalBlock(scope: !217, file: !169, line: 156, column: 2)
!225 = !DILocation(line: 157, column: 19, scope: !223, inlinedAt: !219)
!226 = !{!227, !228, i64 0}
!227 = !{!"", !228, i64 0, !231, i64 8, !231, i64 16, !231, i64 24, !231, i64 32, !232, i64 40, !231, i64 48}
!228 = !{!"long", !229, i64 0}
!229 = !{!"omnipotent char", !230, i64 0}
!230 = !{!"Simple C/C++ TBAA"}
!231 = !{!"any pointer", !229, i64 0}
!232 = !{!"int", !229, i64 0}
!233 = !DILocation(line: 157, column: 22, scope: !223, inlinedAt: !219)
!234 = !DILocation(line: 157, column: 7, scope: !224, inlinedAt: !219)
!235 = distinct !{!235, !221, !236, !237, !238}
!236 = !DILocation(line: 158, column: 22, scope: !217, inlinedAt: !219)
!237 = !{!"llvm.loop.mustprogress"}
!238 = !{!"llvm.loop.unroll.disable"}
!239 = !DILocation(line: 167, column: 9, scope: !203)
!240 = !DILocation(line: 167, column: 2, scope: !203)
!241 = !DILocation(line: 0, scope: !211)
!242 = !DILocation(line: 0, scope: !217)
!243 = !DILocation(line: 156, column: 2, scope: !217)
!244 = !DILocation(line: 157, column: 7, scope: !223)
!245 = !DILocation(line: 157, column: 19, scope: !223)
!246 = !DILocation(line: 157, column: 22, scope: !223)
!247 = !DILocation(line: 157, column: 7, scope: !224)
!248 = !DILocation(line: 158, column: 20, scope: !223)
!249 = !DILocation(line: 158, column: 4, scope: !223)
!250 = !DILocation(line: 156, column: 47, scope: !224)
!251 = !DILocation(line: 156, column: 23, scope: !224)
!252 = distinct !{!252, !243, !253, !237, !238}
!253 = !DILocation(line: 158, column: 22, scope: !217)
!254 = !DILocation(line: 161, column: 1, scope: !211)
!255 = distinct !DISubprogram(name: "lzma_filters_update", scope: !169, file: !169, line: 172, type: !256, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !283)
!256 = !DISubroutineType(types: !257)
!257 = !{!61, !258, !110}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !6, line: 490, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 453, size: 1088, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !272, !273, !274, !275, !276, !277, !278, !279, !280, !282}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !260, file: !6, line: 454, baseType: !79, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !260, file: !6, line: 455, baseType: !71, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !260, file: !6, line: 456, baseType: !48, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !260, file: !6, line: 458, baseType: !87, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !260, file: !6, line: 459, baseType: !71, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !260, file: !6, line: 460, baseType: !48, size: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !260, file: !6, line: 468, baseType: !62, size: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !260, file: !6, line: 471, baseType: !270, size: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !6, line: 411, baseType: !36)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !260, file: !6, line: 479, baseType: !70, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !260, file: !6, line: 480, baseType: !70, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !260, file: !6, line: 481, baseType: !70, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !260, file: !6, line: 482, baseType: !70, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !260, file: !6, line: 483, baseType: !48, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !260, file: !6, line: 484, baseType: !48, size: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !260, file: !6, line: 485, baseType: !71, size: 64, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !260, file: !6, line: 486, baseType: !71, size: 64, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !260, file: !6, line: 487, baseType: !281, size: 32, offset: 1024)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !6, line: 46, baseType: !133)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !260, file: !6, line: 488, baseType: !281, size: 32, offset: 1056)
!283 = !{!284, !285, !286, !287, !291}
!284 = !DILocalVariable(name: "strm", arg: 1, scope: !255, file: !169, line: 172, type: !258)
!285 = !DILocalVariable(name: "filters", arg: 2, scope: !255, file: !169, line: 172, type: !110)
!286 = !DILocalVariable(name: "count", scope: !255, file: !169, line: 183, type: !71)
!287 = !DILocalVariable(name: "reversed_filters", scope: !255, file: !169, line: 187, type: !288)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 640, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 5)
!291 = !DILocalVariable(name: "i", scope: !292, file: !169, line: 188, type: !71)
!292 = distinct !DILexicalBlock(scope: !255, file: !169, line: 188, column: 2)
!293 = !DILocation(line: 0, scope: !255)
!294 = !DILocation(line: 174, column: 12, scope: !295)
!295 = distinct !DILexicalBlock(scope: !255, file: !169, line: 174, column: 6)
!296 = !{!297, !231, i64 56}
!297 = !{!"", !231, i64 0, !228, i64 8, !228, i64 16, !231, i64 24, !228, i64 32, !228, i64 40, !231, i64 48, !231, i64 56, !231, i64 64, !231, i64 72, !231, i64 80, !231, i64 88, !228, i64 96, !228, i64 104, !228, i64 112, !228, i64 120, !229, i64 128, !229, i64 132}
!298 = !DILocation(line: 174, column: 27, scope: !295)
!299 = !{!300, !231, i64 56}
!300 = !{!"lzma_internal_s", !301, i64 0, !229, i64 64, !228, i64 72, !229, i64 80, !302, i64 84}
!301 = !{!"lzma_next_coder_s", !231, i64 0, !228, i64 8, !228, i64 16, !231, i64 24, !231, i64 32, !231, i64 40, !231, i64 48, !231, i64 56}
!302 = !{!"_Bool", !229, i64 0}
!303 = !DILocation(line: 174, column: 34, scope: !295)
!304 = !DILocation(line: 174, column: 6, scope: !255)
!305 = !DILocalVariable(name: "filters", arg: 1, scope: !306, file: !169, line: 222, type: !110)
!306 = distinct !DISubprogram(name: "lzma_raw_encoder_memusage", scope: !169, file: !169, line: 222, type: !307, scopeLine: 223, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !309)
!307 = !DISubroutineType(types: !308)
!308 = !{!48, !110}
!309 = !{!305}
!310 = !DILocation(line: 0, scope: !306, inlinedAt: !311)
!311 = distinct !DILocation(line: 178, column: 6, scope: !312)
!312 = distinct !DILexicalBlock(scope: !255, file: !169, line: 178, column: 6)
!313 = !DILocation(line: 224, column: 9, scope: !306, inlinedAt: !311)
!314 = !DILocation(line: 178, column: 41, scope: !312)
!315 = !DILocation(line: 178, column: 6, scope: !255)
!316 = !DILocation(line: 184, column: 9, scope: !255)
!317 = !DILocation(line: 184, column: 24, scope: !255)
!318 = !{!319, !228, i64 0}
!319 = !{!"", !228, i64 0, !231, i64 8}
!320 = !DILocation(line: 184, column: 27, scope: !255)
!321 = !DILocation(line: 185, column: 3, scope: !255)
!322 = !DILocation(line: 184, column: 2, scope: !255)
!323 = distinct !{!323, !322, !324, !237, !238}
!324 = !DILocation(line: 185, column: 5, scope: !255)
!325 = !DILocation(line: 187, column: 2, scope: !255)
!326 = !DILocation(line: 187, column: 14, scope: !255)
!327 = !DILocation(line: 0, scope: !292)
!328 = !DILocation(line: 188, column: 23, scope: !329)
!329 = distinct !DILexicalBlock(scope: !292, file: !169, line: 188, column: 2)
!330 = !DILocation(line: 188, column: 2, scope: !292)
!331 = !DILocation(line: 191, column: 2, scope: !255)
!332 = !DILocation(line: 191, column: 29, scope: !255)
!333 = !DILocation(line: 193, column: 15, scope: !255)
!334 = !DILocation(line: 193, column: 30, scope: !255)
!335 = !DILocation(line: 193, column: 58, scope: !255)
!336 = !{!300, !231, i64 0}
!337 = !DILocation(line: 194, column: 10, scope: !255)
!338 = !{!297, !231, i64 48}
!339 = !DILocation(line: 193, column: 9, scope: !255)
!340 = !DILocation(line: 195, column: 1, scope: !255)
!341 = !DILocation(line: 189, column: 30, scope: !329)
!342 = !DILocation(line: 189, column: 3, scope: !329)
