; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/common/filter_common.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/filter_common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i64, i64, i8, i8, i8 }
%struct.lzma_filter = type { i64, ptr }
%struct.lzma_filter_info_s = type { i64, ptr, ptr }
%struct.lzma_filter_coder = type { i64, ptr, ptr }

@features = internal unnamed_addr constant [10 x %struct.anon] [%struct.anon { i64 4611686018427387905, i64 112, i8 0, i8 1, i8 1 }, %struct.anon { i64 33, i64 112, i8 0, i8 1, i8 1 }, %struct.anon { i64 4, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 5, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 6, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 7, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 8, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 9, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 3, i64 40, i8 1, i8 0, i8 0 }, %struct.anon { i64 -1, i64 0, i8 0, i8 0, i8 0 }], align 16, !dbg !0

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_filters_copy(ptr noundef readonly %src, ptr noundef %dest, ptr noundef %allocator) local_unnamed_addr #0 !dbg !66 {
entry:
  call void @llvm.dbg.value(metadata ptr %src, metadata !93, metadata !DIExpression()), !dbg !105

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "features", scope: !2, file: !37, line: 36, type: !38, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !36, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/filter_common.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "40ce9c1355191130339ea0043a46dd45")
!4 = !{!5, !21, !27}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 57, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "LZMA_OK", value: 0)
!10 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!11 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!12 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!13 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!14 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!15 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!16 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!17 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!18 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!19 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!20 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 250, baseType: !7, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!24 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!25 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!26 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 27, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!31 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!32 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!33 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !{!0}
!37 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/filter_common.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "40ce9c1355191130339ea0043a46dd45")
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1920, elements: !57)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 16, size: 192, elements: !41)
!41 = !{!42, !50, !53, !55, !56}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !37, line: 18, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !44, line: 63, baseType: !45)
!44 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !46, line: 27, baseType: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !48, line: 45, baseType: !49)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!49 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "options_size", scope: !40, file: !37, line: 21, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !52, line: 46, baseType: !49)
!52 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "non_last_ok", scope: !40, file: !37, line: 25, baseType: !54, size: 8, offset: 128)
!54 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "last_ok", scope: !40, file: !37, line: 29, baseType: !54, size: 8, offset: 136)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "changes_size", scope: !40, file: !37, line: 34, baseType: !54, size: 8, offset: 144)
!57 = !{!58}
!58 = !DISubrange(count: 10)
!59 = !{i32 7, !"Dwarf Version", i32 5}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 4}
!62 = !{i32 7, !"PIC Level", i32 2}
!63 = !{i32 7, !"PIE Level", i32 2}
!64 = !{i32 7, !"uwtable", i32 2}
!65 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!66 = distinct !DISubprogram(name: "lzma_filters_copy", scope: !37, file: !37, line: 125, type: !67, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !92)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !70, !78, !79}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !6, line: 237, baseType: !5)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !73, line: 65, baseType: !74)
!73 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 43, size: 128, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !73, line: 54, baseType: !43, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !74, file: !73, line: 63, baseType: !35, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !6, line: 403, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 341, size: 192, elements: !82)
!82 = !{!83, !87, !91}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !81, file: !6, line: 376, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!35, !35, !51, !51}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !81, file: !6, line: 390, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !35, !35}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !81, file: !6, line: 401, baseType: !35, size: 64, offset: 128)
!92 = !{!93, !94, !95, !96, !97, !98, !104}
!93 = !DILocalVariable(name: "src", arg: 1, scope: !66, file: !37, line: 125, type: !70)
!94 = !DILocalVariable(name: "dest", arg: 2, scope: !66, file: !37, line: 125, type: !78)
!95 = !DILocalVariable(name: "allocator", arg: 3, scope: !66, file: !37, line: 126, type: !79)
!96 = !DILocalVariable(name: "ret", scope: !66, file: !37, line: 131, type: !69)
!97 = !DILocalVariable(name: "i", scope: !66, file: !37, line: 132, type: !51)
!98 = !DILocalVariable(name: "j", scope: !99, file: !37, line: 154, type: !51)
!99 = distinct !DILexicalBlock(scope: !100, file: !37, line: 145, column: 10)
!100 = distinct !DILexicalBlock(scope: !101, file: !37, line: 143, column: 7)
!101 = distinct !DILexicalBlock(scope: !102, file: !37, line: 133, column: 50)
!102 = distinct !DILexicalBlock(scope: !103, file: !37, line: 133, column: 2)
!103 = distinct !DILexicalBlock(scope: !66, file: !37, line: 133, column: 2)
!104 = !DILabel(scope: !66, name: "error", file: !37, line: 182)
!105 = !DILocation(line: 0, scope: !66)
!106 = !DILocation(line: 128, column: 10, scope: !107)
!107 = distinct !DILexicalBlock(scope: !66, file: !37, line: 128, column: 6)
!108 = !DILocation(line: 128, column: 18, scope: !107)
!109 = !DILocation(line: 133, column: 21, scope: !102)
!110 = !{!111, !112, i64 0}
!111 = !{!"", !112, i64 0, !115, i64 8}
!112 = !{!"long", !113, i64 0}
!113 = !{!"omnipotent char", !114, i64 0}
!114 = !{!"Simple C/C++ TBAA"}
!115 = !{!"any pointer", !113, i64 0}
!116 = !DILocation(line: 133, column: 24, scope: !102)
!117 = !DILocation(line: 133, column: 2, scope: !103)
!118 = !DILocation(line: 136, column: 9, scope: !119)
!119 = distinct !DILexicalBlock(scope: !101, file: !37, line: 136, column: 7)
!120 = !DILocation(line: 136, column: 7, scope: !101)
!121 = !DILocation(line: 141, column: 3, scope: !101)
!122 = !DILocation(line: 141, column: 14, scope: !101)
!123 = !DILocation(line: 143, column: 14, scope: !100)
!124 = !{!111, !115, i64 8}
!125 = !DILocation(line: 143, column: 22, scope: !100)
!126 = !DILocation(line: 143, column: 7, scope: !101)
!127 = !DILocation(line: 0, scope: !99)
!128 = !DILocation(line: 155, column: 26, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !37, line: 155, column: 4)
!130 = distinct !DILexicalBlock(scope: !99, file: !37, line: 155, column: 4)
!131 = !DILocation(line: 155, column: 4, scope: !130)
!132 = !DILocation(line: 144, column: 12, scope: !133)
!133 = distinct !DILexicalBlock(scope: !100, file: !37, line: 143, column: 31)
!134 = !DILocation(line: 144, column: 20, scope: !133)
!135 = !DILocation(line: 145, column: 3, scope: !133)
!136 = !DILocation(line: 156, column: 24, scope: !137)
!137 = distinct !DILexicalBlock(scope: !138, file: !37, line: 156, column: 9)
!138 = distinct !DILexicalBlock(scope: !129, file: !37, line: 155, column: 50)
!139 = !DILocation(line: 156, column: 9, scope: !138)
!140 = !DILocation(line: 155, column: 45, scope: !129)
!141 = !DILocation(line: 155, column: 29, scope: !129)
!142 = !DILocation(line: 155, column: 41, scope: !129)
!143 = !{!144, !112, i64 0}
!144 = !{!"", !112, i64 0, !112, i64 8, !145, i64 16, !145, i64 17, !145, i64 18}
!145 = !{!"_Bool", !113, i64 0}
!146 = distinct !{!146, !131, !147, !148, !149}
!147 = !DILocation(line: 160, column: 4, scope: !130)
!148 = !{!"llvm.loop.mustprogress"}
!149 = !{!"llvm.loop.unroll.disable"}
!150 = !DILocation(line: 0, scope: !130)
!151 = !DILocation(line: 163, column: 45, scope: !99)
!152 = !{!144, !112, i64 8}
!153 = !DILocation(line: 163, column: 22, scope: !99)
!154 = !DILocation(line: 163, column: 12, scope: !99)
!155 = !DILocation(line: 163, column: 20, scope: !99)
!156 = !DILocation(line: 165, column: 24, scope: !157)
!157 = distinct !DILexicalBlock(scope: !99, file: !37, line: 165, column: 8)
!158 = !DILocation(line: 165, column: 8, scope: !99)
!159 = !DILocation(line: 170, column: 35, scope: !99)
!160 = !DILocation(line: 170, column: 4, scope: !99)
!161 = !DILocation(line: 133, column: 45, scope: !102)
!162 = !DILocation(line: 133, column: 14, scope: !102)
!163 = distinct !{!163, !117, !164, !148, !149}
!164 = !DILocation(line: 173, column: 2, scope: !103)
!165 = !DILocation(line: 0, scope: !103)
!166 = !DILocation(line: 177, column: 2, scope: !66)
!167 = !DILocation(line: 177, column: 13, scope: !66)
!168 = !DILocation(line: 178, column: 10, scope: !66)
!169 = !DILocation(line: 178, column: 18, scope: !66)
!170 = !DILocation(line: 180, column: 2, scope: !66)
!171 = !DILocation(line: 0, scope: !101)
!172 = !DILocation(line: 182, column: 1, scope: !66)
!173 = !DILocation(line: 184, column: 13, scope: !66)
!174 = !DILocation(line: 184, column: 2, scope: !66)
!175 = !DILocation(line: 184, column: 10, scope: !66)
!176 = !DILocation(line: 185, column: 21, scope: !177)
!177 = distinct !DILexicalBlock(scope: !66, file: !37, line: 184, column: 18)
!178 = !DILocation(line: 185, column: 3, scope: !177)
!179 = !DILocation(line: 186, column: 19, scope: !177)
!180 = distinct !{!180, !174, !181, !148, !149}
!181 = !DILocation(line: 187, column: 2, scope: !66)
!182 = !DILocation(line: 190, column: 1, scope: !66)
!183 = !DISubprogram(name: "lzma_alloc", scope: !184, file: !184, line: 211, type: !185, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !187)
!184 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!185 = !DISubroutineType(types: !186)
!186 = !{!35, !51, !79}
!187 = !{}
!188 = !DISubprogram(name: "lzma_free", scope: !184, file: !184, line: 215, type: !189, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !187)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !35, !79}
!191 = distinct !DISubprogram(name: "lzma_raw_coder_init", scope: !37, file: !37, line: 242, type: !192, scopeLine: 245, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !272)
!192 = !DISubroutineType(types: !193)
!193 = !{!69, !194, !79, !70, !242, !54}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !184, line: 80, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !184, line: 124, size: 512, elements: !197)
!197 = !{!198, !201, !202, !205, !221, !226, !233, !238}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !196, file: !184, line: 126, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !184, line: 78, baseType: null)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !196, file: !184, line: 130, baseType: !43, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !196, file: !184, line: 136, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !204, line: 90, baseType: !49)
!204 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !196, file: !184, line: 139, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !184, line: 94, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!69, !199, !79, !210, !216, !51, !218, !216, !51, !220}
!210 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !46, line: 24, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !48, line: 38, baseType: !215)
!215 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!216 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !6, line: 322, baseType: !21)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !196, file: !184, line: 144, baseType: !222, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !184, line: 102, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !199, !79}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !196, file: !184, line: 148, baseType: !227, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !28, line: 55, baseType: !27)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !196, file: !184, line: 152, baseType: !234, size: 64, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!69, !199, !237, !237, !45}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !196, file: !184, line: 157, baseType: !239, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!69, !199, !79, !70, !70}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_find", file: !243, line: 35, baseType: !244)
!243 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/filter_common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2b3d0d0ae4b0d967ddcb9fa677c708ca")
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !43}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_coder", file: !243, line: 32, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !243, line: 20, size: 192, elements: !251)
!251 = !{!252, !253, !266}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !250, file: !243, line: 22, baseType: !43, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !250, file: !243, line: 26, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !184, line: 86, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!69, !194, !79, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !184, line: 82, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !184, line: 109, size: 192, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !261, file: !184, line: 112, baseType: !43, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !261, file: !184, line: 116, baseType: !254, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !261, file: !184, line: 119, baseType: !35, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !250, file: !243, line: 30, baseType: !267, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!45, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !282, !286, !290, !294, !296, !299, !302}
!273 = !DILocalVariable(name: "next", arg: 1, scope: !191, file: !37, line: 242, type: !194)
!274 = !DILocalVariable(name: "allocator", arg: 2, scope: !191, file: !37, line: 242, type: !79)
!275 = !DILocalVariable(name: "options", arg: 3, scope: !191, file: !37, line: 243, type: !70)
!276 = !DILocalVariable(name: "coder_find", arg: 4, scope: !191, file: !37, line: 244, type: !242)
!277 = !DILocalVariable(name: "is_encoder", arg: 5, scope: !191, file: !37, line: 244, type: !54)
!278 = !DILocalVariable(name: "count", scope: !191, file: !37, line: 247, type: !51)
!279 = !DILocalVariable(name: "ret_", scope: !280, file: !37, line: 248, type: !281)
!280 = distinct !DILexicalBlock(scope: !191, file: !37, line: 248, column: 2)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!282 = !DILocalVariable(name: "filters", scope: !191, file: !37, line: 251, type: !283)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 960, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 5)
!286 = !DILocalVariable(name: "i", scope: !287, file: !37, line: 253, type: !51)
!287 = distinct !DILexicalBlock(scope: !288, file: !37, line: 253, column: 3)
!288 = distinct !DILexicalBlock(scope: !289, file: !37, line: 252, column: 18)
!289 = distinct !DILexicalBlock(scope: !191, file: !37, line: 252, column: 6)
!290 = !DILocalVariable(name: "j", scope: !291, file: !37, line: 257, type: !293)
!291 = distinct !DILexicalBlock(scope: !292, file: !37, line: 253, column: 38)
!292 = distinct !DILexicalBlock(scope: !287, file: !37, line: 253, column: 3)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!294 = !DILocalVariable(name: "fc", scope: !291, file: !37, line: 259, type: !295)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!296 = !DILocalVariable(name: "i", scope: !297, file: !37, line: 269, type: !51)
!297 = distinct !DILexicalBlock(scope: !298, file: !37, line: 269, column: 3)
!298 = distinct !DILexicalBlock(scope: !289, file: !37, line: 268, column: 9)
!299 = !DILocalVariable(name: "fc", scope: !300, file: !37, line: 270, type: !295)
!300 = distinct !DILexicalBlock(scope: !301, file: !37, line: 269, column: 38)
!301 = distinct !DILexicalBlock(scope: !297, file: !37, line: 269, column: 3)
!302 = !DILocalVariable(name: "ret", scope: !191, file: !37, line: 286, type: !281)
!303 = !DILocation(line: 0, scope: !191)
!304 = !DILocalVariable(name: "filters", arg: 1, scope: !305, file: !37, line: 194, type: !70)
!305 = distinct !DISubprogram(name: "validate_chain", scope: !37, file: !37, line: 194, type: !306, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{!69, !70, !217}
!308 = !{!304, !309, !310, !311, !312, !313, !314}
!309 = !DILocalVariable(name: "count", arg: 2, scope: !305, file: !37, line: 194, type: !217)
!310 = !DILocalVariable(name: "changes_size_count", scope: !305, file: !37, line: 202, type: !51)
!311 = !DILocalVariable(name: "non_last_ok", scope: !305, file: !37, line: 205, type: !54)
!312 = !DILocalVariable(name: "last_ok", scope: !305, file: !37, line: 210, type: !54)
!313 = !DILocalVariable(name: "i", scope: !305, file: !37, line: 212, type: !51)
!314 = !DILocalVariable(name: "j", scope: !315, file: !37, line: 214, type: !51)
!315 = distinct !DILexicalBlock(scope: !305, file: !37, line: 213, column: 5)
!316 = !DILocation(line: 0, scope: !305, inlinedAt: !317)
