; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/output/flv.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/output/flv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_output_t = type { ptr, ptr, ptr, ptr, ptr }
%struct.flv_buffer = type { ptr, i32, i32, ptr, i64 }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, float, float, float, i32, float, i32, i32, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }
%struct.flv_hnd_t = type { ptr, ptr, i32, i64, i64, i64, i64, i64, i64, i64, i8, i64, i64, i32, i32, i32, i32 }
%struct.x264_nal_t = type { i32, i32, i32, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "flv_output", scope: !2, file: !47, line: 308, type: !48, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !46, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/output/flv.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "3f0ec55a4acb532ea7f382ce8bff8792")
!4 = !{!5, !12, !27, !30}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 48, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/flv_bytestream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7a2361cbd7a5379baf9a3e8d1b18ee49")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "FLV_TAG_TYPE_AUDIO", value: 8)
!10 = !DIEnumerator(name: "FLV_TAG_TYPE_VIDEO", value: 9)
!11 = !DIEnumerator(name: "FLV_TAG_TYPE_META", value: 18)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 92, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!14 = !DIEnumerator(name: "AMF_DATA_TYPE_NUMBER", value: 0)
!15 = !DIEnumerator(name: "AMF_DATA_TYPE_BOOL", value: 1)
!16 = !DIEnumerator(name: "AMF_DATA_TYPE_STRING", value: 2)
!17 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT", value: 3)
!18 = !DIEnumerator(name: "AMF_DATA_TYPE_NULL", value: 5)
!19 = !DIEnumerator(name: "AMF_DATA_TYPE_UNDEFINED", value: 6)
!20 = !DIEnumerator(name: "AMF_DATA_TYPE_REFERENCE", value: 7)
!21 = !DIEnumerator(name: "AMF_DATA_TYPE_MIXEDARRAY", value: 8)
!22 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT_END", value: 9)
!23 = !DIEnumerator(name: "AMF_DATA_TYPE_ARRAY", value: 10)
!24 = !DIEnumerator(name: "AMF_DATA_TYPE_DATE", value: 11)
!25 = !DIEnumerator(name: "AMF_DATA_TYPE_LONG_STRING", value: 12)
!26 = !DIEnumerator(name: "AMF_DATA_TYPE_UNSUPPORTED", value: 13)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 81, baseType: !7, size: 32, elements: !28)
!28 = !{!29}
!29 = !DIEnumerator(name: "FLV_CODECID_H264", value: 7)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 86, baseType: !7, size: 32, elements: !31)
!31 = !{!32, !33}
!32 = !DIEnumerator(name: "FLV_FRAME_KEY", value: 23)
!33 = !DIEnumerator(name: "FLV_FRAME_INTER", value: 39)
!34 = !{!35, !36, !37, !42}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !38, line: 27, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !40, line: 44, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!41 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !43, line: 27, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !40, line: 45, baseType: !45)
!45 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!46 = !{!0}
!47 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/flv.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3f0ec55a4acb532ea7f382ce8bff8792")
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_output_t", file: !50, line: 34, baseType: !51)
!50 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/output.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2609bd03b72b40b15579de35b2e5f690")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 27, size: 320, elements: !52)
!52 = !{!53, !63, !241, !254, !290}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !51, file: !50, line: 29, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !58, !60}
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !62, line: 30, baseType: !35)
!62 = !DIFile(filename: "apps/525.x264_r/src/x264_src/muxers.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bcea0820748b2dc47392b7f6393a96ff")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "set_param", scope: !51, file: !50, line: 30, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!57, !61, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !69, line: 376, baseType: !70)
!69 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !69, line: 176, size: 5632, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !120, !121, !122, !123, !127, !128, !142, !143, !144, !145, !146, !177, !219, !220, !221, !222, !223, !224, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !70, file: !69, line: 179, baseType: !7, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !70, file: !69, line: 180, baseType: !57, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !70, file: !69, line: 181, baseType: !57, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !70, file: !69, line: 182, baseType: !57, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !70, file: !69, line: 183, baseType: !57, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !70, file: !69, line: 186, baseType: !57, size: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !70, file: !69, line: 187, baseType: !57, size: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !70, file: !69, line: 188, baseType: !57, size: 32, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !70, file: !69, line: 189, baseType: !57, size: 32, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !70, file: !69, line: 190, baseType: !57, size: 32, offset: 288)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !70, file: !69, line: 198, baseType: !57, size: 32, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !70, file: !69, line: 215, baseType: !84, size: 288, offset: 352)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !69, line: 200, size: 288, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !84, file: !69, line: 203, baseType: !57, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !84, file: !69, line: 204, baseType: !57, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !84, file: !69, line: 206, baseType: !57, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !84, file: !69, line: 209, baseType: !57, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !84, file: !69, line: 210, baseType: !57, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !84, file: !69, line: 211, baseType: !57, size: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !84, file: !69, line: 212, baseType: !57, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !84, file: !69, line: 213, baseType: !57, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !84, file: !69, line: 214, baseType: !57, size: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !70, file: !69, line: 218, baseType: !57, size: 32, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !70, file: !69, line: 219, baseType: !57, size: 32, offset: 672)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !70, file: !69, line: 220, baseType: !57, size: 32, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !70, file: !69, line: 221, baseType: !57, size: 32, offset: 736)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !70, file: !69, line: 222, baseType: !57, size: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !70, file: !69, line: 224, baseType: !57, size: 32, offset: 800)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !70, file: !69, line: 225, baseType: !57, size: 32, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !70, file: !69, line: 226, baseType: !57, size: 32, offset: 864)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !70, file: !69, line: 227, baseType: !57, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !70, file: !69, line: 229, baseType: !57, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !70, file: !69, line: 230, baseType: !57, size: 32, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !70, file: !69, line: 231, baseType: !57, size: 32, offset: 992)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !70, file: !69, line: 233, baseType: !57, size: 32, offset: 1024)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !70, file: !69, line: 234, baseType: !57, size: 32, offset: 1056)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !70, file: !69, line: 236, baseType: !57, size: 32, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !70, file: !69, line: 237, baseType: !57, size: 32, offset: 1120)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !70, file: !69, line: 239, baseType: !57, size: 32, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !70, file: !69, line: 240, baseType: !58, size: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !70, file: !69, line: 241, baseType: !114, size: 128, offset: 1280)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !118)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !43, line: 24, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !40, line: 38, baseType: !117)
!117 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!118 = !{!119}
!119 = !DISubrange(count: 16)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !70, file: !69, line: 242, baseType: !114, size: 128, offset: 1408)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !70, file: !69, line: 243, baseType: !114, size: 128, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !70, file: !69, line: 244, baseType: !114, size: 128, offset: 1664)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !70, file: !69, line: 245, baseType: !124, size: 512, offset: 1792)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !70, file: !69, line: 246, baseType: !124, size: 512, offset: 2304)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !70, file: !69, line: 249, baseType: !129, size: 64, offset: 2816)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !35, !57, !132, !134}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !136)
!136 = !{!137, !139, !140, !141}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !135, file: !138, line: 308, baseType: !7, size: 32)
!138 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/flv.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !135, file: !138, line: 308, baseType: !7, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !135, file: !138, line: 308, baseType: !35, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !135, file: !138, line: 308, baseType: !35, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !70, file: !69, line: 250, baseType: !35, size: 64, offset: 2880)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !70, file: !69, line: 251, baseType: !57, size: 32, offset: 2944)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !70, file: !69, line: 252, baseType: !57, size: 32, offset: 2976)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !70, file: !69, line: 253, baseType: !58, size: 64, offset: 3008)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !70, file: !69, line: 287, baseType: !147, size: 800, offset: 3072)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !69, line: 256, size: 800, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !169, !170, !171, !175, !176}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !147, file: !69, line: 258, baseType: !7, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !147, file: !69, line: 259, baseType: !7, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !147, file: !69, line: 261, baseType: !57, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !147, file: !69, line: 262, baseType: !57, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !147, file: !69, line: 263, baseType: !57, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !147, file: !69, line: 264, baseType: !57, size: 32, offset: 160)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !147, file: !69, line: 265, baseType: !57, size: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !147, file: !69, line: 267, baseType: !57, size: 32, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !147, file: !69, line: 268, baseType: !57, size: 32, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !147, file: !69, line: 269, baseType: !57, size: 32, offset: 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !147, file: !69, line: 270, baseType: !57, size: 32, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !147, file: !69, line: 271, baseType: !57, size: 32, offset: 352)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !147, file: !69, line: 272, baseType: !57, size: 32, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !147, file: !69, line: 273, baseType: !57, size: 32, offset: 416)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !147, file: !69, line: 274, baseType: !57, size: 32, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !147, file: !69, line: 275, baseType: !57, size: 32, offset: 480)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !147, file: !69, line: 276, baseType: !57, size: 32, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !147, file: !69, line: 277, baseType: !57, size: 32, offset: 544)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !147, file: !69, line: 278, baseType: !168, size: 32, offset: 576)
!168 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !147, file: !69, line: 279, baseType: !168, size: 32, offset: 608)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !147, file: !69, line: 280, baseType: !57, size: 32, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !147, file: !69, line: 283, baseType: !172, size: 64, offset: 672)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !147, file: !69, line: 285, baseType: !57, size: 32, offset: 736)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !147, file: !69, line: 286, baseType: !57, size: 32, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !70, file: !69, line: 327, baseType: !178, size: 1152, offset: 3904)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !69, line: 290, size: 1152, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !217, !218}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !178, file: !69, line: 292, baseType: !57, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !178, file: !69, line: 294, baseType: !57, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !178, file: !69, line: 295, baseType: !57, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !178, file: !69, line: 296, baseType: !57, size: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !178, file: !69, line: 297, baseType: !57, size: 32, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !178, file: !69, line: 299, baseType: !57, size: 32, offset: 160)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !178, file: !69, line: 300, baseType: !168, size: 32, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !178, file: !69, line: 301, baseType: !168, size: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !178, file: !69, line: 302, baseType: !168, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !178, file: !69, line: 303, baseType: !57, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !178, file: !69, line: 304, baseType: !57, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !178, file: !69, line: 305, baseType: !168, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !178, file: !69, line: 306, baseType: !168, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !178, file: !69, line: 307, baseType: !168, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !178, file: !69, line: 309, baseType: !57, size: 32, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !178, file: !69, line: 310, baseType: !168, size: 32, offset: 480)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !178, file: !69, line: 311, baseType: !57, size: 32, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !178, file: !69, line: 312, baseType: !57, size: 32, offset: 544)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !178, file: !69, line: 315, baseType: !57, size: 32, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !178, file: !69, line: 316, baseType: !58, size: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !178, file: !69, line: 317, baseType: !57, size: 32, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !178, file: !69, line: 318, baseType: !58, size: 64, offset: 768)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !178, file: !69, line: 321, baseType: !168, size: 32, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !178, file: !69, line: 322, baseType: !168, size: 32, offset: 864)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !178, file: !69, line: 323, baseType: !168, size: 32, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !178, file: !69, line: 324, baseType: !206, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !69, line: 174, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 167, size: 256, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !208, file: !69, line: 169, baseType: !57, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !208, file: !69, line: 169, baseType: !57, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !208, file: !69, line: 170, baseType: !57, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !208, file: !69, line: 171, baseType: !57, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !208, file: !69, line: 172, baseType: !168, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !208, file: !69, line: 173, baseType: !216, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !178, file: !69, line: 325, baseType: !57, size: 32, offset: 1024)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !178, file: !69, line: 326, baseType: !58, size: 64, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !70, file: !69, line: 330, baseType: !57, size: 32, offset: 5056)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !70, file: !69, line: 331, baseType: !57, size: 32, offset: 5088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !70, file: !69, line: 332, baseType: !57, size: 32, offset: 5120)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !70, file: !69, line: 334, baseType: !57, size: 32, offset: 5152)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !70, file: !69, line: 335, baseType: !57, size: 32, offset: 5184)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !70, file: !69, line: 336, baseType: !225, size: 32, offset: 5216)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 26, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !40, line: 42, baseType: !7)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !70, file: !69, line: 337, baseType: !225, size: 32, offset: 5248)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !70, file: !69, line: 338, baseType: !225, size: 32, offset: 5280)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !70, file: !69, line: 339, baseType: !225, size: 32, offset: 5312)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !70, file: !69, line: 340, baseType: !57, size: 32, offset: 5344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !70, file: !69, line: 344, baseType: !57, size: 32, offset: 5376)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !70, file: !69, line: 356, baseType: !57, size: 32, offset: 5408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !70, file: !69, line: 364, baseType: !57, size: 32, offset: 5440)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !70, file: !69, line: 367, baseType: !57, size: 32, offset: 5472)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !70, file: !69, line: 368, baseType: !57, size: 32, offset: 5504)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !70, file: !69, line: 369, baseType: !57, size: 32, offset: 5536)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !70, file: !69, line: 375, baseType: !238, size: 64, offset: 5568)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !35}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "write_headers", scope: !51, file: !50, line: 31, baseType: !242, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!57, !61, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !69, line: 604, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 593, size: 192, elements: !248)
!248 = !{!249, !250, !251, !252}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !247, file: !69, line: 595, baseType: !57, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !247, file: !69, line: 596, baseType: !57, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !247, file: !69, line: 599, baseType: !57, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !247, file: !69, line: 603, baseType: !253, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame", scope: !51, file: !50, line: 32, baseType: !255, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!57, !61, !253, !57, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !69, line: 549, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 513, size: 1088, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !281, !289}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !260, file: !69, line: 521, baseType: !57, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !260, file: !69, line: 523, baseType: !57, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !260, file: !69, line: 526, baseType: !57, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !260, file: !69, line: 529, baseType: !57, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !260, file: !69, line: 531, baseType: !37, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !260, file: !69, line: 534, baseType: !37, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !260, file: !69, line: 541, baseType: !67, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !260, file: !69, line: 543, baseType: !270, size: 448, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !69, line: 511, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 505, size: 448, elements: !272)
!272 = !{!273, !274, !275, !279}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !271, file: !69, line: 507, baseType: !57, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !271, file: !69, line: 508, baseType: !57, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !271, file: !69, line: 509, baseType: !276, size: 128, offset: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 128, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 4)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !271, file: !69, line: 510, baseType: !280, size: 256, offset: 192)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 256, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !260, file: !69, line: 545, baseType: !282, size: 256, offset: 768)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !69, line: 503, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 496, size: 256, elements: !284)
!284 = !{!285, !286, !287, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !283, file: !69, line: 498, baseType: !36, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !283, file: !69, line: 499, baseType: !36, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !283, file: !69, line: 500, baseType: !36, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !283, file: !69, line: 502, baseType: !36, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !260, file: !69, line: 548, baseType: !35, size: 64, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !51, file: !50, line: 33, baseType: !291, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!57, !61, !37, !37}
!294 = !{i32 7, !"Dwarf Version", i32 5}
!295 = !{i32 2, !"Debug Info Version", i32 3}
!296 = !{i32 1, !"wchar_size", i32 4}
!297 = !{i32 7, !"PIC Level", i32 2}
!298 = !{i32 7, !"PIE Level", i32 2}
!299 = !{i32 7, !"uwtable", i32 2}
!300 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!301 = distinct !DISubprogram(name: "open_file", scope: !47, file: !47, line: 68, type: !55, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!302 = !{!303, !304, !305}
!303 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !301, file: !47, line: 68, type: !58)
!304 = !DILocalVariable(name: "p_handle", arg: 2, scope: !301, file: !47, line: 68, type: !60)
!305 = !DILocalVariable(name: "p_flv", scope: !301, file: !47, line: 70, type: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "flv_hnd_t", file: !47, line: 55, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 30, size: 960, elements: !309)
!309 = !{!310, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !308, file: !47, line: 32, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "flv_buffer", file: !6, line: 116, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flv_buffer", file: !6, line: 109, size: 256, elements: !314)
!314 = !{!315, !316, !317, !318, !375}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !313, file: !6, line: 111, baseType: !253, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !313, file: !6, line: 112, baseType: !7, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !313, file: !6, line: 113, baseType: !7, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !313, file: !6, line: 114, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !321, line: 7, baseType: !322)
!321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !323, line: 49, size: 1728, elements: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !340, !342, !343, !344, !346, !348, !350, !354, !357, !359, !362, !365, !366, !367, !370, !371}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !322, file: !323, line: 51, baseType: !57, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !322, file: !323, line: 54, baseType: !58, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !322, file: !323, line: 55, baseType: !58, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !322, file: !323, line: 56, baseType: !58, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !322, file: !323, line: 57, baseType: !58, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !322, file: !323, line: 58, baseType: !58, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !322, file: !323, line: 59, baseType: !58, size: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !322, file: !323, line: 60, baseType: !58, size: 64, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !322, file: !323, line: 61, baseType: !58, size: 64, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !322, file: !323, line: 64, baseType: !58, size: 64, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !322, file: !323, line: 65, baseType: !58, size: 64, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !322, file: !323, line: 66, baseType: !58, size: 64, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !322, file: !323, line: 68, baseType: !338, size: 64, offset: 768)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !323, line: 36, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !322, file: !323, line: 70, baseType: !341, size: 64, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !322, file: !323, line: 72, baseType: !57, size: 32, offset: 896)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !322, file: !323, line: 73, baseType: !57, size: 32, offset: 928)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !322, file: !323, line: 74, baseType: !345, size: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 152, baseType: !41)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !322, file: !323, line: 77, baseType: !347, size: 16, offset: 1024)
!347 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !322, file: !323, line: 78, baseType: !349, size: 8, offset: 1040)
!349 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !322, file: !323, line: 79, baseType: !351, size: 8, offset: 1048)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 8, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 1)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !322, file: !323, line: 81, baseType: !355, size: 64, offset: 1088)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !323, line: 43, baseType: null)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !322, file: !323, line: 89, baseType: !358, size: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 153, baseType: !41)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !322, file: !323, line: 91, baseType: !360, size: 64, offset: 1216)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !323, line: 37, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !322, file: !323, line: 92, baseType: !363, size: 64, offset: 1280)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !323, line: 38, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !322, file: !323, line: 93, baseType: !341, size: 64, offset: 1344)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !322, file: !323, line: 94, baseType: !35, size: 64, offset: 1408)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !322, file: !323, line: 95, baseType: !368, size: 64, offset: 1472)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !369, line: 46, baseType: !45)
!369 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !322, file: !323, line: 96, baseType: !57, size: 32, offset: 1536)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !322, file: !323, line: 98, baseType: !372, size: 160, offset: 1568)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 160, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 20)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "d_total", scope: !313, file: !6, line: 115, baseType: !42, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sei", scope: !308, file: !47, line: 34, baseType: !253, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sei_len", scope: !308, file: !47, line: 35, baseType: !57, size: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !308, file: !47, line: 37, baseType: !37, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !308, file: !47, line: 38, baseType: !37, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_framenum", scope: !308, file: !47, line: 39, baseType: !37, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_framerate_pos", scope: !308, file: !47, line: 41, baseType: !42, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration_pos", scope: !308, file: !47, line: 42, baseType: !42, size: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_filesize_pos", scope: !308, file: !47, line: 43, baseType: !42, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate_pos", scope: !308, file: !47, line: 44, baseType: !42, size: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "b_write_length", scope: !308, file: !47, line: 46, baseType: !115, size: 8, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_dts", scope: !308, file: !47, line: 47, baseType: !37, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_pts", scope: !308, file: !47, line: 48, baseType: !37, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !308, file: !47, line: 50, baseType: !225, size: 32, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !308, file: !47, line: 51, baseType: !225, size: 32, offset: 864)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !308, file: !47, line: 52, baseType: !57, size: 32, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !308, file: !47, line: 54, baseType: !7, size: 32, offset: 928)
!392 = !DILocation(line: 0, scope: !301)
!393 = !DILocation(line: 70, column: 24, scope: !301)
!394 = !DILocation(line: 71, column: 15, scope: !301)
!395 = !{!396, !396, i64 0}
!396 = !{!"any pointer", !397, i64 0}
!397 = !{!"omnipotent char", !398, i64 0}
!398 = !{!"Simple C/C++ TBAA"}
!399 = !DILocation(line: 72, column: 10, scope: !400)
!400 = distinct !DILexicalBlock(scope: !301, file: !47, line: 72, column: 9)
!401 = !DILocation(line: 72, column: 9, scope: !301)
!402 = !DILocation(line: 76, column: 16, scope: !301)
!403 = !DILocation(line: 76, column: 14, scope: !301)
!404 = !{!405, !396, i64 0}
!405 = !{!"", !396, i64 0, !396, i64 8, !406, i64 16, !407, i64 24, !407, i64 32, !407, i64 40, !407, i64 48, !407, i64 56, !407, i64 64, !407, i64 72, !397, i64 80, !407, i64 88, !407, i64 96, !406, i64 104, !406, i64 108, !406, i64 112, !406, i64 116}
!406 = !{!"int", !397, i64 0}
!407 = !{!"long", !397, i64 0}
!408 = !DILocation(line: 77, column: 10, scope: !409)
!409 = distinct !DILexicalBlock(scope: !301, file: !47, line: 77, column: 9)
!410 = !DILocation(line: 77, column: 9, scope: !301)
!411 = !DILocalVariable(name: "c", arg: 1, scope: !412, file: !47, line: 57, type: !311)
!412 = distinct !DISubprogram(name: "write_header", scope: !47, file: !47, line: 57, type: !413, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !415)
!413 = !DISubroutineType(types: !414)
!414 = !{!57, !311}
!415 = !{!411}
!416 = !DILocation(line: 0, scope: !412, inlinedAt: !417)
!417 = distinct !DILocation(line: 80, column: 5, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !47, line: 80, column: 5)
!419 = distinct !DILexicalBlock(scope: !301, file: !47, line: 80, column: 5)
!420 = !DILocation(line: 59, column: 5, scope: !412, inlinedAt: !417)
!421 = !DILocation(line: 60, column: 5, scope: !412, inlinedAt: !417)
!422 = !DILocation(line: 61, column: 5, scope: !412, inlinedAt: !417)
!423 = !DILocation(line: 62, column: 5, scope: !412, inlinedAt: !417)
!424 = !DILocation(line: 63, column: 5, scope: !412, inlinedAt: !417)
!425 = !DILocation(line: 65, column: 12, scope: !412, inlinedAt: !417)
!426 = !DILocation(line: 80, column: 5, scope: !418)
!427 = !DILocation(line: 80, column: 5, scope: !419)
!428 = !DILocation(line: 81, column: 15, scope: !301)
!429 = !DILocation(line: 83, column: 5, scope: !301)
!430 = !DILocation(line: 84, column: 1, scope: !301)
!431 = distinct !DISubprogram(name: "set_param", scope: !47, file: !47, line: 86, type: !65, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !432)
!432 = !{!433, !434, !435, !436, !437, !438}
!433 = !DILocalVariable(name: "handle", arg: 1, scope: !431, file: !47, line: 86, type: !61)
!434 = !DILocalVariable(name: "p_param", arg: 2, scope: !431, file: !47, line: 86, type: !67)
!435 = !DILocalVariable(name: "p_flv", scope: !431, file: !47, line: 88, type: !306)
!436 = !DILocalVariable(name: "c", scope: !431, file: !47, line: 89, type: !311)
!437 = !DILocalVariable(name: "start", scope: !431, file: !47, line: 93, type: !57)
!438 = !DILocalVariable(name: "length", scope: !431, file: !47, line: 138, type: !7)
!439 = !DILocation(line: 0, scope: !431)
!440 = !DILocation(line: 89, column: 28, scope: !431)
!441 = !DILocation(line: 91, column: 5, scope: !431)
!442 = !DILocation(line: 93, column: 20, scope: !431)
!443 = !{!444, !406, i64 8}
!444 = !{!"flv_buffer", !396, i64 0, !406, i64 8, !406, i64 12, !396, i64 16, !407, i64 24}
!445 = !DILocation(line: 94, column: 5, scope: !431)
!446 = !DILocation(line: 95, column: 5, scope: !431)
!447 = !DILocation(line: 96, column: 5, scope: !431)
!448 = !DILocation(line: 98, column: 5, scope: !431)
