; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/output/flv_bytestream.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/output/flv_bytestream.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.flv_buffer = type { ptr, i32, i32, ptr, i64 }

@.str = private unnamed_addr constant [2 x i8] c"-\00", align 1
@stdout = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"wb\00", align 1

; Function Attrs: mustprogress nofree norecurse nosync nounwind readnone willreturn uwtable
define dso_local i64 @dbl2int(double noundef %value) local_unnamed_addr #0 !dbg !34 {
entry:
  call void @llvm.dbg.value(metadata double %value, metadata !43, metadata !DIExpression()), !dbg !49
  call void @llvm.dbg.value(metadata double %value, metadata !44, metadata !DIExpression()), !dbg !49
  %0 = bitcast double %value to i64, !dbg !50
  ret i64 %0, !dbg !51
}

; Function Attrs: nounwind uwtable
define dso_local void @x264_put_byte(ptr nocapture noundef %c, i8 noundef zeroext %b) local_unnamed_addr #1 !dbg !52 {
entry:
  call void @llvm.dbg.value(metadata ptr %c, metadata !126, metadata !DIExpression()), !dbg !128
  call void @llvm.dbg.value(metadata i8 %b, metadata !127, metadata !DIExpression()), !dbg !128

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/output/flv_bytestream.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "754853b2670cdf5b3e2e77d5a393aff1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/flv_bytestream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7a2361cbd7a5379baf9a3e8d1b18ee49")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!7 = !DIEnumerator(name: "AMF_DATA_TYPE_NUMBER", value: 0)
!8 = !DIEnumerator(name: "AMF_DATA_TYPE_BOOL", value: 1)
!9 = !DIEnumerator(name: "AMF_DATA_TYPE_STRING", value: 2)
!10 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT", value: 3)
!11 = !DIEnumerator(name: "AMF_DATA_TYPE_NULL", value: 5)
!12 = !DIEnumerator(name: "AMF_DATA_TYPE_UNDEFINED", value: 6)
!13 = !DIEnumerator(name: "AMF_DATA_TYPE_REFERENCE", value: 7)
!14 = !DIEnumerator(name: "AMF_DATA_TYPE_MIXEDARRAY", value: 8)
!15 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT_END", value: 9)
!16 = !DIEnumerator(name: "AMF_DATA_TYPE_ARRAY", value: 10)
!17 = !DIEnumerator(name: "AMF_DATA_TYPE_DATE", value: 11)
!18 = !DIEnumerator(name: "AMF_DATA_TYPE_LONG_STRING", value: 12)
!19 = !DIEnumerator(name: "AMF_DATA_TYPE_UNSUPPORTED", value: 13)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 24, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !25, line: 38, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!26 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !{i32 7, !"Dwarf Version", i32 5}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 1, !"wchar_size", i32 4}
!30 = !{i32 7, !"PIC Level", i32 2}
!31 = !{i32 7, !"PIE Level", i32 2}
!32 = !{i32 7, !"uwtable", i32 2}
!33 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!34 = distinct !DISubprogram(name: "dbl2int", scope: !35, file: !35, line: 24, type: !36, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !42)
!35 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/flv_bytestream.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "754853b2670cdf5b3e2e77d5a393aff1")
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !41}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 27, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !25, line: 45, baseType: !40)
!40 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!42 = !{!43, !44}
!43 = !DILocalVariable(name: "value", arg: 1, scope: !34, file: !35, line: 24, type: !41)
!44 = !DILocalVariable(name: "cvrt", scope: !34, file: !35, line: 31, type: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "dbl2int_cvrt", scope: !34, file: !35, line: 28, size: 64, elements: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !45, file: !35, line: 29, baseType: !41, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !45, file: !35, line: 30, baseType: !38, size: 64)
!49 = !DILocation(line: 0, scope: !34)
!50 = !DILocation(line: 33, column: 16, scope: !34)
!51 = !DILocation(line: 33, column: 4, scope: !34)
!52 = distinct !DISubprogram(name: "x264_put_byte", scope: !35, file: !35, line: 41, type: !53, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !125)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !22}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "flv_buffer", file: !4, line: 116, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flv_buffer", file: !4, line: 109, size: 256, elements: !58)
!58 = !{!59, !60, !61, !62, !124}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !4, line: 111, baseType: !21, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !57, file: !4, line: 112, baseType: !5, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !57, file: !4, line: 113, baseType: !5, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !57, file: !4, line: 114, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !65, line: 7, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !67, line: 49, size: 1728, elements: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!68 = !{!69, !71, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !89, !90, !91, !94, !96, !98, !102, !105, !107, !110, !113, !114, !116, !119, !120}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !66, file: !67, line: 51, baseType: !70, size: 32)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !66, file: !67, line: 54, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !66, file: !67, line: 55, baseType: !72, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !66, file: !67, line: 56, baseType: !72, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !66, file: !67, line: 57, baseType: !72, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !66, file: !67, line: 58, baseType: !72, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !66, file: !67, line: 59, baseType: !72, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !66, file: !67, line: 60, baseType: !72, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !66, file: !67, line: 61, baseType: !72, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !66, file: !67, line: 64, baseType: !72, size: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !66, file: !67, line: 65, baseType: !72, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !66, file: !67, line: 66, baseType: !72, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !66, file: !67, line: 68, baseType: !85, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !67, line: 36, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !66, file: !67, line: 70, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !66, file: !67, line: 72, baseType: !70, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !66, file: !67, line: 73, baseType: !70, size: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !66, file: !67, line: 74, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !25, line: 152, baseType: !93)
!93 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !66, file: !67, line: 77, baseType: !95, size: 16, offset: 1024)
!95 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !66, file: !67, line: 78, baseType: !97, size: 8, offset: 1040)
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !66, file: !67, line: 79, baseType: !99, size: 8, offset: 1048)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !66, file: !67, line: 81, baseType: !103, size: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !67, line: 43, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !66, file: !67, line: 89, baseType: !106, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !25, line: 153, baseType: !93)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !66, file: !67, line: 91, baseType: !108, size: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !67, line: 37, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !66, file: !67, line: 92, baseType: !111, size: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !67, line: 38, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !66, file: !67, line: 93, baseType: !88, size: 64, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !66, file: !67, line: 94, baseType: !115, size: 64, offset: 1408)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !66, file: !67, line: 95, baseType: !117, size: 64, offset: 1472)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 46, baseType: !40)
!118 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !66, file: !67, line: 96, baseType: !70, size: 32, offset: 1536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !66, file: !67, line: 98, baseType: !121, size: 160, offset: 1568)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 160, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 20)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "d_total", scope: !57, file: !4, line: 115, baseType: !38, size: 64, offset: 192)
!125 = !{!126, !127}
!126 = !DILocalVariable(name: "c", arg: 1, scope: !52, file: !35, line: 41, type: !55)
!127 = !DILocalVariable(name: "b", arg: 2, scope: !52, file: !35, line: 41, type: !22)
!128 = !DILocation(line: 0, scope: !52)
!129 = !DILocalVariable(name: "c", arg: 1, scope: !130, file: !35, line: 114, type: !55)
!130 = distinct !DISubprogram(name: "flv_append_data", scope: !35, file: !35, line: 114, type: !131, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{!70, !55, !21, !5}
!133 = !{!129, !134, !135, !136, !137, !140}
!134 = !DILocalVariable(name: "data", arg: 2, scope: !130, file: !35, line: 114, type: !21)
!135 = !DILocalVariable(name: "size", arg: 3, scope: !130, file: !35, line: 114, type: !5)
!136 = !DILocalVariable(name: "ns", scope: !130, file: !35, line: 116, type: !5)
!137 = !DILocalVariable(name: "dp", scope: !138, file: !35, line: 120, type: !115)
!138 = distinct !DILexicalBlock(scope: !139, file: !35, line: 119, column: 5)
!139 = distinct !DILexicalBlock(scope: !130, file: !35, line: 118, column: 9)
!140 = !DILocalVariable(name: "dn", scope: !138, file: !35, line: 121, type: !5)
!141 = !DILocation(line: 0, scope: !130, inlinedAt: !142)
!142 = distinct !DILocation(line: 43, column: 5, scope: !52)
!143 = !DILocation(line: 116, column: 22, scope: !130, inlinedAt: !142)
!144 = !{!145, !149, i64 8}
!145 = !{!"flv_buffer", !146, i64 0, !149, i64 8, !149, i64 12, !146, i64 16, !150, i64 24}
!146 = !{!"any pointer", !147, i64 0}
!147 = !{!"omnipotent char", !148, i64 0}
!148 = !{!"Simple C/C++ TBAA"}
!149 = !{!"int", !147, i64 0}
!150 = !{!"long", !147, i64 0}
!151 = !DILocation(line: 116, column: 28, scope: !130, inlinedAt: !142)
!152 = !DILocation(line: 118, column: 17, scope: !139, inlinedAt: !142)
!153 = !{!145, !149, i64 12}
!154 = !DILocation(line: 118, column: 12, scope: !139, inlinedAt: !142)
!155 = !DILocation(line: 118, column: 9, scope: !130, inlinedAt: !142)
!156 = !DILocation(line: 133, column: 16, scope: !130, inlinedAt: !142)
!157 = !{!145, !146, i64 0}
!158 = !DILocation(line: 0, scope: !138, inlinedAt: !142)
!159 = !DILocation(line: 122, column: 19, scope: !138, inlinedAt: !142)
!160 = !DILocation(line: 123, column: 16, scope: !138, inlinedAt: !142)
!161 = !DILocation(line: 122, column: 9, scope: !138, inlinedAt: !142)
!162 = distinct !{!162, !161, !163, !164, !165}
!163 = !DILocation(line: 123, column: 20, scope: !138, inlinedAt: !142)
!164 = !{!"llvm.loop.mustprogress"}
!165 = !{!"llvm.loop.unroll.disable"}
!166 = !DILocation(line: 125, column: 26, scope: !138, inlinedAt: !142)
!167 = !DILocation(line: 125, column: 32, scope: !138, inlinedAt: !142)
!168 = !DILocation(line: 125, column: 14, scope: !138, inlinedAt: !142)
!169 = !DILocation(line: 126, column: 14, scope: !170, inlinedAt: !142)
!170 = distinct !DILexicalBlock(scope: !138, file: !35, line: 126, column: 13)
!171 = !DILocation(line: 126, column: 13, scope: !138, inlinedAt: !142)
!172 = !DILocation(line: 129, column: 17, scope: !138, inlinedAt: !142)
!173 = !DILocation(line: 130, column: 18, scope: !138, inlinedAt: !142)
!174 = !DILocation(line: 133, column: 26, scope: !130, inlinedAt: !142)
!175 = !DILocation(line: 133, column: 21, scope: !130, inlinedAt: !142)
!176 = !DILocation(line: 133, column: 5, scope: !130, inlinedAt: !142)
!177 = !DILocation(line: 135, column: 14, scope: !130, inlinedAt: !142)
!178 = !DILocation(line: 137, column: 5, scope: !130, inlinedAt: !142)
!179 = !DILocation(line: 44, column: 1, scope: !52)
!180 = !DILocation(line: 0, scope: !130)
!181 = !DILocation(line: 116, column: 22, scope: !130)
!182 = !DILocation(line: 116, column: 28, scope: !130)
!183 = !DILocation(line: 118, column: 17, scope: !139)
!184 = !DILocation(line: 118, column: 12, scope: !139)
