; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/common/frame.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/frame.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [129 x ptr], i32, i32, i32, i32, i32, %struct.anon.2, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [92 x ptr], [92 x [4 x ptr]], ptr, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, ptr, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], ptr, [2 x [3 x ptr]], [2 x ptr], [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], ptr, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, ptr, [8 x i8] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/frame.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "2de27f64079da1a9117f5fc2a58ed5b6")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pic_struct_e", file: !4, line: 483, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "PIC_STRUCT_AUTO", value: 0)
!8 = !DIEnumerator(name: "PIC_STRUCT_PROGRESSIVE", value: 1)
!9 = !DIEnumerator(name: "PIC_STRUCT_TOP_BOTTOM", value: 4)
!10 = !DIEnumerator(name: "PIC_STRUCT_BOTTOM_TOP", value: 5)
!11 = !DIEnumerator(name: "PIC_STRUCT_TOP_BOTTOM_TOP", value: 6)
!12 = !DIEnumerator(name: "PIC_STRUCT_BOTTOM_TOP_BOTTOM", value: 7)
!13 = !DIEnumerator(name: "PIC_STRUCT_DOUBLE", value: 8)
!14 = !DIEnumerator(name: "PIC_STRUCT_TRIPLE", value: 9)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 25, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !20, line: 40, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!21 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!22 = !{i32 7, !"Dwarf Version", i32 5}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{i32 7, !"PIC Level", i32 2}
!26 = !{i32 7, !"PIE Level", i32 2}
!27 = !{i32 7, !"uwtable", i32 2}
!28 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!29 = distinct !DISubprogram(name: "x264_frame_new", scope: !30, file: !30, line: 29, type: !31, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1342)
!30 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2de27f64079da1a9117f5fc2a58ed5b6")
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !380, !39}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !35, line: 146, baseType: !36)
!35 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !35, line: 31, size: 125056, elements: !37)
!37 = !{!38, !40, !41, !42, !47, !48, !49, !50, !51, !52, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !247, !248, !249, !250, !251, !252, !255, !259, !260, !261, !262, !263, !291, !293, !294, !296, !301, !302, !306, !307, !311, !315, !318, !320, !321, !324, !325, !327, !328, !329, !332, !334, !335, !336, !338, !339, !340, !341, !342, !343, !344, !345, !347, !348, !352, !361, !365, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !36, file: !35, line: 34, baseType: !39, size: 32)
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !36, file: !35, line: 35, baseType: !39, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !36, file: !35, line: 36, baseType: !39, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !36, file: !35, line: 37, baseType: !43, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !44, line: 27, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !20, line: 44, baseType: !46)
!46 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !36, file: !35, line: 38, baseType: !43, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !36, file: !35, line: 39, baseType: !39, size: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !36, file: !35, line: 40, baseType: !39, size: 32, offset: 288)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !36, file: !35, line: 41, baseType: !39, size: 32, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !36, file: !35, line: 42, baseType: !39, size: 32, offset: 352)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !36, file: !35, line: 43, baseType: !53, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !4, line: 376, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !4, line: 176, size: 5632, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !100, !107, !108, !109, !110, !114, !115, !130, !131, !132, !133, !134, !165, !207, !208, !209, !210, !211, !212, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !55, file: !4, line: 179, baseType: !5, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !55, file: !4, line: 180, baseType: !39, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !55, file: !4, line: 181, baseType: !39, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !55, file: !4, line: 182, baseType: !39, size: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !55, file: !4, line: 183, baseType: !39, size: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !55, file: !4, line: 186, baseType: !39, size: 32, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !55, file: !4, line: 187, baseType: !39, size: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !55, file: !4, line: 188, baseType: !39, size: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !55, file: !4, line: 189, baseType: !39, size: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !55, file: !4, line: 190, baseType: !39, size: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !55, file: !4, line: 198, baseType: !39, size: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !55, file: !4, line: 215, baseType: !69, size: 288, offset: 352)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !55, file: !4, line: 200, size: 288, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !69, file: !4, line: 203, baseType: !39, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !69, file: !4, line: 204, baseType: !39, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !69, file: !4, line: 206, baseType: !39, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !69, file: !4, line: 209, baseType: !39, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !69, file: !4, line: 210, baseType: !39, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !69, file: !4, line: 211, baseType: !39, size: 32, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !69, file: !4, line: 212, baseType: !39, size: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !69, file: !4, line: 213, baseType: !39, size: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !69, file: !4, line: 214, baseType: !39, size: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !55, file: !4, line: 218, baseType: !39, size: 32, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !55, file: !4, line: 219, baseType: !39, size: 32, offset: 672)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !55, file: !4, line: 220, baseType: !39, size: 32, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !55, file: !4, line: 221, baseType: !39, size: 32, offset: 736)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !55, file: !4, line: 222, baseType: !39, size: 32, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !55, file: !4, line: 224, baseType: !39, size: 32, offset: 800)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !55, file: !4, line: 225, baseType: !39, size: 32, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !55, file: !4, line: 226, baseType: !39, size: 32, offset: 864)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !55, file: !4, line: 227, baseType: !39, size: 32, offset: 896)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !55, file: !4, line: 229, baseType: !39, size: 32, offset: 928)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !55, file: !4, line: 230, baseType: !39, size: 32, offset: 960)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !55, file: !4, line: 231, baseType: !39, size: 32, offset: 992)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !55, file: !4, line: 233, baseType: !39, size: 32, offset: 1024)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !55, file: !4, line: 234, baseType: !39, size: 32, offset: 1056)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !55, file: !4, line: 236, baseType: !39, size: 32, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !55, file: !4, line: 237, baseType: !39, size: 32, offset: 1120)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !55, file: !4, line: 239, baseType: !39, size: 32, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !55, file: !4, line: 240, baseType: !98, size: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !55, file: !4, line: 241, baseType: !101, size: 128, offset: 1280)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !105)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 24, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !20, line: 38, baseType: !104)
!104 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!105 = !{!106}
!106 = !DISubrange(count: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !55, file: !4, line: 242, baseType: !101, size: 128, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !55, file: !4, line: 243, baseType: !101, size: 128, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !55, file: !4, line: 244, baseType: !101, size: 128, offset: 1664)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !55, file: !4, line: 245, baseType: !111, size: 512, offset: 1792)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !55, file: !4, line: 246, baseType: !111, size: 512, offset: 2304)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !55, file: !4, line: 249, baseType: !116, size: 64, offset: 2816)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119, !39, !120, !122}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !124)
!124 = !{!125, !127, !128, !129}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !123, file: !126, baseType: !5, size: 32)
!126 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !123, file: !126, baseType: !5, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !123, file: !126, baseType: !119, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !123, file: !126, baseType: !119, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !55, file: !4, line: 250, baseType: !119, size: 64, offset: 2880)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !55, file: !4, line: 251, baseType: !39, size: 32, offset: 2944)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !55, file: !4, line: 252, baseType: !39, size: 32, offset: 2976)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !55, file: !4, line: 253, baseType: !98, size: 64, offset: 3008)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !55, file: !4, line: 287, baseType: !135, size: 800, offset: 3072)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !55, file: !4, line: 256, size: 800, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !157, !158, !159, !163, !164}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !135, file: !4, line: 258, baseType: !5, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !135, file: !4, line: 259, baseType: !5, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !135, file: !4, line: 261, baseType: !39, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !135, file: !4, line: 262, baseType: !39, size: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !135, file: !4, line: 263, baseType: !39, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !135, file: !4, line: 264, baseType: !39, size: 32, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !135, file: !4, line: 265, baseType: !39, size: 32, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !135, file: !4, line: 267, baseType: !39, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !135, file: !4, line: 268, baseType: !39, size: 32, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !135, file: !4, line: 269, baseType: !39, size: 32, offset: 288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !135, file: !4, line: 270, baseType: !39, size: 32, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !135, file: !4, line: 271, baseType: !39, size: 32, offset: 352)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !135, file: !4, line: 272, baseType: !39, size: 32, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !135, file: !4, line: 273, baseType: !39, size: 32, offset: 416)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !135, file: !4, line: 274, baseType: !39, size: 32, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !135, file: !4, line: 275, baseType: !39, size: 32, offset: 480)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !135, file: !4, line: 276, baseType: !39, size: 32, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !135, file: !4, line: 277, baseType: !39, size: 32, offset: 544)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !135, file: !4, line: 278, baseType: !156, size: 32, offset: 576)
!156 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !135, file: !4, line: 279, baseType: !156, size: 32, offset: 608)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !135, file: !4, line: 280, baseType: !39, size: 32, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !135, file: !4, line: 283, baseType: !160, size: 64, offset: 672)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 2)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !135, file: !4, line: 285, baseType: !39, size: 32, offset: 736)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !135, file: !4, line: 286, baseType: !39, size: 32, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !55, file: !4, line: 327, baseType: !166, size: 1152, offset: 3904)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !55, file: !4, line: 290, size: 1152, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !205, !206}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !166, file: !4, line: 292, baseType: !39, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !166, file: !4, line: 294, baseType: !39, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !166, file: !4, line: 295, baseType: !39, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !166, file: !4, line: 296, baseType: !39, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !166, file: !4, line: 297, baseType: !39, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !166, file: !4, line: 299, baseType: !39, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !166, file: !4, line: 300, baseType: !156, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !166, file: !4, line: 301, baseType: !156, size: 32, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !166, file: !4, line: 302, baseType: !156, size: 32, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !166, file: !4, line: 303, baseType: !39, size: 32, offset: 288)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !166, file: !4, line: 304, baseType: !39, size: 32, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !166, file: !4, line: 305, baseType: !156, size: 32, offset: 352)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !166, file: !4, line: 306, baseType: !156, size: 32, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !166, file: !4, line: 307, baseType: !156, size: 32, offset: 416)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !166, file: !4, line: 309, baseType: !39, size: 32, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !166, file: !4, line: 310, baseType: !156, size: 32, offset: 480)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !166, file: !4, line: 311, baseType: !39, size: 32, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !166, file: !4, line: 312, baseType: !39, size: 32, offset: 544)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !166, file: !4, line: 315, baseType: !39, size: 32, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !166, file: !4, line: 316, baseType: !98, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !166, file: !4, line: 317, baseType: !39, size: 32, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !166, file: !4, line: 318, baseType: !98, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !166, file: !4, line: 321, baseType: !156, size: 32, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !166, file: !4, line: 322, baseType: !156, size: 32, offset: 864)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !166, file: !4, line: 323, baseType: !156, size: 32, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !166, file: !4, line: 324, baseType: !194, size: 64, offset: 960)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !4, line: 174, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 167, size: 256, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !196, file: !4, line: 169, baseType: !39, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !196, file: !4, line: 169, baseType: !39, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !196, file: !4, line: 170, baseType: !39, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !196, file: !4, line: 171, baseType: !39, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !196, file: !4, line: 172, baseType: !156, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !196, file: !4, line: 173, baseType: !204, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !166, file: !4, line: 325, baseType: !39, size: 32, offset: 1024)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !166, file: !4, line: 326, baseType: !98, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !55, file: !4, line: 330, baseType: !39, size: 32, offset: 5056)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !55, file: !4, line: 331, baseType: !39, size: 32, offset: 5088)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !55, file: !4, line: 332, baseType: !39, size: 32, offset: 5120)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !55, file: !4, line: 334, baseType: !39, size: 32, offset: 5152)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !55, file: !4, line: 335, baseType: !39, size: 32, offset: 5184)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !55, file: !4, line: 336, baseType: !213, size: 32, offset: 5216)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 26, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 42, baseType: !5)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !55, file: !4, line: 337, baseType: !213, size: 32, offset: 5248)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !55, file: !4, line: 338, baseType: !213, size: 32, offset: 5280)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !55, file: !4, line: 339, baseType: !213, size: 32, offset: 5312)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !55, file: !4, line: 340, baseType: !39, size: 32, offset: 5344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !55, file: !4, line: 344, baseType: !39, size: 32, offset: 5376)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !55, file: !4, line: 356, baseType: !39, size: 32, offset: 5408)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !55, file: !4, line: 364, baseType: !39, size: 32, offset: 5440)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !55, file: !4, line: 367, baseType: !39, size: 32, offset: 5472)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !55, file: !4, line: 368, baseType: !39, size: 32, offset: 5504)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !55, file: !4, line: 369, baseType: !39, size: 32, offset: 5536)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !55, file: !4, line: 375, baseType: !226, size: 64, offset: 5568)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !119}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !36, file: !35, line: 45, baseType: !39, size: 32, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !36, file: !35, line: 46, baseType: !39, size: 32, offset: 480)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !36, file: !35, line: 47, baseType: !39, size: 32, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !36, file: !35, line: 48, baseType: !39, size: 32, offset: 544)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !36, file: !35, line: 49, baseType: !39, size: 32, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !36, file: !35, line: 50, baseType: !39, size: 32, offset: 608)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !36, file: !35, line: 51, baseType: !39, size: 32, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !36, file: !35, line: 52, baseType: !102, size: 8, offset: 672)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !36, file: !35, line: 53, baseType: !102, size: 8, offset: 680)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !36, file: !35, line: 54, baseType: !102, size: 8, offset: 688)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !36, file: !35, line: 55, baseType: !156, size: 32, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !36, file: !35, line: 56, baseType: !156, size: 32, offset: 736)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !36, file: !35, line: 57, baseType: !39, size: 32, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !36, file: !35, line: 60, baseType: !39, size: 32, offset: 800)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !36, file: !35, line: 61, baseType: !244, size: 96, offset: 832)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 96, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !36, file: !35, line: 62, baseType: !244, size: 96, offset: 928)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !36, file: !35, line: 63, baseType: !244, size: 96, offset: 1024)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !36, file: !35, line: 64, baseType: !39, size: 32, offset: 1120)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !36, file: !35, line: 65, baseType: !39, size: 32, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !36, file: !35, line: 66, baseType: !39, size: 32, offset: 1184)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !36, file: !35, line: 67, baseType: !253, size: 192, offset: 1216)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 192, elements: !245)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !36, file: !35, line: 68, baseType: !256, size: 256, offset: 1408)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 256, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 4)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !36, file: !35, line: 69, baseType: !256, size: 256, offset: 1664)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !36, file: !35, line: 70, baseType: !16, size: 64, offset: 1920)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !36, file: !35, line: 74, baseType: !256, size: 256, offset: 1984)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !36, file: !35, line: 75, baseType: !256, size: 256, offset: 2240)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !36, file: !35, line: 77, baseType: !264, size: 24576, align: 128, offset: 2560)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 24576, align: 128, elements: !290)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !266, line: 36, baseType: !267, align: 128)
!266 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !266, line: 26, size: 512, elements: !268)
!268 = !{!269, !276, !277, !280, !281, !282}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !267, file: !266, line: 30, baseType: !270, size: 128, align: 128)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, elements: !274)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !44, line: 25, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !20, line: 39, baseType: !273)
!273 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!274 = !{!275}
!275 = !DISubrange(count: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !267, file: !266, line: 31, baseType: !270, size: 128, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !267, file: !266, line: 32, baseType: !278, size: 32, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !44, line: 26, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !20, line: 41, baseType: !39)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !267, file: !266, line: 33, baseType: !278, size: 32, offset: 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !267, file: !266, line: 34, baseType: !278, size: 32, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !267, file: !266, line: 35, baseType: !283, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !266, line: 25, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !254, !39, !254, !39, !288, !39}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!290 = !{!106, !246}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !36, file: !35, line: 78, baseType: !292, size: 1024, offset: 27136)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 1024, elements: !105)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !36, file: !35, line: 79, baseType: !39, size: 32, offset: 28160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !36, file: !35, line: 80, baseType: !295, size: 64, offset: 28224)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !36, file: !35, line: 83, baseType: !297, size: 64, offset: 28288)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !44, line: 24, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !20, line: 37, baseType: !300)
!300 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !36, file: !35, line: 84, baseType: !254, size: 64, offset: 28352)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !36, file: !35, line: 85, baseType: !303, size: 128, offset: 28416)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 128, elements: !161)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 32, elements: !161)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !36, file: !35, line: 86, baseType: !304, size: 64, offset: 28544)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !36, file: !35, line: 87, baseType: !308, size: 2176, offset: 28608)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 2176, elements: !309)
!309 = !{!162, !310}
!310 = !DISubrange(count: 17)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !36, file: !35, line: 92, baseType: !312, size: 20736, offset: 30784)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 20736, elements: !313)
!313 = !{!314, !314}
!314 = !DISubrange(count: 18)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !36, file: !35, line: 96, baseType: !316, size: 2176, offset: 51520)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 2176, elements: !309)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !36, file: !35, line: 97, baseType: !319, size: 128, offset: 53696)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 128, elements: !161)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !36, file: !35, line: 98, baseType: !160, size: 64, offset: 53824)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !36, file: !35, line: 99, baseType: !322, size: 1024, offset: 53888)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1024, elements: !323)
!323 = !{!162, !106}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !36, file: !35, line: 100, baseType: !305, size: 32, offset: 54912)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !36, file: !35, line: 105, baseType: !326, size: 10368, offset: 54944)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 10368, elements: !313)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !36, file: !35, line: 106, baseType: !326, size: 10368, offset: 65312)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !36, file: !35, line: 107, baseType: !39, size: 32, offset: 75680)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !36, file: !35, line: 108, baseType: !330, size: 576, offset: 75712)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 576, elements: !331)
!331 = !{!314}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !36, file: !35, line: 109, baseType: !333, size: 20736, offset: 76288)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 20736, elements: !313)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !36, file: !35, line: 110, baseType: !317, size: 64, offset: 97024)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !36, file: !35, line: 111, baseType: !317, size: 64, offset: 97088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !36, file: !35, line: 112, baseType: !337, size: 64, offset: 97152)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !36, file: !35, line: 113, baseType: !337, size: 64, offset: 97216)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !36, file: !35, line: 114, baseType: !337, size: 64, offset: 97280)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !36, file: !35, line: 115, baseType: !39, size: 32, offset: 97344)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !36, file: !35, line: 116, baseType: !16, size: 64, offset: 97408)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !36, file: !35, line: 117, baseType: !16, size: 64, offset: 97472)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !36, file: !35, line: 118, baseType: !16, size: 64, offset: 97536)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !36, file: !35, line: 119, baseType: !39, size: 32, offset: 97600)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !36, file: !35, line: 120, baseType: !346, size: 576, offset: 97632)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 576, elements: !331)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !36, file: !35, line: 121, baseType: !213, size: 32, offset: 98208)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !36, file: !35, line: 122, baseType: !349, size: 64, offset: 98240)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 27, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !20, line: 45, baseType: !351)
!351 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !36, file: !35, line: 125, baseType: !353, size: 256, offset: 98304)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !4, line: 503, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 496, size: 256, elements: !355)
!355 = !{!356, !358, !359, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !354, file: !4, line: 498, baseType: !357, size: 64)
!357 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !354, file: !4, line: 499, baseType: !357, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !354, file: !4, line: 500, baseType: !357, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !354, file: !4, line: 502, baseType: !357, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !36, file: !35, line: 128, baseType: !362, size: 2008, offset: 98560)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 2008, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 251)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !36, file: !35, line: 129, baseType: !366, size: 8032, offset: 100576)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8032, elements: !363)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !36, file: !35, line: 130, baseType: !368, size: 16064, offset: 108608)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 16064, elements: !363)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !36, file: !35, line: 131, baseType: !39, size: 32, offset: 124672)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !36, file: !35, line: 132, baseType: !39, size: 32, offset: 124704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !36, file: !35, line: 135, baseType: !39, size: 32, offset: 124736)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !36, file: !35, line: 136, baseType: !39, size: 32, offset: 124768)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !36, file: !35, line: 137, baseType: !39, size: 32, offset: 124800)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !36, file: !35, line: 138, baseType: !39, size: 32, offset: 124832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !36, file: !35, line: 139, baseType: !39, size: 32, offset: 124864)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !36, file: !35, line: 142, baseType: !156, size: 32, offset: 124896)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !36, file: !35, line: 143, baseType: !39, size: 32, offset: 124928)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !36, file: !35, line: 144, baseType: !39, size: 32, offset: 124960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !36, file: !35, line: 145, baseType: !39, size: 32, offset: 124992)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !4, line: 46, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !383, line: 381, size: 266752, elements: !384)
!383 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!384 = !{!385, !386, !390, !391, !392, !393, !394, !395, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !529, !531, !559, !561, !562, !563, !567, !571, !572, !573, !577, !581, !582, !583, !587, !590, !591, !642, !659, !684, !685, !686, !687, !691, !692, !693, !694, !695, !696, !697, !712, !906, !910, !971, !974, !976, !978, !979, !982, !987, !996, !997, !1005, !1007, !1012, !1088, !1174, !1218, !1240, !1289, !1318}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !382, file: !383, line: 384, baseType: !54, size: 5632)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !382, file: !383, line: 386, baseType: !387, size: 8256, offset: 5632)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 8256, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 129)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !382, file: !383, line: 387, baseType: !39, size: 32, offset: 13888)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !382, file: !383, line: 388, baseType: !39, size: 32, offset: 13920)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !382, file: !383, line: 389, baseType: !39, size: 32, offset: 13952)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !382, file: !383, line: 390, baseType: !39, size: 32, offset: 13984)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !382, file: !383, line: 391, baseType: !39, size: 32, offset: 14016)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !382, file: !383, line: 402, baseType: !396, size: 576, offset: 14080)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !383, line: 394, size: 576, elements: !397)
!397 = !{!398, !399, !400, !409, !410, !411}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !396, file: !383, line: 396, baseType: !39, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !396, file: !383, line: 397, baseType: !39, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !396, file: !383, line: 398, baseType: !401, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !4, line: 604, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 593, size: 192, elements: !404)
!404 = !{!405, !406, !407, !408}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !403, file: !4, line: 595, baseType: !39, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !403, file: !4, line: 596, baseType: !39, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !403, file: !4, line: 599, baseType: !39, size: 32, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !403, file: !4, line: 603, baseType: !254, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !396, file: !383, line: 399, baseType: !39, size: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !396, file: !383, line: 400, baseType: !254, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !396, file: !383, line: 401, baseType: !412, size: 320, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !413, line: 56, baseType: !414)
!413 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !413, line: 47, size: 320, elements: !415)
!415 = !{!416, !417, !418, !419, !422, !423}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !414, file: !413, line: 49, baseType: !254, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !414, file: !413, line: 50, baseType: !254, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !414, file: !413, line: 51, baseType: !254, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !414, file: !413, line: 53, baseType: !420, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !421, line: 87, baseType: !46)
!421 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !414, file: !413, line: 54, baseType: !39, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !414, file: !413, line: 55, baseType: !39, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !382, file: !383, line: 404, baseType: !254, size: 64, offset: 14656)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !382, file: !383, line: 405, baseType: !39, size: 32, offset: 14720)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !382, file: !383, line: 410, baseType: !39, size: 32, offset: 14752)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !382, file: !383, line: 411, baseType: !39, size: 32, offset: 14784)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !382, file: !383, line: 413, baseType: !39, size: 32, offset: 14816)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !382, file: !383, line: 415, baseType: !39, size: 32, offset: 14848)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !382, file: !383, line: 416, baseType: !39, size: 32, offset: 14880)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !382, file: !383, line: 418, baseType: !39, size: 32, offset: 14912)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !382, file: !383, line: 419, baseType: !39, size: 32, offset: 14944)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !382, file: !383, line: 420, baseType: !39, size: 32, offset: 14976)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !382, file: !383, line: 421, baseType: !39, size: 32, offset: 15008)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !382, file: !383, line: 422, baseType: !39, size: 32, offset: 15040)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !382, file: !383, line: 424, baseType: !39, size: 32, offset: 15072)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !382, file: !383, line: 425, baseType: !39, size: 32, offset: 15104)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !382, file: !383, line: 427, baseType: !39, size: 32, offset: 15136)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !382, file: !383, line: 430, baseType: !440, size: 10400, offset: 15168)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 10400, elements: !527)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !442, line: 154, baseType: !443)
!442 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 52, size: 10400, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !462, !463, !464, !465, !466, !467, !468, !469, !470, !477, !478, !526}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !443, file: !442, line: 54, baseType: !39, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !443, file: !442, line: 56, baseType: !39, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !443, file: !442, line: 57, baseType: !39, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !443, file: !442, line: 59, baseType: !39, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !443, file: !442, line: 60, baseType: !39, size: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !443, file: !442, line: 61, baseType: !39, size: 32, offset: 160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !443, file: !442, line: 63, baseType: !39, size: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !443, file: !442, line: 65, baseType: !39, size: 32, offset: 224)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !443, file: !442, line: 67, baseType: !39, size: 32, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !443, file: !442, line: 69, baseType: !39, size: 32, offset: 288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !443, file: !442, line: 70, baseType: !39, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !443, file: !442, line: 71, baseType: !39, size: 32, offset: 352)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !443, file: !442, line: 72, baseType: !39, size: 32, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !443, file: !442, line: 73, baseType: !459, size: 8192, offset: 416)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8192, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !443, file: !442, line: 75, baseType: !39, size: 32, offset: 8608)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !443, file: !442, line: 76, baseType: !39, size: 32, offset: 8640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !443, file: !442, line: 77, baseType: !39, size: 32, offset: 8672)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !443, file: !442, line: 78, baseType: !39, size: 32, offset: 8704)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !443, file: !442, line: 79, baseType: !39, size: 32, offset: 8736)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !443, file: !442, line: 80, baseType: !39, size: 32, offset: 8768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !443, file: !442, line: 81, baseType: !39, size: 32, offset: 8800)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !443, file: !442, line: 83, baseType: !39, size: 32, offset: 8832)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !443, file: !442, line: 90, baseType: !471, size: 128, offset: 8864)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !443, file: !442, line: 84, size: 128, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !471, file: !442, line: 86, baseType: !39, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !471, file: !442, line: 87, baseType: !39, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !471, file: !442, line: 88, baseType: !39, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !471, file: !442, line: 89, baseType: !39, size: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !443, file: !442, line: 92, baseType: !39, size: 32, offset: 8992)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !443, file: !442, line: 150, baseType: !479, size: 1344, offset: 9024)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !443, file: !442, line: 93, size: 1344, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !479, file: !442, line: 95, baseType: !39, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !479, file: !442, line: 96, baseType: !39, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !479, file: !442, line: 97, baseType: !39, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !479, file: !442, line: 99, baseType: !39, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !479, file: !442, line: 100, baseType: !39, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !479, file: !442, line: 102, baseType: !39, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !479, file: !442, line: 103, baseType: !39, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !479, file: !442, line: 104, baseType: !39, size: 32, offset: 224)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !479, file: !442, line: 105, baseType: !39, size: 32, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !479, file: !442, line: 106, baseType: !39, size: 32, offset: 288)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !479, file: !442, line: 107, baseType: !39, size: 32, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !479, file: !442, line: 108, baseType: !39, size: 32, offset: 352)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !479, file: !442, line: 110, baseType: !39, size: 32, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !479, file: !442, line: 111, baseType: !39, size: 32, offset: 416)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !479, file: !442, line: 112, baseType: !39, size: 32, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !479, file: !442, line: 114, baseType: !39, size: 32, offset: 480)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !479, file: !442, line: 115, baseType: !213, size: 32, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !479, file: !442, line: 116, baseType: !213, size: 32, offset: 544)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !479, file: !442, line: 117, baseType: !39, size: 32, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !479, file: !442, line: 119, baseType: !39, size: 32, offset: 608)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !479, file: !442, line: 120, baseType: !39, size: 32, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !479, file: !442, line: 137, baseType: !503, size: 384, offset: 672)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !479, file: !442, line: 122, size: 384, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !503, file: !442, line: 124, baseType: !39, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !503, file: !442, line: 125, baseType: !39, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !503, file: !442, line: 126, baseType: !39, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !503, file: !442, line: 127, baseType: !39, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !503, file: !442, line: 128, baseType: !39, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !503, file: !442, line: 129, baseType: !39, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !503, file: !442, line: 130, baseType: !39, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !503, file: !442, line: 131, baseType: !39, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !503, file: !442, line: 133, baseType: !39, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !503, file: !442, line: 134, baseType: !39, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !503, file: !442, line: 135, baseType: !39, size: 32, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !503, file: !442, line: 136, baseType: !39, size: 32, offset: 352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !479, file: !442, line: 139, baseType: !39, size: 32, offset: 1056)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !479, file: !442, line: 140, baseType: !39, size: 32, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !479, file: !442, line: 141, baseType: !39, size: 32, offset: 1120)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !479, file: !442, line: 142, baseType: !39, size: 32, offset: 1152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !479, file: !442, line: 143, baseType: !39, size: 32, offset: 1184)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !479, file: !442, line: 144, baseType: !39, size: 32, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !479, file: !442, line: 145, baseType: !39, size: 32, offset: 1248)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !479, file: !442, line: 146, baseType: !39, size: 32, offset: 1280)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !479, file: !442, line: 147, baseType: !39, size: 32, offset: 1312)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !443, file: !442, line: 152, baseType: !39, size: 32, offset: 10368)
!527 = !{!528}
!528 = !DISubrange(count: 1)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !382, file: !383, line: 431, baseType: !530, size: 64, offset: 25600)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !382, file: !383, line: 432, baseType: !532, size: 960, offset: 25664)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 960, elements: !527)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !442, line: 186, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 156, size: 960, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !534, file: !442, line: 158, baseType: !39, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !534, file: !442, line: 159, baseType: !39, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !534, file: !442, line: 161, baseType: !39, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !534, file: !442, line: 163, baseType: !39, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !534, file: !442, line: 164, baseType: !39, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !534, file: !442, line: 166, baseType: !39, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !534, file: !442, line: 167, baseType: !39, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !534, file: !442, line: 169, baseType: !39, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !534, file: !442, line: 170, baseType: !39, size: 32, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !534, file: !442, line: 172, baseType: !39, size: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !534, file: !442, line: 173, baseType: !39, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !534, file: !442, line: 175, baseType: !39, size: 32, offset: 352)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !534, file: !442, line: 177, baseType: !39, size: 32, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !534, file: !442, line: 178, baseType: !39, size: 32, offset: 416)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !534, file: !442, line: 179, baseType: !39, size: 32, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !534, file: !442, line: 181, baseType: !39, size: 32, offset: 480)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !534, file: !442, line: 183, baseType: !39, size: 32, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !534, file: !442, line: 184, baseType: !554, size: 384, offset: 576)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 384, elements: !557)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!557 = !{!558}
!558 = !DISubrange(count: 6)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !382, file: !383, line: 433, baseType: !560, size: 64, offset: 26624)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !382, file: !383, line: 434, baseType: !39, size: 32, offset: 26688)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !382, file: !383, line: 437, baseType: !39, size: 32, offset: 26720)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !382, file: !383, line: 440, baseType: !564, size: 256, offset: 26752)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 256, elements: !257)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 512, elements: !105)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !382, file: !383, line: 441, baseType: !568, size: 128, offset: 27008)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 128, elements: !161)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 2048, elements: !112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !382, file: !383, line: 443, baseType: !564, size: 256, offset: 27136)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !382, file: !383, line: 444, baseType: !568, size: 128, offset: 27392)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !382, file: !383, line: 446, baseType: !574, size: 256, offset: 27520)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 256, elements: !257)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 256, elements: !105)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !382, file: !383, line: 447, baseType: !578, size: 128, offset: 27776)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 128, elements: !161)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1024, elements: !112)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !382, file: !383, line: 448, baseType: !574, size: 256, offset: 27904)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !382, file: !383, line: 449, baseType: !578, size: 128, offset: 28160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !382, file: !383, line: 454, baseType: !584, size: 5888, offset: 28288)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 5888, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 92)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !382, file: !383, line: 455, baseType: !588, size: 23552, offset: 34176)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 23552, elements: !589)
!589 = !{!586, !258}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !382, file: !383, line: 457, baseType: !555, size: 64, offset: 57728)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !382, file: !383, line: 460, baseType: !592, size: 53376, offset: 57856)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !383, line: 364, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 302, size: 53376, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !622, !626, !627, !628, !634, !635, !636, !637, !638, !639, !640, !641}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !593, file: !383, line: 304, baseType: !530, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !593, file: !383, line: 305, baseType: !560, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !593, file: !383, line: 307, baseType: !39, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !593, file: !383, line: 308, baseType: !39, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !593, file: !383, line: 309, baseType: !39, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !593, file: !383, line: 311, baseType: !39, size: 32, offset: 224)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !593, file: !383, line: 313, baseType: !39, size: 32, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !593, file: !383, line: 315, baseType: !39, size: 32, offset: 288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !593, file: !383, line: 316, baseType: !39, size: 32, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !593, file: !383, line: 317, baseType: !39, size: 32, offset: 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !593, file: !383, line: 319, baseType: !39, size: 32, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !593, file: !383, line: 321, baseType: !39, size: 32, offset: 416)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !593, file: !383, line: 322, baseType: !39, size: 32, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !593, file: !383, line: 324, baseType: !160, size: 64, offset: 480)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !593, file: !383, line: 325, baseType: !39, size: 32, offset: 544)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !593, file: !383, line: 327, baseType: !39, size: 32, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !593, file: !383, line: 329, baseType: !39, size: 32, offset: 608)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !593, file: !383, line: 330, baseType: !39, size: 32, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !593, file: !383, line: 331, baseType: !39, size: 32, offset: 672)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !593, file: !383, line: 333, baseType: !39, size: 32, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !593, file: !383, line: 334, baseType: !39, size: 32, offset: 736)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !593, file: !383, line: 339, baseType: !617, size: 2048, offset: 768)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 2048, elements: !323)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !593, file: !383, line: 335, size: 64, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !618, file: !383, line: 337, baseType: !39, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !618, file: !383, line: 338, baseType: !39, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !593, file: !383, line: 342, baseType: !623, size: 49152, align: 128, offset: 2816)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 49152, align: 128, elements: !624)
!624 = !{!625, !246}
!625 = !DISubrange(count: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !593, file: !383, line: 344, baseType: !39, size: 32, offset: 51968)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !593, file: !383, line: 345, baseType: !39, size: 32, offset: 52000)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !593, file: !383, line: 350, baseType: !629, size: 1024, offset: 52032)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 1024, elements: !105)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !593, file: !383, line: 346, size: 64, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !630, file: !383, line: 348, baseType: !39, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !630, file: !383, line: 349, baseType: !39, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !593, file: !383, line: 352, baseType: !39, size: 32, offset: 53056)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !593, file: !383, line: 354, baseType: !39, size: 32, offset: 53088)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !593, file: !383, line: 355, baseType: !39, size: 32, offset: 53120)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !593, file: !383, line: 356, baseType: !39, size: 32, offset: 53152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !593, file: !383, line: 357, baseType: !39, size: 32, offset: 53184)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !593, file: !383, line: 360, baseType: !39, size: 32, offset: 53216)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !593, file: !383, line: 361, baseType: !39, size: 32, offset: 53248)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !593, file: !383, line: 362, baseType: !39, size: 32, offset: 53280)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !382, file: !383, line: 463, baseType: !643, size: 4096, offset: 111232)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !644, line: 46, baseType: !645)
!644 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 27, size: 4096, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !645, file: !644, line: 30, baseType: !39, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !645, file: !644, line: 31, baseType: !39, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !645, file: !644, line: 34, baseType: !39, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !645, file: !644, line: 35, baseType: !39, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !645, file: !644, line: 37, baseType: !254, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !645, file: !644, line: 38, baseType: !254, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !645, file: !644, line: 39, baseType: !254, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !645, file: !644, line: 42, baseType: !39, size: 32, align: 128, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !645, file: !644, line: 45, baseType: !656, size: 3680, offset: 416)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 3680, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 460)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !382, file: !383, line: 494, baseType: !660, size: 2112, offset: 115328)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !383, line: 465, size: 2112, elements: !661)
!661 = !{!662, !664, !666, !667, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !680, !681, !682, !683}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !660, file: !383, line: 468, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !660, file: !383, line: 470, baseType: !665, size: 128, offset: 64)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 128, elements: !161)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !660, file: !383, line: 473, baseType: !663, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !660, file: !383, line: 476, baseType: !668, size: 1152, offset: 256)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 1152, elements: !331)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !660, file: !383, line: 478, baseType: !39, size: 32, offset: 1408)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !660, file: !383, line: 480, baseType: !39, size: 32, offset: 1440)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !660, file: !383, line: 482, baseType: !39, size: 32, offset: 1472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !660, file: !383, line: 483, baseType: !39, size: 32, offset: 1504)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !660, file: !383, line: 484, baseType: !39, size: 32, offset: 1536)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !660, file: !383, line: 485, baseType: !39, size: 32, offset: 1568)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !660, file: !383, line: 486, baseType: !39, size: 32, offset: 1600)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !660, file: !383, line: 487, baseType: !43, size: 64, offset: 1664)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !660, file: !383, line: 488, baseType: !43, size: 64, offset: 1728)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !660, file: !383, line: 489, baseType: !679, size: 128, offset: 1792)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 128, elements: !161)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !660, file: !383, line: 490, baseType: !43, size: 64, offset: 1920)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !660, file: !383, line: 491, baseType: !43, size: 64, offset: 1984)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !660, file: !383, line: 492, baseType: !39, size: 32, offset: 2048)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !660, file: !383, line: 493, baseType: !39, size: 32, offset: 2080)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !382, file: !383, line: 497, baseType: !33, size: 64, offset: 117440)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !382, file: !383, line: 500, baseType: !33, size: 64, offset: 117504)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !382, file: !383, line: 503, baseType: !39, size: 32, offset: 117568)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !382, file: !383, line: 504, baseType: !688, size: 1216, offset: 117632)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 1216, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 19)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !382, file: !383, line: 505, baseType: !39, size: 32, offset: 118848)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !382, file: !383, line: 506, baseType: !688, size: 1216, offset: 118912)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !382, file: !383, line: 507, baseType: !160, size: 64, offset: 120128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !382, file: !383, line: 510, baseType: !39, size: 32, offset: 120192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !382, file: !383, line: 511, baseType: !39, size: 32, offset: 120224)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !382, file: !383, line: 512, baseType: !43, size: 64, offset: 120256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !382, file: !383, line: 522, baseType: !698, size: 10624, offset: 120320)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !383, line: 515, size: 10624, elements: !699)
!699 = !{!700, !702, !705, !708}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !698, file: !383, line: 517, baseType: !701, size: 256, align: 128)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 256, elements: !105)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !698, file: !383, line: 518, baseType: !703, size: 128, align: 128, offset: 256)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, elements: !704)
!704 = !{!162, !258}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !698, file: !383, line: 520, baseType: !706, size: 4096, align: 128, offset: 384)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 4096, elements: !707)
!707 = !{!258, !113}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !698, file: !383, line: 521, baseType: !709, size: 6144, align: 128, offset: 4480)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 6144, elements: !710)
!710 = !{!711, !106}
!711 = !DISubrange(count: 24)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !382, file: !383, line: 732, baseType: !713, size: 82688, offset: 130944)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !383, line: 525, size: 82688, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !742, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !760, !763, !767, !768, !769, !774, !775, !778, !779, !780, !781, !782, !783, !784, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !844, !875, !876, !877, !878, !879, !880, !881, !882, !883, !886, !887, !888, !891, !894, !896, !899, !901, !902}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !713, file: !383, line: 527, baseType: !39, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !713, file: !383, line: 530, baseType: !39, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !713, file: !383, line: 531, baseType: !39, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !713, file: !383, line: 532, baseType: !39, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !713, file: !383, line: 535, baseType: !39, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !713, file: !383, line: 536, baseType: !39, size: 32, offset: 160)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !713, file: !383, line: 537, baseType: !39, size: 32, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !713, file: !383, line: 538, baseType: !39, size: 32, offset: 224)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !713, file: !383, line: 539, baseType: !39, size: 32, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !713, file: !383, line: 542, baseType: !39, size: 32, offset: 288)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !713, file: !383, line: 543, baseType: !39, size: 32, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !713, file: !383, line: 544, baseType: !39, size: 32, offset: 352)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !713, file: !383, line: 545, baseType: !39, size: 32, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !713, file: !383, line: 546, baseType: !39, size: 32, offset: 416)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !713, file: !383, line: 547, baseType: !39, size: 32, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !713, file: !383, line: 548, baseType: !39, size: 32, offset: 480)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !713, file: !383, line: 549, baseType: !39, size: 32, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !713, file: !383, line: 551, baseType: !39, size: 32, offset: 544)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !713, file: !383, line: 554, baseType: !160, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !713, file: !383, line: 555, baseType: !160, size: 64, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !713, file: !383, line: 558, baseType: !160, size: 64, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !713, file: !383, line: 559, baseType: !160, size: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !713, file: !383, line: 561, baseType: !160, size: 64, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !713, file: !383, line: 562, baseType: !160, size: 64, offset: 896)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !713, file: !383, line: 565, baseType: !5, size: 32, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !713, file: !383, line: 566, baseType: !741, size: 128, offset: 992)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !257)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !713, file: !383, line: 567, baseType: !743, size: 512, offset: 1120)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, elements: !105)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !713, file: !383, line: 568, baseType: !5, size: 32, offset: 1632)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !713, file: !383, line: 569, baseType: !5, size: 32, offset: 1664)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !713, file: !383, line: 570, baseType: !39, size: 32, offset: 1696)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !713, file: !383, line: 571, baseType: !39, size: 32, offset: 1728)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !713, file: !383, line: 572, baseType: !39, size: 32, offset: 1760)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !713, file: !383, line: 573, baseType: !39, size: 32, offset: 1792)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !713, file: !383, line: 574, baseType: !39, size: 32, offset: 1824)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !713, file: !383, line: 575, baseType: !39, size: 32, offset: 1856)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !713, file: !383, line: 576, baseType: !39, size: 32, offset: 1888)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !713, file: !383, line: 577, baseType: !39, size: 32, offset: 1920)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !713, file: !383, line: 578, baseType: !39, size: 32, offset: 1952)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !713, file: !383, line: 585, baseType: !297, size: 64, offset: 1984)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !713, file: !383, line: 586, baseType: !254, size: 64, offset: 2048)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !713, file: !383, line: 587, baseType: !297, size: 64, offset: 2112)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !713, file: !383, line: 588, baseType: !759, size: 64, offset: 2176)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !713, file: !383, line: 589, baseType: !761, size: 64, offset: 2240)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 64, elements: !274)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !713, file: !383, line: 591, baseType: !764, size: 64, offset: 2304)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 192, elements: !766)
!766 = !{!711}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !713, file: !383, line: 592, baseType: !297, size: 64, offset: 2368)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !713, file: !383, line: 593, baseType: !303, size: 128, offset: 2432)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !713, file: !383, line: 594, baseType: !770, size: 128, offset: 2560)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 128, elements: !161)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !773)
!773 = !{!275, !162}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !713, file: !383, line: 595, baseType: !319, size: 128, offset: 2688)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !713, file: !383, line: 596, baseType: !776, size: 4096, offset: 2816)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 4096, elements: !777)
!777 = !{!162, !625}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !713, file: !383, line: 597, baseType: !297, size: 64, offset: 6912)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !713, file: !383, line: 598, baseType: !297, size: 64, offset: 6976)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !713, file: !383, line: 599, baseType: !16, size: 64, offset: 7040)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !713, file: !383, line: 603, baseType: !292, size: 1024, offset: 7104)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !713, file: !383, line: 606, baseType: !39, size: 32, offset: 8128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !713, file: !383, line: 607, baseType: !39, size: 32, offset: 8160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !713, file: !383, line: 608, baseType: !785, size: 32, align: 32, offset: 8192)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 32, elements: !257)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !713, file: !383, line: 609, baseType: !39, size: 32, offset: 8224)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !713, file: !383, line: 611, baseType: !39, size: 32, offset: 8256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !713, file: !383, line: 612, baseType: !39, size: 32, offset: 8288)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !713, file: !383, line: 614, baseType: !39, size: 32, offset: 8320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !713, file: !383, line: 615, baseType: !39, size: 32, offset: 8352)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !713, file: !383, line: 621, baseType: !39, size: 32, offset: 8384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !713, file: !383, line: 624, baseType: !39, size: 32, offset: 8416)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !713, file: !383, line: 626, baseType: !39, size: 32, offset: 8448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !713, file: !383, line: 627, baseType: !39, size: 32, offset: 8480)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !713, file: !383, line: 671, baseType: !796, size: 60672, offset: 8576)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !713, file: !383, line: 629, size: 60672, elements: !797)
!797 = !{!798, !802, !806, !808, !809, !812, !816, !818, !819, !820, !821, !822, !825, !829, !832, !833, !834, !835, !836, !839, !841, !843}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !796, file: !383, line: 634, baseType: !799, size: 3072, align: 128)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 3072, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !796, file: !383, line: 635, baseType: !803, size: 6912, align: 128, offset: 3072)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 6912, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 864)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !796, file: !383, line: 638, baseType: !807, size: 2048, align: 128, offset: 9984)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 2048, elements: !460)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !796, file: !383, line: 639, baseType: !807, size: 2048, align: 128, offset: 12032)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !796, file: !383, line: 640, baseType: !810, size: 3072, align: 128, offset: 14080)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 3072, elements: !811)
!811 = !{!246, !113}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !796, file: !383, line: 641, baseType: !813, size: 3840, align: 128, offset: 17152)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 3840, elements: !814)
!814 = !{!815, !106}
!815 = !DISubrange(count: 15)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !796, file: !383, line: 642, baseType: !817, size: 128, offset: 20992)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, elements: !257)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !796, file: !383, line: 643, baseType: !817, size: 128, offset: 21120)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !796, file: !383, line: 644, baseType: !39, size: 32, offset: 21248)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !796, file: !383, line: 645, baseType: !39, size: 32, offset: 21280)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !796, file: !383, line: 648, baseType: !706, size: 4096, align: 128, offset: 21376)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !796, file: !383, line: 649, baseType: !823, size: 4096, align: 128, offset: 25472)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 4096, elements: !824)
!824 = !{!106, !106}
