; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/fx.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/fx.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._FxInfo = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }

!622 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!624 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!625 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!626 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!627 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!628 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!629 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!630 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!631 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!632 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!633 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!634 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!635 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!636 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!637 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!638 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!639 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!640 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!641 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!642 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 34, baseType: !5, size: 32, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!644 = !DIEnumerator(name: "UndefinedLayer", value: 0)
!645 = !DIEnumerator(name: "CoalesceLayer", value: 1)
!646 = !DIEnumerator(name: "CompareAnyLayer", value: 2)
!647 = !DIEnumerator(name: "CompareClearLayer", value: 3)
!648 = !DIEnumerator(name: "CompareOverlayLayer", value: 4)
!649 = !DIEnumerator(name: "DisposeLayer", value: 5)
!650 = !DIEnumerator(name: "OptimizeLayer", value: 6)
!651 = !DIEnumerator(name: "OptimizeImageLayer", value: 7)
!652 = !DIEnumerator(name: "OptimizePlusLayer", value: 8)
!653 = !DIEnumerator(name: "OptimizeTransLayer", value: 9)
!654 = !DIEnumerator(name: "RemoveDupsLayer", value: 10)
!655 = !DIEnumerator(name: "RemoveZeroLayer", value: 11)
!656 = !DIEnumerator(name: "CompositeLayer", value: 12)
!657 = !DIEnumerator(name: "MergeLayer", value: 13)
!658 = !DIEnumerator(name: "FlattenLayer", value: 14)
!659 = !DIEnumerator(name: "MosaicLayer", value: 15)
!660 = !DIEnumerator(name: "TrimBoundsLayer", value: 16)
!661 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !662, line: 25, baseType: !5, size: 32, elements: !663)
!662 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672}
!664 = !DIEnumerator(name: "UndefinedResource", value: 0)
!665 = !DIEnumerator(name: "AreaResource", value: 1)
!666 = !DIEnumerator(name: "DiskResource", value: 2)
!667 = !DIEnumerator(name: "FileResource", value: 3)
!668 = !DIEnumerator(name: "MapResource", value: 4)
!669 = !DIEnumerator(name: "MemoryResource", value: 5)
!670 = !DIEnumerator(name: "ThreadResource", value: 6)
!671 = !DIEnumerator(name: "TimeResource", value: 7)
!672 = !DIEnumerator(name: "ThrottleResource", value: 8)
!673 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 46, baseType: !5, size: 32, elements: !675)
!674 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!676 = !DIEnumerator(name: "_ISupper", value: 256)
!677 = !DIEnumerator(name: "_ISlower", value: 512)
!678 = !DIEnumerator(name: "_ISalpha", value: 1024)
!679 = !DIEnumerator(name: "_ISdigit", value: 2048)
!680 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!681 = !DIEnumerator(name: "_ISspace", value: 8192)
!682 = !DIEnumerator(name: "_ISprint", value: 16384)
!683 = !DIEnumerator(name: "_ISgraph", value: 32768)
!684 = !DIEnumerator(name: "_ISblank", value: 1)
!685 = !DIEnumerator(name: "_IScntrl", value: 2)
!686 = !DIEnumerator(name: "_ISpunct", value: 4)
!687 = !DIEnumerator(name: "_ISalnum", value: 8)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !690, file: !689, line: 1872, baseType: !5, size: 32, elements: !729)
!689 = !DIFile(filename: "apps/538.imagick_r/src/magick/fx.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4fdc0510e7b41ec3a6df889985238f22")
!690 = distinct !DISubprogram(name: "FxOperatorPrecedence", scope: !689, file: !689, line: 1869, type: !691, scopeLine: 1871, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !720)
!691 = !DISubroutineType(types: !692)
!692 = !{!693, !693, !696}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!695 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !699)
!699 = !{!700, !702, !704, !706, !707, !709, !711, !716}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !698, file: !253, line: 105, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !698, file: !253, line: 108, baseType: !703, size: 32, offset: 32)
!703 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !698, file: !253, line: 111, baseType: !705, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !698, file: !253, line: 112, baseType: !705, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !698, file: !253, line: 115, baseType: !708, size: 64, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !698, file: !253, line: 118, baseType: !710, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !698, file: !253, line: 121, baseType: !712, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !714, line: 26, baseType: !715)
!714 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !714, line: 25, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !698, file: !253, line: 124, baseType: !717, size: 64, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !718, line: 46, baseType: !719)
!718 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!719 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!720 = !{!721, !722, !723, !725, !726, !727, !728}
!721 = !DILocalVariable(name: "expression", arg: 1, scope: !690, file: !689, line: 1869, type: !693)
!722 = !DILocalVariable(name: "exception", arg: 2, scope: !690, file: !689, line: 1870, type: !696)
!723 = !DILocalVariable(name: "precedence", scope: !690, file: !689, line: 1895, type: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "FxPrecedence", scope: !690, file: !689, line: 1892, baseType: !688)
!725 = !DILocalVariable(name: "target", scope: !690, file: !689, line: 1896, type: !724)
!726 = !DILocalVariable(name: "subexpression", scope: !690, file: !689, line: 1899, type: !693)
!727 = !DILocalVariable(name: "c", scope: !690, file: !689, line: 1902, type: !703)
!728 = !DILocalVariable(name: "level", scope: !690, file: !689, line: 1905, type: !717)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!730 = !DIEnumerator(name: "UndefinedPrecedence", value: 0)
!731 = !DIEnumerator(name: "NullPrecedence", value: 1)
!732 = !DIEnumerator(name: "BitwiseComplementPrecedence", value: 2)
!733 = !DIEnumerator(name: "ExponentPrecedence", value: 3)
!734 = !DIEnumerator(name: "ExponentialNotationPrecedence", value: 4)
!735 = !DIEnumerator(name: "MultiplyPrecedence", value: 5)
!736 = !DIEnumerator(name: "AdditionPrecedence", value: 6)
!737 = !DIEnumerator(name: "ShiftPrecedence", value: 7)
!738 = !DIEnumerator(name: "RelationalPrecedence", value: 8)
!739 = !DIEnumerator(name: "EquivalencyPrecedence", value: 9)
!740 = !DIEnumerator(name: "BitwiseAndPrecedence", value: 10)
!741 = !DIEnumerator(name: "BitwiseOrPrecedence", value: 11)
!742 = !DIEnumerator(name: "LogicalAndPrecedence", value: 12)
!743 = !DIEnumerator(name: "LogicalOrPrecedence", value: 13)
!744 = !DIEnumerator(name: "TernaryPrecedence", value: 14)
!745 = !DIEnumerator(name: "AssignmentPrecedence", value: 15)
!746 = !DIEnumerator(name: "CommaPrecedence", value: 16)
!747 = !DIEnumerator(name: "SeparatorPrecedence", value: 17)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !749, line: 25, baseType: !703, size: 32, elements: !750)
!749 = !DIFile(filename: "apps/538.imagick_r/src/magick/option.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "07bebb19d66188c5f61071b3cbeac6e1")
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!751 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!752 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!753 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!754 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!755 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!756 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!757 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!758 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!759 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!760 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!761 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!762 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!763 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!764 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!765 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!766 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!767 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!768 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!769 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!770 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!771 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!772 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!773 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!774 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!775 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!776 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!777 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!778 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!779 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!780 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!781 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!782 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!783 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!784 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!785 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!786 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!787 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!788 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!789 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!790 = !DIEnumerator(name: "MagickListOptions", value: 38)
!791 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!792 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!793 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!794 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!795 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!796 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!797 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!798 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!799 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!800 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!801 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!802 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!803 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!804 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!805 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!806 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!807 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!808 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!809 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!810 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!811 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!812 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!813 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!814 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!815 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!816 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!817 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!818 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!819 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!820 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!821 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!822 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!823 = !{!824, !708, !719, !703, !1089, !1099, !695, !705, !1100, !889, !851, !856, !1101, !1102, !1103, !953, !1105, !693, !1107, !865, !1029, !1109, !959, !717, !1110, !1188, !1189, !1319, !1320, !1094, !996, !857, !1321, !1155}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "FxInfo", file: !826, line: 26, baseType: !827)
!826 = !DIFile(filename: "apps/538.imagick_r/src/magick/fx-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "240c8402db814fe0fe8232f148170b4e")
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FxInfo", file: !689, line: 110, size: 512, elements: !828)
!828 = !{!829, !1027, !1028, !1082, !1087, !1088, !1093, !1098}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !827, file: !689, line: 113, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !834)
!834 = !{!835, !837, !839, !841, !842, !844, !845, !846, !847, !848, !849, !850, !861, !862, !863, !864, !866, !880, !882, !883, !885, !886, !887, !888, !894, !895, !896, !904, !905, !906, !907, !908, !909, !911, !913, !915, !917, !919, !921, !923, !924, !925, !926, !927, !928, !929, !937, !952, !964, !965, !966, !967, !971, !975, !979, !980, !981, !982, !983, !984, !985, !987, !988, !998, !999, !1001, !1002, !1003, !1004, !1005, !1006, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1016, !1017, !1018, !1019, !1020, !1024, !1026}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !833, file: !73, line: 153, baseType: !836, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !833, file: !73, line: 156, baseType: !838, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !833, file: !73, line: 159, baseType: !840, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !833, file: !73, line: 162, baseType: !717, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !833, file: !73, line: 165, baseType: !843, size: 32, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !833, file: !73, line: 168, baseType: !710, size: 32, offset: 224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !833, file: !73, line: 169, baseType: !710, size: 32, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !833, file: !73, line: 172, baseType: !717, size: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !833, file: !73, line: 173, baseType: !717, size: 64, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !833, file: !73, line: 174, baseType: !717, size: 64, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !833, file: !73, line: 175, baseType: !717, size: 64, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !833, file: !73, line: 178, baseType: !851, size: 64, offset: 576)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !854)
!854 = !{!855, !858, !859, !860}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !853, file: !326, line: 143, baseType: !856, size: 16)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !857)
!857 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !853, file: !326, line: 144, baseType: !856, size: 16, offset: 16)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !853, file: !326, line: 145, baseType: !856, size: 16, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !853, file: !326, line: 146, baseType: !856, size: 16, offset: 48)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !833, file: !73, line: 179, baseType: !852, size: 64, offset: 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !833, file: !73, line: 180, baseType: !852, size: 64, offset: 704)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !833, file: !73, line: 181, baseType: !852, size: 64, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !833, file: !73, line: 184, baseType: !865, size: 64, offset: 832)
!865 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !833, file: !73, line: 187, baseType: !867, size: 768, offset: 896)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !869)
!869 = !{!870, !877, !878, !879}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !868, file: !73, line: 124, baseType: !871, size: 192)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !872, file: !73, line: 98, baseType: !865, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !872, file: !73, line: 99, baseType: !865, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !872, file: !73, line: 100, baseType: !865, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !868, file: !73, line: 125, baseType: !871, size: 192, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !868, file: !73, line: 126, baseType: !871, size: 192, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !868, file: !73, line: 127, baseType: !871, size: 192, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !833, file: !73, line: 190, baseType: !881, size: 32, offset: 1664)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !833, file: !73, line: 193, baseType: !708, size: 64, offset: 1728)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !833, file: !73, line: 196, baseType: !884, size: 32, offset: 1792)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !833, file: !73, line: 199, baseType: !705, size: 64, offset: 1856)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !833, file: !73, line: 200, baseType: !705, size: 64, offset: 1920)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !833, file: !73, line: 201, baseType: !705, size: 64, offset: 1984)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !833, file: !73, line: 204, baseType: !889, size: 64, offset: 2048)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !890, line: 77, baseType: !891)
!890 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !892, line: 193, baseType: !893)
!892 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!893 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !833, file: !73, line: 207, baseType: !865, size: 64, offset: 2112)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !833, file: !73, line: 208, baseType: !865, size: 64, offset: 2176)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !833, file: !73, line: 211, baseType: !897, size: 256, offset: 2240)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !899)
!899 = !{!900, !901, !902, !903}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !898, file: !153, line: 124, baseType: !717, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !898, file: !153, line: 125, baseType: !717, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !898, file: !153, line: 128, baseType: !889, size: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !898, file: !153, line: 129, baseType: !889, size: 64, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !833, file: !73, line: 212, baseType: !897, size: 256, offset: 2496)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !833, file: !73, line: 213, baseType: !897, size: 256, offset: 2752)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !833, file: !73, line: 216, baseType: !865, size: 64, offset: 3008)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !833, file: !73, line: 217, baseType: !865, size: 64, offset: 3072)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !833, file: !73, line: 218, baseType: !865, size: 64, offset: 3136)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !833, file: !73, line: 221, baseType: !910, size: 32, offset: 3200)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !833, file: !73, line: 224, baseType: !912, size: 32, offset: 3232)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !833, file: !73, line: 227, baseType: !914, size: 32, offset: 3264)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !833, file: !73, line: 230, baseType: !916, size: 32, offset: 3296)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !833, file: !73, line: 233, baseType: !918, size: 32, offset: 3328)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !833, file: !73, line: 236, baseType: !920, size: 32, offset: 3360)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !833, file: !73, line: 239, baseType: !922, size: 64, offset: 3392)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !833, file: !73, line: 242, baseType: !717, size: 64, offset: 3456)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !833, file: !73, line: 243, baseType: !717, size: 64, offset: 3520)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !833, file: !73, line: 246, baseType: !889, size: 64, offset: 3584)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !833, file: !73, line: 249, baseType: !717, size: 64, offset: 3648)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !833, file: !73, line: 250, baseType: !717, size: 64, offset: 3712)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !833, file: !73, line: 253, baseType: !889, size: 64, offset: 3776)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !833, file: !73, line: 256, baseType: !930, size: 192, offset: 3840)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !931, line: 68, baseType: !932)
!931 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !931, line: 62, size: 192, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !932, file: !931, line: 65, baseType: !865, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !932, file: !931, line: 66, baseType: !865, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !932, file: !931, line: 67, baseType: !865, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !833, file: !73, line: 259, baseType: !938, size: 512, offset: 4032)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !940)
!940 = !{!941, !948, !949, !951}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !939, file: !247, line: 43, baseType: !942, size: 192)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !944)
!944 = !{!945, !946, !947}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !943, file: !247, line: 35, baseType: !865, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !943, file: !247, line: 36, baseType: !865, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !943, file: !247, line: 37, baseType: !865, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !939, file: !247, line: 44, baseType: !942, size: 192, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !939, file: !247, line: 47, baseType: !950, size: 32, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !939, file: !247, line: 50, baseType: !717, size: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !833, file: !73, line: 262, baseType: !953, size: 64, offset: 4544)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !954, line: 26, baseType: !955)
!954 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!710, !693, !958, !961, !708}
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !960)
!960 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !963)
!963 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !833, file: !73, line: 265, baseType: !708, size: 64, offset: 4608)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !833, file: !73, line: 266, baseType: !708, size: 64, offset: 4672)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !833, file: !73, line: 267, baseType: !708, size: 64, offset: 4736)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !833, file: !73, line: 270, baseType: !968, size: 64, offset: 4800)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !970)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !833, file: !73, line: 273, baseType: !972, size: 64, offset: 4864)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !974)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !833, file: !73, line: 276, baseType: !976, size: 32768, offset: 4928)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 32768, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 4096)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !833, file: !73, line: 277, baseType: !976, size: 32768, offset: 37696)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !833, file: !73, line: 278, baseType: !976, size: 32768, offset: 70464)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !833, file: !73, line: 281, baseType: !717, size: 64, offset: 103232)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !833, file: !73, line: 282, baseType: !717, size: 64, offset: 103296)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !833, file: !73, line: 285, baseType: !697, size: 448, offset: 103360)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !833, file: !73, line: 288, baseType: !710, size: 32, offset: 103808)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !833, file: !73, line: 291, baseType: !986, size: 64, offset: 103872)
!986 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !889)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !833, file: !73, line: 294, baseType: !712, size: 64, offset: 103936)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !833, file: !73, line: 297, baseType: !989, size: 256, offset: 104000)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !991)
!991 = !{!992, !993, !994, !997}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !990, file: !89, line: 30, baseType: !705, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !990, file: !89, line: 33, baseType: !717, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !990, file: !89, line: 36, baseType: !995, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !990, file: !89, line: 39, baseType: !717, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !833, file: !73, line: 298, baseType: !989, size: 256, offset: 104256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !833, file: !73, line: 299, baseType: !1000, size: 64, offset: 104512)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !833, file: !73, line: 302, baseType: !717, size: 64, offset: 104576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !833, file: !73, line: 305, baseType: !717, size: 64, offset: 104640)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !833, file: !73, line: 308, baseType: !922, size: 64, offset: 104704)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !833, file: !73, line: 309, baseType: !922, size: 64, offset: 104768)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !833, file: !73, line: 310, baseType: !922, size: 64, offset: 104832)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !833, file: !73, line: 313, baseType: !1007, size: 32, offset: 104896)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !833, file: !73, line: 316, baseType: !710, size: 32, offset: 104928)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !833, file: !73, line: 319, baseType: !852, size: 64, offset: 104960)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !833, file: !73, line: 322, baseType: !922, size: 64, offset: 105024)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !833, file: !73, line: 325, baseType: !897, size: 256, offset: 105088)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !833, file: !73, line: 328, baseType: !708, size: 64, offset: 105344)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !833, file: !73, line: 329, baseType: !708, size: 64, offset: 105408)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !833, file: !73, line: 332, baseType: !1015, size: 32, offset: 105472)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !833, file: !73, line: 335, baseType: !710, size: 32, offset: 105504)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !833, file: !73, line: 338, baseType: !962, size: 64, offset: 105536)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !833, file: !73, line: 341, baseType: !710, size: 32, offset: 105600)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !833, file: !73, line: 344, baseType: !717, size: 64, offset: 105664)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !833, file: !73, line: 347, baseType: !1021, size: 64, offset: 105728)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1022, line: 7, baseType: !1023)
!1022 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !892, line: 160, baseType: !893)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !833, file: !73, line: 350, baseType: !1025, size: 32, offset: 105792)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !833, file: !73, line: 353, baseType: !717, size: 64, offset: 105856)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !827, file: !689, line: 116, baseType: !705, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !827, file: !689, line: 119, baseType: !1029, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1031, line: 7, baseType: !1032)
!1031 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1033, line: 49, size: 1728, elements: !1034)
!1033 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1050, !1052, !1053, !1054, !1056, !1057, !1059, !1063, !1066, !1068, !1071, !1074, !1075, !1076, !1077, !1078}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1032, file: !1033, line: 51, baseType: !703, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1032, file: !1033, line: 54, baseType: !705, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1032, file: !1033, line: 55, baseType: !705, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1032, file: !1033, line: 56, baseType: !705, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1032, file: !1033, line: 57, baseType: !705, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1032, file: !1033, line: 58, baseType: !705, size: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1032, file: !1033, line: 59, baseType: !705, size: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1032, file: !1033, line: 60, baseType: !705, size: 64, offset: 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1032, file: !1033, line: 61, baseType: !705, size: 64, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1032, file: !1033, line: 64, baseType: !705, size: 64, offset: 576)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1032, file: !1033, line: 65, baseType: !705, size: 64, offset: 640)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1032, file: !1033, line: 66, baseType: !705, size: 64, offset: 704)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1032, file: !1033, line: 68, baseType: !1048, size: 64, offset: 768)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1033, line: 36, flags: DIFlagFwdDecl)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1032, file: !1033, line: 70, baseType: !1051, size: 64, offset: 832)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1032, file: !1033, line: 72, baseType: !703, size: 32, offset: 896)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1032, file: !1033, line: 73, baseType: !703, size: 32, offset: 928)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1032, file: !1033, line: 74, baseType: !1055, size: 64, offset: 960)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !892, line: 152, baseType: !893)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1032, file: !1033, line: 77, baseType: !857, size: 16, offset: 1024)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1032, file: !1033, line: 78, baseType: !1058, size: 8, offset: 1040)
!1058 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1032, file: !1033, line: 79, baseType: !1060, size: 8, offset: 1048)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 8, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 1)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1032, file: !1033, line: 81, baseType: !1064, size: 64, offset: 1088)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1033, line: 43, baseType: null)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1032, file: !1033, line: 89, baseType: !1067, size: 64, offset: 1152)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !892, line: 153, baseType: !893)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1032, file: !1033, line: 91, baseType: !1069, size: 64, offset: 1216)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1033, line: 37, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1032, file: !1033, line: 92, baseType: !1072, size: 64, offset: 1280)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1033, line: 38, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1032, file: !1033, line: 93, baseType: !1051, size: 64, offset: 1344)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1032, file: !1033, line: 94, baseType: !708, size: 64, offset: 1408)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1032, file: !1033, line: 95, baseType: !717, size: 64, offset: 1472)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1032, file: !1033, line: 96, baseType: !703, size: 32, offset: 1536)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1032, file: !1033, line: 98, baseType: !1079, size: 160, offset: 1568)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 160, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 20)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !827, file: !689, line: 122, baseType: !1083, size: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !1085, line: 26, baseType: !1086)
!1085 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !1085, line: 25, flags: DIFlagFwdDecl)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !827, file: !689, line: 123, baseType: !1083, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !827, file: !689, line: 126, baseType: !1089, size: 64, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !622, line: 50, baseType: !1092)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "random_info", scope: !827, file: !689, line: 129, baseType: !1094, size: 64, offset: 384)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !1096, line: 31, baseType: !1097)
!1096 = !DIFile(filename: "apps/538.imagick_r/src/magick/random_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "95f31caf92e8a7cab5b1bf8cc3698f31")
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !1096, line: 30, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !827, file: !689, line: 132, baseType: !696, size: 64, offset: 448)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !856)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !1108)
!1108 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !73, line: 356, size: 134336, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1150, !1151, !1152, !1153, !1154, !1156, !1157, !1158, !1159, !1160, !1161, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1185, !1186, !1187}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1113, file: !73, line: 359, baseType: !840, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !1113, file: !73, line: 362, baseType: !843, size: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !1113, file: !73, line: 365, baseType: !710, size: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !1113, file: !73, line: 366, baseType: !710, size: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !1113, file: !73, line: 367, baseType: !710, size: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !1113, file: !73, line: 368, baseType: !710, size: 32, offset: 160)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1113, file: !73, line: 371, baseType: !705, size: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !1113, file: !73, line: 372, baseType: !705, size: 64, offset: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !1113, file: !73, line: 373, baseType: !705, size: 64, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !1113, file: !73, line: 374, baseType: !705, size: 64, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1113, file: !73, line: 377, baseType: !717, size: 64, offset: 448)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !1113, file: !73, line: 378, baseType: !717, size: 64, offset: 512)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1113, file: !73, line: 379, baseType: !717, size: 64, offset: 576)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !1113, file: !73, line: 382, baseType: !912, size: 32, offset: 640)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !1113, file: !73, line: 385, baseType: !914, size: 32, offset: 672)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1113, file: !73, line: 388, baseType: !884, size: 32, offset: 704)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1113, file: !73, line: 391, baseType: !717, size: 64, offset: 768)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !1113, file: !73, line: 394, baseType: !705, size: 64, offset: 832)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !1113, file: !73, line: 395, baseType: !705, size: 64, offset: 896)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1113, file: !73, line: 396, baseType: !705, size: 64, offset: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !1113, file: !73, line: 397, baseType: !705, size: 64, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1113, file: !73, line: 398, baseType: !705, size: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !1113, file: !73, line: 401, baseType: !865, size: 64, offset: 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1113, file: !73, line: 402, baseType: !865, size: 64, offset: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !1113, file: !73, line: 405, baseType: !852, size: 64, offset: 1280)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1113, file: !73, line: 406, baseType: !852, size: 64, offset: 1344)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !1113, file: !73, line: 407, baseType: !852, size: 64, offset: 1408)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1113, file: !73, line: 410, baseType: !710, size: 32, offset: 1472)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !1113, file: !73, line: 411, baseType: !710, size: 32, offset: 1504)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1113, file: !73, line: 414, baseType: !717, size: 64, offset: 1536)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1113, file: !73, line: 417, baseType: !838, size: 32, offset: 1600)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1113, file: !73, line: 420, baseType: !1015, size: 32, offset: 1632)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !1113, file: !73, line: 423, baseType: !1148, size: 32, offset: 1664)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !589, line: 59, baseType: !588)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1113, file: !73, line: 426, baseType: !889, size: 64, offset: 1728)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !1113, file: !73, line: 429, baseType: !710, size: 32, offset: 1792)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !1113, file: !73, line: 430, baseType: !710, size: 32, offset: 1824)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1113, file: !73, line: 433, baseType: !705, size: 64, offset: 1856)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !1113, file: !73, line: 434, baseType: !705, size: 64, offset: 1920)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !1113, file: !73, line: 437, baseType: !1155, size: 32, offset: 1984)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !379)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1113, file: !73, line: 440, baseType: !1099, size: 64, offset: 2048)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1113, file: !73, line: 443, baseType: !708, size: 64, offset: 2112)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !1113, file: !73, line: 446, baseType: !953, size: 64, offset: 2176)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1113, file: !73, line: 449, baseType: !708, size: 64, offset: 2240)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1113, file: !73, line: 450, baseType: !708, size: 64, offset: 2304)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1113, file: !73, line: 453, baseType: !1162, size: 64, offset: 2368)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1163, line: 26, baseType: !1164)
!1163 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!717, !830, !1167, !1169}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1113, file: !73, line: 456, baseType: !1029, size: 64, offset: 2432)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !1113, file: !73, line: 459, baseType: !708, size: 64, offset: 2496)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1113, file: !73, line: 462, baseType: !717, size: 64, offset: 2560)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !1113, file: !73, line: 465, baseType: !976, size: 32768, offset: 2624)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !1113, file: !73, line: 466, baseType: !976, size: 32768, offset: 35392)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !1113, file: !73, line: 467, baseType: !976, size: 32768, offset: 68160)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1113, file: !73, line: 468, baseType: !976, size: 32768, offset: 100928)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1113, file: !73, line: 471, baseType: !710, size: 32, offset: 133696)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1113, file: !73, line: 474, baseType: !705, size: 64, offset: 133760)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !1113, file: !73, line: 477, baseType: !717, size: 64, offset: 133824)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !1113, file: !73, line: 478, baseType: !717, size: 64, offset: 133888)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !1113, file: !73, line: 481, baseType: !852, size: 64, offset: 133952)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1113, file: !73, line: 484, baseType: !717, size: 64, offset: 134016)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !1113, file: !73, line: 487, baseType: !1184, size: 32, offset: 134080)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !622, line: 47, baseType: !621)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !1113, file: !73, line: 490, baseType: !852, size: 64, offset: 134112)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1113, file: !73, line: 493, baseType: !708, size: 64, offset: 134208)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !1113, file: !73, line: 496, baseType: !710, size: 32, offset: 134272)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1191)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawInfo", file: !511, line: 333, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DrawInfo", file: !511, line: 205, size: 5760, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1207, !1208, !1209, !1210, !1211, !1258, !1259, !1260, !1261, !1262, !1263, !1265, !1267, !1269, !1270, !1271, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1281, !1283, !1284, !1285, !1286, !1287, !1289, !1290, !1291, !1292, !1294, !1295, !1296, !1298, !1299, !1300, !1312, !1313, !1314, !1315, !1316, !1317}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !1192, file: !511, line: 208, baseType: !705, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !1192, file: !511, line: 209, baseType: !705, size: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "viewbox", scope: !1192, file: !511, line: 212, baseType: !897, size: 256, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "affine", scope: !1192, file: !511, line: 215, baseType: !1198, size: 384, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !153, line: 102, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !153, line: 93, size: 384, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1199, file: !153, line: 96, baseType: !865, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !1199, file: !153, line: 97, baseType: !865, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !1199, file: !153, line: 98, baseType: !865, size: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1199, file: !153, line: 99, baseType: !865, size: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !1199, file: !153, line: 100, baseType: !865, size: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !1199, file: !153, line: 101, baseType: !865, size: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1192, file: !511, line: 218, baseType: !916, size: 32, offset: 768)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1192, file: !511, line: 221, baseType: !852, size: 64, offset: 800)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !1192, file: !511, line: 222, baseType: !852, size: 64, offset: 864)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_width", scope: !1192, file: !511, line: 225, baseType: !865, size: 64, offset: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !1192, file: !511, line: 228, baseType: !1212, size: 1024, offset: 1024)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientInfo", file: !511, line: 184, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GradientInfo", file: !511, line: 153, size: 1024, elements: !1214)
!1214 = !{!1215, !1217, !1218, !1226, !1246, !1247, !1249, !1250, !1251, !1257}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1213, file: !511, line: 156, baseType: !1216, size: 32)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientType", file: !511, line: 75, baseType: !510)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bounding_box", scope: !1213, file: !511, line: 159, baseType: !897, size: 256, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_vector", scope: !1213, file: !511, line: 162, baseType: !1219, size: 256, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !73, line: 110, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !73, line: 103, size: 256, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1225}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !1220, file: !73, line: 106, baseType: !865, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !1220, file: !73, line: 107, baseType: !865, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !1220, file: !73, line: 108, baseType: !865, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !1220, file: !73, line: 109, baseType: !865, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "stops", scope: !1213, file: !511, line: 165, baseType: !1227, size: 64, offset: 576)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "StopInfo", file: !511, line: 151, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StopInfo", file: !511, line: 144, size: 512, elements: !1230)
!1230 = !{!1231, !1245}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1229, file: !511, line: 147, baseType: !1232, size: 448)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !1233, file: !326, line: 107, baseType: !836, size: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1233, file: !326, line: 110, baseType: !838, size: 32, offset: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1233, file: !326, line: 113, baseType: !710, size: 32, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1233, file: !326, line: 116, baseType: !865, size: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1233, file: !326, line: 119, baseType: !717, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1233, file: !326, line: 122, baseType: !1107, size: 32, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1233, file: !326, line: 123, baseType: !1107, size: 32, offset: 288)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1233, file: !326, line: 124, baseType: !1107, size: 32, offset: 320)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1233, file: !326, line: 125, baseType: !1107, size: 32, offset: 352)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1233, file: !326, line: 126, baseType: !1107, size: 32, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1229, file: !511, line: 150, baseType: !1107, size: 32, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "number_stops", scope: !1213, file: !511, line: 168, baseType: !717, size: 64, offset: 640)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !1213, file: !511, line: 171, baseType: !1248, size: 32, offset: 704)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpreadMethod", file: !511, line: 135, baseType: !516)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1213, file: !511, line: 174, baseType: !710, size: 32, offset: 736)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1213, file: !511, line: 177, baseType: !717, size: 64, offset: 768)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !1213, file: !511, line: 180, baseType: !1252, size: 128, offset: 832)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !511, line: 142, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !511, line: 137, size: 128, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1253, file: !511, line: 140, baseType: !865, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1253, file: !511, line: 141, baseType: !865, size: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !1213, file: !511, line: 183, baseType: !1107, size: 32, offset: 960)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "fill_pattern", scope: !1192, file: !511, line: 231, baseType: !1099, size: 64, offset: 2048)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1192, file: !511, line: 232, baseType: !1099, size: 64, offset: 2112)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_pattern", scope: !1192, file: !511, line: 233, baseType: !1099, size: 64, offset: 2176)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_antialias", scope: !1192, file: !511, line: 236, baseType: !710, size: 32, offset: 2240)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "text_antialias", scope: !1192, file: !511, line: 237, baseType: !710, size: 32, offset: 2272)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !1192, file: !511, line: 240, baseType: !1264, size: 32, offset: 2304)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "FillRule", file: !511, line: 68, baseType: !522)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "linecap", scope: !1192, file: !511, line: 243, baseType: !1266, size: 32, offset: 2336)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineCap", file: !511, line: 83, baseType: !527)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "linejoin", scope: !1192, file: !511, line: 246, baseType: !1268, size: 32, offset: 2368)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineJoin", file: !511, line: 91, baseType: !533)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "miterlimit", scope: !1192, file: !511, line: 249, baseType: !717, size: 64, offset: 2432)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !1192, file: !511, line: 252, baseType: !865, size: 64, offset: 2496)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "decorate", scope: !1192, file: !511, line: 255, baseType: !1272, size: 32, offset: 2560)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecorationType", file: !511, line: 53, baseType: !539)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !1192, file: !511, line: 258, baseType: !918, size: 32, offset: 2592)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1192, file: !511, line: 261, baseType: !705, size: 64, offset: 2624)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !1192, file: !511, line: 264, baseType: !717, size: 64, offset: 2688)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1192, file: !511, line: 267, baseType: !705, size: 64, offset: 2752)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !1192, file: !511, line: 268, baseType: !705, size: 64, offset: 2816)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1192, file: !511, line: 269, baseType: !705, size: 64, offset: 2880)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1192, file: !511, line: 272, baseType: !1280, size: 32, offset: 2944)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleType", file: !547, line: 47, baseType: !546)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !1192, file: !511, line: 275, baseType: !1282, size: 32, offset: 2976)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "StretchType", file: !547, line: 38, baseType: !554)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1192, file: !511, line: 278, baseType: !717, size: 64, offset: 3008)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1192, file: !511, line: 281, baseType: !705, size: 64, offset: 3072)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !1192, file: !511, line: 284, baseType: !865, size: 64, offset: 3136)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1192, file: !511, line: 287, baseType: !705, size: 64, offset: 3200)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1192, file: !511, line: 290, baseType: !1288, size: 32, offset: 3264)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlignType", file: !511, line: 36, baseType: !567)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "undercolor", scope: !1192, file: !511, line: 293, baseType: !852, size: 64, offset: 3296)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1192, file: !511, line: 294, baseType: !852, size: 64, offset: 3360)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !1192, file: !511, line: 297, baseType: !705, size: 64, offset: 3456)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "dash_pattern", scope: !1192, file: !511, line: 300, baseType: !1293, size: 64, offset: 3520)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !1192, file: !511, line: 303, baseType: !705, size: 64, offset: 3584)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1192, file: !511, line: 306, baseType: !1219, size: 256, offset: 3648)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "clip_units", scope: !1192, file: !511, line: 309, baseType: !1297, size: 32, offset: 3904)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClipPathUnits", file: !511, line: 44, baseType: !573)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1192, file: !511, line: 312, baseType: !856, size: 16, offset: 3936)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "render", scope: !1192, file: !511, line: 315, baseType: !710, size: 32, offset: 3968)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "element_reference", scope: !1192, file: !511, line: 318, baseType: !1301, size: 1344, offset: 4032)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementReference", file: !511, line: 203, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ElementReference", file: !511, line: 186, size: 1344, elements: !1303)
!1303 = !{!1304, !1305, !1307, !1308, !1309, !1311}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1302, file: !511, line: 189, baseType: !705, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1302, file: !511, line: 192, baseType: !1306, size: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReferenceType", file: !511, line: 127, baseType: !579)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !1302, file: !511, line: 195, baseType: !1212, size: 1024, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1302, file: !511, line: 198, baseType: !717, size: 64, offset: 1152)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1302, file: !511, line: 201, baseType: !1310, size: 64, offset: 1216)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1302, file: !511, line: 202, baseType: !1310, size: 64, offset: 1280)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1192, file: !511, line: 321, baseType: !710, size: 32, offset: 5376)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1192, file: !511, line: 324, baseType: !717, size: 64, offset: 5440)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !1192, file: !511, line: 327, baseType: !865, size: 64, offset: 5504)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "interword_spacing", scope: !1192, file: !511, line: 328, baseType: !865, size: 64, offset: 5568)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "interline_spacing", scope: !1192, file: !511, line: 329, baseType: !865, size: 64, offset: 5632)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1192, file: !511, line: 332, baseType: !1318, size: 32, offset: 5696)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectionType", file: !511, line: 60, baseType: !583)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1322 = !{i32 7, !"Dwarf Version", i32 5}
!1323 = !{i32 2, !"Debug Info Version", i32 3}
!1324 = !{i32 1, !"wchar_size", i32 4}
!1325 = !{i32 7, !"PIC Level", i32 2}
!1326 = !{i32 7, !"PIE Level", i32 2}
!1327 = !{i32 7, !"uwtable", i32 2}
!1328 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1329 = distinct !DISubprogram(name: "AcquireFxInfo", scope: !689, file: !689, line: 159, type: !1330, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1332)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!824, !830, !693}
!1332 = !{!1333, !1334, !1335, !1339, !1340, !1341, !1342, !1345, !1346, !1349}
!1333 = !DILocalVariable(name: "image", arg: 1, scope: !1329, file: !689, line: 159, type: !830)
!1334 = !DILocalVariable(name: "expression", arg: 2, scope: !1329, file: !689, line: 159, type: !693)
!1335 = !DILocalVariable(name: "fx_op", scope: !1329, file: !689, line: 162, type: !1336)
!1336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 16, elements: !1337)
!1337 = !{!1338}
!1338 = !DISubrange(count: 2)
!1339 = !DILocalVariable(name: "next", scope: !1329, file: !689, line: 165, type: !830)
!1340 = !DILocalVariable(name: "fx_info", scope: !1329, file: !689, line: 168, type: !824)
!1341 = !DILocalVariable(name: "i", scope: !1329, file: !689, line: 171, type: !889)
!1342 = !DILocalVariable(name: "message", scope: !1343, file: !689, line: 175, type: !705)
!1343 = distinct !DILexicalBlock(scope: !1344, file: !689, line: 175, column: 5)
!1344 = distinct !DILexicalBlock(scope: !1329, file: !689, line: 174, column: 7)
!1345 = !DILocalVariable(name: "exception", scope: !1343, file: !689, line: 175, type: !697)
!1346 = !DILocalVariable(name: "message", scope: !1347, file: !689, line: 186, type: !705)
!1347 = distinct !DILexicalBlock(scope: !1348, file: !689, line: 186, column: 5)
!1348 = distinct !DILexicalBlock(scope: !1329, file: !689, line: 185, column: 7)
!1349 = !DILocalVariable(name: "exception", scope: !1347, file: !689, line: 186, type: !697)
!1350 = !DILocation(line: 0, scope: !1329)
!1351 = !DILocation(line: 161, column: 3, scope: !1329)
!1352 = !DILocation(line: 162, column: 5, scope: !1329)
!1353 = !DILocation(line: 173, column: 22, scope: !1329)
!1354 = !DILocation(line: 174, column: 15, scope: !1344)
!1355 = !DILocation(line: 174, column: 7, scope: !1329)
!1356 = !DILocation(line: 175, column: 5, scope: !1343)
!1357 = !{!1358, !1358, i64 0}
!1358 = !{!"int", !1359, i64 0}
!1359 = !{!"omnipotent char", !1360, i64 0}
!1360 = !{!"Simple C/C++ TBAA"}
!1361 = !DILocation(line: 0, scope: !1343)
!1362 = !DILocation(line: 176, column: 10, scope: !1329)
!1363 = !DILocation(line: 177, column: 22, scope: !1329)
!1364 = !DILocation(line: 177, column: 12, scope: !1329)
!1365 = !DILocation(line: 177, column: 21, scope: !1329)
!1366 = !{!1367, !1368, i64 56}
!1367 = !{!"_FxInfo", !1368, i64 0, !1368, i64 8, !1368, i64 16, !1368, i64 24, !1368, i64 32, !1368, i64 40, !1368, i64 48, !1368, i64 56}
!1368 = !{!"any pointer", !1359, i64 0}
!1369 = !DILocation(line: 178, column: 18, scope: !1329)
!1370 = !{!1367, !1368, i64 0}
!1371 = !DILocation(line: 179, column: 19, scope: !1329)
!1372 = !DILocation(line: 179, column: 12, scope: !1329)
!1373 = !DILocation(line: 179, column: 18, scope: !1329)
!1374 = !{!1367, !1368, i64 24}
!1375 = !DILocation(line: 181, column: 20, scope: !1329)
!1376 = !DILocation(line: 181, column: 12, scope: !1329)
!1377 = !DILocation(line: 181, column: 19, scope: !1329)
!1378 = !{!1367, !1368, i64 32}
!1379 = !DILocation(line: 184, column: 14, scope: !1329)
!1380 = !DILocation(line: 183, column: 53, scope: !1329)
!1381 = !DILocation(line: 183, column: 32, scope: !1329)
!1382 = !DILocation(line: 183, column: 12, scope: !1329)
!1383 = !DILocation(line: 183, column: 16, scope: !1329)
!1384 = !{!1367, !1368, i64 40}
!1385 = !DILocation(line: 185, column: 21, scope: !1348)
!1386 = !DILocation(line: 185, column: 7, scope: !1329)
!1387 = !DILocation(line: 186, column: 5, scope: !1347)
!1388 = !DILocation(line: 0, scope: !1347)
!1389 = !DILocation(line: 188, column: 37, scope: !1329)
!1390 = !DILocation(line: 188, column: 8, scope: !1329)
!1391 = !DILocation(line: 189, column: 16, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1393, file: !689, line: 189, column: 3)
!1393 = distinct !DILexicalBlock(scope: !1329, file: !689, line: 189, column: 3)
!1394 = !DILocation(line: 189, column: 3, scope: !1393)
!1395 = !DILocation(line: 191, column: 60, scope: !1396)
!1396 = distinct !DILexicalBlock(scope: !1392, file: !689, line: 190, column: 3)
!1397 = !DILocation(line: 191, column: 22, scope: !1396)
!1398 = !DILocation(line: 191, column: 14, scope: !1396)
!1399 = !DILocation(line: 191, column: 5, scope: !1396)
!1400 = !DILocation(line: 191, column: 21, scope: !1396)
!1401 = !{!1368, !1368, i64 0}
!1402 = !DILocation(line: 192, column: 6, scope: !1396)
!1403 = !DILocation(line: 189, column: 46, scope: !1392)
!1404 = !{!1405, !1368, i64 13104}
!1405 = !{!"_Image", !1359, i64 0, !1359, i64 4, !1359, i64 8, !1406, i64 16, !1359, i64 24, !1359, i64 28, !1359, i64 32, !1406, i64 40, !1406, i64 48, !1406, i64 56, !1406, i64 64, !1368, i64 72, !1407, i64 80, !1407, i64 88, !1407, i64 96, !1409, i64 104, !1410, i64 112, !1359, i64 208, !1368, i64 216, !1359, i64 224, !1368, i64 232, !1368, i64 240, !1368, i64 248, !1406, i64 256, !1409, i64 264, !1409, i64 272, !1412, i64 280, !1412, i64 312, !1412, i64 344, !1409, i64 376, !1409, i64 384, !1409, i64 392, !1359, i64 400, !1359, i64 404, !1359, i64 408, !1359, i64 412, !1359, i64 416, !1359, i64 420, !1368, i64 424, !1406, i64 432, !1406, i64 440, !1406, i64 448, !1406, i64 456, !1406, i64 464, !1406, i64 472, !1413, i64 480, !1414, i64 504, !1368, i64 568, !1368, i64 576, !1368, i64 584, !1368, i64 592, !1368, i64 600, !1368, i64 608, !1359, i64 616, !1359, i64 4712, !1359, i64 8808, !1406, i64 12904, !1406, i64 12912, !1416, i64 12920, !1359, i64 12976, !1406, i64 12984, !1368, i64 12992, !1417, i64 13000, !1417, i64 13032, !1368, i64 13064, !1406, i64 13072, !1406, i64 13080, !1368, i64 13088, !1368, i64 13096, !1368, i64 13104, !1359, i64 13112, !1359, i64 13116, !1407, i64 13120, !1368, i64 13128, !1412, i64 13136, !1368, i64 13168, !1368, i64 13176, !1359, i64 13184, !1359, i64 13188, !1418, i64 13192, !1359, i64 13200, !1406, i64 13208, !1406, i64 13216, !1359, i64 13224, !1406, i64 13232}
!1406 = !{!"long", !1359, i64 0}
!1407 = !{!"_PixelPacket", !1408, i64 0, !1408, i64 2, !1408, i64 4, !1408, i64 6}
!1408 = !{!"short", !1359, i64 0}
!1409 = !{!"double", !1359, i64 0}
!1410 = !{!"_ChromaticityInfo", !1411, i64 0, !1411, i64 24, !1411, i64 48, !1411, i64 72}
!1411 = !{!"_PrimaryInfo", !1409, i64 0, !1409, i64 8, !1409, i64 16}
!1412 = !{!"_RectangleInfo", !1406, i64 0, !1406, i64 8, !1406, i64 16, !1406, i64 24}
!1413 = !{!"_ErrorInfo", !1409, i64 0, !1409, i64 8, !1409, i64 16}
!1414 = !{!"_TimerInfo", !1415, i64 0, !1415, i64 24, !1359, i64 48, !1406, i64 56}
!1415 = !{!"_Timer", !1409, i64 0, !1409, i64 8, !1409, i64 16}
!1416 = !{!"_ExceptionInfo", !1359, i64 0, !1358, i64 4, !1368, i64 8, !1368, i64 16, !1368, i64 24, !1359, i64 32, !1368, i64 40, !1406, i64 48}
!1417 = !{!"_ProfileInfo", !1368, i64 0, !1406, i64 8, !1368, i64 16, !1406, i64 24}
!1418 = !{!"long long", !1359, i64 0}
!1419 = distinct !{!1419, !1394, !1420, !1421, !1422}
!1420 = !DILocation(line: 193, column: 3, scope: !1393)
!1421 = !{!"llvm.loop.mustprogress"}
!1422 = !{!"llvm.loop.unroll.disable"}
!1423 = !DILocation(line: 194, column: 24, scope: !1329)
!1424 = !DILocation(line: 194, column: 12, scope: !1329)
!1425 = !DILocation(line: 194, column: 23, scope: !1329)
!1426 = !{!1367, !1368, i64 48}
!1427 = !DILocation(line: 195, column: 23, scope: !1329)
!1428 = !DILocation(line: 195, column: 12, scope: !1329)
!1429 = !DILocation(line: 195, column: 22, scope: !1329)
!1430 = !{!1367, !1368, i64 8}
!1431 = !DILocation(line: 196, column: 17, scope: !1329)
!1432 = !DILocation(line: 196, column: 12, scope: !1329)
!1433 = !DILocation(line: 196, column: 16, scope: !1329)
!1434 = !{!1367, !1368, i64 16}
!1435 = !DILocation(line: 197, column: 10, scope: !1329)
!1436 = !DILocation(line: 201, column: 10, scope: !1329)
!1437 = !DILocation(line: 202, column: 10, scope: !1329)
!1438 = !DILocation(line: 203, column: 10, scope: !1329)
!1439 = !DILocation(line: 204, column: 10, scope: !1329)
!1440 = !DILocation(line: 208, column: 3, scope: !1329)
!1441 = !DILocation(line: 208, column: 11, scope: !1329)
!1442 = !{!1359, !1359, i64 0}
!1443 = !DILocation(line: 209, column: 9, scope: !1329)
!1444 = !DILocation(line: 210, column: 10, scope: !1329)
!1445 = !DILocation(line: 211, column: 9, scope: !1329)
!1446 = !DILocation(line: 212, column: 10, scope: !1329)
!1447 = !DILocation(line: 213, column: 9, scope: !1329)
!1448 = !DILocation(line: 214, column: 10, scope: !1329)
!1449 = !DILocation(line: 215, column: 9, scope: !1329)
!1450 = !DILocation(line: 216, column: 10, scope: !1329)
!1451 = !DILocation(line: 217, column: 9, scope: !1329)
!1452 = !DILocation(line: 218, column: 10, scope: !1329)
!1453 = !DILocation(line: 219, column: 9, scope: !1329)
!1454 = !DILocation(line: 220, column: 10, scope: !1329)
!1455 = !DILocation(line: 221, column: 9, scope: !1329)
!1456 = !DILocation(line: 222, column: 10, scope: !1329)
!1457 = !DILocation(line: 223, column: 9, scope: !1329)
!1458 = !DILocation(line: 224, column: 10, scope: !1329)
!1459 = !DILocation(line: 225, column: 9, scope: !1329)
!1460 = !DILocation(line: 226, column: 10, scope: !1329)
!1461 = !DILocation(line: 228, column: 1, scope: !1329)
!1462 = !DILocation(line: 227, column: 3, scope: !1329)
!1463 = !DISubprogram(name: "AcquireMagickMemory", scope: !1464, file: !1464, line: 40, type: !1465, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1464 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!708, !1169}
!1467 = !{}
!1468 = !DISubprogram(name: "GetExceptionInfo", scope: !253, file: !253, line: 166, type: !1469, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{null, !696}
!1471 = !DISubprogram(name: "GetExceptionMessage", scope: !253, file: !253, line: 137, type: !1472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!705, !1474}
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!1475 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!710, !696, !693, !693, !1169, !1478, !693, !693, null}
!1478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!1479 = !DISubprogram(name: "DestroyString", scope: !1480, file: !1480, line: 46, type: !1481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1480 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!705, !705}
!1483 = !DISubprogram(name: "CatchException", scope: !253, file: !253, line: 164, type: !1469, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1484 = !DISubprogram(name: "DestroyExceptionInfo", scope: !253, file: !253, line: 148, type: !1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!696, !696}
!1487 = !DISubprogram(name: "MagickCoreTerminus", scope: !1488, file: !1488, line: 147, type: !1489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1488 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!1489 = !DISubroutineType(types: !1490)
!1490 = !{null}
!1491 = !DISubprogram(name: "ResetMagickMemory", scope: !1464, file: !1464, line: 52, type: !1492, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!708, !708, !703, !1169}
!1494 = !DISubprogram(name: "AcquireExceptionInfo", scope: !253, file: !253, line: 146, type: !1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!696}
!1497 = !DISubprogram(name: "NewSplayTree", scope: !1085, file: !1085, line: 45, type: !1498, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!1083, !1500, !1503, !1503}
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!703, !1167, !1167}
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!708, !708}
!1506 = !DISubprogram(name: "RelinquishMagickMemory", scope: !1464, file: !1464, line: 51, type: !1504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1507 = !DISubprogram(name: "RelinquishAlignedMemory", scope: !1464, file: !1464, line: 50, type: !1504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1508 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1464, file: !1464, line: 42, type: !1509, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!708, !1169, !1169}
!1511 = !DISubprogram(name: "GetImageListLength", scope: !1512, file: !1512, line: 45, type: !1513, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1512 = !DIFile(filename: "apps/538.imagick_r/src/magick/list.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53876be9fc59b89d67d5ff7fa85db93a")
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!717, !830}
!1515 = !DISubprogram(name: "GetFirstImageInList", scope: !1512, file: !1512, line: 30, type: !1516, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!1099, !830}
!1518 = !DISubprogram(name: "AcquireVirtualCacheView", scope: !622, file: !622, line: 55, type: !1519, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!1090, !830, !696}
!1521 = !DISubprogram(name: "AcquireRandomInfo", scope: !1096, file: !1096, line: 44, type: !1522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!1094}
!1524 = !DISubprogram(name: "ConstantString", scope: !1480, file: !1480, line: 45, type: !1525, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!705, !693}
!1527 = !DISubprogram(name: "SubstituteString", scope: !1480, file: !1480, line: 73, type: !1528, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!710, !1100, !693, !693}
!1530 = distinct !DISubprogram(name: "AddNoiseImage", scope: !689, file: !689, line: 262, type: !1531, scopeLine: 264, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1535)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!1099, !830, !1533, !696}
!1533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1534)
!1534 = !DIDerivedType(tag: DW_TAG_typedef, name: "NoiseType", file: !369, line: 37, baseType: !368)
!1535 = !{!1536, !1537, !1538, !1539}
!1536 = !DILocalVariable(name: "image", arg: 1, scope: !1530, file: !689, line: 262, type: !830)
!1537 = !DILocalVariable(name: "noise_type", arg: 2, scope: !1530, file: !689, line: 262, type: !1533)
!1538 = !DILocalVariable(name: "exception", arg: 3, scope: !1530, file: !689, line: 263, type: !696)
!1539 = !DILocalVariable(name: "noise_image", scope: !1530, file: !689, line: 266, type: !1099)
!1540 = !DILocation(line: 0, scope: !1530)
!1541 = !DILocation(line: 268, column: 15, scope: !1530)
!1542 = !DILocation(line: 269, column: 3, scope: !1530)
!1543 = distinct !DISubprogram(name: "AddNoiseImageChannel", scope: !689, file: !689, line: 272, type: !1544, scopeLine: 274, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1547)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!1099, !830, !1546, !1533, !696}
!1546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1155)
!1547 = !{!1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1561, !1562, !1566, !1567, !1569, !1571, !1573, !1574, !1576}
!1548 = !DILocalVariable(name: "image", arg: 1, scope: !1543, file: !689, line: 272, type: !830)
!1549 = !DILocalVariable(name: "channel", arg: 2, scope: !1543, file: !689, line: 273, type: !1546)
!1550 = !DILocalVariable(name: "noise_type", arg: 3, scope: !1543, file: !689, line: 273, type: !1533)
!1551 = !DILocalVariable(name: "exception", arg: 4, scope: !1543, file: !689, line: 273, type: !696)
!1552 = !DILocalVariable(name: "image_view", scope: !1543, file: !689, line: 278, type: !1090)
!1553 = !DILocalVariable(name: "noise_view", scope: !1543, file: !689, line: 279, type: !1090)
!1554 = !DILocalVariable(name: "option", scope: !1543, file: !689, line: 282, type: !693)
!1555 = !DILocalVariable(name: "attenuate", scope: !1543, file: !689, line: 285, type: !865)
!1556 = !DILocalVariable(name: "noise_image", scope: !1543, file: !689, line: 288, type: !1099)
!1557 = !DILocalVariable(name: "status", scope: !1543, file: !689, line: 291, type: !710)
!1558 = !DILocalVariable(name: "progress", scope: !1543, file: !689, line: 294, type: !959)
!1559 = !DILocalVariable(name: "random_info", scope: !1543, file: !689, line: 297, type: !1560)
!1560 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1320)
!1561 = !DILocalVariable(name: "y", scope: !1543, file: !689, line: 300, type: !889)
!1562 = !DILocalVariable(name: "id", scope: !1563, file: !689, line: 352, type: !1474)
!1563 = distinct !DILexicalBlock(scope: !1564, file: !689, line: 350, column: 3)
!1564 = distinct !DILexicalBlock(scope: !1565, file: !689, line: 349, column: 3)
!1565 = distinct !DILexicalBlock(scope: !1543, file: !689, line: 349, column: 3)
!1566 = !DILocalVariable(name: "sync", scope: !1563, file: !689, line: 355, type: !710)
!1567 = !DILocalVariable(name: "indexes", scope: !1563, file: !689, line: 358, type: !1568)
!1568 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1103)
!1569 = !DILocalVariable(name: "p", scope: !1563, file: !689, line: 361, type: !1570)
!1570 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1105)
!1571 = !DILocalVariable(name: "noise_indexes", scope: !1563, file: !689, line: 364, type: !1572)
!1572 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1101)
!1573 = !DILocalVariable(name: "x", scope: !1563, file: !689, line: 367, type: !889)
!1574 = !DILocalVariable(name: "q", scope: !1563, file: !689, line: 370, type: !1575)
!1575 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !851)
!1576 = !DILocalVariable(name: "proceed", scope: !1577, file: !689, line: 420, type: !710)
!1577 = distinct !DILexicalBlock(scope: !1578, file: !689, line: 418, column: 7)
!1578 = distinct !DILexicalBlock(scope: !1563, file: !689, line: 417, column: 9)
!1579 = !DILocation(line: 0, scope: !1543)
!1580 = !DILocation(line: 312, column: 14, scope: !1581)
!1581 = distinct !DILexicalBlock(scope: !1543, file: !689, line: 312, column: 7)
!1582 = !{!1405, !1359, i64 12976}
!1583 = !DILocation(line: 312, column: 20, scope: !1581)
!1584 = !DILocation(line: 312, column: 7, scope: !1543)
!1585 = !DILocation(line: 313, column: 68, scope: !1581)
!1586 = !DILocation(line: 313, column: 12, scope: !1581)
!1587 = !DILocation(line: 313, column: 5, scope: !1581)
!1588 = !DILocation(line: 317, column: 15, scope: !1543)
!1589 = !DILocation(line: 318, column: 19, scope: !1590)
!1590 = distinct !DILexicalBlock(scope: !1543, file: !689, line: 318, column: 7)
!1591 = !DILocation(line: 318, column: 7, scope: !1543)
!1592 = !DILocation(line: 321, column: 15, scope: !1543)
!1593 = !DILocation(line: 322, column: 19, scope: !1594)
!1594 = distinct !DILexicalBlock(scope: !1543, file: !689, line: 322, column: 7)
!1595 = !DILocation(line: 322, column: 7, scope: !1543)
!1596 = !DILocation(line: 324, column: 7, scope: !1597)
!1597 = distinct !DILexicalBlock(scope: !1543, file: !689, line: 324, column: 7)
!1598 = !DILocation(line: 324, column: 53, scope: !1597)
!1599 = !DILocation(line: 324, column: 7, scope: !1543)
!1600 = !DILocation(line: 326, column: 48, scope: !1601)
!1601 = distinct !DILexicalBlock(scope: !1597, file: !689, line: 325, column: 5)
!1602 = !DILocation(line: 326, column: 7, scope: !1601)
!1603 = !DILocation(line: 327, column: 19, scope: !1601)
!1604 = !DILocation(line: 328, column: 7, scope: !1601)
!1605 = !DILocation(line: 334, column: 10, scope: !1543)
!1606 = !DILocation(line: 335, column: 14, scope: !1607)
!1607 = distinct !DILexicalBlock(scope: !1543, file: !689, line: 335, column: 7)
!1608 = !DILocation(line: 335, column: 7, scope: !1543)
!1609 = !DILocalVariable(name: "string", arg: 1, scope: !1610, file: !1611, line: 42, type: !1614)
!1610 = distinct !DISubprogram(name: "StringToDouble", scope: !1611, file: !1611, line: 42, type: !1612, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1616)
