; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/geometry.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/geometry.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._GeometryInfo = type { double, double, double, double, double }
%struct._AffineMatrix = type { double, double, double, double, double, double }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }

!398 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!399 = !{!400, !401, !402}
!400 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!401 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!402 = !DIEnumerator(name: "RunningTimerState", value: 2)
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 31, baseType: !15, size: 32, elements: !405)
!404 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!406 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!407 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!408 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!409 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!410 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!411 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!412 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!413 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!414 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!415 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!416 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!417 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!418 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!419 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!420 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !243, line: 47, baseType: !15, size: 32, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!422 = !DIEnumerator(name: "UndefinedType", value: 0)
!423 = !DIEnumerator(name: "BilevelType", value: 1)
!424 = !DIEnumerator(name: "GrayscaleType", value: 2)
!425 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!426 = !DIEnumerator(name: "PaletteType", value: 4)
!427 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!428 = !DIEnumerator(name: "TrueColorType", value: 6)
!429 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!430 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!431 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!432 = !DIEnumerator(name: "OptimizeType", value: 10)
!433 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 67, baseType: !15, size: 32, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!436 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!437 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!438 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!439 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!440 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!441 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!442 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!443 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!444 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!445 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!446 = !{!6, !447, !448, !449, !450, !451, !452, !455, !454, !8, !460}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!448 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!449 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!450 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!451 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !453, line: 46, baseType: !454)
!453 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!454 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !456, line: 77, baseType: !457)
!456 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !458, line: 193, baseType: !459)
!458 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!459 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!461 = !{!0}
!462 = !{!463, !464, !465, !466, !478}
!463 = !DILocalVariable(name: "page_geometry", arg: 1, scope: !2, file: !3, line: 342, type: !8)
!464 = !DILocalVariable(name: "page", scope: !2, file: !3, line: 426, type: !6)
!465 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 429, type: !455)
!466 = !DILocalVariable(name: "geometry", scope: !467, file: !3, line: 438, type: !471)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 436, column: 7)
!468 = distinct !DILexicalBlock(scope: !469, file: !3, line: 435, column: 9)
!469 = distinct !DILexicalBlock(scope: !470, file: !3, line: 434, column: 3)
!470 = distinct !DILexicalBlock(scope: !2, file: !3, line: 434, column: 3)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !14, line: 130, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !14, line: 121, size: 256, elements: !473)
!473 = !{!474, !475, !476, !477}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !472, file: !14, line: 124, baseType: !452, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !472, file: !14, line: 125, baseType: !452, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !472, file: !14, line: 128, baseType: !455, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !472, file: !14, line: 129, baseType: !455, size: 64, offset: 192)
!478 = !DILocalVariable(name: "flags", scope: !467, file: !3, line: 441, type: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !84, line: 147, baseType: !15)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 9728, elements: !481)
!481 = !{!482, !483}
!482 = !DISubrange(count: 76)
!483 = !DISubrange(count: 2)
!484 = !{i32 7, !"Dwarf Version", i32 5}
!485 = !{i32 2, !"Debug Info Version", i32 3}
!486 = !{i32 1, !"wchar_size", i32 4}
!487 = !{i32 7, !"PIC Level", i32 2}
!488 = !{i32 7, !"PIE Level", i32 2}
!489 = !{i32 7, !"uwtable", i32 2}
!490 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!491 = distinct !DISubprogram(name: "GetGeometry", scope: !3, file: !3, line: 95, type: !492, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !496)
!492 = !DISubroutineType(types: !493)
!493 = !{!479, !8, !494, !494, !495, !495}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !507, !508, !509, !510}
!497 = !DILocalVariable(name: "geometry", arg: 1, scope: !491, file: !3, line: 95, type: !8)
!498 = !DILocalVariable(name: "x", arg: 2, scope: !491, file: !3, line: 95, type: !494)
!499 = !DILocalVariable(name: "y", arg: 3, scope: !491, file: !3, line: 96, type: !494)
!500 = !DILocalVariable(name: "width", arg: 4, scope: !491, file: !3, line: 96, type: !495)
!501 = !DILocalVariable(name: "height", arg: 5, scope: !491, file: !3, line: 96, type: !495)
!502 = !DILocalVariable(name: "p", scope: !491, file: !3, line: 99, type: !6)
!503 = !DILocalVariable(name: "pedantic_geometry", scope: !491, file: !3, line: 100, type: !504)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 4096)
!507 = !DILocalVariable(name: "q", scope: !491, file: !3, line: 101, type: !6)
!508 = !DILocalVariable(name: "value", scope: !491, file: !3, line: 104, type: !451)
!509 = !DILocalVariable(name: "c", scope: !491, file: !3, line: 107, type: !448)
!510 = !DILocalVariable(name: "flags", scope: !491, file: !3, line: 110, type: !479)
!511 = !DILocation(line: 0, scope: !491)
!512 = !DILocation(line: 98, column: 3, scope: !491)
!513 = !DILocation(line: 100, column: 5, scope: !491)
!514 = !DILocation(line: 116, column: 17, scope: !515)
!515 = distinct !DILexicalBlock(scope: !491, file: !3, line: 116, column: 7)
!516 = !DILocation(line: 116, column: 35, scope: !515)
!517 = !DILocation(line: 116, column: 39, scope: !515)
!518 = !{!519, !519, i64 0}
!519 = !{!"omnipotent char", !520, i64 0}
!520 = !{!"Simple C/C++ TBAA"}
!521 = !DILocation(line: 116, column: 49, scope: !515)
!522 = !DILocation(line: 116, column: 7, scope: !491)
!523 = !DILocation(line: 118, column: 7, scope: !524)
!524 = distinct !DILexicalBlock(scope: !491, file: !3, line: 118, column: 7)
!525 = !DILocation(line: 118, column: 24, scope: !524)
!526 = !DILocation(line: 118, column: 7, scope: !491)
!527 = !DILocation(line: 120, column: 10, scope: !491)
!528 = !DILocation(line: 121, column: 9, scope: !529)
!529 = distinct !DILexicalBlock(scope: !491, file: !3, line: 121, column: 3)
!530 = !{!531, !531, i64 0}
!531 = !{!"any pointer", !519, i64 0}
!532 = !DILocation(line: 121, column: 29, scope: !533)
!533 = distinct !DILexicalBlock(scope: !529, file: !3, line: 121, column: 3)
!534 = !DILocation(line: 121, column: 32, scope: !533)
!535 = !DILocation(line: 121, column: 3, scope: !529)
!536 = !DILocation(line: 123, column: 9, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !3, line: 123, column: 9)
!538 = distinct !DILexicalBlock(scope: !533, file: !3, line: 122, column: 3)
!539 = !{!540, !540, i64 0}
!540 = !{!"short", !519, i64 0}
!541 = !DILocation(line: 123, column: 45, scope: !537)
!542 = !DILocation(line: 123, column: 9, scope: !538)
!543 = !DILocation(line: 125, column: 36, scope: !544)
!544 = distinct !DILexicalBlock(scope: !537, file: !3, line: 124, column: 7)
!545 = !DILocation(line: 125, column: 16, scope: !544)
!546 = !DILocation(line: 121, column: 30, scope: !533)
!547 = distinct !{!547, !535, !548, !549, !550}
!548 = !DILocation(line: 204, column: 3, scope: !529)
!549 = !{!"llvm.loop.mustprogress"}
!550 = !{!"llvm.loop.unroll.disable"}
!551 = !DILocation(line: 129, column: 5, scope: !538)
!552 = !DILocation(line: 133, column: 14, scope: !553)
!553 = distinct !DILexicalBlock(scope: !554, file: !3, line: 132, column: 7)
!554 = distinct !DILexicalBlock(scope: !538, file: !3, line: 130, column: 5)
!555 = !DILocation(line: 134, column: 36, scope: !553)
!556 = !DILocation(line: 134, column: 16, scope: !553)
!557 = !DILocation(line: 135, column: 9, scope: !553)
!558 = !DILocation(line: 139, column: 14, scope: !559)
!559 = distinct !DILexicalBlock(scope: !554, file: !3, line: 138, column: 7)
!560 = !DILocation(line: 140, column: 36, scope: !559)
!561 = !DILocation(line: 140, column: 16, scope: !559)
!562 = !DILocation(line: 141, column: 9, scope: !559)
!563 = !DILocation(line: 145, column: 14, scope: !564)
!564 = distinct !DILexicalBlock(scope: !554, file: !3, line: 144, column: 7)
!565 = !DILocation(line: 146, column: 36, scope: !564)
!566 = !DILocation(line: 146, column: 16, scope: !564)
!567 = !DILocation(line: 147, column: 9, scope: !564)
!568 = !DILocation(line: 151, column: 14, scope: !569)
!569 = distinct !DILexicalBlock(scope: !554, file: !3, line: 150, column: 7)
!570 = !DILocation(line: 152, column: 36, scope: !569)
!571 = !DILocation(line: 152, column: 16, scope: !569)
!572 = !DILocation(line: 153, column: 9, scope: !569)
!573 = !DILocation(line: 157, column: 14, scope: !574)
!574 = distinct !DILexicalBlock(scope: !554, file: !3, line: 156, column: 7)
!575 = !DILocation(line: 158, column: 36, scope: !574)
!576 = !DILocation(line: 158, column: 16, scope: !574)
!577 = !DILocation(line: 159, column: 9, scope: !574)
!578 = !DILocation(line: 163, column: 14, scope: !579)
!579 = distinct !DILexicalBlock(scope: !554, file: !3, line: 162, column: 7)
!580 = !DILocation(line: 164, column: 36, scope: !579)
!581 = !DILocation(line: 164, column: 16, scope: !579)
!582 = !DILocation(line: 165, column: 9, scope: !579)
!583 = !DILocation(line: 170, column: 36, scope: !584)
!584 = distinct !DILexicalBlock(scope: !554, file: !3, line: 169, column: 7)
!585 = !DILocation(line: 170, column: 16, scope: !584)
!586 = !DILocation(line: 171, column: 9, scope: !584)
!587 = !DILocation(line: 176, column: 14, scope: !588)
!588 = distinct !DILexicalBlock(scope: !554, file: !3, line: 175, column: 7)
!589 = !DILocation(line: 177, column: 10, scope: !588)
!590 = !DILocation(line: 178, column: 9, scope: !588)
!591 = !DILocation(line: 198, column: 10, scope: !592)
!592 = distinct !DILexicalBlock(scope: !554, file: !3, line: 197, column: 7)
!593 = !DILocation(line: 199, column: 9, scope: !592)
!594 = !DILocation(line: 209, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !491, file: !3, line: 209, column: 7)
!596 = !DILocation(line: 208, column: 4, scope: !491)
!597 = !DILocation(line: 209, column: 10, scope: !595)
!598 = !DILocation(line: 209, column: 7, scope: !491)
!599 = !DILocation(line: 211, column: 4, scope: !491)
!600 = !DILocalVariable(name: "string", arg: 1, scope: !601, file: !602, line: 42, type: !605)
!601 = distinct !DISubprogram(name: "StringToDouble", scope: !602, file: !602, line: 42, type: !603, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !607)
!602 = !DIFile(filename: "apps/538.imagick_r/src/magick/string-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "af275f9a9b26a4e8bc1a481724207dee")
!603 = !DISubroutineType(types: !604)
!604 = !{!451, !605, !606}
!605 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !8)
!606 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !460)
!607 = !{!600, !608}
!608 = !DILocalVariable(name: "sentinal", arg: 2, scope: !601, file: !602, line: 43, type: !606)
!609 = !DILocation(line: 0, scope: !601, inlinedAt: !610)
!610 = distinct !DILocation(line: 212, column: 9, scope: !491)
!611 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !610)
!612 = !DILocation(line: 214, column: 22, scope: !613)
!613 = distinct !DILexicalBlock(scope: !491, file: !3, line: 214, column: 7)
!614 = !DILocation(line: 214, column: 7, scope: !613)
!615 = !DILocation(line: 214, column: 32, scope: !613)
!616 = !DILocation(line: 214, column: 7, scope: !491)
!617 = !DILocation(line: 215, column: 27, scope: !613)
!618 = !DILocation(line: 215, column: 20, scope: !613)
!619 = !DILocation(line: 215, column: 5, scope: !613)
!620 = !DILocation(line: 216, column: 9, scope: !621)
!621 = distinct !DILexicalBlock(scope: !491, file: !3, line: 216, column: 7)
!622 = !DILocation(line: 216, column: 8, scope: !621)
!623 = !DILocation(line: 216, column: 19, scope: !621)
!624 = !DILocation(line: 218, column: 33, scope: !625)
!625 = distinct !DILexicalBlock(scope: !621, file: !3, line: 217, column: 5)
!626 = !DILocation(line: 218, column: 32, scope: !625)
!627 = !DILocation(line: 219, column: 22, scope: !628)
!628 = distinct !DILexicalBlock(scope: !625, file: !3, line: 219, column: 11)
!629 = !DILocation(line: 224, column: 12, scope: !630)
!630 = distinct !DILexicalBlock(scope: !628, file: !3, line: 220, column: 9)
!631 = !DILocation(line: 225, column: 15, scope: !632)
!632 = distinct !DILexicalBlock(scope: !630, file: !3, line: 225, column: 15)
!633 = !DILocation(line: 225, column: 40, scope: !632)
!634 = !DILocation(line: 0, scope: !632)
!635 = !DILocation(line: 225, column: 15, scope: !630)
!636 = !DILocation(line: 226, column: 29, scope: !632)
!637 = !DILocation(line: 226, column: 13, scope: !632)
!638 = !DILocation(line: 0, scope: !601, inlinedAt: !639)
!639 = distinct !DILocation(line: 228, column: 35, scope: !632)
!640 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !639)
!641 = !DILocation(line: 228, column: 55, scope: !632)
!642 = !DILocation(line: 228, column: 29, scope: !632)
!643 = !DILocation(line: 228, column: 20, scope: !632)
!644 = !{!645, !645, i64 0}
!645 = !{!"long", !519, i64 0}
!646 = !DILocation(line: 229, column: 15, scope: !647)
!647 = distinct !DILexicalBlock(scope: !630, file: !3, line: 229, column: 15)
!648 = !DILocation(line: 229, column: 20, scope: !647)
!649 = !DILocation(line: 229, column: 17, scope: !647)
!650 = !DILocation(line: 229, column: 15, scope: !630)
!651 = !DILocation(line: 233, column: 8, scope: !652)
!652 = distinct !DILexicalBlock(scope: !491, file: !3, line: 233, column: 7)
!653 = !DILocation(line: 233, column: 9, scope: !652)
!654 = !DILocation(line: 233, column: 19, scope: !652)
!655 = !DILocation(line: 238, column: 12, scope: !656)
!656 = distinct !DILexicalBlock(scope: !657, file: !3, line: 237, column: 9)
!657 = distinct !DILexicalBlock(scope: !658, file: !3, line: 236, column: 11)
!658 = distinct !DILexicalBlock(scope: !652, file: !3, line: 234, column: 5)
!659 = !DILocation(line: 239, column: 16, scope: !660)
!660 = distinct !DILexicalBlock(scope: !656, file: !3, line: 239, column: 15)
!661 = !DILocation(line: 239, column: 27, scope: !660)
!662 = !DILocation(line: 244, column: 16, scope: !663)
!663 = distinct !DILexicalBlock(scope: !660, file: !3, line: 240, column: 13)
!664 = !DILocation(line: 0, scope: !601, inlinedAt: !665)
!665 = distinct !DILocation(line: 245, column: 38, scope: !663)
!666 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !665)
!667 = !DILocation(line: 245, column: 58, scope: !663)
!668 = !DILocation(line: 245, column: 32, scope: !663)
!669 = !DILocation(line: 245, column: 23, scope: !663)
!670 = !DILocation(line: 245, column: 22, scope: !663)
!671 = !DILocation(line: 246, column: 19, scope: !672)
!672 = distinct !DILexicalBlock(scope: !663, file: !3, line: 246, column: 19)
!673 = !DILocation(line: 246, column: 24, scope: !672)
!674 = !DILocation(line: 246, column: 21, scope: !672)
!675 = !DILocation(line: 246, column: 19, scope: !663)
!676 = !DILocation(line: 251, column: 8, scope: !677)
!677 = distinct !DILexicalBlock(scope: !491, file: !3, line: 251, column: 7)
!678 = !DILocation(line: 251, column: 9, scope: !677)
!679 = !DILocation(line: 251, column: 19, scope: !677)
!680 = !DILocation(line: 256, column: 7, scope: !681)
!681 = distinct !DILexicalBlock(scope: !677, file: !3, line: 252, column: 5)
!682 = !DILocation(line: 256, column: 15, scope: !681)
!683 = !DILocation(line: 256, column: 16, scope: !681)
!684 = !DILocation(line: 256, column: 26, scope: !681)
!685 = !DILocation(line: 258, column: 16, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !3, line: 258, column: 13)
!687 = distinct !DILexicalBlock(scope: !681, file: !3, line: 257, column: 7)
!688 = !DILocation(line: 258, column: 13, scope: !687)
!689 = !DILocation(line: 260, column: 10, scope: !687)
!690 = distinct !{!690, !680, !691, !549, !550}
!691 = !DILocation(line: 261, column: 7, scope: !681)
!692 = !DILocation(line: 262, column: 8, scope: !681)
!693 = !DILocation(line: 0, scope: !601, inlinedAt: !694)
!694 = distinct !DILocation(line: 263, column: 25, scope: !681)
!695 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !694)
!696 = !DILocation(line: 263, column: 45, scope: !681)
!697 = !DILocation(line: 263, column: 20, scope: !681)
!698 = !DILocation(line: 263, column: 10, scope: !681)
!699 = !DILocation(line: 263, column: 9, scope: !681)
!700 = !DILocation(line: 264, column: 11, scope: !701)
!701 = distinct !DILexicalBlock(scope: !681, file: !3, line: 264, column: 11)
!702 = !DILocation(line: 264, column: 16, scope: !701)
!703 = !DILocation(line: 264, column: 13, scope: !701)
!704 = !DILocation(line: 264, column: 11, scope: !681)
!705 = !DILocation(line: 266, column: 16, scope: !706)
!706 = distinct !DILexicalBlock(scope: !701, file: !3, line: 265, column: 9)
!707 = !DILocation(line: 267, column: 22, scope: !708)
!708 = distinct !DILexicalBlock(scope: !706, file: !3, line: 267, column: 15)
!709 = !DILocation(line: 267, column: 35, scope: !708)
!710 = !DILocation(line: 267, column: 15, scope: !706)
!711 = !DILocation(line: 268, column: 17, scope: !708)
!712 = !DILocation(line: 268, column: 15, scope: !708)
!713 = !DILocation(line: 268, column: 13, scope: !708)
!714 = !DILocation(line: 271, column: 9, scope: !715)
!715 = distinct !DILexicalBlock(scope: !491, file: !3, line: 271, column: 7)
!716 = !DILocation(line: 271, column: 8, scope: !715)
!717 = !DILocation(line: 271, column: 19, scope: !715)
!718 = !DILocation(line: 276, column: 7, scope: !719)
!719 = distinct !DILexicalBlock(scope: !715, file: !3, line: 272, column: 5)
!720 = !DILocation(line: 276, column: 15, scope: !719)
!721 = !DILocation(line: 276, column: 16, scope: !719)
!722 = !DILocation(line: 276, column: 26, scope: !719)
!723 = !DILocation(line: 278, column: 16, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !3, line: 278, column: 13)
!725 = distinct !DILexicalBlock(scope: !719, file: !3, line: 277, column: 7)
!726 = !DILocation(line: 278, column: 13, scope: !725)
!727 = !DILocation(line: 280, column: 10, scope: !725)
!728 = distinct !{!728, !718, !729, !549, !550}
!729 = !DILocation(line: 281, column: 7, scope: !719)
!730 = !DILocation(line: 282, column: 8, scope: !719)
!731 = !DILocation(line: 0, scope: !601, inlinedAt: !732)
!732 = distinct !DILocation(line: 283, column: 25, scope: !719)
!733 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !732)
!734 = !DILocation(line: 283, column: 45, scope: !719)
!735 = !DILocation(line: 283, column: 20, scope: !719)
!736 = !DILocation(line: 283, column: 10, scope: !719)
!737 = !DILocation(line: 283, column: 9, scope: !719)
!738 = !DILocation(line: 284, column: 11, scope: !739)
!739 = distinct !DILexicalBlock(scope: !719, file: !3, line: 284, column: 11)
!740 = !DILocation(line: 284, column: 16, scope: !739)
!741 = !DILocation(line: 284, column: 13, scope: !739)
!742 = !DILocation(line: 284, column: 11, scope: !719)
!743 = !DILocation(line: 286, column: 16, scope: !744)
!744 = distinct !DILexicalBlock(scope: !739, file: !3, line: 285, column: 9)
!745 = !DILocation(line: 287, column: 22, scope: !746)
!746 = distinct !DILexicalBlock(scope: !744, file: !3, line: 287, column: 15)
!747 = !DILocation(line: 287, column: 35, scope: !746)
!748 = !DILocation(line: 287, column: 15, scope: !744)
!749 = !DILocation(line: 288, column: 17, scope: !746)
!750 = !DILocation(line: 288, column: 15, scope: !746)
!751 = !DILocation(line: 288, column: 13, scope: !746)
!752 = !DILocation(line: 291, column: 14, scope: !753)
!753 = distinct !DILexicalBlock(scope: !491, file: !3, line: 291, column: 7)
!754 = !DILocation(line: 291, column: 30, scope: !753)
!755 = !DILocation(line: 291, column: 7, scope: !491)
!756 = !DILocation(line: 293, column: 43, scope: !757)
!757 = distinct !DILexicalBlock(scope: !758, file: !3, line: 293, column: 11)
!758 = distinct !DILexicalBlock(scope: !753, file: !3, line: 292, column: 5)
!759 = !DILocation(line: 295, column: 20, scope: !760)
!760 = distinct !DILexicalBlock(scope: !757, file: !3, line: 294, column: 9)
!761 = !DILocation(line: 295, column: 18, scope: !760)
!762 = !DILocation(line: 296, column: 16, scope: !760)
!763 = !DILocation(line: 297, column: 9, scope: !760)
!764 = !DILocation(line: 298, column: 43, scope: !765)
!765 = distinct !DILexicalBlock(scope: !758, file: !3, line: 298, column: 11)
!766 = !DILocation(line: 299, column: 17, scope: !765)
!767 = !DILocation(line: 299, column: 15, scope: !765)
!768 = !DILocation(line: 299, column: 9, scope: !765)
!769 = !DILocation(line: 315, column: 1, scope: !491)
!770 = !DISubprogram(name: "CopyMagickString", scope: !771, file: !771, line: 78, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !775)
!771 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!772 = !DISubroutineType(types: !773)
!773 = !{!452, !6, !8, !774}
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!775 = !{}
!776 = !DISubprogram(name: "LocaleNCompare", scope: !771, file: !771, line: 67, type: !777, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !775)
!777 = !DISubroutineType(types: !778)
!778 = !{!448, !8, !8, !774}
!779 = !DILocation(line: 0, scope: !2)
!780 = !DILocation(line: 432, column: 10, scope: !2)
!781 = !DILocation(line: 433, column: 8, scope: !2)
!782 = !DILocation(line: 434, column: 3, scope: !470)
!783 = !DILocation(line: 435, column: 45, scope: !468)
!784 = !DILocation(line: 435, column: 9, scope: !468)
!785 = !DILocation(line: 435, column: 70, scope: !468)
!786 = !DILocation(line: 435, column: 9, scope: !469)
!787 = !DILocation(line: 437, column: 9, scope: !467)
!788 = !DILocation(line: 438, column: 11, scope: !467)
!789 = !DILocation(line: 446, column: 38, scope: !467)
!790 = !DILocation(line: 446, column: 16, scope: !467)
!791 = !DILocation(line: 448, column: 11, scope: !467)
!792 = !DILocation(line: 447, column: 58, scope: !467)
!793 = !DILocation(line: 447, column: 16, scope: !467)
!794 = !DILocation(line: 449, column: 42, scope: !467)
!795 = !DILocation(line: 449, column: 54, scope: !467)
!796 = !DILocation(line: 450, column: 21, scope: !467)
!797 = !DILocation(line: 449, column: 15, scope: !467)
!798 = !DILocation(line: 0, scope: !467)
!799 = !DILocation(line: 451, column: 20, scope: !800)
!800 = distinct !DILexicalBlock(scope: !467, file: !3, line: 451, column: 13)
!801 = !DILocation(line: 451, column: 36, scope: !800)
!802 = !DILocation(line: 451, column: 13, scope: !467)
!803 = !DILocation(line: 452, column: 18, scope: !800)
!804 = !DILocation(line: 452, column: 11, scope: !800)
!805 = !DILocation(line: 454, column: 7, scope: !468)
!806 = !DILocation(line: 434, column: 46, scope: !469)
!807 = !DILocation(line: 434, column: 14, scope: !469)
!808 = !DILocation(line: 434, column: 13, scope: !469)
!809 = !DILocation(line: 434, column: 27, scope: !469)
!810 = distinct !{!810, !782, !811, !549, !550}
!811 = !DILocation(line: 454, column: 7, scope: !470)
!812 = !DILocation(line: 455, column: 3, scope: !2)
!813 = !DISubprogram(name: "LogMagickEvent", scope: !59, file: !59, line: 83, type: !814, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !775)
!814 = !DISubroutineType(types: !815)
!815 = !{!816, !817, !8, !8, !774, !8, null}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !84, line: 215, baseType: !83)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !59, line: 58, baseType: !58)
!819 = !DISubprogram(name: "AcquireString", scope: !771, file: !771, line: 43, type: !4, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !775)
!820 = !DISubprogram(name: "ConcatenateMagickString", scope: !771, file: !771, line: 76, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !775)
!821 = distinct !DISubprogram(name: "GravityAdjustGeometry", scope: !3, file: !3, line: 488, type: !822, scopeLine: 490, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !827)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !774, !774, !824, !826}
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !14, line: 91, baseType: !88)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!827 = !{!828, !829, !830, !831}
!828 = !DILocalVariable(name: "width", arg: 1, scope: !821, file: !3, line: 488, type: !774)
!829 = !DILocalVariable(name: "height", arg: 2, scope: !821, file: !3, line: 489, type: !774)
!830 = !DILocalVariable(name: "gravity", arg: 3, scope: !821, file: !3, line: 489, type: !824)
!831 = !DILocalVariable(name: "region", arg: 4, scope: !821, file: !3, line: 489, type: !826)
!832 = !DILocation(line: 0, scope: !821)
!833 = !DILocation(line: 491, column: 15, scope: !834)
!834 = distinct !DILexicalBlock(scope: !821, file: !3, line: 491, column: 7)
!835 = !{!836, !645, i64 8}
!836 = !{!"_RectangleInfo", !645, i64 0, !645, i64 8, !645, i64 16, !645, i64 24}
!837 = !DILocation(line: 491, column: 22, scope: !834)
!838 = !DILocation(line: 491, column: 7, scope: !821)
!839 = !DILocation(line: 492, column: 19, scope: !834)
!840 = !DILocation(line: 492, column: 5, scope: !834)
!841 = !DILocation(line: 493, column: 15, scope: !842)
!842 = distinct !DILexicalBlock(scope: !821, file: !3, line: 493, column: 7)
!843 = !{!836, !645, i64 0}
!844 = !DILocation(line: 493, column: 21, scope: !842)
!845 = !DILocation(line: 493, column: 7, scope: !821)
!846 = !DILocation(line: 494, column: 18, scope: !842)
!847 = !DILocation(line: 494, column: 5, scope: !842)
!848 = !DILocation(line: 495, column: 3, scope: !821)
!849 = !DILocation(line: 501, column: 56, scope: !850)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 500, column: 5)
!851 = distinct !DILexicalBlock(scope: !821, file: !3, line: 496, column: 3)
!852 = !{!836, !645, i64 16}
!853 = !DILocation(line: 501, column: 47, scope: !850)
!854 = !DILocation(line: 501, column: 16, scope: !850)
!855 = !DILocation(line: 502, column: 7, scope: !850)
!856 = !DILocation(line: 509, column: 34, scope: !857)
!857 = distinct !DILexicalBlock(scope: !851, file: !3, line: 508, column: 5)
!858 = !DILocation(line: 509, column: 50, scope: !857)
!859 = !DILocation(line: 509, column: 36, scope: !857)
!860 = !DILocation(line: 509, column: 15, scope: !857)
!861 = !DILocation(line: 509, column: 16, scope: !857)
!862 = !DILocation(line: 510, column: 7, scope: !857)
!863 = !DILocation(line: 519, column: 3, scope: !821)
!864 = !DILocation(line: 525, column: 58, scope: !865)
!865 = distinct !DILexicalBlock(scope: !866, file: !3, line: 524, column: 5)
!866 = distinct !DILexicalBlock(scope: !821, file: !3, line: 520, column: 3)
!867 = !{!836, !645, i64 24}
!868 = !DILocation(line: 525, column: 49, scope: !865)
!869 = !DILocation(line: 525, column: 16, scope: !865)
!870 = !DILocation(line: 526, column: 7, scope: !865)
!871 = !DILocation(line: 533, column: 35, scope: !872)
!872 = distinct !DILexicalBlock(scope: !866, file: !3, line: 532, column: 5)
!873 = !DILocation(line: 533, column: 52, scope: !872)
!874 = !DILocation(line: 533, column: 37, scope: !872)
!875 = !DILocation(line: 533, column: 15, scope: !872)
!876 = !DILocation(line: 533, column: 16, scope: !872)
!877 = !DILocation(line: 534, column: 7, scope: !872)
!878 = !DILocation(line: 543, column: 3, scope: !821)
!879 = distinct !DISubprogram(name: "IsGeometry", scope: !3, file: !3, line: 569, type: !880, scopeLine: 570, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !882)
!880 = !DISubroutineType(types: !881)
!881 = !{!816, !8}
!882 = !{!883, !884, !893}
!883 = !DILocalVariable(name: "geometry", arg: 1, scope: !879, file: !3, line: 569, type: !8)
!884 = !DILocalVariable(name: "geometry_info", scope: !879, file: !3, line: 572, type: !885)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryInfo", file: !14, line: 112, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GeometryInfo", file: !14, line: 104, size: 320, elements: !887)
!887 = !{!888, !889, !890, !891, !892}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !886, file: !14, line: 107, baseType: !451, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !886, file: !14, line: 108, baseType: !451, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !886, file: !14, line: 109, baseType: !451, size: 64, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !886, file: !14, line: 110, baseType: !451, size: 64, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "chi", scope: !886, file: !14, line: 111, baseType: !451, size: 64, offset: 256)
!893 = !DILocalVariable(name: "flags", scope: !879, file: !3, line: 575, type: !479)
!894 = !DILocation(line: 0, scope: !879)
!895 = !DILocation(line: 571, column: 3, scope: !879)
!896 = !DILocation(line: 572, column: 5, scope: !879)
!897 = !DILocation(line: 577, column: 16, scope: !898)
!898 = distinct !DILexicalBlock(scope: !879, file: !3, line: 577, column: 7)
!899 = !DILocation(line: 577, column: 7, scope: !879)
!900 = !DILocation(line: 579, column: 9, scope: !879)
!901 = !DILocation(line: 580, column: 16, scope: !879)
!902 = !DILocation(line: 580, column: 10, scope: !879)
!903 = !DILocation(line: 580, column: 3, scope: !879)
!904 = !DILocation(line: 581, column: 1, scope: !879)
!905 = distinct !DISubprogram(name: "ParseGeometry", scope: !3, file: !3, line: 812, type: !906, scopeLine: 814, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !909)
!906 = !DISubroutineType(types: !907)
!907 = !{!479, !8, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917}
!910 = !DILocalVariable(name: "geometry", arg: 1, scope: !905, file: !3, line: 812, type: !8)
!911 = !DILocalVariable(name: "geometry_info", arg: 2, scope: !905, file: !3, line: 813, type: !908)
!912 = !DILocalVariable(name: "p", scope: !905, file: !3, line: 816, type: !6)
!913 = !DILocalVariable(name: "pedantic_geometry", scope: !905, file: !3, line: 817, type: !504)
!914 = !DILocalVariable(name: "q", scope: !905, file: !3, line: 818, type: !6)
!915 = !DILocalVariable(name: "value", scope: !905, file: !3, line: 821, type: !451)
!916 = !DILocalVariable(name: "c", scope: !905, file: !3, line: 824, type: !448)
!917 = !DILocalVariable(name: "flags", scope: !905, file: !3, line: 827, type: !479)
!918 = !DILocation(line: 0, scope: !905)
!919 = !DILocation(line: 815, column: 3, scope: !905)
!920 = !DILocation(line: 817, column: 5, scope: !905)
!921 = !DILocation(line: 834, column: 17, scope: !922)
!922 = distinct !DILexicalBlock(scope: !905, file: !3, line: 834, column: 7)
!923 = !DILocation(line: 834, column: 35, scope: !922)
!924 = !DILocation(line: 834, column: 39, scope: !922)
!925 = !DILocation(line: 834, column: 49, scope: !922)
!926 = !DILocation(line: 834, column: 7, scope: !905)
!927 = !DILocation(line: 836, column: 7, scope: !928)
!928 = distinct !DILexicalBlock(scope: !905, file: !3, line: 836, column: 7)
!929 = !DILocation(line: 836, column: 24, scope: !928)
!930 = !DILocation(line: 836, column: 7, scope: !905)
!931 = !DILocation(line: 838, column: 10, scope: !905)
!932 = !DILocation(line: 839, column: 9, scope: !933)
!933 = distinct !DILexicalBlock(scope: !905, file: !3, line: 839, column: 3)
!934 = !DILocation(line: 839, column: 29, scope: !935)
!935 = distinct !DILexicalBlock(scope: !933, file: !3, line: 839, column: 3)
!936 = !DILocation(line: 839, column: 32, scope: !935)
!937 = !DILocation(line: 839, column: 3, scope: !933)
!938 = !DILocation(line: 841, column: 9, scope: !939)
!939 = distinct !DILexicalBlock(scope: !940, file: !3, line: 841, column: 9)
!940 = distinct !DILexicalBlock(scope: !935, file: !3, line: 840, column: 3)
!941 = !DILocation(line: 841, column: 45, scope: !939)
!942 = !DILocation(line: 841, column: 9, scope: !940)
!943 = !DILocation(line: 843, column: 36, scope: !944)
!944 = distinct !DILexicalBlock(scope: !939, file: !3, line: 842, column: 7)
!945 = !DILocation(line: 843, column: 16, scope: !944)
!946 = !DILocation(line: 839, column: 30, scope: !935)
!947 = distinct !{!947, !937, !948, !549, !550}
!948 = !DILocation(line: 929, column: 3, scope: !933)
!949 = !DILocation(line: 847, column: 5, scope: !940)
!950 = !DILocation(line: 851, column: 14, scope: !951)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 850, column: 7)
!952 = distinct !DILexicalBlock(scope: !940, file: !3, line: 848, column: 5)
!953 = !DILocation(line: 852, column: 36, scope: !951)
!954 = !DILocation(line: 852, column: 16, scope: !951)
!955 = !DILocation(line: 853, column: 9, scope: !951)
!956 = !DILocation(line: 857, column: 14, scope: !957)
!957 = distinct !DILexicalBlock(scope: !952, file: !3, line: 856, column: 7)
!958 = !DILocation(line: 858, column: 36, scope: !957)
!959 = !DILocation(line: 858, column: 16, scope: !957)
!960 = !DILocation(line: 859, column: 9, scope: !957)
!961 = !DILocation(line: 863, column: 14, scope: !962)
!962 = distinct !DILexicalBlock(scope: !952, file: !3, line: 862, column: 7)
!963 = !DILocation(line: 864, column: 36, scope: !962)
!964 = !DILocation(line: 864, column: 16, scope: !962)
!965 = !DILocation(line: 865, column: 9, scope: !962)
!966 = !DILocation(line: 869, column: 14, scope: !967)
!967 = distinct !DILexicalBlock(scope: !952, file: !3, line: 868, column: 7)
!968 = !DILocation(line: 870, column: 36, scope: !967)
!969 = !DILocation(line: 870, column: 16, scope: !967)
!970 = !DILocation(line: 871, column: 9, scope: !967)
!971 = !DILocation(line: 875, column: 14, scope: !972)
!972 = distinct !DILexicalBlock(scope: !952, file: !3, line: 874, column: 7)
!973 = !DILocation(line: 876, column: 36, scope: !972)
!974 = !DILocation(line: 876, column: 16, scope: !972)
!975 = !DILocation(line: 877, column: 9, scope: !972)
!976 = !DILocation(line: 881, column: 14, scope: !977)
!977 = distinct !DILexicalBlock(scope: !952, file: !3, line: 880, column: 7)
!978 = !DILocation(line: 882, column: 36, scope: !977)
!979 = !DILocation(line: 882, column: 16, scope: !977)
!980 = !DILocation(line: 883, column: 9, scope: !977)
!981 = !DILocation(line: 888, column: 36, scope: !982)
!982 = distinct !DILexicalBlock(scope: !952, file: !3, line: 887, column: 7)
!983 = !DILocation(line: 888, column: 16, scope: !982)
!984 = !DILocation(line: 889, column: 9, scope: !982)
!985 = !DILocation(line: 894, column: 14, scope: !986)
!986 = distinct !DILexicalBlock(scope: !952, file: !3, line: 893, column: 7)
!987 = !DILocation(line: 895, column: 10, scope: !986)
!988 = !DILocation(line: 896, column: 9, scope: !986)
!989 = !DILocation(line: 917, column: 10, scope: !990)
!990 = distinct !DILexicalBlock(scope: !952, file: !3, line: 916, column: 7)
!991 = !DILocation(line: 918, column: 9, scope: !990)
!992 = !DILocation(line: 922, column: 10, scope: !993)
!993 = distinct !DILexicalBlock(scope: !952, file: !3, line: 921, column: 7)
!994 = !DILocation(line: 923, column: 14, scope: !993)
!995 = !DILocation(line: 924, column: 9, scope: !993)
!996 = !DILocation(line: 934, column: 7, scope: !997)
!997 = distinct !DILexicalBlock(scope: !905, file: !3, line: 934, column: 7)
!998 = !DILocation(line: 933, column: 4, scope: !905)
!999 = !DILocation(line: 934, column: 10, scope: !997)
!1000 = !DILocation(line: 934, column: 7, scope: !905)
!1001 = !DILocation(line: 936, column: 4, scope: !905)
!1002 = !DILocation(line: 0, scope: !601, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 937, column: 9, scope: !905)
!1004 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1003)
!1005 = !DILocation(line: 938, column: 22, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !905, file: !3, line: 938, column: 7)
!1007 = !DILocation(line: 938, column: 7, scope: !1006)
!1008 = !DILocation(line: 938, column: 32, scope: !1006)
!1009 = !DILocation(line: 938, column: 7, scope: !905)
!1010 = !DILocation(line: 939, column: 27, scope: !1006)
!1011 = !DILocation(line: 939, column: 20, scope: !1006)
!1012 = !DILocation(line: 939, column: 5, scope: !1006)
!1013 = !DILocation(line: 940, column: 29, scope: !905)
!1014 = !DILocation(line: 940, column: 28, scope: !905)
!1015 = !DILocation(line: 941, column: 18, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !905, file: !3, line: 941, column: 7)
!1017 = !DILocation(line: 958, column: 5, scope: !905)
!1018 = !DILocation(line: 947, column: 9, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 943, column: 5)
!1020 = !DILocation(line: 947, column: 8, scope: !1019)
!1021 = !DILocation(line: 948, column: 11, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 948, column: 11)
!1023 = !DILocation(line: 948, column: 36, scope: !1022)
!1024 = !DILocation(line: 0, scope: !1022)
!1025 = !DILocation(line: 948, column: 11, scope: !1019)
!1026 = !DILocation(line: 949, column: 24, scope: !1022)
!1027 = !DILocation(line: 949, column: 15, scope: !1022)
!1028 = !DILocation(line: 949, column: 9, scope: !1022)
!1029 = !DILocation(line: 0, scope: !601, inlinedAt: !1030)
!1030 = distinct !DILocation(line: 951, column: 15, scope: !1022)
!1031 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1030)
!1032 = !DILocation(line: 952, column: 11, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 952, column: 11)
!1034 = !DILocation(line: 952, column: 16, scope: !1033)
!1035 = !DILocation(line: 952, column: 13, scope: !1033)
!1036 = !DILocation(line: 952, column: 11, scope: !1019)
!1037 = !DILocation(line: 954, column: 16, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 953, column: 9)
!1039 = !DILocation(line: 955, column: 29, scope: !1038)
!1040 = !{!1041, !1042, i64 0}
!1041 = !{!"_GeometryInfo", !1042, i64 0, !1042, i64 8, !1042, i64 16, !1042, i64 24, !1042, i64 32}
!1042 = !{!"double", !519, i64 0}
!1043 = !DILocation(line: 956, column: 9, scope: !1038)
!1044 = !DILocation(line: 958, column: 4, scope: !905)
!1045 = !DILocation(line: 959, column: 28, scope: !905)
!1046 = !DILocation(line: 960, column: 18, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !905, file: !3, line: 960, column: 7)
!1048 = !DILocation(line: 967, column: 7, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 962, column: 5)
!1050 = !DILocation(line: 0, scope: !1049)
!1051 = !DILocation(line: 967, column: 14, scope: !1049)
!1052 = !DILocation(line: 967, column: 50, scope: !1049)
!1053 = distinct !{!1053, !1048, !1054, !549, !550}
!1054 = !DILocation(line: 968, column: 10, scope: !1049)
!1055 = !DILocation(line: 969, column: 32, scope: !1049)
!1056 = !DILocation(line: 970, column: 23, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 970, column: 11)
!1058 = !DILocation(line: 970, column: 70, scope: !1057)
!1059 = !DILocation(line: 973, column: 12, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 972, column: 9)
!1061 = !DILocation(line: 0, scope: !601, inlinedAt: !1062)
!1062 = distinct !DILocation(line: 974, column: 17, scope: !1060)
!1063 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1062)
!1064 = !DILocation(line: 975, column: 15, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 975, column: 15)
!1066 = !DILocation(line: 975, column: 20, scope: !1065)
!1067 = !DILocation(line: 975, column: 17, scope: !1065)
!1068 = !DILocation(line: 975, column: 15, scope: !1060)
!1069 = !DILocation(line: 977, column: 20, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 976, column: 13)
!1071 = !DILocation(line: 978, column: 30, scope: !1070)
!1072 = !DILocation(line: 978, column: 35, scope: !1070)
!1073 = !{!1041, !1042, i64 8}
!1074 = !DILocation(line: 979, column: 13, scope: !1070)
!1075 = !DILocation(line: 982, column: 10, scope: !905)
!1076 = !DILocation(line: 982, column: 46, scope: !905)
!1077 = !DILocation(line: 982, column: 3, scope: !905)
!1078 = !DILocation(line: 983, column: 6, scope: !905)
!1079 = distinct !{!1079, !1077, !1078, !549, !550}
!1080 = !DILocation(line: 984, column: 19, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !905, file: !3, line: 984, column: 7)
!1082 = !DILocation(line: 990, column: 10, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 989, column: 11)
!1084 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 985, column: 5)
!1085 = !DILocation(line: 990, column: 9, scope: !1083)
!1086 = !DILocation(line: 991, column: 7, scope: !1084)
!1087 = !DILocation(line: 991, column: 16, scope: !1084)
!1088 = !DILocation(line: 991, column: 15, scope: !1084)
!1089 = !DILocation(line: 991, column: 26, scope: !1084)
!1090 = !DILocation(line: 993, column: 18, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 993, column: 15)
!1092 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 992, column: 9)
!1093 = !DILocation(line: 993, column: 15, scope: !1092)
!1094 = !DILocation(line: 995, column: 12, scope: !1092)
!1095 = distinct !{!1095, !1086, !1096, !549, !550}
!1096 = !DILocation(line: 996, column: 9, scope: !1084)
!1097 = !DILocation(line: 997, column: 8, scope: !1084)
!1098 = !DILocation(line: 0, scope: !601, inlinedAt: !1099)
!1099 = distinct !DILocation(line: 998, column: 13, scope: !1084)
!1100 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1099)
!1101 = !DILocation(line: 999, column: 11, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 999, column: 11)
!1103 = !DILocation(line: 999, column: 16, scope: !1102)
!1104 = !DILocation(line: 999, column: 13, scope: !1102)
!1105 = !DILocation(line: 999, column: 11, scope: !1084)
!1106 = !DILocation(line: 1001, column: 16, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 1000, column: 9)
!1108 = !DILocation(line: 1002, column: 21, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 1002, column: 15)
!1110 = !DILocation(line: 1002, column: 34, scope: !1109)
!1111 = !DILocation(line: 1002, column: 15, scope: !1107)
!1112 = !DILocation(line: 1004, column: 26, scope: !1107)
!1113 = !DILocation(line: 1004, column: 28, scope: !1107)
!1114 = !{!1041, !1042, i64 16}
!1115 = !DILocation(line: 1005, column: 9, scope: !1107)
!1116 = !DILocation(line: 1006, column: 14, scope: !1084)
!1117 = !DILocation(line: 1006, column: 50, scope: !1084)
!1118 = !DILocation(line: 1006, column: 7, scope: !1084)
!1119 = !DILocation(line: 1007, column: 10, scope: !1084)
!1120 = distinct !{!1120, !1118, !1119, !549, !550}
!1121 = !DILocation(line: 1008, column: 23, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 1008, column: 11)
!1123 = !DILocation(line: 1015, column: 14, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 1014, column: 15)
!1125 = distinct !DILexicalBlock(scope: !1122, file: !3, line: 1010, column: 9)
!1126 = !DILocation(line: 1015, column: 13, scope: !1124)
!1127 = !DILocation(line: 1016, column: 11, scope: !1125)
!1128 = !DILocation(line: 1016, column: 20, scope: !1125)
!1129 = !DILocation(line: 0, scope: !1084)
!1130 = !DILocation(line: 1016, column: 19, scope: !1125)
!1131 = !DILocation(line: 1016, column: 30, scope: !1125)
!1132 = !DILocation(line: 1018, column: 20, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 1018, column: 17)
!1134 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 1017, column: 11)
!1135 = !DILocation(line: 1018, column: 17, scope: !1134)
!1136 = !DILocation(line: 1020, column: 14, scope: !1134)
!1137 = distinct !{!1137, !1127, !1138, !549, !550}
!1138 = !DILocation(line: 1021, column: 11, scope: !1125)
!1139 = !DILocation(line: 1022, column: 12, scope: !1125)
!1140 = !DILocation(line: 0, scope: !601, inlinedAt: !1141)
!1141 = distinct !DILocation(line: 1023, column: 17, scope: !1125)
!1142 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1141)
!1143 = !DILocation(line: 1024, column: 15, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 1024, column: 15)
!1145 = !DILocation(line: 1024, column: 20, scope: !1144)
!1146 = !DILocation(line: 1024, column: 17, scope: !1144)
!1147 = !DILocation(line: 1024, column: 15, scope: !1125)
!1148 = !DILocation(line: 1026, column: 20, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 1025, column: 13)
!1150 = !DILocation(line: 1027, column: 25, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 1027, column: 19)
!1152 = !DILocation(line: 1027, column: 39, scope: !1151)
!1153 = !DILocation(line: 1027, column: 19, scope: !1149)
!1154 = !DILocation(line: 1029, column: 30, scope: !1149)
!1155 = !DILocation(line: 1029, column: 33, scope: !1149)
!1156 = !{!1041, !1042, i64 24}
!1157 = !DILocation(line: 1030, column: 13, scope: !1149)
!1158 = !DILocation(line: 1032, column: 14, scope: !1084)
!1159 = !DILocation(line: 1032, column: 50, scope: !1084)
!1160 = !DILocation(line: 1032, column: 7, scope: !1084)
!1161 = !DILocation(line: 1033, column: 10, scope: !1084)
!1162 = distinct !{!1162, !1160, !1161, !549, !550}
!1163 = !DILocation(line: 1034, column: 23, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 1034, column: 11)
!1165 = !DILocation(line: 1041, column: 14, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 1040, column: 15)
!1167 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 1036, column: 9)
!1168 = !DILocation(line: 1041, column: 13, scope: !1166)
!1169 = !DILocation(line: 1042, column: 11, scope: !1167)
!1170 = !DILocation(line: 1042, column: 20, scope: !1167)
!1171 = !DILocation(line: 1042, column: 19, scope: !1167)
!1172 = !DILocation(line: 1042, column: 30, scope: !1167)
!1173 = !DILocation(line: 1044, column: 20, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1044, column: 17)
!1175 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 1043, column: 11)
!1176 = !DILocation(line: 1044, column: 17, scope: !1175)
!1177 = !DILocation(line: 1046, column: 14, scope: !1175)
!1178 = distinct !{!1178, !1169, !1179, !549, !550}
!1179 = !DILocation(line: 1047, column: 11, scope: !1167)
!1180 = !DILocation(line: 1048, column: 12, scope: !1167)
!1181 = !DILocation(line: 0, scope: !601, inlinedAt: !1182)
!1182 = distinct !DILocation(line: 1049, column: 17, scope: !1167)
!1183 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1182)
!1184 = !DILocation(line: 1050, column: 15, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 1050, column: 15)
!1186 = !DILocation(line: 1050, column: 20, scope: !1185)
!1187 = !DILocation(line: 1050, column: 17, scope: !1185)
!1188 = !DILocation(line: 1050, column: 15, scope: !1167)
!1189 = !DILocation(line: 1052, column: 20, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 1051, column: 13)
!1191 = !DILocation(line: 1053, column: 25, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 1053, column: 19)
!1193 = !DILocation(line: 1053, column: 39, scope: !1192)
!1194 = !DILocation(line: 1053, column: 19, scope: !1190)
!1195 = !DILocation(line: 1055, column: 30, scope: !1190)
!1196 = !DILocation(line: 1055, column: 33, scope: !1190)
!1197 = !{!1041, !1042, i64 32}
!1198 = !DILocation(line: 1056, column: 13, scope: !1190)
!1199 = !DILocation(line: 1059, column: 7, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !905, file: !3, line: 1059, column: 7)
!1201 = !DILocation(line: 1059, column: 37, scope: !1200)
!1202 = !DILocation(line: 1059, column: 7, scope: !905)
!1203 = !DILocation(line: 1064, column: 42, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1200, file: !3, line: 1060, column: 5)
!1205 = !DILocation(line: 1064, column: 25, scope: !1204)
!1206 = !DILocation(line: 1065, column: 27, scope: !1204)
!1207 = !DILocation(line: 1066, column: 26, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1204, file: !3, line: 1066, column: 11)
!1209 = !DILocation(line: 1066, column: 29, scope: !1208)
!1210 = !DILocation(line: 1066, column: 11, scope: !1204)
!1211 = !DILocation(line: 1067, column: 29, scope: !1208)
!1212 = !DILocation(line: 1067, column: 9, scope: !1208)
!1213 = !DILocation(line: 1069, column: 35, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !905, file: !3, line: 1069, column: 7)
!1215 = !DILocation(line: 1075, column: 43, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1214, file: !3, line: 1071, column: 5)
!1217 = !DILocation(line: 1075, column: 22, scope: !1216)
!1218 = !DILocation(line: 1075, column: 27, scope: !1216)
!1219 = !DILocation(line: 1076, column: 24, scope: !1216)
!1220 = !DILocation(line: 1078, column: 12, scope: !1216)
!1221 = !DILocation(line: 1079, column: 5, scope: !1216)
!1222 = !DILocation(line: 1080, column: 14, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !905, file: !3, line: 1080, column: 7)
!1224 = !DILocation(line: 1080, column: 30, scope: !1223)
!1225 = !DILocation(line: 1080, column: 7, scope: !905)
!1226 = !DILocation(line: 1082, column: 43, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1228, file: !3, line: 1082, column: 11)
!1228 = distinct !DILexicalBlock(scope: !1223, file: !3, line: 1081, column: 5)
!1229 = !DILocation(line: 1083, column: 45, scope: !1227)
!1230 = !DILocation(line: 1083, column: 24, scope: !1227)
!1231 = !DILocation(line: 1083, column: 29, scope: !1227)
!1232 = !DILocation(line: 1084, column: 43, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1228, file: !3, line: 1084, column: 11)
!1234 = !DILocation(line: 1085, column: 43, scope: !1233)
!1235 = !DILocation(line: 1085, column: 27, scope: !1233)
!1236 = !DILocation(line: 1085, column: 9, scope: !1233)
!1237 = !DILocation(line: 1100, column: 1, scope: !905)
!1238 = distinct !DISubprogram(name: "IsSceneGeometry", scope: !3, file: !3, line: 610, type: !1239, scopeLine: 612, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1242)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!816, !8, !1241}
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !816)
!1242 = !{!1243, !1244, !1245, !1246}
!1243 = !DILocalVariable(name: "geometry", arg: 1, scope: !1238, file: !3, line: 610, type: !8)
!1244 = !DILocalVariable(name: "pedantic", arg: 2, scope: !1238, file: !3, line: 611, type: !1241)
!1245 = !DILocalVariable(name: "p", scope: !1238, file: !3, line: 614, type: !6)
!1246 = !DILocalVariable(name: "value", scope: !1238, file: !3, line: 617, type: !451)
!1247 = !DILocation(line: 0, scope: !1238)
!1248 = !DILocation(line: 613, column: 3, scope: !1238)
!1249 = !DILocation(line: 619, column: 16, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 619, column: 7)
!1251 = !DILocation(line: 619, column: 7, scope: !1238)
!1252 = !DILocation(line: 621, column: 4, scope: !1238)
!1253 = !DILocation(line: 0, scope: !601, inlinedAt: !1254)
!1254 = distinct !DILocation(line: 622, column: 9, scope: !1238)
!1255 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1254)
!1256 = !DILocation(line: 624, column: 7, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 624, column: 7)
!1258 = !DILocation(line: 624, column: 9, scope: !1257)
!1259 = !DILocation(line: 624, column: 7, scope: !1238)
!1260 = !DILocation(line: 626, column: 7, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 626, column: 7)
!1262 = !DILocation(line: 626, column: 43, scope: !1261)
!1263 = !DILocation(line: 626, column: 40, scope: !1261)
!1264 = !DILocation(line: 626, column: 7, scope: !1238)
!1265 = !DILocation(line: 628, column: 17, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 628, column: 7)
!1267 = !DILocation(line: 628, column: 33, scope: !1266)
!1268 = !DILocation(line: 628, column: 37, scope: !1266)
!1269 = !DILocation(line: 628, column: 58, scope: !1266)
!1270 = !DILocation(line: 628, column: 7, scope: !1238)
!1271 = !DILocation(line: 630, column: 3, scope: !1238)
!1272 = !DILocation(line: 631, column: 1, scope: !1238)
!1273 = distinct !DISubprogram(name: "ParseAbsoluteGeometry", scope: !3, file: !3, line: 662, type: !1274, scopeLine: 664, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1276)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!479, !8, !826}
!1276 = !{!1277, !1278, !1279}
!1277 = !DILocalVariable(name: "geometry", arg: 1, scope: !1273, file: !3, line: 662, type: !8)
!1278 = !DILocalVariable(name: "region_info", arg: 2, scope: !1273, file: !3, line: 663, type: !826)
!1279 = !DILocalVariable(name: "flags", scope: !1273, file: !3, line: 666, type: !479)
!1280 = !DILocation(line: 0, scope: !1273)
!1281 = !DILocation(line: 668, column: 44, scope: !1273)
!1282 = !DILocation(line: 668, column: 60, scope: !1273)
!1283 = !DILocation(line: 669, column: 39, scope: !1273)
!1284 = !DILocation(line: 668, column: 9, scope: !1273)
!1285 = !DILocation(line: 670, column: 3, scope: !1273)
!1286 = distinct !DISubprogram(name: "ParseAffineGeometry", scope: !3, file: !3, line: 703, type: !1287, scopeLine: 705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1316)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!479, !8, !1289, !1299}
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !14, line: 102, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !14, line: 93, size: 384, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1298}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1291, file: !14, line: 96, baseType: !451, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !1291, file: !14, line: 97, baseType: !451, size: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !1291, file: !14, line: 98, baseType: !451, size: 64, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1291, file: !14, line: 99, baseType: !451, size: 64, offset: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !1291, file: !14, line: 100, baseType: !451, size: 64, offset: 256)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !1291, file: !14, line: 101, baseType: !451, size: 64, offset: 320)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !84, line: 219, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !103, line: 102, size: 448, elements: !1302)
!1302 = !{!1303, !1305, !1306, !1307, !1308, !1309, !1310, !1315}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !1301, file: !103, line: 105, baseType: !1304, size: 32)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !103, line: 100, baseType: !102)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !1301, file: !103, line: 108, baseType: !448, size: 32, offset: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !1301, file: !103, line: 111, baseType: !6, size: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1301, file: !103, line: 112, baseType: !6, size: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !1301, file: !103, line: 115, baseType: !447, size: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !1301, file: !103, line: 118, baseType: !816, size: 32, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1301, file: !103, line: 121, baseType: !1311, size: 64, offset: 320)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !1313, line: 26, baseType: !1314)
!1313 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!1314 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !1313, line: 25, flags: DIFlagFwdDecl)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1301, file: !103, line: 124, baseType: !452, size: 64, offset: 384)
!1316 = !{!1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324}
!1317 = !DILocalVariable(name: "geometry", arg: 1, scope: !1286, file: !3, line: 703, type: !8)
!1318 = !DILocalVariable(name: "affine_matrix", arg: 2, scope: !1286, file: !3, line: 704, type: !1289)
!1319 = !DILocalVariable(name: "exception", arg: 3, scope: !1286, file: !3, line: 704, type: !1299)
!1320 = !DILocalVariable(name: "token", scope: !1286, file: !3, line: 707, type: !504)
!1321 = !DILocalVariable(name: "p", scope: !1286, file: !3, line: 710, type: !8)
!1322 = !DILocalVariable(name: "determinant", scope: !1286, file: !3, line: 713, type: !451)
!1323 = !DILocalVariable(name: "flags", scope: !1286, file: !3, line: 716, type: !479)
!1324 = !DILocalVariable(name: "i", scope: !1286, file: !3, line: 719, type: !455)
!1325 = !DILocation(line: 0, scope: !1286)
!1326 = !DILocation(line: 706, column: 3, scope: !1286)
!1327 = !DILocation(line: 707, column: 5, scope: !1286)
!1328 = !DILocation(line: 709, column: 3, scope: !1286)
!1329 = !DILocation(line: 721, column: 3, scope: !1286)
!1330 = !DILocation(line: 723, column: 4, scope: !1286)
!1331 = !DILocation(line: 724, column: 14, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1333, file: !3, line: 724, column: 3)
!1333 = distinct !DILexicalBlock(scope: !1286, file: !3, line: 724, column: 3)
!1334 = !DILocation(line: 724, column: 17, scope: !1332)
!1335 = !DILocation(line: 724, column: 26, scope: !1332)
!1336 = !DILocation(line: 726, column: 5, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1332, file: !3, line: 725, column: 3)
!1338 = !DILocation(line: 727, column: 9, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !1337, file: !3, line: 727, column: 9)
!1340 = !DILocation(line: 727, column: 16, scope: !1339)
!1341 = !DILocation(line: 727, column: 9, scope: !1337)
!1342 = !DILocation(line: 728, column: 22, scope: !1339)
!1343 = !DILocation(line: 728, column: 7, scope: !1339)
!1344 = !DILocation(line: 729, column: 5, scope: !1337)
!1345 = !DILocation(line: 0, scope: !601, inlinedAt: !1346)
!1346 = distinct !DILocation(line: 733, column: 27, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1348, file: !3, line: 732, column: 7)
!1348 = distinct !DILexicalBlock(scope: !1337, file: !3, line: 730, column: 5)
!1349 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1346)
!1350 = !DILocation(line: 733, column: 26, scope: !1347)
!1351 = !{!1352, !1042, i64 0}
!1352 = !{!"_AffineMatrix", !1042, i64 0, !1042, i64 8, !1042, i64 16, !1042, i64 24, !1042, i64 32, !1042, i64 40}
!1353 = !DILocation(line: 734, column: 9, scope: !1347)
!1354 = !DILocation(line: 0, scope: !601, inlinedAt: !1355)
!1355 = distinct !DILocation(line: 738, column: 27, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1348, file: !3, line: 737, column: 7)
!1357 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1355)
!1358 = !DILocation(line: 738, column: 26, scope: !1356)
!1359 = !{!1352, !1042, i64 8}
!1360 = !DILocation(line: 739, column: 9, scope: !1356)
!1361 = !DILocation(line: 0, scope: !601, inlinedAt: !1362)
!1362 = distinct !DILocation(line: 743, column: 27, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1348, file: !3, line: 742, column: 7)
!1364 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1362)
!1365 = !DILocation(line: 743, column: 26, scope: !1363)
!1366 = !{!1352, !1042, i64 16}
!1367 = !DILocation(line: 744, column: 9, scope: !1363)
!1368 = !DILocation(line: 0, scope: !601, inlinedAt: !1369)
!1369 = distinct !DILocation(line: 748, column: 27, scope: !1370)
!1370 = distinct !DILexicalBlock(scope: !1348, file: !3, line: 747, column: 7)
!1371 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1369)
!1372 = !DILocation(line: 748, column: 26, scope: !1370)
!1373 = !{!1352, !1042, i64 24}
!1374 = !DILocation(line: 749, column: 9, scope: !1370)
!1375 = !DILocation(line: 0, scope: !601, inlinedAt: !1376)
!1376 = distinct !DILocation(line: 753, column: 27, scope: !1377)
!1377 = distinct !DILexicalBlock(scope: !1348, file: !3, line: 752, column: 7)
!1378 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1376)
!1379 = !DILocation(line: 753, column: 26, scope: !1377)
!1380 = !{!1352, !1042, i64 32}
!1381 = !DILocation(line: 754, column: 14, scope: !1377)
!1382 = !DILocation(line: 755, column: 9, scope: !1377)
!1383 = !DILocation(line: 0, scope: !601, inlinedAt: !1384)
!1384 = distinct !DILocation(line: 759, column: 27, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1348, file: !3, line: 758, column: 7)
!1386 = !DILocation(line: 45, column: 10, scope: !601, inlinedAt: !1384)
!1387 = !DILocation(line: 759, column: 26, scope: !1385)
!1388 = !{!1352, !1042, i64 40}
!1389 = !DILocation(line: 760, column: 14, scope: !1385)
!1390 = !DILocation(line: 761, column: 9, scope: !1385)
!1391 = !DILocation(line: 724, column: 39, scope: !1332)
!1392 = !DILocation(line: 724, column: 15, scope: !1332)
!1393 = distinct !{!1393, !1394, !1395, !549, !550}
!1394 = !DILocation(line: 724, column: 3, scope: !1333)
!1395 = !DILocation(line: 764, column: 3, scope: !1333)
!1396 = !DILocation(line: 722, column: 8, scope: !1286)
!1397 = !DILocation(line: 765, column: 31, scope: !1286)
!1398 = !DILocation(line: 765, column: 49, scope: !1286)
!1399 = !DILocation(line: 765, column: 67, scope: !1286)
!1400 = !DILocation(line: 766, column: 20, scope: !1286)
!1401 = !DILocation(line: 765, column: 51, scope: !1286)
!1402 = !DILocation(line: 767, column: 7, scope: !1403)
!1403 = distinct !DILexicalBlock(scope: !1286, file: !3, line: 767, column: 7)
!1404 = !DILocation(line: 767, column: 25, scope: !1403)
!1405 = !DILocation(line: 767, column: 7, scope: !1286)
!1406 = !DILocation(line: 768, column: 12, scope: !1403)
!1407 = !DILocation(line: 768, column: 5, scope: !1403)
!1408 = !DILocation(line: 771, column: 1, scope: !1286)
!1409 = !DILocation(line: 770, column: 3, scope: !1286)
!1410 = !DISubprogram(name: "GetAffineMatrix", scope: !1411, file: !1411, line: 388, type: !1412, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !775)
!1411 = !DIFile(filename: "apps/538.imagick_r/src/magick/draw.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7430ad7998fb3d4ef58bbf5582967ea1")
!1412 = !DISubroutineType(types: !1413)
!1413 = !{null, !1289}
!1414 = !DISubprogram(name: "GetMagickToken", scope: !1415, file: !1415, line: 45, type: !1416, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !775)
!1415 = !DIFile(filename: "apps/538.imagick_r/src/magick/token.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f90c1544ca665b41425c6912f2cbc1e4")
!1416 = !DISubroutineType(types: !1417)
!1417 = !{null, !8, !1418, !6}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!1419 = !DISubprogram(name: "ThrowMagickException", scope: !103, file: !103, line: 156, type: !1420, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !775)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!816, !1299, !8, !8, !774, !1422, !8, !8, null}
!1422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1304)
!1423 = distinct !DISubprogram(name: "ParseGravityGeometry", scope: !3, file: !3, line: 1139, type: !1424, scopeLine: 1141, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1604)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!479, !1426, !8, !826, !1299}
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1428)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !84, line: 221, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !243, line: 150, size: 105920, elements: !1430)
!1430 = !{!1431, !1433, !1435, !1437, !1438, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1456, !1457, !1458, !1459, !1460, !1474, !1476, !1477, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1493, !1495, !1497, !1498, !1500, !1502, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1518, !1533, !1545, !1546, !1547, !1548, !1552, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1565, !1566, !1575, !1576, !1578, !1579, !1580, !1581, !1582, !1583, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1593, !1594, !1595, !1596, !1597, !1601, !1603}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !1429, file: !243, line: 153, baseType: !1432, size: 32)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !84, line: 209, baseType: !175)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1429, file: !243, line: 156, baseType: !1434, size: 32, offset: 32)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !181, line: 61, baseType: !180)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1429, file: !243, line: 159, baseType: !1436, size: 32, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !218, line: 49, baseType: !217)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1429, file: !243, line: 162, baseType: !452, size: 64, offset: 128)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !1429, file: !243, line: 165, baseType: !1439, size: 32, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !243, line: 86, baseType: !242)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !1429, file: !243, line: 168, baseType: !816, size: 32, offset: 224)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1429, file: !243, line: 169, baseType: !816, size: 32, offset: 256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1429, file: !243, line: 172, baseType: !452, size: 64, offset: 320)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1429, file: !243, line: 173, baseType: !452, size: 64, offset: 384)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1429, file: !243, line: 174, baseType: !452, size: 64, offset: 448)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1429, file: !243, line: 175, baseType: !452, size: 64, offset: 512)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !1429, file: !243, line: 178, baseType: !1447, size: 64, offset: 576)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !404, line: 148, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !404, line: 131, size: 64, elements: !1450)
!1450 = !{!1451, !1453, !1454, !1455}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1449, file: !404, line: 143, baseType: !1452, size: 16)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !84, line: 93, baseType: !450)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1449, file: !404, line: 144, baseType: !1452, size: 16, offset: 16)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1449, file: !404, line: 145, baseType: !1452, size: 16, offset: 32)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1449, file: !404, line: 146, baseType: !1452, size: 16, offset: 48)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !1429, file: !243, line: 179, baseType: !1448, size: 64, offset: 640)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1429, file: !243, line: 180, baseType: !1448, size: 64, offset: 704)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !1429, file: !243, line: 181, baseType: !1448, size: 64, offset: 768)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1429, file: !243, line: 184, baseType: !451, size: 64, offset: 832)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !1429, file: !243, line: 187, baseType: !1461, size: 768, offset: 896)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !243, line: 128, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !243, line: 121, size: 768, elements: !1463)
!1463 = !{!1464, !1471, !1472, !1473}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !1462, file: !243, line: 124, baseType: !1465, size: 192)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !243, line: 101, baseType: !1466)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !243, line: 95, size: 192, elements: !1467)
!1467 = !{!1468, !1469, !1470}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1466, file: !243, line: 98, baseType: !451, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1466, file: !243, line: 99, baseType: !451, size: 64, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1466, file: !243, line: 100, baseType: !451, size: 64, offset: 128)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !1462, file: !243, line: 125, baseType: !1465, size: 192, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !1462, file: !243, line: 126, baseType: !1465, size: 192, offset: 384)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !1462, file: !243, line: 127, baseType: !1465, size: 192, offset: 576)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !1429, file: !243, line: 190, baseType: !1475, size: 32, offset: 1664)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !255, line: 49, baseType: !254)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1429, file: !243, line: 193, baseType: !447, size: 64, offset: 1728)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1429, file: !243, line: 196, baseType: !1478, size: 32, offset: 1792)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !243, line: 93, baseType: !262)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !1429, file: !243, line: 199, baseType: !6, size: 64, offset: 1856)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !1429, file: !243, line: 200, baseType: !6, size: 64, offset: 1920)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !1429, file: !243, line: 201, baseType: !6, size: 64, offset: 1984)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1429, file: !243, line: 204, baseType: !455, size: 64, offset: 2048)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !1429, file: !243, line: 207, baseType: !451, size: 64, offset: 2112)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !1429, file: !243, line: 208, baseType: !451, size: 64, offset: 2176)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !1429, file: !243, line: 211, baseType: !471, size: 256, offset: 2240)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !1429, file: !243, line: 212, baseType: !471, size: 256, offset: 2496)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !1429, file: !243, line: 213, baseType: !471, size: 256, offset: 2752)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !1429, file: !243, line: 216, baseType: !451, size: 64, offset: 3008)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !1429, file: !243, line: 217, baseType: !451, size: 64, offset: 3072)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1429, file: !243, line: 218, baseType: !451, size: 64, offset: 3136)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1429, file: !243, line: 221, baseType: !1492, size: 32, offset: 3200)
!1492 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !268, line: 66, baseType: !267)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !1429, file: !243, line: 224, baseType: !1494, size: 32, offset: 3232)
!1494 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !243, line: 73, baseType: !302)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !1429, file: !243, line: 227, baseType: !1496, size: 32, offset: 3264)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !313, line: 35, baseType: !312)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1429, file: !243, line: 230, baseType: !825, size: 32, offset: 3296)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !1429, file: !243, line: 233, baseType: !1499, size: 32, offset: 3328)
!1499 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !319, line: 99, baseType: !318)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !1429, file: !243, line: 236, baseType: !1501, size: 32, offset: 3360)
!1501 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !390, line: 32, baseType: !389)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !1429, file: !243, line: 239, baseType: !1503, size: 64, offset: 3392)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1429, file: !243, line: 242, baseType: !452, size: 64, offset: 3456)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1429, file: !243, line: 243, baseType: !452, size: 64, offset: 3520)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !1429, file: !243, line: 246, baseType: !455, size: 64, offset: 3584)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !1429, file: !243, line: 249, baseType: !452, size: 64, offset: 3648)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !1429, file: !243, line: 250, baseType: !452, size: 64, offset: 3712)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !1429, file: !243, line: 253, baseType: !455, size: 64, offset: 3776)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1429, file: !243, line: 256, baseType: !1511, size: 192, offset: 3840)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !1512, line: 68, baseType: !1513)
!1512 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !1512, line: 62, size: 192, elements: !1514)
!1514 = !{!1515, !1516, !1517}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !1513, file: !1512, line: 65, baseType: !451, size: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !1513, file: !1512, line: 66, baseType: !451, size: 64, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !1513, file: !1512, line: 67, baseType: !451, size: 64, offset: 128)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !1429, file: !243, line: 259, baseType: !1519, size: 512, offset: 4032)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !398, line: 51, baseType: !1520)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !398, line: 40, size: 512, elements: !1521)
!1521 = !{!1522, !1529, !1530, !1532}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !1520, file: !398, line: 43, baseType: !1523, size: 192)
!1523 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !398, line: 38, baseType: !1524)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !398, line: 32, size: 192, elements: !1525)
!1525 = !{!1526, !1527, !1528}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1524, file: !398, line: 35, baseType: !451, size: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1524, file: !398, line: 36, baseType: !451, size: 64, offset: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1524, file: !398, line: 37, baseType: !451, size: 64, offset: 128)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !1520, file: !398, line: 44, baseType: !1523, size: 192, offset: 192)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1520, file: !398, line: 47, baseType: !1531, size: 32, offset: 384)
!1531 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !398, line: 30, baseType: !397)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1520, file: !398, line: 50, baseType: !452, size: 64, offset: 448)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !1429, file: !243, line: 262, baseType: !1534, size: 64, offset: 4544)
!1534 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !1535, line: 26, baseType: !1536)
!1535 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!816, !8, !1539, !1542, !447}
!1539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1540)
!1540 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !84, line: 150, baseType: !1541)
!1541 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!1542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1543)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !84, line: 151, baseType: !1544)
!1544 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1429, file: !243, line: 265, baseType: !447, size: 64, offset: 4608)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1429, file: !243, line: 266, baseType: !447, size: 64, offset: 4672)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1429, file: !243, line: 267, baseType: !447, size: 64, offset: 4736)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !1429, file: !243, line: 270, baseType: !1549, size: 64, offset: 4800)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !218, line: 52, baseType: !1551)
!1551 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !218, line: 51, flags: DIFlagFwdDecl)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !1429, file: !243, line: 273, baseType: !1553, size: 64, offset: 4864)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64)
!1554 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !84, line: 217, baseType: !1555)
!1555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !84, line: 217, flags: DIFlagFwdDecl)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1429, file: !243, line: 276, baseType: !504, size: 32768, offset: 4928)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !1429, file: !243, line: 277, baseType: !504, size: 32768, offset: 37696)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !1429, file: !243, line: 278, baseType: !504, size: 32768, offset: 70464)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !1429, file: !243, line: 281, baseType: !452, size: 64, offset: 103232)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !1429, file: !243, line: 282, baseType: !452, size: 64, offset: 103296)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !1429, file: !243, line: 285, baseType: !1300, size: 448, offset: 103360)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1429, file: !243, line: 288, baseType: !816, size: 32, offset: 103808)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !1429, file: !243, line: 291, baseType: !1564, size: 64, offset: 103872)
!1564 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !455)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1429, file: !243, line: 294, baseType: !1311, size: 64, offset: 103936)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !1429, file: !243, line: 297, baseType: !1567, size: 256, offset: 104000)
!1567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !255, line: 40, baseType: !1568)
!1568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !255, line: 27, size: 256, elements: !1569)
!1569 = !{!1570, !1571, !1572, !1574}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1568, file: !255, line: 30, baseType: !6, size: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1568, file: !255, line: 33, baseType: !452, size: 64, offset: 64)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1568, file: !255, line: 36, baseType: !1573, size: 64, offset: 128)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1568, file: !255, line: 39, baseType: !452, size: 64, offset: 192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !1429, file: !243, line: 298, baseType: !1567, size: 256, offset: 104256)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !1429, file: !243, line: 299, baseType: !1577, size: 64, offset: 104512)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !1429, file: !243, line: 302, baseType: !452, size: 64, offset: 104576)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1429, file: !243, line: 305, baseType: !452, size: 64, offset: 104640)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1429, file: !243, line: 308, baseType: !1503, size: 64, offset: 104704)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1429, file: !243, line: 309, baseType: !1503, size: 64, offset: 104768)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1429, file: !243, line: 310, baseType: !1503, size: 64, offset: 104832)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !1429, file: !243, line: 313, baseType: !1584, size: 32, offset: 104896)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !404, line: 47, baseType: !403)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !1429, file: !243, line: 316, baseType: !816, size: 32, offset: 104928)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !1429, file: !243, line: 319, baseType: !1448, size: 64, offset: 104960)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1429, file: !243, line: 322, baseType: !1503, size: 64, offset: 105024)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !1429, file: !243, line: 325, baseType: !471, size: 256, offset: 105088)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1429, file: !243, line: 328, baseType: !447, size: 64, offset: 105344)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !1429, file: !243, line: 329, baseType: !447, size: 64, offset: 105408)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1429, file: !243, line: 332, baseType: !1592, size: 32, offset: 105472)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !243, line: 61, baseType: !420)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1429, file: !243, line: 335, baseType: !816, size: 32, offset: 105504)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !1429, file: !243, line: 338, baseType: !1543, size: 64, offset: 105536)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !1429, file: !243, line: 341, baseType: !816, size: 32, offset: 105600)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1429, file: !243, line: 344, baseType: !452, size: 64, offset: 105664)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1429, file: !243, line: 347, baseType: !1598, size: 64, offset: 105728)
!1598 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1599, line: 7, baseType: !1600)
!1599 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!1600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !458, line: 160, baseType: !459)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !1429, file: !243, line: 350, baseType: !1602, size: 32, offset: 105792)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !404, line: 79, baseType: !434)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1429, file: !243, line: 353, baseType: !452, size: 64, offset: 105856)
!1604 = !{!1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1615, !1616}
!1605 = !DILocalVariable(name: "image", arg: 1, scope: !1423, file: !3, line: 1139, type: !1426)
!1606 = !DILocalVariable(name: "geometry", arg: 2, scope: !1423, file: !3, line: 1140, type: !8)
!1607 = !DILocalVariable(name: "region_info", arg: 3, scope: !1423, file: !3, line: 1140, type: !826)
!1608 = !DILocalVariable(name: "exception", arg: 4, scope: !1423, file: !3, line: 1140, type: !1299)
!1609 = !DILocalVariable(name: "flags", scope: !1423, file: !3, line: 1143, type: !479)
!1610 = !DILocalVariable(name: "height", scope: !1423, file: !3, line: 1146, type: !452)
!1611 = !DILocalVariable(name: "width", scope: !1423, file: !3, line: 1147, type: !452)
!1612 = !DILocalVariable(name: "geometry_info", scope: !1613, file: !3, line: 1164, type: !885)
!1613 = distinct !DILexicalBlock(scope: !1614, file: !3, line: 1162, column: 5)
!1614 = distinct !DILexicalBlock(scope: !1423, file: !3, line: 1161, column: 7)
!1615 = !DILocalVariable(name: "status", scope: !1613, file: !3, line: 1167, type: !479)
!1616 = !DILocalVariable(name: "scale", scope: !1613, file: !3, line: 1170, type: !1617)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !1411, line: 142, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !1411, line: 137, size: 128, elements: !1619)
!1619 = !{!1620, !1621}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1618, file: !1411, line: 140, baseType: !451, size: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1618, file: !1411, line: 141, baseType: !451, size: 64, offset: 64)
!1622 = !DILocation(line: 0, scope: !1423)
!1623 = !DILocalVariable(name: "image", arg: 1, scope: !1624, file: !3, line: 1538, type: !1426)
!1624 = distinct !DISubprogram(name: "SetGeometry", scope: !3, file: !3, line: 1538, type: !1625, scopeLine: 1539, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1627)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{null, !1426, !826}
!1627 = !{!1623, !1628}
!1628 = !DILocalVariable(name: "geometry", arg: 2, scope: !1624, file: !3, line: 1538, type: !826)
!1629 = !DILocation(line: 0, scope: !1624, inlinedAt: !1630)
!1630 = distinct !DILocation(line: 1149, column: 3, scope: !1423)
!1631 = !DILocation(line: 1542, column: 14, scope: !1632, inlinedAt: !1630)
!1632 = distinct !DILexicalBlock(scope: !1624, file: !3, line: 1542, column: 7)
!1633 = !{!1634, !519, i64 12976}
!1634 = !{!"_Image", !519, i64 0, !519, i64 4, !519, i64 8, !645, i64 16, !519, i64 24, !519, i64 28, !519, i64 32, !645, i64 40, !645, i64 48, !645, i64 56, !645, i64 64, !531, i64 72, !1635, i64 80, !1635, i64 88, !1635, i64 96, !1042, i64 104, !1636, i64 112, !519, i64 208, !531, i64 216, !519, i64 224, !531, i64 232, !531, i64 240, !531, i64 248, !645, i64 256, !1042, i64 264, !1042, i64 272, !836, i64 280, !836, i64 312, !836, i64 344, !1042, i64 376, !1042, i64 384, !1042, i64 392, !519, i64 400, !519, i64 404, !519, i64 408, !519, i64 412, !519, i64 416, !519, i64 420, !531, i64 424, !645, i64 432, !645, i64 440, !645, i64 448, !645, i64 456, !645, i64 464, !645, i64 472, !1638, i64 480, !1639, i64 504, !531, i64 568, !531, i64 576, !531, i64 584, !531, i64 592, !531, i64 600, !531, i64 608, !519, i64 616, !519, i64 4712, !519, i64 8808, !645, i64 12904, !645, i64 12912, !1641, i64 12920, !519, i64 12976, !645, i64 12984, !531, i64 12992, !1643, i64 13000, !1643, i64 13032, !531, i64 13064, !645, i64 13072, !645, i64 13080, !531, i64 13088, !531, i64 13096, !531, i64 13104, !519, i64 13112, !519, i64 13116, !1635, i64 13120, !531, i64 13128, !836, i64 13136, !531, i64 13168, !531, i64 13176, !519, i64 13184, !519, i64 13188, !1644, i64 13192, !519, i64 13200, !645, i64 13208, !645, i64 13216, !519, i64 13224, !645, i64 13232}
!1635 = !{!"_PixelPacket", !540, i64 0, !540, i64 2, !540, i64 4, !540, i64 6}
!1636 = !{!"_ChromaticityInfo", !1637, i64 0, !1637, i64 24, !1637, i64 48, !1637, i64 72}
!1637 = !{!"_PrimaryInfo", !1042, i64 0, !1042, i64 8, !1042, i64 16}
!1638 = !{!"_ErrorInfo", !1042, i64 0, !1042, i64 8, !1042, i64 16}
!1639 = !{!"_TimerInfo", !1640, i64 0, !1640, i64 24, !519, i64 48, !645, i64 56}
!1640 = !{!"_Timer", !1042, i64 0, !1042, i64 8, !1042, i64 16}
!1641 = !{!"_ExceptionInfo", !519, i64 0, !1642, i64 4, !531, i64 8, !531, i64 16, !531, i64 24, !519, i64 32, !531, i64 40, !645, i64 48}
!1642 = !{!"int", !519, i64 0}
!1643 = !{!"_ProfileInfo", !531, i64 0, !645, i64 8, !531, i64 16, !645, i64 24}
!1644 = !{!"long long", !519, i64 0}
!1645 = !DILocation(line: 1542, column: 20, scope: !1632, inlinedAt: !1630)
!1646 = !DILocation(line: 1542, column: 7, scope: !1624, inlinedAt: !1630)
!1647 = !DILocation(line: 1543, column: 68, scope: !1632, inlinedAt: !1630)
!1648 = !DILocation(line: 1543, column: 12, scope: !1632, inlinedAt: !1630)
!1649 = !DILocation(line: 1543, column: 5, scope: !1632, inlinedAt: !1630)
!1650 = !DILocation(line: 1545, column: 10, scope: !1624, inlinedAt: !1630)
!1651 = !DILocation(line: 1546, column: 26, scope: !1624, inlinedAt: !1630)
!1652 = !{!1634, !645, i64 40}
!1653 = !DILocation(line: 1546, column: 18, scope: !1624, inlinedAt: !1630)
!1654 = !DILocation(line: 1547, column: 27, scope: !1624, inlinedAt: !1630)
!1655 = !{!1634, !645, i64 48}
!1656 = !DILocation(line: 1547, column: 13, scope: !1624, inlinedAt: !1630)
!1657 = !DILocation(line: 1547, column: 19, scope: !1624, inlinedAt: !1630)
