; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/histogram.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/histogram.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._CubeInfo = type { ptr, i64, i64, i64, i64, ptr, ptr }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }

!420 = !DIEnumerator(name: "SVGCompliance", value: 1)
!421 = !DIEnumerator(name: "X11Compliance", value: 2)
!422 = !DIEnumerator(name: "XPMCompliance", value: 4)
!423 = !DIEnumerator(name: "AllCompliance", value: 2147483647)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !425, line: 27, baseType: !5, size: 32, elements: !426)
!425 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantize.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3eab4066ac81fc10b9d90b7cb7db1009")
!426 = !{!427, !428, !429, !430}
!427 = !DIEnumerator(name: "UndefinedDitherMethod", value: 0)
!428 = !DIEnumerator(name: "NoDitherMethod", value: 1)
!429 = !DIEnumerator(name: "RiemersmaDitherMethod", value: 2)
!430 = !DIEnumerator(name: "FloydSteinbergDitherMethod", value: 3)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !432, line: 27, baseType: !5, size: 32, elements: !433)
!432 = !DIFile(filename: "apps/538.imagick_r/src/magick/effect.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "85233add4591bd6d6001c51d4fa6a546")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!434 = !DIEnumerator(name: "UndefinedPreview", value: 0)
!435 = !DIEnumerator(name: "RotatePreview", value: 1)
!436 = !DIEnumerator(name: "ShearPreview", value: 2)
!437 = !DIEnumerator(name: "RollPreview", value: 3)
!438 = !DIEnumerator(name: "HuePreview", value: 4)
!439 = !DIEnumerator(name: "SaturationPreview", value: 5)
!440 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!441 = !DIEnumerator(name: "GammaPreview", value: 7)
!442 = !DIEnumerator(name: "SpiffPreview", value: 8)
!443 = !DIEnumerator(name: "DullPreview", value: 9)
!444 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!445 = !DIEnumerator(name: "QuantizePreview", value: 11)
!446 = !DIEnumerator(name: "DespecklePreview", value: 12)
!447 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!448 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!449 = !DIEnumerator(name: "SharpenPreview", value: 15)
!450 = !DIEnumerator(name: "BlurPreview", value: 16)
!451 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!452 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!453 = !DIEnumerator(name: "SpreadPreview", value: 19)
!454 = !DIEnumerator(name: "SolarizePreview", value: 20)
!455 = !DIEnumerator(name: "ShadePreview", value: 21)
!456 = !DIEnumerator(name: "RaisePreview", value: 22)
!457 = !DIEnumerator(name: "SegmentPreview", value: 23)
!458 = !DIEnumerator(name: "SwirlPreview", value: 24)
!459 = !DIEnumerator(name: "ImplodePreview", value: 25)
!460 = !DIEnumerator(name: "WavePreview", value: 26)
!461 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!462 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!463 = !DIEnumerator(name: "JPEGPreview", value: 29)
!464 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !465, line: 27, baseType: !5, size: 32, elements: !466)
!465 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!467 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!468 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!469 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!470 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!471 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!472 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!473 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!474 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!475 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!476 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!477 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!478 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!479 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!480 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!481 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!482 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!483 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!484 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!485 = !{!486, !506, !507, !525, !527, !529, !551, !513, !553, !555, !611, !535, !612, !622, !807, !541, !886, !776, !496, !888, !562, !642}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPacket", file: !488, line: 35, baseType: !489)
!488 = !DIFile(filename: "apps/538.imagick_r/src/magick/histogram.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2cf116c94f52893f7dbbcaa9072de9d3")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ColorPacket", file: !488, line: 25, size: 192, elements: !490)
!490 = !{!491, !501, !503}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !489, file: !488, line: 28, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !494)
!494 = !{!495, !498, !499, !500}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !493, file: !326, line: 143, baseType: !496, size: 16)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !497)
!497 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !493, file: !326, line: 144, baseType: !496, size: 16, offset: 16)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !493, file: !326, line: 145, baseType: !496, size: 16, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !493, file: !326, line: 146, baseType: !496, size: 16, offset: 48)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !489, file: !488, line: 31, baseType: !502, size: 16, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !496)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !489, file: !488, line: 34, baseType: !504, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !505)
!505 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "CubeInfo", file: !509, line: 117, baseType: !510)
!509 = !DIFile(filename: "apps/538.imagick_r/src/magick/histogram.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "192f1c1d25bbae3b61876438f2ce56cf")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CubeInfo", file: !509, line: 97, size: 448, elements: !511)
!511 = !{!512, !528, !534, !537, !538, !539, !540}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !510, file: !509, line: 100, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInfo", file: !509, line: 86, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NodeInfo", file: !509, line: 73, size: 1216, elements: !516)
!516 = !{!517, !522, !523, !524}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !515, file: !509, line: 76, baseType: !518, size: 1024)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 1024, elements: !520)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!520 = !{!521}
!521 = !DISubrange(count: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !515, file: !509, line: 79, baseType: !486, size: 64, offset: 1024)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "number_unique", scope: !515, file: !509, line: 82, baseType: !504, size: 64, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !515, file: !509, line: 85, baseType: !525, size: 64, offset: 1152)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !526, line: 46, baseType: !527)
!526 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!527 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !510, file: !509, line: 103, baseType: !529, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !530, line: 77, baseType: !531)
!530 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !532, line: 193, baseType: !533)
!532 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!533 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !510, file: !509, line: 106, baseType: !535, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !536)
!536 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !510, file: !509, line: 109, baseType: !525, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "free_nodes", scope: !510, file: !509, line: 110, baseType: !525, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "node_info", scope: !510, file: !509, line: 113, baseType: !513, size: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "node_queue", scope: !510, file: !509, line: 116, baseType: !541, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nodes", file: !509, line: 95, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Nodes", file: !509, line: 88, size: 1867840, elements: !544)
!544 = !{!545, !549}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !543, file: !509, line: 91, baseType: !546, size: 1867776)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 1867776, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !509, line: 94, baseType: !550, size: 64, offset: 1867776)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !557, line: 7, baseType: !558)
!557 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !559, line: 49, size: 1728, elements: !560)
!559 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!560 = !{!561, !563, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !579, !581, !582, !583, !585, !586, !588, !592, !595, !597, !600, !603, !604, !605, !606, !607}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !558, file: !559, line: 51, baseType: !562, size: 32)
!562 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !558, file: !559, line: 54, baseType: !564, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !558, file: !559, line: 55, baseType: !564, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !558, file: !559, line: 56, baseType: !564, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !558, file: !559, line: 57, baseType: !564, size: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !558, file: !559, line: 58, baseType: !564, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !558, file: !559, line: 59, baseType: !564, size: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !558, file: !559, line: 60, baseType: !564, size: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !558, file: !559, line: 61, baseType: !564, size: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !558, file: !559, line: 64, baseType: !564, size: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !558, file: !559, line: 65, baseType: !564, size: 64, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !558, file: !559, line: 66, baseType: !564, size: 64, offset: 704)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !558, file: !559, line: 68, baseType: !577, size: 64, offset: 768)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !559, line: 36, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !558, file: !559, line: 70, baseType: !580, size: 64, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !558, file: !559, line: 72, baseType: !562, size: 32, offset: 896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !558, file: !559, line: 73, baseType: !562, size: 32, offset: 928)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !558, file: !559, line: 74, baseType: !584, size: 64, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !532, line: 152, baseType: !533)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !558, file: !559, line: 77, baseType: !497, size: 16, offset: 1024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !558, file: !559, line: 78, baseType: !587, size: 8, offset: 1040)
!587 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !558, file: !559, line: 79, baseType: !589, size: 8, offset: 1048)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 8, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 1)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !558, file: !559, line: 81, baseType: !593, size: 64, offset: 1088)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !559, line: 43, baseType: null)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !558, file: !559, line: 89, baseType: !596, size: 64, offset: 1152)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !532, line: 153, baseType: !533)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !558, file: !559, line: 91, baseType: !598, size: 64, offset: 1216)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !559, line: 37, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !558, file: !559, line: 92, baseType: !601, size: 64, offset: 1280)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !559, line: 38, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !558, file: !559, line: 93, baseType: !580, size: 64, offset: 1344)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !558, file: !559, line: 94, baseType: !506, size: 64, offset: 1408)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !558, file: !559, line: 95, baseType: !525, size: 64, offset: 1472)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !558, file: !559, line: 96, baseType: !562, size: 32, offset: 1536)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !558, file: !559, line: 98, baseType: !608, size: 160, offset: 1568)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 160, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 20)
!611 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !613, line: 26, baseType: !614)
!613 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!617, !618, !620, !621, !506}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !625)
!625 = !{!626, !628, !630, !632, !633, !635, !636, !637, !638, !639, !640, !641, !643, !644, !645, !646, !647, !661, !663, !664, !666, !667, !668, !669, !670, !671, !672, !680, !681, !682, !683, !684, !685, !687, !689, !691, !693, !695, !697, !699, !700, !701, !702, !703, !704, !705, !712, !727, !728, !729, !730, !731, !735, !739, !743, !744, !745, !746, !747, !764, !765, !767, !768, !778, !779, !781, !782, !783, !784, !785, !786, !788, !789, !790, !791, !792, !793, !794, !796, !797, !798, !799, !800, !804, !806}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !624, file: !73, line: 153, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !624, file: !73, line: 156, baseType: !629, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !624, file: !73, line: 159, baseType: !631, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !624, file: !73, line: 162, baseType: !525, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !624, file: !73, line: 165, baseType: !634, size: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !624, file: !73, line: 168, baseType: !617, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !624, file: !73, line: 169, baseType: !617, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !624, file: !73, line: 172, baseType: !525, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !624, file: !73, line: 173, baseType: !525, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !624, file: !73, line: 174, baseType: !525, size: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !624, file: !73, line: 175, baseType: !525, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !624, file: !73, line: 178, baseType: !642, size: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !624, file: !73, line: 179, baseType: !492, size: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !624, file: !73, line: 180, baseType: !492, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !624, file: !73, line: 181, baseType: !492, size: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !624, file: !73, line: 184, baseType: !611, size: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !624, file: !73, line: 187, baseType: !648, size: 768, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !650)
!650 = !{!651, !658, !659, !660}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !649, file: !73, line: 124, baseType: !652, size: 192)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !653, file: !73, line: 98, baseType: !611, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !653, file: !73, line: 99, baseType: !611, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !653, file: !73, line: 100, baseType: !611, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !649, file: !73, line: 125, baseType: !652, size: 192, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !649, file: !73, line: 126, baseType: !652, size: 192, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !649, file: !73, line: 127, baseType: !652, size: 192, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !624, file: !73, line: 190, baseType: !662, size: 32, offset: 1664)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !624, file: !73, line: 193, baseType: !506, size: 64, offset: 1728)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !624, file: !73, line: 196, baseType: !665, size: 32, offset: 1792)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !624, file: !73, line: 199, baseType: !564, size: 64, offset: 1856)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !624, file: !73, line: 200, baseType: !564, size: 64, offset: 1920)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !624, file: !73, line: 201, baseType: !564, size: 64, offset: 1984)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !624, file: !73, line: 204, baseType: !529, size: 64, offset: 2048)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !624, file: !73, line: 207, baseType: !611, size: 64, offset: 2112)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !624, file: !73, line: 208, baseType: !611, size: 64, offset: 2176)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !624, file: !73, line: 211, baseType: !673, size: 256, offset: 2240)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !675)
!675 = !{!676, !677, !678, !679}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !674, file: !153, line: 124, baseType: !525, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !674, file: !153, line: 125, baseType: !525, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !674, file: !153, line: 128, baseType: !529, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !674, file: !153, line: 129, baseType: !529, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !624, file: !73, line: 212, baseType: !673, size: 256, offset: 2496)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !624, file: !73, line: 213, baseType: !673, size: 256, offset: 2752)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !624, file: !73, line: 216, baseType: !611, size: 64, offset: 3008)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !624, file: !73, line: 217, baseType: !611, size: 64, offset: 3072)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !624, file: !73, line: 218, baseType: !611, size: 64, offset: 3136)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !624, file: !73, line: 221, baseType: !686, size: 32, offset: 3200)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !624, file: !73, line: 224, baseType: !688, size: 32, offset: 3232)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !624, file: !73, line: 227, baseType: !690, size: 32, offset: 3264)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !624, file: !73, line: 230, baseType: !692, size: 32, offset: 3296)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !624, file: !73, line: 233, baseType: !694, size: 32, offset: 3328)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !624, file: !73, line: 236, baseType: !696, size: 32, offset: 3360)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !624, file: !73, line: 239, baseType: !698, size: 64, offset: 3392)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !624, file: !73, line: 242, baseType: !525, size: 64, offset: 3456)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !624, file: !73, line: 243, baseType: !525, size: 64, offset: 3520)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !624, file: !73, line: 246, baseType: !529, size: 64, offset: 3584)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !624, file: !73, line: 249, baseType: !525, size: 64, offset: 3648)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !624, file: !73, line: 250, baseType: !525, size: 64, offset: 3712)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !624, file: !73, line: 253, baseType: !529, size: 64, offset: 3776)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !624, file: !73, line: 256, baseType: !706, size: 192, offset: 3840)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !416, line: 68, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !416, line: 62, size: 192, elements: !708)
!708 = !{!709, !710, !711}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !707, file: !416, line: 65, baseType: !611, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !707, file: !416, line: 66, baseType: !611, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !707, file: !416, line: 67, baseType: !611, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !624, file: !73, line: 259, baseType: !713, size: 512, offset: 4032)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !715)
!715 = !{!716, !723, !724, !726}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !714, file: !247, line: 43, baseType: !717, size: 192)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !719)
!719 = !{!720, !721, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !718, file: !247, line: 35, baseType: !611, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !718, file: !247, line: 36, baseType: !611, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !718, file: !247, line: 37, baseType: !611, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !714, file: !247, line: 44, baseType: !717, size: 192, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !714, file: !247, line: 47, baseType: !725, size: 32, offset: 384)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !714, file: !247, line: 50, baseType: !525, size: 64, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !624, file: !73, line: 262, baseType: !612, size: 64, offset: 4544)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !624, file: !73, line: 265, baseType: !506, size: 64, offset: 4608)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !624, file: !73, line: 266, baseType: !506, size: 64, offset: 4672)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !624, file: !73, line: 267, baseType: !506, size: 64, offset: 4736)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !624, file: !73, line: 270, baseType: !732, size: 64, offset: 4800)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !734)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !624, file: !73, line: 273, baseType: !736, size: 64, offset: 4864)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !738)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !624, file: !73, line: 276, baseType: !740, size: 32768, offset: 4928)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 32768, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 4096)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !624, file: !73, line: 277, baseType: !740, size: 32768, offset: 37696)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !624, file: !73, line: 278, baseType: !740, size: 32768, offset: 70464)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !624, file: !73, line: 281, baseType: !525, size: 64, offset: 103232)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !624, file: !73, line: 282, baseType: !525, size: 64, offset: 103296)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !624, file: !73, line: 285, baseType: !748, size: 448, offset: 103360)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !750)
!750 = !{!751, !753, !754, !755, !756, !757, !758, !763}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !749, file: !253, line: 105, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !749, file: !253, line: 108, baseType: !562, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !749, file: !253, line: 111, baseType: !564, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !749, file: !253, line: 112, baseType: !564, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !749, file: !253, line: 115, baseType: !506, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !749, file: !253, line: 118, baseType: !617, size: 32, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !749, file: !253, line: 121, baseType: !759, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !761, line: 26, baseType: !762)
!761 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !761, line: 25, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !749, file: !253, line: 124, baseType: !525, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !624, file: !73, line: 288, baseType: !617, size: 32, offset: 103808)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !624, file: !73, line: 291, baseType: !766, size: 64, offset: 103872)
!766 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !529)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !624, file: !73, line: 294, baseType: !759, size: 64, offset: 103936)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !624, file: !73, line: 297, baseType: !769, size: 256, offset: 104000)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !771)
!771 = !{!772, !773, !774, !777}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !89, line: 30, baseType: !564, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !770, file: !89, line: 33, baseType: !525, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !770, file: !89, line: 36, baseType: !775, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !770, file: !89, line: 39, baseType: !525, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !624, file: !73, line: 298, baseType: !769, size: 256, offset: 104256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !624, file: !73, line: 299, baseType: !780, size: 64, offset: 104512)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !624, file: !73, line: 302, baseType: !525, size: 64, offset: 104576)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !624, file: !73, line: 305, baseType: !525, size: 64, offset: 104640)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !624, file: !73, line: 308, baseType: !698, size: 64, offset: 104704)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !624, file: !73, line: 309, baseType: !698, size: 64, offset: 104768)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !624, file: !73, line: 310, baseType: !698, size: 64, offset: 104832)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !624, file: !73, line: 313, baseType: !787, size: 32, offset: 104896)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !624, file: !73, line: 316, baseType: !617, size: 32, offset: 104928)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !624, file: !73, line: 319, baseType: !492, size: 64, offset: 104960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !624, file: !73, line: 322, baseType: !698, size: 64, offset: 105024)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !624, file: !73, line: 325, baseType: !673, size: 256, offset: 105088)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !624, file: !73, line: 328, baseType: !506, size: 64, offset: 105344)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !624, file: !73, line: 329, baseType: !506, size: 64, offset: 105408)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !624, file: !73, line: 332, baseType: !795, size: 32, offset: 105472)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !624, file: !73, line: 335, baseType: !617, size: 32, offset: 105504)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !624, file: !73, line: 338, baseType: !504, size: 64, offset: 105536)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !624, file: !73, line: 341, baseType: !617, size: 32, offset: 105600)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !624, file: !73, line: 344, baseType: !525, size: 64, offset: 105664)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !624, file: !73, line: 347, baseType: !801, size: 64, offset: 105728)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !802, line: 7, baseType: !803)
!802 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !532, line: 160, baseType: !533)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !624, file: !73, line: 350, baseType: !805, size: 32, offset: 105792)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !624, file: !73, line: 353, baseType: !525, size: 64, offset: 105856)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !73, line: 356, size: 134336, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !845, !846, !847, !848, !849, !850, !852, !853, !854, !855, !856, !857, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !883, !884, !885}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !809, file: !73, line: 359, baseType: !631, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !809, file: !73, line: 362, baseType: !634, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !809, file: !73, line: 365, baseType: !617, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !809, file: !73, line: 366, baseType: !617, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !809, file: !73, line: 367, baseType: !617, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !809, file: !73, line: 368, baseType: !617, size: 32, offset: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !809, file: !73, line: 371, baseType: !564, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !809, file: !73, line: 372, baseType: !564, size: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !809, file: !73, line: 373, baseType: !564, size: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !809, file: !73, line: 374, baseType: !564, size: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !809, file: !73, line: 377, baseType: !525, size: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !809, file: !73, line: 378, baseType: !525, size: 64, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !809, file: !73, line: 379, baseType: !525, size: 64, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !809, file: !73, line: 382, baseType: !688, size: 32, offset: 640)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !809, file: !73, line: 385, baseType: !690, size: 32, offset: 672)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !809, file: !73, line: 388, baseType: !665, size: 32, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !809, file: !73, line: 391, baseType: !525, size: 64, offset: 768)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !809, file: !73, line: 394, baseType: !564, size: 64, offset: 832)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !809, file: !73, line: 395, baseType: !564, size: 64, offset: 896)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !809, file: !73, line: 396, baseType: !564, size: 64, offset: 960)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !809, file: !73, line: 397, baseType: !564, size: 64, offset: 1024)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !809, file: !73, line: 398, baseType: !564, size: 64, offset: 1088)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !809, file: !73, line: 401, baseType: !611, size: 64, offset: 1152)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !809, file: !73, line: 402, baseType: !611, size: 64, offset: 1216)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !809, file: !73, line: 405, baseType: !492, size: 64, offset: 1280)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !809, file: !73, line: 406, baseType: !492, size: 64, offset: 1344)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !809, file: !73, line: 407, baseType: !492, size: 64, offset: 1408)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !809, file: !73, line: 410, baseType: !617, size: 32, offset: 1472)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !809, file: !73, line: 411, baseType: !617, size: 32, offset: 1504)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !809, file: !73, line: 414, baseType: !525, size: 64, offset: 1536)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !809, file: !73, line: 417, baseType: !629, size: 32, offset: 1600)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !809, file: !73, line: 420, baseType: !795, size: 32, offset: 1632)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !809, file: !73, line: 423, baseType: !844, size: 32, offset: 1664)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !432, line: 59, baseType: !431)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !809, file: !73, line: 426, baseType: !529, size: 64, offset: 1728)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !809, file: !73, line: 429, baseType: !617, size: 32, offset: 1792)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !809, file: !73, line: 430, baseType: !617, size: 32, offset: 1824)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !809, file: !73, line: 433, baseType: !564, size: 64, offset: 1856)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !809, file: !73, line: 434, baseType: !564, size: 64, offset: 1920)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !809, file: !73, line: 437, baseType: !851, size: 32, offset: 1984)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !393)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !809, file: !73, line: 440, baseType: !622, size: 64, offset: 2048)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !809, file: !73, line: 443, baseType: !506, size: 64, offset: 2112)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !809, file: !73, line: 446, baseType: !612, size: 64, offset: 2176)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !809, file: !73, line: 449, baseType: !506, size: 64, offset: 2240)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !809, file: !73, line: 450, baseType: !506, size: 64, offset: 2304)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !809, file: !73, line: 453, baseType: !858, size: 64, offset: 2368)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !859, line: 26, baseType: !860)
!859 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!525, !863, !865, !867}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !809, file: !73, line: 456, baseType: !555, size: 64, offset: 2432)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !809, file: !73, line: 459, baseType: !506, size: 64, offset: 2496)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !809, file: !73, line: 462, baseType: !525, size: 64, offset: 2560)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !809, file: !73, line: 465, baseType: !740, size: 32768, offset: 2624)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !809, file: !73, line: 466, baseType: !740, size: 32768, offset: 35392)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !809, file: !73, line: 467, baseType: !740, size: 32768, offset: 68160)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !809, file: !73, line: 468, baseType: !740, size: 32768, offset: 100928)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !809, file: !73, line: 471, baseType: !617, size: 32, offset: 133696)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !809, file: !73, line: 474, baseType: !564, size: 64, offset: 133760)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !809, file: !73, line: 477, baseType: !525, size: 64, offset: 133824)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !809, file: !73, line: 478, baseType: !525, size: 64, offset: 133888)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !809, file: !73, line: 481, baseType: !492, size: 64, offset: 133952)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !809, file: !73, line: 484, baseType: !525, size: 64, offset: 134016)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !809, file: !73, line: 487, baseType: !882, size: 32, offset: 134080)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !465, line: 47, baseType: !464)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !809, file: !73, line: 490, baseType: !492, size: 64, offset: 134112)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !809, file: !73, line: 493, baseType: !506, size: 64, offset: 134208)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !809, file: !73, line: 496, baseType: !617, size: 32, offset: 134272)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !887)
!887 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!890 = !{i32 7, !"Dwarf Version", i32 5}
!891 = !{i32 2, !"Debug Info Version", i32 3}
!892 = !{i32 1, !"wchar_size", i32 4}
!893 = !{i32 7, !"PIC Level", i32 2}
!894 = !{i32 7, !"PIE Level", i32 2}
!895 = !{i32 7, !"uwtable", i32 2}
!896 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!897 = distinct !DISubprogram(name: "GetImageHistogram", scope: !509, file: !509, line: 526, type: !898, scopeLine: 528, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !902)
!898 = !DISubroutineType(types: !899)
!899 = !{!486, !863, !900, !901}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!902 = !{!903, !904, !905, !906, !907, !908}
!903 = !DILocalVariable(name: "image", arg: 1, scope: !897, file: !509, line: 526, type: !863)
!904 = !DILocalVariable(name: "number_colors", arg: 2, scope: !897, file: !509, line: 527, type: !900)
!905 = !DILocalVariable(name: "exception", arg: 3, scope: !897, file: !509, line: 527, type: !901)
!906 = !DILocalVariable(name: "histogram", scope: !897, file: !509, line: 530, type: !486)
!907 = !DILocalVariable(name: "cube_info", scope: !897, file: !509, line: 533, type: !507)
!908 = !DILocalVariable(name: "root", scope: !909, file: !509, line: 548, type: !486)
!909 = distinct !DILexicalBlock(scope: !910, file: !509, line: 546, column: 9)
!910 = distinct !DILexicalBlock(scope: !911, file: !509, line: 542, column: 11)
!911 = distinct !DILexicalBlock(scope: !912, file: !509, line: 539, column: 5)
!912 = distinct !DILexicalBlock(scope: !897, file: !509, line: 538, column: 7)
!913 = !DILocation(line: 0, scope: !897)
!914 = !DILocation(line: 535, column: 17, scope: !897)
!915 = !{!916, !916, i64 0}
!916 = !{!"long", !917, i64 0}
!917 = !{!"omnipotent char", !918, i64 0}
!918 = !{!"Simple C/C++ TBAA"}
!919 = !DILocation(line: 537, column: 13, scope: !897)
!920 = !DILocation(line: 538, column: 17, scope: !912)
!921 = !DILocation(line: 538, column: 7, scope: !897)
!922 = !DILocation(line: 540, column: 74, scope: !911)
!923 = !{!924, !916, i64 24}
!924 = !{!"_CubeInfo", !925, i64 0, !916, i64 8, !926, i64 16, !916, i64 24, !916, i64 32, !925, i64 40, !925, i64 48}
!925 = !{!"any pointer", !917, i64 0}
!926 = !{!"long long", !917, i64 0}
!927 = !DILocation(line: 540, column: 33, scope: !911)
!928 = !DILocation(line: 542, column: 21, scope: !910)
!929 = !DILocation(line: 542, column: 11, scope: !911)
!930 = !DILocation(line: 544, column: 69, scope: !910)
!931 = !DILocation(line: 543, column: 16, scope: !910)
!932 = !DILocation(line: 543, column: 9, scope: !910)
!933 = !DILocation(line: 547, column: 11, scope: !909)
!934 = !DILocation(line: 550, column: 37, scope: !909)
!935 = !DILocation(line: 550, column: 25, scope: !909)
!936 = !DILocation(line: 0, scope: !909)
!937 = !DILocation(line: 551, column: 15, scope: !909)
!938 = !{!925, !925, i64 0}
!939 = !DILocation(line: 552, column: 49, scope: !909)
!940 = !{!924, !925, i64 0}
!941 = !DILocation(line: 552, column: 11, scope: !909)
!942 = !DILocation(line: 553, column: 9, scope: !910)
!943 = !DILocalVariable(name: "image", arg: 1, scope: !944, file: !509, line: 392, type: !863)
!944 = distinct !DISubprogram(name: "DestroyCubeInfo", scope: !509, file: !509, line: 392, type: !945, scopeLine: 393, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !947)
!945 = !DISubroutineType(types: !946)
!946 = !{!507, !863, !507}
!947 = !{!943, !948, !949}
!948 = !DILocalVariable(name: "cube_info", arg: 2, scope: !944, file: !509, line: 392, type: !507)
!949 = !DILocalVariable(name: "nodes", scope: !944, file: !509, line: 395, type: !541)
!950 = !DILocation(line: 0, scope: !944, inlinedAt: !951)
!951 = distinct !DILocation(line: 555, column: 13, scope: !897)
!952 = !DILocation(line: 400, column: 37, scope: !944, inlinedAt: !951)
!953 = !DILocation(line: 400, column: 3, scope: !944, inlinedAt: !951)
!954 = !DILocation(line: 403, column: 22, scope: !955, inlinedAt: !951)
!955 = distinct !DILexicalBlock(scope: !944, file: !509, line: 402, column: 3)
!956 = !{!924, !925, i64 48}
!957 = !DILocation(line: 401, column: 3, scope: !944, inlinedAt: !951)
!958 = !DILocation(line: 403, column: 34, scope: !955, inlinedAt: !951)
!959 = !{!960, !925, i64 233472}
!960 = !{!"_Nodes", !917, i64 0, !925, i64 233472}
!961 = !DILocation(line: 405, column: 7, scope: !955, inlinedAt: !951)
!962 = !DILocation(line: 406, column: 26, scope: !955, inlinedAt: !951)
!963 = !DILocation(line: 407, column: 34, scope: !944, inlinedAt: !951)
!964 = !DILocation(line: 407, column: 3, scope: !955, inlinedAt: !951)
!965 = distinct !{!965, !957, !966, !967, !968}
!966 = !DILocation(line: 407, column: 51, scope: !944, inlinedAt: !951)
!967 = !{!"llvm.loop.mustprogress"}
!968 = !{!"llvm.loop.unroll.disable"}
!969 = !DILocation(line: 408, column: 23, scope: !944, inlinedAt: !951)
!970 = !DILocation(line: 556, column: 3, scope: !897)
!971 = distinct !DISubprogram(name: "ClassifyImageColors", scope: !509, file: !509, line: 175, type: !972, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !974)
!972 = !DISubroutineType(types: !973)
!973 = !{!507, !863, !901}
!974 = !{!975, !976, !977, !981, !982, !983, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!975 = !DILocalVariable(name: "image", arg: 1, scope: !971, file: !509, line: 175, type: !863)
!976 = !DILocalVariable(name: "exception", arg: 2, scope: !971, file: !509, line: 176, type: !901)
!977 = !DILocalVariable(name: "image_view", scope: !971, file: !509, line: 181, type: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !465, line: 50, baseType: !980)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!981 = !DILocalVariable(name: "cube_info", scope: !971, file: !509, line: 184, type: !507)
!982 = !DILocalVariable(name: "proceed", scope: !971, file: !509, line: 187, type: !617)
!983 = !DILocalVariable(name: "pixel", scope: !971, file: !509, line: 190, type: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !986)
!986 = !{!987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !985, file: !326, line: 107, baseType: !627, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !985, file: !326, line: 110, baseType: !629, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !985, file: !326, line: 113, baseType: !617, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !985, file: !326, line: 116, baseType: !611, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !985, file: !326, line: 119, baseType: !525, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !985, file: !326, line: 122, baseType: !886, size: 32, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !985, file: !326, line: 123, baseType: !886, size: 32, offset: 288)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !985, file: !326, line: 124, baseType: !886, size: 32, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !985, file: !326, line: 125, baseType: !886, size: 32, offset: 352)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !985, file: !326, line: 126, baseType: !886, size: 32, offset: 384)
!997 = !DILocalVariable(name: "target", scope: !971, file: !509, line: 191, type: !984)
!998 = !DILocalVariable(name: "node_info", scope: !971, file: !509, line: 194, type: !513)
!999 = !DILocalVariable(name: "indexes", scope: !971, file: !509, line: 197, type: !553)
!1000 = !DILocalVariable(name: "p", scope: !971, file: !509, line: 200, type: !551)
!1001 = !DILocalVariable(name: "id", scope: !971, file: !509, line: 203, type: !525)
!1002 = !DILocalVariable(name: "index", scope: !971, file: !509, line: 204, type: !525)
!1003 = !DILocalVariable(name: "level", scope: !971, file: !509, line: 205, type: !525)
!1004 = !DILocalVariable(name: "i", scope: !971, file: !509, line: 208, type: !529)
!1005 = !DILocalVariable(name: "x", scope: !971, file: !509, line: 209, type: !529)
!1006 = !DILocalVariable(name: "y", scope: !971, file: !509, line: 212, type: !529)
!1007 = !DILocation(line: 0, scope: !971)
!1008 = !DILocation(line: 189, column: 3, scope: !971)
!1009 = !DILocation(line: 190, column: 5, scope: !971)
!1010 = !DILocation(line: 191, column: 5, scope: !971)
!1011 = !DILocation(line: 219, column: 14, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !971, file: !509, line: 219, column: 7)
!1013 = !{!1014, !917, i64 12976}
!1014 = !{!"_Image", !917, i64 0, !917, i64 4, !917, i64 8, !916, i64 16, !917, i64 24, !917, i64 28, !917, i64 32, !916, i64 40, !916, i64 48, !916, i64 56, !916, i64 64, !925, i64 72, !1015, i64 80, !1015, i64 88, !1015, i64 96, !1017, i64 104, !1018, i64 112, !917, i64 208, !925, i64 216, !917, i64 224, !925, i64 232, !925, i64 240, !925, i64 248, !916, i64 256, !1017, i64 264, !1017, i64 272, !1020, i64 280, !1020, i64 312, !1020, i64 344, !1017, i64 376, !1017, i64 384, !1017, i64 392, !917, i64 400, !917, i64 404, !917, i64 408, !917, i64 412, !917, i64 416, !917, i64 420, !925, i64 424, !916, i64 432, !916, i64 440, !916, i64 448, !916, i64 456, !916, i64 464, !916, i64 472, !1021, i64 480, !1022, i64 504, !925, i64 568, !925, i64 576, !925, i64 584, !925, i64 592, !925, i64 600, !925, i64 608, !917, i64 616, !917, i64 4712, !917, i64 8808, !916, i64 12904, !916, i64 12912, !1024, i64 12920, !917, i64 12976, !916, i64 12984, !925, i64 12992, !1026, i64 13000, !1026, i64 13032, !925, i64 13064, !916, i64 13072, !916, i64 13080, !925, i64 13088, !925, i64 13096, !925, i64 13104, !917, i64 13112, !917, i64 13116, !1015, i64 13120, !925, i64 13128, !1020, i64 13136, !925, i64 13168, !925, i64 13176, !917, i64 13184, !917, i64 13188, !926, i64 13192, !917, i64 13200, !916, i64 13208, !916, i64 13216, !917, i64 13224, !916, i64 13232}
!1015 = !{!"_PixelPacket", !1016, i64 0, !1016, i64 2, !1016, i64 4, !1016, i64 6}
!1016 = !{!"short", !917, i64 0}
!1017 = !{!"double", !917, i64 0}
!1018 = !{!"_ChromaticityInfo", !1019, i64 0, !1019, i64 24, !1019, i64 48, !1019, i64 72}
!1019 = !{!"_PrimaryInfo", !1017, i64 0, !1017, i64 8, !1017, i64 16}
!1020 = !{!"_RectangleInfo", !916, i64 0, !916, i64 8, !916, i64 16, !916, i64 24}
!1021 = !{!"_ErrorInfo", !1017, i64 0, !1017, i64 8, !1017, i64 16}
!1022 = !{!"_TimerInfo", !1023, i64 0, !1023, i64 24, !917, i64 48, !916, i64 56}
!1023 = !{!"_Timer", !1017, i64 0, !1017, i64 8, !1017, i64 16}
!1024 = !{!"_ExceptionInfo", !917, i64 0, !1025, i64 4, !925, i64 8, !925, i64 16, !925, i64 24, !917, i64 32, !925, i64 40, !916, i64 48}
!1025 = !{!"int", !917, i64 0}
!1026 = !{!"_ProfileInfo", !925, i64 0, !916, i64 8, !925, i64 16, !916, i64 24}
!1027 = !DILocation(line: 219, column: 20, scope: !1012)
!1028 = !DILocation(line: 219, column: 7, scope: !971)
!1029 = !DILocation(line: 220, column: 68, scope: !1012)
!1030 = !DILocation(line: 220, column: 12, scope: !1012)
!1031 = !DILocation(line: 220, column: 5, scope: !1012)
!1032 = !DILocation(line: 486, column: 26, scope: !1033, inlinedAt: !1038)
!1033 = distinct !DISubprogram(name: "GetCubeInfo", scope: !509, file: !509, line: 478, type: !1034, scopeLine: 479, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1036)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!507}
!1036 = !{!1037}
!1037 = !DILocalVariable(name: "cube_info", scope: !1033, file: !509, line: 481, type: !507)
!1038 = distinct !DILocation(line: 221, column: 13, scope: !971)
!1039 = !DILocation(line: 0, scope: !1033, inlinedAt: !1038)
!1040 = !DILocation(line: 487, column: 17, scope: !1041, inlinedAt: !1038)
!1041 = distinct !DILexicalBlock(scope: !1033, file: !509, line: 487, column: 7)
!1042 = !DILocation(line: 487, column: 7, scope: !1033, inlinedAt: !1038)
!1043 = !DILocation(line: 489, column: 10, scope: !1033, inlinedAt: !1038)
!1044 = !DILocalVariable(name: "cube_info", arg: 1, scope: !1045, file: !509, line: 584, type: !507)
!1045 = distinct !DISubprogram(name: "GetNodeInfo", scope: !509, file: !509, line: 584, type: !1046, scopeLine: 585, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1048)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!513, !507, !867}
!1048 = !{!1044, !1049, !1050, !1051}
!1049 = !DILocalVariable(name: "level", arg: 2, scope: !1045, file: !509, line: 584, type: !867)
!1050 = !DILocalVariable(name: "node_info", scope: !1045, file: !509, line: 587, type: !513)
!1051 = !DILocalVariable(name: "nodes", scope: !1052, file: !509, line: 592, type: !541)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !509, line: 590, column: 5)
!1053 = distinct !DILexicalBlock(scope: !1045, file: !509, line: 589, column: 7)
!1054 = !DILocation(line: 0, scope: !1045, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 493, column: 19, scope: !1033, inlinedAt: !1038)
!1056 = !DILocation(line: 589, column: 18, scope: !1053, inlinedAt: !1055)
!1057 = !{!924, !916, i64 32}
!1058 = !DILocation(line: 589, column: 29, scope: !1053, inlinedAt: !1055)
!1059 = !DILocation(line: 589, column: 7, scope: !1045, inlinedAt: !1055)
!1060 = !DILocation(line: 606, column: 33, scope: !1045, inlinedAt: !1055)
!1061 = !{!924, !925, i64 40}
!1062 = !DILocation(line: 597, column: 23, scope: !1052, inlinedAt: !1055)
!1063 = !DILocation(line: 0, scope: !1052, inlinedAt: !1055)
!1064 = !DILocation(line: 598, column: 17, scope: !1065, inlinedAt: !1055)
!1065 = distinct !DILexicalBlock(scope: !1052, file: !509, line: 598, column: 11)
!1066 = !DILocation(line: 598, column: 11, scope: !1052, inlinedAt: !1055)
!1067 = !DILocation(line: 600, column: 30, scope: !1052, inlinedAt: !1055)
!1068 = !DILocation(line: 600, column: 14, scope: !1052, inlinedAt: !1055)
!1069 = !DILocation(line: 600, column: 18, scope: !1052, inlinedAt: !1055)
!1070 = !DILocation(line: 601, column: 28, scope: !1052, inlinedAt: !1055)
!1071 = !DILocation(line: 493, column: 18, scope: !1033, inlinedAt: !1038)
!1072 = !DILocation(line: 225, column: 67, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1074, file: !509, line: 223, column: 5)
!1074 = distinct !DILexicalBlock(scope: !971, file: !509, line: 222, column: 7)
!1075 = !DILocation(line: 224, column: 14, scope: !1073)
!1076 = !DILocation(line: 226, column: 7, scope: !1073)
!1077 = !DILocation(line: 605, column: 24, scope: !1045, inlinedAt: !1055)
!1078 = !DILocation(line: 606, column: 24, scope: !1045, inlinedAt: !1055)
!1079 = !DILocation(line: 607, column: 10, scope: !1045, inlinedAt: !1055)
!1080 = !DILocation(line: 608, column: 14, scope: !1045, inlinedAt: !1055)
!1081 = !DILocation(line: 608, column: 19, scope: !1045, inlinedAt: !1055)
!1082 = !{!1083, !916, i64 144}
!1083 = !{!"_NodeInfo", !917, i64 0, !925, i64 128, !926, i64 136, !916, i64 144}
!1084 = !DILocation(line: 228, column: 3, scope: !971)
!1085 = !DILocation(line: 229, column: 3, scope: !971)
!1086 = !DILocation(line: 230, column: 14, scope: !971)
!1087 = !DILocation(line: 231, column: 34, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !509, line: 231, column: 3)
!1089 = distinct !DILexicalBlock(scope: !971, file: !509, line: 231, column: 3)
!1090 = !{!1014, !916, i64 48}
!1091 = !DILocation(line: 231, column: 15, scope: !1088)
!1092 = !DILocation(line: 231, column: 3, scope: !1089)
!1093 = !DILocation(line: 233, column: 55, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1088, file: !509, line: 232, column: 3)
!1095 = !{!1014, !916, i64 40}
!1096 = !DILocation(line: 233, column: 7, scope: !1094)
!1097 = !DILocation(line: 234, column: 11, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1094, file: !509, line: 234, column: 9)
!1099 = !DILocation(line: 234, column: 9, scope: !1094)
!1100 = !DILocation(line: 236, column: 13, scope: !1094)
!1101 = !DILocation(line: 237, column: 36, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !509, line: 237, column: 5)
!1103 = distinct !DILexicalBlock(scope: !1094, file: !509, line: 237, column: 5)
!1104 = !DILocation(line: 237, column: 17, scope: !1102)
!1105 = !DILocation(line: 237, column: 5, scope: !1103)
!1106 = !DILocation(line: 0, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1102, file: !509, line: 238, column: 5)
!1108 = !DILocation(line: 244, column: 7, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1107, file: !509, line: 244, column: 7)
!1110 = !{!1083, !926, i64 136}
!1111 = !DILocation(line: 262, column: 19, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !509, line: 262, column: 7)
!1113 = distinct !DILexicalBlock(scope: !1107, file: !509, line: 262, column: 7)
!1114 = !DILocation(line: 262, column: 7, scope: !1113)
!1115 = !{!1083, !925, i64 128}
!1116 = !{!1014, !917, i64 4}
!1117 = !{!1118, !917, i64 8}
!1118 = !{!"_MagickPixelPacket", !917, i64 0, !917, i64 4, !917, i64 8, !1017, i64 16, !916, i64 24, !1119, i64 32, !1119, i64 36, !1119, i64 40, !1119, i64 44, !1119, i64 48}
!1119 = !{!"float", !917, i64 0}
!1120 = !{!1118, !1119, i64 48}
!1121 = !DILocation(line: 246, column: 9, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1123, file: !509, line: 245, column: 7)
!1123 = distinct !DILexicalBlock(scope: !1109, file: !509, line: 244, column: 7)
!1124 = !DILocalVariable(name: "image", arg: 1, scope: !1125, file: !1126, line: 92, type: !863)
!1125 = distinct !DISubprogram(name: "SetMagickPixelPacket", scope: !1126, file: !1126, line: 92, type: !1127, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1130)
!1126 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d0543784df06457407bc99b9890f8aaf")
!1127 = !DISubroutineType(types: !1128)
!1128 = !{null, !863, !551, !553, !1129}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!1130 = !{!1124, !1131, !1132, !1133}
!1131 = !DILocalVariable(name: "color", arg: 2, scope: !1125, file: !1126, line: 93, type: !551)
!1132 = !DILocalVariable(name: "index", arg: 3, scope: !1125, file: !1126, line: 93, type: !553)
!1133 = !DILocalVariable(name: "pixel", arg: 4, scope: !1125, file: !1126, line: 93, type: !1129)
!1134 = !DILocation(line: 0, scope: !1125, inlinedAt: !1135)
!1135 = distinct !DILocation(line: 246, column: 9, scope: !1122)
!1136 = !DILocation(line: 95, column: 31, scope: !1125, inlinedAt: !1135)
!1137 = !{!1015, !1016, i64 4}
!1138 = !DILocation(line: 95, column: 14, scope: !1125, inlinedAt: !1135)
!1139 = !DILocation(line: 95, column: 13, scope: !1125, inlinedAt: !1135)
!1140 = !{!1118, !1119, i64 32}
!1141 = !DILocation(line: 96, column: 33, scope: !1125, inlinedAt: !1135)
!1142 = !{!1015, !1016, i64 2}
!1143 = !DILocation(line: 96, column: 16, scope: !1125, inlinedAt: !1135)
!1144 = !DILocation(line: 96, column: 15, scope: !1125, inlinedAt: !1135)
!1145 = !{!1118, !1119, i64 36}
!1146 = !DILocation(line: 97, column: 32, scope: !1125, inlinedAt: !1135)
!1147 = !{!1015, !1016, i64 0}
!1148 = !DILocation(line: 97, column: 15, scope: !1125, inlinedAt: !1135)
!1149 = !DILocation(line: 97, column: 14, scope: !1125, inlinedAt: !1135)
!1150 = !{!1118, !1119, i64 40}
!1151 = !DILocation(line: 98, column: 35, scope: !1125, inlinedAt: !1135)
!1152 = !{!1015, !1016, i64 6}
!1153 = !DILocation(line: 98, column: 18, scope: !1125, inlinedAt: !1135)
!1154 = !DILocation(line: 98, column: 17, scope: !1125, inlinedAt: !1135)
!1155 = !{!1118, !1119, i64 44}
!1156 = !DILocation(line: 99, column: 26, scope: !1157, inlinedAt: !1135)
!1157 = distinct !DILexicalBlock(scope: !1125, file: !1126, line: 99, column: 7)
!1158 = !DILocation(line: 99, column: 45, scope: !1157, inlinedAt: !1135)
!1159 = !DILocation(line: 101, column: 35, scope: !1157, inlinedAt: !1135)
!1160 = !{!1016, !1016, i64 0}
!1161 = !DILocation(line: 101, column: 18, scope: !1157, inlinedAt: !1135)
!1162 = !DILocation(line: 101, column: 17, scope: !1157, inlinedAt: !1135)
!1163 = !DILocation(line: 101, column: 5, scope: !1157, inlinedAt: !1135)
!1164 = !DILocalVariable(name: "image", arg: 1, scope: !1165, file: !509, line: 159, type: !863)
!1165 = distinct !DISubprogram(name: "ColorToNodeId", scope: !509, file: !509, line: 159, type: !1166, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1170)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!525, !863, !1168, !525}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1170 = !{!1164, !1171, !1172, !1173}
!1171 = !DILocalVariable(name: "pixel", arg: 2, scope: !1165, file: !509, line: 160, type: !1168)
!1172 = !DILocalVariable(name: "index", arg: 3, scope: !1165, file: !509, line: 160, type: !525)
!1173 = !DILocalVariable(name: "id", scope: !1165, file: !509, line: 163, type: !525)
!1174 = !DILocation(line: 0, scope: !1165, inlinedAt: !1175)
!1175 = distinct !DILocation(line: 247, column: 12, scope: !1122)
!1176 = !DILocalVariable(name: "value", arg: 1, scope: !1177, file: !147, line: 87, type: !1180)
!1177 = distinct !DISubprogram(name: "ClampToQuantum", scope: !147, file: !147, line: 87, type: !1178, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1181)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!496, !1180}
!1180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!1181 = !{!1176}
!1182 = !DILocation(line: 0, scope: !1177, inlinedAt: !1183)
!1183 = distinct !DILocation(line: 166, column: 26, scope: !1165, inlinedAt: !1175)
!1184 = !DILocation(line: 92, column: 7, scope: !1177, inlinedAt: !1183)
!1185 = !DILocation(line: 96, column: 26, scope: !1177, inlinedAt: !1183)
!1186 = !DILocation(line: 96, column: 10, scope: !1177, inlinedAt: !1183)
!1187 = !DILocation(line: 96, column: 3, scope: !1177, inlinedAt: !1183)
!1188 = !DILocation(line: 117, column: 61, scope: !1189, inlinedAt: !1195)
!1189 = distinct !DISubprogram(name: "ScaleQuantumToChar", scope: !147, file: !147, line: 114, type: !1190, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1193)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!776, !1192}
!1192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!1193 = !{!1194}
!1194 = !DILocalVariable(name: "quantum", arg: 1, scope: !1189, file: !147, line: 114, type: !1192)
!1195 = distinct !DILocation(line: 166, column: 7, scope: !1165, inlinedAt: !1175)
!1196 = !DILocation(line: 0, scope: !1189, inlinedAt: !1195)
!1197 = !DILocation(line: 117, column: 43, scope: !1189, inlinedAt: !1195)
!1198 = !DILocation(line: 117, column: 10, scope: !1189, inlinedAt: !1195)
!1199 = !DILocation(line: 166, column: 7, scope: !1165, inlinedAt: !1175)
!1200 = !DILocation(line: 166, column: 54, scope: !1165, inlinedAt: !1175)
!1201 = !DILocation(line: 166, column: 64, scope: !1165, inlinedAt: !1175)
!1202 = !DILocation(line: 0, scope: !1177, inlinedAt: !1203)
!1203 = distinct !DILocation(line: 167, column: 26, scope: !1165, inlinedAt: !1175)
!1204 = !DILocation(line: 92, column: 7, scope: !1177, inlinedAt: !1203)
!1205 = !DILocation(line: 96, column: 26, scope: !1177, inlinedAt: !1203)
!1206 = !DILocation(line: 96, column: 10, scope: !1177, inlinedAt: !1203)
!1207 = !DILocation(line: 96, column: 3, scope: !1177, inlinedAt: !1203)
!1208 = !DILocation(line: 117, column: 61, scope: !1189, inlinedAt: !1209)
!1209 = distinct !DILocation(line: 167, column: 7, scope: !1165, inlinedAt: !1175)
!1210 = !DILocation(line: 0, scope: !1189, inlinedAt: !1209)
!1211 = !DILocation(line: 117, column: 43, scope: !1189, inlinedAt: !1209)
!1212 = !DILocation(line: 117, column: 10, scope: !1189, inlinedAt: !1209)
!1213 = !DILocation(line: 167, column: 7, scope: !1165, inlinedAt: !1175)
!1214 = !DILocation(line: 167, column: 56, scope: !1165, inlinedAt: !1175)
!1215 = !DILocation(line: 167, column: 74, scope: !1165, inlinedAt: !1175)
!1216 = !DILocation(line: 166, column: 72, scope: !1165, inlinedAt: !1175)
!1217 = !DILocation(line: 0, scope: !1177, inlinedAt: !1218)
!1218 = distinct !DILocation(line: 168, column: 26, scope: !1165, inlinedAt: !1175)
!1219 = !DILocation(line: 92, column: 7, scope: !1177, inlinedAt: !1218)
!1220 = !DILocation(line: 96, column: 26, scope: !1177, inlinedAt: !1218)
!1221 = !DILocation(line: 96, column: 10, scope: !1177, inlinedAt: !1218)
!1222 = !DILocation(line: 96, column: 3, scope: !1177, inlinedAt: !1218)
!1223 = !DILocation(line: 117, column: 61, scope: !1189, inlinedAt: !1224)
!1224 = distinct !DILocation(line: 168, column: 7, scope: !1165, inlinedAt: !1175)
!1225 = !DILocation(line: 0, scope: !1189, inlinedAt: !1224)
!1226 = !DILocation(line: 117, column: 43, scope: !1189, inlinedAt: !1224)
!1227 = !DILocation(line: 117, column: 10, scope: !1189, inlinedAt: !1224)
!1228 = !DILocation(line: 168, column: 7, scope: !1165, inlinedAt: !1175)
!1229 = !DILocation(line: 168, column: 55, scope: !1165, inlinedAt: !1175)
!1230 = !DILocation(line: 168, column: 73, scope: !1165, inlinedAt: !1175)
!1231 = !DILocation(line: 167, column: 79, scope: !1165, inlinedAt: !1175)
!1232 = !DILocation(line: 169, column: 14, scope: !1233, inlinedAt: !1175)
!1233 = distinct !DILexicalBlock(scope: !1165, file: !509, line: 169, column: 7)
!1234 = !{!1014, !917, i64 32}
!1235 = !DILocation(line: 169, column: 20, scope: !1233, inlinedAt: !1175)
!1236 = !DILocation(line: 169, column: 7, scope: !1165, inlinedAt: !1175)
!1237 = !DILocation(line: 0, scope: !1177, inlinedAt: !1238)
!1238 = distinct !DILocation(line: 170, column: 30, scope: !1233, inlinedAt: !1175)
!1239 = !DILocation(line: 92, column: 7, scope: !1177, inlinedAt: !1238)
!1240 = !DILocation(line: 96, column: 26, scope: !1177, inlinedAt: !1238)
!1241 = !DILocation(line: 96, column: 10, scope: !1177, inlinedAt: !1238)
!1242 = !DILocation(line: 96, column: 3, scope: !1177, inlinedAt: !1238)
!1243 = !DILocation(line: 117, column: 61, scope: !1189, inlinedAt: !1244)
!1244 = distinct !DILocation(line: 170, column: 11, scope: !1233, inlinedAt: !1175)
!1245 = !DILocation(line: 0, scope: !1189, inlinedAt: !1244)
!1246 = !DILocation(line: 117, column: 43, scope: !1189, inlinedAt: !1244)
!1247 = !DILocation(line: 117, column: 10, scope: !1189, inlinedAt: !1244)
!1248 = !DILocation(line: 170, column: 11, scope: !1233, inlinedAt: !1175)
!1249 = !DILocation(line: 170, column: 62, scope: !1233, inlinedAt: !1175)
!1250 = !DILocation(line: 171, column: 13, scope: !1233, inlinedAt: !1175)
!1251 = !DILocation(line: 170, column: 7, scope: !1233, inlinedAt: !1175)
!1252 = !DILocation(line: 170, column: 5, scope: !1233, inlinedAt: !1175)
!1253 = !DILocation(line: 248, column: 13, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1122, file: !509, line: 248, column: 13)
!1255 = !DILocation(line: 248, column: 34, scope: !1254)
!1256 = !DILocation(line: 248, column: 13, scope: !1122)
!1257 = !DILocation(line: 0, scope: !1045, inlinedAt: !1258)
!1258 = distinct !DILocation(line: 250, column: 34, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1254, file: !509, line: 249, column: 11)
!1260 = !DILocation(line: 589, column: 18, scope: !1053, inlinedAt: !1258)
!1261 = !DILocation(line: 589, column: 29, scope: !1053, inlinedAt: !1258)
!1262 = !DILocation(line: 589, column: 7, scope: !1045, inlinedAt: !1258)
!1263 = !DILocation(line: 606, column: 33, scope: !1045, inlinedAt: !1258)
!1264 = !DILocation(line: 597, column: 23, scope: !1052, inlinedAt: !1258)
!1265 = !DILocation(line: 0, scope: !1052, inlinedAt: !1258)
!1266 = !DILocation(line: 598, column: 17, scope: !1065, inlinedAt: !1258)
!1267 = !DILocation(line: 598, column: 11, scope: !1052, inlinedAt: !1258)
!1268 = !DILocation(line: 600, column: 30, scope: !1052, inlinedAt: !1258)
!1269 = !DILocation(line: 600, column: 14, scope: !1052, inlinedAt: !1258)
!1270 = !DILocation(line: 600, column: 18, scope: !1052, inlinedAt: !1258)
!1271 = !DILocation(line: 601, column: 28, scope: !1052, inlinedAt: !1258)
!1272 = !DILocation(line: 605, column: 24, scope: !1045, inlinedAt: !1258)
!1273 = !DILocation(line: 607, column: 10, scope: !1045, inlinedAt: !1258)
!1274 = !DILocation(line: 608, column: 14, scope: !1045, inlinedAt: !1258)
!1275 = !DILocation(line: 608, column: 19, scope: !1045, inlinedAt: !1258)
!1276 = !DILocation(line: 250, column: 33, scope: !1259)
!1277 = !DILocation(line: 251, column: 17, scope: !1259)
!1278 = !DILocation(line: 253, column: 24, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1280, file: !509, line: 252, column: 15)
!1280 = distinct !DILexicalBlock(scope: !1259, file: !509, line: 251, column: 17)
!1281 = !DILocation(line: 256, column: 17, scope: !1279)
!1282 = !DILocation(line: 260, column: 14, scope: !1122)
!1283 = !DILocation(line: 244, column: 48, scope: !1123)
!1284 = !DILocation(line: 244, column: 27, scope: !1123)
!1285 = distinct !{!1285, !1108, !1286, !967, !968}
!1286 = !DILocation(line: 261, column: 7, scope: !1109)
!1287 = !DILocation(line: 264, column: 37, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1112, file: !509, line: 263, column: 7)
!1289 = !DILocation(line: 0, scope: !1125, inlinedAt: !1290)
!1290 = distinct !DILocation(line: 264, column: 9, scope: !1288)
!1291 = !DILocation(line: 95, column: 31, scope: !1125, inlinedAt: !1290)
!1292 = !DILocation(line: 95, column: 14, scope: !1125, inlinedAt: !1290)
!1293 = !DILocation(line: 96, column: 33, scope: !1125, inlinedAt: !1290)
!1294 = !DILocation(line: 96, column: 16, scope: !1125, inlinedAt: !1290)
!1295 = !DILocation(line: 97, column: 32, scope: !1125, inlinedAt: !1290)
!1296 = !DILocation(line: 97, column: 15, scope: !1125, inlinedAt: !1290)
!1297 = !DILocation(line: 98, column: 35, scope: !1125, inlinedAt: !1290)
!1298 = !DILocation(line: 98, column: 18, scope: !1125, inlinedAt: !1290)
!1299 = !DILocation(line: 99, column: 45, scope: !1157, inlinedAt: !1290)
!1300 = !DILocation(line: 265, column: 31, scope: !1288)
!1301 = !DILocation(line: 101, column: 35, scope: !1157, inlinedAt: !1290)
!1302 = !DILocation(line: 101, column: 18, scope: !1157, inlinedAt: !1290)
!1303 = !DILocation(line: 101, column: 17, scope: !1157, inlinedAt: !1290)
!1304 = !DILocation(line: 101, column: 5, scope: !1157, inlinedAt: !1290)
!1305 = !DILocalVariable(name: "p", arg: 1, scope: !1306, file: !1307, line: 48, type: !1168)
!1306 = distinct !DISubprogram(name: "IsMagickColorEqual", scope: !1307, file: !1307, line: 48, type: !1308, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1310)
!1307 = !DIFile(filename: "apps/538.imagick_r/src/magick/color-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1d5db1c576095b1d3349b678b2a970e8")
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!617, !1168, !1168}
!1310 = !{!1305, !1311}
!1311 = !DILocalVariable(name: "q", arg: 2, scope: !1306, file: !1307, line: 49, type: !1168)
!1312 = !DILocation(line: 0, scope: !1306, inlinedAt: !1313)
!1313 = distinct !DILocation(line: 266, column: 13, scope: !1314)
!1314 = distinct !DILexicalBlock(scope: !1288, file: !509, line: 266, column: 13)
!1315 = !DILocation(line: 51, column: 33, scope: !1316, inlinedAt: !1313)
!1316 = distinct !DILexicalBlock(scope: !1306, file: !1307, line: 51, column: 7)
!1317 = !DILocation(line: 51, column: 62, scope: !1316, inlinedAt: !1313)
!1318 = !DILocation(line: 51, column: 7, scope: !1306, inlinedAt: !1313)
!1319 = !DILocation(line: 54, column: 33, scope: !1320, inlinedAt: !1313)
!1320 = distinct !DILexicalBlock(scope: !1306, file: !1307, line: 54, column: 7)
!1321 = !DILocation(line: 59, column: 26, scope: !1322, inlinedAt: !1313)
!1322 = distinct !DILexicalBlock(scope: !1323, file: !1307, line: 59, column: 11)
!1323 = distinct !DILexicalBlock(scope: !1324, file: !1307, line: 58, column: 5)
!1324 = distinct !DILexicalBlock(scope: !1306, file: !1307, line: 57, column: 7)
!1325 = !DILocation(line: 59, column: 11, scope: !1322, inlinedAt: !1313)
!1326 = !DILocation(line: 59, column: 39, scope: !1322, inlinedAt: !1313)
!1327 = !DILocation(line: 59, column: 11, scope: !1323, inlinedAt: !1313)
!1328 = !DILocation(line: 61, column: 11, scope: !1323, inlinedAt: !1313)
!1329 = !DILocation(line: 64, column: 18, scope: !1330, inlinedAt: !1313)
!1330 = distinct !DILexicalBlock(scope: !1306, file: !1307, line: 64, column: 7)
!1331 = !DILocation(line: 64, column: 7, scope: !1330, inlinedAt: !1313)
!1332 = !DILocation(line: 64, column: 27, scope: !1330, inlinedAt: !1313)
!1333 = !DILocation(line: 64, column: 7, scope: !1306, inlinedAt: !1313)
!1334 = !DILocation(line: 66, column: 20, scope: !1335, inlinedAt: !1313)
!1335 = distinct !DILexicalBlock(scope: !1306, file: !1307, line: 66, column: 7)
!1336 = !DILocation(line: 66, column: 7, scope: !1335, inlinedAt: !1313)
!1337 = !DILocation(line: 66, column: 31, scope: !1335, inlinedAt: !1313)
!1338 = !DILocation(line: 66, column: 7, scope: !1306, inlinedAt: !1313)
!1339 = !DILocation(line: 68, column: 19, scope: !1340, inlinedAt: !1313)
!1340 = distinct !DILexicalBlock(scope: !1306, file: !1307, line: 68, column: 7)
!1341 = !DILocation(line: 68, column: 7, scope: !1340, inlinedAt: !1313)
!1342 = !DILocation(line: 68, column: 29, scope: !1340, inlinedAt: !1313)
!1343 = !DILocation(line: 68, column: 7, scope: !1306, inlinedAt: !1313)
!1344 = !DILocation(line: 70, column: 41, scope: !1345, inlinedAt: !1313)
!1345 = distinct !DILexicalBlock(scope: !1306, file: !1307, line: 70, column: 7)
!1346 = !DILocation(line: 71, column: 21, scope: !1345, inlinedAt: !1313)
!1347 = !DILocation(line: 71, column: 8, scope: !1345, inlinedAt: !1313)
!1348 = !DILocation(line: 71, column: 32, scope: !1345, inlinedAt: !1313)
!1349 = !DILocation(line: 70, column: 7, scope: !1306, inlinedAt: !1313)
!1350 = !DILocation(line: 262, column: 58, scope: !1112)
!1351 = distinct !{!1351, !1114, !1352, !967, !968}
!1352 = !DILocation(line: 268, column: 7, scope: !1113)
!1353 = !DILocation(line: 95, column: 13, scope: !1125, inlinedAt: !1290)
!1354 = !DILocation(line: 96, column: 15, scope: !1125, inlinedAt: !1290)
!1355 = !DILocation(line: 97, column: 14, scope: !1125, inlinedAt: !1290)
!1356 = !DILocation(line: 98, column: 17, scope: !1125, inlinedAt: !1290)
!1357 = !DILocation(line: 270, column: 28, scope: !1358)
!1358 = distinct !DILexicalBlock(scope: !1107, file: !509, line: 269, column: 11)
!1359 = !DILocation(line: 270, column: 9, scope: !1358)
!1360 = !DILocation(line: 0, scope: !1113)
!1361 = !DILocation(line: 273, column: 40, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1363, file: !509, line: 273, column: 15)
!1363 = distinct !DILexicalBlock(scope: !1358, file: !509, line: 272, column: 9)
!1364 = !DILocation(line: 273, column: 15, scope: !1363)
!1365 = !DILocation(line: 274, column: 45, scope: !1362)
!1366 = !DILocation(line: 274, column: 24, scope: !1362)
!1367 = !DILocation(line: 274, column: 28, scope: !1362)
!1368 = !DILocation(line: 274, column: 13, scope: !1362)
!1369 = !DILocation(line: 277, column: 76, scope: !1362)
!1370 = !DILocation(line: 278, column: 26, scope: !1362)
!1371 = !DILocation(line: 277, column: 45, scope: !1362)
!1372 = !DILocation(line: 277, column: 28, scope: !1362)
!1373 = !DILocation(line: 279, column: 26, scope: !1374)
!1374 = distinct !DILexicalBlock(scope: !1363, file: !509, line: 279, column: 15)
!1375 = !DILocation(line: 279, column: 31, scope: !1374)
!1376 = !DILocation(line: 279, column: 15, scope: !1363)
!1377 = !DILocation(line: 281, column: 22, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1374, file: !509, line: 280, column: 13)
!1379 = !DILocation(line: 284, column: 15, scope: !1378)
!1380 = !DILocation(line: 286, column: 11, scope: !1363)
!1381 = !DILocation(line: 286, column: 37, scope: !1363)
!1382 = !DILocation(line: 287, column: 23, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1363, file: !509, line: 287, column: 15)
!1384 = !DILocation(line: 287, column: 34, scope: !1383)
!1385 = !DILocation(line: 287, column: 53, scope: !1383)
!1386 = !DILocation(line: 288, column: 23, scope: !1383)
!1387 = !{!1014, !917, i64 0}
!1388 = !DILocation(line: 288, column: 37, scope: !1383)
!1389 = !DILocation(line: 287, column: 15, scope: !1363)
!1390 = !DILocation(line: 290, column: 22, scope: !1363)
!1391 = !DILocation(line: 289, column: 38, scope: !1383)
!1392 = !DILocation(line: 289, column: 24, scope: !1383)
!1393 = !DILocation(line: 289, column: 32, scope: !1383)
!1394 = !DILocation(line: 289, column: 37, scope: !1383)
!1395 = !{!1396, !1016, i64 8}
!1396 = !{!"_ColorPacket", !1015, i64 0, !1016, i64 8, !926, i64 16}
!1397 = !DILocation(line: 289, column: 13, scope: !1383)
!1398 = !DILocation(line: 290, column: 30, scope: !1363)
!1399 = !DILocation(line: 290, column: 35, scope: !1363)
!1400 = !{!1396, !926, i64 16}
!1401 = !DILocation(line: 291, column: 35, scope: !1363)
!1402 = !DILocation(line: 0, scope: !1358)
!1403 = !{!917, !917, i64 0}
!1404 = !DILocation(line: 294, column: 8, scope: !1107)
!1405 = !DILocation(line: 237, column: 46, scope: !1102)
!1406 = distinct !{!1406, !1105, !1407, !967, !968}
!1407 = !DILocation(line: 295, column: 5, scope: !1103)
!1408 = !DILocation(line: 297, column: 14, scope: !1094)
!1409 = !DILocalVariable(name: "image", arg: 1, scope: !1410, file: !1411, line: 27, type: !863)
!1410 = distinct !DISubprogram(name: "SetImageProgress", scope: !1411, file: !1411, line: 27, type: !1412, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1414)
!1411 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a84e9021f92665a913f9cbc20a804774")
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!617, !863, !618, !620, !621}
!1414 = !{!1409, !1415, !1416, !1417, !1418}
!1415 = !DILocalVariable(name: "tag", arg: 2, scope: !1410, file: !1411, line: 28, type: !618)
!1416 = !DILocalVariable(name: "offset", arg: 3, scope: !1410, file: !1411, line: 28, type: !620)
!1417 = !DILocalVariable(name: "extent", arg: 4, scope: !1410, file: !1411, line: 28, type: !621)
!1418 = !DILocalVariable(name: "message", scope: !1410, file: !1411, line: 31, type: !740)
!1419 = !DILocation(line: 0, scope: !1410, inlinedAt: !1420)
!1420 = distinct !DILocation(line: 296, column: 13, scope: !1094)
!1421 = !DILocation(line: 30, column: 3, scope: !1410, inlinedAt: !1420)
!1422 = !DILocation(line: 31, column: 5, scope: !1410, inlinedAt: !1420)
!1423 = !DILocation(line: 33, column: 14, scope: !1424, inlinedAt: !1420)
!1424 = distinct !DILexicalBlock(scope: !1410, file: !1411, line: 33, column: 7)
!1425 = !{!1014, !925, i64 568}
!1426 = !DILocation(line: 33, column: 31, scope: !1424, inlinedAt: !1420)
!1427 = !DILocation(line: 33, column: 7, scope: !1410, inlinedAt: !1420)
!1428 = !DILocation(line: 37, column: 1, scope: !1410, inlinedAt: !1420)
!1429 = !DILocation(line: 298, column: 9, scope: !1094)
!1430 = !DILocation(line: 35, column: 10, scope: !1410, inlinedAt: !1420)
!1431 = !DILocation(line: 36, column: 17, scope: !1410, inlinedAt: !1420)
!1432 = !DILocation(line: 36, column: 63, scope: !1410, inlinedAt: !1420)
!1433 = !{!1014, !925, i64 576}
!1434 = !DILocation(line: 36, column: 10, scope: !1410, inlinedAt: !1420)
!1435 = !DILocation(line: 298, column: 17, scope: !1436)
!1436 = distinct !DILexicalBlock(scope: !1094, file: !509, line: 298, column: 9)
!1437 = !DILocation(line: 231, column: 41, scope: !1088)
!1438 = distinct !{!1438, !1092, !1439, !967, !968}
!1439 = !DILocation(line: 300, column: 3, scope: !1089)
!1440 = !DILocation(line: 301, column: 14, scope: !971)
!1441 = !DILocation(line: 302, column: 3, scope: !971)
!1442 = !DILocation(line: 303, column: 1, scope: !971)
!1443 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1444, file: !1444, line: 42, type: !1445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1447)
!1444 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!506, !867, !867}
!1447 = !{}
!1448 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1449, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1447)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!617, !901, !618, !618, !867, !1451, !618, !618, null}
!1451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!1452 = distinct !DISubprogram(name: "DefineImageHistogram", scope: !509, file: !509, line: 335, type: !1453, scopeLine: 337, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1456)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{null, !863, !513, !1455}
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!1456 = !{!1457, !1458, !1459, !1460, !1461, !1462}
!1457 = !DILocalVariable(name: "image", arg: 1, scope: !1452, file: !509, line: 335, type: !863)
!1458 = !DILocalVariable(name: "node_info", arg: 2, scope: !1452, file: !509, line: 335, type: !513)
!1459 = !DILocalVariable(name: "histogram", arg: 3, scope: !1452, file: !509, line: 336, type: !1455)
!1460 = !DILocalVariable(name: "i", scope: !1452, file: !509, line: 339, type: !529)
!1461 = !DILocalVariable(name: "number_children", scope: !1452, file: !509, line: 342, type: !525)
!1462 = !DILocalVariable(name: "p", scope: !1463, file: !509, line: 354, type: !486)
!1463 = distinct !DILexicalBlock(scope: !1464, file: !509, line: 352, column: 5)
!1464 = distinct !DILexicalBlock(scope: !1452, file: !509, line: 351, column: 7)
!1465 = !DILocation(line: 0, scope: !1452)
!1466 = !DILocation(line: 347, column: 26, scope: !1452)
!1467 = !DILocation(line: 347, column: 32, scope: !1452)
!1468 = !DILocation(line: 347, column: 19, scope: !1452)
!1469 = !DILocation(line: 348, column: 3, scope: !1470)
!1470 = distinct !DILexicalBlock(scope: !1452, file: !509, line: 348, column: 3)
!1471 = !DILocation(line: 349, column: 9, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !1473, file: !509, line: 349, column: 9)
!1473 = distinct !DILexicalBlock(scope: !1470, file: !509, line: 348, column: 3)
!1474 = !DILocation(line: 349, column: 29, scope: !1472)
!1475 = !DILocation(line: 349, column: 9, scope: !1473)
!1476 = !DILocation(line: 350, column: 7, scope: !1472)
!1477 = !DILocation(line: 348, column: 45, scope: !1473)
!1478 = !DILocation(line: 348, column: 15, scope: !1473)
!1479 = distinct !{!1479, !1469, !1480, !967, !968}
!1480 = !DILocation(line: 350, column: 63, scope: !1470)
!1481 = !DILocation(line: 351, column: 18, scope: !1464)
!1482 = !DILocation(line: 351, column: 24, scope: !1464)
!1483 = !DILocation(line: 351, column: 7, scope: !1452)
!1484 = !DILocation(line: 0, scope: !1463)
!1485 = !DILocation(line: 357, column: 42, scope: !1486)
!1486 = distinct !DILexicalBlock(scope: !1487, file: !509, line: 357, column: 7)
!1487 = distinct !DILexicalBlock(scope: !1463, file: !509, line: 357, column: 7)
!1488 = !DILocation(line: 357, column: 19, scope: !1486)
!1489 = !DILocation(line: 357, column: 7, scope: !1487)
!1490 = !DILocation(line: 356, column: 20, scope: !1463)
!1491 = !DILocation(line: 359, column: 10, scope: !1492)
!1492 = distinct !DILexicalBlock(scope: !1486, file: !509, line: 358, column: 7)
!1493 = !DILocation(line: 359, column: 32, scope: !1492)
!1494 = !DILocation(line: 360, column: 32, scope: !1492)
!1495 = !DILocation(line: 360, column: 10, scope: !1492)
!1496 = !DILocation(line: 360, column: 23, scope: !1492)
!1497 = !DILocation(line: 360, column: 28, scope: !1492)
!1498 = !DILocation(line: 361, column: 32, scope: !1492)
!1499 = !DILocation(line: 361, column: 23, scope: !1492)
!1500 = !DILocation(line: 361, column: 28, scope: !1492)
!1501 = !DILocation(line: 362, column: 21, scope: !1492)
!1502 = !DILocation(line: 363, column: 10, scope: !1492)
!1503 = !DILocation(line: 357, column: 58, scope: !1486)
!1504 = distinct !{!1504, !1489, !1505, !967, !968}
!1505 = !DILocation(line: 364, column: 7, scope: !1487)
!1506 = !DILocation(line: 366, column: 1, scope: !1452)
!1507 = distinct !DISubprogram(name: "IsHistogramImage", scope: !509, file: !509, line: 638, type: !1508, scopeLine: 640, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1510)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!617, !863, !901}
!1510 = !{!1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525}
!1511 = !DILocalVariable(name: "image", arg: 1, scope: !1507, file: !509, line: 638, type: !863)
!1512 = !DILocalVariable(name: "exception", arg: 2, scope: !1507, file: !509, line: 639, type: !901)
