; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/simple/ia64.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/simple/ia64.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@ia64_code.BRANCH_TABLE = internal unnamed_addr constant [32 x i32] [i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 4, i32 4, i32 6, i32 6, i32 0, i32 0, i32 7, i32 7, i32 4, i32 4, i32 0, i32 0, i32 4, i32 4, i32 0, i32 0], align 16, !dbg !0

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_simple_ia64_encoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters) local_unnamed_addr #0 !dbg !99 {
entry:
  call void @llvm.dbg.value(metadata ptr %next, metadata !183, metadata !DIExpression()), !dbg !186
  call void @llvm.dbg.value(metadata ptr %allocator, metadata !184, metadata !DIExpression()), !dbg !186
  call void @llvm.dbg.value(metadata ptr %filters, metadata !185, metadata !DIExpression()), !dbg !186
  call void @llvm.dbg.value(metadata ptr %next, metadata !187, metadata !DIExpression()) #4, !dbg !195
  call void @llvm.dbg.value(metadata ptr %allocator, metadata !192, metadata !DIExpression()) #4, !dbg !195
  call void @llvm.dbg.value(metadata ptr %filters, metadata !193, metadata !DIExpression()) #4, !dbg !195

!30 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!31 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!32 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!33 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!34 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!35 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!36 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!37 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!38 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!39 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!40 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 250, baseType: !17, size: 32, elements: !42)
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!44 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!45 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!46 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 27, baseType: !17, size: 32, elements: !49)
!48 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!51 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!52 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!53 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!54 = !{!55, !13, !20}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !14, line: 27, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !16, line: 45, baseType: !8)
!57 = !{!0}
!58 = !{!59, !60, !61, !62, !63, !64, !65, !70, !71, !72, !74, !78, !79, !80, !82, !83, !86, !87}
!59 = !DILocalVariable(name: "simple", arg: 1, scope: !2, file: !3, line: 18, type: !9)
!60 = !DILocalVariable(name: "now_pos", arg: 2, scope: !2, file: !3, line: 19, type: !13)
!61 = !DILocalVariable(name: "is_encoder", arg: 3, scope: !2, file: !3, line: 19, type: !18)
!62 = !DILocalVariable(name: "buffer", arg: 4, scope: !2, file: !3, line: 20, type: !19)
!63 = !DILocalVariable(name: "size", arg: 5, scope: !2, file: !3, line: 20, type: !6)
!64 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 29, type: !6)
!65 = !DILocalVariable(name: "instr_template", scope: !66, file: !3, line: 31, type: !69)
!66 = distinct !DILexicalBlock(scope: !67, file: !3, line: 30, column: 39)
!67 = distinct !DILexicalBlock(scope: !68, file: !3, line: 30, column: 2)
!68 = distinct !DILexicalBlock(scope: !2, file: !3, line: 30, column: 2)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!70 = !DILocalVariable(name: "mask", scope: !66, file: !3, line: 32, type: !69)
!71 = !DILocalVariable(name: "bit_pos", scope: !66, file: !3, line: 33, type: !13)
!72 = !DILocalVariable(name: "slot", scope: !73, file: !3, line: 35, type: !6)
!73 = distinct !DILexicalBlock(scope: !66, file: !3, line: 35, column: 3)
!74 = !DILocalVariable(name: "byte_pos", scope: !75, file: !3, line: 39, type: !77)
!75 = distinct !DILexicalBlock(scope: !76, file: !3, line: 35, column: 58)
!76 = distinct !DILexicalBlock(scope: !73, file: !3, line: 35, column: 3)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!78 = !DILocalVariable(name: "bit_res", scope: !75, file: !3, line: 40, type: !69)
!79 = !DILocalVariable(name: "instruction", scope: !75, file: !3, line: 41, type: !55)
!80 = !DILocalVariable(name: "j", scope: !81, file: !3, line: 43, type: !6)
!81 = distinct !DILexicalBlock(scope: !75, file: !3, line: 43, column: 4)
!82 = !DILocalVariable(name: "inst_norm", scope: !75, file: !3, line: 48, type: !55)
!83 = !DILocalVariable(name: "src", scope: !84, file: !3, line: 54, type: !13)
!84 = distinct !DILexicalBlock(scope: !85, file: !3, line: 53, column: 8)
!85 = distinct !DILexicalBlock(scope: !75, file: !3, line: 50, column: 8)
!86 = !DILocalVariable(name: "dest", scope: !84, file: !3, line: 60, type: !13)
!87 = !DILocalVariable(name: "j", scope: !88, file: !3, line: 76, type: !6)
!88 = distinct !DILexicalBlock(scope: !84, file: !3, line: 76, column: 5)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1024, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 32)
!92 = !{i32 7, !"Dwarf Version", i32 5}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{i32 1, !"wchar_size", i32 4}
!95 = !{i32 7, !"PIC Level", i32 2}
!96 = !{i32 7, !"PIE Level", i32 2}
!97 = !{i32 7, !"uwtable", i32 2}
!98 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!99 = distinct !DISubprogram(name: "lzma_simple_ia64_encoder_init", scope: !3, file: !3, line: 98, type: !100, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !23, retainedNodes: !182)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !103, !122, !172}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !27, line: 237, baseType: !26)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !105, line: 80, baseType: !106)
!105 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !105, line: 124, size: 512, elements: !107)
!107 = !{!108, !111, !114, !117, !143, !148, !155, !160}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !106, file: !105, line: 126, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !105, line: 78, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !106, file: !105, line: 130, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !113, line: 63, baseType: !55)
!113 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!114 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !106, file: !105, line: 136, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !116, line: 90, baseType: !8)
!116 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!117 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !106, file: !105, line: 139, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !105, line: 94, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!102, !109, !122, !136, !139, !6, !141, !139, !6, !142}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !27, line: 403, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 341, size: 192, elements: !125)
!125 = !{!126, !131, !135}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !124, file: !27, line: 376, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !130, !6, !6}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !124, file: !27, line: 390, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !130, !130}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !124, file: !27, line: 401, baseType: !130, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!139 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !19)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !27, line: 322, baseType: !41)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !106, file: !105, line: 144, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !105, line: 102, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !109, !122}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !106, file: !105, line: 148, baseType: !149, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !48, line: 55, baseType: !47)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !106, file: !105, line: 152, baseType: !156, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!102, !109, !159, !159, !55}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !106, file: !105, line: 157, baseType: !161, size: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!102, !109, !122, !164, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !167, line: 65, baseType: !168)
!167 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 43, size: 128, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !167, line: 54, baseType: !112, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !168, file: !167, line: 63, baseType: !130, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !105, line: 82, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !105, line: 109, size: 192, elements: !176)
!176 = !{!177, !178, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !175, file: !105, line: 112, baseType: !112, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !105, line: 116, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !105, line: 86, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !175, file: !105, line: 119, baseType: !130, size: 64, offset: 128)
!182 = !{!183, !184, !185}
!183 = !DILocalVariable(name: "next", arg: 1, scope: !99, file: !3, line: 98, type: !103)
!184 = !DILocalVariable(name: "allocator", arg: 2, scope: !99, file: !3, line: 99, type: !122)
!185 = !DILocalVariable(name: "filters", arg: 3, scope: !99, file: !3, line: 99, type: !172)
!186 = !DILocation(line: 0, scope: !99)
!187 = !DILocalVariable(name: "next", arg: 1, scope: !188, file: !3, line: 89, type: !103)
!188 = distinct !DISubprogram(name: "ia64_coder_init", scope: !3, file: !3, line: 89, type: !189, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !23, retainedNodes: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{!102, !103, !122, !172, !18}
!191 = !{!187, !192, !193, !194}
!192 = !DILocalVariable(name: "allocator", arg: 2, scope: !188, file: !3, line: 89, type: !122)
!193 = !DILocalVariable(name: "filters", arg: 3, scope: !188, file: !3, line: 90, type: !172)
!194 = !DILocalVariable(name: "is_encoder", arg: 4, scope: !188, file: !3, line: 90, type: !18)
!195 = !DILocation(line: 0, scope: !188, inlinedAt: !196)
!196 = distinct !DILocation(line: 101, column: 9, scope: !99)
!197 = !DILocation(line: 92, column: 9, scope: !188, inlinedAt: !196)
!198 = !DILocation(line: 101, column: 2, scope: !99)
!199 = distinct !DISubprogram(name: "lzma_simple_ia64_decoder_init", scope: !3, file: !3, line: 106, type: !100, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !23, retainedNodes: !200)
!200 = !{!201, !202, !203}
!201 = !DILocalVariable(name: "next", arg: 1, scope: !199, file: !3, line: 106, type: !103)
!202 = !DILocalVariable(name: "allocator", arg: 2, scope: !199, file: !3, line: 107, type: !122)
!203 = !DILocalVariable(name: "filters", arg: 3, scope: !199, file: !3, line: 107, type: !172)
!204 = !DILocation(line: 0, scope: !199)
!205 = !DILocation(line: 0, scope: !188, inlinedAt: !206)
!206 = distinct !DILocation(line: 109, column: 9, scope: !199)
!207 = !DILocation(line: 92, column: 9, scope: !188, inlinedAt: !206)
!208 = !DILocation(line: 109, column: 2, scope: !199)
!209 = !DISubprogram(name: "lzma_simple_coder_init", scope: !11, file: !11, line: 68, type: !210, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !213)
!210 = !DISubroutineType(types: !211)
!211 = !{!102, !103, !122, !172, !212, !6, !6, !13, !18}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!213 = !{}
!214 = !DILocation(line: 0, scope: !2)
!215 = !DILocation(line: 30, column: 21, scope: !67)
!216 = !DILocation(line: 30, column: 2, scope: !68)
!217 = !DILocation(line: 30, column: 16, scope: !67)
!218 = distinct !{!218, !216, !219, !220, !221}
!219 = !DILocation(line: 82, column: 2, scope: !68)
!220 = !{!"llvm.loop.mustprogress"}
!221 = !{!"llvm.loop.unroll.disable"}
!222 = !DILocation(line: 31, column: 35, scope: !66)
!223 = !{!224, !224, i64 0}
!224 = !{!"omnipotent char", !225, i64 0}
!225 = !{!"Simple C/C++ TBAA"}
!226 = !DILocation(line: 31, column: 45, scope: !66)
!227 = !DILocation(line: 32, column: 25, scope: !66)
!228 = !DILocation(line: 0, scope: !66)
!229 = !{!230, !230, i64 0}
!230 = !{!"int", !224, i64 0}
!231 = !DILocation(line: 0, scope: !73)
!232 = !DILocation(line: 35, column: 3, scope: !73)
!233 = !DILocation(line: 36, column: 15, scope: !234)
!234 = distinct !DILexicalBlock(scope: !75, file: !3, line: 36, column: 8)
!235 = !DILocation(line: 36, column: 29, scope: !234)
!236 = !DILocation(line: 36, column: 8, scope: !75)
!237 = !DILocation(line: 39, column: 37, scope: !75)
!238 = !DILocation(line: 39, column: 28, scope: !75)
!239 = !DILocation(line: 0, scope: !75)
!240 = !DILocation(line: 0, scope: !81)
!241 = !DILocation(line: 43, column: 4, scope: !81)
