; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/identify.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/identify.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }

!520 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!521 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!522 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!523 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!524 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!525 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!526 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!527 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!528 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!529 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!530 = !DIEnumerator(name: "MagickListOptions", value: 38)
!531 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!532 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!533 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!534 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!535 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!536 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!537 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!538 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!539 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!540 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!541 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!542 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!543 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!544 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!545 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!546 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!547 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!548 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!549 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!550 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!551 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!552 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!553 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!554 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!555 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!556 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!557 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!558 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!559 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!560 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!561 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!562 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !564, line: 25, baseType: !5, size: 32, elements: !565)
!564 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574}
!566 = !DIEnumerator(name: "UndefinedPath", value: 0)
!567 = !DIEnumerator(name: "MagickPath", value: 1)
!568 = !DIEnumerator(name: "RootPath", value: 2)
!569 = !DIEnumerator(name: "HeadPath", value: 3)
!570 = !DIEnumerator(name: "TailPath", value: 4)
!571 = !DIEnumerator(name: "BasePath", value: 5)
!572 = !DIEnumerator(name: "ExtensionPath", value: 6)
!573 = !DIEnumerator(name: "SubimagePath", value: 7)
!574 = !DIEnumerator(name: "CanonicalPath", value: 8)
!575 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !576, line: 28, baseType: !5, size: 32, elements: !577)
!576 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!577 = !{!578, !579, !580, !581, !582, !583}
!578 = !DIEnumerator(name: "UndefinedCompliance", value: 0)
!579 = !DIEnumerator(name: "NoCompliance", value: 0)
!580 = !DIEnumerator(name: "SVGCompliance", value: 1)
!581 = !DIEnumerator(name: "X11Compliance", value: 2)
!582 = !DIEnumerator(name: "XPMCompliance", value: 4)
!583 = !DIEnumerator(name: "AllCompliance", value: 2147483647)
!584 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !585, line: 25, baseType: !5, size: 32, elements: !586)
!585 = !DIFile(filename: "apps/538.imagick_r/src/magick/registry.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fee9ec3439d50d35877b8d14c6edadfb")
!586 = !{!587, !588, !589, !590}
!587 = !DIEnumerator(name: "UndefinedRegistryType", value: 0)
!588 = !DIEnumerator(name: "ImageRegistryType", value: 1)
!589 = !DIEnumerator(name: "ImageInfoRegistryType", value: 2)
!590 = !DIEnumerator(name: "StringRegistryType", value: 3)
!591 = !{!592, !593, !645, !654, !656, !657, !674, !663, !731, !882, !884, !1011, !1030, !1036, !700, !647, !695, !1058, !623, !601, !1060, !1065, !1074, !801, !1075, !489, !1076, !1078}
!592 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !595, line: 7, baseType: !596)
!595 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !597, line: 49, size: 1728, elements: !598)
!597 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!598 = !{!599, !600, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !616, !618, !619, !620, !624, !626, !628, !632, !635, !637, !640, !643, !644, !646, !649, !650}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !596, file: !597, line: 51, baseType: !489, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !596, file: !597, line: 54, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !596, file: !597, line: 55, baseType: !601, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !596, file: !597, line: 56, baseType: !601, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !596, file: !597, line: 57, baseType: !601, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !596, file: !597, line: 58, baseType: !601, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !596, file: !597, line: 59, baseType: !601, size: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !596, file: !597, line: 60, baseType: !601, size: 64, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !596, file: !597, line: 61, baseType: !601, size: 64, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !596, file: !597, line: 64, baseType: !601, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !596, file: !597, line: 65, baseType: !601, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !596, file: !597, line: 66, baseType: !601, size: 64, offset: 704)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !596, file: !597, line: 68, baseType: !614, size: 64, offset: 768)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !597, line: 36, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !596, file: !597, line: 70, baseType: !617, size: 64, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !596, file: !597, line: 72, baseType: !489, size: 32, offset: 896)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !596, file: !597, line: 73, baseType: !489, size: 32, offset: 928)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !596, file: !597, line: 74, baseType: !621, size: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !622, line: 152, baseType: !623)
!622 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!623 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !596, file: !597, line: 77, baseType: !625, size: 16, offset: 1024)
!625 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !596, file: !597, line: 78, baseType: !627, size: 8, offset: 1040)
!627 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !596, file: !597, line: 79, baseType: !629, size: 8, offset: 1048)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 8, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 1)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !596, file: !597, line: 81, baseType: !633, size: 64, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !597, line: 43, baseType: null)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !596, file: !597, line: 89, baseType: !636, size: 64, offset: 1152)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !622, line: 153, baseType: !623)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !596, file: !597, line: 91, baseType: !638, size: 64, offset: 1216)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !597, line: 37, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !596, file: !597, line: 92, baseType: !641, size: 64, offset: 1280)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !597, line: 38, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !596, file: !597, line: 93, baseType: !617, size: 64, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !596, file: !597, line: 94, baseType: !645, size: 64, offset: 1408)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !596, file: !597, line: 95, baseType: !647, size: 64, offset: 1472)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !648, line: 46, baseType: !592)
!648 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !596, file: !597, line: 96, baseType: !489, size: 32, offset: 1536)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !596, file: !597, line: 98, baseType: !651, size: 160, offset: 1568)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 160, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 20)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "StatisticType", file: !476, line: 124, baseType: !475)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelStatistics", file: !476, line: 44, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelStatistics", file: !476, line: 27, size: 768, elements: !660)
!660 = !{!661, !662, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !659, file: !476, line: 30, baseType: !647, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "minima", scope: !659, file: !476, line: 33, baseType: !663, size: 64, offset: 64)
!663 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "maxima", scope: !659, file: !476, line: 34, baseType: !663, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !659, file: !476, line: 35, baseType: !663, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sum_squared", scope: !659, file: !476, line: 36, baseType: !663, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sum_cubed", scope: !659, file: !476, line: 37, baseType: !663, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sum_fourth_power", scope: !659, file: !476, line: 38, baseType: !663, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !659, file: !476, line: 39, baseType: !663, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !659, file: !476, line: 40, baseType: !663, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "standard_deviation", scope: !659, file: !476, line: 41, baseType: !663, size: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "kurtosis", scope: !659, file: !476, line: 42, baseType: !663, size: 64, offset: 640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "skewness", scope: !659, file: !476, line: 43, baseType: !663, size: 64, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !677)
!677 = !{!678, !680, !682, !684, !685, !687, !689, !690, !691, !692, !693, !694, !704, !705, !706, !707, !708, !722, !724, !725, !727, !728, !729, !730, !734, !735, !736, !744, !745, !746, !747, !748, !749, !751, !753, !755, !757, !759, !761, !763, !764, !765, !766, !767, !768, !769, !776, !791, !803, !804, !805, !806, !810, !814, !818, !819, !820, !821, !822, !839, !840, !842, !843, !853, !854, !856, !857, !858, !859, !860, !861, !863, !864, !865, !866, !867, !868, !869, !871, !872, !873, !874, !875, !879, !881}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !676, file: !77, line: 153, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !676, file: !77, line: 156, baseType: !681, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !676, file: !77, line: 159, baseType: !683, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !676, file: !77, line: 162, baseType: !647, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !676, file: !77, line: 165, baseType: !686, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !676, file: !77, line: 168, baseType: !688, size: 32, offset: 224)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !676, file: !77, line: 169, baseType: !688, size: 32, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !676, file: !77, line: 172, baseType: !647, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !676, file: !77, line: 173, baseType: !647, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !676, file: !77, line: 174, baseType: !647, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !676, file: !77, line: 175, baseType: !647, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !676, file: !77, line: 178, baseType: !695, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !698)
!698 = !{!699, !701, !702, !703}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !697, file: !326, line: 143, baseType: !700, size: 16)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !625)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !697, file: !326, line: 144, baseType: !700, size: 16, offset: 16)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !697, file: !326, line: 145, baseType: !700, size: 16, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !697, file: !326, line: 146, baseType: !700, size: 16, offset: 48)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !676, file: !77, line: 179, baseType: !696, size: 64, offset: 640)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !676, file: !77, line: 180, baseType: !696, size: 64, offset: 704)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !676, file: !77, line: 181, baseType: !696, size: 64, offset: 768)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !676, file: !77, line: 184, baseType: !663, size: 64, offset: 832)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !676, file: !77, line: 187, baseType: !709, size: 768, offset: 896)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !711)
!711 = !{!712, !719, !720, !721}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !710, file: !77, line: 124, baseType: !713, size: 192)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !714, file: !77, line: 98, baseType: !663, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !714, file: !77, line: 99, baseType: !663, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !714, file: !77, line: 100, baseType: !663, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !710, file: !77, line: 125, baseType: !713, size: 192, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !710, file: !77, line: 126, baseType: !713, size: 192, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !710, file: !77, line: 127, baseType: !713, size: 192, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !676, file: !77, line: 190, baseType: !723, size: 32, offset: 1664)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !676, file: !77, line: 193, baseType: !645, size: 64, offset: 1728)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !676, file: !77, line: 196, baseType: !726, size: 32, offset: 1792)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !676, file: !77, line: 199, baseType: !601, size: 64, offset: 1856)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !676, file: !77, line: 200, baseType: !601, size: 64, offset: 1920)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !676, file: !77, line: 201, baseType: !601, size: 64, offset: 1984)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !676, file: !77, line: 204, baseType: !731, size: 64, offset: 2048)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !732, line: 77, baseType: !733)
!732 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !622, line: 193, baseType: !623)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !676, file: !77, line: 207, baseType: !663, size: 64, offset: 2112)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !676, file: !77, line: 208, baseType: !663, size: 64, offset: 2176)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !676, file: !77, line: 211, baseType: !737, size: 256, offset: 2240)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !739)
!739 = !{!740, !741, !742, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !738, file: !153, line: 124, baseType: !647, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !738, file: !153, line: 125, baseType: !647, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !738, file: !153, line: 128, baseType: !731, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !738, file: !153, line: 129, baseType: !731, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !676, file: !77, line: 212, baseType: !737, size: 256, offset: 2496)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !676, file: !77, line: 213, baseType: !737, size: 256, offset: 2752)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !676, file: !77, line: 216, baseType: !663, size: 64, offset: 3008)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !676, file: !77, line: 217, baseType: !663, size: 64, offset: 3072)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !676, file: !77, line: 218, baseType: !663, size: 64, offset: 3136)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !676, file: !77, line: 221, baseType: !750, size: 32, offset: 3200)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !676, file: !77, line: 224, baseType: !752, size: 32, offset: 3232)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !676, file: !77, line: 227, baseType: !754, size: 32, offset: 3264)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !676, file: !77, line: 230, baseType: !756, size: 32, offset: 3296)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !676, file: !77, line: 233, baseType: !758, size: 32, offset: 3328)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !676, file: !77, line: 236, baseType: !760, size: 32, offset: 3360)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !676, file: !77, line: 239, baseType: !762, size: 64, offset: 3392)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !676, file: !77, line: 242, baseType: !647, size: 64, offset: 3456)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !676, file: !77, line: 243, baseType: !647, size: 64, offset: 3520)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !676, file: !77, line: 246, baseType: !731, size: 64, offset: 3584)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !676, file: !77, line: 249, baseType: !647, size: 64, offset: 3648)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !676, file: !77, line: 250, baseType: !647, size: 64, offset: 3712)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !676, file: !77, line: 253, baseType: !731, size: 64, offset: 3776)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !676, file: !77, line: 256, baseType: !770, size: 192, offset: 3840)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !576, line: 68, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !576, line: 62, size: 192, elements: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !771, file: !576, line: 65, baseType: !663, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !771, file: !576, line: 66, baseType: !663, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !771, file: !576, line: 67, baseType: !663, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !676, file: !77, line: 259, baseType: !777, size: 512, offset: 4032)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !779)
!779 = !{!780, !787, !788, !790}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !778, file: !247, line: 43, baseType: !781, size: 192)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !782, file: !247, line: 35, baseType: !663, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !782, file: !247, line: 36, baseType: !663, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !782, file: !247, line: 37, baseType: !663, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !778, file: !247, line: 44, baseType: !781, size: 192, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !778, file: !247, line: 47, baseType: !789, size: 32, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !778, file: !247, line: 50, baseType: !647, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !676, file: !77, line: 262, baseType: !792, size: 64, offset: 4544)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !793, line: 26, baseType: !794)
!793 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!688, !654, !797, !800, !645}
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !799)
!799 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !802)
!802 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !676, file: !77, line: 265, baseType: !645, size: 64, offset: 4608)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !676, file: !77, line: 266, baseType: !645, size: 64, offset: 4672)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !676, file: !77, line: 267, baseType: !645, size: 64, offset: 4736)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !676, file: !77, line: 270, baseType: !807, size: 64, offset: 4800)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !809)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !676, file: !77, line: 273, baseType: !811, size: 64, offset: 4864)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !813)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !676, file: !77, line: 276, baseType: !815, size: 32768, offset: 4928)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 32768, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 4096)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !676, file: !77, line: 277, baseType: !815, size: 32768, offset: 37696)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !676, file: !77, line: 278, baseType: !815, size: 32768, offset: 70464)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !676, file: !77, line: 281, baseType: !647, size: 64, offset: 103232)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !676, file: !77, line: 282, baseType: !647, size: 64, offset: 103296)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !676, file: !77, line: 285, baseType: !823, size: 448, offset: 103360)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !825)
!825 = !{!826, !828, !829, !830, !831, !832, !833, !838}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !824, file: !253, line: 105, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !824, file: !253, line: 108, baseType: !489, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !824, file: !253, line: 111, baseType: !601, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !824, file: !253, line: 112, baseType: !601, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !824, file: !253, line: 115, baseType: !645, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !824, file: !253, line: 118, baseType: !688, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !824, file: !253, line: 121, baseType: !834, size: 64, offset: 320)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !836, line: 26, baseType: !837)
!836 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !836, line: 25, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !824, file: !253, line: 124, baseType: !647, size: 64, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !676, file: !77, line: 288, baseType: !688, size: 32, offset: 103808)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !676, file: !77, line: 291, baseType: !841, size: 64, offset: 103872)
!841 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !731)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !676, file: !77, line: 294, baseType: !834, size: 64, offset: 103936)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !676, file: !77, line: 297, baseType: !844, size: 256, offset: 104000)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !846)
!846 = !{!847, !848, !849, !852}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !845, file: !89, line: 30, baseType: !601, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !845, file: !89, line: 33, baseType: !647, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !845, file: !89, line: 36, baseType: !850, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !845, file: !89, line: 39, baseType: !647, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !676, file: !77, line: 298, baseType: !844, size: 256, offset: 104256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !676, file: !77, line: 299, baseType: !855, size: 64, offset: 104512)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !676, file: !77, line: 302, baseType: !647, size: 64, offset: 104576)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !676, file: !77, line: 305, baseType: !647, size: 64, offset: 104640)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !676, file: !77, line: 308, baseType: !762, size: 64, offset: 104704)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !676, file: !77, line: 309, baseType: !762, size: 64, offset: 104768)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !77, line: 310, baseType: !762, size: 64, offset: 104832)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !676, file: !77, line: 313, baseType: !862, size: 32, offset: 104896)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !676, file: !77, line: 316, baseType: !688, size: 32, offset: 104928)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !676, file: !77, line: 319, baseType: !696, size: 64, offset: 104960)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !676, file: !77, line: 322, baseType: !762, size: 64, offset: 105024)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !676, file: !77, line: 325, baseType: !737, size: 256, offset: 105088)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !676, file: !77, line: 328, baseType: !645, size: 64, offset: 105344)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !676, file: !77, line: 329, baseType: !645, size: 64, offset: 105408)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !676, file: !77, line: 332, baseType: !870, size: 32, offset: 105472)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !676, file: !77, line: 335, baseType: !688, size: 32, offset: 105504)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !676, file: !77, line: 338, baseType: !801, size: 64, offset: 105536)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !676, file: !77, line: 341, baseType: !688, size: 32, offset: 105600)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !676, file: !77, line: 344, baseType: !647, size: 64, offset: 105664)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !676, file: !77, line: 347, baseType: !876, size: 64, offset: 105728)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !877, line: 7, baseType: !878)
!877 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !622, line: 160, baseType: !623)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !676, file: !77, line: 350, baseType: !880, size: 32, offset: 105792)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !676, file: !77, line: 353, baseType: !647, size: 64, offset: 105856)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !445, line: 103, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !445, line: 51, size: 1216, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !974, !982, !987, !994, !995, !996, !997, !998, !999, !1000, !1002, !1004, !1005, !1007, !1008, !1009, !1010}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !887, file: !445, line: 54, baseType: !601, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !887, file: !445, line: 55, baseType: !601, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !887, file: !445, line: 56, baseType: !601, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !887, file: !445, line: 57, baseType: !601, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !887, file: !445, line: 58, baseType: !601, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !887, file: !445, line: 61, baseType: !895, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !77, line: 356, size: 134336, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !933, !934, !935, !936, !937, !938, !940, !941, !942, !943, !944, !945, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !971, !972, !973}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !897, file: !77, line: 359, baseType: !683, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !897, file: !77, line: 362, baseType: !686, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !897, file: !77, line: 365, baseType: !688, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !897, file: !77, line: 366, baseType: !688, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !897, file: !77, line: 367, baseType: !688, size: 32, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !897, file: !77, line: 368, baseType: !688, size: 32, offset: 160)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !897, file: !77, line: 371, baseType: !601, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !897, file: !77, line: 372, baseType: !601, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !897, file: !77, line: 373, baseType: !601, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !897, file: !77, line: 374, baseType: !601, size: 64, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !897, file: !77, line: 377, baseType: !647, size: 64, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !897, file: !77, line: 378, baseType: !647, size: 64, offset: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !897, file: !77, line: 379, baseType: !647, size: 64, offset: 576)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !897, file: !77, line: 382, baseType: !752, size: 32, offset: 640)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !897, file: !77, line: 385, baseType: !754, size: 32, offset: 672)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !897, file: !77, line: 388, baseType: !726, size: 32, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !897, file: !77, line: 391, baseType: !647, size: 64, offset: 768)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !897, file: !77, line: 394, baseType: !601, size: 64, offset: 832)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !897, file: !77, line: 395, baseType: !601, size: 64, offset: 896)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !897, file: !77, line: 396, baseType: !601, size: 64, offset: 960)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !897, file: !77, line: 397, baseType: !601, size: 64, offset: 1024)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !897, file: !77, line: 398, baseType: !601, size: 64, offset: 1088)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !897, file: !77, line: 401, baseType: !663, size: 64, offset: 1152)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !897, file: !77, line: 402, baseType: !663, size: 64, offset: 1216)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !897, file: !77, line: 405, baseType: !696, size: 64, offset: 1280)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !897, file: !77, line: 406, baseType: !696, size: 64, offset: 1344)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !897, file: !77, line: 407, baseType: !696, size: 64, offset: 1408)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !897, file: !77, line: 410, baseType: !688, size: 32, offset: 1472)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !897, file: !77, line: 411, baseType: !688, size: 32, offset: 1504)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !897, file: !77, line: 414, baseType: !647, size: 64, offset: 1536)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !897, file: !77, line: 417, baseType: !681, size: 32, offset: 1600)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !897, file: !77, line: 420, baseType: !870, size: 32, offset: 1632)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !897, file: !77, line: 423, baseType: !932, size: 32, offset: 1664)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !369, line: 59, baseType: !368)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !897, file: !77, line: 426, baseType: !731, size: 64, offset: 1728)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !897, file: !77, line: 429, baseType: !688, size: 32, offset: 1792)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !897, file: !77, line: 430, baseType: !688, size: 32, offset: 1824)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !897, file: !77, line: 433, baseType: !601, size: 64, offset: 1856)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !897, file: !77, line: 434, baseType: !601, size: 64, offset: 1920)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !897, file: !77, line: 437, baseType: !939, size: 32, offset: 1984)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !401)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !897, file: !77, line: 440, baseType: !674, size: 64, offset: 2048)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !897, file: !77, line: 443, baseType: !645, size: 64, offset: 2112)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !897, file: !77, line: 446, baseType: !792, size: 64, offset: 2176)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !897, file: !77, line: 449, baseType: !645, size: 64, offset: 2240)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !897, file: !77, line: 450, baseType: !645, size: 64, offset: 2304)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !897, file: !77, line: 453, baseType: !946, size: 64, offset: 2368)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !947, line: 26, baseType: !948)
!947 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!647, !951, !953, !955}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !897, file: !77, line: 456, baseType: !593, size: 64, offset: 2432)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !897, file: !77, line: 459, baseType: !645, size: 64, offset: 2496)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !897, file: !77, line: 462, baseType: !647, size: 64, offset: 2560)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !897, file: !77, line: 465, baseType: !815, size: 32768, offset: 2624)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !897, file: !77, line: 466, baseType: !815, size: 32768, offset: 35392)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !897, file: !77, line: 467, baseType: !815, size: 32768, offset: 68160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !897, file: !77, line: 468, baseType: !815, size: 32768, offset: 100928)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !897, file: !77, line: 471, baseType: !688, size: 32, offset: 133696)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !897, file: !77, line: 474, baseType: !601, size: 64, offset: 133760)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !897, file: !77, line: 477, baseType: !647, size: 64, offset: 133824)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !897, file: !77, line: 478, baseType: !647, size: 64, offset: 133888)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !897, file: !77, line: 481, baseType: !696, size: 64, offset: 133952)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !897, file: !77, line: 484, baseType: !647, size: 64, offset: 134016)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !897, file: !77, line: 487, baseType: !970, size: 32, offset: 134080)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !897, file: !77, line: 490, baseType: !696, size: 64, offset: 134112)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !897, file: !77, line: 493, baseType: !645, size: 64, offset: 134208)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !897, file: !77, line: 496, baseType: !688, size: 32, offset: 134272)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !887, file: !445, line: 64, baseType: !975, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !445, line: 43, baseType: !977)
!977 = !DISubroutineType(types: !978)
!978 = !{!674, !979, !981}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !887, file: !445, line: 67, baseType: !983, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !445, line: 46, baseType: !985)
!985 = !DISubroutineType(types: !986)
!986 = !{!688, !979, !674}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !887, file: !445, line: 70, baseType: !988, size: 64, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !445, line: 49, baseType: !990)
!990 = !DISubroutineType(types: !991)
!991 = !{!688, !992, !955}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !887, file: !445, line: 73, baseType: !645, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !887, file: !445, line: 76, baseType: !688, size: 32, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !887, file: !445, line: 77, baseType: !688, size: 32, offset: 672)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !887, file: !445, line: 78, baseType: !688, size: 32, offset: 704)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !887, file: !445, line: 79, baseType: !688, size: 32, offset: 736)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !887, file: !445, line: 80, baseType: !688, size: 32, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !887, file: !445, line: 83, baseType: !1001, size: 32, offset: 800)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !445, line: 33, baseType: !444)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !887, file: !445, line: 86, baseType: !1003, size: 32, offset: 832)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !887, file: !445, line: 89, baseType: !688, size: 32, offset: 864)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !887, file: !445, line: 92, baseType: !1006, size: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !887, file: !445, line: 93, baseType: !1006, size: 64, offset: 960)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !887, file: !445, line: 96, baseType: !647, size: 64, offset: 1024)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !887, file: !445, line: 99, baseType: !601, size: 64, offset: 1088)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !887, file: !445, line: 102, baseType: !834, size: 64, offset: 1152)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelMoments", file: !476, line: 59, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelMoments", file: !476, line: 46, size: 2496, elements: !1014)
!1014 = !{!1015, !1019, !1026, !1027, !1028, !1029}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "I", scope: !1013, file: !476, line: 49, baseType: !1016, size: 2048)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 2048, elements: !1017)
!1017 = !{!1018}
!1018 = !DISubrange(count: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "centroid", scope: !1013, file: !476, line: 52, baseType: !1020, size: 128, offset: 2048)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !1021, line: 142, baseType: !1022)
!1021 = !DIFile(filename: "apps/538.imagick_r/src/magick/draw.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7430ad7998fb3d4ef58bbf5582967ea1")
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !1021, line: 137, size: 128, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1022, file: !1021, line: 140, baseType: !663, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1022, file: !1021, line: 141, baseType: !663, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_axis", scope: !1013, file: !476, line: 53, baseType: !1020, size: 128, offset: 2176)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_angle", scope: !1013, file: !476, line: 56, baseType: !663, size: 64, offset: 2304)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_eccentricity", scope: !1013, file: !476, line: 57, baseType: !663, size: 64, offset: 2368)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_intensity", scope: !1013, file: !476, line: 58, baseType: !663, size: 64, offset: 2432)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelPerceptualHash", file: !476, line: 66, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelPerceptualHash", file: !476, line: 61, size: 4096, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !1032, file: !476, line: 64, baseType: !1016, size: 2048)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !1032, file: !476, line: 65, baseType: !1016, size: 2048, offset: 2048)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelFeatures", file: !1038, line: 45, baseType: !1039)
!1038 = !DIFile(filename: "apps/538.imagick_r/src/magick/feature.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "dbe73de8fac9b3b50939c7a0dc145cd9")
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelFeatures", file: !1038, line: 28, size: 3584, elements: !1040)
!1040 = !{!1041, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "angular_second_moment", scope: !1039, file: !1038, line: 31, baseType: !1042, size: 256)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 256, elements: !1043)
!1043 = !{!1044}
!1044 = !DISubrange(count: 4)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1039, file: !1038, line: 32, baseType: !1042, size: 256, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "correlation", scope: !1039, file: !1038, line: 33, baseType: !1042, size: 256, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "variance_sum_of_squares", scope: !1039, file: !1038, line: 34, baseType: !1042, size: 256, offset: 768)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_difference_moment", scope: !1039, file: !1038, line: 35, baseType: !1042, size: 256, offset: 1024)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "sum_average", scope: !1039, file: !1038, line: 36, baseType: !1042, size: 256, offset: 1280)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "sum_variance", scope: !1039, file: !1038, line: 37, baseType: !1042, size: 256, offset: 1536)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "sum_entropy", scope: !1039, file: !1038, line: 38, baseType: !1042, size: 256, offset: 1792)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !1039, file: !1038, line: 39, baseType: !1042, size: 256, offset: 2048)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "difference_variance", scope: !1039, file: !1038, line: 40, baseType: !1042, size: 256, offset: 2304)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "difference_entropy", scope: !1039, file: !1038, line: 41, baseType: !1042, size: 256, offset: 2560)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "measure_of_correlation_1", scope: !1039, file: !1038, line: 42, baseType: !1042, size: 256, offset: 2816)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "measure_of_correlation_2", scope: !1039, file: !1038, line: 43, baseType: !1042, size: 256, offset: 3072)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_correlation_coefficient", scope: !1039, file: !1038, line: 44, baseType: !1042, size: 256, offset: 3328)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !700)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "WarningHandler", file: !253, line: 134, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !1064, !654, !654}
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !1067, line: 40, baseType: !1068)
!1067 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !1067, line: 29, size: 32960, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1068, file: !1067, line: 32, baseType: !815, size: 32768)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !1068, file: !1067, line: 35, baseType: !850, size: 64, offset: 32768)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1068, file: !1067, line: 38, baseType: !647, size: 64, offset: 32832)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1068, file: !1067, line: 39, baseType: !647, size: 64, offset: 32896)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !1079)
!1079 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1080 = !{i32 7, !"Dwarf Version", i32 5}
!1081 = !{i32 2, !"Debug Info Version", i32 3}
!1082 = !{i32 1, !"wchar_size", i32 4}
!1083 = !{i32 7, !"PIC Level", i32 2}
!1084 = !{i32 7, !"PIE Level", i32 2}
!1085 = !{i32 7, !"uwtable", i32 2}
!1086 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1087 = distinct !DISubprogram(name: "IdentifyImage", scope: !1088, file: !1088, line: 482, type: !1089, scopeLine: 484, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1092)
!1088 = !DIFile(filename: "apps/538.imagick_r/src/magick/identify.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "629f2cf99085725232903d309f608ecd")
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!688, !674, !593, !1091}
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!1092 = !{!1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1125, !1126, !1127, !1131, !1134, !1139, !1140, !1143, !1157, !1162, !1163, !1164, !1165, !1167, !1170, !1171, !1172, !1173, !1174, !1179, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190}
!1093 = !DILocalVariable(name: "image", arg: 1, scope: !1087, file: !1088, line: 482, type: !674)
!1094 = !DILocalVariable(name: "file", arg: 2, scope: !1087, file: !1088, line: 482, type: !593)
!1095 = !DILocalVariable(name: "verbose", arg: 3, scope: !1087, file: !1088, line: 483, type: !1091)
!1096 = !DILocalVariable(name: "color", scope: !1087, file: !1088, line: 486, type: !815)
!1097 = !DILocalVariable(name: "format", scope: !1087, file: !1088, line: 487, type: !815)
!1098 = !DILocalVariable(name: "key", scope: !1087, file: !1088, line: 488, type: !815)
!1099 = !DILocalVariable(name: "channel_features", scope: !1087, file: !1088, line: 491, type: !1036)
!1100 = !DILocalVariable(name: "channel_moments", scope: !1087, file: !1088, line: 494, type: !1011)
!1101 = !DILocalVariable(name: "channel_phash", scope: !1087, file: !1088, line: 497, type: !1030)
!1102 = !DILocalVariable(name: "channel_statistics", scope: !1087, file: !1088, line: 500, type: !657)
!1103 = !DILocalVariable(name: "colorspace", scope: !1087, file: !1088, line: 503, type: !681)
!1104 = !DILocalVariable(name: "artifact", scope: !1087, file: !1088, line: 506, type: !654)
!1105 = !DILocalVariable(name: "locate", scope: !1087, file: !1088, line: 507, type: !654)
!1106 = !DILocalVariable(name: "name", scope: !1087, file: !1088, line: 508, type: !654)
!1107 = !DILocalVariable(name: "property", scope: !1087, file: !1088, line: 509, type: !654)
!1108 = !DILocalVariable(name: "registry", scope: !1087, file: !1088, line: 510, type: !654)
!1109 = !DILocalVariable(name: "value", scope: !1087, file: !1088, line: 511, type: !654)
!1110 = !DILocalVariable(name: "magick_info", scope: !1087, file: !1088, line: 514, type: !884)
!1111 = !DILocalVariable(name: "pixels", scope: !1087, file: !1088, line: 517, type: !882)
!1112 = !DILocalVariable(name: "elapsed_time", scope: !1087, file: !1088, line: 520, type: !663)
!1113 = !DILocalVariable(name: "scale", scope: !1087, file: !1088, line: 521, type: !663)
!1114 = !DILocalVariable(name: "user_time", scope: !1087, file: !1088, line: 522, type: !663)
!1115 = !DILocalVariable(name: "exception", scope: !1087, file: !1088, line: 525, type: !981)
!1116 = !DILocalVariable(name: "type", scope: !1087, file: !1088, line: 528, type: !870)
!1117 = !DILocalVariable(name: "ping", scope: !1087, file: !1088, line: 531, type: !688)
!1118 = !DILocalVariable(name: "i", scope: !1087, file: !1088, line: 534, type: !731)
!1119 = !DILocalVariable(name: "x", scope: !1087, file: !1088, line: 535, type: !731)
!1120 = !DILocalVariable(name: "distance", scope: !1087, file: !1088, line: 538, type: !647)
!1121 = !DILocalVariable(name: "y", scope: !1087, file: !1088, line: 541, type: !731)
!1122 = !DILocalVariable(name: "limit", scope: !1123, file: !1088, line: 554, type: !654)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !1088, line: 552, column: 5)
!1124 = distinct !DILexicalBlock(scope: !1087, file: !1088, line: 551, column: 7)
!1125 = !DILocalVariable(name: "max_locations", scope: !1123, file: !1088, line: 557, type: !647)
!1126 = !DILocalVariable(name: "type", scope: !1123, file: !1088, line: 560, type: !656)
!1127 = !DILocalVariable(name: "filename", scope: !1128, file: !1088, line: 701, type: !815)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !1088, line: 699, column: 7)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !1088, line: 698, column: 9)
!1130 = distinct !DILexicalBlock(scope: !1087, file: !1088, line: 697, column: 7)
!1131 = !DILocalVariable(name: "depth", scope: !1132, file: !1088, line: 758, type: !647)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !1088, line: 756, column: 5)
!1133 = distinct !DILexicalBlock(scope: !1087, file: !1088, line: 755, column: 7)
!1134 = !DILocalVariable(name: "indexes", scope: !1135, file: !1088, line: 982, type: !1076)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !1088, line: 980, column: 9)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !1088, line: 979, column: 11)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !1088, line: 973, column: 5)
!1138 = distinct !DILexicalBlock(scope: !1087, file: !1088, line: 972, column: 7)
!1139 = !DILocalVariable(name: "p", scope: !1135, file: !1088, line: 985, type: !882)
!1140 = !DILocalVariable(name: "tuple", scope: !1141, file: !1088, line: 1007, type: !815)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !1088, line: 1005, column: 13)
!1142 = distinct !DILexicalBlock(scope: !1135, file: !1088, line: 1004, column: 15)
!1143 = !DILocalVariable(name: "pixel", scope: !1141, file: !1088, line: 1010, type: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !1145, file: !326, line: 107, baseType: !679, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1145, file: !326, line: 110, baseType: !681, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1145, file: !326, line: 113, baseType: !688, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1145, file: !326, line: 116, baseType: !663, size: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1145, file: !326, line: 119, baseType: !647, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1145, file: !326, line: 122, baseType: !1078, size: 32, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1145, file: !326, line: 123, baseType: !1078, size: 32, offset: 288)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1145, file: !326, line: 124, baseType: !1078, size: 32, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1145, file: !326, line: 125, baseType: !1078, size: 32, offset: 352)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1145, file: !326, line: 126, baseType: !1078, size: 32, offset: 384)
!1157 = !DILocalVariable(name: "color", scope: !1158, file: !1088, line: 1043, type: !815)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !1088, line: 1041, column: 9)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !1088, line: 1040, column: 11)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !1088, line: 1036, column: 5)
!1161 = distinct !DILexicalBlock(scope: !1087, file: !1088, line: 1035, column: 7)
!1162 = !DILocalVariable(name: "hex", scope: !1158, file: !1088, line: 1044, type: !815)
!1163 = !DILocalVariable(name: "tuple", scope: !1158, file: !1088, line: 1045, type: !815)
!1164 = !DILocalVariable(name: "pixel", scope: !1158, file: !1088, line: 1048, type: !1144)
!1165 = !DILocalVariable(name: "p", scope: !1158, file: !1088, line: 1051, type: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !695)
!1167 = !DILocalVariable(name: "tile", scope: !1168, file: !1088, line: 1177, type: !674)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !1088, line: 1175, column: 5)
!1169 = distinct !DILexicalBlock(scope: !1087, file: !1088, line: 1174, column: 7)
!1170 = !DILocalVariable(name: "image_info", scope: !1168, file: !1088, line: 1180, type: !895)
!1171 = !DILocalVariable(name: "p", scope: !1168, file: !1088, line: 1183, type: !601)
!1172 = !DILocalVariable(name: "q", scope: !1168, file: !1088, line: 1184, type: !601)
!1173 = !DILocalVariable(name: "handler", scope: !1168, file: !1088, line: 1187, type: !1060)
!1174 = !DILocalVariable(name: "profile", scope: !1175, file: !1088, line: 1266, type: !1177)
!1175 = distinct !DILexicalBlock(scope: !1176, file: !1088, line: 1264, column: 5)
!1176 = distinct !DILexicalBlock(scope: !1087, file: !1088, line: 1263, column: 7)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1179 = !DILocalVariable(name: "attribute", scope: !1180, file: !1088, line: 1282, type: !601)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !1088, line: 1280, column: 11)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !1088, line: 1279, column: 13)
!1182 = distinct !DILexicalBlock(scope: !1175, file: !1088, line: 1273, column: 7)
!1183 = !DILocalVariable(name: "attribute_list", scope: !1180, file: !1088, line: 1283, type: !1074)
!1184 = !DILocalVariable(name: "tag", scope: !1180, file: !1088, line: 1286, type: !654)
!1185 = !DILocalVariable(name: "dataset", scope: !1180, file: !1088, line: 1289, type: !623)
!1186 = !DILocalVariable(name: "record", scope: !1180, file: !1088, line: 1290, type: !623)
!1187 = !DILocalVariable(name: "sentinel", scope: !1180, file: !1088, line: 1291, type: !623)
!1188 = !DILocalVariable(name: "j", scope: !1180, file: !1088, line: 1294, type: !731)
!1189 = !DILocalVariable(name: "length", scope: !1180, file: !1088, line: 1297, type: !647)
!1190 = !DILocalVariable(name: "profile_length", scope: !1180, file: !1088, line: 1298, type: !647)
!1191 = !DILocation(line: 0, scope: !1087)
!1192 = !DILocation(line: 485, column: 3, scope: !1087)
!1193 = !DILocation(line: 486, column: 5, scope: !1087)
!1194 = !DILocation(line: 487, column: 5, scope: !1087)
!1195 = !DILocation(line: 488, column: 5, scope: !1087)
!1196 = !DILocation(line: 545, column: 14, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1087, file: !1088, line: 545, column: 7)
!1198 = !{!1199, !1200, i64 12976}
