; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/image.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/image.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._GeometryInfo = type { double, double, double, double, double }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }

!566 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!567 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!568 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!569 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!570 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!571 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!572 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!573 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!574 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!575 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 30, baseType: !7, size: 32, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!577 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!578 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!579 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!580 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!581 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!582 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!583 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!584 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!585 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!586 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!587 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!588 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!589 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !591, line: 28, baseType: !7, size: 32, elements: !592)
!591 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!592 = !{!593, !594, !595}
!593 = !DIEnumerator(name: "UndefinedFormatType", value: 0)
!594 = !DIEnumerator(name: "ImplicitFormatType", value: 1)
!595 = !DIEnumerator(name: "ExplicitFormatType", value: 2)
!596 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !597, line: 25, baseType: !7, size: 32, elements: !598)
!597 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607}
!599 = !DIEnumerator(name: "UndefinedPath", value: 0)
!600 = !DIEnumerator(name: "MagickPath", value: 1)
!601 = !DIEnumerator(name: "RootPath", value: 2)
!602 = !DIEnumerator(name: "HeadPath", value: 3)
!603 = !DIEnumerator(name: "TailPath", value: 4)
!604 = !DIEnumerator(name: "BasePath", value: 5)
!605 = !DIEnumerator(name: "ExtensionPath", value: 6)
!606 = !DIEnumerator(name: "SubimagePath", value: 7)
!607 = !DIEnumerator(name: "CanonicalPath", value: 8)
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !609, line: 46, baseType: !7, size: 32, elements: !610)
!609 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!611 = !DIEnumerator(name: "_ISupper", value: 256)
!612 = !DIEnumerator(name: "_ISlower", value: 512)
!613 = !DIEnumerator(name: "_ISalpha", value: 1024)
!614 = !DIEnumerator(name: "_ISdigit", value: 2048)
!615 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!616 = !DIEnumerator(name: "_ISspace", value: 8192)
!617 = !DIEnumerator(name: "_ISprint", value: 16384)
!618 = !DIEnumerator(name: "_ISgraph", value: 32768)
!619 = !DIEnumerator(name: "_ISblank", value: 1)
!620 = !DIEnumerator(name: "_IScntrl", value: 2)
!621 = !DIEnumerator(name: "_ISpunct", value: 4)
!622 = !DIEnumerator(name: "_ISalnum", value: 8)
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !624, line: 35, baseType: !7, size: 32, elements: !625)
!624 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a66ea2eabdd36512a199f3a0075ea4ad")
!625 = !{!626, !627, !628, !629, !630, !631, !632}
!626 = !DIEnumerator(name: "UndefinedBlobMode", value: 0)
!627 = !DIEnumerator(name: "ReadBlobMode", value: 1)
!628 = !DIEnumerator(name: "ReadBinaryBlobMode", value: 2)
!629 = !DIEnumerator(name: "WriteBlobMode", value: 3)
!630 = !DIEnumerator(name: "WriteBinaryBlobMode", value: 4)
!631 = !DIEnumerator(name: "AppendBlobMode", value: 5)
!632 = !DIEnumerator(name: "AppendBinaryBlobMode", value: 6)
!633 = !{!634, !635, !690, !501, !784, !855, !856, !918, !694, !768, !646, !699, !730, !771, !988, !658, !663, !990, !991, !992, !672, !994, !780, !807, !912, !824, !664, !1003, !1051, !651, !728, !644, !724, !720, !726, !853, !688, !722, !835, !649, !843, !692, !763, !1069, !1071}
!634 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !75, line: 150, size: 105920, elements: !638)
!638 = !{!639, !641, !643, !645, !648, !650, !652, !653, !654, !655, !656, !657, !668, !669, !670, !671, !673, !687, !689, !691, !693, !696, !697, !698, !704, !705, !706, !714, !715, !716, !717, !718, !719, !721, !723, !725, !727, !729, !731, !733, !734, !735, !736, !737, !738, !739, !747, !762, !776, !777, !778, !779, !783, !787, !791, !792, !793, !794, !795, !812, !813, !815, !816, !826, !827, !829, !830, !831, !832, !833, !834, !836, !837, !838, !839, !840, !841, !842, !844, !845, !846, !847, !848, !852, !854}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !637, file: !75, line: 153, baseType: !640, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !5)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !637, file: !75, line: 156, baseType: !642, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !13, line: 61, baseType: !12)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !637, file: !75, line: 159, baseType: !644, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !50, line: 49, baseType: !49)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !637, file: !75, line: 162, baseType: !646, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !647, line: 46, baseType: !634)
!647 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!648 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !637, file: !75, line: 165, baseType: !649, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !75, line: 86, baseType: !74)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !637, file: !75, line: 168, baseType: !651, size: 32, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !86)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !637, file: !75, line: 169, baseType: !651, size: 32, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !637, file: !75, line: 172, baseType: !646, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !637, file: !75, line: 173, baseType: !646, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !637, file: !75, line: 174, baseType: !646, size: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !637, file: !75, line: 175, baseType: !646, size: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !637, file: !75, line: 178, baseType: !658, size: 64, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !328, line: 148, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !328, line: 131, size: 64, elements: !661)
!661 = !{!662, !665, !666, !667}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !660, file: !328, line: 143, baseType: !663, size: 16)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !664)
!664 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !660, file: !328, line: 144, baseType: !663, size: 16, offset: 16)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !660, file: !328, line: 145, baseType: !663, size: 16, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !660, file: !328, line: 146, baseType: !663, size: 16, offset: 48)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !637, file: !75, line: 179, baseType: !659, size: 64, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !637, file: !75, line: 180, baseType: !659, size: 64, offset: 704)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !637, file: !75, line: 181, baseType: !659, size: 64, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !637, file: !75, line: 184, baseType: !672, size: 64, offset: 832)
!672 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !637, file: !75, line: 187, baseType: !674, size: 768, offset: 896)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !75, line: 128, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !75, line: 121, size: 768, elements: !676)
!676 = !{!677, !684, !685, !686}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !675, file: !75, line: 124, baseType: !678, size: 192)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !75, line: 101, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !75, line: 95, size: 192, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !679, file: !75, line: 98, baseType: !672, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !679, file: !75, line: 99, baseType: !672, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !679, file: !75, line: 100, baseType: !672, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !675, file: !75, line: 125, baseType: !678, size: 192, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !675, file: !75, line: 126, baseType: !678, size: 192, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !675, file: !75, line: 127, baseType: !678, size: 192, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !637, file: !75, line: 190, baseType: !688, size: 32, offset: 1664)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !91, line: 49, baseType: !90)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !637, file: !75, line: 193, baseType: !690, size: 64, offset: 1728)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !637, file: !75, line: 196, baseType: !692, size: 32, offset: 1792)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !75, line: 93, baseType: !98)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !637, file: !75, line: 199, baseType: !694, size: 64, offset: 1856)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !637, file: !75, line: 200, baseType: !694, size: 64, offset: 1920)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !637, file: !75, line: 201, baseType: !694, size: 64, offset: 1984)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !637, file: !75, line: 204, baseType: !699, size: 64, offset: 2048)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !700, line: 77, baseType: !701)
!700 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !702, line: 193, baseType: !703)
!702 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!703 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !637, file: !75, line: 207, baseType: !672, size: 64, offset: 2112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !637, file: !75, line: 208, baseType: !672, size: 64, offset: 2176)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !637, file: !75, line: 211, baseType: !707, size: 256, offset: 2240)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !155, line: 130, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !155, line: 121, size: 256, elements: !709)
!709 = !{!710, !711, !712, !713}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !708, file: !155, line: 124, baseType: !646, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !708, file: !155, line: 125, baseType: !646, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !708, file: !155, line: 128, baseType: !699, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !708, file: !155, line: 129, baseType: !699, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !637, file: !75, line: 212, baseType: !707, size: 256, offset: 2496)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !637, file: !75, line: 213, baseType: !707, size: 256, offset: 2752)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !637, file: !75, line: 216, baseType: !672, size: 64, offset: 3008)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !637, file: !75, line: 217, baseType: !672, size: 64, offset: 3072)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !637, file: !75, line: 218, baseType: !672, size: 64, offset: 3136)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !637, file: !75, line: 221, baseType: !720, size: 32, offset: 3200)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !104, line: 66, baseType: !103)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !637, file: !75, line: 224, baseType: !722, size: 32, offset: 3232)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !75, line: 73, baseType: !138)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !637, file: !75, line: 227, baseType: !724, size: 32, offset: 3264)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !149, line: 35, baseType: !148)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !637, file: !75, line: 230, baseType: !726, size: 32, offset: 3296)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !155, line: 91, baseType: !154)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !637, file: !75, line: 233, baseType: !728, size: 32, offset: 3328)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !170, line: 99, baseType: !169)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !637, file: !75, line: 236, baseType: !730, size: 32, offset: 3360)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !241, line: 32, baseType: !240)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !637, file: !75, line: 239, baseType: !732, size: 64, offset: 3392)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !637, file: !75, line: 242, baseType: !646, size: 64, offset: 3456)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !637, file: !75, line: 243, baseType: !646, size: 64, offset: 3520)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !637, file: !75, line: 246, baseType: !699, size: 64, offset: 3584)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !637, file: !75, line: 249, baseType: !646, size: 64, offset: 3648)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !637, file: !75, line: 250, baseType: !646, size: 64, offset: 3712)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !637, file: !75, line: 253, baseType: !699, size: 64, offset: 3776)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !637, file: !75, line: 256, baseType: !740, size: 192, offset: 3840)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !741, line: 68, baseType: !742)
!741 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !741, line: 62, size: 192, elements: !743)
!743 = !{!744, !745, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !742, file: !741, line: 65, baseType: !672, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !742, file: !741, line: 66, baseType: !672, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !742, file: !741, line: 67, baseType: !672, size: 64, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !637, file: !75, line: 259, baseType: !748, size: 512, offset: 4032)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !249, line: 51, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !249, line: 40, size: 512, elements: !750)
!750 = !{!751, !758, !759, !761}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !749, file: !249, line: 43, baseType: !752, size: 192)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !249, line: 38, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !249, line: 32, size: 192, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !753, file: !249, line: 35, baseType: !672, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !753, file: !249, line: 36, baseType: !672, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !753, file: !249, line: 37, baseType: !672, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !749, file: !249, line: 44, baseType: !752, size: 192, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !749, file: !249, line: 47, baseType: !760, size: 32, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !249, line: 30, baseType: !248)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !749, file: !249, line: 50, baseType: !646, size: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !637, file: !75, line: 262, baseType: !763, size: 64, offset: 4544)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !764, line: 26, baseType: !765)
!764 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!651, !768, !770, !773, !690}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !772)
!772 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !775)
!775 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !637, file: !75, line: 265, baseType: !690, size: 64, offset: 4608)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !637, file: !75, line: 266, baseType: !690, size: 64, offset: 4672)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !637, file: !75, line: 267, baseType: !690, size: 64, offset: 4736)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !637, file: !75, line: 270, baseType: !780, size: 64, offset: 4800)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !50, line: 52, baseType: !782)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !50, line: 51, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !637, file: !75, line: 273, baseType: !784, size: 64, offset: 4864)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !786)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !637, file: !75, line: 276, baseType: !788, size: 32768, offset: 4928)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 32768, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 4096)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !637, file: !75, line: 277, baseType: !788, size: 32768, offset: 37696)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !637, file: !75, line: 278, baseType: !788, size: 32768, offset: 70464)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !637, file: !75, line: 281, baseType: !646, size: 64, offset: 103232)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !637, file: !75, line: 282, baseType: !646, size: 64, offset: 103296)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !637, file: !75, line: 285, baseType: !796, size: 448, offset: 103360)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !255, line: 102, size: 448, elements: !798)
!798 = !{!799, !801, !802, !803, !804, !805, !806, !811}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !797, file: !255, line: 105, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !255, line: 100, baseType: !254)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !797, file: !255, line: 108, baseType: !501, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !797, file: !255, line: 111, baseType: !694, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !797, file: !255, line: 112, baseType: !694, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !797, file: !255, line: 115, baseType: !690, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !797, file: !255, line: 118, baseType: !651, size: 32, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !797, file: !255, line: 121, baseType: !807, size: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !809, line: 26, baseType: !810)
!809 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !809, line: 25, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !797, file: !255, line: 124, baseType: !646, size: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !637, file: !75, line: 288, baseType: !651, size: 32, offset: 103808)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !637, file: !75, line: 291, baseType: !814, size: 64, offset: 103872)
!814 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !699)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !637, file: !75, line: 294, baseType: !807, size: 64, offset: 103936)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !637, file: !75, line: 297, baseType: !817, size: 256, offset: 104000)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !91, line: 40, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !91, line: 27, size: 256, elements: !819)
!819 = !{!820, !821, !822, !825}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !818, file: !91, line: 30, baseType: !694, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !818, file: !91, line: 33, baseType: !646, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !818, file: !91, line: 36, baseType: !823, size: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !818, file: !91, line: 39, baseType: !646, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !637, file: !75, line: 298, baseType: !817, size: 256, offset: 104256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !637, file: !75, line: 299, baseType: !828, size: 64, offset: 104512)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !637, file: !75, line: 302, baseType: !646, size: 64, offset: 104576)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !637, file: !75, line: 305, baseType: !646, size: 64, offset: 104640)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !637, file: !75, line: 308, baseType: !732, size: 64, offset: 104704)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !637, file: !75, line: 309, baseType: !732, size: 64, offset: 104768)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !75, line: 310, baseType: !732, size: 64, offset: 104832)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !637, file: !75, line: 313, baseType: !835, size: 32, offset: 104896)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !328, line: 47, baseType: !327)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !637, file: !75, line: 316, baseType: !651, size: 32, offset: 104928)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !637, file: !75, line: 319, baseType: !659, size: 64, offset: 104960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !637, file: !75, line: 322, baseType: !732, size: 64, offset: 105024)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !637, file: !75, line: 325, baseType: !707, size: 256, offset: 105088)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !637, file: !75, line: 328, baseType: !690, size: 64, offset: 105344)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !637, file: !75, line: 329, baseType: !690, size: 64, offset: 105408)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !637, file: !75, line: 332, baseType: !843, size: 32, offset: 105472)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !75, line: 61, baseType: !344)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !637, file: !75, line: 335, baseType: !651, size: 32, offset: 105504)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !637, file: !75, line: 338, baseType: !774, size: 64, offset: 105536)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !637, file: !75, line: 341, baseType: !651, size: 32, offset: 105600)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !637, file: !75, line: 344, baseType: !646, size: 64, offset: 105664)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !637, file: !75, line: 347, baseType: !849, size: 64, offset: 105728)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !850, line: 7, baseType: !851)
!850 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !702, line: 160, baseType: !703)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !637, file: !75, line: 350, baseType: !853, size: 32, offset: 105792)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !328, line: 79, baseType: !358)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !637, file: !75, line: 353, baseType: !646, size: 64, offset: 105856)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !6, line: 223, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !75, line: 356, size: 134336, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !894, !895, !896, !897, !898, !899, !901, !902, !903, !904, !905, !906, !917, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !985, !986, !987}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !858, file: !75, line: 359, baseType: !644, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !858, file: !75, line: 362, baseType: !649, size: 32, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !858, file: !75, line: 365, baseType: !651, size: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !858, file: !75, line: 366, baseType: !651, size: 32, offset: 96)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !858, file: !75, line: 367, baseType: !651, size: 32, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !858, file: !75, line: 368, baseType: !651, size: 32, offset: 160)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !858, file: !75, line: 371, baseType: !694, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !858, file: !75, line: 372, baseType: !694, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !858, file: !75, line: 373, baseType: !694, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !858, file: !75, line: 374, baseType: !694, size: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !858, file: !75, line: 377, baseType: !646, size: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !858, file: !75, line: 378, baseType: !646, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !858, file: !75, line: 379, baseType: !646, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !858, file: !75, line: 382, baseType: !722, size: 32, offset: 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !858, file: !75, line: 385, baseType: !724, size: 32, offset: 672)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !858, file: !75, line: 388, baseType: !692, size: 32, offset: 704)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !858, file: !75, line: 391, baseType: !646, size: 64, offset: 768)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !858, file: !75, line: 394, baseType: !694, size: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !858, file: !75, line: 395, baseType: !694, size: 64, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !858, file: !75, line: 396, baseType: !694, size: 64, offset: 960)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !858, file: !75, line: 397, baseType: !694, size: 64, offset: 1024)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !858, file: !75, line: 398, baseType: !694, size: 64, offset: 1088)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !858, file: !75, line: 401, baseType: !672, size: 64, offset: 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !858, file: !75, line: 402, baseType: !672, size: 64, offset: 1216)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !858, file: !75, line: 405, baseType: !659, size: 64, offset: 1280)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !858, file: !75, line: 406, baseType: !659, size: 64, offset: 1344)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !858, file: !75, line: 407, baseType: !659, size: 64, offset: 1408)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !858, file: !75, line: 410, baseType: !651, size: 32, offset: 1472)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !858, file: !75, line: 411, baseType: !651, size: 32, offset: 1504)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !858, file: !75, line: 414, baseType: !646, size: 64, offset: 1536)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !858, file: !75, line: 417, baseType: !642, size: 32, offset: 1600)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !858, file: !75, line: 420, baseType: !843, size: 32, offset: 1632)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !858, file: !75, line: 423, baseType: !893, size: 32, offset: 1664)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !371, line: 59, baseType: !370)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !858, file: !75, line: 426, baseType: !699, size: 64, offset: 1728)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !858, file: !75, line: 429, baseType: !651, size: 32, offset: 1792)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !858, file: !75, line: 430, baseType: !651, size: 32, offset: 1824)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !858, file: !75, line: 433, baseType: !694, size: 64, offset: 1856)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !858, file: !75, line: 434, baseType: !694, size: 64, offset: 1920)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !858, file: !75, line: 437, baseType: !900, size: 32, offset: 1984)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !403)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !858, file: !75, line: 440, baseType: !635, size: 64, offset: 2048)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !858, file: !75, line: 443, baseType: !690, size: 64, offset: 2112)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !858, file: !75, line: 446, baseType: !763, size: 64, offset: 2176)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !858, file: !75, line: 449, baseType: !690, size: 64, offset: 2240)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !858, file: !75, line: 450, baseType: !690, size: 64, offset: 2304)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !858, file: !75, line: 453, baseType: !907, size: 64, offset: 2368)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !908, line: 26, baseType: !909)
!908 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!646, !912, !914, !916}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !858, file: !75, line: 456, baseType: !918, size: 64, offset: 2432)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !920, line: 7, baseType: !921)
!920 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !922, line: 49, size: 1728, elements: !923)
!922 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !939, !941, !942, !943, !945, !946, !948, !952, !955, !957, !960, !963, !964, !965, !966, !967}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !921, file: !922, line: 51, baseType: !501, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !921, file: !922, line: 54, baseType: !694, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !921, file: !922, line: 55, baseType: !694, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !921, file: !922, line: 56, baseType: !694, size: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !921, file: !922, line: 57, baseType: !694, size: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !921, file: !922, line: 58, baseType: !694, size: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !921, file: !922, line: 59, baseType: !694, size: 64, offset: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !921, file: !922, line: 60, baseType: !694, size: 64, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !921, file: !922, line: 61, baseType: !694, size: 64, offset: 512)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !921, file: !922, line: 64, baseType: !694, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !921, file: !922, line: 65, baseType: !694, size: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !921, file: !922, line: 66, baseType: !694, size: 64, offset: 704)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !921, file: !922, line: 68, baseType: !937, size: 64, offset: 768)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !922, line: 36, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !921, file: !922, line: 70, baseType: !940, size: 64, offset: 832)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !921, file: !922, line: 72, baseType: !501, size: 32, offset: 896)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !921, file: !922, line: 73, baseType: !501, size: 32, offset: 928)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !921, file: !922, line: 74, baseType: !944, size: 64, offset: 960)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !702, line: 152, baseType: !703)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !921, file: !922, line: 77, baseType: !664, size: 16, offset: 1024)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !921, file: !922, line: 78, baseType: !947, size: 8, offset: 1040)
!947 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !921, file: !922, line: 79, baseType: !949, size: 8, offset: 1048)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 8, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 1)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !921, file: !922, line: 81, baseType: !953, size: 64, offset: 1088)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !922, line: 43, baseType: null)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !921, file: !922, line: 89, baseType: !956, size: 64, offset: 1152)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !702, line: 153, baseType: !703)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !921, file: !922, line: 91, baseType: !958, size: 64, offset: 1216)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !922, line: 37, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !921, file: !922, line: 92, baseType: !961, size: 64, offset: 1280)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !922, line: 38, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !921, file: !922, line: 93, baseType: !940, size: 64, offset: 1344)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !921, file: !922, line: 94, baseType: !690, size: 64, offset: 1408)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !921, file: !922, line: 95, baseType: !646, size: 64, offset: 1472)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !921, file: !922, line: 96, baseType: !501, size: 32, offset: 1536)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !921, file: !922, line: 98, baseType: !968, size: 160, offset: 1568)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 160, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 20)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !858, file: !75, line: 459, baseType: !690, size: 64, offset: 2496)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !858, file: !75, line: 462, baseType: !646, size: 64, offset: 2560)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !858, file: !75, line: 465, baseType: !788, size: 32768, offset: 2624)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !858, file: !75, line: 466, baseType: !788, size: 32768, offset: 35392)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !858, file: !75, line: 467, baseType: !788, size: 32768, offset: 68160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !858, file: !75, line: 468, baseType: !788, size: 32768, offset: 100928)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !858, file: !75, line: 471, baseType: !651, size: 32, offset: 133696)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !858, file: !75, line: 474, baseType: !694, size: 64, offset: 133760)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !858, file: !75, line: 477, baseType: !646, size: 64, offset: 133824)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !858, file: !75, line: 478, baseType: !646, size: 64, offset: 133888)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !858, file: !75, line: 481, baseType: !659, size: 64, offset: 133952)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !858, file: !75, line: 484, baseType: !646, size: 64, offset: 134016)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !858, file: !75, line: 487, baseType: !984, size: 32, offset: 134080)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !426, line: 47, baseType: !425)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !858, file: !75, line: 490, baseType: !659, size: 64, offset: 134112)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !858, file: !75, line: 493, baseType: !690, size: 64, offset: 134208)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !858, file: !75, line: 496, baseType: !651, size: 32, offset: 134272)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !328, line: 129, baseType: !663)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !996, line: 40, baseType: !997)
!996 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !996, line: 29, size: 32960, elements: !998)
!998 = !{!999, !1000, !1001, !1002}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !997, file: !996, line: 32, baseType: !788, size: 32768)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !997, file: !996, line: 35, baseType: !823, size: 64, offset: 32768)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !997, file: !996, line: 38, baseType: !646, size: 64, offset: 32832)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !997, file: !996, line: 39, baseType: !646, size: 64, offset: 32896)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !591, line: 103, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !591, line: 51, size: 1216, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014, !1022, !1027, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1042, !1044, !1045, !1047, !1048, !1049, !1050}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1006, file: !591, line: 54, baseType: !694, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1006, file: !591, line: 55, baseType: !694, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1006, file: !591, line: 56, baseType: !694, size: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !1006, file: !591, line: 57, baseType: !694, size: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1006, file: !591, line: 58, baseType: !694, size: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !1006, file: !591, line: 61, baseType: !856, size: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !1006, file: !591, line: 64, baseType: !1015, size: 64, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !591, line: 43, baseType: !1017)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!635, !1019, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !1006, file: !591, line: 67, baseType: !1023, size: 64, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !591, line: 46, baseType: !1025)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!651, !1019, !635}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !1006, file: !591, line: 70, baseType: !1028, size: 64, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !591, line: 49, baseType: !1030)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!651, !1032, !916}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1006, file: !591, line: 73, baseType: !690, size: 64, offset: 576)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !1006, file: !591, line: 76, baseType: !651, size: 32, offset: 640)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1006, file: !591, line: 77, baseType: !651, size: 32, offset: 672)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !1006, file: !591, line: 78, baseType: !651, size: 32, offset: 704)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !1006, file: !591, line: 79, baseType: !651, size: 32, offset: 736)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !1006, file: !591, line: 80, baseType: !651, size: 32, offset: 768)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !1006, file: !591, line: 83, baseType: !1041, size: 32, offset: 800)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !591, line: 33, baseType: !590)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !1006, file: !591, line: 86, baseType: !1043, size: 32, offset: 832)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !6, line: 147, baseType: !7)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !1006, file: !591, line: 89, baseType: !651, size: 32, offset: 864)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1006, file: !591, line: 92, baseType: !1046, size: 64, offset: 896)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1006, file: !591, line: 93, baseType: !1046, size: 64, offset: 960)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1006, file: !591, line: 96, baseType: !646, size: 64, offset: 1024)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1006, file: !591, line: 99, baseType: !694, size: 64, offset: 1088)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1006, file: !591, line: 102, baseType: !807, size: 64, offset: 1152)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagicInfo", file: !1054, line: 51, baseType: !1055)
!1054 = !DIFile(filename: "apps/538.imagick_r/src/magick/magic.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d9fc918f002155e81e1a13ea7935e933")
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagicInfo", file: !1054, line: 25, size: 640, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1067, !1068}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1055, file: !1054, line: 28, baseType: !694, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1055, file: !1054, line: 29, baseType: !694, size: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1055, file: !1054, line: 30, baseType: !694, size: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1055, file: !1054, line: 33, baseType: !823, size: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1055, file: !1054, line: 36, baseType: !646, size: 64, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1055, file: !1054, line: 39, baseType: !771, size: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !1055, file: !1054, line: 42, baseType: !651, size: 32, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !1055, file: !1054, line: 43, baseType: !651, size: 32, offset: 416)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1055, file: !1054, line: 46, baseType: !1066, size: 64, offset: 448)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1055, file: !1054, line: 47, baseType: !1066, size: 64, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1055, file: !1054, line: 50, baseType: !646, size: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !6, line: 78, baseType: !1070)
!1070 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!1072 = !{!0, !1073, !1079, !1084, !1089, !1094, !1099, !1104, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1124}
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(name: "BorderColor", scope: !2, file: !1075, line: 107, type: !1076, isLocal: false, isDefinition: true)
!1075 = !DIFile(filename: "apps/538.imagick_r/src/magick/image.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "342b093e9a737344b5735c8778224656")
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 64, elements: !1077)
!1077 = !{!1078}
!1078 = !DISubrange(count: 8)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "DefaultTileFrame", scope: !2, file: !1075, line: 108, type: !1081, isLocal: false, isDefinition: true)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 80, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 10)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(name: "DefaultTileGeometry", scope: !2, file: !1075, line: 109, type: !1086, isLocal: false, isDefinition: true)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 104, elements: !1087)
!1087 = !{!1088}
!1088 = !DISubrange(count: 13)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(name: "DefaultTileLabel", scope: !2, file: !1075, line: 110, type: !1091, isLocal: false, isDefinition: true)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 72, elements: !1092)
!1092 = !{!1093}
!1093 = !DISubrange(count: 9)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(name: "ForegroundColor", scope: !2, file: !1075, line: 111, type: !1096, isLocal: false, isDefinition: true)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 40, elements: !1097)
!1097 = !{!1098}
!1098 = !DISubrange(count: 5)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "LoadImageTag", scope: !2, file: !1075, line: 112, type: !1101, isLocal: false, isDefinition: true)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 88, elements: !1102)
!1102 = !{!1103}
!1103 = !DISubrange(count: 11)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(name: "LoadImagesTag", scope: !2, file: !1075, line: 113, type: !1106, isLocal: false, isDefinition: true)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 96, elements: !1107)
!1107 = !{!1108}
!1108 = !DISubrange(count: 12)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(name: "MatteColor", scope: !2, file: !1075, line: 114, type: !1076, isLocal: false, isDefinition: true)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(name: "PSDensityGeometry", scope: !2, file: !1075, line: 115, type: !1081, isLocal: false, isDefinition: true)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(name: "PSPageGeometry", scope: !2, file: !1075, line: 116, type: !1076, isLocal: false, isDefinition: true)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(name: "SaveImageTag", scope: !2, file: !1075, line: 117, type: !1101, isLocal: false, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(name: "SaveImagesTag", scope: !2, file: !1075, line: 118, type: !1106, isLocal: false, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(name: "TransparentColor", scope: !2, file: !1075, line: 119, type: !1081, isLocal: false, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(name: "DefaultResolution", scope: !2, file: !1075, line: 122, type: !1123, isLocal: false, isDefinition: true)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(name: "format_type_formats", scope: !1126, file: !1075, line: 2610, type: !1160, isLocal: true, isDefinition: true)
!1126 = distinct !DISubprogram(name: "SetImageInfo", scope: !1075, file: !1075, line: 2483, type: !1127, scopeLine: 2485, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1130)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!651, !856, !1129, !1021}
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!1130 = !{!1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1150, !1155, !1156, !1159}
!1131 = !DILocalVariable(name: "image_info", arg: 1, scope: !1126, file: !1075, line: 2483, type: !856)
!1132 = !DILocalVariable(name: "frames", arg: 2, scope: !1126, file: !1075, line: 2484, type: !1129)
!1133 = !DILocalVariable(name: "exception", arg: 3, scope: !1126, file: !1075, line: 2484, type: !1021)
!1134 = !DILocalVariable(name: "extension", scope: !1126, file: !1075, line: 2487, type: !788)
!1135 = !DILocalVariable(name: "filename", scope: !1126, file: !1075, line: 2488, type: !788)
!1136 = !DILocalVariable(name: "magic", scope: !1126, file: !1075, line: 2489, type: !788)
!1137 = !DILocalVariable(name: "q", scope: !1126, file: !1075, line: 2490, type: !694)
!1138 = !DILocalVariable(name: "subimage", scope: !1126, file: !1075, line: 2491, type: !788)
!1139 = !DILocalVariable(name: "magic_info", scope: !1126, file: !1075, line: 2494, type: !1051)
!1140 = !DILocalVariable(name: "magick_info", scope: !1126, file: !1075, line: 2497, type: !1003)
!1141 = !DILocalVariable(name: "sans_exception", scope: !1126, file: !1075, line: 2500, type: !1021)
!1142 = !DILocalVariable(name: "image", scope: !1126, file: !1075, line: 2503, type: !635)
!1143 = !DILocalVariable(name: "status", scope: !1126, file: !1075, line: 2506, type: !651)
!1144 = !DILocalVariable(name: "p", scope: !1126, file: !1075, line: 2509, type: !768)
!1145 = !DILocalVariable(name: "count", scope: !1126, file: !1075, line: 2512, type: !699)
!1146 = !DILocalVariable(name: "magick", scope: !1126, file: !1075, line: 2515, type: !1147)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 65536, elements: !1148)
!1148 = !{!1149}
!1149 = !DISubrange(count: 8192)
!1150 = !DILocalVariable(name: "first", scope: !1151, file: !1075, line: 2540, type: !646)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !1075, line: 2538, column: 9)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !1075, line: 2532, column: 11)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !1075, line: 2528, column: 5)
!1154 = distinct !DILexicalBlock(scope: !1126, file: !1075, line: 2527, column: 7)
!1155 = !DILocalVariable(name: "last", scope: !1151, file: !1075, line: 2541, type: !646)
!1156 = !DILocalVariable(name: "format_type", scope: !1157, file: !1075, line: 2604, type: !1041)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !1075, line: 2602, column: 5)
!1158 = distinct !DILexicalBlock(scope: !1126, file: !1075, line: 2601, column: 7)
!1159 = !DILocalVariable(name: "i", scope: !1157, file: !1075, line: 2607, type: !699)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 1152, elements: !1161)
!1161 = !{!1162}
!1162 = !DISubrange(count: 18)
!1163 = !{i32 7, !"Dwarf Version", i32 5}
!1164 = !{i32 2, !"Debug Info Version", i32 3}
!1165 = !{i32 1, !"wchar_size", i32 4}
!1166 = !{i32 7, !"PIC Level", i32 2}
!1167 = !{i32 7, !"PIE Level", i32 2}
!1168 = !{i32 7, !"uwtable", i32 2}
!1169 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1170 = distinct !DISubprogram(name: "AcquireImage", scope: !1075, file: !1075, line: 149, type: !1171, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1173)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!635, !1019}
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1181, !1182, !1185, !1196, !1199}
!1174 = !DILocalVariable(name: "image_info", arg: 1, scope: !1170, file: !1075, line: 149, type: !1019)
!1175 = !DILocalVariable(name: "option", scope: !1170, file: !1075, line: 152, type: !768)
!1176 = !DILocalVariable(name: "image", scope: !1170, file: !1075, line: 155, type: !635)
!1177 = !DILocalVariable(name: "flags", scope: !1170, file: !1075, line: 158, type: !1043)
!1178 = !DILocalVariable(name: "message", scope: !1179, file: !1075, line: 166, type: !694)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !1075, line: 166, column: 5)
!1180 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 165, column: 7)
!1181 = !DILocalVariable(name: "exception", scope: !1179, file: !1075, line: 166, type: !796)
!1182 = !DILocalVariable(name: "geometry", scope: !1183, file: !1075, line: 232, type: !707)
!1183 = distinct !DILexicalBlock(scope: !1184, file: !1075, line: 230, column: 5)
!1184 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 229, column: 7)
!1185 = !DILocalVariable(name: "geometry_info", scope: !1186, file: !1075, line: 250, type: !1188)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !1075, line: 248, column: 5)
!1187 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 247, column: 7)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryInfo", file: !155, line: 112, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GeometryInfo", file: !155, line: 104, size: 320, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !1189, file: !155, line: 107, baseType: !672, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !1189, file: !155, line: 108, baseType: !672, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !1189, file: !155, line: 109, baseType: !672, size: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !1189, file: !155, line: 110, baseType: !672, size: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "chi", scope: !1189, file: !155, line: 111, baseType: !672, size: 64, offset: 256)
!1196 = !DILocalVariable(name: "geometry", scope: !1197, file: !1075, line: 261, type: !694)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !1075, line: 259, column: 5)
!1198 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 258, column: 7)
!1199 = !DILocalVariable(name: "geometry_info", scope: !1200, file: !1075, line: 285, type: !1188)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !1075, line: 283, column: 5)
!1201 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 282, column: 7)
!1202 = !DILocation(line: 0, scope: !1170)
!1203 = !DILocation(line: 163, column: 10, scope: !1170)
!1204 = !DILocation(line: 164, column: 19, scope: !1170)
!1205 = !DILocation(line: 165, column: 13, scope: !1180)
!1206 = !DILocation(line: 165, column: 7, scope: !1170)
!1207 = !DILocation(line: 166, column: 5, scope: !1179)
!1208 = !{!1209, !1209, i64 0}
!1209 = !{!"int", !1210, i64 0}
!1210 = !{!"omnipotent char", !1211, i64 0}
!1211 = !{!"Simple C/C++ TBAA"}
!1212 = !DILocation(line: 0, scope: !1179)
!1213 = !DILocation(line: 167, column: 10, scope: !1170)
!1214 = !DILocation(line: 171, column: 34, scope: !1170)
!1215 = !DILocation(line: 171, column: 10, scope: !1170)
!1216 = !DILocation(line: 172, column: 23, scope: !1170)
!1217 = !{!1218, !1210, i64 0}
!1218 = !{!"_Image", !1210, i64 0, !1210, i64 4, !1210, i64 8, !1219, i64 16, !1210, i64 24, !1210, i64 28, !1210, i64 32, !1219, i64 40, !1219, i64 48, !1219, i64 56, !1219, i64 64, !1220, i64 72, !1221, i64 80, !1221, i64 88, !1221, i64 96, !1223, i64 104, !1224, i64 112, !1210, i64 208, !1220, i64 216, !1210, i64 224, !1220, i64 232, !1220, i64 240, !1220, i64 248, !1219, i64 256, !1223, i64 264, !1223, i64 272, !1226, i64 280, !1226, i64 312, !1226, i64 344, !1223, i64 376, !1223, i64 384, !1223, i64 392, !1210, i64 400, !1210, i64 404, !1210, i64 408, !1210, i64 412, !1210, i64 416, !1210, i64 420, !1220, i64 424, !1219, i64 432, !1219, i64 440, !1219, i64 448, !1219, i64 456, !1219, i64 464, !1219, i64 472, !1227, i64 480, !1228, i64 504, !1220, i64 568, !1220, i64 576, !1220, i64 584, !1220, i64 592, !1220, i64 600, !1220, i64 608, !1210, i64 616, !1210, i64 4712, !1210, i64 8808, !1219, i64 12904, !1219, i64 12912, !1230, i64 12920, !1210, i64 12976, !1219, i64 12984, !1220, i64 12992, !1231, i64 13000, !1231, i64 13032, !1220, i64 13064, !1219, i64 13072, !1219, i64 13080, !1220, i64 13088, !1220, i64 13096, !1220, i64 13104, !1210, i64 13112, !1210, i64 13116, !1221, i64 13120, !1220, i64 13128, !1226, i64 13136, !1220, i64 13168, !1220, i64 13176, !1210, i64 13184, !1210, i64 13188, !1232, i64 13192, !1210, i64 13200, !1219, i64 13208, !1219, i64 13216, !1210, i64 13224, !1219, i64 13232}
!1219 = !{!"long", !1210, i64 0}
!1220 = !{!"any pointer", !1210, i64 0}
!1221 = !{!"_PixelPacket", !1222, i64 0, !1222, i64 2, !1222, i64 4, !1222, i64 6}
!1222 = !{!"short", !1210, i64 0}
!1223 = !{!"double", !1210, i64 0}
!1224 = !{!"_ChromaticityInfo", !1225, i64 0, !1225, i64 24, !1225, i64 48, !1225, i64 72}
!1225 = !{!"_PrimaryInfo", !1223, i64 0, !1223, i64 8, !1223, i64 16}
!1226 = !{!"_RectangleInfo", !1219, i64 0, !1219, i64 8, !1219, i64 16, !1219, i64 24}
!1227 = !{!"_ErrorInfo", !1223, i64 0, !1223, i64 8, !1223, i64 16}
!1228 = !{!"_TimerInfo", !1229, i64 0, !1229, i64 24, !1210, i64 48, !1219, i64 56}
!1229 = !{!"_Timer", !1223, i64 0, !1223, i64 8, !1223, i64 16}
!1230 = !{!"_ExceptionInfo", !1210, i64 0, !1209, i64 4, !1220, i64 8, !1220, i64 16, !1220, i64 24, !1210, i64 32, !1220, i64 40, !1219, i64 48}
!1231 = !{!"_ProfileInfo", !1220, i64 0, !1219, i64 8, !1220, i64 16, !1219, i64 24}
!1232 = !{!"long long", !1210, i64 0}
!1233 = !DILocation(line: 173, column: 10, scope: !1170)
!1234 = !DILocation(line: 173, column: 15, scope: !1170)
!1235 = !{!1218, !1219, i64 56}
!1236 = !DILocation(line: 174, column: 10, scope: !1170)
!1237 = !DILocation(line: 174, column: 20, scope: !1170)
!1238 = !{!1218, !1210, i64 4}
!1239 = !DILocation(line: 175, column: 10, scope: !1170)
!1240 = !DILocation(line: 175, column: 26, scope: !1170)
!1241 = !{!1218, !1210, i64 208}
!1242 = !DILocation(line: 176, column: 10, scope: !1170)
!1243 = !DILocation(line: 176, column: 15, scope: !1170)
!1244 = !{!1218, !1223, i64 104}
!1245 = !DILocation(line: 177, column: 10, scope: !1170)
!1246 = !DILocation(line: 177, column: 36, scope: !1170)
!1247 = !{!1218, !1223, i64 112}
!1248 = !DILocation(line: 178, column: 35, scope: !1170)
!1249 = !DILocation(line: 178, column: 36, scope: !1170)
!1250 = !{!1218, !1223, i64 120}
!1251 = !DILocation(line: 179, column: 35, scope: !1170)
!1252 = !DILocation(line: 179, column: 36, scope: !1170)
!1253 = !{!1218, !1223, i64 128}
!1254 = !DILocation(line: 180, column: 23, scope: !1170)
!1255 = !DILocation(line: 180, column: 38, scope: !1170)
!1256 = !{!1218, !1223, i64 136}
!1257 = !DILocation(line: 181, column: 37, scope: !1170)
!1258 = !DILocation(line: 181, column: 38, scope: !1170)
!1259 = !{!1218, !1223, i64 144}
!1260 = !DILocation(line: 182, column: 37, scope: !1170)
!1261 = !DILocation(line: 182, column: 38, scope: !1170)
!1262 = !{!1218, !1223, i64 152}
!1263 = !DILocation(line: 183, column: 23, scope: !1170)
!1264 = !DILocation(line: 183, column: 37, scope: !1170)
!1265 = !{!1218, !1223, i64 160}
!1266 = !DILocation(line: 184, column: 36, scope: !1170)
!1267 = !DILocation(line: 184, column: 37, scope: !1170)
!1268 = !{!1218, !1223, i64 168}
!1269 = !DILocation(line: 185, column: 36, scope: !1170)
!1270 = !DILocation(line: 185, column: 37, scope: !1170)
!1271 = !{!1218, !1223, i64 176}
!1272 = !DILocation(line: 186, column: 23, scope: !1170)
!1273 = !DILocation(line: 186, column: 36, scope: !1170)
!1274 = !{!1218, !1223, i64 184}
!1275 = !DILocation(line: 187, column: 35, scope: !1170)
!1276 = !DILocation(line: 187, column: 36, scope: !1170)
!1277 = !{!1218, !1223, i64 192}
!1278 = !DILocation(line: 188, column: 35, scope: !1170)
!1279 = !DILocation(line: 188, column: 36, scope: !1170)
!1280 = !{!1218, !1223, i64 200}
!1281 = !DILocation(line: 189, column: 10, scope: !1170)
!1282 = !DILocation(line: 189, column: 19, scope: !1170)
!1283 = !{!1218, !1210, i64 404}
!1284 = !DILocation(line: 190, column: 10, scope: !1170)
!1285 = !DILocation(line: 190, column: 26, scope: !1170)
!1286 = !{!1218, !1219, i64 448}
!1287 = !DILocation(line: 191, column: 10, scope: !1170)
!1288 = !DILocation(line: 191, column: 17, scope: !1170)
!1289 = !{!1218, !1210, i64 416}
!1290 = !DILocation(line: 192, column: 10, scope: !1170)
!1291 = !DILocation(line: 192, column: 14, scope: !1170)
!1292 = !{!1218, !1223, i64 384}
!1293 = !DILocation(line: 193, column: 28, scope: !1170)
!1294 = !DILocation(line: 193, column: 3, scope: !1170)
!1295 = !DILocation(line: 194, column: 53, scope: !1170)
!1296 = !DILocation(line: 194, column: 10, scope: !1170)
!1297 = !DILocation(line: 196, column: 49, scope: !1170)
!1298 = !DILocation(line: 196, column: 10, scope: !1170)
!1299 = !DILocation(line: 197, column: 48, scope: !1170)
!1300 = !DILocation(line: 197, column: 10, scope: !1170)
!1301 = !DILocation(line: 198, column: 54, scope: !1170)
!1302 = !DILocation(line: 198, column: 10, scope: !1170)
!1303 = !DILocation(line: 200, column: 24, scope: !1170)
!1304 = !DILocation(line: 200, column: 3, scope: !1170)
!1305 = !DILocation(line: 201, column: 10, scope: !1170)
!1306 = !DILocation(line: 201, column: 14, scope: !1170)
!1307 = !{!1218, !1210, i64 13200}
!1308 = !DILocation(line: 202, column: 16, scope: !1170)
!1309 = !DILocation(line: 202, column: 10, scope: !1170)
!1310 = !DILocation(line: 202, column: 15, scope: !1170)
!1311 = !{!1218, !1220, i64 584}
!1312 = !DILocation(line: 203, column: 15, scope: !1170)
!1313 = !DILocation(line: 203, column: 10, scope: !1170)
!1314 = !DILocation(line: 203, column: 14, scope: !1170)
!1315 = !{!1218, !1220, i64 608}
!1316 = !DILocation(line: 204, column: 20, scope: !1170)
!1317 = !DILocation(line: 204, column: 10, scope: !1170)
!1318 = !DILocation(line: 204, column: 19, scope: !1170)
!1319 = !{!1218, !1219, i64 13216}
!1320 = !DILocation(line: 205, column: 16, scope: !1170)
!1321 = !DILocation(line: 205, column: 10, scope: !1170)
!1322 = !DILocation(line: 205, column: 15, scope: !1170)
!1323 = !{!1218, !1210, i64 12976}
!1324 = !DILocation(line: 206, column: 10, scope: !1170)
!1325 = !DILocation(line: 206, column: 25, scope: !1170)
!1326 = !{!1218, !1219, i64 12984}
!1327 = !DILocation(line: 207, column: 20, scope: !1170)
!1328 = !DILocation(line: 207, column: 10, scope: !1170)
!1329 = !DILocation(line: 207, column: 19, scope: !1170)
!1330 = !{!1218, !1220, i64 12992}
!1331 = !DILocation(line: 208, column: 10, scope: !1170)
!1332 = !DILocation(line: 208, column: 19, scope: !1170)
!1333 = !{!1218, !1219, i64 13080}
!1334 = !DILocation(line: 209, column: 18, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 209, column: 7)
!1336 = !DILocation(line: 209, column: 7, scope: !1170)
!1337 = !DILocation(line: 214, column: 35, scope: !1170)
!1338 = !{!1339, !1220, i64 304}
!1339 = !{!"_ImageInfo", !1210, i64 0, !1210, i64 4, !1210, i64 8, !1210, i64 12, !1210, i64 16, !1210, i64 20, !1220, i64 24, !1220, i64 32, !1220, i64 40, !1220, i64 48, !1219, i64 56, !1219, i64 64, !1219, i64 72, !1210, i64 80, !1210, i64 84, !1210, i64 88, !1219, i64 96, !1220, i64 104, !1220, i64 112, !1220, i64 120, !1220, i64 128, !1220, i64 136, !1223, i64 144, !1223, i64 152, !1221, i64 160, !1221, i64 168, !1221, i64 176, !1210, i64 184, !1210, i64 188, !1219, i64 192, !1210, i64 200, !1210, i64 204, !1210, i64 208, !1219, i64 216, !1210, i64 224, !1210, i64 228, !1220, i64 232, !1220, i64 240, !1210, i64 248, !1220, i64 256, !1220, i64 264, !1220, i64 272, !1220, i64 280, !1220, i64 288, !1220, i64 296, !1220, i64 304, !1220, i64 312, !1219, i64 320, !1210, i64 328, !1210, i64 4424, !1210, i64 8520, !1210, i64 12616, !1210, i64 16712, !1220, i64 16720, !1219, i64 16728, !1219, i64 16736, !1221, i64 16744, !1219, i64 16752, !1210, i64 16760, !1221, i64 16764, !1220, i64 16776, !1210, i64 16784}
!1340 = !DILocation(line: 214, column: 40, scope: !1170)
!1341 = !DILocation(line: 214, column: 23, scope: !1170)
!1342 = !DILocation(line: 214, column: 3, scope: !1170)
!1343 = !DILocation(line: 216, column: 34, scope: !1170)
!1344 = !DILocation(line: 216, column: 55, scope: !1170)
!1345 = !DILocation(line: 216, column: 10, scope: !1170)
!1346 = !DILocation(line: 217, column: 34, scope: !1170)
!1347 = !DILocation(line: 217, column: 10, scope: !1170)
!1348 = !DILocation(line: 219, column: 53, scope: !1170)
!1349 = !DILocation(line: 219, column: 10, scope: !1170)
!1350 = !DILocation(line: 220, column: 19, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 220, column: 7)
!1352 = !{!1339, !1220, i64 24}
!1353 = !DILocation(line: 220, column: 24, scope: !1351)
!1354 = !DILocation(line: 220, column: 7, scope: !1170)
!1355 = !DILocation(line: 222, column: 61, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1351, file: !1075, line: 221, column: 5)
!1357 = !DILocation(line: 222, column: 14, scope: !1356)
!1358 = !DILocation(line: 223, column: 42, scope: !1356)
!1359 = !{!1218, !1219, i64 312}
!1360 = !DILocation(line: 223, column: 14, scope: !1356)
!1361 = !DILocation(line: 223, column: 21, scope: !1356)
!1362 = !{!1218, !1219, i64 40}
!1363 = !DILocation(line: 224, column: 39, scope: !1356)
!1364 = !{!1218, !1219, i64 320}
!1365 = !DILocation(line: 224, column: 14, scope: !1356)
!1366 = !DILocation(line: 224, column: 18, scope: !1356)
!1367 = !{!1218, !1219, i64 48}
!1368 = !DILocation(line: 225, column: 41, scope: !1356)
!1369 = !{!1218, !1219, i64 328}
!1370 = !DILocation(line: 225, column: 14, scope: !1356)
!1371 = !DILocation(line: 225, column: 20, scope: !1356)
!1372 = !{!1218, !1219, i64 256}
!1373 = !DILocation(line: 227, column: 28, scope: !1356)
!1374 = !DILocation(line: 228, column: 5, scope: !1356)
!1375 = !DILocation(line: 229, column: 19, scope: !1184)
!1376 = !{!1339, !1220, i64 32}
!1377 = !DILocation(line: 229, column: 27, scope: !1184)
!1378 = !DILocation(line: 229, column: 7, scope: !1170)
!1379 = !DILocation(line: 231, column: 7, scope: !1183)
!1380 = !DILocation(line: 232, column: 9, scope: !1183)
!1381 = !DILocation(line: 234, column: 13, scope: !1183)
!1382 = !DILocation(line: 235, column: 35, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1183, file: !1075, line: 235, column: 11)
!1384 = !DILocation(line: 237, column: 18, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1383, file: !1075, line: 236, column: 9)
!1386 = !DILocation(line: 237, column: 31, scope: !1385)
!1387 = !{i64 0, i64 8, !1388, i64 8, i64 8, !1388, i64 16, i64 8, !1388, i64 24, i64 8, !1388}
!1388 = !{!1219, !1219, i64 0}
!1389 = !DILocation(line: 238, column: 11, scope: !1385)
!1390 = !DILocation(line: 239, column: 11, scope: !1385)
!1391 = !DILocation(line: 240, column: 9, scope: !1385)
!1392 = !DILocation(line: 241, column: 5, scope: !1184)
!1393 = !DILocation(line: 241, column: 5, scope: !1183)
!1394 = !DILocation(line: 242, column: 34, scope: !1170)
!1395 = !{!1339, !1210, i64 0}
!1396 = !DILocation(line: 242, column: 10, scope: !1170)
!1397 = !DILocation(line: 242, column: 21, scope: !1170)
!1398 = !{!1218, !1210, i64 8}
!1399 = !DILocation(line: 243, column: 30, scope: !1170)
!1400 = !{!1339, !1219, i64 96}
!1401 = !DILocation(line: 243, column: 10, scope: !1170)
!1402 = !DILocation(line: 243, column: 17, scope: !1170)
!1403 = !{!1218, !1219, i64 16}
!1404 = !DILocation(line: 244, column: 29, scope: !1170)
!1405 = !{!1339, !1210, i64 84}
!1406 = !DILocation(line: 244, column: 10, scope: !1170)
!1407 = !DILocation(line: 244, column: 16, scope: !1170)
!1408 = !{!1218, !1210, i64 408}
!1409 = !DILocation(line: 245, column: 32, scope: !1170)
!1410 = !{!1339, !1210, i64 80}
!1411 = !DILocation(line: 245, column: 19, scope: !1170)
!1412 = !DILocation(line: 246, column: 28, scope: !1170)
!1413 = !{!1339, !1210, i64 88}
!1414 = !DILocation(line: 246, column: 10, scope: !1170)
!1415 = !DILocation(line: 246, column: 15, scope: !1170)
!1416 = !{!1218, !1210, i64 224}
!1417 = !DILocation(line: 247, column: 19, scope: !1187)
!1418 = !{!1339, !1220, i64 136}
!1419 = !DILocation(line: 247, column: 27, scope: !1187)
!1420 = !DILocation(line: 247, column: 7, scope: !1170)
!1421 = !DILocation(line: 249, column: 7, scope: !1186)
!1422 = !DILocation(line: 250, column: 9, scope: !1186)
!1423 = !DILocation(line: 252, column: 13, scope: !1186)
!1424 = !DILocation(line: 253, column: 41, scope: !1186)
!1425 = !{!1426, !1223, i64 0}
!1426 = !{!"_GeometryInfo", !1223, i64 0, !1223, i64 8, !1223, i64 16, !1223, i64 24, !1223, i64 32}
!1427 = !DILocation(line: 253, column: 14, scope: !1186)
!1428 = !DILocation(line: 253, column: 26, scope: !1186)
!1429 = !{!1218, !1223, i64 264}
!1430 = !DILocation(line: 254, column: 41, scope: !1186)
!1431 = !{!1426, !1223, i64 8}
!1432 = !DILocation(line: 254, column: 14, scope: !1186)
!1433 = !DILocation(line: 255, column: 18, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1186, file: !1075, line: 255, column: 11)
!1435 = !DILocation(line: 255, column: 32, scope: !1434)
!1436 = !DILocation(line: 255, column: 11, scope: !1186)
!1437 = !DILocation(line: 0, scope: !1186)
!1438 = !DILocation(line: 257, column: 5, scope: !1187)
!1439 = !DILocation(line: 257, column: 5, scope: !1186)
!1440 = !DILocation(line: 258, column: 19, scope: !1198)
!1441 = !{!1339, !1220, i64 40}
!1442 = !DILocation(line: 258, column: 24, scope: !1198)
!1443 = !DILocation(line: 258, column: 7, scope: !1170)
!1444 = !DILocation(line: 263, column: 14, scope: !1197)
!1445 = !DILocation(line: 263, column: 26, scope: !1197)
!1446 = !DILocation(line: 264, column: 44, scope: !1197)
!1447 = !DILocation(line: 264, column: 16, scope: !1197)
!1448 = !DILocation(line: 0, scope: !1197)
!1449 = !DILocation(line: 265, column: 14, scope: !1197)
!1450 = !DILocation(line: 266, column: 16, scope: !1197)
!1451 = !DILocation(line: 267, column: 5, scope: !1197)
!1452 = !DILocation(line: 268, column: 19, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 268, column: 7)
!1454 = !{!1339, !1219, i64 72}
!1455 = !DILocation(line: 268, column: 25, scope: !1453)
!1456 = !DILocation(line: 268, column: 7, scope: !1170)
!1457 = !DILocation(line: 269, column: 17, scope: !1453)
!1458 = !DILocation(line: 269, column: 5, scope: !1453)
!1459 = !DILocation(line: 270, column: 29, scope: !1170)
!1460 = !{!1339, !1210, i64 184}
!1461 = !DILocation(line: 270, column: 10, scope: !1170)
!1462 = !DILocation(line: 270, column: 16, scope: !1170)
!1463 = !{!1218, !1210, i64 13188}
!1464 = !DILocation(line: 271, column: 39, scope: !1170)
!1465 = !DILocation(line: 272, column: 35, scope: !1170)
!1466 = !DILocation(line: 273, column: 34, scope: !1170)
!1467 = !DILocation(line: 274, column: 40, scope: !1170)
!1468 = !DILocation(line: 275, column: 27, scope: !1170)
!1469 = !{!1339, !1210, i64 224}
!1470 = !DILocation(line: 275, column: 14, scope: !1170)
!1471 = !DILocation(line: 276, column: 39, scope: !1170)
!1472 = !{!1339, !1220, i64 272}
!1473 = !DILocation(line: 276, column: 10, scope: !1170)
!1474 = !DILocation(line: 276, column: 26, scope: !1170)
!1475 = !{!1218, !1220, i64 568}
!1476 = !DILocation(line: 277, column: 34, scope: !1170)
!1477 = !{!1339, !1220, i64 280}
!1478 = !DILocation(line: 277, column: 10, scope: !1170)
!1479 = !DILocation(line: 277, column: 21, scope: !1170)
!1480 = !{!1218, !1220, i64 576}
!1481 = !DILocation(line: 278, column: 19, scope: !1482)
!1482 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 278, column: 7)
!1483 = !{!1339, !1220, i64 288}
!1484 = !DILocation(line: 278, column: 25, scope: !1482)
!1485 = !DILocation(line: 278, column: 7, scope: !1170)
!1486 = !DILocation(line: 279, column: 35, scope: !1482)
!1487 = !DILocation(line: 279, column: 5, scope: !1482)
!1488 = !DILocation(line: 280, column: 10, scope: !1170)
!1489 = !DILocation(line: 281, column: 10, scope: !1170)
!1490 = !DILocation(line: 282, column: 14, scope: !1201)
!1491 = !DILocation(line: 282, column: 7, scope: !1170)
!1492 = !DILocation(line: 284, column: 7, scope: !1200)
!1493 = !DILocation(line: 285, column: 9, scope: !1200)
!1494 = !DILocation(line: 287, column: 13, scope: !1200)
!1495 = !DILocation(line: 288, column: 18, scope: !1496)
!1496 = distinct !DILexicalBlock(scope: !1200, file: !1075, line: 288, column: 11)
!1497 = !DILocation(line: 288, column: 34, scope: !1496)
!1498 = !DILocation(line: 288, column: 11, scope: !1200)
!1499 = !DILocation(line: 290, column: 22, scope: !1500)
!1500 = distinct !DILexicalBlock(scope: !1501, file: !1075, line: 290, column: 15)
!1501 = distinct !DILexicalBlock(scope: !1496, file: !1075, line: 289, column: 9)
!1502 = !{!1218, !1219, i64 440}
!1503 = !DILocation(line: 290, column: 59, scope: !1500)
!1504 = !DILocation(line: 290, column: 62, scope: !1500)
!1505 = !DILocation(line: 290, column: 39, scope: !1500)
!1506 = !DILocation(line: 290, column: 30, scope: !1500)
!1507 = !DILocation(line: 290, column: 28, scope: !1500)
!1508 = !DILocation(line: 290, column: 15, scope: !1501)
!1509 = !DILocation(line: 291, column: 25, scope: !1500)
!1510 = !DILocation(line: 291, column: 13, scope: !1500)
!1511 = !DILocation(line: 294, column: 20, scope: !1512)
!1512 = distinct !DILexicalBlock(scope: !1496, file: !1075, line: 294, column: 13)
!1513 = !DILocation(line: 294, column: 33, scope: !1512)
!1514 = !DILocation(line: 294, column: 13, scope: !1496)
!1515 = !DILocation(line: 296, column: 24, scope: !1516)
!1516 = distinct !DILexicalBlock(scope: !1517, file: !1075, line: 296, column: 17)
!1517 = distinct !DILexicalBlock(scope: !1512, file: !1075, line: 295, column: 11)
!1518 = !DILocation(line: 296, column: 61, scope: !1516)
!1519 = !DILocation(line: 296, column: 64, scope: !1516)
!1520 = !DILocation(line: 296, column: 41, scope: !1516)
!1521 = !DILocation(line: 296, column: 32, scope: !1516)
!1522 = !DILocation(line: 296, column: 30, scope: !1516)
!1523 = !DILocation(line: 296, column: 17, scope: !1517)
!1524 = !DILocation(line: 297, column: 69, scope: !1516)
!1525 = !DILocation(line: 297, column: 74, scope: !1516)
!1526 = !DILocation(line: 297, column: 49, scope: !1516)
!1527 = !DILocation(line: 297, column: 39, scope: !1516)
!1528 = !DILocation(line: 297, column: 38, scope: !1516)
!1529 = !DILocation(line: 297, column: 15, scope: !1516)
!1530 = !DILocation(line: 300, column: 53, scope: !1512)
!1531 = !DILocation(line: 300, column: 56, scope: !1512)
!1532 = !DILocation(line: 300, column: 33, scope: !1512)
!1533 = !DILocation(line: 300, column: 24, scope: !1512)
!1534 = !DILocation(line: 300, column: 18, scope: !1512)
!1535 = !DILocation(line: 300, column: 23, scope: !1512)
!1536 = !DILocation(line: 301, column: 18, scope: !1537)
!1537 = distinct !DILexicalBlock(scope: !1200, file: !1075, line: 301, column: 11)
!1538 = !DILocation(line: 301, column: 32, scope: !1537)
!1539 = !DILocation(line: 301, column: 11, scope: !1200)
!1540 = !DILocation(line: 302, column: 63, scope: !1537)
!1541 = !DILocation(line: 302, column: 68, scope: !1537)
!1542 = !DILocation(line: 302, column: 43, scope: !1537)
!1543 = !DILocation(line: 302, column: 33, scope: !1537)
!1544 = !DILocation(line: 302, column: 32, scope: !1537)
!1545 = !DILocation(line: 302, column: 9, scope: !1537)
!1546 = !DILocation(line: 303, column: 5, scope: !1201)
!1547 = !DILocation(line: 303, column: 5, scope: !1200)
!1548 = !DILocation(line: 304, column: 10, scope: !1170)
!1549 = !DILocation(line: 305, column: 14, scope: !1550)
!1550 = distinct !DILexicalBlock(scope: !1170, file: !1075, line: 305, column: 7)
!1551 = !DILocation(line: 305, column: 7, scope: !1170)
!1552 = !DILocation(line: 306, column: 34, scope: !1550)
!1553 = !DILocation(line: 306, column: 20, scope: !1550)
!1554 = !DILocation(line: 306, column: 12, scope: !1550)
!1555 = !DILocation(line: 306, column: 19, scope: !1550)
!1556 = !{!1218, !1210, i64 420}
!1557 = !DILocation(line: 306, column: 5, scope: !1550)
!1558 = !DILocation(line: 309, column: 1, scope: !1170)
!1559 = !DISubprogram(name: "LogMagickEvent", scope: !447, file: !447, line: 83, type: !1560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!651, !1562, !768, !768, !916, !768, null}
!1562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1563)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !447, line: 58, baseType: !446)
!1564 = !{}
!1565 = !DISubprogram(name: "AcquireMagickMemory", scope: !1566, file: !1566, line: 40, type: !1567, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1566 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!690, !916}
!1569 = !DISubprogram(name: "GetExceptionInfo", scope: !255, file: !255, line: 166, type: !1570, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{null, !1021}
!1572 = !DISubprogram(name: "GetExceptionMessage", scope: !255, file: !255, line: 137, type: !1573, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!694, !1575}
!1575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!1576 = !DISubprogram(name: "ThrowMagickException", scope: !255, file: !255, line: 156, type: !1577, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!651, !1021, !768, !768, !916, !1579, !768, !768, null}
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!1580 = !DISubprogram(name: "DestroyString", scope: !996, file: !996, line: 46, type: !1581, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{!694, !694}
!1583 = !DISubprogram(name: "CatchException", scope: !255, file: !255, line: 164, type: !1570, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1584 = !DISubprogram(name: "DestroyExceptionInfo", scope: !255, file: !255, line: 148, type: !1585, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1585 = !DISubroutineType(types: !1586)
!1586 = !{!1021, !1021}
!1587 = !DISubprogram(name: "MagickCoreTerminus", scope: !591, file: !591, line: 147, type: !1588, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{null}
!1590 = !DISubprogram(name: "ResetMagickMemory", scope: !1566, file: !1566, line: 52, type: !1591, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!690, !690, !501, !916}
!1593 = !DISubprogram(name: "CopyMagickString", scope: !996, file: !996, line: 78, type: !1594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{!646, !694, !768, !916}
!1596 = !DISubprogram(name: "QueryColorDatabase", scope: !741, file: !741, line: 87, type: !1597, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!651, !768, !658, !1021}
!1599 = !DISubprogram(name: "GetTimerInfo", scope: !249, file: !249, line: 65, type: !1600, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{null, !1602}
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!1603 = !DISubprogram(name: "AcquirePixelCache", scope: !1604, file: !1604, line: 220, type: !1605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1604 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "6b4e371270617573d29dc6ff902677c8")
!1605 = !DISubroutineType(types: !1606)
!1606 = !{!1607, !916}
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cache", file: !1604, line: 33, baseType: !690)
!1608 = !DISubprogram(name: "CloneBlobInfo", scope: !624, file: !624, line: 62, type: !1609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{!784, !1611}
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!1613 = !DISubprogram(name: "time", scope: !1614, file: !1614, line: 75, type: !1615, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1614 = !DIFile(filename: "/usr/include/time.h", directory: "", checksumkind: CSK_MD5, checksum: "2dc9fb937b28c900f98919b5c35320c2")
!1615 = !DISubroutineType(types: !1616)
!1616 = !{!849, !855}
!1617 = !DISubprogram(name: "IsEventLogging", scope: !447, file: !447, line: 80, type: !1618, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{!651}
!1620 = !DISubprogram(name: "AllocateSemaphoreInfo", scope: !809, file: !809, line: 32, type: !1621, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!807}
!1623 = !DISubprogram(name: "SetBlobExempt", scope: !1624, file: !1624, line: 70, type: !1625, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1624 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "aeac60f5bee0fb1a4f0bd1456ae975f0")
!1625 = !DISubroutineType(types: !1626)
!1626 = !{null, !635, !1627}
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!1628 = !DISubprogram(name: "ParseAbsoluteGeometry", scope: !155, file: !155, line: 141, type: !1629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!1043, !768, !1631}
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!1632 = !DISubprogram(name: "ParseGeometry", scope: !155, file: !155, line: 143, type: !1633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!1043, !768, !1635}
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1636 = !DISubprogram(name: "GetPageGeometry", scope: !155, file: !155, line: 133, type: !1637, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!694, !768}
!1639 = !DISubprogram(name: "ClonePixelCacheMethods", scope: !1604, file: !1604, line: 267, type: !1640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1564)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{null, !1607, !1642}
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1607)
!1643 = distinct !DISubprogram(name: "SyncImageSettings", scope: !1075, file: !1075, line: 3522, type: !1025, scopeLine: 3524, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1644)
!1644 = !{!1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1656, !1659}
!1645 = !DILocalVariable(name: "image_info", arg: 1, scope: !1643, file: !1075, line: 3522, type: !1019)
!1646 = !DILocalVariable(name: "image", arg: 2, scope: !1643, file: !1075, line: 3523, type: !635)
!1647 = !DILocalVariable(name: "property", scope: !1643, file: !1075, line: 3526, type: !788)
!1648 = !DILocalVariable(name: "option", scope: !1643, file: !1075, line: 3529, type: !768)
!1649 = !DILocalVariable(name: "value", scope: !1643, file: !1075, line: 3530, type: !768)
!1650 = !DILocalVariable(name: "geometry_info", scope: !1643, file: !1075, line: 3533, type: !1188)
!1651 = !DILocalVariable(name: "flags", scope: !1643, file: !1075, line: 3536, type: !1043)
!1652 = !DILocalVariable(name: "units", scope: !1643, file: !1075, line: 3539, type: !692)
!1653 = !DILocalVariable(name: "geometry_info", scope: !1654, file: !1075, line: 3592, type: !1188)
!1654 = distinct !DILexicalBlock(scope: !1655, file: !1075, line: 3590, column: 5)
!1655 = distinct !DILexicalBlock(scope: !1643, file: !1075, line: 3589, column: 7)
!1656 = !DILocalVariable(name: "geometry", scope: !1657, file: !1075, line: 3660, type: !694)
!1657 = distinct !DILexicalBlock(scope: !1658, file: !1075, line: 3658, column: 5)
!1658 = distinct !DILexicalBlock(scope: !1643, file: !1075, line: 3657, column: 7)
!1659 = !DILocalVariable(name: "geometry", scope: !1660, file: !1075, line: 3691, type: !694)
!1660 = distinct !DILexicalBlock(scope: !1661, file: !1075, line: 3689, column: 5)
!1661 = distinct !DILexicalBlock(scope: !1643, file: !1075, line: 3688, column: 7)
!1662 = !DILocation(line: 0, scope: !1643)
!1663 = !DILocation(line: 3525, column: 3, scope: !1643)
!1664 = !DILocation(line: 3526, column: 5, scope: !1643)
