; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/common/index_decoder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/index_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_stream = type { ptr, i64, i64, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }
%struct.lzma_next_coder_s = type { ptr, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.lzma_coder_s = type { i32, i64, ptr, ptr, i64, i64, i64, i64, i32 }

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_index_decoder(ptr noundef %strm, ptr noundef %i, i64 noundef %memlimit) local_unnamed_addr #0 !dbg !172 {
entry:
  call void @llvm.dbg.value(metadata ptr %strm, metadata !201, metadata !DIExpression()), !dbg !209
  call void @llvm.dbg.value(metadata ptr %i, metadata !202, metadata !DIExpression()), !dbg !209
  call void @llvm.dbg.value(metadata i64 %memlimit, metadata !203, metadata !DIExpression()), !dbg !209
  %call = tail call i32 @lzma_strm_init(ptr noundef %strm) #4, !dbg !210
  call void @llvm.dbg.value(metadata i32 %call, metadata !204, metadata !DIExpression()), !dbg !211
  %cmp.not = icmp eq i32 %call, 0, !dbg !212
  br i1 %cmp.not, label %do.end, label %return


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !163, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/index_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "76d3749acf8859145be85842b26a6ac3")
!2 = !{!3, !19, !25, !32, !131, !134}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !34, file: !33, line: 187, baseType: !5, size: 32, elements: !124)
!33 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !33, line: 179, size: 704, elements: !35)
!35 = !{!36, !116, !117, !118, !123}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 181, baseType: !37, size: 512)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !33, line: 80, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !33, line: 124, size: 512, elements: !39)
!39 = !{!40, !43, !51, !54, !87, !92, !99, !104}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !38, file: !33, line: 126, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !33, line: 78, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !38, file: !33, line: 130, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !45, line: 63, baseType: !46)
!45 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 27, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !49, line: 45, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!50 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !38, file: !33, line: 136, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !53, line: 90, baseType: !50)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !38, file: !33, line: 139, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !33, line: 94, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !41, !60, !76, !82, !69, !84, !82, !69, !86}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !63)
!63 = !{!64, !71, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !62, file: !4, line: 376, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !68, !69, !69}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !50)
!70 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !62, file: !4, line: 390, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !68, !68}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !62, file: !4, line: 401, baseType: !68, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !47, line: 24, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !49, line: 38, baseType: !81)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !38, file: !33, line: 144, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !33, line: 102, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !41, !60}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !38, file: !33, line: 148, baseType: !93, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !38, file: !33, line: 152, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!59, !41, !103, !103, !46}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !38, file: !33, line: 157, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!59, !41, !60, !108, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !111, line: 65, baseType: !112)
!111 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 43, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !111, line: 54, baseType: !44, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !112, file: !111, line: 63, baseType: !68, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !34, file: !33, line: 194, baseType: !32, size: 32, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !34, file: !33, line: 199, baseType: !69, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !34, file: !33, line: 202, baseType: !119, size: 32, offset: 640)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 32, elements: !121)
!120 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!121 = !{!122}
!122 = !DISubrange(count: 4)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !34, file: !33, line: 206, baseType: !120, size: 8, offset: 672)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!126 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!127 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!128 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!129 = !DIEnumerator(name: "ISEQ_END", value: 4)
!130 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !132)
!132 = !{!133}
!133 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !136, file: !135, line: 18, baseType: !5, size: 32, elements: !154)
!135 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/index_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "76d3749acf8859145be85842b26a6ac3")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !135, line: 17, size: 576, elements: !137)
!137 = !{!138, !139, !140, !145, !147, !148, !149, !150, !151}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !136, file: !135, line: 27, baseType: !134, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "memlimit", scope: !136, file: !135, line: 30, baseType: !46, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !136, file: !135, line: 33, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index", file: !143, line: 37, baseType: !144)
!143 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/index.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "923fbd07d3b348bf7a676d089b5c066f")
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_s", file: !143, line: 37, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "index_ptr", scope: !136, file: !135, line: 37, baseType: !146, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !136, file: !135, line: 40, baseType: !44, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_size", scope: !136, file: !135, line: 43, baseType: !44, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !136, file: !135, line: 46, baseType: !44, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !136, file: !135, line: 49, baseType: !69, size: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !136, file: !135, line: 52, baseType: !152, size: 32, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 26, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !49, line: 42, baseType: !5)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162}
!155 = !DIEnumerator(name: "SEQ_INDICATOR", value: 0)
!156 = !DIEnumerator(name: "SEQ_COUNT", value: 1)
!157 = !DIEnumerator(name: "SEQ_MEMUSAGE", value: 2)
!158 = !DIEnumerator(name: "SEQ_UNPADDED", value: 3)
!159 = !DIEnumerator(name: "SEQ_UNCOMPRESSED", value: 4)
!160 = !DIEnumerator(name: "SEQ_PADDING_INIT", value: 5)
!161 = !DIEnumerator(name: "SEQ_PADDING", value: 6)
!162 = !DIEnumerator(name: "SEQ_CRC32", value: 7)
!163 = !{!68, !52, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!165 = !{i32 7, !"Dwarf Version", i32 5}
!166 = !{i32 2, !"Debug Info Version", i32 3}
!167 = !{i32 1, !"wchar_size", i32 4}
!168 = !{i32 7, !"PIC Level", i32 2}
!169 = !{i32 7, !"PIE Level", i32 2}
!170 = !{i32 7, !"uwtable", i32 2}
!171 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!172 = distinct !DISubprogram(name: "lzma_index_decoder", scope: !135, file: !135, line: 294, type: !173, scopeLine: 295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !200)
!173 = !DISubroutineType(types: !174)
!174 = !{!59, !175, !146, !46}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !189, !190, !191, !192, !193, !194, !195, !196, !197, !199}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !177, file: !4, line: 454, baseType: !77, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !177, file: !4, line: 455, baseType: !69, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !177, file: !4, line: 456, baseType: !46, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !177, file: !4, line: 458, baseType: !85, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !177, file: !4, line: 459, baseType: !69, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !177, file: !4, line: 460, baseType: !46, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !177, file: !4, line: 468, baseType: !60, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !177, file: !4, line: 471, baseType: !187, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !34)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !177, file: !4, line: 479, baseType: !68, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !177, file: !4, line: 480, baseType: !68, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !177, file: !4, line: 481, baseType: !68, size: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !177, file: !4, line: 482, baseType: !68, size: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !177, file: !4, line: 483, baseType: !46, size: 64, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !177, file: !4, line: 484, baseType: !46, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !177, file: !4, line: 485, baseType: !69, size: 64, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !177, file: !4, line: 486, baseType: !69, size: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !177, file: !4, line: 487, baseType: !198, size: 32, offset: 1024)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !131)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !177, file: !4, line: 488, baseType: !198, size: 32, offset: 1056)
!200 = !{!201, !202, !203, !204, !208}
!201 = !DILocalVariable(name: "strm", arg: 1, scope: !172, file: !135, line: 294, type: !175)
!202 = !DILocalVariable(name: "i", arg: 2, scope: !172, file: !135, line: 294, type: !146)
!203 = !DILocalVariable(name: "memlimit", arg: 3, scope: !172, file: !135, line: 294, type: !46)
!204 = !DILocalVariable(name: "ret_", scope: !205, file: !135, line: 296, type: !207)
!205 = distinct !DILexicalBlock(scope: !206, file: !135, line: 296, column: 2)
!206 = distinct !DILexicalBlock(scope: !172, file: !135, line: 296, column: 2)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!208 = !DILocalVariable(name: "ret_", scope: !206, file: !135, line: 296, type: !207)
!209 = !DILocation(line: 0, scope: !172)
!210 = !DILocation(line: 296, column: 2, scope: !205)
!211 = !DILocation(line: 0, scope: !205)
!212 = !DILocation(line: 296, column: 2, scope: !213)
!213 = distinct !DILexicalBlock(scope: !205, file: !135, line: 296, column: 2)
!214 = !DILocation(line: 296, column: 2, scope: !206)
!215 = !{!216, !217, i64 56}
!216 = !{!"", !217, i64 0, !220, i64 8, !220, i64 16, !217, i64 24, !220, i64 32, !220, i64 40, !217, i64 48, !217, i64 56, !217, i64 64, !217, i64 72, !217, i64 80, !217, i64 88, !220, i64 96, !220, i64 104, !220, i64 112, !220, i64 120, !218, i64 128, !218, i64 132}
!217 = !{!"any pointer", !218, i64 0}
!218 = !{!"omnipotent char", !219, i64 0}
!219 = !{!"Simple C/C++ TBAA"}
!220 = !{!"long", !218, i64 0}
!221 = !{!216, !217, i64 48}
!222 = !DILocation(line: 0, scope: !206)
!223 = !DILocation(line: 296, column: 2, scope: !224)
!224 = distinct !DILexicalBlock(scope: !206, file: !135, line: 296, column: 2)
!225 = !DILocation(line: 296, column: 2, scope: !226)
!226 = distinct !DILexicalBlock(scope: !224, file: !135, line: 296, column: 2)
!227 = !DILocation(line: 298, column: 8, scope: !172)
!228 = !DILocation(line: 298, column: 18, scope: !172)
!229 = !DILocation(line: 298, column: 46, scope: !172)
!230 = !{!231, !231, i64 0}
!231 = !{!"_Bool", !218, i64 0}
!232 = !DILocation(line: 299, column: 2, scope: !172)
!233 = !DILocation(line: 299, column: 49, scope: !172)
!234 = !DILocation(line: 301, column: 2, scope: !172)
!235 = !DILocation(line: 302, column: 1, scope: !172)
!236 = !DISubprogram(name: "lzma_strm_init", scope: !33, file: !33, line: 220, type: !237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !239)
!237 = !DISubroutineType(types: !238)
!238 = !{!59, !175}
!239 = !{}
!240 = distinct !DISubprogram(name: "index_decoder_init", scope: !135, file: !135, line: 268, type: !241, scopeLine: 270, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !244)
!241 = !DISubroutineType(types: !242)
!242 = !{!59, !243, !60, !146, !46}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!244 = !{!245, !246, !247, !248}
!245 = !DILocalVariable(name: "next", arg: 1, scope: !240, file: !135, line: 268, type: !243)
!246 = !DILocalVariable(name: "allocator", arg: 2, scope: !240, file: !135, line: 268, type: !60)
!247 = !DILocalVariable(name: "i", arg: 3, scope: !240, file: !135, line: 269, type: !146)
!248 = !DILocalVariable(name: "memlimit", arg: 4, scope: !240, file: !135, line: 269, type: !46)
!249 = !DILocation(line: 0, scope: !240)
!250 = !DILocation(line: 271, column: 2, scope: !251)
!251 = distinct !DILexicalBlock(scope: !252, file: !135, line: 271, column: 2)
!252 = distinct !DILexicalBlock(scope: !240, file: !135, line: 271, column: 2)
!253 = !{!254, !220, i64 16}
!254 = !{!"lzma_next_coder_s", !217, i64 0, !220, i64 8, !220, i64 16, !217, i64 24, !217, i64 32, !217, i64 40, !217, i64 48, !217, i64 56}
!255 = !DILocation(line: 271, column: 2, scope: !252)
!256 = !DILocation(line: 273, column: 8, scope: !257)
