; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/common/index_hash.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/index_hash.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_index_hash_s = type { i32, %struct.lzma_index_hash_info, %struct.lzma_index_hash_info, i64, i64, i64, i64, i32 }
%struct.lzma_index_hash_info = type { i64, i64, i64, i64, %struct.lzma_check_state }
%struct.lzma_check_state = type { %union.anon, %union.anon.0 }
%union.anon = type { [8 x i64] }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { [8 x i32], i64 }

; Function Attrs: nounwind uwtable
define dso_local ptr @lzma_index_hash_init(ptr noundef %index_hash, ptr noundef %allocator) local_unnamed_addr #0 !dbg !109 {
entry:
  call void @llvm.dbg.value(metadata ptr %index_hash, metadata !129, metadata !DIExpression()), !dbg !131
  call void @llvm.dbg.value(metadata ptr %allocator, metadata !130, metadata !DIExpression()), !dbg !131
  %cmp = icmp eq ptr %index_hash, null, !dbg !132
  br i1 %cmp, label %if.then, label %if.end3, !dbg !134

if.then:                                          ; preds = %entry
  %call = tail call ptr @lzma_alloc(i64 noundef 320, ptr noundef %allocator) #6, !dbg !135

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !98, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/index_hash.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "5b32f3be9e6ab3427cac2d3fabd9ce41")
!2 = !{!3, !76, !83}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 38, baseType: !42, size: 32, elements: !68)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/index_hash.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5b32f3be9e6ab3427cac2d3fabd9ce41")
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_hash_s", file: !4, line: 37, size: 2560, elements: !6)
!6 = !{!7, !8, !60, !61, !62, !63, !64, !67}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !5, file: !4, line: 46, baseType: !3, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !5, file: !4, line: 49, baseType: !9, size: 1088, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_hash_info", file: !4, line: 34, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 18, size: 1088, elements: !11)
!11 = !{!12, !20, !21, !22, !23}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_size", scope: !10, file: !4, line: 20, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !14, line: 63, baseType: !15)
!14 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !16, line: 27, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !18, line: 45, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!19 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !10, file: !4, line: 23, baseType: !13, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !10, file: !4, line: 26, baseType: !13, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "index_list_size", scope: !10, file: !4, line: 29, baseType: !13, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !10, file: !4, line: 32, baseType: !24, size: 832, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check_state", file: !25, line: 56, baseType: !26)
!25 = !DIFile(filename: "apps/557.xz_r/src/liblzma/check/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "938220df6e0ab33115ef85b0d8c70c5b")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 34, size: 832, elements: !27)
!27 = !{!28, !49}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !26, file: !25, line: 40, baseType: !29, size: 512)
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !26, file: !25, line: 36, size: 512, elements: !30)
!30 = !{!31, !38, !45}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !29, file: !25, line: 37, baseType: !32, size: 512)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !36)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 24, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !18, line: 38, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!37}
!37 = !DISubrange(count: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !29, file: !25, line: 38, baseType: !39, size: 512)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 512, elements: !43)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 26, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !18, line: 42, baseType: !42)
!42 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!43 = !{!44}
!44 = !DISubrange(count: 16)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !29, file: !25, line: 39, baseType: !46, size: 512)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !26, file: !25, line: 54, baseType: !50, size: 320, offset: 512)
!50 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !26, file: !25, line: 43, size: 320, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !50, file: !25, line: 44, baseType: !40, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "crc64", scope: !50, file: !25, line: 45, baseType: !15, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !50, file: !25, line: 53, baseType: !55, size: 320)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !25, line: 47, size: 320, elements: !56)
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !55, file: !25, line: 49, baseType: !58, size: 256)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !47)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !55, file: !25, line: 52, baseType: !15, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !5, file: !4, line: 52, baseType: !9, size: 1088, offset: 1152)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !5, file: !4, line: 55, baseType: !13, size: 64, offset: 2240)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_size", scope: !5, file: !4, line: 58, baseType: !13, size: 64, offset: 2304)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !5, file: !4, line: 61, baseType: !13, size: 64, offset: 2368)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !5, file: !4, line: 65, baseType: !65, size: 64, offset: 2432)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !66, line: 46, baseType: !19)
!66 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !5, file: !4, line: 68, baseType: !40, size: 32, offset: 2496)
!68 = !{!69, !70, !71, !72, !73, !74, !75}
!69 = !DIEnumerator(name: "SEQ_BLOCK", value: 0)
!70 = !DIEnumerator(name: "SEQ_COUNT", value: 1)
!71 = !DIEnumerator(name: "SEQ_UNPADDED", value: 2)
!72 = !DIEnumerator(name: "SEQ_UNCOMPRESSED", value: 3)
!73 = !DIEnumerator(name: "SEQ_PADDING_INIT", value: 4)
!74 = !DIEnumerator(name: "SEQ_PADDING", value: 5)
!75 = !DIEnumerator(name: "SEQ_CRC32", value: 6)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 27, baseType: !42, size: 32, elements: !78)
!77 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!80 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!81 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!82 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 57, baseType: !42, size: 32, elements: !85)
!84 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!86 = !DIEnumerator(name: "LZMA_OK", value: 0)
!87 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!88 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!89 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!90 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!91 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!92 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!93 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!94 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!95 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!96 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!97 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!102 = !{i32 7, !"Dwarf Version", i32 5}
!103 = !{i32 2, !"Debug Info Version", i32 3}
!104 = !{i32 1, !"wchar_size", i32 4}
!105 = !{i32 7, !"PIC Level", i32 2}
!106 = !{i32 7, !"PIE Level", i32 2}
!107 = !{i32 7, !"uwtable", i32 2}
!108 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!109 = distinct !DISubprogram(name: "lzma_index_hash_init", scope: !4, file: !4, line: 73, type: !110, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !128)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !112, !115}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_hash", file: !114, line: 25, baseType: !5)
!114 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/index_hash.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "93f41ec399d5b72fa726dbb2f572cbec")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !84, line: 403, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 341, size: 192, elements: !118)
!118 = !{!119, !123, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !117, file: !84, line: 376, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!99, !99, !65, !65}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !117, file: !84, line: 390, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !99, !99}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !117, file: !84, line: 401, baseType: !99, size: 64, offset: 128)
!128 = !{!129, !130}
!129 = !DILocalVariable(name: "index_hash", arg: 1, scope: !109, file: !4, line: 73, type: !112)
!130 = !DILocalVariable(name: "allocator", arg: 2, scope: !109, file: !4, line: 73, type: !115)
!131 = !DILocation(line: 0, scope: !109)
!132 = !DILocation(line: 75, column: 17, scope: !133)
!133 = distinct !DILexicalBlock(scope: !109, file: !4, line: 75, column: 6)
!134 = !DILocation(line: 75, column: 6, scope: !109)
!135 = !DILocation(line: 76, column: 16, scope: !136)
!136 = distinct !DILexicalBlock(scope: !133, file: !4, line: 75, column: 26)
!137 = !DILocation(line: 77, column: 18, scope: !138)
!138 = distinct !DILexicalBlock(scope: !136, file: !4, line: 77, column: 7)
!139 = !DILocation(line: 77, column: 7, scope: !136)
!140 = !DILocation(line: 81, column: 23, scope: !109)
!141 = !{!142, !143, i64 0}
!142 = !{!"lzma_index_hash_s", !143, i64 0, !145, i64 8, !145, i64 144, !146, i64 280, !146, i64 288, !146, i64 296, !146, i64 304, !148, i64 312}
!143 = !{!"omnipotent char", !144, i64 0}
!144 = !{!"Simple C/C++ TBAA"}
!145 = !{!"", !146, i64 0, !146, i64 8, !146, i64 16, !146, i64 24, !147, i64 32}
!146 = !{!"long", !143, i64 0}
!147 = !{!"", !143, i64 0, !143, i64 64}
!148 = !{!"int", !143, i64 0}
!149 = !DILocation(line: 82, column: 14, scope: !109)
!150 = !DILocation(line: 86, column: 14, scope: !109)
!151 = !DILocation(line: 90, column: 14, scope: !109)
!152 = !DILocation(line: 96, column: 44, scope: !109)
!153 = !DILocation(line: 82, column: 33, scope: !109)
!154 = !DILocation(line: 86, column: 34, scope: !109)
!155 = !DILocation(line: 90, column: 28, scope: !109)
!156 = !DILocation(line: 96, column: 8, scope: !109)
!157 = !DILocation(line: 97, column: 45, scope: !109)
!158 = !DILocation(line: 97, column: 8, scope: !109)
!159 = !DILocation(line: 99, column: 2, scope: !109)
!160 = !DILocation(line: 100, column: 1, scope: !109)
!161 = !DISubprogram(name: "lzma_alloc", scope: !162, file: !162, line: 211, type: !163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !165)
!162 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!163 = !DISubroutineType(types: !164)
!164 = !{!99, !65, !115}
!165 = !{}
!166 = !DISubprogram(name: "lzma_check_init", scope: !25, file: !25, line: 75, type: !167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !165)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !169, !170}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !77, line: 55, baseType: !76)
!171 = distinct !DISubprogram(name: "lzma_index_hash_end", scope: !4, file: !4, line: 104, type: !172, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !174)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !112, !115}
!174 = !{!175, !176}
!175 = !DILocalVariable(name: "index_hash", arg: 1, scope: !171, file: !4, line: 104, type: !112)
!176 = !DILocalVariable(name: "allocator", arg: 2, scope: !171, file: !4, line: 104, type: !115)
!177 = !DILocation(line: 0, scope: !171)
!178 = !DILocation(line: 106, column: 2, scope: !171)
!179 = !DILocation(line: 107, column: 2, scope: !171)
!180 = !DISubprogram(name: "lzma_free", scope: !162, file: !162, line: 215, type: !181, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !165)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !99, !115}
!183 = distinct !DISubprogram(name: "lzma_index_hash_size", scope: !4, file: !4, line: 112, type: !184, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !188)
