; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/layer.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/layer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!372 = !DIEnumerator(name: "NoEvents", value: 0)
!373 = !DIEnumerator(name: "TraceEvent", value: 1)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!375 = !DIEnumerator(name: "BlobEvent", value: 4)
!376 = !DIEnumerator(name: "CacheEvent", value: 8)
!377 = !DIEnumerator(name: "CoderEvent", value: 16)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!380 = !DIEnumerator(name: "DrawEvent", value: 128)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!382 = !DIEnumerator(name: "ImageEvent", value: 512)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384)
!388 = !DIEnumerator(name: "UserEvent", value: 36864)
!389 = !DIEnumerator(name: "WandEvent", value: 65536)
!390 = !DIEnumerator(name: "X11Event", value: 131072)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 34, baseType: !5, size: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!395 = !DIEnumerator(name: "UndefinedLayer", value: 0)
!396 = !DIEnumerator(name: "CoalesceLayer", value: 1)
!397 = !DIEnumerator(name: "CompareAnyLayer", value: 2)
!398 = !DIEnumerator(name: "CompareClearLayer", value: 3)
!399 = !DIEnumerator(name: "CompareOverlayLayer", value: 4)
!400 = !DIEnumerator(name: "DisposeLayer", value: 5)
!401 = !DIEnumerator(name: "OptimizeLayer", value: 6)
!402 = !DIEnumerator(name: "OptimizeImageLayer", value: 7)
!403 = !DIEnumerator(name: "OptimizePlusLayer", value: 8)
!404 = !DIEnumerator(name: "OptimizeTransLayer", value: 9)
!405 = !DIEnumerator(name: "RemoveDupsLayer", value: 10)
!406 = !DIEnumerator(name: "RemoveZeroLayer", value: 11)
!407 = !DIEnumerator(name: "CompositeLayer", value: 12)
!408 = !DIEnumerator(name: "MergeLayer", value: 13)
!409 = !DIEnumerator(name: "FlattenLayer", value: 14)
!410 = !DIEnumerator(name: "MosaicLayer", value: 15)
!411 = !DIEnumerator(name: "TrimBoundsLayer", value: 16)
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!414 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!415 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!416 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!417 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!418 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!419 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!420 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!421 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!422 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!423 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!424 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!425 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!426 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!427 = !{!428, !429, !484, !493, !457, !650, !440, !651, !565, !452, !653, !655, !657, !445, !660, !524, !557}
!428 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !432)
!432 = !{!433, !435, !437, !439, !442, !444, !446, !447, !448, !449, !450, !451, !462, !463, !464, !465, !467, !481, !483, !485, !487, !490, !491, !492, !498, !499, !500, !508, !509, !510, !511, !512, !513, !515, !517, !519, !521, !523, !525, !527, !528, !529, !530, !531, !532, !533, !541, !556, !570, !571, !572, !573, !577, !581, !585, !586, !587, !588, !589, !607, !608, !610, !611, !621, !622, !624, !625, !626, !627, !628, !629, !631, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642, !643, !647, !649}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !431, file: !73, line: 153, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !431, file: !73, line: 156, baseType: !436, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !431, file: !73, line: 159, baseType: !438, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !431, file: !73, line: 162, baseType: !440, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !441, line: 46, baseType: !428)
!441 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!442 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !431, file: !73, line: 165, baseType: !443, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !431, file: !73, line: 168, baseType: !445, size: 32, offset: 224)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !431, file: !73, line: 169, baseType: !445, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !431, file: !73, line: 172, baseType: !440, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !431, file: !73, line: 173, baseType: !440, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !431, file: !73, line: 174, baseType: !440, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !431, file: !73, line: 175, baseType: !440, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !431, file: !73, line: 178, baseType: !452, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !455)
!455 = !{!456, !459, !460, !461}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !454, file: !326, line: 143, baseType: !457, size: 16)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !458)
!458 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !454, file: !326, line: 144, baseType: !457, size: 16, offset: 16)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !454, file: !326, line: 145, baseType: !457, size: 16, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !454, file: !326, line: 146, baseType: !457, size: 16, offset: 48)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !431, file: !73, line: 179, baseType: !453, size: 64, offset: 640)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !431, file: !73, line: 180, baseType: !453, size: 64, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !431, file: !73, line: 181, baseType: !453, size: 64, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !431, file: !73, line: 184, baseType: !466, size: 64, offset: 832)
!466 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !431, file: !73, line: 187, baseType: !468, size: 768, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !470)
!470 = !{!471, !478, !479, !480}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !469, file: !73, line: 124, baseType: !472, size: 192)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !473, file: !73, line: 98, baseType: !466, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !473, file: !73, line: 99, baseType: !466, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !473, file: !73, line: 100, baseType: !466, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !469, file: !73, line: 125, baseType: !472, size: 192, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !469, file: !73, line: 126, baseType: !472, size: 192, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !469, file: !73, line: 127, baseType: !472, size: 192, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !431, file: !73, line: 190, baseType: !482, size: 32, offset: 1664)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !431, file: !73, line: 193, baseType: !484, size: 64, offset: 1728)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !431, file: !73, line: 196, baseType: !486, size: 32, offset: 1792)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !431, file: !73, line: 199, baseType: !488, size: 64, offset: 1856)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !431, file: !73, line: 200, baseType: !488, size: 64, offset: 1920)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !431, file: !73, line: 201, baseType: !488, size: 64, offset: 1984)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !431, file: !73, line: 204, baseType: !493, size: 64, offset: 2048)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !494, line: 77, baseType: !495)
!494 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !496, line: 193, baseType: !497)
!496 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!497 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !431, file: !73, line: 207, baseType: !466, size: 64, offset: 2112)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !431, file: !73, line: 208, baseType: !466, size: 64, offset: 2176)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !431, file: !73, line: 211, baseType: !501, size: 256, offset: 2240)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !503)
!503 = !{!504, !505, !506, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !502, file: !153, line: 124, baseType: !440, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !502, file: !153, line: 125, baseType: !440, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !502, file: !153, line: 128, baseType: !493, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !502, file: !153, line: 129, baseType: !493, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !431, file: !73, line: 212, baseType: !501, size: 256, offset: 2496)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !431, file: !73, line: 213, baseType: !501, size: 256, offset: 2752)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !431, file: !73, line: 216, baseType: !466, size: 64, offset: 3008)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !431, file: !73, line: 217, baseType: !466, size: 64, offset: 3072)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !431, file: !73, line: 218, baseType: !466, size: 64, offset: 3136)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !431, file: !73, line: 221, baseType: !514, size: 32, offset: 3200)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !431, file: !73, line: 224, baseType: !516, size: 32, offset: 3232)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !431, file: !73, line: 227, baseType: !518, size: 32, offset: 3264)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !431, file: !73, line: 230, baseType: !520, size: 32, offset: 3296)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !431, file: !73, line: 233, baseType: !522, size: 32, offset: 3328)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !431, file: !73, line: 236, baseType: !524, size: 32, offset: 3360)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !431, file: !73, line: 239, baseType: !526, size: 64, offset: 3392)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !431, file: !73, line: 242, baseType: !440, size: 64, offset: 3456)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !431, file: !73, line: 243, baseType: !440, size: 64, offset: 3520)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !431, file: !73, line: 246, baseType: !493, size: 64, offset: 3584)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !431, file: !73, line: 249, baseType: !440, size: 64, offset: 3648)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !431, file: !73, line: 250, baseType: !440, size: 64, offset: 3712)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !431, file: !73, line: 253, baseType: !493, size: 64, offset: 3776)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !431, file: !73, line: 256, baseType: !534, size: 192, offset: 3840)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !535, line: 68, baseType: !536)
!535 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !535, line: 62, size: 192, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !536, file: !535, line: 65, baseType: !466, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !536, file: !535, line: 66, baseType: !466, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !536, file: !535, line: 67, baseType: !466, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !431, file: !73, line: 259, baseType: !542, size: 512, offset: 4032)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !544)
!544 = !{!545, !552, !553, !555}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !543, file: !247, line: 43, baseType: !546, size: 192)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !548)
!548 = !{!549, !550, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !547, file: !247, line: 35, baseType: !466, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !547, file: !247, line: 36, baseType: !466, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !547, file: !247, line: 37, baseType: !466, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !543, file: !247, line: 44, baseType: !546, size: 192, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !543, file: !247, line: 47, baseType: !554, size: 32, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !543, file: !247, line: 50, baseType: !440, size: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !431, file: !73, line: 262, baseType: !557, size: 64, offset: 4544)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !558, line: 26, baseType: !559)
!558 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!445, !562, !564, !567, !484}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !566)
!566 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !569)
!569 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !431, file: !73, line: 265, baseType: !484, size: 64, offset: 4608)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !431, file: !73, line: 266, baseType: !484, size: 64, offset: 4672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !431, file: !73, line: 267, baseType: !484, size: 64, offset: 4736)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !431, file: !73, line: 270, baseType: !574, size: 64, offset: 4800)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !576)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !431, file: !73, line: 273, baseType: !578, size: 64, offset: 4864)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !431, file: !73, line: 276, baseType: !582, size: 32768, offset: 4928)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 32768, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 4096)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !431, file: !73, line: 277, baseType: !582, size: 32768, offset: 37696)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !431, file: !73, line: 278, baseType: !582, size: 32768, offset: 70464)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !431, file: !73, line: 281, baseType: !440, size: 64, offset: 103232)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !431, file: !73, line: 282, baseType: !440, size: 64, offset: 103296)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !431, file: !73, line: 285, baseType: !590, size: 448, offset: 103360)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !592)
!592 = !{!593, !595, !597, !598, !599, !600, !601, !606}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !591, file: !253, line: 105, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !591, file: !253, line: 108, baseType: !596, size: 32, offset: 32)
!596 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !591, file: !253, line: 111, baseType: !488, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !591, file: !253, line: 112, baseType: !488, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !591, file: !253, line: 115, baseType: !484, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !591, file: !253, line: 118, baseType: !445, size: 32, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !591, file: !253, line: 121, baseType: !602, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !604, line: 26, baseType: !605)
!604 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !604, line: 25, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !591, file: !253, line: 124, baseType: !440, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !431, file: !73, line: 288, baseType: !445, size: 32, offset: 103808)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !431, file: !73, line: 291, baseType: !609, size: 64, offset: 103872)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !493)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !431, file: !73, line: 294, baseType: !602, size: 64, offset: 103936)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !431, file: !73, line: 297, baseType: !612, size: 256, offset: 104000)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !614)
!614 = !{!615, !616, !617, !620}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !89, line: 30, baseType: !488, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !613, file: !89, line: 33, baseType: !440, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !613, file: !89, line: 36, baseType: !618, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !613, file: !89, line: 39, baseType: !440, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !431, file: !73, line: 298, baseType: !612, size: 256, offset: 104256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !431, file: !73, line: 299, baseType: !623, size: 64, offset: 104512)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !431, file: !73, line: 302, baseType: !440, size: 64, offset: 104576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !431, file: !73, line: 305, baseType: !440, size: 64, offset: 104640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !431, file: !73, line: 308, baseType: !526, size: 64, offset: 104704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !431, file: !73, line: 309, baseType: !526, size: 64, offset: 104768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !73, line: 310, baseType: !526, size: 64, offset: 104832)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !431, file: !73, line: 313, baseType: !630, size: 32, offset: 104896)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !431, file: !73, line: 316, baseType: !445, size: 32, offset: 104928)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !431, file: !73, line: 319, baseType: !453, size: 64, offset: 104960)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !431, file: !73, line: 322, baseType: !526, size: 64, offset: 105024)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !431, file: !73, line: 325, baseType: !501, size: 256, offset: 105088)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !431, file: !73, line: 328, baseType: !484, size: 64, offset: 105344)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !431, file: !73, line: 329, baseType: !484, size: 64, offset: 105408)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !431, file: !73, line: 332, baseType: !638, size: 32, offset: 105472)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !431, file: !73, line: 335, baseType: !445, size: 32, offset: 105504)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !431, file: !73, line: 338, baseType: !568, size: 64, offset: 105536)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !431, file: !73, line: 341, baseType: !445, size: 32, offset: 105600)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !431, file: !73, line: 344, baseType: !440, size: 64, offset: 105664)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !431, file: !73, line: 347, baseType: !644, size: 64, offset: 105728)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !645, line: 7, baseType: !646)
!645 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !496, line: 160, baseType: !497)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !431, file: !73, line: 350, baseType: !648, size: 32, offset: 105792)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !431, file: !73, line: 353, baseType: !440, size: 64, offset: 105856)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !656)
!656 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !457)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!661 = !{i32 7, !"Dwarf Version", i32 5}
!662 = !{i32 2, !"Debug Info Version", i32 3}
!663 = !{i32 1, !"wchar_size", i32 4}
!664 = !{i32 7, !"PIC Level", i32 2}
!665 = !{i32 7, !"PIE Level", i32 2}
!666 = !{i32 7, !"uwtable", i32 2}
!667 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!668 = distinct !DISubprogram(name: "CoalesceImages", scope: !669, file: !669, line: 231, type: !670, scopeLine: 232, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !673)
!669 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f5b9f4c5532ce0d92bdff01faa9d600c")
!670 = !DISubroutineType(types: !671)
!671 = !{!429, !651, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!673 = !{!674, !675, !676, !677, !678, !679, !680}
!674 = !DILocalVariable(name: "image", arg: 1, scope: !668, file: !669, line: 231, type: !651)
!675 = !DILocalVariable(name: "exception", arg: 2, scope: !668, file: !669, line: 231, type: !672)
!676 = !DILocalVariable(name: "coalesce_image", scope: !668, file: !669, line: 234, type: !429)
!677 = !DILocalVariable(name: "dispose_image", scope: !668, file: !669, line: 235, type: !429)
!678 = !DILocalVariable(name: "previous", scope: !668, file: !669, line: 236, type: !429)
!679 = !DILocalVariable(name: "next", scope: !668, file: !669, line: 239, type: !429)
!680 = !DILocalVariable(name: "bounds", scope: !668, file: !669, line: 242, type: !501)
!681 = !DILocation(line: 0, scope: !668)
!682 = !DILocation(line: 249, column: 14, scope: !683)
!683 = distinct !DILexicalBlock(scope: !668, file: !669, line: 249, column: 7)
!684 = !{!685, !686, i64 12976}
!685 = !{!"_Image", !686, i64 0, !686, i64 4, !686, i64 8, !688, i64 16, !686, i64 24, !686, i64 28, !686, i64 32, !688, i64 40, !688, i64 48, !688, i64 56, !688, i64 64, !689, i64 72, !690, i64 80, !690, i64 88, !690, i64 96, !692, i64 104, !693, i64 112, !686, i64 208, !689, i64 216, !686, i64 224, !689, i64 232, !689, i64 240, !689, i64 248, !688, i64 256, !692, i64 264, !692, i64 272, !695, i64 280, !695, i64 312, !695, i64 344, !692, i64 376, !692, i64 384, !692, i64 392, !686, i64 400, !686, i64 404, !686, i64 408, !686, i64 412, !686, i64 416, !686, i64 420, !689, i64 424, !688, i64 432, !688, i64 440, !688, i64 448, !688, i64 456, !688, i64 464, !688, i64 472, !696, i64 480, !697, i64 504, !689, i64 568, !689, i64 576, !689, i64 584, !689, i64 592, !689, i64 600, !689, i64 608, !686, i64 616, !686, i64 4712, !686, i64 8808, !688, i64 12904, !688, i64 12912, !699, i64 12920, !686, i64 12976, !688, i64 12984, !689, i64 12992, !701, i64 13000, !701, i64 13032, !689, i64 13064, !688, i64 13072, !688, i64 13080, !689, i64 13088, !689, i64 13096, !689, i64 13104, !686, i64 13112, !686, i64 13116, !690, i64 13120, !689, i64 13128, !695, i64 13136, !689, i64 13168, !689, i64 13176, !686, i64 13184, !686, i64 13188, !702, i64 13192, !686, i64 13200, !688, i64 13208, !688, i64 13216, !686, i64 13224, !688, i64 13232}
!686 = !{!"omnipotent char", !687, i64 0}
!687 = !{!"Simple C/C++ TBAA"}
!688 = !{!"long", !686, i64 0}
!689 = !{!"any pointer", !686, i64 0}
!690 = !{!"_PixelPacket", !691, i64 0, !691, i64 2, !691, i64 4, !691, i64 6}
!691 = !{!"short", !686, i64 0}
!692 = !{!"double", !686, i64 0}
!693 = !{!"_ChromaticityInfo", !694, i64 0, !694, i64 24, !694, i64 48, !694, i64 72}
!694 = !{!"_PrimaryInfo", !692, i64 0, !692, i64 8, !692, i64 16}
!695 = !{!"_RectangleInfo", !688, i64 0, !688, i64 8, !688, i64 16, !688, i64 24}
!696 = !{!"_ErrorInfo", !692, i64 0, !692, i64 8, !692, i64 16}
!697 = !{!"_TimerInfo", !698, i64 0, !698, i64 24, !686, i64 48, !688, i64 56}
!698 = !{!"_Timer", !692, i64 0, !692, i64 8, !692, i64 16}
!699 = !{!"_ExceptionInfo", !686, i64 0, !700, i64 4, !689, i64 8, !689, i64 16, !689, i64 24, !686, i64 32, !689, i64 40, !688, i64 48}
!700 = !{!"int", !686, i64 0}
!701 = !{!"_ProfileInfo", !689, i64 0, !688, i64 8, !689, i64 16, !688, i64 24}
!702 = !{!"long long", !686, i64 0}
!703 = !DILocation(line: 249, column: 20, scope: !683)
!704 = !DILocation(line: 249, column: 7, scope: !668)
!705 = !DILocation(line: 250, column: 68, scope: !683)
!706 = !DILocation(line: 250, column: 12, scope: !683)
!707 = !DILocation(line: 250, column: 5, scope: !683)
!708 = !DILocation(line: 255, column: 8, scope: !668)
!709 = !DILocation(line: 256, column: 16, scope: !668)
!710 = !{i64 0, i64 8, !711, i64 8, i64 8, !711, i64 16, i64 8, !711, i64 24, i64 8, !711}
!711 = !{!688, !688, i64 0}
!712 = !{i64 0, i64 8, !711, i64 8, i64 8, !711, i64 16, i64 8, !711}
!713 = !{i64 0, i64 8, !711}
!714 = !DILocation(line: 257, column: 20, scope: !715)
!715 = distinct !DILexicalBlock(scope: !668, file: !669, line: 257, column: 7)
!716 = !DILocation(line: 257, column: 7, scope: !668)
!717 = !{i64 0, i64 8, !711, i64 8, i64 8, !711}
!718 = !DILocation(line: 259, column: 26, scope: !719)
!719 = distinct !DILexicalBlock(scope: !715, file: !669, line: 258, column: 5)
!720 = !{!685, !688, i64 40}
!721 = !DILocation(line: 260, column: 11, scope: !719)
!722 = !DILocation(line: 263, column: 21, scope: !723)
!723 = distinct !DILexicalBlock(scope: !668, file: !669, line: 263, column: 7)
!724 = !DILocation(line: 263, column: 7, scope: !668)
!725 = !DILocation(line: 265, column: 27, scope: !726)
!726 = distinct !DILexicalBlock(scope: !723, file: !669, line: 264, column: 5)
!727 = !{!685, !688, i64 48}
!728 = !DILocation(line: 266, column: 11, scope: !726)
!729 = !DILocation(line: 271, column: 18, scope: !668)
!730 = !DILocation(line: 273, column: 22, scope: !731)
!731 = distinct !DILexicalBlock(scope: !668, file: !669, line: 273, column: 7)
!732 = !DILocation(line: 273, column: 7, scope: !668)
!733 = !DILocation(line: 275, column: 10, scope: !668)
!734 = !DILocation(line: 276, column: 31, scope: !668)
!735 = !{!685, !686, i64 32}
!736 = !DILocation(line: 276, column: 19, scope: !668)
!737 = !DILocation(line: 276, column: 24, scope: !668)
!738 = !DILocation(line: 277, column: 19, scope: !668)
!739 = !DILocation(line: 277, column: 24, scope: !668)
!740 = !DILocation(line: 278, column: 19, scope: !668)
!741 = !DILocation(line: 278, column: 26, scope: !668)
!742 = !{!685, !686, i64 420}
!743 = !DILocation(line: 282, column: 17, scope: !668)
!744 = !DILocation(line: 283, column: 72, scope: !668)
!745 = !{!685, !688, i64 296}
!746 = !DILocation(line: 284, column: 16, scope: !668)
!747 = !{!685, !688, i64 304}
!748 = !DILocation(line: 283, column: 10, scope: !668)
!749 = !DILocation(line: 285, column: 8, scope: !668)
!750 = !DILocation(line: 286, column: 16, scope: !751)
!751 = distinct !DILexicalBlock(scope: !752, file: !669, line: 286, column: 3)
!752 = distinct !DILexicalBlock(scope: !668, file: !669, line: 286, column: 3)
!753 = !DILocation(line: 286, column: 3, scope: !752)
!754 = !DILocation(line: 291, column: 14, scope: !755)
!755 = distinct !DILexicalBlock(scope: !751, file: !669, line: 287, column: 3)
!756 = !DILocation(line: 292, column: 22, scope: !755)
!757 = !DILocation(line: 293, column: 28, scope: !755)
!758 = !DILocation(line: 294, column: 29, scope: !755)
!759 = !DILocation(line: 295, column: 9, scope: !755)
!760 = !DILocation(line: 300, column: 28, scope: !761)
!761 = distinct !DILexicalBlock(scope: !755, file: !669, line: 300, column: 9)
!762 = !DILocation(line: 300, column: 71, scope: !761)
!763 = !DILocation(line: 300, column: 43, scope: !761)
!764 = !DILocation(line: 300, column: 9, scope: !755)
!765 = !DILocation(line: 302, column: 9, scope: !755)
!766 = !DILocation(line: 307, column: 28, scope: !767)
!767 = distinct !DILexicalBlock(scope: !755, file: !669, line: 307, column: 9)
!768 = !DILocation(line: 307, column: 72, scope: !767)
!769 = !DILocation(line: 307, column: 44, scope: !767)
!770 = !DILocation(line: 307, column: 9, scope: !755)
!771 = !DILocation(line: 312, column: 9, scope: !772)
!772 = distinct !DILexicalBlock(scope: !755, file: !669, line: 312, column: 9)
!773 = !DILocation(line: 312, column: 39, scope: !772)
!774 = !DILocation(line: 312, column: 47, scope: !772)
!775 = !DILocation(line: 312, column: 9, scope: !755)
!776 = !DILocation(line: 314, column: 23, scope: !777)
!777 = distinct !DILexicalBlock(scope: !772, file: !669, line: 313, column: 7)
!778 = !DILocation(line: 315, column: 23, scope: !777)
!779 = !DILocation(line: 316, column: 27, scope: !780)
!780 = distinct !DILexicalBlock(scope: !777, file: !669, line: 316, column: 13)
!781 = !DILocation(line: 316, column: 13, scope: !777)
!782 = !DILocation(line: 318, column: 28, scope: !783)
!783 = distinct !DILexicalBlock(scope: !780, file: !669, line: 317, column: 11)
!784 = !DILocation(line: 319, column: 13, scope: !783)
!785 = !DILocation(line: 325, column: 15, scope: !786)
!786 = distinct !DILexicalBlock(scope: !755, file: !669, line: 325, column: 9)
!787 = !{!685, !689, i64 13088}
!788 = !DILocation(line: 325, column: 25, scope: !786)
!789 = !DILocation(line: 325, column: 33, scope: !786)
!790 = !DILocation(line: 325, column: 9, scope: !755)
!791 = !DILocalVariable(name: "image", arg: 1, scope: !792, file: !669, line: 97, type: !429)
!792 = distinct !DISubprogram(name: "ClearBounds", scope: !669, file: !669, line: 97, type: !793, scopeLine: 98, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !429, !650}
!795 = !{!791, !796, !797, !798, !799, !803}
!796 = !DILocalVariable(name: "bounds", arg: 2, scope: !792, file: !669, line: 97, type: !650)
!797 = !DILocalVariable(name: "exception", scope: !792, file: !669, line: 100, type: !672)
!798 = !DILocalVariable(name: "y", scope: !792, file: !669, line: 103, type: !493)
!799 = !DILocalVariable(name: "x", scope: !800, file: !669, line: 113, type: !493)
!800 = distinct !DILexicalBlock(scope: !801, file: !669, line: 111, column: 3)
!801 = distinct !DILexicalBlock(scope: !802, file: !669, line: 110, column: 3)
!802 = distinct !DILexicalBlock(scope: !792, file: !669, line: 110, column: 3)
!803 = !DILocalVariable(name: "q", scope: !800, file: !669, line: 116, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !452)
!805 = !DILocation(line: 0, scope: !792, inlinedAt: !806)
!806 = distinct !DILocation(line: 326, column: 7, scope: !786)
!807 = !DILocation(line: 107, column: 14, scope: !808, inlinedAt: !806)
!808 = distinct !DILexicalBlock(scope: !792, file: !669, line: 107, column: 7)
!809 = !DILocation(line: 107, column: 20, scope: !808, inlinedAt: !806)
!810 = !DILocation(line: 107, column: 7, scope: !792, inlinedAt: !806)
!811 = !DILocation(line: 108, column: 12, scope: !808, inlinedAt: !806)
!812 = !DILocation(line: 108, column: 5, scope: !808, inlinedAt: !806)
!813 = !DILocation(line: 109, column: 22, scope: !792, inlinedAt: !806)
!814 = !DILocation(line: 110, column: 15, scope: !801, inlinedAt: !806)
!815 = !DILocation(line: 110, column: 3, scope: !802, inlinedAt: !806)
!816 = !DILocation(line: 121, column: 5, scope: !817, inlinedAt: !806)
!817 = distinct !DILexicalBlock(scope: !800, file: !669, line: 121, column: 5)
!818 = !DILocation(line: 118, column: 51, scope: !800, inlinedAt: !806)
!819 = !DILocation(line: 118, column: 7, scope: !800, inlinedAt: !806)
!820 = !DILocation(line: 0, scope: !800, inlinedAt: !806)
!821 = !DILocation(line: 119, column: 11, scope: !822, inlinedAt: !806)
!822 = distinct !DILexicalBlock(scope: !800, file: !669, line: 119, column: 9)
!823 = !DILocation(line: 119, column: 9, scope: !800, inlinedAt: !806)
!824 = !DILocation(line: 123, column: 10, scope: !825, inlinedAt: !806)
!825 = distinct !DILexicalBlock(scope: !826, file: !669, line: 122, column: 5)
!826 = distinct !DILexicalBlock(scope: !817, file: !669, line: 121, column: 5)
!827 = !DILocation(line: 123, column: 17, scope: !825, inlinedAt: !806)
!828 = !{!690, !691, i64 6}
!829 = !DILocation(line: 124, column: 8, scope: !825, inlinedAt: !806)
!830 = !DILocation(line: 121, column: 45, scope: !826, inlinedAt: !806)
!831 = !DILocation(line: 121, column: 17, scope: !826, inlinedAt: !806)
!832 = distinct !{!832, !816, !833, !834, !835}
!833 = !DILocation(line: 125, column: 5, scope: !817, inlinedAt: !806)
!834 = !{!"llvm.loop.mustprogress"}
!835 = !{!"llvm.loop.unroll.disable"}
!836 = !DILocation(line: 126, column: 9, scope: !837, inlinedAt: !806)
!837 = distinct !DILexicalBlock(scope: !800, file: !669, line: 126, column: 9)
!838 = !DILocation(line: 126, column: 46, scope: !837, inlinedAt: !806)
!839 = !DILocation(line: 0, scope: !801, inlinedAt: !806)
!840 = distinct !{!840, !815, !841, !834, !835}
!841 = !DILocation(line: 128, column: 3, scope: !802, inlinedAt: !806)
!842 = !DILocation(line: 330, column: 26, scope: !755)
!843 = !DILocation(line: 330, column: 21, scope: !755)
!844 = !DILocation(line: 330, column: 25, scope: !755)
!845 = !{!685, !689, i64 13104}
!846 = !DILocation(line: 331, column: 27, scope: !755)
!847 = !DILocation(line: 331, column: 35, scope: !755)
!848 = !DILocation(line: 333, column: 20, scope: !755)
!849 = !DILocation(line: 334, column: 48, scope: !755)
!850 = !DILocation(line: 334, column: 54, scope: !755)
!851 = !DILocation(line: 334, column: 42, scope: !755)
!852 = !DILocation(line: 335, column: 57, scope: !755)
!853 = !DILocation(line: 335, column: 70, scope: !755)
!854 = !DILocation(line: 334, column: 12, scope: !755)
!855 = !DILocation(line: 336, column: 12, scope: !755)
!856 = !DILocation(line: 337, column: 12, scope: !755)
!857 = !DILocation(line: 338, column: 12, scope: !755)
!858 = !DILocation(line: 339, column: 21, scope: !755)
!859 = !DILocation(line: 339, column: 36, scope: !755)
!860 = !DILocalVariable(name: "image1", arg: 1, scope: !861, file: !669, line: 165, type: !651)
!861 = distinct !DISubprogram(name: "IsBoundsCleared", scope: !669, file: !669, line: 165, type: !862, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !864)
!862 = !DISubroutineType(types: !863)
!863 = !{!445, !651, !651, !650, !672}
!864 = !{!860, !865, !866, !867, !868, !869, !870, !871}
!865 = !DILocalVariable(name: "image2", arg: 2, scope: !861, file: !669, line: 166, type: !651)
!866 = !DILocalVariable(name: "bounds", arg: 3, scope: !861, file: !669, line: 166, type: !650)
!867 = !DILocalVariable(name: "exception", arg: 4, scope: !861, file: !669, line: 166, type: !672)
!868 = !DILocalVariable(name: "p", scope: !861, file: !669, line: 169, type: !653)
!869 = !DILocalVariable(name: "q", scope: !861, file: !669, line: 170, type: !653)
!870 = !DILocalVariable(name: "x", scope: !861, file: !669, line: 173, type: !493)
!871 = !DILocalVariable(name: "y", scope: !861, file: !669, line: 176, type: !493)
!872 = !DILocation(line: 0, scope: !861, inlinedAt: !873)
!873 = distinct !DILocation(line: 343, column: 9, scope: !874)
!874 = distinct !DILexicalBlock(scope: !755, file: !669, line: 343, column: 9)
!875 = !DILocation(line: 180, column: 15, scope: !876, inlinedAt: !873)
!876 = distinct !DILexicalBlock(scope: !877, file: !669, line: 180, column: 3)
!877 = distinct !DILexicalBlock(scope: !861, file: !669, line: 180, column: 3)
!878 = !DILocation(line: 180, column: 3, scope: !877, inlinedAt: !873)
!879 = !DILocation(line: 182, column: 50, scope: !880, inlinedAt: !873)
!880 = distinct !DILexicalBlock(scope: !876, file: !669, line: 181, column: 3)
!881 = !DILocation(line: 182, column: 7, scope: !880, inlinedAt: !873)
!882 = !DILocation(line: 184, column: 7, scope: !880, inlinedAt: !873)
!883 = !DILocation(line: 186, column: 12, scope: !884, inlinedAt: !873)
!884 = distinct !DILexicalBlock(scope: !880, file: !669, line: 186, column: 9)
!885 = !DILocation(line: 186, column: 43, scope: !884, inlinedAt: !873)
!886 = !DILocation(line: 188, column: 5, scope: !887, inlinedAt: !873)
!887 = distinct !DILexicalBlock(scope: !880, file: !669, line: 188, column: 5)
!888 = !DILocation(line: 190, column: 12, scope: !889, inlinedAt: !873)
!889 = distinct !DILexicalBlock(scope: !890, file: !669, line: 190, column: 11)
!890 = distinct !DILexicalBlock(scope: !891, file: !669, line: 189, column: 5)
!891 = distinct !DILexicalBlock(scope: !887, file: !669, line: 188, column: 5)
!892 = !DILocation(line: 190, column: 31, scope: !889, inlinedAt: !873)
!893 = !DILocation(line: 190, column: 62, scope: !889, inlinedAt: !873)
!894 = !DILocation(line: 191, column: 15, scope: !889, inlinedAt: !873)
!895 = !DILocation(line: 191, column: 23, scope: !889, inlinedAt: !873)
!896 = !DILocation(line: 190, column: 11, scope: !890, inlinedAt: !873)
!897 = !DILocation(line: 193, column: 8, scope: !890, inlinedAt: !873)
!898 = !DILocation(line: 194, column: 8, scope: !890, inlinedAt: !873)
!899 = !DILocation(line: 188, column: 45, scope: !891, inlinedAt: !873)
!900 = !DILocation(line: 188, column: 17, scope: !891, inlinedAt: !873)
!901 = distinct !{!901, !886, !902, !834, !835}
!902 = !DILocation(line: 195, column: 5, scope: !887, inlinedAt: !873)
!903 = !DILocation(line: 180, column: 44, scope: !876, inlinedAt: !873)
!904 = distinct !{!904, !878, !905, !834, !835}
!905 = !DILocation(line: 198, column: 3, scope: !877, inlinedAt: !873)
!906 = !DILocation(line: 199, column: 12, scope: !861, inlinedAt: !873)
!907 = !DILocation(line: 343, column: 9, scope: !755)
!908 = !DILocation(line: 344, column: 23, scope: !874)
!909 = !DILocation(line: 344, column: 30, scope: !874)
!910 = !DILocation(line: 347, column: 15, scope: !755)
!911 = !DILocation(line: 347, column: 22, scope: !755)
!912 = !DILocation(line: 286, column: 40, scope: !751)
!913 = distinct !{!913, !753, !914, !834, !835}
!914 = !DILocation(line: 348, column: 3, scope: !752)
!915 = !DILocation(line: 349, column: 17, scope: !668)
!916 = !DILocation(line: 350, column: 10, scope: !668)
!917 = !DILocation(line: 350, column: 3, scope: !668)
!918 = !DILocation(line: 351, column: 1, scope: !668)
!919 = !DISubprogram(name: "LogMagickEvent", scope: !369, file: !369, line: 83, type: !920, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!920 = !DISubroutineType(types: !921)
!921 = !{!445, !922, !562, !562, !924, !562, null}
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !369, line: 58, baseType: !368)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!925 = !{}
!926 = !DISubprogram(name: "GetFirstImageInList", scope: !927, file: !927, line: 30, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!927 = !DIFile(filename: "apps/538.imagick_r/src/magick/list.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53876be9fc59b89d67d5ff7fa85db93a")
!928 = !DISubroutineType(types: !929)
!929 = !{!429, !651}
!930 = !DISubprogram(name: "CloneImage", scope: !73, file: !73, line: 508, type: !931, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!931 = !DISubroutineType(types: !932)
!932 = !{!429, !651, !924, !924, !933, !672}
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!934 = !DISubprogram(name: "SetImageBackgroundColor", scope: !73, file: !73, line: 534, type: !935, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!935 = !DISubroutineType(types: !936)
!936 = !{!445, !429}
!937 = !DISubprogram(name: "CompositeImage", scope: !168, file: !168, line: 110, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!938 = !DISubroutineType(types: !939)
!939 = !{!445, !429, !940, !651, !941, !941}
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!942 = !DISubprogram(name: "GetNextImageInList", scope: !927, file: !927, line: 33, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!943 = !DISubprogram(name: "GetPreviousImageInList", scope: !927, file: !927, line: 34, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!944 = !DISubprogram(name: "DestroyImage", scope: !73, file: !73, line: 510, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!945 = !DISubroutineType(types: !946)
!946 = !{!429, !429}
!947 = !DISubprogram(name: "DestroyImageList", scope: !927, file: !927, line: 28, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!948 = !DISubprogram(name: "CloneImageProfiles", scope: !89, file: !89, line: 58, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!949 = !DISubroutineType(types: !950)
!950 = !{!445, !429, !651}
!951 = !DISubprogram(name: "CloneImageProperties", scope: !952, file: !952, line: 35, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!952 = !DIFile(filename: "apps/538.imagick_r/src/magick/property.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "517489a50b093ded1c4a01c3e2b58c3c")
!953 = !DISubprogram(name: "CloneImageArtifacts", scope: !954, file: !954, line: 33, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!954 = !DIFile(filename: "apps/538.imagick_r/src/magick/artifact.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2fff4b6fe3176ac9e10f3231e40b4948")
!955 = !DILocation(line: 0, scope: !861)
!956 = !DILocation(line: 178, column: 15, scope: !957)
!957 = distinct !DILexicalBlock(scope: !861, file: !669, line: 178, column: 7)
!958 = !{!695, !688, i64 16}
!959 = !DILocation(line: 178, column: 17, scope: !957)
!960 = !DILocation(line: 178, column: 7, scope: !861)
!961 = !DILocation(line: 180, column: 35, scope: !876)
!962 = !{!695, !688, i64 8}
!963 = !DILocation(line: 180, column: 15, scope: !876)
!964 = !DILocation(line: 180, column: 3, scope: !877)
!965 = !DILocation(line: 182, column: 61, scope: !880)
!966 = !{!695, !688, i64 0}
!967 = !DILocation(line: 182, column: 39, scope: !880)
!968 = !DILocation(line: 182, column: 49, scope: !880)
!969 = !{!695, !688, i64 24}
!970 = !DILocation(line: 182, column: 50, scope: !880)
!971 = !DILocation(line: 182, column: 7, scope: !880)
!972 = !DILocation(line: 184, column: 39, scope: !880)
!973 = !DILocation(line: 184, column: 49, scope: !880)
!974 = !DILocation(line: 184, column: 50, scope: !880)
!975 = !DILocation(line: 184, column: 61, scope: !880)
!976 = !DILocation(line: 184, column: 7, scope: !880)
!977 = !DILocation(line: 186, column: 12, scope: !884)
!978 = !DILocation(line: 186, column: 43, scope: !884)
!979 = !DILocation(line: 188, column: 17, scope: !891)
!980 = !DILocation(line: 188, column: 5, scope: !887)
!981 = !DILocation(line: 190, column: 12, scope: !889)
!982 = !DILocation(line: 190, column: 31, scope: !889)
!983 = !DILocation(line: 190, column: 62, scope: !889)
!984 = !DILocation(line: 191, column: 15, scope: !889)
!985 = !DILocation(line: 191, column: 23, scope: !889)
!986 = !DILocation(line: 190, column: 11, scope: !890)
!987 = !DILocation(line: 193, column: 8, scope: !890)
!988 = !DILocation(line: 194, column: 8, scope: !890)
!989 = !DILocation(line: 188, column: 45, scope: !891)
!990 = distinct !{!990, !980, !991, !834, !835}
!991 = !DILocation(line: 195, column: 5, scope: !887)
!992 = !DILocation(line: 180, column: 44, scope: !876)
!993 = distinct !{!993, !964, !994, !834, !835}
!994 = !DILocation(line: 198, column: 3, scope: !877)
!995 = !DILocation(line: 199, column: 32, scope: !861)
!996 = !DILocation(line: 199, column: 12, scope: !861)
!997 = !DILocation(line: 199, column: 10, scope: !861)
!998 = !DILocation(line: 199, column: 3, scope: !861)
!999 = !DILocation(line: 200, column: 1, scope: !861)
!1000 = distinct !DISubprogram(name: "DisposeImages", scope: !669, file: !669, line: 379, type: !670, scopeLine: 380, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1013}
!1002 = !DILocalVariable(name: "images", arg: 1, scope: !1000, file: !669, line: 379, type: !651)
!1003 = !DILocalVariable(name: "exception", arg: 2, scope: !1000, file: !669, line: 379, type: !672)
!1004 = !DILocalVariable(name: "dispose_image", scope: !1000, file: !669, line: 382, type: !429)
!1005 = !DILocalVariable(name: "dispose_images", scope: !1000, file: !669, line: 383, type: !429)
!1006 = !DILocalVariable(name: "bounds", scope: !1000, file: !669, line: 386, type: !501)
!1007 = !DILocalVariable(name: "image", scope: !1000, file: !669, line: 389, type: !429)
!1008 = !DILocalVariable(name: "next", scope: !1000, file: !669, line: 390, type: !429)
!1009 = !DILocalVariable(name: "current_image", scope: !1010, file: !669, line: 416, type: !429)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !669, line: 414, column: 3)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !669, line: 413, column: 3)
!1012 = distinct !DILexicalBlock(scope: !1000, file: !669, line: 413, column: 3)
!1013 = !DILocalVariable(name: "dispose", scope: !1014, file: !669, line: 470, type: !429)
!1014 = distinct !DILexicalBlock(scope: !1010, file: !669, line: 468, column: 5)
!1015 = !DILocation(line: 0, scope: !1000)
!1016 = !DILocation(line: 381, column: 3, scope: !1000)
!1017 = !DILocation(line: 397, column: 15, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1000, file: !669, line: 397, column: 7)
!1019 = !DILocation(line: 397, column: 21, scope: !1018)
!1020 = !DILocation(line: 397, column: 7, scope: !1000)
!1021 = !DILocation(line: 398, column: 69, scope: !1018)
!1022 = !DILocation(line: 398, column: 12, scope: !1018)
!1023 = !DILocation(line: 398, column: 5, scope: !1018)
!1024 = !DILocation(line: 401, column: 9, scope: !1000)
!1025 = !DILocation(line: 402, column: 41, scope: !1000)
!1026 = !DILocation(line: 402, column: 46, scope: !1000)
!1027 = !{!685, !688, i64 280}
!1028 = !DILocation(line: 402, column: 64, scope: !1000)
!1029 = !{!685, !688, i64 288}
!1030 = !DILocation(line: 402, column: 17, scope: !1000)
!1031 = !DILocation(line: 404, column: 21, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1000, file: !669, line: 404, column: 7)
!1033 = !DILocation(line: 404, column: 7, scope: !1000)
!1034 = !DILocation(line: 406, column: 18, scope: !1000)
!1035 = !DILocation(line: 406, column: 30, scope: !1000)
!1036 = !DILocation(line: 407, column: 23, scope: !1000)
!1037 = !DILocation(line: 409, column: 18, scope: !1000)
!1038 = !DILocation(line: 408, column: 24, scope: !1000)
!1039 = !DILocation(line: 409, column: 25, scope: !1000)
!1040 = !DILocation(line: 410, column: 35, scope: !1000)
!1041 = !DILocation(line: 410, column: 42, scope: !1000)
!1042 = !{!685, !691, i64 86}
!1043 = !DILocation(line: 411, column: 10, scope: !1000)
!1044 = !DILocation(line: 412, column: 18, scope: !1000)
!1045 = !DILocation(line: 412, column: 17, scope: !1000)
!1046 = !{!689, !689, i64 0}
!1047 = !DILocation(line: 413, column: 3, scope: !1012)
!1048 = !DILocation(line: 421, column: 19, scope: !1010)
!1049 = !DILocation(line: 0, scope: !1010)
!1050 = !DILocation(line: 422, column: 23, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1010, file: !669, line: 422, column: 9)
!1052 = !DILocation(line: 422, column: 9, scope: !1010)
!1053 = !DILocation(line: 424, column: 41, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1051, file: !669, line: 423, column: 7)
!1055 = !DILocation(line: 424, column: 24, scope: !1054)
!1056 = !DILocation(line: 424, column: 23, scope: !1054)
!1057 = !DILocation(line: 425, column: 23, scope: !1054)
!1058 = !DILocation(line: 426, column: 9, scope: !1054)
!1059 = !DILocation(line: 428, column: 47, scope: !1010)
!1060 = !DILocation(line: 428, column: 53, scope: !1010)
!1061 = !DILocation(line: 428, column: 41, scope: !1010)
!1062 = !DILocation(line: 429, column: 57, scope: !1010)
!1063 = !DILocation(line: 429, column: 70, scope: !1010)
!1064 = !DILocation(line: 428, column: 12, scope: !1010)
!1065 = !DILocation(line: 433, column: 15, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1010, file: !669, line: 433, column: 9)
!1067 = !DILocation(line: 433, column: 23, scope: !1066)
!1068 = !DILocation(line: 433, column: 9, scope: !1010)
!1069 = !DILocation(line: 429, column: 52, scope: !1010)
!1070 = !DILocation(line: 435, column: 22, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1066, file: !669, line: 434, column: 7)
!1072 = !DILocation(line: 436, column: 28, scope: !1071)
!1073 = !DILocation(line: 437, column: 29, scope: !1071)
!1074 = !DILocation(line: 438, column: 13, scope: !1071)
!1075 = !DILocation(line: 443, column: 32, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1071, file: !669, line: 443, column: 13)
!1077 = !DILocation(line: 443, column: 74, scope: !1076)
!1078 = !DILocation(line: 443, column: 47, scope: !1076)
!1079 = !DILocation(line: 443, column: 13, scope: !1071)
!1080 = !DILocation(line: 445, column: 13, scope: !1071)
!1081 = !DILocation(line: 450, column: 32, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1071, file: !669, line: 450, column: 13)
!1083 = !DILocation(line: 450, column: 75, scope: !1082)
!1084 = !DILocation(line: 450, column: 48, scope: !1082)
!1085 = !DILocation(line: 450, column: 13, scope: !1071)
!1086 = !DILocation(line: 0, scope: !792, inlinedAt: !1087)
!1087 = distinct !DILocation(line: 452, column: 9, scope: !1071)
!1088 = !DILocation(line: 107, column: 14, scope: !808, inlinedAt: !1087)
!1089 = !DILocation(line: 107, column: 20, scope: !808, inlinedAt: !1087)
!1090 = !DILocation(line: 107, column: 7, scope: !792, inlinedAt: !1087)
!1091 = !DILocation(line: 108, column: 12, scope: !808, inlinedAt: !1087)
!1092 = !DILocation(line: 108, column: 5, scope: !808, inlinedAt: !1087)
!1093 = !DILocation(line: 109, column: 22, scope: !792, inlinedAt: !1087)
!1094 = !DILocation(line: 110, column: 15, scope: !801, inlinedAt: !1087)
!1095 = !DILocation(line: 110, column: 3, scope: !802, inlinedAt: !1087)
!1096 = !DILocation(line: 121, column: 5, scope: !817, inlinedAt: !1087)
!1097 = !DILocation(line: 118, column: 51, scope: !800, inlinedAt: !1087)
!1098 = !DILocation(line: 118, column: 7, scope: !800, inlinedAt: !1087)
!1099 = !DILocation(line: 0, scope: !800, inlinedAt: !1087)
!1100 = !DILocation(line: 119, column: 11, scope: !822, inlinedAt: !1087)
!1101 = !DILocation(line: 119, column: 9, scope: !800, inlinedAt: !1087)
!1102 = !DILocation(line: 123, column: 10, scope: !825, inlinedAt: !1087)
!1103 = !DILocation(line: 123, column: 17, scope: !825, inlinedAt: !1087)
!1104 = !DILocation(line: 124, column: 8, scope: !825, inlinedAt: !1087)
!1105 = !DILocation(line: 121, column: 45, scope: !826, inlinedAt: !1087)
!1106 = !DILocation(line: 121, column: 17, scope: !826, inlinedAt: !1087)
!1107 = distinct !{!1107, !1096, !1108, !834, !835}
!1108 = !DILocation(line: 125, column: 5, scope: !817, inlinedAt: !1087)
!1109 = !DILocation(line: 126, column: 9, scope: !837, inlinedAt: !1087)
!1110 = !DILocation(line: 126, column: 46, scope: !837, inlinedAt: !1087)
!1111 = !DILocation(line: 0, scope: !801, inlinedAt: !1087)
!1112 = distinct !{!1112, !1095, !1113, !834, !835}
!1113 = !DILocation(line: 128, column: 3, scope: !802, inlinedAt: !1087)
!1114 = !DILocation(line: 457, column: 15, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1010, file: !669, line: 457, column: 9)
!1116 = !DILocation(line: 457, column: 23, scope: !1115)
!1117 = !DILocation(line: 457, column: 9, scope: !1010)
!1118 = !DILocation(line: 458, column: 21, scope: !1115)
!1119 = !DILocation(line: 458, column: 7, scope: !1115)
!1120 = !DILocation(line: 461, column: 23, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1115, file: !669, line: 460, column: 7)
!1122 = !DILocation(line: 472, column: 15, scope: !1014)
!1123 = !DILocation(line: 0, scope: !1014)
!1124 = !DILocation(line: 473, column: 19, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1014, file: !669, line: 473, column: 11)
!1126 = !DILocation(line: 473, column: 11, scope: !1014)
!1127 = !DILocation(line: 475, column: 43, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1125, file: !669, line: 474, column: 9)
!1129 = !DILocation(line: 475, column: 26, scope: !1128)
!1130 = !DILocation(line: 475, column: 25, scope: !1128)
!1131 = !DILocation(line: 476, column: 25, scope: !1128)
!1132 = !DILocation(line: 477, column: 11, scope: !1128)
!1133 = !DILocation(line: 479, column: 14, scope: !1014)
!1134 = !DILocation(line: 480, column: 14, scope: !1014)
!1135 = !DILocation(line: 481, column: 14, scope: !1014)
!1136 = !DILocation(line: 482, column: 21, scope: !1014)
!1137 = !DILocation(line: 483, column: 22, scope: !1014)
!1138 = !DILocation(line: 484, column: 30, scope: !1014)
!1139 = !DILocation(line: 484, column: 16, scope: !1014)
!1140 = !DILocation(line: 484, column: 23, scope: !1014)
!1141 = !DILocation(line: 485, column: 7, scope: !1014)
!1142 = !DILocation(line: 413, column: 49, scope: !1011)
!1143 = !DILocation(line: 413, column: 25, scope: !1011)
!1144 = distinct !{!1144, !1047, !1145, !834, !835}
!1145 = !DILocation(line: 487, column: 3, scope: !1012)
!1146 = !DILocation(line: 488, column: 17, scope: !1000)
!1147 = !DILocation(line: 489, column: 30, scope: !1000)
!1148 = !DILocation(line: 489, column: 10, scope: !1000)
!1149 = !DILocation(line: 489, column: 3, scope: !1000)
!1150 = !DILocation(line: 490, column: 1, scope: !1000)
!1151 = !DISubprogram(name: "NewImageList", scope: !927, file: !927, line: 36, type: !1152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!429}
!1154 = !DISubprogram(name: "AppendImageToList", scope: !927, file: !927, line: 51, type: !1155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{null, !1157, !651}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!1158 = distinct !DISubprogram(name: "CompareImageLayers", scope: !669, file: !669, line: 768, type: !1159, scopeLine: 770, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1163)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!429, !651, !1161, !672}
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageLayerMethod", file: !239, line: 53, baseType: !393)
!1163 = !{!1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!1164 = !DILocalVariable(name: "image", arg: 1, scope: !1158, file: !669, line: 768, type: !651)
!1165 = !DILocalVariable(name: "method", arg: 2, scope: !1158, file: !669, line: 769, type: !1161)
!1166 = !DILocalVariable(name: "exception", arg: 3, scope: !1158, file: !669, line: 769, type: !672)
!1167 = !DILocalVariable(name: "image_a", scope: !1158, file: !669, line: 772, type: !429)
!1168 = !DILocalVariable(name: "image_b", scope: !1158, file: !669, line: 773, type: !429)
!1169 = !DILocalVariable(name: "layers", scope: !1158, file: !669, line: 774, type: !429)
!1170 = !DILocalVariable(name: "bounds", scope: !1158, file: !669, line: 777, type: !650)
!1171 = !DILocalVariable(name: "next", scope: !1158, file: !669, line: 780, type: !651)
!1172 = !DILocalVariable(name: "i", scope: !1158, file: !669, line: 783, type: !493)
!1173 = !DILocation(line: 0, scope: !1158)
!1174 = !DILocation(line: 771, column: 3, scope: !1158)
!1175 = !DILocation(line: 787, column: 14, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1158, file: !669, line: 787, column: 7)
!1177 = !DILocation(line: 787, column: 20, scope: !1176)
!1178 = !DILocation(line: 787, column: 7, scope: !1158)
!1179 = !DILocation(line: 788, column: 68, scope: !1176)
!1180 = !DILocation(line: 788, column: 12, scope: !1176)
!1181 = !DILocation(line: 788, column: 5, scope: !1176)
!1182 = !DILocation(line: 797, column: 8, scope: !1158)
!1183 = !DILocation(line: 799, column: 5, scope: !1158)
!1184 = !DILocation(line: 798, column: 28, scope: !1158)
!1185 = !DILocation(line: 800, column: 14, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1158, file: !669, line: 800, column: 7)
!1187 = !DILocation(line: 800, column: 7, scope: !1158)
!1188 = !DILocation(line: 801, column: 5, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1186, file: !669, line: 801, column: 5)
!1190 = !DILocation(line: 805, column: 33, scope: !1158)
!1191 = !DILocation(line: 805, column: 38, scope: !1158)
!1192 = !DILocation(line: 805, column: 55, scope: !1158)
!1193 = !DILocation(line: 805, column: 11, scope: !1158)
!1194 = !DILocation(line: 807, column: 15, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1158, file: !669, line: 807, column: 7)
!1196 = !DILocation(line: 807, column: 7, scope: !1158)
!1197 = !DILocation(line: 809, column: 32, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1195, file: !669, line: 808, column: 5)
!1199 = !DILocation(line: 810, column: 7, scope: !1198)
!1200 = !DILocation(line: 812, column: 29, scope: !1158)
!1201 = !DILocation(line: 812, column: 36, scope: !1158)
!1202 = !DILocation(line: 813, column: 10, scope: !1158)
!1203 = !DILocation(line: 814, column: 12, scope: !1158)
!1204 = !DILocation(line: 814, column: 23, scope: !1158)
!1205 = !DILocation(line: 815, column: 17, scope: !1158)
!1206 = !DILocation(line: 817, column: 65, scope: !1158)
!1207 = !DILocation(line: 816, column: 18, scope: !1158)
!1208 = !DILocation(line: 817, column: 78, scope: !1158)
!1209 = !DILocation(line: 817, column: 10, scope: !1158)
!1210 = !DILocation(line: 822, column: 8, scope: !1158)
!1211 = !DILocation(line: 823, column: 16, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1213, file: !669, line: 823, column: 3)
!1213 = distinct !DILexicalBlock(scope: !1158, file: !669, line: 823, column: 3)
!1214 = !DILocation(line: 823, column: 3, scope: !1213)
!1215 = !DILocation(line: 825, column: 13, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1212, file: !669, line: 824, column: 3)
!1217 = !DILocation(line: 826, column: 17, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1216, file: !669, line: 826, column: 9)
!1219 = !DILocation(line: 826, column: 9, scope: !1216)
!1220 = !DILocation(line: 828, column: 17, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1218, file: !669, line: 827, column: 7)
!1222 = !DILocation(line: 829, column: 34, scope: !1221)
!1223 = !DILocation(line: 830, column: 9, scope: !1221)
!1224 = !DILocation(line: 832, column: 67, scope: !1216)
!1225 = !DILocation(line: 833, column: 39, scope: !1216)
!1226 = !DILocation(line: 832, column: 12, scope: !1216)
!1227 = !DILocation(line: 834, column: 5, scope: !1216)
!1228 = !DILocation(line: 834, column: 15, scope: !1216)
!1229 = !DILocation(line: 836, column: 13, scope: !1216)
!1230 = !DILocation(line: 837, column: 6, scope: !1216)
!1231 = !DILocation(line: 823, column: 46, scope: !1212)
!1232 = distinct !{!1232, !1214, !1233, !834, !835}
!1233 = !DILocation(line: 838, column: 3, scope: !1213)
!1234 = !DILocation(line: 839, column: 11, scope: !1158)
!1235 = !DILocation(line: 843, column: 8, scope: !1158)
!1236 = !DILocation(line: 844, column: 10, scope: !1158)
!1237 = !DILocation(line: 844, column: 9, scope: !1158)
!1238 = !DILocation(line: 845, column: 14, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1158, file: !669, line: 845, column: 7)
!1240 = !DILocation(line: 845, column: 7, scope: !1158)
!1241 = !DILocation(line: 847, column: 32, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1239, file: !669, line: 846, column: 5)
!1243 = !DILocation(line: 848, column: 7, scope: !1242)
!1244 = !DILocation(line: 854, column: 8, scope: !1158)
!1245 = !DILocation(line: 855, column: 16, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1247, file: !669, line: 855, column: 3)
!1247 = distinct !DILexicalBlock(scope: !1158, file: !669, line: 855, column: 3)
!1248 = !DILocation(line: 855, column: 3, scope: !1247)
!1249 = !DILocation(line: 857, column: 13, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1246, file: !669, line: 856, column: 3)
!1251 = !DILocation(line: 858, column: 17, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1250, file: !669, line: 858, column: 9)
!1253 = !DILocation(line: 858, column: 9, scope: !1250)
!1254 = !DILocation(line: 860, column: 32, scope: !1250)
!1255 = !DILocation(line: 860, column: 13, scope: !1250)
!1256 = !DILocation(line: 861, column: 13, scope: !1250)
!1257 = !DILocation(line: 862, column: 17, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1250, file: !669, line: 862, column: 9)
!1259 = !DILocation(line: 862, column: 9, scope: !1250)
!1260 = !DILocation(line: 864, column: 5, scope: !1250)
!1261 = !DILocation(line: 865, column: 6, scope: !1250)
!1262 = !DILocation(line: 855, column: 46, scope: !1246)
!1263 = distinct !{!1263, !1248, !1264, !834, !835}
!1264 = !DILocation(line: 866, column: 3, scope: !1247)
!1265 = !DILocation(line: 867, column: 28, scope: !1158)
!1266 = !DILocation(line: 870, column: 31, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1268, file: !669, line: 869, column: 5)
!1268 = distinct !DILexicalBlock(scope: !1158, file: !669, line: 868, column: 7)
!1269 = !DILocation(line: 870, column: 14, scope: !1267)
!1270 = !DILocation(line: 871, column: 7, scope: !1267)
!1271 = !DILocation(line: 873, column: 30, scope: !1158)
!1272 = !DILocation(line: 873, column: 10, scope: !1158)
!1273 = !DILocation(line: 873, column: 3, scope: !1158)
!1274 = !DILocation(line: 874, column: 1, scope: !1158)
!1275 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1276, file: !1276, line: 42, type: !1277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!1276 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!484, !924, !924}
!1279 = !DISubprogram(name: "GetImageListLength", scope: !927, file: !927, line: 45, type: !1280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!440, !651}
!1282 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!445, !672, !562, !562, !924, !1285, !562, !562, null}
!1285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!1286 = !DISubprogram(name: "RelinquishMagickMemory", scope: !1276, file: !1276, line: 51, type: !1287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !925)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!484, !484}
!1289 = distinct !DISubprogram(name: "CompareImageBounds", scope: !669, file: !669, line: 593, type: !1290, scopeLine: 595, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1292)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!501, !651, !651, !1161, !672}
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1298, !1312, !1313, !1314, !1315, !1316, !1317, !1318}
!1293 = !DILocalVariable(name: "image1", arg: 1, scope: !1289, file: !669, line: 593, type: !651)
!1294 = !DILocalVariable(name: "image2", arg: 2, scope: !1289, file: !669, line: 593, type: !651)
!1295 = !DILocalVariable(name: "method", arg: 3, scope: !1289, file: !669, line: 594, type: !1161)
!1296 = !DILocalVariable(name: "exception", arg: 4, scope: !1289, file: !669, line: 594, type: !672)
!1297 = !DILocalVariable(name: "bounds", scope: !1289, file: !669, line: 597, type: !501)
!1298 = !DILocalVariable(name: "pixel1", scope: !1289, file: !669, line: 600, type: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !1300, file: !326, line: 107, baseType: !434, size: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1300, file: !326, line: 110, baseType: !436, size: 32, offset: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1300, file: !326, line: 113, baseType: !445, size: 32, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1300, file: !326, line: 116, baseType: !466, size: 64, offset: 128)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1300, file: !326, line: 119, baseType: !440, size: 64, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1300, file: !326, line: 122, baseType: !655, size: 32, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1300, file: !326, line: 123, baseType: !655, size: 32, offset: 288)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1300, file: !326, line: 124, baseType: !655, size: 32, offset: 320)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1300, file: !326, line: 125, baseType: !655, size: 32, offset: 352)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1300, file: !326, line: 126, baseType: !655, size: 32, offset: 384)
!1312 = !DILocalVariable(name: "pixel2", scope: !1289, file: !669, line: 601, type: !1299)
!1313 = !DILocalVariable(name: "indexes1", scope: !1289, file: !669, line: 604, type: !657)
!1314 = !DILocalVariable(name: "indexes2", scope: !1289, file: !669, line: 605, type: !657)
!1315 = !DILocalVariable(name: "p", scope: !1289, file: !669, line: 608, type: !653)
!1316 = !DILocalVariable(name: "q", scope: !1289, file: !669, line: 609, type: !653)
!1317 = !DILocalVariable(name: "x", scope: !1289, file: !669, line: 612, type: !493)
!1318 = !DILocalVariable(name: "y", scope: !1289, file: !669, line: 615, type: !493)
!1319 = !DILocation(line: 0, scope: !1289)
!1320 = !DILocation(line: 597, column: 5, scope: !1289)
!1321 = !DILocation(line: 599, column: 3, scope: !1289)
!1322 = !DILocation(line: 600, column: 5, scope: !1289)
!1323 = !DILocation(line: 601, column: 5, scope: !1289)
!1324 = !DILocation(line: 626, column: 3, scope: !1289)
!1325 = !DILocation(line: 627, column: 3, scope: !1289)
!1326 = !DILocation(line: 628, column: 35, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1328, file: !669, line: 628, column: 3)
!1328 = distinct !DILexicalBlock(scope: !1289, file: !669, line: 628, column: 3)
!1329 = !DILocation(line: 628, column: 15, scope: !1327)
!1330 = !DILocation(line: 628, column: 3, scope: !1328)
!1331 = !DILocation(line: 630, column: 45, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1327, file: !669, line: 629, column: 3)
!1333 = !DILocation(line: 630, column: 7, scope: !1332)
!1334 = !DILocation(line: 631, column: 45, scope: !1332)
!1335 = !DILocation(line: 631, column: 7, scope: !1332)
!1336 = !DILocation(line: 632, column: 12, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1332, file: !669, line: 632, column: 9)
!1338 = !DILocation(line: 632, column: 43, scope: !1337)
!1339 = !DILocation(line: 635, column: 14, scope: !1332)
!1340 = !DILocation(line: 636, column: 14, scope: !1332)
!1341 = !DILocation(line: 637, column: 37, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1343, file: !669, line: 637, column: 5)
!1343 = distinct !DILexicalBlock(scope: !1332, file: !669, line: 637, column: 5)
!1344 = !DILocation(line: 637, column: 17, scope: !1342)
!1345 = !DILocation(line: 637, column: 5, scope: !1343)
!1346 = !DILocation(line: 533, column: 7, scope: !1347, inlinedAt: !1358)
!1347 = distinct !DISubprogram(name: "ComparePixels", scope: !669, file: !669, line: 523, type: !1348, scopeLine: 525, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1352)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!445, !1161, !1350, !1350}
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1299)
!1352 = !{!1353, !1354, !1355, !1356, !1357}
!1353 = !DILocalVariable(name: "method", arg: 1, scope: !1347, file: !669, line: 523, type: !1161)
!1354 = !DILocalVariable(name: "p", arg: 2, scope: !1347, file: !669, line: 524, type: !1350)
!1355 = !DILocalVariable(name: "q", arg: 3, scope: !1347, file: !669, line: 524, type: !1350)
!1356 = !DILocalVariable(name: "o1", scope: !1347, file: !669, line: 527, type: !655)
!1357 = !DILocalVariable(name: "o2", scope: !1347, file: !669, line: 528, type: !655)
!1358 = distinct !DILocation(line: 641, column: 11, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1360, file: !669, line: 641, column: 11)
!1360 = distinct !DILexicalBlock(scope: !1342, file: !669, line: 638, column: 5)
!1361 = !DILocation(line: 639, column: 7, scope: !1360)
!1362 = !{!685, !686, i64 4}
!1363 = !DILocalVariable(name: "image", arg: 1, scope: !1364, file: !1365, line: 92, type: !651)
