; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/locale.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/locale.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._LocaleInfo = type { ptr, ptr, ptr, i32, ptr, ptr, i64 }

@.str = private unnamed_addr constant [85 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/locale.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"...\00", align 1
@locale_semaphore = internal global ptr null, align 8, !dbg !0
@.str.3 = private unnamed_addr constant [2 x i8] c"*\00", align 1
@locale_cache = internal unnamed_addr global ptr null, align 8, !dbg !258
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c"%s/\00", align 1
@.str.6 = private unnamed_addr constant [5 x i8] c"%s%s\00", align 1
@.str.7 = private unnamed_addr constant [32 x i8] c"Searching for locale file: \22%s\22\00", align 1
@stdout = external local_unnamed_addr global ptr, align 8

!64 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!65 = !DIEnumerator(name: "TypeError", value: 405)
!66 = !DIEnumerator(name: "OptionError", value: 410)
!67 = !DIEnumerator(name: "DelegateError", value: 415)
!68 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!69 = !DIEnumerator(name: "CorruptImageError", value: 425)
!70 = !DIEnumerator(name: "FileOpenError", value: 430)
!71 = !DIEnumerator(name: "BlobError", value: 435)
!72 = !DIEnumerator(name: "StreamError", value: 440)
!73 = !DIEnumerator(name: "CacheError", value: 445)
!74 = !DIEnumerator(name: "CoderError", value: 450)
!75 = !DIEnumerator(name: "FilterError", value: 452)
!76 = !DIEnumerator(name: "ModuleError", value: 455)
!77 = !DIEnumerator(name: "DrawError", value: 460)
!78 = !DIEnumerator(name: "ImageError", value: 465)
!79 = !DIEnumerator(name: "WandError", value: 470)
!80 = !DIEnumerator(name: "RandomError", value: 475)
!81 = !DIEnumerator(name: "XServerError", value: 480)
!82 = !DIEnumerator(name: "MonitorError", value: 485)
!83 = !DIEnumerator(name: "RegistryError", value: 490)
!84 = !DIEnumerator(name: "ConfigureError", value: 495)
!85 = !DIEnumerator(name: "PolicyError", value: 499)
!86 = !DIEnumerator(name: "FatalErrorException", value: 700)
!87 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!88 = !DIEnumerator(name: "TypeFatalError", value: 705)
!89 = !DIEnumerator(name: "OptionFatalError", value: 710)
!90 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!91 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!92 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!93 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!94 = !DIEnumerator(name: "BlobFatalError", value: 735)
!95 = !DIEnumerator(name: "StreamFatalError", value: 740)
!96 = !DIEnumerator(name: "CacheFatalError", value: 745)
!97 = !DIEnumerator(name: "CoderFatalError", value: 750)
!98 = !DIEnumerator(name: "FilterFatalError", value: 752)
!99 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!100 = !DIEnumerator(name: "DrawFatalError", value: 760)
!101 = !DIEnumerator(name: "ImageFatalError", value: 765)
!102 = !DIEnumerator(name: "WandFatalError", value: 770)
!103 = !DIEnumerator(name: "RandomFatalError", value: 775)
!104 = !DIEnumerator(name: "XServerFatalError", value: 780)
!105 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!106 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!107 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!108 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 46, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!112 = !DIEnumerator(name: "_ISupper", value: 256)
!113 = !DIEnumerator(name: "_ISlower", value: 512)
!114 = !DIEnumerator(name: "_ISalpha", value: 1024)
!115 = !DIEnumerator(name: "_ISdigit", value: 2048)
!116 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!117 = !DIEnumerator(name: "_ISspace", value: 8192)
!118 = !DIEnumerator(name: "_ISprint", value: 16384)
!119 = !DIEnumerator(name: "_ISgraph", value: 32768)
!120 = !DIEnumerator(name: "_ISblank", value: 1)
!121 = !DIEnumerator(name: "_IScntrl", value: 2)
!122 = !DIEnumerator(name: "_ISpunct", value: 4)
!123 = !DIEnumerator(name: "_ISalnum", value: 8)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 25, baseType: !7, size: 32, elements: !126)
!125 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135}
!127 = !DIEnumerator(name: "UndefinedPath", value: 0)
!128 = !DIEnumerator(name: "MagickPath", value: 1)
!129 = !DIEnumerator(name: "RootPath", value: 2)
!130 = !DIEnumerator(name: "HeadPath", value: 3)
!131 = !DIEnumerator(name: "TailPath", value: 4)
!132 = !DIEnumerator(name: "BasePath", value: 5)
!133 = !DIEnumerator(name: "ExtensionPath", value: 6)
!134 = !DIEnumerator(name: "SubimagePath", value: 7)
!135 = !DIEnumerator(name: "CanonicalPath", value: 8)
!136 = !{!137, !138, !143, !162, !163, !165, !160, !166, !167, !150, !168, !172, !186, !187, !243, !247, !251, !195, !254, !183, !217, !256}
!137 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !139, line: 77, baseType: !140)
!139 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !141, line: 193, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!142 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "LocaleInfo", file: !146, line: 43, baseType: !147)
!146 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "156c27c5fb4b55284e5f6c924766571a")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LocaleInfo", file: !146, line: 27, size: 448, elements: !148)
!148 = !{!149, !152, !153, !154, !156, !158, !159}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !147, file: !146, line: 30, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !147, file: !146, line: 31, baseType: !150, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !147, file: !146, line: 32, baseType: !150, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !147, file: !146, line: 35, baseType: !155, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !32, line: 215, baseType: !31)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !147, file: !146, line: 38, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !146, line: 39, baseType: !157, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !147, file: !146, line: 42, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !161, line: 46, baseType: !137)
!161 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !170, line: 34, baseType: !171)
!170 = !DIFile(filename: "apps/538.imagick_r/src/magick/hashmap.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "683c2bd26601474466c188c023adadf2")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !170, line: 33, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !174, line: 40, baseType: !175)
!174 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !174, line: 29, size: 32960, elements: !176)
!176 = !{!177, !181, !184, !185}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !175, file: !174, line: 32, baseType: !178, size: 32768)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32768, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 4096)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !175, file: !174, line: 35, baseType: !182, size: 64, offset: 32768)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !175, file: !174, line: 38, baseType: !160, size: 64, offset: 32832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !175, file: !174, line: 39, baseType: !160, size: 64, offset: 32896)
!186 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !190, line: 7, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !192, line: 49, size: 1728, elements: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!193 = !{!194, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !210, !212, !213, !214, !216, !218, !220, !224, !227, !229, !232, !235, !236, !237, !238, !239}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !191, file: !192, line: 51, baseType: !195, size: 32)
!195 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !191, file: !192, line: 54, baseType: !150, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !191, file: !192, line: 55, baseType: !150, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !191, file: !192, line: 56, baseType: !150, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !191, file: !192, line: 57, baseType: !150, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !191, file: !192, line: 58, baseType: !150, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !191, file: !192, line: 59, baseType: !150, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !191, file: !192, line: 60, baseType: !150, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !191, file: !192, line: 61, baseType: !150, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !191, file: !192, line: 64, baseType: !150, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !191, file: !192, line: 65, baseType: !150, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !191, file: !192, line: 66, baseType: !150, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !191, file: !192, line: 68, baseType: !208, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !192, line: 36, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !191, file: !192, line: 70, baseType: !211, size: 64, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !191, file: !192, line: 72, baseType: !195, size: 32, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !191, file: !192, line: 73, baseType: !195, size: 32, offset: 928)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !191, file: !192, line: 74, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !141, line: 152, baseType: !142)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !191, file: !192, line: 77, baseType: !217, size: 16, offset: 1024)
!217 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !191, file: !192, line: 78, baseType: !219, size: 8, offset: 1040)
!219 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !191, file: !192, line: 79, baseType: !221, size: 8, offset: 1048)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 8, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 1)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !191, file: !192, line: 81, baseType: !225, size: 64, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !192, line: 43, baseType: null)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !191, file: !192, line: 89, baseType: !228, size: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !141, line: 153, baseType: !142)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !191, file: !192, line: 91, baseType: !230, size: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !192, line: 37, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !191, file: !192, line: 92, baseType: !233, size: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !192, line: 38, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !191, file: !192, line: 93, baseType: !211, size: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !191, file: !192, line: 94, baseType: !162, size: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !191, file: !192, line: 95, baseType: !160, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !191, file: !192, line: 96, baseType: !195, size: 32, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !191, file: !192, line: 98, baseType: !240, size: 160, offset: 1568)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 160, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 20)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !245, line: 26, baseType: !246)
!245 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !245, line: 25, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !249, line: 26, baseType: !250)
!249 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !249, line: 25, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!162, !162}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!257 = !{!0, !258, !261}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "locale_cache", scope: !2, file: !260, line: 94, type: !247, isLocal: true, isDefinition: true)
!260 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3a28e1e25420d63eca02557c3ba5c08c")
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "LocaleMap", scope: !2, file: !260, line: 79, type: !163, isLocal: true, isDefinition: true)
!263 = !{i32 7, !"Dwarf Version", i32 5}
!264 = !{i32 2, !"Debug Info Version", i32 3}
!265 = !{i32 1, !"wchar_size", i32 4}
!266 = !{i32 7, !"PIC Level", i32 2}
!267 = !{i32 7, !"PIE Level", i32 2}
!268 = !{i32 7, !"uwtable", i32 2}
!269 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!270 = distinct !DISubprogram(name: "DestroyLocaleOptions", scope: !260, file: !260, line: 301, type: !271, scopeLine: 302, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !273)
!271 = !DISubroutineType(types: !272)
!272 = !{!168, !168}
!273 = !{!274}
!274 = !DILocalVariable(name: "messages", arg: 1, scope: !270, file: !260, line: 301, type: !168)
!275 = !DILocation(line: 0, scope: !270)
!276 = !DILocation(line: 304, column: 10, scope: !270)
!277 = !DILocation(line: 305, column: 10, scope: !270)
!278 = !DILocation(line: 305, column: 3, scope: !270)
!279 = !DISubprogram(name: "LogMagickEvent", scope: !6, file: !6, line: 83, type: !280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !285)
!280 = !DISubroutineType(types: !281)
!281 = !{!155, !282, !163, !163, !284, !163, null}
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !6, line: 58, baseType: !5)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!285 = !{}
!286 = !DISubprogram(name: "DestroyLinkedList", scope: !170, file: !170, line: 42, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !285)
!287 = !DISubroutineType(types: !288)
!288 = !{!168, !168, !251}
!289 = distinct !DISubprogram(name: "DestroyOptions", scope: !260, file: !260, line: 296, type: !252, scopeLine: 297, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !290)
!290 = !{!291}
!291 = !DILocalVariable(name: "message", arg: 1, scope: !289, file: !260, line: 296, type: !162)
!292 = !DILocation(line: 0, scope: !289)
!293 = !DILocation(line: 298, column: 10, scope: !289)
!294 = !DILocation(line: 298, column: 3, scope: !289)
!295 = distinct !DISubprogram(name: "FormatLocaleFileList", scope: !260, file: !260, line: 335, type: !296, scopeLine: 337, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !308)
!296 = !DISubroutineType(types: !297)
!297 = !{!138, !298, !299, !300}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !163)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !302)
!302 = !{!303, !305, !306, !307}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !301, file: !304, line: 306, baseType: !7, size: 32)
!304 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !301, file: !304, line: 306, baseType: !7, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !301, file: !304, line: 306, baseType: !162, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !301, file: !304, line: 306, baseType: !162, size: 64, offset: 128)
!308 = !{!309, !310, !311, !312}
!309 = !DILocalVariable(name: "file", arg: 1, scope: !295, file: !260, line: 335, type: !298)
!310 = !DILocalVariable(name: "format", arg: 2, scope: !295, file: !260, line: 336, type: !299)
!311 = !DILocalVariable(name: "operands", arg: 3, scope: !295, file: !260, line: 336, type: !300)
!312 = !DILocalVariable(name: "n", scope: !295, file: !260, line: 339, type: !138)
!313 = !DILocation(line: 0, scope: !295)
!314 = !DILocation(line: 374, column: 15, scope: !295)
!315 = !DILocation(line: 374, column: 5, scope: !295)
!316 = !DILocation(line: 377, column: 3, scope: !295)
!317 = distinct !DISubprogram(name: "FormatLocaleFile", scope: !260, file: !260, line: 380, type: !318, scopeLine: 382, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{!138, !298, !299, null}
!320 = !{!321, !322, !323, !324}
!321 = !DILocalVariable(name: "file", arg: 1, scope: !317, file: !260, line: 380, type: !298)
!322 = !DILocalVariable(name: "format", arg: 2, scope: !317, file: !260, line: 380, type: !299)
!323 = !DILocalVariable(name: "n", scope: !317, file: !260, line: 384, type: !138)
!324 = !DILocalVariable(name: "operands", scope: !317, file: !260, line: 387, type: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !139, line: 52, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !327, line: 32, baseType: !328)
!327 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stdarg.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !304, baseType: !329)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 192, elements: !222)
!330 = !DILocation(line: 0, scope: !317)
!331 = !DILocation(line: 386, column: 3, scope: !317)
!332 = !DILocation(line: 387, column: 5, scope: !317)
!333 = !DILocation(line: 389, column: 3, scope: !317)
!334 = !DILocation(line: 0, scope: !295, inlinedAt: !335)
!335 = distinct !DILocation(line: 390, column: 5, scope: !317)
!336 = !DILocation(line: 374, column: 15, scope: !295, inlinedAt: !335)
!337 = !DILocation(line: 374, column: 5, scope: !295, inlinedAt: !335)
!338 = !DILocation(line: 391, column: 3, scope: !317)
!339 = !DILocation(line: 393, column: 1, scope: !317)
!340 = !DILocation(line: 392, column: 3, scope: !317)
!341 = distinct !DISubprogram(name: "FormatLocaleStringList", scope: !260, file: !260, line: 426, type: !342, scopeLine: 428, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !345)
!342 = !DISubroutineType(types: !343)
!343 = !{!138, !344, !284, !299, !300}
!344 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !150)
!345 = !{!346, !347, !348, !349, !350}
!346 = !DILocalVariable(name: "string", arg: 1, scope: !341, file: !260, line: 426, type: !344)
!347 = !DILocalVariable(name: "length", arg: 2, scope: !341, file: !260, line: 427, type: !284)
!348 = !DILocalVariable(name: "format", arg: 3, scope: !341, file: !260, line: 427, type: !299)
!349 = !DILocalVariable(name: "operands", arg: 4, scope: !341, file: !260, line: 427, type: !300)
!350 = !DILocalVariable(name: "n", scope: !341, file: !260, line: 430, type: !138)
!351 = !DILocation(line: 0, scope: !341)
!352 = !DILocation(line: 465, column: 15, scope: !341)
!353 = !DILocation(line: 470, column: 9, scope: !354)
!354 = distinct !DILexicalBlock(scope: !341, file: !260, line: 470, column: 7)
!355 = !DILocation(line: 470, column: 7, scope: !341)
!356 = !DILocation(line: 471, column: 18, scope: !354)
!357 = !DILocation(line: 471, column: 5, scope: !354)
!358 = !DILocation(line: 471, column: 21, scope: !354)
!359 = !{!360, !360, i64 0}
!360 = !{!"omnipotent char", !361, i64 0}
!361 = !{!"Simple C/C++ TBAA"}
!362 = !DILocation(line: 465, column: 5, scope: !341)
!363 = !DILocation(line: 472, column: 3, scope: !341)
!364 = distinct !DISubprogram(name: "FormatLocaleString", scope: !260, file: !260, line: 475, type: !365, scopeLine: 477, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !367)
!365 = !DISubroutineType(types: !366)
!366 = !{!138, !344, !284, !299, null}
!367 = !{!368, !369, !370, !371, !372}
!368 = !DILocalVariable(name: "string", arg: 1, scope: !364, file: !260, line: 475, type: !344)
!369 = !DILocalVariable(name: "length", arg: 2, scope: !364, file: !260, line: 476, type: !284)
!370 = !DILocalVariable(name: "format", arg: 3, scope: !364, file: !260, line: 476, type: !299)
!371 = !DILocalVariable(name: "n", scope: !364, file: !260, line: 479, type: !138)
!372 = !DILocalVariable(name: "operands", scope: !364, file: !260, line: 482, type: !325)
!373 = !DILocation(line: 0, scope: !364)
!374 = !DILocation(line: 481, column: 3, scope: !364)
!375 = !DILocation(line: 482, column: 5, scope: !364)
!376 = !DILocation(line: 484, column: 3, scope: !364)
!377 = !DILocation(line: 0, scope: !341, inlinedAt: !378)
!378 = distinct !DILocation(line: 485, column: 5, scope: !364)
!379 = !DILocation(line: 465, column: 15, scope: !341, inlinedAt: !378)
!380 = !DILocation(line: 470, column: 9, scope: !354, inlinedAt: !378)
!381 = !DILocation(line: 470, column: 7, scope: !341, inlinedAt: !378)
!382 = !DILocation(line: 471, column: 18, scope: !354, inlinedAt: !378)
!383 = !DILocation(line: 471, column: 5, scope: !354, inlinedAt: !378)
!384 = !DILocation(line: 471, column: 21, scope: !354, inlinedAt: !378)
!385 = !{!386}
!386 = distinct !{!386, !387, !"FormatLocaleStringList: %string"}
!387 = distinct !{!387, !"FormatLocaleStringList"}
!388 = !{!389}
!389 = distinct !{!389, !387, !"FormatLocaleStringList: %format"}
!390 = !DILocation(line: 465, column: 5, scope: !341, inlinedAt: !378)
!391 = !DILocation(line: 486, column: 3, scope: !364)
!392 = !DILocation(line: 488, column: 1, scope: !364)
!393 = !DILocation(line: 487, column: 3, scope: !364)
!394 = distinct !DISubprogram(name: "GetLocaleInfo_", scope: !260, file: !260, line: 516, type: !395, scopeLine: 518, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!395 = !DISubroutineType(types: !396)
!396 = !{!143, !163, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !32, line: 219, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !37, line: 102, size: 448, elements: !400)
!400 = !{!401, !403, !404, !405, !406, !407, !408, !409}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !399, file: !37, line: 105, baseType: !402, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !37, line: 100, baseType: !36)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !399, file: !37, line: 108, baseType: !195, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !399, file: !37, line: 111, baseType: !150, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !399, file: !37, line: 112, baseType: !150, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !399, file: !37, line: 115, baseType: !162, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !399, file: !37, line: 118, baseType: !155, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !399, file: !37, line: 121, baseType: !243, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !399, file: !37, line: 124, baseType: !160, size: 64, offset: 384)
!410 = !{!411, !412, !413}
!411 = !DILocalVariable(name: "tag", arg: 1, scope: !394, file: !260, line: 516, type: !163)
!412 = !DILocalVariable(name: "exception", arg: 2, scope: !394, file: !260, line: 517, type: !397)
!413 = !DILocalVariable(name: "locale_info", scope: !394, file: !260, line: 520, type: !143)
!414 = !DILocation(line: 0, scope: !394)
!415 = !DILocalVariable(name: "exception", arg: 1, scope: !416, file: !260, line: 911, type: !397)
!416 = distinct !DISubprogram(name: "IsLocaleTreeInstantiated", scope: !260, file: !260, line: 911, type: !417, scopeLine: 912, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !419)
!417 = !DISubroutineType(types: !418)
!418 = !{!155, !397}
!419 = !{!415, !420, !425}
!420 = !DILocalVariable(name: "locale", scope: !421, file: !260, line: 921, type: !150)
!421 = distinct !DILexicalBlock(scope: !422, file: !260, line: 919, column: 9)
!422 = distinct !DILexicalBlock(scope: !423, file: !260, line: 918, column: 11)
!423 = distinct !DILexicalBlock(scope: !424, file: !260, line: 914, column: 5)
!424 = distinct !DILexicalBlock(scope: !416, file: !260, line: 913, column: 7)
!425 = !DILocalVariable(name: "p", scope: !421, file: !260, line: 924, type: !163)
!426 = !DILocation(line: 0, scope: !416, inlinedAt: !427)
!427 = distinct !DILocation(line: 523, column: 7, scope: !428)
!428 = distinct !DILexicalBlock(scope: !394, file: !260, line: 523, column: 7)
!429 = !DILocation(line: 913, column: 7, scope: !424, inlinedAt: !427)
!430 = !{!431, !431, i64 0}
!431 = !{!"any pointer", !360, i64 0}
!432 = !DILocation(line: 913, column: 20, scope: !424, inlinedAt: !427)
!433 = !DILocation(line: 913, column: 7, scope: !416, inlinedAt: !427)
!434 = !DILocation(line: 915, column: 11, scope: !435, inlinedAt: !427)
!435 = distinct !DILexicalBlock(scope: !423, file: !260, line: 915, column: 11)
!436 = !DILocation(line: 915, column: 28, scope: !435, inlinedAt: !427)
!437 = !DILocation(line: 915, column: 11, scope: !423, inlinedAt: !427)
!438 = !DILocation(line: 916, column: 9, scope: !435, inlinedAt: !427)
!439 = !DILocation(line: 917, column: 25, scope: !423, inlinedAt: !427)
!440 = !DILocation(line: 917, column: 7, scope: !423, inlinedAt: !427)
!441 = !DILocation(line: 918, column: 11, scope: !422, inlinedAt: !427)
!442 = !DILocation(line: 918, column: 24, scope: !422, inlinedAt: !427)
!443 = !DILocation(line: 918, column: 11, scope: !423, inlinedAt: !427)
!444 = !DILocation(line: 0, scope: !421, inlinedAt: !427)
!445 = !DILocation(line: 927, column: 13, scope: !421, inlinedAt: !427)
!446 = !DILocation(line: 928, column: 17, scope: !447, inlinedAt: !427)
!447 = distinct !DILexicalBlock(scope: !421, file: !260, line: 928, column: 15)
!448 = !DILocation(line: 928, column: 15, scope: !421, inlinedAt: !427)
!449 = !DILocation(line: 929, column: 20, scope: !447, inlinedAt: !427)
!450 = !DILocation(line: 930, column: 22, scope: !451, inlinedAt: !427)
!451 = distinct !DILexicalBlock(scope: !421, file: !260, line: 930, column: 15)
!452 = !DILocation(line: 930, column: 15, scope: !421, inlinedAt: !427)
!453 = !DILocation(line: 931, column: 20, scope: !451, inlinedAt: !427)
!454 = !DILocation(line: 932, column: 22, scope: !455, inlinedAt: !427)
!455 = distinct !DILexicalBlock(scope: !421, file: !260, line: 932, column: 15)
!456 = !DILocation(line: 932, column: 15, scope: !421, inlinedAt: !427)
!457 = !DILocation(line: 933, column: 20, scope: !455, inlinedAt: !427)
!458 = !DILocation(line: 934, column: 22, scope: !459, inlinedAt: !427)
!459 = distinct !DILexicalBlock(scope: !421, file: !260, line: 934, column: 15)
!460 = !DILocation(line: 934, column: 15, scope: !421, inlinedAt: !427)
!461 = !DILocation(line: 935, column: 20, scope: !459, inlinedAt: !427)
