; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/encoder/lookahead.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/encoder/lookahead.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, float, float, float, i32, float, i32, i32, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }
%struct.x264_lookahead_t = type { i8, i8, i8, i32, i32, ptr, %struct.x264_synch_frame_list_t, %struct.x264_synch_frame_list_t, %struct.x264_synch_frame_list_t }
%struct.x264_synch_frame_list_t = type { ptr, i32, i32, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/encoder/lookahead.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "27b33612dfe1b8e274f9789e59678140")
!2 = !{i32 7, !"Dwarf Version", i32 5}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{i32 1, !"wchar_size", i32 4}
!5 = !{i32 7, !"PIC Level", i32 2}
!6 = !{i32 7, !"PIE Level", i32 2}
!7 = !{i32 7, !"uwtable", i32 2}
!8 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!9 = distinct !DISubprogram(name: "x264_lookahead_init", scope: !10, file: !10, line: 127, type: !11, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1330)
!10 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/lookahead.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "27b33612dfe1b8e274f9789e59678140")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !13}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !16, line: 46, baseType: !17)
!16 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !18, line: 381, size: 266752, elements: !19)
!18 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!19 = !{!20, !199, !203, !204, !205, !206, !207, !208, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !344, !346, !374, !376, !377, !378, !384, !388, !389, !390, !397, !401, !402, !403, !408, !411, !412, !491, !508, !672, !673, !674, !675, !679, !680, !681, !682, !683, !684, !685, !700, !894, !898, !959, !962, !964, !966, !967, !970, !975, !984, !985, !993, !995, !1000, !1076, !1162, !1206, !1228, !1277, !1306}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !17, file: !18, line: 384, baseType: !21, size: 5632)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !16, line: 376, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !16, line: 176, size: 5632, elements: !23)
!23 = !{!24, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !68, !77, !78, !79, !80, !84, !85, !100, !101, !102, !103, !104, !135, !177, !178, !179, !180, !181, !182, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !22, file: !16, line: 179, baseType: !25, size: 32)
!25 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !22, file: !16, line: 180, baseType: !13, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !22, file: !16, line: 181, baseType: !13, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !22, file: !16, line: 182, baseType: !13, size: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !22, file: !16, line: 183, baseType: !13, size: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !22, file: !16, line: 186, baseType: !13, size: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !22, file: !16, line: 187, baseType: !13, size: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !22, file: !16, line: 188, baseType: !13, size: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !22, file: !16, line: 189, baseType: !13, size: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !22, file: !16, line: 190, baseType: !13, size: 32, offset: 288)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !22, file: !16, line: 198, baseType: !13, size: 32, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !22, file: !16, line: 215, baseType: !37, size: 288, offset: 352)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !22, file: !16, line: 200, size: 288, elements: !38)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !37, file: !16, line: 203, baseType: !13, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !37, file: !16, line: 204, baseType: !13, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !37, file: !16, line: 206, baseType: !13, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !37, file: !16, line: 209, baseType: !13, size: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !37, file: !16, line: 210, baseType: !13, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !37, file: !16, line: 211, baseType: !13, size: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !37, file: !16, line: 212, baseType: !13, size: 32, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !37, file: !16, line: 213, baseType: !13, size: 32, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !37, file: !16, line: 214, baseType: !13, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !22, file: !16, line: 218, baseType: !13, size: 32, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !22, file: !16, line: 219, baseType: !13, size: 32, offset: 672)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !22, file: !16, line: 220, baseType: !13, size: 32, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !22, file: !16, line: 221, baseType: !13, size: 32, offset: 736)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !22, file: !16, line: 222, baseType: !13, size: 32, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !22, file: !16, line: 224, baseType: !13, size: 32, offset: 800)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !22, file: !16, line: 225, baseType: !13, size: 32, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !22, file: !16, line: 226, baseType: !13, size: 32, offset: 864)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !22, file: !16, line: 227, baseType: !13, size: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !22, file: !16, line: 229, baseType: !13, size: 32, offset: 928)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !22, file: !16, line: 230, baseType: !13, size: 32, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !22, file: !16, line: 231, baseType: !13, size: 32, offset: 992)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !22, file: !16, line: 233, baseType: !13, size: 32, offset: 1024)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !22, file: !16, line: 234, baseType: !13, size: 32, offset: 1056)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !22, file: !16, line: 236, baseType: !13, size: 32, offset: 1088)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !22, file: !16, line: 237, baseType: !13, size: 32, offset: 1120)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !22, file: !16, line: 239, baseType: !13, size: 32, offset: 1152)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !22, file: !16, line: 240, baseType: !66, size: 64, offset: 1216)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !22, file: !16, line: 241, baseType: !69, size: 128, offset: 1280)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !75)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !71, line: 24, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !73, line: 38, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!74 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !{!76}
!76 = !DISubrange(count: 16)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !22, file: !16, line: 242, baseType: !69, size: 128, offset: 1408)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !22, file: !16, line: 243, baseType: !69, size: 128, offset: 1536)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !22, file: !16, line: 244, baseType: !69, size: 128, offset: 1664)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !22, file: !16, line: 245, baseType: !81, size: 512, offset: 1792)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !22, file: !16, line: 246, baseType: !81, size: 512, offset: 2304)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !22, file: !16, line: 249, baseType: !86, size: 64, offset: 2816)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89, !13, !90, !92}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !94)
!94 = !{!95, !97, !98, !99}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !93, file: !96, baseType: !25, size: 32)
!96 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/lookahead.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !93, file: !96, baseType: !25, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !93, file: !96, baseType: !89, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !93, file: !96, baseType: !89, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !22, file: !16, line: 250, baseType: !89, size: 64, offset: 2880)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !22, file: !16, line: 251, baseType: !13, size: 32, offset: 2944)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !22, file: !16, line: 252, baseType: !13, size: 32, offset: 2976)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !22, file: !16, line: 253, baseType: !66, size: 64, offset: 3008)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !22, file: !16, line: 287, baseType: !105, size: 800, offset: 3072)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !22, file: !16, line: 256, size: 800, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !127, !128, !129, !133, !134}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !105, file: !16, line: 258, baseType: !25, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !105, file: !16, line: 259, baseType: !25, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !105, file: !16, line: 261, baseType: !13, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !105, file: !16, line: 262, baseType: !13, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !105, file: !16, line: 263, baseType: !13, size: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !105, file: !16, line: 264, baseType: !13, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !105, file: !16, line: 265, baseType: !13, size: 32, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !105, file: !16, line: 267, baseType: !13, size: 32, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !105, file: !16, line: 268, baseType: !13, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !105, file: !16, line: 269, baseType: !13, size: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !105, file: !16, line: 270, baseType: !13, size: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !105, file: !16, line: 271, baseType: !13, size: 32, offset: 352)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !105, file: !16, line: 272, baseType: !13, size: 32, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !105, file: !16, line: 273, baseType: !13, size: 32, offset: 416)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !105, file: !16, line: 274, baseType: !13, size: 32, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !105, file: !16, line: 275, baseType: !13, size: 32, offset: 480)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !105, file: !16, line: 276, baseType: !13, size: 32, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !105, file: !16, line: 277, baseType: !13, size: 32, offset: 544)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !105, file: !16, line: 278, baseType: !126, size: 32, offset: 576)
!126 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !105, file: !16, line: 279, baseType: !126, size: 32, offset: 608)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !105, file: !16, line: 280, baseType: !13, size: 32, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !105, file: !16, line: 283, baseType: !130, size: 64, offset: 672)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 2)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !105, file: !16, line: 285, baseType: !13, size: 32, offset: 736)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !105, file: !16, line: 286, baseType: !13, size: 32, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !22, file: !16, line: 327, baseType: !136, size: 1152, offset: 3904)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !22, file: !16, line: 290, size: 1152, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !175, !176}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !136, file: !16, line: 292, baseType: !13, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !136, file: !16, line: 294, baseType: !13, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !136, file: !16, line: 295, baseType: !13, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !136, file: !16, line: 296, baseType: !13, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !136, file: !16, line: 297, baseType: !13, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !136, file: !16, line: 299, baseType: !13, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !136, file: !16, line: 300, baseType: !126, size: 32, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !136, file: !16, line: 301, baseType: !126, size: 32, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !136, file: !16, line: 302, baseType: !126, size: 32, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !136, file: !16, line: 303, baseType: !13, size: 32, offset: 288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !136, file: !16, line: 304, baseType: !13, size: 32, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !136, file: !16, line: 305, baseType: !126, size: 32, offset: 352)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !136, file: !16, line: 306, baseType: !126, size: 32, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !136, file: !16, line: 307, baseType: !126, size: 32, offset: 416)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !136, file: !16, line: 309, baseType: !13, size: 32, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !136, file: !16, line: 310, baseType: !126, size: 32, offset: 480)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !136, file: !16, line: 311, baseType: !13, size: 32, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !136, file: !16, line: 312, baseType: !13, size: 32, offset: 544)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !136, file: !16, line: 315, baseType: !13, size: 32, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !136, file: !16, line: 316, baseType: !66, size: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !136, file: !16, line: 317, baseType: !13, size: 32, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !136, file: !16, line: 318, baseType: !66, size: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !136, file: !16, line: 321, baseType: !126, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !136, file: !16, line: 322, baseType: !126, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !136, file: !16, line: 323, baseType: !126, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !136, file: !16, line: 324, baseType: !164, size: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !16, line: 174, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 167, size: 256, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !166, file: !16, line: 169, baseType: !13, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !166, file: !16, line: 169, baseType: !13, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !166, file: !16, line: 170, baseType: !13, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !166, file: !16, line: 171, baseType: !13, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !166, file: !16, line: 172, baseType: !126, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !166, file: !16, line: 173, baseType: !174, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !136, file: !16, line: 325, baseType: !13, size: 32, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !136, file: !16, line: 326, baseType: !66, size: 64, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !22, file: !16, line: 330, baseType: !13, size: 32, offset: 5056)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !22, file: !16, line: 331, baseType: !13, size: 32, offset: 5088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !22, file: !16, line: 332, baseType: !13, size: 32, offset: 5120)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !22, file: !16, line: 334, baseType: !13, size: 32, offset: 5152)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !22, file: !16, line: 335, baseType: !13, size: 32, offset: 5184)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !22, file: !16, line: 336, baseType: !183, size: 32, offset: 5216)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !71, line: 26, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !73, line: 42, baseType: !25)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !22, file: !16, line: 337, baseType: !183, size: 32, offset: 5248)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !22, file: !16, line: 338, baseType: !183, size: 32, offset: 5280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !22, file: !16, line: 339, baseType: !183, size: 32, offset: 5312)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !22, file: !16, line: 340, baseType: !13, size: 32, offset: 5344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !22, file: !16, line: 344, baseType: !13, size: 32, offset: 5376)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !22, file: !16, line: 356, baseType: !13, size: 32, offset: 5408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !22, file: !16, line: 364, baseType: !13, size: 32, offset: 5440)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !22, file: !16, line: 367, baseType: !13, size: 32, offset: 5472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !22, file: !16, line: 368, baseType: !13, size: 32, offset: 5504)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !22, file: !16, line: 369, baseType: !13, size: 32, offset: 5536)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !22, file: !16, line: 375, baseType: !196, size: 64, offset: 5568)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !89}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !17, file: !18, line: 386, baseType: !200, size: 8256, offset: 5632)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8256, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 129)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !17, file: !18, line: 387, baseType: !13, size: 32, offset: 13888)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !17, file: !18, line: 388, baseType: !13, size: 32, offset: 13920)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !17, file: !18, line: 389, baseType: !13, size: 32, offset: 13952)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !17, file: !18, line: 390, baseType: !13, size: 32, offset: 13984)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !17, file: !18, line: 391, baseType: !13, size: 32, offset: 14016)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !17, file: !18, line: 402, baseType: !209, size: 576, offset: 14080)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !18, line: 394, size: 576, elements: !210)
!210 = !{!211, !212, !213, !223, !224, !225}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !209, file: !18, line: 396, baseType: !13, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !209, file: !18, line: 397, baseType: !13, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !209, file: !18, line: 398, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !16, line: 604, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 593, size: 192, elements: !217)
!217 = !{!218, !219, !220, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !216, file: !16, line: 595, baseType: !13, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !216, file: !16, line: 596, baseType: !13, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !216, file: !16, line: 599, baseType: !13, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !216, file: !16, line: 603, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !209, file: !18, line: 399, baseType: !13, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !209, file: !18, line: 400, baseType: !222, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !209, file: !18, line: 401, baseType: !226, size: 320, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !227, line: 56, baseType: !228)
!227 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !227, line: 47, size: 320, elements: !229)
!229 = !{!230, !231, !232, !233, !237, !238}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !228, file: !227, line: 49, baseType: !222, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !228, file: !227, line: 50, baseType: !222, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !228, file: !227, line: 51, baseType: !222, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !228, file: !227, line: 53, baseType: !234, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !235, line: 87, baseType: !236)
!235 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!236 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !228, file: !227, line: 54, baseType: !13, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !228, file: !227, line: 55, baseType: !13, size: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !17, file: !18, line: 404, baseType: !222, size: 64, offset: 14656)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !17, file: !18, line: 405, baseType: !13, size: 32, offset: 14720)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !17, file: !18, line: 410, baseType: !13, size: 32, offset: 14752)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !17, file: !18, line: 411, baseType: !13, size: 32, offset: 14784)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !17, file: !18, line: 413, baseType: !13, size: 32, offset: 14816)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !17, file: !18, line: 415, baseType: !13, size: 32, offset: 14848)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !17, file: !18, line: 416, baseType: !13, size: 32, offset: 14880)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !17, file: !18, line: 418, baseType: !13, size: 32, offset: 14912)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !17, file: !18, line: 419, baseType: !13, size: 32, offset: 14944)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !17, file: !18, line: 420, baseType: !13, size: 32, offset: 14976)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !17, file: !18, line: 421, baseType: !13, size: 32, offset: 15008)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !17, file: !18, line: 422, baseType: !13, size: 32, offset: 15040)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !17, file: !18, line: 424, baseType: !13, size: 32, offset: 15072)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !17, file: !18, line: 425, baseType: !13, size: 32, offset: 15104)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !17, file: !18, line: 427, baseType: !13, size: 32, offset: 15136)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !17, file: !18, line: 430, baseType: !255, size: 10400, offset: 15168)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 10400, elements: !342)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !257, line: 154, baseType: !258)
!257 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 52, size: 10400, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !277, !278, !279, !280, !281, !282, !283, !284, !285, !292, !293, !341}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !258, file: !257, line: 54, baseType: !13, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !258, file: !257, line: 56, baseType: !13, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !258, file: !257, line: 57, baseType: !13, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !258, file: !257, line: 59, baseType: !13, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !258, file: !257, line: 60, baseType: !13, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !258, file: !257, line: 61, baseType: !13, size: 32, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !258, file: !257, line: 63, baseType: !13, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !258, file: !257, line: 65, baseType: !13, size: 32, offset: 224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !258, file: !257, line: 67, baseType: !13, size: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !258, file: !257, line: 69, baseType: !13, size: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !258, file: !257, line: 70, baseType: !13, size: 32, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !258, file: !257, line: 71, baseType: !13, size: 32, offset: 352)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !258, file: !257, line: 72, baseType: !13, size: 32, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !258, file: !257, line: 73, baseType: !274, size: 8192, offset: 416)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8192, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !258, file: !257, line: 75, baseType: !13, size: 32, offset: 8608)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !258, file: !257, line: 76, baseType: !13, size: 32, offset: 8640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !258, file: !257, line: 77, baseType: !13, size: 32, offset: 8672)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !258, file: !257, line: 78, baseType: !13, size: 32, offset: 8704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !258, file: !257, line: 79, baseType: !13, size: 32, offset: 8736)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !258, file: !257, line: 80, baseType: !13, size: 32, offset: 8768)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !258, file: !257, line: 81, baseType: !13, size: 32, offset: 8800)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !258, file: !257, line: 83, baseType: !13, size: 32, offset: 8832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !258, file: !257, line: 90, baseType: !286, size: 128, offset: 8864)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !258, file: !257, line: 84, size: 128, elements: !287)
!287 = !{!288, !289, !290, !291}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !286, file: !257, line: 86, baseType: !13, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !286, file: !257, line: 87, baseType: !13, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !286, file: !257, line: 88, baseType: !13, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !286, file: !257, line: 89, baseType: !13, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !258, file: !257, line: 92, baseType: !13, size: 32, offset: 8992)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !258, file: !257, line: 150, baseType: !294, size: 1344, offset: 9024)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !258, file: !257, line: 93, size: 1344, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !294, file: !257, line: 95, baseType: !13, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !294, file: !257, line: 96, baseType: !13, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !294, file: !257, line: 97, baseType: !13, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !294, file: !257, line: 99, baseType: !13, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !294, file: !257, line: 100, baseType: !13, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !294, file: !257, line: 102, baseType: !13, size: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !294, file: !257, line: 103, baseType: !13, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !294, file: !257, line: 104, baseType: !13, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !294, file: !257, line: 105, baseType: !13, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !294, file: !257, line: 106, baseType: !13, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !294, file: !257, line: 107, baseType: !13, size: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !294, file: !257, line: 108, baseType: !13, size: 32, offset: 352)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !294, file: !257, line: 110, baseType: !13, size: 32, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !294, file: !257, line: 111, baseType: !13, size: 32, offset: 416)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !294, file: !257, line: 112, baseType: !13, size: 32, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !294, file: !257, line: 114, baseType: !13, size: 32, offset: 480)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !294, file: !257, line: 115, baseType: !183, size: 32, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !294, file: !257, line: 116, baseType: !183, size: 32, offset: 544)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !294, file: !257, line: 117, baseType: !13, size: 32, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !294, file: !257, line: 119, baseType: !13, size: 32, offset: 608)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !294, file: !257, line: 120, baseType: !13, size: 32, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !294, file: !257, line: 137, baseType: !318, size: 384, offset: 672)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !294, file: !257, line: 122, size: 384, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !318, file: !257, line: 124, baseType: !13, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !318, file: !257, line: 125, baseType: !13, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !318, file: !257, line: 126, baseType: !13, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !318, file: !257, line: 127, baseType: !13, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !318, file: !257, line: 128, baseType: !13, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !318, file: !257, line: 129, baseType: !13, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !318, file: !257, line: 130, baseType: !13, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !318, file: !257, line: 131, baseType: !13, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !318, file: !257, line: 133, baseType: !13, size: 32, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !318, file: !257, line: 134, baseType: !13, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !318, file: !257, line: 135, baseType: !13, size: 32, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !318, file: !257, line: 136, baseType: !13, size: 32, offset: 352)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !294, file: !257, line: 139, baseType: !13, size: 32, offset: 1056)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !294, file: !257, line: 140, baseType: !13, size: 32, offset: 1088)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !294, file: !257, line: 141, baseType: !13, size: 32, offset: 1120)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !294, file: !257, line: 142, baseType: !13, size: 32, offset: 1152)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !294, file: !257, line: 143, baseType: !13, size: 32, offset: 1184)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !294, file: !257, line: 144, baseType: !13, size: 32, offset: 1216)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !294, file: !257, line: 145, baseType: !13, size: 32, offset: 1248)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !294, file: !257, line: 146, baseType: !13, size: 32, offset: 1280)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !294, file: !257, line: 147, baseType: !13, size: 32, offset: 1312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !258, file: !257, line: 152, baseType: !13, size: 32, offset: 10368)
!342 = !{!343}
!343 = !DISubrange(count: 1)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !17, file: !18, line: 431, baseType: !345, size: 64, offset: 25600)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !17, file: !18, line: 432, baseType: !347, size: 960, offset: 25664)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 960, elements: !342)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !257, line: 186, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 156, size: 960, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !349, file: !257, line: 158, baseType: !13, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !349, file: !257, line: 159, baseType: !13, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !349, file: !257, line: 161, baseType: !13, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !349, file: !257, line: 163, baseType: !13, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !349, file: !257, line: 164, baseType: !13, size: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !349, file: !257, line: 166, baseType: !13, size: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !349, file: !257, line: 167, baseType: !13, size: 32, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !349, file: !257, line: 169, baseType: !13, size: 32, offset: 224)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !349, file: !257, line: 170, baseType: !13, size: 32, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !349, file: !257, line: 172, baseType: !13, size: 32, offset: 288)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !349, file: !257, line: 173, baseType: !13, size: 32, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !349, file: !257, line: 175, baseType: !13, size: 32, offset: 352)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !349, file: !257, line: 177, baseType: !13, size: 32, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !349, file: !257, line: 178, baseType: !13, size: 32, offset: 416)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !349, file: !257, line: 179, baseType: !13, size: 32, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !349, file: !257, line: 181, baseType: !13, size: 32, offset: 480)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !349, file: !257, line: 183, baseType: !13, size: 32, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !349, file: !257, line: 184, baseType: !369, size: 384, offset: 576)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 384, elements: !372)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!372 = !{!373}
!373 = !DISubrange(count: 6)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !17, file: !18, line: 433, baseType: !375, size: 64, offset: 26624)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !17, file: !18, line: 434, baseType: !13, size: 32, offset: 26688)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !17, file: !18, line: 437, baseType: !13, size: 32, offset: 26720)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !17, file: !18, line: 440, baseType: !379, size: 256, offset: 26752)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 256, elements: !382)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, elements: !75)
!382 = !{!383}
!383 = !DISubrange(count: 4)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !17, file: !18, line: 441, baseType: !385, size: 128, offset: 27008)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 128, elements: !131)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2048, elements: !82)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !17, file: !18, line: 443, baseType: !379, size: 256, offset: 27136)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !17, file: !18, line: 444, baseType: !385, size: 128, offset: 27392)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !17, file: !18, line: 446, baseType: !391, size: 256, offset: 27520)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 256, elements: !382)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 256, elements: !75)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !71, line: 25, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !73, line: 40, baseType: !396)
!396 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !17, file: !18, line: 447, baseType: !398, size: 128, offset: 27776)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 128, elements: !131)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 1024, elements: !82)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !17, file: !18, line: 448, baseType: !391, size: 256, offset: 27904)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !17, file: !18, line: 449, baseType: !398, size: 128, offset: 28160)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !17, file: !18, line: 454, baseType: !404, size: 5888, offset: 28288)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 5888, elements: !406)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!406 = !{!407}
!407 = !DISubrange(count: 92)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !17, file: !18, line: 455, baseType: !409, size: 23552, offset: 34176)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 23552, elements: !410)
!410 = !{!407, !383}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !17, file: !18, line: 457, baseType: !370, size: 64, offset: 57728)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !17, file: !18, line: 460, baseType: !413, size: 53376, offset: 57856)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !18, line: 364, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 302, size: 53376, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !444, !475, !476, !477, !483, !484, !485, !486, !487, !488, !489, !490}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !414, file: !18, line: 304, baseType: !345, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !414, file: !18, line: 305, baseType: !375, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !414, file: !18, line: 307, baseType: !13, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !414, file: !18, line: 308, baseType: !13, size: 32, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !414, file: !18, line: 309, baseType: !13, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !414, file: !18, line: 311, baseType: !13, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !414, file: !18, line: 313, baseType: !13, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !414, file: !18, line: 315, baseType: !13, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !414, file: !18, line: 316, baseType: !13, size: 32, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !414, file: !18, line: 317, baseType: !13, size: 32, offset: 352)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !414, file: !18, line: 319, baseType: !13, size: 32, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !414, file: !18, line: 321, baseType: !13, size: 32, offset: 416)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !414, file: !18, line: 322, baseType: !13, size: 32, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !414, file: !18, line: 324, baseType: !130, size: 64, offset: 480)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !414, file: !18, line: 325, baseType: !13, size: 32, offset: 544)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !414, file: !18, line: 327, baseType: !13, size: 32, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !414, file: !18, line: 329, baseType: !13, size: 32, offset: 608)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !414, file: !18, line: 330, baseType: !13, size: 32, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !414, file: !18, line: 331, baseType: !13, size: 32, offset: 672)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !414, file: !18, line: 333, baseType: !13, size: 32, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !414, file: !18, line: 334, baseType: !13, size: 32, offset: 736)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !414, file: !18, line: 339, baseType: !438, size: 2048, offset: 768)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 2048, elements: !443)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !18, line: 335, size: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !439, file: !18, line: 337, baseType: !13, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !439, file: !18, line: 338, baseType: !13, size: 32, offset: 32)
!443 = !{!132, !76}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !414, file: !18, line: 342, baseType: !445, size: 49152, align: 128, offset: 2816)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 49152, align: 128, elements: !472)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !447, line: 36, baseType: !448, align: 128)
!447 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !447, line: 26, size: 512, elements: !449)
!449 = !{!450, !458, !459, !462, !463, !464}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !448, file: !447, line: 30, baseType: !451, size: 128, align: 128)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 128, elements: !456)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !453, line: 25, baseType: !454)
!453 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !73, line: 39, baseType: !455)
!455 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!456 = !{!457}
!457 = !DISubrange(count: 8)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !448, file: !447, line: 31, baseType: !451, size: 128, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !448, file: !447, line: 32, baseType: !460, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !453, line: 26, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !73, line: 41, baseType: !13)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !448, file: !447, line: 33, baseType: !460, size: 32, offset: 288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !448, file: !447, line: 34, baseType: !460, size: 32, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !448, file: !447, line: 35, baseType: !465, size: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !447, line: 25, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !222, !13, !222, !13, !470, !13}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!472 = !{!473, !474}
!473 = !DISubrange(count: 32)
!474 = !DISubrange(count: 3)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !414, file: !18, line: 344, baseType: !13, size: 32, offset: 51968)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !414, file: !18, line: 345, baseType: !13, size: 32, offset: 52000)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !414, file: !18, line: 350, baseType: !478, size: 1024, offset: 52032)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 1024, elements: !75)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !18, line: 346, size: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !479, file: !18, line: 348, baseType: !13, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !479, file: !18, line: 349, baseType: !13, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !414, file: !18, line: 352, baseType: !13, size: 32, offset: 53056)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !414, file: !18, line: 354, baseType: !13, size: 32, offset: 53088)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !414, file: !18, line: 355, baseType: !13, size: 32, offset: 53120)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !414, file: !18, line: 356, baseType: !13, size: 32, offset: 53152)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !414, file: !18, line: 357, baseType: !13, size: 32, offset: 53184)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !414, file: !18, line: 360, baseType: !13, size: 32, offset: 53216)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !414, file: !18, line: 361, baseType: !13, size: 32, offset: 53248)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !414, file: !18, line: 362, baseType: !13, size: 32, offset: 53280)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !17, file: !18, line: 463, baseType: !492, size: 4096, offset: 111232)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !493, line: 46, baseType: !494)
!493 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 27, size: 4096, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503, !504}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !494, file: !493, line: 30, baseType: !13, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !494, file: !493, line: 31, baseType: !13, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !494, file: !493, line: 34, baseType: !13, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !494, file: !493, line: 35, baseType: !13, size: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !494, file: !493, line: 37, baseType: !222, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !494, file: !493, line: 38, baseType: !222, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !494, file: !493, line: 39, baseType: !222, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !494, file: !493, line: 42, baseType: !13, size: 32, align: 128, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !494, file: !493, line: 45, baseType: !505, size: 3680, offset: 416)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 3680, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 460)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !17, file: !18, line: 494, baseType: !509, size: 2112, offset: 115328)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !18, line: 465, size: 2112, elements: !510)
!510 = !{!511, !652, !654, !655, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !668, !669, !670, !671}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !509, file: !18, line: 468, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !515, line: 146, baseType: !516)
!515 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !515, line: 31, size: 125056, elements: !517)
!517 = !{!518, !519, !520, !521, !524, !525, !526, !527, !528, !529, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !548, !549, !550, !551, !552, !553, !555, !557, !558, !559, !560, !561, !564, !566, !567, !569, !574, !575, !579, !580, !584, !588, !591, !593, !594, !596, !597, !599, !600, !601, !604, !606, !607, !608, !610, !611, !612, !613, !614, !615, !616, !617, !619, !620, !624, !633, !637, !639, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !516, file: !515, line: 34, baseType: !13, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !516, file: !515, line: 35, baseType: !13, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !516, file: !515, line: 36, baseType: !13, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !516, file: !515, line: 37, baseType: !522, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !453, line: 27, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !73, line: 44, baseType: !236)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !516, file: !515, line: 38, baseType: !522, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !516, file: !515, line: 39, baseType: !13, size: 32, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !516, file: !515, line: 40, baseType: !13, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !516, file: !515, line: 41, baseType: !13, size: 32, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !516, file: !515, line: 42, baseType: !13, size: 32, offset: 352)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !516, file: !515, line: 43, baseType: !530, size: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !516, file: !515, line: 45, baseType: !13, size: 32, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !516, file: !515, line: 46, baseType: !13, size: 32, offset: 480)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !516, file: !515, line: 47, baseType: !13, size: 32, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !516, file: !515, line: 48, baseType: !13, size: 32, offset: 544)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !516, file: !515, line: 49, baseType: !13, size: 32, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !516, file: !515, line: 50, baseType: !13, size: 32, offset: 608)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !516, file: !515, line: 51, baseType: !13, size: 32, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !516, file: !515, line: 52, baseType: !70, size: 8, offset: 672)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !516, file: !515, line: 53, baseType: !70, size: 8, offset: 680)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !516, file: !515, line: 54, baseType: !70, size: 8, offset: 688)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !516, file: !515, line: 55, baseType: !126, size: 32, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !516, file: !515, line: 56, baseType: !126, size: 32, offset: 736)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !516, file: !515, line: 57, baseType: !13, size: 32, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !516, file: !515, line: 60, baseType: !13, size: 32, offset: 800)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !516, file: !515, line: 61, baseType: !546, size: 96, offset: 832)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, elements: !547)
!547 = !{!474}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !516, file: !515, line: 62, baseType: !546, size: 96, offset: 928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !516, file: !515, line: 63, baseType: !546, size: 96, offset: 1024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !516, file: !515, line: 64, baseType: !13, size: 32, offset: 1120)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !516, file: !515, line: 65, baseType: !13, size: 32, offset: 1152)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !516, file: !515, line: 66, baseType: !13, size: 32, offset: 1184)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !516, file: !515, line: 67, baseType: !554, size: 192, offset: 1216)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 192, elements: !547)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !516, file: !515, line: 68, baseType: !556, size: 256, offset: 1408)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 256, elements: !382)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !516, file: !515, line: 69, baseType: !556, size: 256, offset: 1664)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !516, file: !515, line: 70, baseType: !405, size: 64, offset: 1920)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !516, file: !515, line: 74, baseType: !556, size: 256, offset: 1984)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !516, file: !515, line: 75, baseType: !556, size: 256, offset: 2240)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !516, file: !515, line: 77, baseType: !562, size: 24576, align: 128, offset: 2560)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 24576, align: 128, elements: !563)
!563 = !{!76, !474}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !516, file: !515, line: 78, baseType: !565, size: 1024, offset: 27136)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 1024, elements: !75)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !516, file: !515, line: 79, baseType: !13, size: 32, offset: 28160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !516, file: !515, line: 80, baseType: !568, size: 64, offset: 28224)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !516, file: !515, line: 83, baseType: !570, size: 64, offset: 28288)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !453, line: 24, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !73, line: 37, baseType: !573)
!573 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !516, file: !515, line: 84, baseType: !222, size: 64, offset: 28352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !516, file: !515, line: 85, baseType: !576, size: 128, offset: 28416)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 128, elements: !131)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 32, elements: !131)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !516, file: !515, line: 86, baseType: !577, size: 64, offset: 28544)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !516, file: !515, line: 87, baseType: !581, size: 2176, offset: 28608)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 2176, elements: !582)
!582 = !{!132, !583}
!583 = !DISubrange(count: 17)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !516, file: !515, line: 92, baseType: !585, size: 20736, offset: 30784)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 20736, elements: !586)
!586 = !{!587, !587}
!587 = !DISubrange(count: 18)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !516, file: !515, line: 96, baseType: !589, size: 2176, offset: 51520)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 2176, elements: !582)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !516, file: !515, line: 97, baseType: !592, size: 128, offset: 53696)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 128, elements: !131)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !516, file: !515, line: 98, baseType: !130, size: 64, offset: 53824)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !516, file: !515, line: 99, baseType: !595, size: 1024, offset: 53888)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024, elements: !443)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !516, file: !515, line: 100, baseType: !578, size: 32, offset: 54912)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !516, file: !515, line: 105, baseType: !598, size: 10368, offset: 54944)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 10368, elements: !586)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !516, file: !515, line: 106, baseType: !598, size: 10368, offset: 65312)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !516, file: !515, line: 107, baseType: !13, size: 32, offset: 75680)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !516, file: !515, line: 108, baseType: !602, size: 576, offset: 75712)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 576, elements: !603)
!603 = !{!587}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !516, file: !515, line: 109, baseType: !605, size: 20736, offset: 76288)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 20736, elements: !586)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !516, file: !515, line: 110, baseType: !590, size: 64, offset: 97024)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !516, file: !515, line: 111, baseType: !590, size: 64, offset: 97088)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !516, file: !515, line: 112, baseType: !609, size: 64, offset: 97152)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !516, file: !515, line: 113, baseType: !609, size: 64, offset: 97216)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !516, file: !515, line: 114, baseType: !609, size: 64, offset: 97280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !516, file: !515, line: 115, baseType: !13, size: 32, offset: 97344)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !516, file: !515, line: 116, baseType: !405, size: 64, offset: 97408)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !516, file: !515, line: 117, baseType: !405, size: 64, offset: 97472)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !516, file: !515, line: 118, baseType: !405, size: 64, offset: 97536)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !516, file: !515, line: 119, baseType: !13, size: 32, offset: 97600)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !516, file: !515, line: 120, baseType: !618, size: 576, offset: 97632)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 576, elements: !603)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !516, file: !515, line: 121, baseType: !183, size: 32, offset: 98208)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !516, file: !515, line: 122, baseType: !621, size: 64, offset: 98240)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !71, line: 27, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !73, line: 45, baseType: !623)
!623 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !516, file: !515, line: 125, baseType: !625, size: 256, offset: 98304)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !16, line: 503, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 496, size: 256, elements: !627)
!627 = !{!628, !630, !631, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !626, file: !16, line: 498, baseType: !629, size: 64)
!629 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !626, file: !16, line: 499, baseType: !629, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !626, file: !16, line: 500, baseType: !629, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !626, file: !16, line: 502, baseType: !629, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !516, file: !515, line: 128, baseType: !634, size: 2008, offset: 98560)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2008, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 251)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !516, file: !515, line: 129, baseType: !638, size: 8032, offset: 100576)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8032, elements: !635)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !516, file: !515, line: 130, baseType: !640, size: 16064, offset: 108608)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 16064, elements: !635)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !516, file: !515, line: 131, baseType: !13, size: 32, offset: 124672)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !516, file: !515, line: 132, baseType: !13, size: 32, offset: 124704)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !516, file: !515, line: 135, baseType: !13, size: 32, offset: 124736)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !516, file: !515, line: 136, baseType: !13, size: 32, offset: 124768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !516, file: !515, line: 137, baseType: !13, size: 32, offset: 124800)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !516, file: !515, line: 138, baseType: !13, size: 32, offset: 124832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !516, file: !515, line: 139, baseType: !13, size: 32, offset: 124864)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !516, file: !515, line: 142, baseType: !126, size: 32, offset: 124896)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !516, file: !515, line: 143, baseType: !13, size: 32, offset: 124928)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !516, file: !515, line: 144, baseType: !13, size: 32, offset: 124960)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !516, file: !515, line: 145, baseType: !13, size: 32, offset: 124992)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !509, file: !18, line: 470, baseType: !653, size: 128, offset: 64)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 128, elements: !131)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !509, file: !18, line: 473, baseType: !512, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !509, file: !18, line: 476, baseType: !656, size: 1152, offset: 256)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 1152, elements: !603)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !509, file: !18, line: 478, baseType: !13, size: 32, offset: 1408)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !509, file: !18, line: 480, baseType: !13, size: 32, offset: 1440)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !509, file: !18, line: 482, baseType: !13, size: 32, offset: 1472)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !509, file: !18, line: 483, baseType: !13, size: 32, offset: 1504)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !509, file: !18, line: 484, baseType: !13, size: 32, offset: 1536)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !509, file: !18, line: 485, baseType: !13, size: 32, offset: 1568)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !509, file: !18, line: 486, baseType: !13, size: 32, offset: 1600)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !509, file: !18, line: 487, baseType: !522, size: 64, offset: 1664)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !509, file: !18, line: 488, baseType: !522, size: 64, offset: 1728)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !509, file: !18, line: 489, baseType: !667, size: 128, offset: 1792)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 128, elements: !131)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !509, file: !18, line: 490, baseType: !522, size: 64, offset: 1920)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !509, file: !18, line: 491, baseType: !522, size: 64, offset: 1984)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !509, file: !18, line: 492, baseType: !13, size: 32, offset: 2048)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !509, file: !18, line: 493, baseType: !13, size: 32, offset: 2080)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !17, file: !18, line: 497, baseType: !513, size: 64, offset: 117440)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !17, file: !18, line: 500, baseType: !513, size: 64, offset: 117504)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !17, file: !18, line: 503, baseType: !13, size: 32, offset: 117568)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !17, file: !18, line: 504, baseType: !676, size: 1216, offset: 117632)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 1216, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 19)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !17, file: !18, line: 505, baseType: !13, size: 32, offset: 118848)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !17, file: !18, line: 506, baseType: !676, size: 1216, offset: 118912)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !17, file: !18, line: 507, baseType: !130, size: 64, offset: 120128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !17, file: !18, line: 510, baseType: !13, size: 32, offset: 120192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !17, file: !18, line: 511, baseType: !13, size: 32, offset: 120224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !17, file: !18, line: 512, baseType: !522, size: 64, offset: 120256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !17, file: !18, line: 522, baseType: !686, size: 10624, offset: 120320)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !18, line: 515, size: 10624, elements: !687)
!687 = !{!688, !690, !693, !696}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !686, file: !18, line: 517, baseType: !689, size: 256, align: 128)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 256, elements: !75)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !686, file: !18, line: 518, baseType: !691, size: 128, align: 128, offset: 256)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 128, elements: !692)
!692 = !{!132, !383}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !686, file: !18, line: 520, baseType: !694, size: 4096, align: 128, offset: 384)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 4096, elements: !695)
!695 = !{!383, !83}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !686, file: !18, line: 521, baseType: !697, size: 6144, align: 128, offset: 4480)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 6144, elements: !698)
!698 = !{!699, !76}
!699 = !DISubrange(count: 24)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !17, file: !18, line: 732, baseType: !701, size: 82688, offset: 130944)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !18, line: 525, size: 82688, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !730, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !748, !751, !755, !756, !757, !762, !763, !766, !767, !768, !769, !770, !771, !772, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !832, !863, !864, !865, !866, !867, !868, !869, !870, !871, !874, !875, !876, !879, !882, !884, !887, !889, !890}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !701, file: !18, line: 527, baseType: !13, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !701, file: !18, line: 530, baseType: !13, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !701, file: !18, line: 531, baseType: !13, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !701, file: !18, line: 532, baseType: !13, size: 32, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !701, file: !18, line: 535, baseType: !13, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !701, file: !18, line: 536, baseType: !13, size: 32, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !701, file: !18, line: 537, baseType: !13, size: 32, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !701, file: !18, line: 538, baseType: !13, size: 32, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !701, file: !18, line: 539, baseType: !13, size: 32, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !701, file: !18, line: 542, baseType: !13, size: 32, offset: 288)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !701, file: !18, line: 543, baseType: !13, size: 32, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !701, file: !18, line: 544, baseType: !13, size: 32, offset: 352)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !701, file: !18, line: 545, baseType: !13, size: 32, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !701, file: !18, line: 546, baseType: !13, size: 32, offset: 416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !701, file: !18, line: 547, baseType: !13, size: 32, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !701, file: !18, line: 548, baseType: !13, size: 32, offset: 480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !701, file: !18, line: 549, baseType: !13, size: 32, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !701, file: !18, line: 551, baseType: !13, size: 32, offset: 544)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !701, file: !18, line: 554, baseType: !130, size: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !701, file: !18, line: 555, baseType: !130, size: 64, offset: 640)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !701, file: !18, line: 558, baseType: !130, size: 64, offset: 704)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !701, file: !18, line: 559, baseType: !130, size: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !701, file: !18, line: 561, baseType: !130, size: 64, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !701, file: !18, line: 562, baseType: !130, size: 64, offset: 896)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !701, file: !18, line: 565, baseType: !25, size: 32, offset: 960)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !701, file: !18, line: 566, baseType: !729, size: 128, offset: 992)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !382)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !701, file: !18, line: 567, baseType: !731, size: 512, offset: 1120)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, elements: !75)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !701, file: !18, line: 568, baseType: !25, size: 32, offset: 1632)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !701, file: !18, line: 569, baseType: !25, size: 32, offset: 1664)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !701, file: !18, line: 570, baseType: !13, size: 32, offset: 1696)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !701, file: !18, line: 571, baseType: !13, size: 32, offset: 1728)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !701, file: !18, line: 572, baseType: !13, size: 32, offset: 1760)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !701, file: !18, line: 573, baseType: !13, size: 32, offset: 1792)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !701, file: !18, line: 574, baseType: !13, size: 32, offset: 1824)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !701, file: !18, line: 575, baseType: !13, size: 32, offset: 1856)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !701, file: !18, line: 576, baseType: !13, size: 32, offset: 1888)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !701, file: !18, line: 577, baseType: !13, size: 32, offset: 1920)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !701, file: !18, line: 578, baseType: !13, size: 32, offset: 1952)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !701, file: !18, line: 585, baseType: !570, size: 64, offset: 1984)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !701, file: !18, line: 586, baseType: !222, size: 64, offset: 2048)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !701, file: !18, line: 587, baseType: !570, size: 64, offset: 2112)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !701, file: !18, line: 588, baseType: !747, size: 64, offset: 2176)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !701, file: !18, line: 589, baseType: !749, size: 64, offset: 2240)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 64, elements: !456)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !701, file: !18, line: 591, baseType: !752, size: 64, offset: 2304)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 192, elements: !754)
!754 = !{!699}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !701, file: !18, line: 592, baseType: !570, size: 64, offset: 2368)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !701, file: !18, line: 593, baseType: !576, size: 128, offset: 2432)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !701, file: !18, line: 594, baseType: !758, size: 128, offset: 2560)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 128, elements: !131)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !761)
!761 = !{!457, !132}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !701, file: !18, line: 595, baseType: !592, size: 128, offset: 2688)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !701, file: !18, line: 596, baseType: !764, size: 4096, offset: 2816)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 4096, elements: !765)
!765 = !{!132, !473}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !701, file: !18, line: 597, baseType: !570, size: 64, offset: 6912)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !701, file: !18, line: 598, baseType: !570, size: 64, offset: 6976)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !701, file: !18, line: 599, baseType: !405, size: 64, offset: 7040)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !701, file: !18, line: 603, baseType: !565, size: 1024, offset: 7104)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !701, file: !18, line: 606, baseType: !13, size: 32, offset: 8128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !701, file: !18, line: 607, baseType: !13, size: 32, offset: 8160)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !701, file: !18, line: 608, baseType: !773, size: 32, align: 32, offset: 8192)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32, elements: !382)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !701, file: !18, line: 609, baseType: !13, size: 32, offset: 8224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !701, file: !18, line: 611, baseType: !13, size: 32, offset: 8256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !701, file: !18, line: 612, baseType: !13, size: 32, offset: 8288)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !701, file: !18, line: 614, baseType: !13, size: 32, offset: 8320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !701, file: !18, line: 615, baseType: !13, size: 32, offset: 8352)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !701, file: !18, line: 621, baseType: !13, size: 32, offset: 8384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !701, file: !18, line: 624, baseType: !13, size: 32, offset: 8416)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !701, file: !18, line: 626, baseType: !13, size: 32, offset: 8448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !701, file: !18, line: 627, baseType: !13, size: 32, offset: 8480)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !701, file: !18, line: 671, baseType: !784, size: 60672, offset: 8576)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !701, file: !18, line: 629, size: 60672, elements: !785)
!785 = !{!786, !790, !794, !796, !797, !800, !804, !806, !807, !808, !809, !810, !813, !817, !820, !821, !822, !823, !824, !827, !829, !831}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !784, file: !18, line: 634, baseType: !787, size: 3072, align: 128)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 3072, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !784, file: !18, line: 635, baseType: !791, size: 6912, align: 128, offset: 3072)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 6912, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 864)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !784, file: !18, line: 638, baseType: !795, size: 2048, align: 128, offset: 9984)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2048, elements: !275)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !784, file: !18, line: 639, baseType: !795, size: 2048, align: 128, offset: 12032)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !784, file: !18, line: 640, baseType: !798, size: 3072, align: 128, offset: 14080)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 3072, elements: !799)
!799 = !{!474, !83}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !784, file: !18, line: 641, baseType: !801, size: 3840, align: 128, offset: 17152)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 3840, elements: !802)
!802 = !{!803, !76}
!803 = !DISubrange(count: 15)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !784, file: !18, line: 642, baseType: !805, size: 128, offset: 20992)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 128, elements: !382)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !784, file: !18, line: 643, baseType: !805, size: 128, offset: 21120)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !784, file: !18, line: 644, baseType: !13, size: 32, offset: 21248)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !784, file: !18, line: 645, baseType: !13, size: 32, offset: 21280)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !784, file: !18, line: 648, baseType: !694, size: 4096, align: 128, offset: 21376)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !784, file: !18, line: 649, baseType: !811, size: 4096, align: 128, offset: 25472)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 4096, elements: !812)
!812 = !{!76, !76}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_hadamard_cache", scope: !784, file: !18, line: 652, baseType: !814, size: 576, align: 128, offset: 29568)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 576, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 9)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_cache", scope: !784, file: !18, line: 653, baseType: !818, size: 1024, align: 128, offset: 30208)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 1024, elements: !819)
!819 = !{!473}
