; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/lz/lz_decoder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lz/lz_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_lz_options = type { i64, ptr, i64 }
%struct.lzma_next_coder_s = type { ptr, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.lzma_dict = type { ptr, i64, i64, i64, i64, i8 }
%struct.lzma_coder_s = type { %struct.lzma_dict, %struct.lzma_lz_decoder, %struct.lzma_next_coder_s, i8, i8, %struct.anon }
%struct.lzma_lz_decoder = type { ptr, ptr, ptr, ptr, ptr }
%struct.anon = type { i64, i64, [4096 x i8] }
%struct.lzma_filter_info_s = type { i64, ptr, ptr }

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_lz_decoder_init(ptr nocapture noundef %next, ptr noundef %allocator, ptr noundef %filters, ptr nocapture noundef readonly %lz_init) local_unnamed_addr #0 !dbg !171 {
entry:
  %lz_options = alloca %struct.lzma_lz_options, align 8
  call void @llvm.dbg.value(metadata ptr %next, metadata !199, metadata !DIExpression()), !dbg !212
  call void @llvm.dbg.value(metadata ptr %allocator, metadata !200, metadata !DIExpression()), !dbg !212
  call void @llvm.dbg.value(metadata ptr %filters, metadata !201, metadata !DIExpression()), !dbg !212

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !32, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lz/lz_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "ed19f3c26d5c9c90f2e6eec526321cb7")
!2 = !{!3, !19, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!32 = !{!33, !34, !51, !92}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !36, line: 23, size: 34176, elements: !37)
!36 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lz/lz_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ed19f3c26d5c9c90f2e6eec526321cb7")
!37 = !{!38, !59, !111, !153, !154, !155}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !35, file: !36, line: 25, baseType: !39, size: 384)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_dict", file: !40, line: 44, baseType: !41)
!40 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lz/lz_decoder.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "27344aa2da5754ad4a118fbd9137003b")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 20, size: 384, elements: !42)
!42 = !{!43, !50, !54, !55, !56, !57}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !41, file: !40, line: 24, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !46, line: 24, baseType: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !48, line: 38, baseType: !49)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !41, file: !40, line: 28, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !52, line: 46, baseType: !53)
!52 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!53 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !41, file: !40, line: 33, baseType: !51, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !41, file: !40, line: 36, baseType: !51, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !41, file: !40, line: 39, baseType: !51, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "need_reset", scope: !41, file: !40, line: 42, baseType: !58, size: 8, offset: 320)
!58 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "lz", scope: !35, file: !36, line: 28, baseType: !60, size: 320, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_decoder", file: !40, line: 72, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 54, size: 320, elements: !62)
!62 = !{!63, !67, !80, !86, !94}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !61, file: !40, line: 56, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !66, line: 78, baseType: null)
!66 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !61, file: !40, line: 59, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !72, !73, !75, !78, !51}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!72 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !64)
!73 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!78 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !61, file: !40, line: 63, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !64, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "set_uncompressed", scope: !61, file: !40, line: 66, baseType: !87, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !64, !90}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !91, line: 63, baseType: !92)
!91 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !46, line: 27, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !48, line: 45, baseType: !53)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !61, file: !40, line: 70, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !64, !98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !101)
!101 = !{!102, !106, !110}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !100, file: !4, line: 376, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!33, !33, !51, !51}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !100, file: !4, line: 390, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !33, !33}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !100, file: !4, line: 401, baseType: !33, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !35, file: !36, line: 33, baseType: !112, size: 512, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !66, line: 80, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !66, line: 124, size: 512, elements: !114)
!114 = !{!115, !116, !117, !120, !127, !129, !136, !141}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !113, file: !66, line: 126, baseType: !64, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !113, file: !66, line: 130, baseType: !90, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !113, file: !66, line: 136, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !119, line: 90, baseType: !53)
!119 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !113, file: !66, line: 139, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !66, line: 94, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!71, !64, !98, !75, !78, !51, !125, !78, !51, !126}
!125 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !44)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !113, file: !66, line: 144, baseType: !128, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !66, line: 102, baseType: !95)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !113, file: !66, line: 148, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !113, file: !66, line: 152, baseType: !137, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!71, !64, !140, !140, !92}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !113, file: !66, line: 157, baseType: !142, size: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!71, !64, !98, !145, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !148, line: 65, baseType: !149)
!148 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 43, size: 128, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !149, file: !148, line: 54, baseType: !90, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !149, file: !148, line: 63, baseType: !33, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next_finished", scope: !35, file: !36, line: 36, baseType: !58, size: 8, offset: 1216)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "this_finished", scope: !35, file: !36, line: 40, baseType: !58, size: 8, offset: 1224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !35, file: !36, line: 50, baseType: !156, size: 32896, offset: 1280)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !35, file: !36, line: 46, size: 32896, elements: !157)
!157 = !{!158, !159, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !156, file: !36, line: 47, baseType: !51, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !156, file: !36, line: 48, baseType: !51, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !156, file: !36, line: 49, baseType: !161, size: 32768, offset: 128)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32768, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 4096)
!164 = !{i32 7, !"Dwarf Version", i32 5}
!165 = !{i32 2, !"Debug Info Version", i32 3}
!166 = !{i32 1, !"wchar_size", i32 4}
!167 = !{i32 7, !"PIC Level", i32 2}
!168 = !{i32 7, !"PIE Level", i32 2}
!169 = !{i32 7, !"uwtable", i32 2}
!170 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!171 = distinct !DISubprogram(name: "lzma_lz_decoder_init", scope: !36, file: !36, line: 207, type: !172, scopeLine: 212, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !198)
!172 = !DISubroutineType(types: !173)
!173 = !{!71, !174, !98, !175, !187}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !66, line: 82, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !66, line: 109, size: 192, elements: !179)
!179 = !{!180, !181, !186}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !178, file: !66, line: 112, baseType: !90, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !178, file: !66, line: 116, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !66, line: 86, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!71, !174, !98, !175}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !178, file: !66, line: 119, baseType: !33, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!71, !190, !98, !84, !191}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !40, line: 51, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 47, size: 192, elements: !194)
!194 = !{!195, !196, !197}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !193, file: !40, line: 48, baseType: !51, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !193, file: !40, line: 49, baseType: !76, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !193, file: !40, line: 50, baseType: !51, size: 64, offset: 128)
!198 = !{!199, !200, !201, !202, !203, !204, !207, !211}
!199 = !DILocalVariable(name: "next", arg: 1, scope: !171, file: !36, line: 207, type: !174)
!200 = !DILocalVariable(name: "allocator", arg: 2, scope: !171, file: !36, line: 207, type: !98)
!201 = !DILocalVariable(name: "filters", arg: 3, scope: !171, file: !36, line: 208, type: !175)
!202 = !DILocalVariable(name: "lz_init", arg: 4, scope: !171, file: !36, line: 209, type: !187)
!203 = !DILocalVariable(name: "lz_options", scope: !171, file: !36, line: 230, type: !192)
!204 = !DILocalVariable(name: "ret_", scope: !205, file: !36, line: 231, type: !206)
!205 = distinct !DILexicalBlock(scope: !171, file: !36, line: 231, column: 2)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!207 = !DILocalVariable(name: "copy_size", scope: !208, file: !36, line: 272, type: !210)
!208 = distinct !DILexicalBlock(scope: !209, file: !36, line: 269, column: 40)
!209 = distinct !DILexicalBlock(scope: !171, file: !36, line: 268, column: 6)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!211 = !DILocalVariable(name: "offset", scope: !208, file: !36, line: 274, type: !210)
!212 = !DILocation(line: 0, scope: !171)
!213 = !DILocation(line: 214, column: 12, scope: !214)
!214 = distinct !DILexicalBlock(scope: !171, file: !36, line: 214, column: 6)
!215 = !{!216, !217, i64 0}
!216 = !{!"lzma_next_coder_s", !217, i64 0, !220, i64 8, !220, i64 16, !217, i64 24, !217, i64 32, !217, i64 40, !217, i64 48, !217, i64 56}
!217 = !{!"any pointer", !218, i64 0}
!218 = !{!"omnipotent char", !219, i64 0}
!219 = !{!"Simple C/C++ TBAA"}
!220 = !{!"long", !218, i64 0}
!221 = !DILocation(line: 214, column: 18, scope: !214)
!222 = !DILocation(line: 214, column: 6, scope: !171)
!223 = !DILocation(line: 215, column: 17, scope: !224)
!224 = distinct !DILexicalBlock(scope: !214, file: !36, line: 214, column: 27)
!225 = !DILocation(line: 215, column: 15, scope: !224)
!226 = !DILocation(line: 216, column: 19, scope: !227)
!227 = distinct !DILexicalBlock(scope: !224, file: !36, line: 216, column: 7)
!228 = !DILocation(line: 216, column: 7, scope: !224)
!229 = !DILocation(line: 219, column: 9, scope: !224)
!230 = !DILocation(line: 219, column: 14, scope: !224)
!231 = !{!216, !217, i64 24}
!232 = !DILocation(line: 220, column: 9, scope: !224)
!233 = !DILocation(line: 220, column: 13, scope: !224)
!234 = !{!216, !217, i64 32}
!235 = !DILocation(line: 222, column: 49, scope: !224)
!236 = !{!237, !217, i64 0}
!237 = !{!"lzma_coder_s", !238, i64 0, !240, i64 48, !216, i64 88, !239, i64 152, !239, i64 153, !241, i64 160}
!238 = !{!"", !217, i64 0, !220, i64 8, !220, i64 16, !220, i64 24, !220, i64 32, !239, i64 40}
!239 = !{!"_Bool", !218, i64 0}
!240 = !{!"", !217, i64 0, !217, i64 8, !217, i64 16, !217, i64 24, !217, i64 32}
!241 = !{!"", !220, i64 0, !220, i64 8, !218, i64 16}
!242 = !DILocation(line: 223, column: 45, scope: !224)
!243 = !DILocation(line: 223, column: 50, scope: !224)
!244 = !{!237, !220, i64 32}
!245 = !DILocation(line: 224, column: 40, scope: !224)
!246 = !DILocation(line: 224, column: 45, scope: !224)
!247 = !DILocation(line: 225, column: 32, scope: !224)
!248 = !DILocation(line: 225, column: 40, scope: !224)
!249 = !DILocation(line: 225, column: 47, scope: !224)
!250 = !{i64 0, i64 8, !251, i64 8, i64 8, !252, i64 16, i64 8, !252, i64 24, i64 8, !251, i64 32, i64 8, !251, i64 40, i64 8, !251, i64 48, i64 8, !251, i64 56, i64 8, !251}
!251 = !{!217, !217, i64 0}
!252 = !{!220, !220, i64 0}
!253 = !{i64 0, i64 8, !252, i64 8, i64 8, !252, i64 16, i64 8, !251, i64 24, i64 8, !251, i64 32, i64 8, !251, i64 40, i64 8, !251, i64 48, i64 8, !251}
!254 = !DILocation(line: 231, column: 2, scope: !205)
!255 = !DILocation(line: 226, column: 2, scope: !224)
!256 = !DILocation(line: 230, column: 2, scope: !171)
!257 = !DILocation(line: 230, column: 18, scope: !171)
