; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/lz/lz_encoder_mf.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lz/lz_encoder_mf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_mf_s = type { ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_match = type { i32, i32 }

@lzma_crc32_table = external local_unnamed_addr constant [8 x [256 x i32]], align 16

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_mf_find(ptr noundef %mf, ptr nocapture noundef writeonly %count_ptr, ptr noundef %matches) local_unnamed_addr #0 !dbg !23 {
entry:
  call void @llvm.dbg.value(metadata ptr %mf, metadata !74, metadata !DIExpression()), !dbg !89
  call void @llvm.dbg.value(metadata ptr %count_ptr, metadata !75, metadata !DIExpression()), !dbg !89
  call void @llvm.dbg.value(metadata ptr %matches, metadata !76, metadata !DIExpression()), !dbg !89
  %find = getelementptr inbounds %struct.lzma_mf_s, ptr %mf, i64 0, i32 10, !dbg !90
  %0 = load ptr, ptr %find, align 8, !dbg !90, !tbaa !91
  %call = tail call i32 %0(ptr noundef %mf, ptr noundef %matches) #3, !dbg !97
  call void @llvm.dbg.value(metadata i32 %call, metadata !77, metadata !DIExpression()), !dbg !89

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lz/lz_encoder_mf.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "5d460b327ab3f2eae21e0870eafddd6d")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!8 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!9 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!10 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 42, baseType: !5)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!16 = !{i32 7, !"Dwarf Version", i32 5}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{i32 7, !"PIC Level", i32 2}
!20 = !{i32 7, !"PIE Level", i32 2}
!21 = !{i32 7, !"uwtable", i32 2}
!22 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!23 = distinct !DISubprogram(name: "lzma_mf_find", scope: !24, file: !24, line: 22, type: !25, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !73)
!24 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lz/lz_encoder_mf.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5d460b327ab3f2eae21e0870eafddd6d")
!25 = !DISubroutineType(types: !26)
!26 = !{!12, !27, !61, !50}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !29, line: 28, baseType: !30)
!29 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lz/lz_encoder.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "780f78e6e21a3ca52f57df68bfdc6f53")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !29, line: 29, size: 960, elements: !31)
!31 = !{!32, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !56, !60, !62, !63, !64, !65, !66, !67, !68, !69, !71, !72}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !30, file: !29, line: 35, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 38, baseType: !36)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 39, baseType: !12, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !30, file: !29, line: 45, baseType: !12, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !30, file: !29, line: 51, baseType: !12, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !30, file: !29, line: 58, baseType: !12, size: 32, offset: 160)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !30, file: !29, line: 63, baseType: !12, size: 32, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !30, file: !29, line: 67, baseType: !12, size: 32, offset: 224)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !30, file: !29, line: 75, baseType: !12, size: 32, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !30, file: !29, line: 80, baseType: !12, size: 32, offset: 288)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !30, file: !29, line: 84, baseType: !12, size: 32, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !30, file: !29, line: 92, baseType: !47, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!12, !27, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !29, line: 25, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 22, size: 64, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !52, file: !29, line: 23, baseType: !12, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !52, file: !29, line: 24, baseType: !12, size: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !30, file: !29, line: 97, baseType: !57, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !27, !12}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !30, file: !29, line: 99, baseType: !61, size: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !30, file: !29, line: 100, baseType: !61, size: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !30, file: !29, line: 101, baseType: !12, size: 32, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !30, file: !29, line: 102, baseType: !12, size: 32, offset: 672)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !30, file: !29, line: 103, baseType: !12, size: 32, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !30, file: !29, line: 106, baseType: !12, size: 32, offset: 736)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !30, file: !29, line: 109, baseType: !12, size: 32, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !30, file: !29, line: 114, baseType: !12, size: 32, offset: 800)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !30, file: !29, line: 119, baseType: !70, size: 32, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !3)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !30, file: !29, line: 122, baseType: !12, size: 32, offset: 864)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !30, file: !29, line: 125, baseType: !12, size: 32, offset: 896)
!73 = !{!74, !75, !76, !77, !79, !80, !85, !88}
!74 = !DILocalVariable(name: "mf", arg: 1, scope: !23, file: !24, line: 22, type: !27)
!75 = !DILocalVariable(name: "count_ptr", arg: 2, scope: !23, file: !24, line: 22, type: !61)
!76 = !DILocalVariable(name: "matches", arg: 3, scope: !23, file: !24, line: 22, type: !50)
!77 = !DILocalVariable(name: "count", scope: !23, file: !24, line: 27, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!79 = !DILocalVariable(name: "len_best", scope: !23, file: !24, line: 31, type: !12)
!80 = !DILocalVariable(name: "limit", scope: !81, file: !24, line: 56, type: !12)
!81 = distinct !DILexicalBlock(scope: !82, file: !24, line: 51, column: 33)
!82 = distinct !DILexicalBlock(scope: !83, file: !24, line: 51, column: 7)
!83 = distinct !DILexicalBlock(scope: !84, file: !24, line: 33, column: 17)
!84 = distinct !DILexicalBlock(scope: !23, file: !24, line: 33, column: 6)
!85 = !DILocalVariable(name: "p1", scope: !81, file: !24, line: 62, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!88 = !DILocalVariable(name: "p2", scope: !81, file: !24, line: 66, type: !86)
!89 = !DILocation(line: 0, scope: !23)
!90 = !DILocation(line: 27, column: 29, scope: !23)
!91 = !{!92, !93, i64 48}
!92 = !{!"lzma_mf_s", !93, i64 0, !96, i64 8, !96, i64 12, !96, i64 16, !96, i64 20, !96, i64 24, !96, i64 28, !96, i64 32, !96, i64 36, !96, i64 40, !93, i64 48, !93, i64 56, !93, i64 64, !93, i64 72, !96, i64 80, !96, i64 84, !96, i64 88, !96, i64 92, !96, i64 96, !96, i64 100, !94, i64 104, !96, i64 108, !96, i64 112}
!93 = !{!"any pointer", !94, i64 0}
!94 = !{!"omnipotent char", !95, i64 0}
!95 = !{!"Simple C/C++ TBAA"}
!96 = !{!"int", !94, i64 0}
!97 = !DILocation(line: 27, column: 25, scope: !23)
!98 = !DILocation(line: 33, column: 12, scope: !84)
!99 = !DILocation(line: 33, column: 6, scope: !23)
!100 = !DILocation(line: 47, column: 28, scope: !83)
!101 = !DILocation(line: 47, column: 14, scope: !83)
!102 = !DILocation(line: 47, column: 33, scope: !83)
!103 = !{!104, !96, i64 0}
!104 = !{!"", !96, i64 0, !96, i64 4}
!105 = !DILocation(line: 51, column: 23, scope: !82)
!106 = !{!92, !96, i64 96}
!107 = !DILocation(line: 51, column: 16, scope: !82)
!108 = !DILocation(line: 51, column: 7, scope: !83)
!109 = !DILocation(line: 56, column: 21, scope: !81)
!110 = !{!92, !96, i64 24}
!111 = !{!92, !96, i64 36}
!112 = !DILocalVariable(name: "mf", arg: 1, scope: !113, file: !29, line: 230, type: !116)
!113 = distinct !DISubprogram(name: "mf_avail", scope: !29, file: !29, line: 230, type: !114, scopeLine: 231, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !118)
!114 = !DISubroutineType(types: !115)
!115 = !{!12, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!118 = !{!112}
!119 = !DILocation(line: 0, scope: !113, inlinedAt: !120)
!120 = distinct !DILocation(line: 56, column: 21, scope: !81)
!121 = !DILocation(line: 232, column: 23, scope: !113, inlinedAt: !120)
!122 = !DILocation(line: 56, column: 34, scope: !81)
!123 = !DILocation(line: 0, scope: !81)
!124 = !DILocation(line: 57, column: 20, scope: !125)
!125 = distinct !DILexicalBlock(scope: !81, file: !24, line: 57, column: 8)
!126 = !{!92, !96, i64 100}
!127 = !DILocation(line: 57, column: 8, scope: !81)
!128 = !DILocation(line: 62, column: 24, scope: !81)
!129 = !{!92, !93, i64 0}
!130 = !DILocalVariable(name: "mf", arg: 1, scope: !131, file: !29, line: 222, type: !116)
