; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/lz/lz_encoder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lz/lz_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_mf_s = type { ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_lz_options = type { i64, i64, i64, i64, i64, i32, i32, ptr, i32 }
%struct.lzma_next_coder_s = type { ptr, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.lzma_coder_s = type { %struct.lzma_lz_encoder, %struct.lzma_mf_s, %struct.lzma_next_coder_s }
%struct.lzma_lz_encoder = type { ptr, ptr, ptr, ptr }
%struct.lzma_filter_info_s = type { i64, ptr, ptr }
%struct.lzma_filter = type { i64, ptr }

; Function Attrs: nounwind uwtable
define dso_local i64 @lzma_lz_encoder_memusage(ptr nocapture noundef readonly %lz_options) local_unnamed_addr #0 !dbg !193 {
entry:
  %mf = alloca %struct.lzma_mf_s, align 8
  call void @llvm.dbg.value(metadata ptr %lz_options, metadata !212, metadata !DIExpression()), !dbg !214
  call void @llvm.lifetime.start.p0(i64 120, ptr nonnull %mf) #7, !dbg !215
  call void @llvm.dbg.declare(metadata ptr %mf, metadata !213, metadata !DIExpression()), !dbg !216

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !40, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lz/lz_encoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "65da03540b3892812a4487523e184b85")
!2 = !{!3, !12, !19, !33}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/lzma.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c59c540efa0aff44f03d71331089fff8")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!8 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!9 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!10 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!11 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 250, baseType: !5, size: 32, elements: !14)
!13 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!16 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!17 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!18 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 57, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!21 = !DIEnumerator(name: "LZMA_OK", value: 0)
!22 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!23 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!24 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!25 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!26 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!27 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!28 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!29 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!30 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!31 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!32 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 27, baseType: !5, size: 32, elements: !35)
!34 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!37 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!38 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!39 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!40 = !{!41, !46, !47, !117}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !42, line: 27, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !44, line: 45, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!45 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !49, line: 24, size: 1728, elements: !50)
!49 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lz/lz_encoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "65da03540b3892812a4487523e184b85")
!50 = !{!51, !150, !151}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lz", scope: !48, file: !49, line: 26, baseType: !52, size: 256)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_encoder", file: !53, line: 208, baseType: !54)
!53 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lz/lz_encoder.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "780f78e6e21a3ca52f57df68bfdc6f53")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 192, size: 256, elements: !55)
!55 = !{!56, !60, !119, !136}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !54, file: !53, line: 194, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !59, line: 78, baseType: null)
!59 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!60 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !54, file: !53, line: 197, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !65, !66, !114, !115, !117}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !13, line: 237, baseType: !19)
!65 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !57)
!66 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !53, line: 28, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !53, line: 29, size: 960, elements: !70)
!70 = !{!71, !76, !79, !80, !81, !82, !83, !84, !85, !86, !87, !97, !101, !103, !104, !105, !106, !107, !108, !109, !110, !112, !113}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !69, file: !53, line: 35, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !42, line: 24, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !44, line: 38, baseType: !75)
!75 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !69, file: !53, line: 39, baseType: !77, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !42, line: 26, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !44, line: 42, baseType: !5)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !69, file: !53, line: 45, baseType: !77, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !69, file: !53, line: 51, baseType: !77, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !69, file: !53, line: 58, baseType: !77, size: 32, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !69, file: !53, line: 63, baseType: !77, size: 32, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !69, file: !53, line: 67, baseType: !77, size: 32, offset: 224)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !69, file: !53, line: 75, baseType: !77, size: 32, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !69, file: !53, line: 80, baseType: !77, size: 32, offset: 288)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !69, file: !53, line: 84, baseType: !77, size: 32, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !69, file: !53, line: 92, baseType: !88, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!77, !67, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !53, line: 25, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 22, size: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !93, file: !53, line: 23, baseType: !77, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !93, file: !53, line: 24, baseType: !77, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !69, file: !53, line: 97, baseType: !98, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !67, !77}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !69, file: !53, line: 99, baseType: !102, size: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !69, file: !53, line: 100, baseType: !102, size: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !69, file: !53, line: 101, baseType: !77, size: 32, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !69, file: !53, line: 102, baseType: !77, size: 32, offset: 672)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !69, file: !53, line: 103, baseType: !77, size: 32, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !69, file: !53, line: 106, baseType: !77, size: 32, offset: 736)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !69, file: !53, line: 109, baseType: !77, size: 32, offset: 768)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !69, file: !53, line: 114, baseType: !77, size: 32, offset: 800)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !69, file: !53, line: 119, baseType: !111, size: 32, offset: 832)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !13, line: 322, baseType: !12)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !69, file: !53, line: 122, baseType: !77, size: 32, offset: 864)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !69, file: !53, line: 125, baseType: !77, size: 32, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!115 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 46, baseType: !45)
!118 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !54, file: !53, line: 202, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !57, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !13, line: 403, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 341, size: 192, elements: !126)
!126 = !{!127, !131, !135}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !125, file: !13, line: 376, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!46, !46, !117, !117}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !125, file: !13, line: 390, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !46, !46}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !125, file: !13, line: 401, baseType: !46, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "options_update", scope: !54, file: !53, line: 205, baseType: !137, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!64, !57, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !143, line: 65, baseType: !144)
!143 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 43, size: 128, elements: !145)
!145 = !{!146, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !144, file: !143, line: 54, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !148, line: 63, baseType: !41)
!148 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!149 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !144, file: !143, line: 63, baseType: !46, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !48, file: !49, line: 29, baseType: !68, size: 960, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !49, line: 32, baseType: !152, size: 512, offset: 1216)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !59, line: 80, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !59, line: 124, size: 512, elements: !154)
!154 = !{!155, !156, !157, !160, !168, !170, !177, !182}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !153, file: !59, line: 126, baseType: !57, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !59, line: 130, baseType: !147, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !153, file: !59, line: 136, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !159, line: 90, baseType: !45)
!159 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !153, file: !59, line: 139, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !59, line: 94, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!64, !57, !123, !165, !115, !117, !114, !115, !117, !111}
!165 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !153, file: !59, line: 144, baseType: !169, size: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !59, line: 102, baseType: !120)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !153, file: !59, line: 148, baseType: !171, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !34, line: 55, baseType: !33)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !153, file: !59, line: 152, baseType: !178, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!64, !57, !181, !181, !41}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !153, file: !59, line: 157, baseType: !183, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!64, !57, !123, !140, !140}
!186 = !{i32 7, !"Dwarf Version", i32 5}
!187 = !{i32 2, !"Debug Info Version", i32 3}
!188 = !{i32 1, !"wchar_size", i32 4}
!189 = !{i32 7, !"PIC Level", i32 2}
!190 = !{i32 7, !"PIE Level", i32 2}
!191 = !{i32 7, !"uwtable", i32 2}
!192 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!193 = distinct !DISubprogram(name: "lzma_lz_encoder_memusage", scope: !49, file: !49, line: 444, type: !194, scopeLine: 445, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !211)
!194 = !DISubroutineType(types: !195)
!195 = !{!41, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !53, line: 161, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 129, size: 512, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !208, !209, !210}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !199, file: !53, line: 132, baseType: !117, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !199, file: !53, line: 135, baseType: !117, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !199, file: !53, line: 139, baseType: !117, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !199, file: !53, line: 144, baseType: !117, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !199, file: !53, line: 148, baseType: !117, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !199, file: !53, line: 151, baseType: !207, size: 32, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !4, line: 111, baseType: !3)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !199, file: !53, line: 154, baseType: !77, size: 32, offset: 352)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !199, file: !53, line: 157, baseType: !166, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !199, file: !53, line: 159, baseType: !77, size: 32, offset: 448)
!211 = !{!212, !213}
!212 = !DILocalVariable(name: "lz_options", arg: 1, scope: !193, file: !49, line: 444, type: !196)
!213 = !DILocalVariable(name: "mf", scope: !193, file: !49, line: 447, type: !68)
!214 = !DILocation(line: 0, scope: !193)
!215 = !DILocation(line: 447, column: 2, scope: !193)
!216 = !DILocation(line: 447, column: 10, scope: !193)
!217 = !DILocation(line: 455, column: 6, scope: !218)
!218 = distinct !DILexicalBlock(scope: !193, file: !49, line: 455, column: 6)
!219 = !DILocation(line: 455, column: 6, scope: !193)
!220 = !DILocation(line: 459, column: 23, scope: !193)
!221 = !{!222, !226, i64 108}
!222 = !{!"lzma_mf_s", !223, i64 0, !226, i64 8, !226, i64 12, !226, i64 16, !226, i64 20, !226, i64 24, !226, i64 28, !226, i64 32, !226, i64 36, !226, i64 40, !223, i64 48, !223, i64 56, !223, i64 64, !223, i64 72, !226, i64 80, !226, i64 84, !226, i64 88, !226, i64 92, !226, i64 96, !226, i64 100, !224, i64 104, !226, i64 108, !226, i64 112}
!223 = !{!"any pointer", !224, i64 0}
!224 = !{!"omnipotent char", !225, i64 0}
!225 = !{!"Simple C/C++ TBAA"}
!226 = !{!"int", !224, i64 0}
!227 = !DILocation(line: 459, column: 42, scope: !193)
!228 = !{!222, !226, i64 112}
!229 = !DILocation(line: 459, column: 37, scope: !193)
!230 = !DILocation(line: 459, column: 9, scope: !193)
!231 = !DILocation(line: 460, column: 5, scope: !193)
!232 = !DILocation(line: 461, column: 41, scope: !193)
!233 = !{!222, !226, i64 8}
!234 = !DILocation(line: 461, column: 27, scope: !193)
!235 = !DILocation(line: 461, column: 25, scope: !193)
!236 = !DILocation(line: 461, column: 47, scope: !193)
!237 = !DILocation(line: 459, column: 2, scope: !193)
!238 = !DILocation(line: 462, column: 1, scope: !193)
!239 = distinct !DISubprogram(name: "lz_encoder_prepare", scope: !49, file: !49, line: 184, type: !240, scopeLine: 186, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !243)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !67, !123, !196}
!242 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!243 = !{!244, !245, !246, !247, !248, !250, !251, !253, !254, !255}
!244 = !DILocalVariable(name: "mf", arg: 1, scope: !239, file: !49, line: 184, type: !67)
!245 = !DILocalVariable(name: "allocator", arg: 2, scope: !239, file: !49, line: 184, type: !123)
!246 = !DILocalVariable(name: "lz_options", arg: 3, scope: !239, file: !49, line: 185, type: !196)
!247 = !DILocalVariable(name: "reserve", scope: !239, file: !49, line: 212, type: !77)
!248 = !DILocalVariable(name: "old_size", scope: !239, file: !49, line: 219, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!250 = !DILocalVariable(name: "hash_bytes", scope: !239, file: !49, line: 289, type: !249)
!251 = !DILocalVariable(name: "is_bt", scope: !239, file: !49, line: 293, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!253 = !DILocalVariable(name: "hs", scope: !239, file: !49, line: 294, type: !77)
!254 = !DILocalVariable(name: "old_count", scope: !239, file: !49, line: 336, type: !249)
!255 = !DILocalVariable(name: "new_count", scope: !239, file: !49, line: 342, type: !249)
!256 = !DILocation(line: 0, scope: !239)
!257 = !DILocation(line: 190, column: 18, scope: !258)
!258 = distinct !DILexicalBlock(scope: !239, file: !49, line: 190, column: 6)
!259 = !{!260, !261, i64 8}
!260 = !{!"", !261, i64 0, !261, i64 8, !261, i64 16, !261, i64 24, !261, i64 32, !224, i64 40, !226, i64 44, !223, i64 48, !226, i64 56}
!261 = !{!"long", !224, i64 0}
!262 = !DILocation(line: 191, column: 4, scope: !258)
!263 = !DILocation(line: 193, column: 19, scope: !258)
!264 = !{!260, !261, i64 32}
!265 = !DILocation(line: 193, column: 42, scope: !258)
!266 = !{!260, !261, i64 24}
!267 = !DILocation(line: 193, column: 28, scope: !258)
!268 = !DILocation(line: 190, column: 6, scope: !239)
!269 = !DILocation(line: 196, column: 37, scope: !239)
!270 = !{!260, !261, i64 0}
!271 = !DILocation(line: 196, column: 49, scope: !239)
!272 = !DILocation(line: 196, column: 25, scope: !239)
!273 = !DILocation(line: 196, column: 6, scope: !239)
!274 = !DILocation(line: 196, column: 23, scope: !239)
!275 = !{!222, !226, i64 12}
!276 = !DILocation(line: 198, column: 36, scope: !239)
!277 = !{!260, !261, i64 16}
!278 = !DILocation(line: 199, column: 4, scope: !239)
!279 = !DILocation(line: 198, column: 24, scope: !239)
!280 = !DILocation(line: 198, column: 6, scope: !239)
!281 = !DILocation(line: 198, column: 22, scope: !239)
!282 = !{!222, !226, i64 16}
!283 = !DILocation(line: 212, column: 43, scope: !239)
!284 = !DILocation(line: 212, column: 21, scope: !239)
!285 = !DILocation(line: 217, column: 4, scope: !239)
!286 = !DILocation(line: 217, column: 30, scope: !239)
!287 = !DILocation(line: 216, column: 10, scope: !239)
!288 = !DILocation(line: 219, column: 32, scope: !239)
!289 = !DILocation(line: 220, column: 34, scope: !239)
!290 = !DILocation(line: 220, column: 44, scope: !239)
!291 = !DILocation(line: 220, column: 11, scope: !239)
!292 = !DILocation(line: 224, column: 10, scope: !293)
!293 = distinct !DILexicalBlock(scope: !239, file: !49, line: 224, column: 6)
!294 = !{!222, !223, i64 0}
!295 = !DILocation(line: 224, column: 17, scope: !293)
!296 = !DILocation(line: 224, column: 25, scope: !293)
!297 = !DILocation(line: 225, column: 3, scope: !298)
!298 = distinct !DILexicalBlock(scope: !293, file: !49, line: 224, column: 50)
!299 = !DILocation(line: 226, column: 14, scope: !298)
!300 = !DILocation(line: 230, column: 34, scope: !239)
!301 = !DILocation(line: 231, column: 29, scope: !239)
!302 = !DILocation(line: 248, column: 32, scope: !239)
!303 = !DILocation(line: 227, column: 2, scope: !298)
!304 = !DILocation(line: 230, column: 22, scope: !239)
!305 = !DILocation(line: 230, column: 6, scope: !239)
!306 = !DILocation(line: 230, column: 20, scope: !239)
!307 = !{!222, !226, i64 100}
!308 = !DILocation(line: 231, column: 17, scope: !239)
!309 = !DILocation(line: 231, column: 6, scope: !239)
!310 = !DILocation(line: 231, column: 15, scope: !239)
!311 = !{!222, !226, i64 96}
!312 = !DILocation(line: 248, column: 20, scope: !239)
!313 = !DILocation(line: 248, column: 6, scope: !239)
!314 = !DILocation(line: 248, column: 18, scope: !239)
!315 = !{!222, !226, i64 84}
!316 = !DILocation(line: 251, column: 22, scope: !239)
!317 = !{!260, !224, i64 40}
!318 = !DILocation(line: 251, column: 2, scope: !239)
!319 = !DILocation(line: 262, column: 3, scope: !320)
!320 = distinct !DILexicalBlock(scope: !239, file: !49, line: 251, column: 36)
!321 = !DILocation(line: 268, column: 3, scope: !320)
!322 = !DILocation(line: 274, column: 3, scope: !320)
!323 = !DILocation(line: 280, column: 3, scope: !320)
!324 = !DILocation(line: 0, scope: !320)
!325 = !{!222, !223, i64 48}
!326 = !{!222, !223, i64 56}
!327 = !DILocation(line: 289, column: 55, scope: !239)
!328 = !DILocation(line: 290, column: 17, scope: !329)
!329 = distinct !DILexicalBlock(scope: !239, file: !49, line: 290, column: 6)
!330 = !DILocation(line: 290, column: 6, scope: !239)
!331 = !DILocation(line: 293, column: 47, scope: !239)
!332 = !DILocation(line: 293, column: 55, scope: !239)
!333 = !DILocation(line: 296, column: 17, scope: !334)
!334 = distinct !DILexicalBlock(scope: !239, file: !49, line: 296, column: 6)
!335 = !DILocation(line: 296, column: 6, scope: !239)
!336 = !DILocation(line: 301, column: 8, scope: !337)
!337 = distinct !DILexicalBlock(scope: !334, file: !49, line: 298, column: 9)
!338 = !DILocation(line: 302, column: 12, scope: !337)
!339 = !DILocation(line: 302, column: 6, scope: !337)
!340 = !DILocation(line: 303, column: 12, scope: !337)
!341 = !DILocation(line: 303, column: 6, scope: !337)
!342 = !DILocation(line: 304, column: 12, scope: !337)
!343 = !DILocation(line: 304, column: 6, scope: !337)
!344 = !DILocation(line: 306, column: 6, scope: !337)
!345 = !DILocation(line: 307, column: 6, scope: !337)
!346 = !DILocation(line: 309, column: 10, scope: !347)
!347 = distinct !DILexicalBlock(scope: !337, file: !49, line: 309, column: 7)
!348 = !DILocation(line: 309, column: 7, scope: !337)
!349 = !DILocation(line: 310, column: 19, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !49, line: 310, column: 8)
!351 = distinct !DILexicalBlock(scope: !347, file: !49, line: 309, column: 33)
!352 = !DILocation(line: 310, column: 8, scope: !351)
!353 = !DILocation(line: 0, scope: !334)
!354 = !DILocation(line: 317, column: 6, scope: !239)
!355 = !DILocation(line: 317, column: 16, scope: !239)
!356 = !{!222, !226, i64 88}
!357 = !DILocation(line: 320, column: 17, scope: !358)
!358 = distinct !DILexicalBlock(scope: !239, file: !49, line: 320, column: 6)
!359 = !DILocation(line: 320, column: 6, scope: !239)
!360 = !DILocation(line: 322, column: 17, scope: !361)
!361 = distinct !DILexicalBlock(scope: !239, file: !49, line: 322, column: 6)
!362 = !DILocation(line: 322, column: 6, scope: !239)
!363 = !DILocation(line: 336, column: 33, scope: !239)
!364 = !DILocation(line: 336, column: 53, scope: !239)
!365 = !DILocation(line: 336, column: 47, scope: !239)
!366 = !DILocation(line: 337, column: 20, scope: !239)
!367 = !DILocation(line: 339, column: 6, scope: !239)
!368 = !DILocation(line: 342, column: 47, scope: !239)
!369 = !DILocation(line: 346, column: 16, scope: !370)
!370 = distinct !DILexicalBlock(scope: !239, file: !49, line: 346, column: 6)
!371 = !DILocation(line: 346, column: 6, scope: !239)
!372 = !DILocation(line: 347, column: 17, scope: !373)
!373 = distinct !DILexicalBlock(scope: !370, file: !49, line: 346, column: 30)
!374 = !{!222, !223, i64 64}
!375 = !DILocation(line: 347, column: 3, scope: !373)
!376 = !DILocation(line: 348, column: 12, scope: !373)
!377 = !DILocation(line: 349, column: 2, scope: !373)
!378 = !DILocation(line: 352, column: 26, scope: !239)
!379 = !{!260, !226, i64 44}
!380 = !DILocation(line: 352, column: 6, scope: !239)
!381 = !DILocation(line: 352, column: 12, scope: !239)
!382 = !{!222, !226, i64 92}
!383 = !DILocation(line: 353, column: 16, scope: !384)
!384 = distinct !DILexicalBlock(scope: !239, file: !49, line: 353, column: 6)
!385 = !DILocation(line: 353, column: 6, scope: !239)
!386 = !DILocation(line: 0, scope: !387)
!387 = distinct !DILexicalBlock(scope: !388, file: !49, line: 354, column: 7)
!388 = distinct !DILexicalBlock(scope: !384, file: !49, line: 353, column: 22)
!389 = !DILocation(line: 361, column: 1, scope: !239)
!390 = distinct !DISubprogram(name: "lzma_lz_encoder_init", scope: !49, file: !49, line: 502, type: !391, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !413)
!391 = !DISubroutineType(types: !392)
!392 = !{!64, !393, !123, !394, !406}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !59, line: 82, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !59, line: 109, size: 192, elements: !398)
!398 = !{!399, !400, !405}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !397, file: !59, line: 112, baseType: !147, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !397, file: !59, line: 116, baseType: !401, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !59, line: 86, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!64, !393, !123, !394}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !397, file: !59, line: 119, baseType: !46, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!64, !409, !123, !410, !412}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!413 = !{!414, !415, !416, !417, !418, !419}
!414 = !DILocalVariable(name: "next", arg: 1, scope: !390, file: !49, line: 502, type: !393)
!415 = !DILocalVariable(name: "allocator", arg: 2, scope: !390, file: !49, line: 502, type: !123)
!416 = !DILocalVariable(name: "filters", arg: 3, scope: !390, file: !49, line: 503, type: !394)
!417 = !DILocalVariable(name: "lz_init", arg: 4, scope: !390, file: !49, line: 504, type: !406)
!418 = !DILocalVariable(name: "lz_options", scope: !390, file: !49, line: 536, type: !198)
!419 = !DILocalVariable(name: "ret_", scope: !420, file: !49, line: 537, type: !421)
!420 = distinct !DILexicalBlock(scope: !390, file: !49, line: 537, column: 2)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!422 = !DILocation(line: 0, scope: !390)
!423 = !DILocation(line: 514, column: 12, scope: !424)
!424 = distinct !DILexicalBlock(scope: !390, file: !49, line: 514, column: 6)
!425 = !{!426, !223, i64 0}
!426 = !{!"lzma_next_coder_s", !223, i64 0, !261, i64 8, !261, i64 16, !223, i64 24, !223, i64 32, !223, i64 40, !223, i64 48, !223, i64 56}
!427 = !DILocation(line: 514, column: 18, scope: !424)
!428 = !DILocation(line: 514, column: 6, scope: !390)
!429 = !DILocation(line: 515, column: 17, scope: !430)
!430 = distinct !DILexicalBlock(scope: !424, file: !49, line: 514, column: 27)
!431 = !DILocation(line: 515, column: 15, scope: !430)
!432 = !DILocation(line: 516, column: 19, scope: !433)
!433 = distinct !DILexicalBlock(scope: !430, file: !49, line: 516, column: 7)
!434 = !DILocation(line: 516, column: 7, scope: !430)
!435 = !DILocation(line: 519, column: 9, scope: !430)
!436 = !DILocation(line: 519, column: 14, scope: !430)
!437 = !{!426, !223, i64 24}
!438 = !DILocation(line: 520, column: 9, scope: !430)
!439 = !DILocation(line: 520, column: 13, scope: !430)
!440 = !{!426, !223, i64 32}
!441 = !DILocation(line: 521, column: 9, scope: !430)
!442 = !DILocation(line: 521, column: 16, scope: !430)
!443 = !{!426, !223, i64 56}
!444 = !DILocation(line: 527, column: 40, scope: !430)
!445 = !DILocation(line: 527, column: 50, scope: !430)
!446 = !{!447, !223, i64 32}
!447 = !{!"lzma_coder_s", !448, i64 0, !222, i64 32, !426, i64 152}
!448 = !{!"", !223, i64 0, !223, i64 8, !223, i64 16, !223, i64 24}
!449 = !DILocation(line: 528, column: 43, scope: !430)
!450 = !DILocation(line: 528, column: 48, scope: !430)
!451 = !{!447, !223, i64 96}
!452 = !DILocation(line: 529, column: 43, scope: !430)
!453 = !DILocation(line: 529, column: 57, scope: !430)
!454 = !{!447, !226, i64 140}
!455 = !DILocation(line: 530, column: 43, scope: !430)
!456 = !DILocation(line: 530, column: 54, scope: !430)
!457 = !{!447, !226, i64 144}
!458 = !DILocation(line: 532, column: 40, scope: !430)
!459 = !DILocation(line: 524, column: 48, scope: !430)
!460 = !DILocation(line: 532, column: 47, scope: !430)
!461 = !{i64 0, i64 8, !462, i64 8, i64 8, !463, i64 16, i64 8, !463, i64 24, i64 8, !462, i64 32, i64 8, !462, i64 40, i64 8, !462, i64 48, i64 8, !462, i64 56, i64 8, !462}
!462 = !{!223, !223, i64 0}
!463 = !{!261, !261, i64 0}
!464 = !{i64 0, i64 8, !463, i64 8, i64 8, !463, i64 16, i64 8, !462, i64 24, i64 8, !462, i64 32, i64 8, !462, i64 40, i64 8, !462, i64 48, i64 8, !462}
!465 = !DILocation(line: 537, column: 2, scope: !420)
!466 = !DILocation(line: 533, column: 2, scope: !430)
!467 = !DILocation(line: 536, column: 2, scope: !390)
!468 = !DILocation(line: 536, column: 18, scope: !390)
