; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/lzma/lzma_encoder_optimum_normal.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lzma/lzma_encoder_optimum_normal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_coder_s = type { %struct.lzma_range_encoder, i32, [4 x i32], [274 x %struct.lzma_match], i32, i32, i8, i8, i8, i32, i32, i32, [16 x [768 x i16]], [12 x [16 x i16]], [12 x i16], [12 x i16], [12 x i16], [12 x i16], [12 x [16 x i16]], [4 x [64 x i16]], [114 x i16], [16 x i16], %struct.lzma_length_encoder, %struct.lzma_length_encoder, [4 x [64 x i32]], [4 x [128 x i32]], i32, i32, [16 x i32], i32, i32, i32, [4096 x %struct.lzma_optimal] }
%struct.lzma_range_encoder = type { i64, i64, i32, i8, i64, i64, [58 x i32], [58 x ptr] }
%struct.lzma_match = type { i32, i32 }
%struct.lzma_length_encoder = type { i16, i16, [16 x [8 x i16]], [16 x [8 x i16]], [256 x i16], [16 x [272 x i32]], i32, [16 x i32] }
%struct.lzma_optimal = type { i32, i8, i8, i32, i32, i32, i32, i32, [4 x i32] }
%struct.lzma_mf_s = type { ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@lzma_rc_prices = external local_unnamed_addr constant [128 x i8], align 16
@lzma_fastpos = external local_unnamed_addr constant [8192 x i8], align 16


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lzma/lzma_encoder_optimum_normal.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "028fd9e067aa234247a048911b07b4da")
!2 = !{!3, !11, !51}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!8 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!9 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!10 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !13, file: !12, line: 40, baseType: !5, size: 32, elements: !45)
!12 = !DIFile(filename: "apps/557.xz_r/src/liblzma/rangecoder/range_encoder.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e02ad9079871d268a82b8ebf2e7d385d")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 27, size: 5888, elements: !14)
!14 = !{!15, !21, !22, !25, !29, !32, !33, !37}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !13, file: !12, line: 28, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 27, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !19, line: 45, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!20 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !13, file: !12, line: 29, baseType: !16, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !12, line: 30, baseType: !23, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 26, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 42, baseType: !5)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !13, file: !12, line: 31, baseType: !26, size: 8, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 24, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !19, line: 38, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !13, file: !12, line: 34, baseType: !30, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 46, baseType: !20)
!31 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !13, file: !12, line: 37, baseType: !30, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !13, file: !12, line: 46, baseType: !34, size: 1856, offset: 320)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1856, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 58)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !13, file: !12, line: 49, baseType: !38, size: 3712, offset: 2176)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 3712, elements: !35)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "probability", file: !41, line: 71, baseType: !42)
!41 = !DIFile(filename: "apps/557.xz_r/src/liblzma/rangecoder/range_common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7d3e93a1bf35640522f499de026cfdad")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 25, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !19, line: 40, baseType: !44)
!44 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIEnumerator(name: "RC_BIT_0", value: 0)
!47 = !DIEnumerator(name: "RC_BIT_1", value: 1)
!48 = !DIEnumerator(name: "RC_DIRECT_0", value: 2)
!49 = !DIEnumerator(name: "RC_DIRECT_1", value: 3)
!50 = !DIEnumerator(name: "RC_FLUSH", value: 4)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 56, baseType: !5, size: 32, elements: !53)
!52 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lzma/lzma_common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ce364754aa91e57f603599f25328df33")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!54 = !DIEnumerator(name: "STATE_LIT_LIT", value: 0)
!55 = !DIEnumerator(name: "STATE_MATCH_LIT_LIT", value: 1)
!56 = !DIEnumerator(name: "STATE_REP_LIT_LIT", value: 2)
!57 = !DIEnumerator(name: "STATE_SHORTREP_LIT_LIT", value: 3)
!58 = !DIEnumerator(name: "STATE_MATCH_LIT", value: 4)
!59 = !DIEnumerator(name: "STATE_REP_LIT", value: 5)
!60 = !DIEnumerator(name: "STATE_SHORTREP_LIT", value: 6)
!61 = !DIEnumerator(name: "STATE_LIT_MATCH", value: 7)
!62 = !DIEnumerator(name: "STATE_LIT_LONGREP", value: 8)
!63 = !DIEnumerator(name: "STATE_LIT_SHORTREP", value: 9)
!64 = !DIEnumerator(name: "STATE_NONLIT_MATCH", value: 10)
!65 = !DIEnumerator(name: "STATE_NONLIT_REP", value: 11)
!66 = !{i32 7, !"Dwarf Version", i32 5}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{i32 7, !"PIC Level", i32 2}
!70 = !{i32 7, !"PIE Level", i32 2}
!71 = !{i32 7, !"uwtable", i32 2}
!72 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!73 = distinct !DISubprogram(name: "lzma_lzma_optimum_normal", scope: !74, file: !74, line: 824, type: !75, scopeLine: 827, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !125)
!74 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lzma/lzma_encoder_optimum_normal.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "028fd9e067aa234247a048911b07b4da")
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !80, !124, !124, !23}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !79, line: 78, baseType: null)
!79 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !83, line: 28, baseType: !84)
!83 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lz/lz_encoder.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "780f78e6e21a3ca52f57df68bfdc6f53")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !83, line: 29, size: 960, elements: !85)
!85 = !{!86, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !107, !111, !113, !114, !115, !116, !117, !118, !119, !120, !122, !123}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !84, file: !83, line: 35, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !83, line: 39, baseType: !23, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !84, file: !83, line: 45, baseType: !23, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !84, file: !83, line: 51, baseType: !23, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !84, file: !83, line: 58, baseType: !23, size: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !84, file: !83, line: 63, baseType: !23, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !84, file: !83, line: 67, baseType: !23, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !84, file: !83, line: 75, baseType: !23, size: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !84, file: !83, line: 80, baseType: !23, size: 32, offset: 288)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !84, file: !83, line: 84, baseType: !23, size: 32, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !84, file: !83, line: 92, baseType: !98, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!23, !81, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !83, line: 25, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 22, size: 64, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !103, file: !83, line: 23, baseType: !23, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !103, file: !83, line: 24, baseType: !23, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !84, file: !83, line: 97, baseType: !108, size: 64, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !81, !23}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !84, file: !83, line: 99, baseType: !112, size: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !84, file: !83, line: 100, baseType: !112, size: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !84, file: !83, line: 101, baseType: !23, size: 32, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !84, file: !83, line: 102, baseType: !23, size: 32, offset: 672)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !84, file: !83, line: 103, baseType: !23, size: 32, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !84, file: !83, line: 106, baseType: !23, size: 32, offset: 736)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !84, file: !83, line: 109, baseType: !23, size: 32, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !84, file: !83, line: 114, baseType: !23, size: 32, offset: 800)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !84, file: !83, line: 119, baseType: !121, size: 32, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !84, file: !83, line: 122, baseType: !23, size: 32, offset: 864)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !84, file: !83, line: 125, baseType: !23, size: 32, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !112)
!125 = !{!126, !127, !128, !129, !130, !131, !236, !237, !238}
!126 = !DILocalVariable(name: "pcoder", arg: 1, scope: !73, file: !74, line: 824, type: !77)
!127 = !DILocalVariable(name: "mf", arg: 2, scope: !73, file: !74, line: 824, type: !80)
!128 = !DILocalVariable(name: "back_res", arg: 3, scope: !73, file: !74, line: 825, type: !124)
!129 = !DILocalVariable(name: "len_res", arg: 4, scope: !73, file: !74, line: 825, type: !124)
!130 = !DILocalVariable(name: "position", arg: 5, scope: !73, file: !74, line: 826, type: !23)
!131 = !DILocalVariable(name: "coder", scope: !73, file: !74, line: 828, type: !132)
!132 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !135, line: 72, size: 1996608, elements: !136)
!135 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lzma/lzma_encoder_private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0c1b7b41ddfbed104b8c32f19cfcc2b2")
!136 = !{!137, !139, !141, !145, !149, !150, !151, !153, !154, !155, !156, !157, !158, !163, !167, !170, !171, !172, !173, !174, !178, !182, !185, !207, !208, !210, !214, !215, !216, !217, !218, !219, !220}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !134, file: !135, line: 74, baseType: !138, size: 5888)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_range_encoder", file: !12, line: 51, baseType: !13)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !134, file: !135, line: 77, baseType: !140, size: 32, offset: 5888)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lzma_state", file: !52, line: 69, baseType: !51)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reps", scope: !134, file: !135, line: 80, baseType: !142, size: 128, offset: 5920)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 4)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !134, file: !135, line: 83, baseType: !146, size: 17536, offset: 6048)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 17536, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 274)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "matches_count", scope: !134, file: !135, line: 86, baseType: !23, size: 32, offset: 23584)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "longest_match_length", scope: !134, file: !135, line: 90, baseType: !23, size: 32, offset: 23616)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fast_mode", scope: !134, file: !135, line: 93, baseType: !152, size: 8, offset: 23648)
!152 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !134, file: !135, line: 97, baseType: !152, size: 8, offset: 23656)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "is_flushed", scope: !134, file: !135, line: 101, baseType: !152, size: 8, offset: 23664)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pos_mask", scope: !134, file: !135, line: 103, baseType: !23, size: 32, offset: 23680)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "literal_context_bits", scope: !134, file: !135, line: 104, baseType: !23, size: 32, offset: 23712)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "literal_pos_mask", scope: !134, file: !135, line: 105, baseType: !23, size: 32, offset: 23744)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "literal", scope: !134, file: !135, line: 108, baseType: !159, size: 196608, offset: 23776)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 196608, elements: !160)
!160 = !{!161, !162}
!161 = !DISubrange(count: 16)
!162 = !DISubrange(count: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "is_match", scope: !134, file: !135, line: 109, baseType: !164, size: 3072, offset: 220384)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 3072, elements: !165)
!165 = !{!166, !161}
!166 = !DISubrange(count: 12)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep", scope: !134, file: !135, line: 110, baseType: !168, size: 192, offset: 223456)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !169)
!169 = !{!166}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0", scope: !134, file: !135, line: 111, baseType: !168, size: 192, offset: 223648)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep1", scope: !134, file: !135, line: 112, baseType: !168, size: 192, offset: 223840)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep2", scope: !134, file: !135, line: 113, baseType: !168, size: 192, offset: 224032)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0_long", scope: !134, file: !135, line: 114, baseType: !164, size: 3072, offset: 224224)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot", scope: !134, file: !135, line: 115, baseType: !175, size: 4096, offset: 227296)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !176)
!176 = !{!144, !177}
!177 = !DISubrange(count: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pos_special", scope: !134, file: !135, line: 116, baseType: !179, size: 1824, offset: 231392)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1824, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 114)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pos_align", scope: !134, file: !135, line: 117, baseType: !183, size: 256, offset: 233216)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !184)
!184 = !{!161}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_encoder", scope: !134, file: !135, line: 121, baseType: !186, size: 148032, offset: 233472)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_length_encoder", file: !135, line: 51, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 40, size: 148032, elements: !188)
!188 = !{!189, !190, !191, !195, !196, !200, !204, !205}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "choice", scope: !187, file: !135, line: 41, baseType: !40, size: 16)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !187, file: !135, line: 42, baseType: !40, size: 16, offset: 16)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !187, file: !135, line: 43, baseType: !192, size: 2048, offset: 32)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !193)
!193 = !{!161, !194}
!194 = !DISubrange(count: 8)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !187, file: !135, line: 44, baseType: !192, size: 2048, offset: 2080)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !187, file: !135, line: 45, baseType: !197, size: 4096, offset: 4128)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prices", scope: !187, file: !135, line: 47, baseType: !201, size: 139264, offset: 8224)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 139264, elements: !202)
!202 = !{!161, !203}
!203 = !DISubrange(count: 272)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !187, file: !135, line: 48, baseType: !23, size: 32, offset: 147488)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !187, file: !135, line: 49, baseType: !206, size: 512, offset: 147520)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !184)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rep_len_encoder", scope: !134, file: !135, line: 122, baseType: !186, size: 148032, offset: 381504)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot_prices", scope: !134, file: !135, line: 125, baseType: !209, size: 8192, offset: 529536)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !176)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "distances_prices", scope: !134, file: !135, line: 126, baseType: !211, size: 16384, offset: 537728)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, elements: !212)
!212 = !{!144, !213}
!213 = !DISubrange(count: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dist_table_size", scope: !134, file: !135, line: 127, baseType: !23, size: 32, offset: 554112)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "match_price_count", scope: !134, file: !135, line: 128, baseType: !23, size: 32, offset: 554144)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "align_prices", scope: !134, file: !135, line: 130, baseType: !206, size: 512, offset: 554176)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "align_price_count", scope: !134, file: !135, line: 131, baseType: !23, size: 32, offset: 554688)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "opts_end_index", scope: !134, file: !135, line: 134, baseType: !23, size: 32, offset: 554720)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "opts_current_index", scope: !134, file: !135, line: 135, baseType: !23, size: 32, offset: 554752)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !134, file: !135, line: 136, baseType: !221, size: 1441792, offset: 554784)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 1441792, elements: !234)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_optimal", file: !135, line: 69, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 54, size: 352, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !223, file: !135, line: 55, baseType: !140, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prev_1_is_literal", scope: !223, file: !135, line: 57, baseType: !152, size: 8, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prev_2", scope: !223, file: !135, line: 58, baseType: !152, size: 8, offset: 40)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev_2", scope: !223, file: !135, line: 60, baseType: !23, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev_2", scope: !223, file: !135, line: 61, baseType: !23, size: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !223, file: !135, line: 63, baseType: !23, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev", scope: !223, file: !135, line: 64, baseType: !23, size: 32, offset: 160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev", scope: !223, file: !135, line: 65, baseType: !23, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "backs", scope: !223, file: !135, line: 67, baseType: !142, size: 128, offset: 224)
!234 = !{!235}
!235 = !DISubrange(count: 4096)
!236 = !DILocalVariable(name: "len_end", scope: !73, file: !74, line: 855, type: !23)
!237 = !DILocalVariable(name: "reps", scope: !73, file: !74, line: 859, type: !142)
!238 = !DILocalVariable(name: "cur", scope: !73, file: !74, line: 862, type: !23)
!239 = !DILocation(line: 0, scope: !73)
!240 = !DILocation(line: 830, column: 13, scope: !241)
!241 = distinct !DILexicalBlock(scope: !73, file: !74, line: 830, column: 6)
!242 = !{!243, !248, i64 69340}
!243 = !{!"lzma_coder_s", !244, i64 0, !246, i64 736, !246, i64 740, !246, i64 756, !248, i64 2948, !248, i64 2952, !249, i64 2956, !249, i64 2957, !249, i64 2958, !248, i64 2960, !248, i64 2964, !248, i64 2968, !246, i64 2972, !246, i64 27548, !246, i64 27932, !246, i64 27956, !246, i64 27980, !246, i64 28004, !246, i64 28028, !246, i64 28412, !246, i64 28924, !246, i64 29152, !250, i64 29184, !250, i64 47688, !246, i64 66192, !246, i64 67216, !248, i64 69264, !248, i64 69268, !246, i64 69272, !248, i64 69336, !248, i64 69340, !248, i64 69344, !246, i64 69348}
!244 = !{!"", !245, i64 0, !245, i64 8, !248, i64 16, !246, i64 20, !245, i64 24, !245, i64 32, !246, i64 40, !246, i64 272}
!245 = !{!"long", !246, i64 0}
!246 = !{!"omnipotent char", !247, i64 0}
!247 = !{!"Simple C/C++ TBAA"}
!248 = !{!"int", !246, i64 0}
!249 = !{!"_Bool", !246, i64 0}
!250 = !{!"", !251, i64 0, !251, i64 2, !246, i64 4, !246, i64 260, !246, i64 516, !246, i64 1028, !248, i64 18436, !246, i64 18440}
!251 = !{!"short", !246, i64 0}
!252 = !DILocation(line: 830, column: 38, scope: !241)
!253 = !{!243, !248, i64 69344}
!254 = !DILocation(line: 830, column: 28, scope: !241)
!255 = !DILocation(line: 830, column: 6, scope: !73)
!256 = !DILocation(line: 832, column: 14, scope: !257)
!257 = distinct !DILexicalBlock(scope: !241, file: !74, line: 830, column: 58)
!258 = !DILocation(line: 832, column: 53, scope: !257)
!259 = !{!260, !248, i64 20}
!260 = !{!"", !246, i64 0, !249, i64 4, !249, i64 5, !248, i64 8, !248, i64 12, !248, i64 16, !248, i64 20, !248, i64 24, !246, i64 28}
!261 = !DILocation(line: 833, column: 5, scope: !257)
!262 = !DILocation(line: 832, column: 12, scope: !257)
!263 = !{!248, !248, i64 0}
!264 = !DILocation(line: 834, column: 54, scope: !257)
!265 = !{!260, !248, i64 24}
!266 = !DILocation(line: 834, column: 13, scope: !257)
!267 = !DILocation(line: 835, column: 29, scope: !257)
!268 = !DILocation(line: 837, column: 3, scope: !257)
!269 = !DILocation(line: 843, column: 10, scope: !270)
!270 = distinct !DILexicalBlock(scope: !73, file: !74, line: 843, column: 6)
!271 = !{!272, !248, i64 28}
!272 = !{!"lzma_mf_s", !273, i64 0, !248, i64 8, !248, i64 12, !248, i64 16, !248, i64 20, !248, i64 24, !248, i64 28, !248, i64 32, !248, i64 36, !248, i64 40, !273, i64 48, !273, i64 56, !273, i64 64, !273, i64 72, !248, i64 80, !248, i64 84, !248, i64 88, !248, i64 92, !248, i64 96, !248, i64 100, !246, i64 104, !248, i64 108, !248, i64 112}
!273 = !{!"any pointer", !246, i64 0}
!274 = !DILocation(line: 843, column: 21, scope: !270)
!275 = !DILocation(line: 843, column: 6, scope: !73)
!276 = !DILocation(line: 844, column: 14, scope: !277)
!277 = distinct !DILexicalBlock(scope: !278, file: !74, line: 844, column: 7)
!278 = distinct !DILexicalBlock(scope: !270, file: !74, line: 843, column: 27)
!279 = !{!243, !248, i64 69268}
!280 = !DILocation(line: 844, column: 32, scope: !277)
!281 = !DILocation(line: 844, column: 7, scope: !278)
!282 = !DILocalVariable(name: "pcoder", arg: 1, scope: !283, file: !74, line: 137, type: !77)
!283 = distinct !DISubprogram(name: "fill_distances_prices", scope: !74, file: !74, line: 137, type: !284, scopeLine: 138, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !286)
!284 = !DISubroutineType(types: !285)
