; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/lzma/lzma2_encoder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lzma/lzma2_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_lz_encoder = type { ptr, ptr, ptr, ptr }
%struct.lzma_coder_s = type { i32, ptr, %struct.lzma_options_lzma, i8, i8, i8, i64, i64, i64, [65542 x i8] }
%struct.lzma_options_lzma = type { i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.lzma_lz_options = type { i64, i64, i64, i64, i64, i32, i32, ptr, i32 }
%struct.lzma_mf_s = type { ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_filter = type { i64, ptr }

@lzma_fastpos = external local_unnamed_addr constant [8192 x i8], align 16

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_lzma2_encoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters) local_unnamed_addr #0 !dbg !128 {
entry:
  call void @llvm.dbg.value(metadata ptr %next, metadata !209, metadata !DIExpression()), !dbg !212
  call void @llvm.dbg.value(metadata ptr %allocator, metadata !210, metadata !DIExpression()), !dbg !212

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !117, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lzma/lzma2_encoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "24a99a9eab13c31bc3d49edc2de38059")
!2 = !{!3, !19, !25, !32, !40, !44, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 58, baseType: !5, size: 32, elements: !34)
!33 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/lzma.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c59c540efa0aff44f03d71331089fff8")
!34 = !{!35, !36, !37, !38, !39}
!35 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!36 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!37 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!38 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!39 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 138, baseType: !5, size: 32, elements: !41)
!41 = !{!42, !43}
!42 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!43 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !45)
!45 = !{!46}
!46 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !49, file: !48, line: 21, baseType: !5, size: 32, elements: !111)
!48 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lzma/lzma2_encoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "24a99a9eab13c31bc3d49edc2de38059")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !48, line: 20, size: 525632, elements: !50)
!50 = !{!51, !52, !56, !97, !99, !100, !101, !105, !106, !107}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !49, file: !48, line: 27, baseType: !47, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "lzma", scope: !49, file: !48, line: 30, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !55, line: 78, baseType: null)
!55 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "opt_cur", scope: !49, file: !48, line: 33, baseType: !57, size: 896, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !33, line: 399, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 185, size: 896, elements: !59)
!59 = !{!60, !65, !71, !72, !73, !74, !75, !77, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !91, !92, !93, !94, !96}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !58, file: !33, line: 217, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 26, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 42, baseType: !5)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !58, file: !33, line: 240, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 24, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !64, line: 38, baseType: !70)
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !58, file: !33, line: 254, baseType: !61, size: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !58, file: !33, line: 281, baseType: !61, size: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !58, file: !33, line: 293, baseType: !61, size: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !58, file: !33, line: 316, baseType: !61, size: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !58, file: !33, line: 322, baseType: !76, size: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !33, line: 155, baseType: !40)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !58, file: !33, line: 342, baseType: !61, size: 32, offset: 288)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !58, file: !33, line: 345, baseType: !79, size: 32, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !33, line: 111, baseType: !32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !58, file: !33, line: 375, baseType: !61, size: 32, offset: 352)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !58, file: !33, line: 384, baseType: !61, size: 32, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !58, file: !33, line: 385, baseType: !61, size: 32, offset: 416)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !58, file: !33, line: 386, baseType: !61, size: 32, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !58, file: !33, line: 387, baseType: !61, size: 32, offset: 480)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !58, file: !33, line: 388, baseType: !61, size: 32, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !58, file: !33, line: 389, baseType: !61, size: 32, offset: 544)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !58, file: !33, line: 390, baseType: !61, size: 32, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !58, file: !33, line: 391, baseType: !61, size: 32, offset: 608)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !58, file: !33, line: 392, baseType: !90, size: 32, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !44)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !58, file: !33, line: 393, baseType: !90, size: 32, offset: 672)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !58, file: !33, line: 394, baseType: !90, size: 32, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !58, file: !33, line: 395, baseType: !90, size: 32, offset: 736)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !58, file: !33, line: 396, baseType: !95, size: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !58, file: !33, line: 397, baseType: !95, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "need_properties", scope: !49, file: !48, line: 35, baseType: !98, size: 8, offset: 1024)
!98 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "need_state_reset", scope: !49, file: !48, line: 36, baseType: !98, size: 8, offset: 1032)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "need_dictionary_reset", scope: !49, file: !48, line: 37, baseType: !98, size: 8, offset: 1040)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !49, file: !48, line: 40, baseType: !102, size: 64, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!104 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !49, file: !48, line: 44, baseType: !102, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "buf_pos", scope: !49, file: !48, line: 47, baseType: !102, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !49, file: !48, line: 50, baseType: !108, size: 524336, offset: 1280)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 524336, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 65542)
!111 = !{!112, !113, !114, !115, !116}
!112 = !DIEnumerator(name: "SEQ_INIT", value: 0)
!113 = !DIEnumerator(name: "SEQ_LZMA_ENCODE", value: 1)
!114 = !DIEnumerator(name: "SEQ_LZMA_COPY", value: 2)
!115 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_HEADER", value: 3)
!116 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_COPY", value: 4)
!117 = !{!95, !118, !119}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!121 = !{i32 7, !"Dwarf Version", i32 5}
!122 = !{i32 2, !"Debug Info Version", i32 3}
!123 = !{i32 1, !"wchar_size", i32 4}
!124 = !{i32 7, !"PIC Level", i32 2}
!125 = !{i32 7, !"PIE Level", i32 2}
!126 = !{i32 7, !"uwtable", i32 2}
!127 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!128 = distinct !DISubprogram(name: "lzma_lzma2_encoder_init", scope: !48, file: !48, line: 357, type: !129, scopeLine: 359, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !208)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !132, !150, !198}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !55, line: 80, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !55, line: 124, size: 512, elements: !135)
!135 = !{!136, !137, !142, !145, !169, !174, !181, !186}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !134, file: !55, line: 126, baseType: !53, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !134, file: !55, line: 130, baseType: !138, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !139, line: 63, baseType: !140)
!139 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !62, line: 27, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !64, line: 45, baseType: !104)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !134, file: !55, line: 136, baseType: !143, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !144, line: 90, baseType: !104)
!144 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!145 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !134, file: !55, line: 139, baseType: !146, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !55, line: 94, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!131, !53, !150, !163, !164, !102, !166, !164, !102, !168}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !153)
!153 = !{!154, !158, !162}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !152, file: !4, line: 376, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!95, !95, !102, !102}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !152, file: !4, line: 390, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !95, !95}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !152, file: !4, line: 401, baseType: !95, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!164 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !134, file: !55, line: 144, baseType: !170, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !55, line: 102, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !53, !150}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !134, file: !55, line: 148, baseType: !175, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !134, file: !55, line: 152, baseType: !182, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!131, !53, !185, !185, !140}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !134, file: !55, line: 157, baseType: !187, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!131, !53, !150, !190, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !193, line: 65, baseType: !194)
!193 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !193, line: 43, size: 128, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !194, file: !193, line: 54, baseType: !138, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !194, file: !193, line: 63, baseType: !95, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !55, line: 82, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !55, line: 109, size: 192, elements: !202)
!202 = !{!203, !204, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !55, line: 112, baseType: !138, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !201, file: !55, line: 116, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !55, line: 86, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !201, file: !55, line: 119, baseType: !95, size: 64, offset: 128)
!208 = !{!209, !210, !211}
!209 = !DILocalVariable(name: "next", arg: 1, scope: !128, file: !48, line: 357, type: !132)
!210 = !DILocalVariable(name: "allocator", arg: 2, scope: !128, file: !48, line: 357, type: !150)
!211 = !DILocalVariable(name: "filters", arg: 3, scope: !128, file: !48, line: 358, type: !198)
!212 = !DILocation(line: 0, scope: !128)
!213 = !DILocation(line: 360, column: 9, scope: !128)
!214 = !DILocation(line: 360, column: 2, scope: !128)
!215 = !DISubprogram(name: "lzma_lz_encoder_init", scope: !216, file: !216, line: 298, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !293)
!216 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lz/lz_encoder.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "780f78e6e21a3ca52f57df68bfdc6f53")
!217 = !DISubroutineType(types: !218)
!218 = !{!131, !132, !150, !198, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!131, !222, !150, !278, !280}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_encoder", file: !216, line: 208, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 192, size: 256, elements: !225)
!225 = !{!226, !227, !273, !274}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !224, file: !216, line: 194, baseType: !53, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !224, file: !216, line: 197, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!131, !231, !232, !166, !164, !102}
!231 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !53)
!232 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !216, line: 28, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !216, line: 29, size: 960, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !257, !261, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !235, file: !216, line: 35, baseType: !167, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !235, file: !216, line: 39, baseType: !61, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !235, file: !216, line: 45, baseType: !61, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !235, file: !216, line: 51, baseType: !61, size: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !235, file: !216, line: 58, baseType: !61, size: 32, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !235, file: !216, line: 63, baseType: !61, size: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !235, file: !216, line: 67, baseType: !61, size: 32, offset: 224)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !235, file: !216, line: 75, baseType: !61, size: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !235, file: !216, line: 80, baseType: !61, size: 32, offset: 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !235, file: !216, line: 84, baseType: !61, size: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !235, file: !216, line: 92, baseType: !248, size: 64, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!61, !233, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !216, line: 25, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 22, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !253, file: !216, line: 23, baseType: !61, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !253, file: !216, line: 24, baseType: !61, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !235, file: !216, line: 97, baseType: !258, size: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !233, !61}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !235, file: !216, line: 99, baseType: !262, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !235, file: !216, line: 100, baseType: !262, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !235, file: !216, line: 101, baseType: !61, size: 32, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !235, file: !216, line: 102, baseType: !61, size: 32, offset: 672)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !235, file: !216, line: 103, baseType: !61, size: 32, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !235, file: !216, line: 106, baseType: !61, size: 32, offset: 736)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !235, file: !216, line: 109, baseType: !61, size: 32, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !235, file: !216, line: 114, baseType: !61, size: 32, offset: 800)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !235, file: !216, line: 119, baseType: !168, size: 32, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !235, file: !216, line: 122, baseType: !61, size: 32, offset: 864)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !235, file: !216, line: 125, baseType: !61, size: 32, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !224, file: !216, line: 202, baseType: !171, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "options_update", scope: !224, file: !216, line: 205, baseType: !275, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!131, !53, !190}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !216, line: 161, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 129, size: 512, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !282, file: !216, line: 132, baseType: !102, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !282, file: !216, line: 135, baseType: !102, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !282, file: !216, line: 139, baseType: !102, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !282, file: !216, line: 144, baseType: !102, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !282, file: !216, line: 148, baseType: !102, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !282, file: !216, line: 151, baseType: !79, size: 32, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !282, file: !216, line: 154, baseType: !61, size: 32, offset: 352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !282, file: !216, line: 157, baseType: !66, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !282, file: !216, line: 159, baseType: !61, size: 32, offset: 448)
!293 = !{}
!294 = distinct !DISubprogram(name: "lzma2_encoder_init", scope: !48, file: !48, line: 312, type: !220, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !295)
!295 = !{!296, !297, !298, !299, !300}
!296 = !DILocalVariable(name: "lz", arg: 1, scope: !294, file: !48, line: 312, type: !222)
!297 = !DILocalVariable(name: "allocator", arg: 2, scope: !294, file: !48, line: 312, type: !150)
!298 = !DILocalVariable(name: "options", arg: 3, scope: !294, file: !48, line: 313, type: !278)
!299 = !DILocalVariable(name: "lz_options", arg: 4, scope: !294, file: !48, line: 313, type: !280)
!300 = !DILocalVariable(name: "ret_", scope: !301, file: !48, line: 340, type: !302)
!301 = distinct !DILexicalBlock(scope: !294, file: !48, line: 340, column: 2)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!303 = !DILocation(line: 0, scope: !294)
!304 = !DILocation(line: 315, column: 14, scope: !305)
!305 = distinct !DILexicalBlock(scope: !294, file: !48, line: 315, column: 6)
!306 = !DILocation(line: 315, column: 6, scope: !294)
!307 = !DILocation(line: 318, column: 10, scope: !308)
!308 = distinct !DILexicalBlock(scope: !294, file: !48, line: 318, column: 6)
!309 = !{!310, !311, i64 0}
!310 = !{!"", !311, i64 0, !311, i64 8, !311, i64 16, !311, i64 24}
!311 = !{!"any pointer", !312, i64 0}
!312 = !{!"omnipotent char", !313, i64 0}
!313 = !{!"Simple C/C++ TBAA"}
!314 = !DILocation(line: 318, column: 16, scope: !308)
!315 = !DILocation(line: 318, column: 6, scope: !294)
!316 = !DILocation(line: 319, column: 15, scope: !317)
!317 = distinct !DILexicalBlock(scope: !308, file: !48, line: 318, column: 25)
!318 = !DILocation(line: 319, column: 13, scope: !317)
!319 = !DILocation(line: 320, column: 17, scope: !320)
!320 = distinct !DILexicalBlock(scope: !317, file: !48, line: 320, column: 7)
!321 = !DILocation(line: 320, column: 7, scope: !317)
!322 = !DILocation(line: 323, column: 7, scope: !317)
!323 = !DILocation(line: 323, column: 12, scope: !317)
!324 = !{!310, !311, i64 8}
!325 = !DILocation(line: 324, column: 7, scope: !317)
!326 = !DILocation(line: 324, column: 11, scope: !317)
!327 = !{!310, !311, i64 16}
!328 = !DILocation(line: 325, column: 7, scope: !317)
!329 = !DILocation(line: 325, column: 22, scope: !317)
!330 = !{!310, !311, i64 24}
!331 = !DILocation(line: 327, column: 38, scope: !317)
!332 = !DILocation(line: 327, column: 43, scope: !317)
!333 = !{!334, !311, i64 8}
!334 = !{!"lzma_coder_s", !312, i64 0, !311, i64 8, !335, i64 16, !337, i64 128, !337, i64 129, !337, i64 130, !338, i64 136, !338, i64 144, !338, i64 152, !312, i64 160}
!335 = !{!"", !336, i64 0, !311, i64 8, !336, i64 16, !336, i64 20, !336, i64 24, !336, i64 28, !312, i64 32, !336, i64 36, !312, i64 40, !336, i64 44, !336, i64 48, !336, i64 52, !336, i64 56, !336, i64 60, !336, i64 64, !336, i64 68, !336, i64 72, !336, i64 76, !312, i64 80, !312, i64 84, !312, i64 88, !312, i64 92, !311, i64 96, !311, i64 104}
!336 = !{!"int", !312, i64 0}
!337 = !{!"_Bool", !312, i64 0}
!338 = !{!"long", !312, i64 0}
!339 = !DILocation(line: 328, column: 2, scope: !317)
!340 = !DILocation(line: 330, column: 29, scope: !294)
!341 = !DILocation(line: 330, column: 37, scope: !294)
!342 = !DILocation(line: 330, column: 47, scope: !294)
!343 = !{i64 0, i64 4, !344, i64 8, i64 8, !345, i64 16, i64 4, !344, i64 20, i64 4, !344, i64 24, i64 4, !344, i64 28, i64 4, !344, i64 32, i64 4, !346, i64 36, i64 4, !344, i64 40, i64 4, !346, i64 44, i64 4, !344, i64 48, i64 4, !344, i64 52, i64 4, !344, i64 56, i64 4, !344, i64 60, i64 4, !344, i64 64, i64 4, !344, i64 68, i64 4, !344, i64 72, i64 4, !344, i64 76, i64 4, !344, i64 80, i64 4, !346, i64 84, i64 4, !346, i64 88, i64 4, !346, i64 92, i64 4, !346, i64 96, i64 8, !345, i64 104, i64 8, !345}
