; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/lzma/lzma2_decoder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lzma/lzma2_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_lz_decoder = type { ptr, ptr, ptr, ptr, ptr }
%struct.lzma_coder_s = type { i32, i32, %struct.lzma_lz_decoder, i64, i64, i8, i8, %struct.lzma_options_lzma }
%struct.lzma_options_lzma = type { i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.lzma_dict = type { ptr, i64, i64, i64, i64, i8 }

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_lzma2_decoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters) local_unnamed_addr #0 !dbg !181 {
entry:
  call void @llvm.dbg.value(metadata ptr %next, metadata !237, metadata !DIExpression()), !dbg !240
  call void @llvm.dbg.value(metadata ptr %allocator, metadata !238, metadata !DIExpression()), !dbg !240
  call void @llvm.dbg.value(metadata ptr %filters, metadata !239, metadata !DIExpression()), !dbg !240
  %call = tail call i32 @lzma_lz_decoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters, ptr noundef nonnull @lzma2_decoder_init) #5, !dbg !241
  ret i32 %call, !dbg !242
}


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !58, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/lzma/lzma2_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "9cda6399cf9c2869972035c0d84226da")
!2 = !{!3, !19, !25, !32, !37, !44, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 138, baseType: !5, size: 32, elements: !34)
!33 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/lzma.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c59c540efa0aff44f03d71331089fff8")
!34 = !{!35, !36}
!35 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!36 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 58, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!40 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!41 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!42 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!43 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !45)
!45 = !{!46}
!46 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sequence", file: !48, line: 20, baseType: !5, size: 32, elements: !49)
!48 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lzma/lzma2_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9cda6399cf9c2869972035c0d84226da")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57}
!50 = !DIEnumerator(name: "SEQ_CONTROL", value: 0)
!51 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_1", value: 1)
!52 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_2", value: 2)
!53 = !DIEnumerator(name: "SEQ_COMPRESSED_0", value: 3)
!54 = !DIEnumerator(name: "SEQ_COMPRESSED_1", value: 4)
!55 = !DIEnumerator(name: "SEQ_PROPERTIES", value: 5)
!56 = !DIEnumerator(name: "SEQ_LZMA", value: 6)
!57 = !DIEnumerator(name: "SEQ_COPY", value: 7)
!58 = !{!59, !60, !146}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !48, line: 19, size: 1472, elements: !62)
!62 = !{!63, !64, !65, !137, !138, !139, !140, !141}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !61, file: !48, line: 29, baseType: !47, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next_sequence", scope: !61, file: !48, line: 32, baseType: !47, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "lzma", scope: !61, file: !48, line: 35, baseType: !66, size: 320, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_decoder", file: !67, line: 72, baseType: !68)
!67 = !DIFile(filename: "apps/557.xz_r/src/liblzma/lz/lz_decoder.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "27344aa2da5754ad4a118fbd9137003b")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 54, size: 320, elements: !69)
!69 = !{!70, !74, !106, !112, !120}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !68, file: !67, line: 56, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !73, line: 78, baseType: null)
!73 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !68, file: !67, line: 59, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !79, !80, !101, !104, !93}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!79 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !71)
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_dict", file: !67, line: 44, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 20, size: 384, elements: !84)
!84 = !{!85, !92, !96, !97, !98, !99}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !83, file: !67, line: 24, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !88, line: 24, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !90, line: 38, baseType: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!91 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !83, file: !67, line: 28, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!95 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !83, file: !67, line: 33, baseType: !93, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !83, file: !67, line: 36, baseType: !93, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !67, line: 39, baseType: !93, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "need_reset", scope: !83, file: !67, line: 42, baseType: !100, size: 8, offset: 320)
!100 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!101 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!104 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !68, file: !67, line: 63, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !71, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "set_uncompressed", scope: !68, file: !67, line: 66, baseType: !113, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !71, !116}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !117, line: 63, baseType: !118)
!117 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !88, line: 27, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !90, line: 45, baseType: !95)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !68, file: !67, line: 70, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !71, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !127)
!127 = !{!128, !132, !136}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !126, file: !4, line: 376, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!59, !59, !93, !93}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !126, file: !4, line: 390, baseType: !133, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !59, !59}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !126, file: !4, line: 401, baseType: !59, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !61, file: !48, line: 38, baseType: !93, size: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !61, file: !48, line: 42, baseType: !93, size: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "need_properties", scope: !61, file: !48, line: 46, baseType: !100, size: 8, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "need_dictionary_reset", scope: !61, file: !48, line: 50, baseType: !100, size: 8, offset: 520)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !61, file: !48, line: 52, baseType: !142, size: 896, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !33, line: 399, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 185, size: 896, elements: !144)
!144 = !{!145, !148, !149, !150, !151, !152, !153, !155, !156, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !169, !170, !171, !172, !173}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !143, file: !33, line: 217, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !88, line: 26, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !90, line: 42, baseType: !5)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !143, file: !33, line: 240, baseType: !102, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !143, file: !33, line: 254, baseType: !146, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !143, file: !33, line: 281, baseType: !146, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !143, file: !33, line: 293, baseType: !146, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !143, file: !33, line: 316, baseType: !146, size: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !143, file: !33, line: 322, baseType: !154, size: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !33, line: 155, baseType: !32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !143, file: !33, line: 342, baseType: !146, size: 32, offset: 288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !143, file: !33, line: 345, baseType: !157, size: 32, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !33, line: 111, baseType: !37)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !143, file: !33, line: 375, baseType: !146, size: 32, offset: 352)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !143, file: !33, line: 384, baseType: !146, size: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !143, file: !33, line: 385, baseType: !146, size: 32, offset: 416)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !143, file: !33, line: 386, baseType: !146, size: 32, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !143, file: !33, line: 387, baseType: !146, size: 32, offset: 480)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !143, file: !33, line: 388, baseType: !146, size: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !143, file: !33, line: 389, baseType: !146, size: 32, offset: 544)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !143, file: !33, line: 390, baseType: !146, size: 32, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !143, file: !33, line: 391, baseType: !146, size: 32, offset: 608)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !143, file: !33, line: 392, baseType: !168, size: 32, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !44)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !143, file: !33, line: 393, baseType: !168, size: 32, offset: 672)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !143, file: !33, line: 394, baseType: !168, size: 32, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !143, file: !33, line: 395, baseType: !168, size: 32, offset: 736)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !143, file: !33, line: 396, baseType: !59, size: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !143, file: !33, line: 397, baseType: !59, size: 64, offset: 832)
!174 = !{i32 7, !"Dwarf Version", i32 5}
!175 = !{i32 2, !"Debug Info Version", i32 3}
!176 = !{i32 1, !"wchar_size", i32 4}
!177 = !{i32 7, !"PIC Level", i32 2}
!178 = !{i32 7, !"PIE Level", i32 2}
!179 = !{i32 7, !"uwtable", i32 2}
!180 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!181 = distinct !DISubprogram(name: "lzma_lzma2_decoder_init", scope: !48, file: !48, line: 253, type: !182, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !236)
!182 = !DISubroutineType(types: !183)
!183 = !{!78, !184, !124, !226}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !73, line: 80, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !73, line: 124, size: 512, elements: !187)
!187 = !{!188, !189, !190, !193, !200, !202, !209, !214}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !186, file: !73, line: 126, baseType: !71, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !73, line: 130, baseType: !116, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !73, line: 136, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !192, line: 90, baseType: !95)
!192 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!193 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !186, file: !73, line: 139, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !73, line: 94, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!78, !71, !124, !101, !104, !93, !198, !104, !93, !199}
!198 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !86)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !186, file: !73, line: 144, baseType: !201, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !73, line: 102, baseType: !121)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !186, file: !73, line: 148, baseType: !203, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !186, file: !73, line: 152, baseType: !210, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!78, !71, !213, !213, !118}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !186, file: !73, line: 157, baseType: !215, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!78, !71, !124, !218, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !221, line: 65, baseType: !222)
!221 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 43, size: 128, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !222, file: !221, line: 54, baseType: !116, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !222, file: !221, line: 63, baseType: !59, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !73, line: 82, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !73, line: 109, size: 192, elements: !230)
!230 = !{!231, !232, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !229, file: !73, line: 112, baseType: !116, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !229, file: !73, line: 116, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !73, line: 86, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !229, file: !73, line: 119, baseType: !59, size: 64, offset: 128)
!236 = !{!237, !238, !239}
!237 = !DILocalVariable(name: "next", arg: 1, scope: !181, file: !48, line: 253, type: !184)
!238 = !DILocalVariable(name: "allocator", arg: 2, scope: !181, file: !48, line: 253, type: !124)
!239 = !DILocalVariable(name: "filters", arg: 3, scope: !181, file: !48, line: 254, type: !226)
!240 = !DILocation(line: 0, scope: !181)
!241 = !DILocation(line: 260, column: 9, scope: !181)
!242 = !DILocation(line: 260, column: 2, scope: !181)
!243 = !DISubprogram(name: "lzma_lz_decoder_init", scope: !67, file: !67, line: 85, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !257)
!244 = !DISubroutineType(types: !245)
!245 = !{!78, !184, !124, !226, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!78, !249, !124, !110, !250}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !67, line: 51, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 47, size: 192, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !252, file: !67, line: 48, baseType: !93, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !252, file: !67, line: 49, baseType: !102, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !252, file: !67, line: 50, baseType: !93, size: 64, offset: 128)
!257 = !{}
!258 = distinct !DISubprogram(name: "lzma2_decoder_init", scope: !48, file: !48, line: 226, type: !247, scopeLine: 228, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !259)
!259 = !{!260, !261, !262, !263, !264}
!260 = !DILocalVariable(name: "lz", arg: 1, scope: !258, file: !48, line: 226, type: !249)
!261 = !DILocalVariable(name: "allocator", arg: 2, scope: !258, file: !48, line: 226, type: !124)
!262 = !DILocalVariable(name: "opt", arg: 3, scope: !258, file: !48, line: 227, type: !110)
!263 = !DILocalVariable(name: "lz_options", arg: 4, scope: !258, file: !48, line: 227, type: !250)
!264 = !DILocalVariable(name: "options", scope: !258, file: !48, line: 240, type: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!267 = !DILocation(line: 0, scope: !258)
!268 = !DILocation(line: 229, column: 10, scope: !269)
!269 = distinct !DILexicalBlock(scope: !258, file: !48, line: 229, column: 6)
!270 = !{!271, !272, i64 0}
!271 = !{!"", !272, i64 0, !272, i64 8, !272, i64 16, !272, i64 24, !272, i64 32}
!272 = !{!"any pointer", !273, i64 0}
!273 = !{!"omnipotent char", !274, i64 0}
!274 = !{!"Simple C/C++ TBAA"}
!275 = !DILocation(line: 229, column: 16, scope: !269)
!276 = !DILocation(line: 229, column: 6, scope: !258)
!277 = !DILocation(line: 230, column: 15, scope: !278)
!278 = distinct !DILexicalBlock(scope: !269, file: !48, line: 229, column: 25)
!279 = !DILocation(line: 230, column: 13, scope: !278)
!280 = !DILocation(line: 231, column: 17, scope: !281)
!281 = distinct !DILexicalBlock(scope: !278, file: !48, line: 231, column: 7)
!282 = !DILocation(line: 231, column: 7, scope: !278)
!283 = !DILocation(line: 234, column: 7, scope: !278)
!284 = !DILocation(line: 234, column: 12, scope: !278)
!285 = !{!271, !272, i64 8}
!286 = !DILocation(line: 235, column: 7, scope: !278)
!287 = !DILocation(line: 235, column: 11, scope: !278)
!288 = !{!271, !272, i64 32}
!289 = !DILocation(line: 237, column: 38, scope: !278)
!290 = !DILocation(line: 237, column: 45, scope: !278)
!291 = !DILocation(line: 242, column: 29, scope: !258)
!292 = !DILocation(line: 238, column: 2, scope: !278)
!293 = !DILocation(line: 242, column: 46, scope: !258)
!294 = !{!295, !273, i64 0}
!295 = !{!"lzma_coder_s", !273, i64 0, !273, i64 4, !271, i64 8, !296, i64 48, !296, i64 56, !297, i64 64, !297, i64 65, !298, i64 72}
!296 = !{!"long", !273, i64 0}
!297 = !{!"_Bool", !273, i64 0}
!298 = !{!"", !299, i64 0, !272, i64 8, !299, i64 16, !299, i64 20, !299, i64 24, !299, i64 28, !273, i64 32, !299, i64 36, !273, i64 40, !299, i64 44, !299, i64 48, !299, i64 52, !299, i64 56, !299, i64 60, !299, i64 64, !299, i64 68, !299, i64 72, !299, i64 76, !273, i64 80, !273, i64 84, !273, i64 88, !273, i64 92, !272, i64 96, !272, i64 104}
!299 = !{!"int", !273, i64 0}
!300 = !DILocation(line: 243, column: 37, scope: !258)
!301 = !DILocation(line: 243, column: 53, scope: !258)
!302 = !{!295, !297, i64 64}
!303 = !DILocation(line: 244, column: 70, scope: !258)
!304 = !{!298, !272, i64 8}
!305 = !DILocation(line: 244, column: 82, scope: !258)
!306 = !DILocation(line: 245, column: 4, scope: !258)
!307 = !DILocation(line: 245, column: 16, scope: !258)
!308 = !{!298, !299, i64 16}
!309 = !DILocation(line: 245, column: 33, scope: !258)
!310 = !DILocation(line: 244, column: 37, scope: !258)
!311 = !DILocation(line: 244, column: 59, scope: !258)
!312 = !{!295, !297, i64 65}
!313 = !DILocation(line: 247, column: 70, scope: !258)
!314 = !DILocation(line: 247, column: 9, scope: !258)
!315 = !DILocation(line: 249, column: 1, scope: !258)
