; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/common/macroblock.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/macroblock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, ptr, [8 x i8] }
%struct.x264_t = type { %struct.x264_param_t, [129 x ptr], i32, i32, i32, i32, i32, %struct.anon.2, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [92 x ptr], [92 x [4 x ptr]], ptr, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, ptr, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], ptr, [2 x [3 x ptr]], [2 x ptr], [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], ptr, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, ptr, [8 x i8] }

!145 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !135, file: !6, line: 92, baseType: !142, size: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !135, file: !6, line: 92, baseType: !148, size: 128)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, elements: !124)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !135, file: !6, line: 92, baseType: !150, size: 128)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !135, file: !6, line: 92, baseType: !154, size: 128)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 16)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !6, line: 90, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !6, line: 90, size: 64, elements: !160)
!160 = !{!161, !162, !164, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !159, file: !6, line: 90, baseType: !143, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !159, file: !6, line: 90, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !117)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !159, file: !6, line: 90, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, elements: !124)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !159, file: !6, line: 90, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !151)
!168 = !{!0, !169, !175, !180}
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "x264_size2pixel", scope: !2, file: !90, line: 55, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 200, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!173 = !{!174, !174}
!174 = !DISubrange(count: 5)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "x264_mb_type_fix", scope: !2, file: !15, line: 92, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 152, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 19)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "x264_mb_pred_mode8x8c_fix", scope: !2, file: !66, line: 42, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 56, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 7)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 864, elements: !188)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!188 = !{!189}
!189 = !DISubrange(count: 27)
!190 = !{i32 7, !"Dwarf Version", i32 5}
!191 = !{i32 2, !"Debug Info Version", i32 3}
!192 = !{i32 1, !"wchar_size", i32 4}
!193 = !{i32 7, !"PIC Level", i32 2}
!194 = !{i32 7, !"PIE Level", i32 2}
!195 = !{i32 7, !"uwtable", i32 2}
!196 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!197 = distinct !DISubprogram(name: "x264_mb_mc_8x8", scope: !198, file: !198, line: 125, type: !199, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1482)
!198 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/macroblock.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b3bd83ad3c1537e307ae76d0bffb91a")
!199 = !DISubroutineType(types: !200)
!200 = !{null, !201, !187}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !203, line: 46, baseType: !204)
!203 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !6, line: 381, size: 266752, elements: !205)
!205 = !{!206, !372, !376, !377, !378, !379, !380, !381, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !517, !519, !546, !548, !549, !550, !554, !558, !559, !560, !564, !568, !569, !570, !575, !578, !579, !656, !673, !834, !835, !836, !837, !839, !840, !841, !842, !843, !844, !845, !860, !1052, !1056, !1116, !1119, !1121, !1122, !1123, !1126, !1131, !1137, !1138, !1146, !1148, !1153, !1228, !1314, !1358, !1380, !1429, !1458}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !204, file: !6, line: 384, baseType: !207, size: 5632)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !203, line: 376, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !203, line: 176, size: 5632, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !253, !254, !255, !256, !257, !261, !262, !277, !278, !279, !280, !281, !310, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !208, file: !203, line: 179, baseType: !7, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !208, file: !203, line: 180, baseType: !187, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !208, file: !203, line: 181, baseType: !187, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !208, file: !203, line: 182, baseType: !187, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !208, file: !203, line: 183, baseType: !187, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !208, file: !203, line: 186, baseType: !187, size: 32, offset: 160)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !208, file: !203, line: 187, baseType: !187, size: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !208, file: !203, line: 188, baseType: !187, size: 32, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !208, file: !203, line: 189, baseType: !187, size: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !208, file: !203, line: 190, baseType: !187, size: 32, offset: 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !208, file: !203, line: 198, baseType: !187, size: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !208, file: !203, line: 215, baseType: !222, size: 288, offset: 352)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 200, size: 288, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !222, file: !203, line: 203, baseType: !187, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !222, file: !203, line: 204, baseType: !187, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !222, file: !203, line: 206, baseType: !187, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !222, file: !203, line: 209, baseType: !187, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !222, file: !203, line: 210, baseType: !187, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !222, file: !203, line: 211, baseType: !187, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !222, file: !203, line: 212, baseType: !187, size: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !222, file: !203, line: 213, baseType: !187, size: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !222, file: !203, line: 214, baseType: !187, size: 32, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !208, file: !203, line: 218, baseType: !187, size: 32, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !208, file: !203, line: 219, baseType: !187, size: 32, offset: 672)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !208, file: !203, line: 220, baseType: !187, size: 32, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !208, file: !203, line: 221, baseType: !187, size: 32, offset: 736)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !208, file: !203, line: 222, baseType: !187, size: 32, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !208, file: !203, line: 224, baseType: !187, size: 32, offset: 800)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !208, file: !203, line: 225, baseType: !187, size: 32, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !208, file: !203, line: 226, baseType: !187, size: 32, offset: 864)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !208, file: !203, line: 227, baseType: !187, size: 32, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !208, file: !203, line: 229, baseType: !187, size: 32, offset: 928)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !208, file: !203, line: 230, baseType: !187, size: 32, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !208, file: !203, line: 231, baseType: !187, size: 32, offset: 992)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !208, file: !203, line: 233, baseType: !187, size: 32, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !208, file: !203, line: 234, baseType: !187, size: 32, offset: 1056)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !208, file: !203, line: 236, baseType: !187, size: 32, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !208, file: !203, line: 237, baseType: !187, size: 32, offset: 1120)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !208, file: !203, line: 239, baseType: !187, size: 32, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !208, file: !203, line: 240, baseType: !251, size: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !208, file: !203, line: 241, baseType: !154, size: 128, offset: 1280)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !208, file: !203, line: 242, baseType: !154, size: 128, offset: 1408)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !208, file: !203, line: 243, baseType: !154, size: 128, offset: 1536)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !208, file: !203, line: 244, baseType: !154, size: 128, offset: 1664)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !208, file: !203, line: 245, baseType: !258, size: 512, offset: 1792)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 512, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !208, file: !203, line: 246, baseType: !258, size: 512, offset: 2304)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !208, file: !203, line: 249, baseType: !263, size: 64, offset: 2816)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !266, !187, !267, !269}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !271)
!271 = !{!272, !274, !275, !276}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !270, file: !273, baseType: !7, size: 32)
!273 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/macroblock.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !270, file: !273, baseType: !7, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !270, file: !273, baseType: !266, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !270, file: !273, baseType: !266, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !208, file: !203, line: 250, baseType: !266, size: 64, offset: 2880)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !208, file: !203, line: 251, baseType: !187, size: 32, offset: 2944)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !208, file: !203, line: 252, baseType: !187, size: 32, offset: 2976)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !208, file: !203, line: 253, baseType: !251, size: 64, offset: 3008)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !208, file: !203, line: 287, baseType: !282, size: 800, offset: 3072)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 256, size: 800, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !304, !305, !306, !308, !309}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !282, file: !203, line: 258, baseType: !7, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !282, file: !203, line: 259, baseType: !7, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !282, file: !203, line: 261, baseType: !187, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !282, file: !203, line: 262, baseType: !187, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !282, file: !203, line: 263, baseType: !187, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !282, file: !203, line: 264, baseType: !187, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !282, file: !203, line: 265, baseType: !187, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !282, file: !203, line: 267, baseType: !187, size: 32, offset: 224)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !282, file: !203, line: 268, baseType: !187, size: 32, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !282, file: !203, line: 269, baseType: !187, size: 32, offset: 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !282, file: !203, line: 270, baseType: !187, size: 32, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !282, file: !203, line: 271, baseType: !187, size: 32, offset: 352)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !282, file: !203, line: 272, baseType: !187, size: 32, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !282, file: !203, line: 273, baseType: !187, size: 32, offset: 416)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !282, file: !203, line: 274, baseType: !187, size: 32, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !282, file: !203, line: 275, baseType: !187, size: 32, offset: 480)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !282, file: !203, line: 276, baseType: !187, size: 32, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !282, file: !203, line: 277, baseType: !187, size: 32, offset: 544)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !282, file: !203, line: 278, baseType: !303, size: 32, offset: 576)
!303 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !282, file: !203, line: 279, baseType: !303, size: 32, offset: 608)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !282, file: !203, line: 280, baseType: !187, size: 32, offset: 640)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !282, file: !203, line: 283, baseType: !307, size: 64, offset: 672)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 64, elements: !117)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !282, file: !203, line: 285, baseType: !187, size: 32, offset: 736)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !282, file: !203, line: 286, baseType: !187, size: 32, offset: 768)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !208, file: !203, line: 327, baseType: !311, size: 1152, offset: 3904)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 290, size: 1152, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !350, !351}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !311, file: !203, line: 292, baseType: !187, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !311, file: !203, line: 294, baseType: !187, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !311, file: !203, line: 295, baseType: !187, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !311, file: !203, line: 296, baseType: !187, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !311, file: !203, line: 297, baseType: !187, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !311, file: !203, line: 299, baseType: !187, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !311, file: !203, line: 300, baseType: !303, size: 32, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !311, file: !203, line: 301, baseType: !303, size: 32, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !311, file: !203, line: 302, baseType: !303, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !311, file: !203, line: 303, baseType: !187, size: 32, offset: 288)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !311, file: !203, line: 304, baseType: !187, size: 32, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !311, file: !203, line: 305, baseType: !303, size: 32, offset: 352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !311, file: !203, line: 306, baseType: !303, size: 32, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !311, file: !203, line: 307, baseType: !303, size: 32, offset: 416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !311, file: !203, line: 309, baseType: !187, size: 32, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !311, file: !203, line: 310, baseType: !303, size: 32, offset: 480)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !311, file: !203, line: 311, baseType: !187, size: 32, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !311, file: !203, line: 312, baseType: !187, size: 32, offset: 544)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !311, file: !203, line: 315, baseType: !187, size: 32, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !311, file: !203, line: 316, baseType: !251, size: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !311, file: !203, line: 317, baseType: !187, size: 32, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !311, file: !203, line: 318, baseType: !251, size: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !311, file: !203, line: 321, baseType: !303, size: 32, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !311, file: !203, line: 322, baseType: !303, size: 32, offset: 864)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !311, file: !203, line: 323, baseType: !303, size: 32, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !311, file: !203, line: 324, baseType: !339, size: 64, offset: 960)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !203, line: 174, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 167, size: 256, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !341, file: !203, line: 169, baseType: !187, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !341, file: !203, line: 169, baseType: !187, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !341, file: !203, line: 170, baseType: !187, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !341, file: !203, line: 171, baseType: !187, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !341, file: !203, line: 172, baseType: !303, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !341, file: !203, line: 173, baseType: !349, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !311, file: !203, line: 325, baseType: !187, size: 32, offset: 1024)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !311, file: !203, line: 326, baseType: !251, size: 64, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !208, file: !203, line: 330, baseType: !187, size: 32, offset: 5056)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !208, file: !203, line: 331, baseType: !187, size: 32, offset: 5088)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !208, file: !203, line: 332, baseType: !187, size: 32, offset: 5120)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !208, file: !203, line: 334, baseType: !187, size: 32, offset: 5152)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !208, file: !203, line: 335, baseType: !187, size: 32, offset: 5184)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !208, file: !203, line: 336, baseType: !108, size: 32, offset: 5216)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !208, file: !203, line: 337, baseType: !108, size: 32, offset: 5248)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !208, file: !203, line: 338, baseType: !108, size: 32, offset: 5280)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !208, file: !203, line: 339, baseType: !108, size: 32, offset: 5312)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !208, file: !203, line: 340, baseType: !187, size: 32, offset: 5344)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !208, file: !203, line: 344, baseType: !187, size: 32, offset: 5376)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !208, file: !203, line: 356, baseType: !187, size: 32, offset: 5408)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !208, file: !203, line: 364, baseType: !187, size: 32, offset: 5440)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !208, file: !203, line: 367, baseType: !187, size: 32, offset: 5472)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !208, file: !203, line: 368, baseType: !187, size: 32, offset: 5504)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !208, file: !203, line: 369, baseType: !187, size: 32, offset: 5536)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !208, file: !203, line: 375, baseType: !369, size: 64, offset: 5568)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !266}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !204, file: !6, line: 386, baseType: !373, size: 8256, offset: 5632)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 8256, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 129)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !204, file: !6, line: 387, baseType: !187, size: 32, offset: 13888)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !204, file: !6, line: 388, baseType: !187, size: 32, offset: 13920)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !204, file: !6, line: 389, baseType: !187, size: 32, offset: 13952)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !204, file: !6, line: 390, baseType: !187, size: 32, offset: 13984)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !204, file: !6, line: 391, baseType: !187, size: 32, offset: 14016)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !204, file: !6, line: 402, baseType: !382, size: 576, offset: 14080)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !6, line: 394, size: 576, elements: !383)
!383 = !{!384, !385, !386, !396, !397, !398}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !382, file: !6, line: 396, baseType: !187, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !382, file: !6, line: 397, baseType: !187, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !382, file: !6, line: 398, baseType: !387, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !203, line: 604, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 593, size: 192, elements: !390)
!390 = !{!391, !392, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !389, file: !203, line: 595, baseType: !187, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !389, file: !203, line: 596, baseType: !187, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !389, file: !203, line: 599, baseType: !187, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !389, file: !203, line: 603, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !382, file: !6, line: 399, baseType: !187, size: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !382, file: !6, line: 400, baseType: !395, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !382, file: !6, line: 401, baseType: !399, size: 320, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !400, line: 56, baseType: !401)
!400 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !400, line: 47, size: 320, elements: !402)
!402 = !{!403, !404, !405, !406, !410, !411}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !401, file: !400, line: 49, baseType: !395, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !401, file: !400, line: 50, baseType: !395, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !401, file: !400, line: 51, baseType: !395, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !401, file: !400, line: 53, baseType: !407, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !408, line: 87, baseType: !409)
!408 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!409 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !401, file: !400, line: 54, baseType: !187, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !401, file: !400, line: 55, baseType: !187, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !204, file: !6, line: 404, baseType: !395, size: 64, offset: 14656)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !204, file: !6, line: 405, baseType: !187, size: 32, offset: 14720)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !204, file: !6, line: 410, baseType: !187, size: 32, offset: 14752)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !204, file: !6, line: 411, baseType: !187, size: 32, offset: 14784)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !204, file: !6, line: 413, baseType: !187, size: 32, offset: 14816)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !204, file: !6, line: 415, baseType: !187, size: 32, offset: 14848)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !204, file: !6, line: 416, baseType: !187, size: 32, offset: 14880)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !204, file: !6, line: 418, baseType: !187, size: 32, offset: 14912)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !204, file: !6, line: 419, baseType: !187, size: 32, offset: 14944)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !204, file: !6, line: 420, baseType: !187, size: 32, offset: 14976)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !204, file: !6, line: 421, baseType: !187, size: 32, offset: 15008)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !204, file: !6, line: 422, baseType: !187, size: 32, offset: 15040)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !204, file: !6, line: 424, baseType: !187, size: 32, offset: 15072)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !204, file: !6, line: 425, baseType: !187, size: 32, offset: 15104)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !204, file: !6, line: 427, baseType: !187, size: 32, offset: 15136)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !204, file: !6, line: 430, baseType: !428, size: 10400, offset: 15168)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 10400, elements: !515)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !430, line: 154, baseType: !431)
!430 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 52, size: 10400, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !450, !451, !452, !453, !454, !455, !456, !457, !458, !465, !466, !514}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !431, file: !430, line: 54, baseType: !187, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !431, file: !430, line: 56, baseType: !187, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !431, file: !430, line: 57, baseType: !187, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !431, file: !430, line: 59, baseType: !187, size: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !431, file: !430, line: 60, baseType: !187, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !431, file: !430, line: 61, baseType: !187, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !431, file: !430, line: 63, baseType: !187, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !431, file: !430, line: 65, baseType: !187, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !431, file: !430, line: 67, baseType: !187, size: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !431, file: !430, line: 69, baseType: !187, size: 32, offset: 288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !431, file: !430, line: 70, baseType: !187, size: 32, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !431, file: !430, line: 71, baseType: !187, size: 32, offset: 352)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !431, file: !430, line: 72, baseType: !187, size: 32, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !431, file: !430, line: 73, baseType: !447, size: 8192, offset: 416)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 8192, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !431, file: !430, line: 75, baseType: !187, size: 32, offset: 8608)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !431, file: !430, line: 76, baseType: !187, size: 32, offset: 8640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !431, file: !430, line: 77, baseType: !187, size: 32, offset: 8672)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !431, file: !430, line: 78, baseType: !187, size: 32, offset: 8704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !431, file: !430, line: 79, baseType: !187, size: 32, offset: 8736)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !431, file: !430, line: 80, baseType: !187, size: 32, offset: 8768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !431, file: !430, line: 81, baseType: !187, size: 32, offset: 8800)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !431, file: !430, line: 83, baseType: !187, size: 32, offset: 8832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !431, file: !430, line: 90, baseType: !459, size: 128, offset: 8864)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !431, file: !430, line: 84, size: 128, elements: !460)
!460 = !{!461, !462, !463, !464}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !459, file: !430, line: 86, baseType: !187, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !459, file: !430, line: 87, baseType: !187, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !459, file: !430, line: 88, baseType: !187, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !459, file: !430, line: 89, baseType: !187, size: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !431, file: !430, line: 92, baseType: !187, size: 32, offset: 8992)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !431, file: !430, line: 150, baseType: !467, size: 1344, offset: 9024)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !431, file: !430, line: 93, size: 1344, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !467, file: !430, line: 95, baseType: !187, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !467, file: !430, line: 96, baseType: !187, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !467, file: !430, line: 97, baseType: !187, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !467, file: !430, line: 99, baseType: !187, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !467, file: !430, line: 100, baseType: !187, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !467, file: !430, line: 102, baseType: !187, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !467, file: !430, line: 103, baseType: !187, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !467, file: !430, line: 104, baseType: !187, size: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !467, file: !430, line: 105, baseType: !187, size: 32, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !467, file: !430, line: 106, baseType: !187, size: 32, offset: 288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !467, file: !430, line: 107, baseType: !187, size: 32, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !467, file: !430, line: 108, baseType: !187, size: 32, offset: 352)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !467, file: !430, line: 110, baseType: !187, size: 32, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !467, file: !430, line: 111, baseType: !187, size: 32, offset: 416)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !467, file: !430, line: 112, baseType: !187, size: 32, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !467, file: !430, line: 114, baseType: !187, size: 32, offset: 480)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !467, file: !430, line: 115, baseType: !108, size: 32, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !467, file: !430, line: 116, baseType: !108, size: 32, offset: 544)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !467, file: !430, line: 117, baseType: !187, size: 32, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !467, file: !430, line: 119, baseType: !187, size: 32, offset: 608)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !467, file: !430, line: 120, baseType: !187, size: 32, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !467, file: !430, line: 137, baseType: !491, size: 384, offset: 672)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !467, file: !430, line: 122, size: 384, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !491, file: !430, line: 124, baseType: !187, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !491, file: !430, line: 125, baseType: !187, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !491, file: !430, line: 126, baseType: !187, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !491, file: !430, line: 127, baseType: !187, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !491, file: !430, line: 128, baseType: !187, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !491, file: !430, line: 129, baseType: !187, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !491, file: !430, line: 130, baseType: !187, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !491, file: !430, line: 131, baseType: !187, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !491, file: !430, line: 133, baseType: !187, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !491, file: !430, line: 134, baseType: !187, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !491, file: !430, line: 135, baseType: !187, size: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !491, file: !430, line: 136, baseType: !187, size: 32, offset: 352)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !467, file: !430, line: 139, baseType: !187, size: 32, offset: 1056)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !467, file: !430, line: 140, baseType: !187, size: 32, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !467, file: !430, line: 141, baseType: !187, size: 32, offset: 1120)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !467, file: !430, line: 142, baseType: !187, size: 32, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !467, file: !430, line: 143, baseType: !187, size: 32, offset: 1184)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !467, file: !430, line: 144, baseType: !187, size: 32, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !467, file: !430, line: 145, baseType: !187, size: 32, offset: 1248)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !467, file: !430, line: 146, baseType: !187, size: 32, offset: 1280)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !467, file: !430, line: 147, baseType: !187, size: 32, offset: 1312)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !431, file: !430, line: 152, baseType: !187, size: 32, offset: 10368)
!515 = !{!516}
!516 = !DISubrange(count: 1)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !204, file: !6, line: 431, baseType: !518, size: 64, offset: 25600)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !204, file: !6, line: 432, baseType: !520, size: 960, offset: 25664)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 960, elements: !515)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !430, line: 186, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 156, size: 960, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !522, file: !430, line: 158, baseType: !187, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !522, file: !430, line: 159, baseType: !187, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !522, file: !430, line: 161, baseType: !187, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !522, file: !430, line: 163, baseType: !187, size: 32, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !522, file: !430, line: 164, baseType: !187, size: 32, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !522, file: !430, line: 166, baseType: !187, size: 32, offset: 160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !522, file: !430, line: 167, baseType: !187, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !522, file: !430, line: 169, baseType: !187, size: 32, offset: 224)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !522, file: !430, line: 170, baseType: !187, size: 32, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !522, file: !430, line: 172, baseType: !187, size: 32, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !522, file: !430, line: 173, baseType: !187, size: 32, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !522, file: !430, line: 175, baseType: !187, size: 32, offset: 352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !522, file: !430, line: 177, baseType: !187, size: 32, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !522, file: !430, line: 178, baseType: !187, size: 32, offset: 416)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !522, file: !430, line: 179, baseType: !187, size: 32, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !522, file: !430, line: 181, baseType: !187, size: 32, offset: 480)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !522, file: !430, line: 183, baseType: !187, size: 32, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !522, file: !430, line: 184, baseType: !542, size: 384, offset: 576)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 384, elements: !544)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!544 = !{!545}
!545 = !DISubrange(count: 6)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !204, file: !6, line: 433, baseType: !547, size: 64, offset: 26624)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !204, file: !6, line: 434, baseType: !187, size: 32, offset: 26688)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !204, file: !6, line: 437, baseType: !187, size: 32, offset: 26720)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !204, file: !6, line: 440, baseType: !551, size: 256, offset: 26752)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 256, elements: !124)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 512, elements: !155)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !204, file: !6, line: 441, baseType: !555, size: 128, offset: 27008)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 128, elements: !117)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 2048, elements: !259)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !204, file: !6, line: 443, baseType: !551, size: 256, offset: 27136)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !204, file: !6, line: 444, baseType: !555, size: 128, offset: 27392)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !204, file: !6, line: 446, baseType: !561, size: 256, offset: 27520)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 256, elements: !124)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 256, elements: !155)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !204, file: !6, line: 447, baseType: !565, size: 128, offset: 27776)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !117)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 1024, elements: !259)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !204, file: !6, line: 448, baseType: !561, size: 256, offset: 27904)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !204, file: !6, line: 449, baseType: !565, size: 128, offset: 28160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !204, file: !6, line: 454, baseType: !571, size: 5888, offset: 28288)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 5888, elements: !573)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!573 = !{!574}
!574 = !DISubrange(count: 92)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !204, file: !6, line: 455, baseType: !576, size: 23552, offset: 34176)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 23552, elements: !577)
!577 = !{!574, !125}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !204, file: !6, line: 457, baseType: !543, size: 64, offset: 57728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !204, file: !6, line: 460, baseType: !580, size: 53376, offset: 57856)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !6, line: 364, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 302, size: 53376, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !611, !640, !641, !642, !648, !649, !650, !651, !652, !653, !654, !655}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !581, file: !6, line: 304, baseType: !518, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !581, file: !6, line: 305, baseType: !547, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !581, file: !6, line: 307, baseType: !187, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !581, file: !6, line: 308, baseType: !187, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !581, file: !6, line: 309, baseType: !187, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !581, file: !6, line: 311, baseType: !187, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !581, file: !6, line: 313, baseType: !187, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !581, file: !6, line: 315, baseType: !187, size: 32, offset: 288)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !581, file: !6, line: 316, baseType: !187, size: 32, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !581, file: !6, line: 317, baseType: !187, size: 32, offset: 352)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !581, file: !6, line: 319, baseType: !187, size: 32, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !581, file: !6, line: 321, baseType: !187, size: 32, offset: 416)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !581, file: !6, line: 322, baseType: !187, size: 32, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !581, file: !6, line: 324, baseType: !307, size: 64, offset: 480)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !581, file: !6, line: 325, baseType: !187, size: 32, offset: 544)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !581, file: !6, line: 327, baseType: !187, size: 32, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !581, file: !6, line: 329, baseType: !187, size: 32, offset: 608)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !581, file: !6, line: 330, baseType: !187, size: 32, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !581, file: !6, line: 331, baseType: !187, size: 32, offset: 672)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !581, file: !6, line: 333, baseType: !187, size: 32, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !581, file: !6, line: 334, baseType: !187, size: 32, offset: 736)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !581, file: !6, line: 339, baseType: !605, size: 2048, offset: 768)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 2048, elements: !610)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !6, line: 335, size: 64, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !606, file: !6, line: 337, baseType: !187, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !606, file: !6, line: 338, baseType: !187, size: 32, offset: 32)
!610 = !{!118, !156}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !581, file: !6, line: 342, baseType: !612, size: 49152, align: 128, offset: 2816)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 49152, align: 128, elements: !637)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !614, line: 36, baseType: !615, align: 128)
!614 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !614, line: 26, size: 512, elements: !616)
!616 = !{!617, !623, !624, !627, !628, !629}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !615, file: !614, line: 30, baseType: !618, size: 128, align: 128)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 128, elements: !151)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !620, line: 25, baseType: !621)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !111, line: 39, baseType: !622)
!622 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !615, file: !614, line: 31, baseType: !618, size: 128, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !615, file: !614, line: 32, baseType: !625, size: 32, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !620, line: 26, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !111, line: 41, baseType: !187)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !615, file: !614, line: 33, baseType: !625, size: 32, offset: 288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !615, file: !614, line: 34, baseType: !625, size: 32, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !615, file: !614, line: 35, baseType: !630, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !614, line: 25, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !395, !187, !395, !187, !635, !187}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!637 = !{!638, !639}
!638 = !DISubrange(count: 32)
!639 = !DISubrange(count: 3)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !581, file: !6, line: 344, baseType: !187, size: 32, offset: 51968)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !581, file: !6, line: 345, baseType: !187, size: 32, offset: 52000)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !581, file: !6, line: 350, baseType: !643, size: 1024, offset: 52032)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 1024, elements: !155)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !6, line: 346, size: 64, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !644, file: !6, line: 348, baseType: !187, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !644, file: !6, line: 349, baseType: !187, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !581, file: !6, line: 352, baseType: !187, size: 32, offset: 53056)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !581, file: !6, line: 354, baseType: !187, size: 32, offset: 53088)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !581, file: !6, line: 355, baseType: !187, size: 32, offset: 53120)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !581, file: !6, line: 356, baseType: !187, size: 32, offset: 53152)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !581, file: !6, line: 357, baseType: !187, size: 32, offset: 53184)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !581, file: !6, line: 360, baseType: !187, size: 32, offset: 53216)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !581, file: !6, line: 361, baseType: !187, size: 32, offset: 53248)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !581, file: !6, line: 362, baseType: !187, size: 32, offset: 53280)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !204, file: !6, line: 463, baseType: !657, size: 4096, offset: 111232)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !658, line: 46, baseType: !659)
!658 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !658, line: 27, size: 4096, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !659, file: !658, line: 30, baseType: !187, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !659, file: !658, line: 31, baseType: !187, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !659, file: !658, line: 34, baseType: !187, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !659, file: !658, line: 35, baseType: !187, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !659, file: !658, line: 37, baseType: !395, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !659, file: !658, line: 38, baseType: !395, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !659, file: !658, line: 39, baseType: !395, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !659, file: !658, line: 42, baseType: !187, size: 32, align: 128, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !659, file: !658, line: 45, baseType: !670, size: 3680, offset: 416)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 3680, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 460)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !204, file: !6, line: 494, baseType: !674, size: 2112, offset: 115328)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !6, line: 465, size: 2112, elements: !675)
!675 = !{!676, !814, !816, !817, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !830, !831, !832, !833}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !674, file: !6, line: 468, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !680, line: 146, baseType: !681)
!680 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !680, line: 31, size: 125056, elements: !682)
!682 = !{!683, !684, !685, !686, !689, !690, !691, !692, !693, !694, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !713, !714, !715, !716, !717, !718, !720, !722, !723, !724, !725, !726, !729, !731, !732, !734, !739, !740, !744, !745, !749, !753, !756, !758, !759, !761, !762, !764, !765, !766, !769, !771, !772, !773, !775, !776, !777, !778, !779, !780, !781, !782, !784, !785, !786, !795, !799, !801, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !681, file: !680, line: 34, baseType: !187, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !681, file: !680, line: 35, baseType: !187, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !681, file: !680, line: 36, baseType: !187, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !681, file: !680, line: 37, baseType: !687, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !620, line: 27, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 44, baseType: !409)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !681, file: !680, line: 38, baseType: !687, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !681, file: !680, line: 39, baseType: !187, size: 32, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !681, file: !680, line: 40, baseType: !187, size: 32, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !681, file: !680, line: 41, baseType: !187, size: 32, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !681, file: !680, line: 42, baseType: !187, size: 32, offset: 352)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !681, file: !680, line: 43, baseType: !695, size: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !681, file: !680, line: 45, baseType: !187, size: 32, offset: 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !681, file: !680, line: 46, baseType: !187, size: 32, offset: 480)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !681, file: !680, line: 47, baseType: !187, size: 32, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !681, file: !680, line: 48, baseType: !187, size: 32, offset: 544)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !681, file: !680, line: 49, baseType: !187, size: 32, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !681, file: !680, line: 50, baseType: !187, size: 32, offset: 608)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !681, file: !680, line: 51, baseType: !187, size: 32, offset: 640)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !681, file: !680, line: 52, baseType: !121, size: 8, offset: 672)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !681, file: !680, line: 53, baseType: !121, size: 8, offset: 680)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !681, file: !680, line: 54, baseType: !121, size: 8, offset: 688)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !681, file: !680, line: 55, baseType: !303, size: 32, offset: 704)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !681, file: !680, line: 56, baseType: !303, size: 32, offset: 736)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !681, file: !680, line: 57, baseType: !187, size: 32, offset: 768)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !681, file: !680, line: 60, baseType: !187, size: 32, offset: 800)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !681, file: !680, line: 61, baseType: !711, size: 96, offset: 832)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 96, elements: !712)
!712 = !{!639}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !681, file: !680, line: 62, baseType: !711, size: 96, offset: 928)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !681, file: !680, line: 63, baseType: !711, size: 96, offset: 1024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !681, file: !680, line: 64, baseType: !187, size: 32, offset: 1120)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !681, file: !680, line: 65, baseType: !187, size: 32, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !681, file: !680, line: 66, baseType: !187, size: 32, offset: 1184)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !681, file: !680, line: 67, baseType: !719, size: 192, offset: 1216)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 192, elements: !712)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !681, file: !680, line: 68, baseType: !721, size: 256, offset: 1408)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 256, elements: !124)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !681, file: !680, line: 69, baseType: !721, size: 256, offset: 1664)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !681, file: !680, line: 70, baseType: !572, size: 64, offset: 1920)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !681, file: !680, line: 74, baseType: !721, size: 256, offset: 1984)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !681, file: !680, line: 75, baseType: !721, size: 256, offset: 2240)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !681, file: !680, line: 77, baseType: !727, size: 24576, align: 128, offset: 2560)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 24576, align: 128, elements: !728)
!728 = !{!156, !639}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !681, file: !680, line: 78, baseType: !730, size: 1024, offset: 27136)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 1024, elements: !155)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !681, file: !680, line: 79, baseType: !187, size: 32, offset: 28160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !681, file: !680, line: 80, baseType: !733, size: 64, offset: 28224)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !681, file: !680, line: 83, baseType: !735, size: 64, offset: 28288)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !620, line: 24, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !111, line: 37, baseType: !738)
!738 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !681, file: !680, line: 84, baseType: !395, size: 64, offset: 28352)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !681, file: !680, line: 85, baseType: !741, size: 128, offset: 28416)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 128, elements: !117)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 32, elements: !117)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !681, file: !680, line: 86, baseType: !742, size: 64, offset: 28544)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !681, file: !680, line: 87, baseType: !746, size: 2176, offset: 28608)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 2176, elements: !747)
!747 = !{!118, !748}
!748 = !DISubrange(count: 17)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !681, file: !680, line: 92, baseType: !750, size: 20736, offset: 30784)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 20736, elements: !751)
!751 = !{!752, !752}
!752 = !DISubrange(count: 18)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !681, file: !680, line: 96, baseType: !754, size: 2176, offset: 51520)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 2176, elements: !747)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !681, file: !680, line: 97, baseType: !757, size: 128, offset: 53696)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 128, elements: !117)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !681, file: !680, line: 98, baseType: !307, size: 64, offset: 53824)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !681, file: !680, line: 99, baseType: !760, size: 1024, offset: 53888)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 1024, elements: !610)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !681, file: !680, line: 100, baseType: !743, size: 32, offset: 54912)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !681, file: !680, line: 105, baseType: !763, size: 10368, offset: 54944)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 10368, elements: !751)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !681, file: !680, line: 106, baseType: !763, size: 10368, offset: 65312)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !681, file: !680, line: 107, baseType: !187, size: 32, offset: 75680)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !681, file: !680, line: 108, baseType: !767, size: 576, offset: 75712)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 576, elements: !768)
!768 = !{!752}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !681, file: !680, line: 109, baseType: !770, size: 20736, offset: 76288)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 20736, elements: !751)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !681, file: !680, line: 110, baseType: !755, size: 64, offset: 97024)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !681, file: !680, line: 111, baseType: !755, size: 64, offset: 97088)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !681, file: !680, line: 112, baseType: !774, size: 64, offset: 97152)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !681, file: !680, line: 113, baseType: !774, size: 64, offset: 97216)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !681, file: !680, line: 114, baseType: !774, size: 64, offset: 97280)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !681, file: !680, line: 115, baseType: !187, size: 32, offset: 97344)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !681, file: !680, line: 116, baseType: !572, size: 64, offset: 97408)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !681, file: !680, line: 117, baseType: !572, size: 64, offset: 97472)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !681, file: !680, line: 118, baseType: !572, size: 64, offset: 97536)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !681, file: !680, line: 119, baseType: !187, size: 32, offset: 97600)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !681, file: !680, line: 120, baseType: !783, size: 576, offset: 97632)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 576, elements: !768)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !681, file: !680, line: 121, baseType: !108, size: 32, offset: 98208)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !681, file: !680, line: 122, baseType: !143, size: 64, offset: 98240)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !681, file: !680, line: 125, baseType: !787, size: 256, offset: 98304)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !203, line: 503, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 496, size: 256, elements: !789)
!789 = !{!790, !792, !793, !794}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !788, file: !203, line: 498, baseType: !791, size: 64)
!791 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !788, file: !203, line: 499, baseType: !791, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !788, file: !203, line: 500, baseType: !791, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !788, file: !203, line: 502, baseType: !791, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !681, file: !680, line: 128, baseType: !796, size: 2008, offset: 98560)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 2008, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 251)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !681, file: !680, line: 129, baseType: !800, size: 8032, offset: 100576)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 8032, elements: !797)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !681, file: !680, line: 130, baseType: !802, size: 16064, offset: 108608)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 16064, elements: !797)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !681, file: !680, line: 131, baseType: !187, size: 32, offset: 124672)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !681, file: !680, line: 132, baseType: !187, size: 32, offset: 124704)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !681, file: !680, line: 135, baseType: !187, size: 32, offset: 124736)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !681, file: !680, line: 136, baseType: !187, size: 32, offset: 124768)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !681, file: !680, line: 137, baseType: !187, size: 32, offset: 124800)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !681, file: !680, line: 138, baseType: !187, size: 32, offset: 124832)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !681, file: !680, line: 139, baseType: !187, size: 32, offset: 124864)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !681, file: !680, line: 142, baseType: !303, size: 32, offset: 124896)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !681, file: !680, line: 143, baseType: !187, size: 32, offset: 124928)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !681, file: !680, line: 144, baseType: !187, size: 32, offset: 124960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !681, file: !680, line: 145, baseType: !187, size: 32, offset: 124992)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !674, file: !6, line: 470, baseType: !815, size: 128, offset: 64)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 128, elements: !117)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !674, file: !6, line: 473, baseType: !677, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !674, file: !6, line: 476, baseType: !818, size: 1152, offset: 256)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 1152, elements: !768)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !674, file: !6, line: 478, baseType: !187, size: 32, offset: 1408)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !674, file: !6, line: 480, baseType: !187, size: 32, offset: 1440)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !674, file: !6, line: 482, baseType: !187, size: 32, offset: 1472)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !674, file: !6, line: 483, baseType: !187, size: 32, offset: 1504)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !674, file: !6, line: 484, baseType: !187, size: 32, offset: 1536)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !674, file: !6, line: 485, baseType: !187, size: 32, offset: 1568)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !674, file: !6, line: 486, baseType: !187, size: 32, offset: 1600)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !674, file: !6, line: 487, baseType: !687, size: 64, offset: 1664)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !674, file: !6, line: 488, baseType: !687, size: 64, offset: 1728)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !674, file: !6, line: 489, baseType: !829, size: 128, offset: 1792)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 128, elements: !117)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !674, file: !6, line: 490, baseType: !687, size: 64, offset: 1920)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !674, file: !6, line: 491, baseType: !687, size: 64, offset: 1984)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !674, file: !6, line: 492, baseType: !187, size: 32, offset: 2048)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !674, file: !6, line: 493, baseType: !187, size: 32, offset: 2080)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !204, file: !6, line: 497, baseType: !678, size: 64, offset: 117440)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !204, file: !6, line: 500, baseType: !678, size: 64, offset: 117504)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !204, file: !6, line: 503, baseType: !187, size: 32, offset: 117568)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !204, file: !6, line: 504, baseType: !838, size: 1216, offset: 117632)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 1216, elements: !178)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !204, file: !6, line: 505, baseType: !187, size: 32, offset: 118848)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !204, file: !6, line: 506, baseType: !838, size: 1216, offset: 118912)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !204, file: !6, line: 507, baseType: !307, size: 64, offset: 120128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !204, file: !6, line: 510, baseType: !187, size: 32, offset: 120192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !204, file: !6, line: 511, baseType: !187, size: 32, offset: 120224)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !204, file: !6, line: 512, baseType: !687, size: 64, offset: 120256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !204, file: !6, line: 522, baseType: !846, size: 10624, offset: 120320)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !6, line: 515, size: 10624, elements: !847)
!847 = !{!848, !850, !853, !856}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !846, file: !6, line: 517, baseType: !849, size: 256, align: 128)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 256, elements: !155)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !846, file: !6, line: 518, baseType: !851, size: 128, align: 128, offset: 256)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 128, elements: !852)
!852 = !{!118, !125}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !846, file: !6, line: 520, baseType: !854, size: 4096, align: 128, offset: 384)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 4096, elements: !855)
!855 = !{!125, !260}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !846, file: !6, line: 521, baseType: !857, size: 6144, align: 128, offset: 4480)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 6144, elements: !858)
!858 = !{!859, !156}
!859 = !DISubrange(count: 24)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !204, file: !6, line: 732, baseType: !861, size: 82688, offset: 130944)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !6, line: 525, size: 82688, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !890, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !908, !911, !915, !916, !917, !922, !923, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !990, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1032, !1033, !1034, !1037, !1040, !1042, !1045, !1047, !1048}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !861, file: !6, line: 527, baseType: !187, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !861, file: !6, line: 530, baseType: !187, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !861, file: !6, line: 531, baseType: !187, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !861, file: !6, line: 532, baseType: !187, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !861, file: !6, line: 535, baseType: !187, size: 32, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !861, file: !6, line: 536, baseType: !187, size: 32, offset: 160)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !861, file: !6, line: 537, baseType: !187, size: 32, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !861, file: !6, line: 538, baseType: !187, size: 32, offset: 224)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !861, file: !6, line: 539, baseType: !187, size: 32, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !861, file: !6, line: 542, baseType: !187, size: 32, offset: 288)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !861, file: !6, line: 543, baseType: !187, size: 32, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !861, file: !6, line: 544, baseType: !187, size: 32, offset: 352)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !861, file: !6, line: 545, baseType: !187, size: 32, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !861, file: !6, line: 546, baseType: !187, size: 32, offset: 416)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !861, file: !6, line: 547, baseType: !187, size: 32, offset: 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !861, file: !6, line: 548, baseType: !187, size: 32, offset: 480)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !861, file: !6, line: 549, baseType: !187, size: 32, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !861, file: !6, line: 551, baseType: !187, size: 32, offset: 544)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !861, file: !6, line: 554, baseType: !307, size: 64, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !861, file: !6, line: 555, baseType: !307, size: 64, offset: 640)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !861, file: !6, line: 558, baseType: !307, size: 64, offset: 704)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !861, file: !6, line: 559, baseType: !307, size: 64, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !861, file: !6, line: 561, baseType: !307, size: 64, offset: 832)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !861, file: !6, line: 562, baseType: !307, size: 64, offset: 896)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !861, file: !6, line: 565, baseType: !7, size: 32, offset: 960)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !861, file: !6, line: 566, baseType: !889, size: 128, offset: 992)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !124)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !861, file: !6, line: 567, baseType: !891, size: 512, offset: 1120)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !155)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !861, file: !6, line: 568, baseType: !7, size: 32, offset: 1632)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !861, file: !6, line: 569, baseType: !7, size: 32, offset: 1664)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !861, file: !6, line: 570, baseType: !187, size: 32, offset: 1696)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !861, file: !6, line: 571, baseType: !187, size: 32, offset: 1728)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !861, file: !6, line: 572, baseType: !187, size: 32, offset: 1760)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !861, file: !6, line: 573, baseType: !187, size: 32, offset: 1792)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !861, file: !6, line: 574, baseType: !187, size: 32, offset: 1824)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !861, file: !6, line: 575, baseType: !187, size: 32, offset: 1856)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !861, file: !6, line: 576, baseType: !187, size: 32, offset: 1888)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !861, file: !6, line: 577, baseType: !187, size: 32, offset: 1920)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !861, file: !6, line: 578, baseType: !187, size: 32, offset: 1952)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !861, file: !6, line: 585, baseType: !735, size: 64, offset: 1984)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !861, file: !6, line: 586, baseType: !395, size: 64, offset: 2048)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !861, file: !6, line: 587, baseType: !735, size: 64, offset: 2112)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !861, file: !6, line: 588, baseType: !907, size: 64, offset: 2176)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !861, file: !6, line: 589, baseType: !909, size: 64, offset: 2240)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 64, elements: !151)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !861, file: !6, line: 591, baseType: !912, size: 64, offset: 2304)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 192, elements: !914)
!914 = !{!859}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !861, file: !6, line: 592, baseType: !735, size: 64, offset: 2368)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !861, file: !6, line: 593, baseType: !741, size: 128, offset: 2432)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !861, file: !6, line: 594, baseType: !918, size: 128, offset: 2560)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 128, elements: !117)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !921)
!921 = !{!152, !118}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !861, file: !6, line: 595, baseType: !757, size: 128, offset: 2688)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !861, file: !6, line: 596, baseType: !924, size: 4096, offset: 2816)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 4096, elements: !925)
!925 = !{!118, !638}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !861, file: !6, line: 597, baseType: !735, size: 64, offset: 6912)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !861, file: !6, line: 598, baseType: !735, size: 64, offset: 6976)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !861, file: !6, line: 599, baseType: !572, size: 64, offset: 7040)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !861, file: !6, line: 603, baseType: !730, size: 1024, offset: 7104)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !861, file: !6, line: 606, baseType: !187, size: 32, offset: 8128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !861, file: !6, line: 607, baseType: !187, size: 32, offset: 8160)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !861, file: !6, line: 608, baseType: !120, size: 32, align: 32, offset: 8192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !861, file: !6, line: 609, baseType: !187, size: 32, offset: 8224)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !861, file: !6, line: 611, baseType: !187, size: 32, offset: 8256)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !861, file: !6, line: 612, baseType: !187, size: 32, offset: 8288)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !861, file: !6, line: 614, baseType: !187, size: 32, offset: 8320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !861, file: !6, line: 615, baseType: !187, size: 32, offset: 8352)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !861, file: !6, line: 621, baseType: !187, size: 32, offset: 8384)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !861, file: !6, line: 624, baseType: !187, size: 32, offset: 8416)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !861, file: !6, line: 626, baseType: !187, size: 32, offset: 8448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !861, file: !6, line: 627, baseType: !187, size: 32, offset: 8480)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !861, file: !6, line: 671, baseType: !943, size: 60672, offset: 8576)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !861, file: !6, line: 629, size: 60672, elements: !944)
!944 = !{!945, !949, !953, !955, !956, !959, !963, !964, !965, !966, !967, !968, !971, !975, !978, !979, !980, !981, !982, !985, !987, !989}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !943, file: !6, line: 634, baseType: !946, size: 3072, align: 128)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 3072, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 384)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !943, file: !6, line: 635, baseType: !950, size: 6912, align: 128, offset: 3072)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 6912, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 864)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !943, file: !6, line: 638, baseType: !954, size: 2048, align: 128, offset: 9984)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 2048, elements: !448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !943, file: !6, line: 639, baseType: !954, size: 2048, align: 128, offset: 12032)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !943, file: !6, line: 640, baseType: !957, size: 3072, align: 128, offset: 14080)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 3072, elements: !958)
!958 = !{!639, !260}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !943, file: !6, line: 641, baseType: !960, size: 3840, align: 128, offset: 17152)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 3840, elements: !961)
!961 = !{!962, !156}
!962 = !DISubrange(count: 15)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !943, file: !6, line: 642, baseType: !148, size: 128, offset: 20992)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !943, file: !6, line: 643, baseType: !148, size: 128, offset: 21120)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !943, file: !6, line: 644, baseType: !187, size: 32, offset: 21248)
