; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/magic.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/magic.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagicMapInfo = type { ptr, i64, ptr, i64 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._MagicInfo = type { ptr, ptr, ptr, ptr, i64, i64, i32, i32, ptr, ptr, i64 }

@magic_semaphore = internal global ptr null, align 8, !dbg !0
@magic_cache = internal unnamed_addr global ptr null, align 8, !dbg !257
@.str = private unnamed_addr constant [84 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/magic.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"...\00", align 1
@stdout = external local_unnamed_addr global ptr, align 8
@.str.4 = private unnamed_addr constant [2 x i8] c"*\00", align 1
@.str.5 = private unnamed_addr constant [12 x i8] c"\0APath: %s\0A\0A\00", align 1
@.str.6 = private unnamed_addr constant [25 x i8] c"Name      Offset Target\0A\00", align 1

!57 = !DIEnumerator(name: "MonitorError", value: 485)
!58 = !DIEnumerator(name: "RegistryError", value: 490)
!59 = !DIEnumerator(name: "ConfigureError", value: 495)
!60 = !DIEnumerator(name: "PolicyError", value: 499)
!61 = !DIEnumerator(name: "FatalErrorException", value: 700)
!62 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!63 = !DIEnumerator(name: "TypeFatalError", value: 705)
!64 = !DIEnumerator(name: "OptionFatalError", value: 710)
!65 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!66 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!67 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!68 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!69 = !DIEnumerator(name: "BlobFatalError", value: 735)
!70 = !DIEnumerator(name: "StreamFatalError", value: 740)
!71 = !DIEnumerator(name: "CacheFatalError", value: 745)
!72 = !DIEnumerator(name: "CoderFatalError", value: 750)
!73 = !DIEnumerator(name: "FilterFatalError", value: 752)
!74 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!75 = !DIEnumerator(name: "DrawFatalError", value: 760)
!76 = !DIEnumerator(name: "ImageFatalError", value: 765)
!77 = !DIEnumerator(name: "WandFatalError", value: 770)
!78 = !DIEnumerator(name: "RandomFatalError", value: 775)
!79 = !DIEnumerator(name: "XServerFatalError", value: 780)
!80 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!81 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!82 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!83 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 34, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!87 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!88 = !DIEnumerator(name: "NoEvents", value: 0)
!89 = !DIEnumerator(name: "TraceEvent", value: 1)
!90 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!91 = !DIEnumerator(name: "BlobEvent", value: 4)
!92 = !DIEnumerator(name: "CacheEvent", value: 8)
!93 = !DIEnumerator(name: "CoderEvent", value: 16)
!94 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!95 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!96 = !DIEnumerator(name: "DrawEvent", value: 128)
!97 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!98 = !DIEnumerator(name: "ImageEvent", value: 512)
!99 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!100 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!101 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!102 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!103 = !DIEnumerator(name: "TransformEvent", value: 16384)
!104 = !DIEnumerator(name: "UserEvent", value: 36864)
!105 = !DIEnumerator(name: "WandEvent", value: 65536)
!106 = !DIEnumerator(name: "X11Event", value: 131072)
!107 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!108 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 46, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!112 = !DIEnumerator(name: "_ISupper", value: 256)
!113 = !DIEnumerator(name: "_ISlower", value: 512)
!114 = !DIEnumerator(name: "_ISalpha", value: 1024)
!115 = !DIEnumerator(name: "_ISdigit", value: 2048)
!116 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!117 = !DIEnumerator(name: "_ISspace", value: 8192)
!118 = !DIEnumerator(name: "_ISprint", value: 16384)
!119 = !DIEnumerator(name: "_ISgraph", value: 32768)
!120 = !DIEnumerator(name: "_ISblank", value: 1)
!121 = !DIEnumerator(name: "_IScntrl", value: 2)
!122 = !DIEnumerator(name: "_ISpunct", value: 4)
!123 = !DIEnumerator(name: "_ISalnum", value: 8)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 25, baseType: !7, size: 32, elements: !126)
!125 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135}
!127 = !DIEnumerator(name: "UndefinedPath", value: 0)
!128 = !DIEnumerator(name: "MagickPath", value: 1)
!129 = !DIEnumerator(name: "RootPath", value: 2)
!130 = !DIEnumerator(name: "HeadPath", value: 3)
!131 = !DIEnumerator(name: "TailPath", value: 4)
!132 = !DIEnumerator(name: "BasePath", value: 5)
!133 = !DIEnumerator(name: "ExtensionPath", value: 6)
!134 = !DIEnumerator(name: "SubimagePath", value: 7)
!135 = !DIEnumerator(name: "CanonicalPath", value: 8)
!136 = !{!137, !165, !166, !152, !154, !168, !169, !170, !144, !171, !229, !231, !201, !179, !150, !203, !7, !234, !238, !242, !149, !255, !156}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagicInfo", file: !140, line: 51, baseType: !141)
!140 = !DIFile(filename: "apps/538.imagick_r/src/magick/magic.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d9fc918f002155e81e1a13ea7935e933")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagicInfo", file: !140, line: 25, size: 640, elements: !142)
!142 = !{!143, !146, !147, !148, !151, !155, !158, !160, !161, !163, !164}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !141, file: !140, line: 28, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !140, line: 29, baseType: !144, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !141, file: !140, line: 30, baseType: !144, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !141, file: !140, line: 33, baseType: !149, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !141, file: !140, line: 36, baseType: !152, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !153, line: 46, baseType: !154)
!153 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!154 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !141, file: !140, line: 39, baseType: !156, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !157)
!157 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !141, file: !140, line: 42, baseType: !159, size: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !141, file: !140, line: 43, baseType: !159, size: 32, offset: 416)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !141, file: !140, line: 46, baseType: !162, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !140, line: 47, baseType: !162, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !141, file: !140, line: 50, baseType: !152, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !174, line: 7, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !176, line: 49, size: 1728, elements: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!177 = !{!178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !194, !196, !197, !198, !202, !204, !206, !210, !213, !215, !218, !221, !222, !223, !224, !225}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !175, file: !176, line: 51, baseType: !179, size: 32)
!179 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !175, file: !176, line: 54, baseType: !144, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !175, file: !176, line: 55, baseType: !144, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !175, file: !176, line: 56, baseType: !144, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !175, file: !176, line: 57, baseType: !144, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !175, file: !176, line: 58, baseType: !144, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !175, file: !176, line: 59, baseType: !144, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !175, file: !176, line: 60, baseType: !144, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !175, file: !176, line: 61, baseType: !144, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !175, file: !176, line: 64, baseType: !144, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !175, file: !176, line: 65, baseType: !144, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !175, file: !176, line: 66, baseType: !144, size: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !175, file: !176, line: 68, baseType: !192, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !176, line: 36, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !175, file: !176, line: 70, baseType: !195, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !175, file: !176, line: 72, baseType: !179, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !175, file: !176, line: 73, baseType: !179, size: 32, offset: 928)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !175, file: !176, line: 74, baseType: !199, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 152, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!201 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !175, file: !176, line: 77, baseType: !203, size: 16, offset: 1024)
!203 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !175, file: !176, line: 78, baseType: !205, size: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !175, file: !176, line: 79, baseType: !207, size: 8, offset: 1048)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !175, file: !176, line: 81, baseType: !211, size: 64, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !176, line: 43, baseType: null)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !175, file: !176, line: 89, baseType: !214, size: 64, offset: 1152)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 153, baseType: !201)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !175, file: !176, line: 91, baseType: !216, size: 64, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !176, line: 37, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !175, file: !176, line: 92, baseType: !219, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !176, line: 38, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !175, file: !176, line: 93, baseType: !195, size: 64, offset: 1344)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !175, file: !176, line: 94, baseType: !165, size: 64, offset: 1408)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !175, file: !176, line: 95, baseType: !152, size: 64, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !175, file: !176, line: 96, baseType: !179, size: 32, offset: 1536)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !175, file: !176, line: 98, baseType: !226, size: 160, offset: 1568)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 160, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 20)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !232, line: 77, baseType: !233)
!232 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !200, line: 193, baseType: !201)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !236, line: 26, baseType: !237)
!236 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !236, line: 25, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !240, line: 34, baseType: !241)
!240 = !DIFile(filename: "apps/538.imagick_r/src/magick/hashmap.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "683c2bd26601474466c188c023adadf2")
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !240, line: 33, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !245, line: 40, baseType: !246)
!245 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !245, line: 29, size: 32960, elements: !247)
!247 = !{!248, !252, !253, !254}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !246, file: !245, line: 32, baseType: !249, size: 32768)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 32768, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 4096)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !246, file: !245, line: 35, baseType: !149, size: 64, offset: 32768)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !246, file: !245, line: 38, baseType: !152, size: 64, offset: 32832)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !246, file: !245, line: 39, baseType: !152, size: 64, offset: 32896)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!256 = !{!0, !257, !260}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "magic_cache", scope: !2, file: !259, line: 205, type: !238, isLocal: true, isDefinition: true)
!259 = !DIFile(filename: "apps/538.imagick_r/src/magick/magic.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c018a8e4521ba6e6f4555bcce8f31797")
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "MagicMap", scope: !2, file: !259, line: 87, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 28928, elements: !273)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagicMapInfo", file: !259, line: 81, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagicMapInfo", file: !259, line: 68, size: 256, elements: !266)
!266 = !{!267, !268, !270, !271}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !259, line: 71, baseType: !229, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !265, file: !259, line: 74, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !265, file: !259, line: 77, baseType: !166, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !265, file: !259, line: 80, baseType: !272, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!273 = !{!274}
!274 = !DISubrange(count: 113)
!275 = !{i32 7, !"Dwarf Version", i32 5}
!276 = !{i32 2, !"Debug Info Version", i32 3}
!277 = !{i32 1, !"wchar_size", i32 4}
!278 = !{i32 7, !"PIC Level", i32 2}
!279 = !{i32 7, !"PIE Level", i32 2}
!280 = !{i32 7, !"uwtable", i32 2}
!281 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!282 = distinct !DISubprogram(name: "GetMagicInfo", scope: !259, file: !259, line: 346, type: !283, scopeLine: 348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !298)
!283 = !DISubroutineType(types: !284)
!284 = !{!137, !166, !272, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !12, line: 102, size: 448, elements: !288)
!288 = !{!289, !291, !292, !293, !294, !295, !296, !297}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !287, file: !12, line: 105, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !12, line: 100, baseType: !11)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !287, file: !12, line: 108, baseType: !179, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !287, file: !12, line: 111, baseType: !144, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !287, file: !12, line: 112, baseType: !144, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !287, file: !12, line: 115, baseType: !165, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !287, file: !12, line: 118, baseType: !159, size: 32, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !287, file: !12, line: 121, baseType: !234, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !287, file: !12, line: 124, baseType: !152, size: 64, offset: 384)
!298 = !{!299, !300, !301, !302}
!299 = !DILocalVariable(name: "magic", arg: 1, scope: !282, file: !259, line: 346, type: !166)
!300 = !DILocalVariable(name: "length", arg: 2, scope: !282, file: !259, line: 347, type: !272)
!301 = !DILocalVariable(name: "exception", arg: 3, scope: !282, file: !259, line: 347, type: !285)
!302 = !DILocalVariable(name: "p", scope: !282, file: !259, line: 350, type: !137)
!303 = !DILocation(line: 0, scope: !282)
!304 = !DILocalVariable(name: "exception", arg: 1, scope: !305, file: !259, line: 622, type: !285)
!305 = distinct !DISubprogram(name: "IsMagicCacheInstantiated", scope: !259, file: !259, line: 622, type: !306, scopeLine: 623, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{!159, !285}
!308 = !{!304}
!309 = !DILocation(line: 0, scope: !305, inlinedAt: !310)
!310 = distinct !DILocation(line: 353, column: 7, scope: !311)
!311 = distinct !DILexicalBlock(scope: !282, file: !259, line: 353, column: 7)
!312 = !DILocation(line: 624, column: 7, scope: !313, inlinedAt: !310)
!313 = distinct !DILexicalBlock(scope: !305, file: !259, line: 624, column: 7)
!314 = !{!315, !315, i64 0}
!315 = !{!"any pointer", !316, i64 0}
!316 = !{!"omnipotent char", !317, i64 0}
!317 = !{!"Simple C/C++ TBAA"}
!318 = !DILocation(line: 624, column: 19, scope: !313, inlinedAt: !310)
!319 = !DILocation(line: 624, column: 7, scope: !305, inlinedAt: !310)
!320 = !DILocation(line: 626, column: 11, scope: !321, inlinedAt: !310)
!321 = distinct !DILexicalBlock(scope: !322, file: !259, line: 626, column: 11)
!322 = distinct !DILexicalBlock(scope: !313, file: !259, line: 625, column: 5)
!323 = !DILocation(line: 626, column: 27, scope: !321, inlinedAt: !310)
!324 = !DILocation(line: 626, column: 11, scope: !322, inlinedAt: !310)
!325 = !DILocation(line: 627, column: 9, scope: !321, inlinedAt: !310)
!326 = !DILocation(line: 628, column: 25, scope: !322, inlinedAt: !310)
!327 = !DILocation(line: 628, column: 7, scope: !322, inlinedAt: !310)
!328 = !DILocation(line: 629, column: 11, scope: !329, inlinedAt: !310)
!329 = distinct !DILexicalBlock(scope: !322, file: !259, line: 629, column: 11)
!330 = !DILocation(line: 629, column: 23, scope: !329, inlinedAt: !310)
!331 = !DILocation(line: 629, column: 11, scope: !322, inlinedAt: !310)
!332 = !DILocalVariable(name: "filename", arg: 1, scope: !333, file: !259, line: 244, type: !229)
!333 = distinct !DISubprogram(name: "AcquireMagicCache", scope: !259, file: !259, line: 244, type: !334, scopeLine: 246, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !336)
!334 = !DISubroutineType(types: !335)
!335 = !{!238, !229, !285}
!336 = !{!332, !337, !338, !339, !340, !341, !342, !344, !345, !348, !349, !353}
!337 = !DILocalVariable(name: "exception", arg: 2, scope: !333, file: !259, line: 245, type: !285)
!338 = !DILocalVariable(name: "path", scope: !333, file: !259, line: 248, type: !249)
!339 = !DILocalVariable(name: "option", scope: !333, file: !259, line: 251, type: !242)
!340 = !DILocalVariable(name: "magic_cache", scope: !333, file: !259, line: 254, type: !238)
!341 = !DILocalVariable(name: "options", scope: !333, file: !259, line: 255, type: !238)
!342 = !DILocalVariable(name: "status", scope: !333, file: !259, line: 258, type: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !6, line: 147, baseType: !7)
!344 = !DILocalVariable(name: "i", scope: !333, file: !259, line: 261, type: !231)
!345 = !DILocalVariable(name: "message", scope: !346, file: !259, line: 265, type: !144)
!346 = distinct !DILexicalBlock(scope: !347, file: !259, line: 265, column: 5)
