; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/wand/magick-property.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/wand/magick-property.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagickWand = type { i64, [4096 x i8], ptr, ptr, ptr, ptr, i32, i32, i32, i64 }
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i64, i64, i64, i32, i32, i32, i64, ptr, ptr, ptr, ptr, ptr, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, ptr, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, ptr, i32 }
%struct._PixelPacket = type { i16, i16, i16, i16 }

!540 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!541 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!542 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!543 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!544 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!545 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!546 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!547 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!548 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!549 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!550 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!551 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 25, baseType: !5, size: 32, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!554 = !DIEnumerator(name: "NoValue", value: 0)
!555 = !DIEnumerator(name: "XValue", value: 1)
!556 = !DIEnumerator(name: "XiValue", value: 1)
!557 = !DIEnumerator(name: "YValue", value: 2)
!558 = !DIEnumerator(name: "PsiValue", value: 2)
!559 = !DIEnumerator(name: "WidthValue", value: 4)
!560 = !DIEnumerator(name: "RhoValue", value: 4)
!561 = !DIEnumerator(name: "HeightValue", value: 8)
!562 = !DIEnumerator(name: "SigmaValue", value: 8)
!563 = !DIEnumerator(name: "ChiValue", value: 16)
!564 = !DIEnumerator(name: "XiNegative", value: 32)
!565 = !DIEnumerator(name: "XNegative", value: 32)
!566 = !DIEnumerator(name: "PsiNegative", value: 64)
!567 = !DIEnumerator(name: "YNegative", value: 64)
!568 = !DIEnumerator(name: "ChiNegative", value: 128)
!569 = !DIEnumerator(name: "PercentValue", value: 4096)
!570 = !DIEnumerator(name: "AspectValue", value: 8192)
!571 = !DIEnumerator(name: "NormalizeValue", value: 8192)
!572 = !DIEnumerator(name: "LessValue", value: 16384)
!573 = !DIEnumerator(name: "GreaterValue", value: 32768)
!574 = !DIEnumerator(name: "MinimumValue", value: 65536)
!575 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536)
!576 = !DIEnumerator(name: "AreaValue", value: 131072)
!577 = !DIEnumerator(name: "DecimalValue", value: 262144)
!578 = !DIEnumerator(name: "SeparatorValue", value: 524288)
!579 = !DIEnumerator(name: "AllValues", value: 2147483647)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 25, baseType: !5, size: 32, elements: !582)
!581 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591}
!583 = !DIEnumerator(name: "UndefinedResource", value: 0)
!584 = !DIEnumerator(name: "AreaResource", value: 1)
!585 = !DIEnumerator(name: "DiskResource", value: 2)
!586 = !DIEnumerator(name: "FileResource", value: 3)
!587 = !DIEnumerator(name: "MapResource", value: 4)
!588 = !DIEnumerator(name: "MemoryResource", value: 5)
!589 = !DIEnumerator(name: "ThreadResource", value: 6)
!590 = !DIEnumerator(name: "TimeResource", value: 7)
!591 = !DIEnumerator(name: "ThrottleResource", value: 8)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !593, line: 46, baseType: !5, size: 32, elements: !594)
!593 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!595 = !DIEnumerator(name: "_ISupper", value: 256)
!596 = !DIEnumerator(name: "_ISlower", value: 512)
!597 = !DIEnumerator(name: "_ISalpha", value: 1024)
!598 = !DIEnumerator(name: "_ISdigit", value: 2048)
!599 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!600 = !DIEnumerator(name: "_ISspace", value: 8192)
!601 = !DIEnumerator(name: "_ISprint", value: 16384)
!602 = !DIEnumerator(name: "_ISgraph", value: 32768)
!603 = !DIEnumerator(name: "_ISblank", value: 1)
!604 = !DIEnumerator(name: "_IScntrl", value: 2)
!605 = !DIEnumerator(name: "_ISpunct", value: 4)
!606 = !DIEnumerator(name: "_ISalnum", value: 8)
!607 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !608, line: 28, baseType: !5, size: 32, elements: !609)
!608 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!609 = !{!610, !611, !612}
!610 = !DIEnumerator(name: "UndefinedFormatType", value: 0)
!611 = !DIEnumerator(name: "ImplicitFormatType", value: 1)
!612 = !DIEnumerator(name: "ExplicitFormatType", value: 2)
!613 = !{!614, !615, !670, !674, !748, !706, !835, !679, !626, !803, !836, !840, !815, !849, !478, !804, !644, !850, !652}
!614 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !108, line: 150, size: 105920, elements: !618)
!618 = !{!619, !621, !623, !625, !628, !630, !632, !633, !634, !635, !636, !637, !648, !649, !650, !651, !653, !667, !669, !671, !673, !676, !677, !678, !684, !685, !686, !694, !695, !696, !697, !698, !699, !701, !703, !705, !707, !709, !711, !713, !714, !715, !716, !717, !718, !719, !727, !742, !756, !757, !758, !759, !763, !767, !771, !772, !773, !774, !775, !792, !793, !795, !796, !806, !807, !809, !810, !811, !812, !813, !814, !816, !817, !818, !819, !820, !821, !822, !824, !825, !826, !827, !828, !832, !834}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !617, file: !108, line: 153, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !246)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !617, file: !108, line: 156, baseType: !622, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !141, line: 61, baseType: !140)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !617, file: !108, line: 159, baseType: !624, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !83, line: 49, baseType: !82)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !617, file: !108, line: 162, baseType: !626, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !627, line: 46, baseType: !614)
!627 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!628 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !617, file: !108, line: 165, baseType: !629, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !108, line: 86, baseType: !107)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !617, file: !108, line: 168, baseType: !631, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !617, file: !108, line: 169, baseType: !631, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !617, file: !108, line: 172, baseType: !626, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !617, file: !108, line: 173, baseType: !626, size: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !617, file: !108, line: 174, baseType: !626, size: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !617, file: !108, line: 175, baseType: !626, size: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !617, file: !108, line: 178, baseType: !638, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !641)
!641 = !{!642, !645, !646, !647}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !640, file: !395, line: 143, baseType: !643, size: 16)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !644)
!644 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !640, file: !395, line: 144, baseType: !643, size: 16, offset: 16)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !640, file: !395, line: 145, baseType: !643, size: 16, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !640, file: !395, line: 146, baseType: !643, size: 16, offset: 48)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !617, file: !108, line: 179, baseType: !639, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !617, file: !108, line: 180, baseType: !639, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !617, file: !108, line: 181, baseType: !639, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !617, file: !108, line: 184, baseType: !652, size: 64, offset: 832)
!652 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !617, file: !108, line: 187, baseType: !654, size: 768, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !108, line: 128, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !108, line: 121, size: 768, elements: !656)
!656 = !{!657, !664, !665, !666}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !655, file: !108, line: 124, baseType: !658, size: 192)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !108, line: 101, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !108, line: 95, size: 192, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !659, file: !108, line: 98, baseType: !652, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !659, file: !108, line: 99, baseType: !652, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !659, file: !108, line: 100, baseType: !652, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !655, file: !108, line: 125, baseType: !658, size: 192, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !655, file: !108, line: 126, baseType: !658, size: 192, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !655, file: !108, line: 127, baseType: !658, size: 192, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !617, file: !108, line: 190, baseType: !668, size: 32, offset: 1664)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !252, line: 49, baseType: !251)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !617, file: !108, line: 193, baseType: !670, size: 64, offset: 1728)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !617, file: !108, line: 196, baseType: !672, size: 32, offset: 1792)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !108, line: 93, baseType: !135)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !617, file: !108, line: 199, baseType: !674, size: 64, offset: 1856)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !617, file: !108, line: 200, baseType: !674, size: 64, offset: 1920)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !617, file: !108, line: 201, baseType: !674, size: 64, offset: 1984)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !617, file: !108, line: 204, baseType: !679, size: 64, offset: 2048)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !680, line: 77, baseType: !681)
!680 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !682, line: 193, baseType: !683)
!682 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!683 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !617, file: !108, line: 207, baseType: !652, size: 64, offset: 2112)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !617, file: !108, line: 208, baseType: !652, size: 64, offset: 2176)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !617, file: !108, line: 211, baseType: !687, size: 256, offset: 2240)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !295, line: 130, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !295, line: 121, size: 256, elements: !689)
!689 = !{!690, !691, !692, !693}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !688, file: !295, line: 124, baseType: !626, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !688, file: !295, line: 125, baseType: !626, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !688, file: !295, line: 128, baseType: !679, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !688, file: !295, line: 129, baseType: !679, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !617, file: !108, line: 212, baseType: !687, size: 256, offset: 2496)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !617, file: !108, line: 213, baseType: !687, size: 256, offset: 2752)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !617, file: !108, line: 216, baseType: !652, size: 64, offset: 3008)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !617, file: !108, line: 217, baseType: !652, size: 64, offset: 3072)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !617, file: !108, line: 218, baseType: !652, size: 64, offset: 3136)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !617, file: !108, line: 221, baseType: !700, size: 32, offset: 3200)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !260, line: 66, baseType: !259)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !617, file: !108, line: 224, baseType: !702, size: 32, offset: 3232)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !108, line: 73, baseType: !119)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !617, file: !108, line: 227, baseType: !704, size: 32, offset: 3264)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !130, line: 35, baseType: !129)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !617, file: !108, line: 230, baseType: !706, size: 32, offset: 3296)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !295, line: 91, baseType: !294)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !617, file: !108, line: 233, baseType: !708, size: 32, offset: 3328)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !310, line: 99, baseType: !309)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !617, file: !108, line: 236, baseType: !710, size: 32, offset: 3360)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !381, line: 32, baseType: !380)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !617, file: !108, line: 239, baseType: !712, size: 64, offset: 3392)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !617, file: !108, line: 242, baseType: !626, size: 64, offset: 3456)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !617, file: !108, line: 243, baseType: !626, size: 64, offset: 3520)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !617, file: !108, line: 246, baseType: !679, size: 64, offset: 3584)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !617, file: !108, line: 249, baseType: !626, size: 64, offset: 3648)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !617, file: !108, line: 250, baseType: !626, size: 64, offset: 3712)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !617, file: !108, line: 253, baseType: !679, size: 64, offset: 3776)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !617, file: !108, line: 256, baseType: !720, size: 192, offset: 3840)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !721, line: 68, baseType: !722)
!721 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !721, line: 62, size: 192, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !722, file: !721, line: 65, baseType: !652, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !722, file: !721, line: 66, baseType: !652, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !722, file: !721, line: 67, baseType: !652, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !617, file: !108, line: 259, baseType: !728, size: 512, offset: 4032)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !389, line: 51, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !389, line: 40, size: 512, elements: !730)
!730 = !{!731, !738, !739, !741}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !729, file: !389, line: 43, baseType: !732, size: 192)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !389, line: 38, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !389, line: 32, size: 192, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !733, file: !389, line: 35, baseType: !652, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !733, file: !389, line: 36, baseType: !652, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !733, file: !389, line: 37, baseType: !652, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !729, file: !389, line: 44, baseType: !732, size: 192, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !729, file: !389, line: 47, baseType: !740, size: 32, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !389, line: 30, baseType: !388)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !729, file: !389, line: 50, baseType: !626, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !617, file: !108, line: 262, baseType: !743, size: 64, offset: 4544)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !744, line: 26, baseType: !745)
!744 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!631, !748, !750, !753, !670}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !752)
!752 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !755)
!755 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !617, file: !108, line: 265, baseType: !670, size: 64, offset: 4608)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !617, file: !108, line: 266, baseType: !670, size: 64, offset: 4672)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !617, file: !108, line: 267, baseType: !670, size: 64, offset: 4736)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !617, file: !108, line: 270, baseType: !760, size: 64, offset: 4800)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !83, line: 52, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !83, line: 51, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !617, file: !108, line: 273, baseType: !764, size: 64, offset: 4864)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !766)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !617, file: !108, line: 276, baseType: !768, size: 32768, offset: 4928)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 32768, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 4096)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !617, file: !108, line: 277, baseType: !768, size: 32768, offset: 37696)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !617, file: !108, line: 278, baseType: !768, size: 32768, offset: 70464)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !617, file: !108, line: 281, baseType: !626, size: 64, offset: 103232)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !617, file: !108, line: 282, baseType: !626, size: 64, offset: 103296)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !617, file: !108, line: 285, baseType: !776, size: 448, offset: 103360)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !10, line: 102, size: 448, elements: !778)
!778 = !{!779, !781, !782, !783, !784, !785, !786, !791}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !777, file: !10, line: 105, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !10, line: 100, baseType: !9)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !777, file: !10, line: 108, baseType: !478, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !777, file: !10, line: 111, baseType: !674, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !777, file: !10, line: 112, baseType: !674, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !777, file: !10, line: 115, baseType: !670, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !777, file: !10, line: 118, baseType: !631, size: 32, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !777, file: !10, line: 121, baseType: !787, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !789, line: 26, baseType: !790)
!789 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !789, line: 25, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !777, file: !10, line: 124, baseType: !626, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !617, file: !108, line: 288, baseType: !631, size: 32, offset: 103808)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !617, file: !108, line: 291, baseType: !794, size: 64, offset: 103872)
!794 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !679)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !617, file: !108, line: 294, baseType: !787, size: 64, offset: 103936)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !617, file: !108, line: 297, baseType: !797, size: 256, offset: 104000)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !252, line: 40, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !252, line: 27, size: 256, elements: !799)
!799 = !{!800, !801, !802, !805}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !252, line: 30, baseType: !674, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !798, file: !252, line: 33, baseType: !626, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !798, file: !252, line: 36, baseType: !803, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !798, file: !252, line: 39, baseType: !626, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !617, file: !108, line: 298, baseType: !797, size: 256, offset: 104256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !617, file: !108, line: 299, baseType: !808, size: 64, offset: 104512)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !617, file: !108, line: 302, baseType: !626, size: 64, offset: 104576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !617, file: !108, line: 305, baseType: !626, size: 64, offset: 104640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !617, file: !108, line: 308, baseType: !712, size: 64, offset: 104704)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !617, file: !108, line: 309, baseType: !712, size: 64, offset: 104768)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !617, file: !108, line: 310, baseType: !712, size: 64, offset: 104832)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !617, file: !108, line: 313, baseType: !815, size: 32, offset: 104896)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !617, file: !108, line: 316, baseType: !631, size: 32, offset: 104928)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !617, file: !108, line: 319, baseType: !639, size: 64, offset: 104960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !617, file: !108, line: 322, baseType: !712, size: 64, offset: 105024)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !617, file: !108, line: 325, baseType: !687, size: 256, offset: 105088)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !617, file: !108, line: 328, baseType: !670, size: 64, offset: 105344)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !617, file: !108, line: 329, baseType: !670, size: 64, offset: 105408)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !617, file: !108, line: 332, baseType: !823, size: 32, offset: 105472)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !108, line: 61, baseType: !177)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !617, file: !108, line: 335, baseType: !631, size: 32, offset: 105504)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !617, file: !108, line: 338, baseType: !754, size: 64, offset: 105536)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !617, file: !108, line: 341, baseType: !631, size: 32, offset: 105600)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !617, file: !108, line: 344, baseType: !626, size: 64, offset: 105664)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !617, file: !108, line: 347, baseType: !829, size: 64, offset: 105728)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !830, line: 7, baseType: !831)
!830 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !682, line: 160, baseType: !683)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !617, file: !108, line: 350, baseType: !833, size: 32, offset: 105792)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !617, file: !108, line: 353, baseType: !626, size: 64, offset: 105856)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !838, line: 26, baseType: !839)
!838 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !838, line: 25, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !842, line: 40, baseType: !843)
!842 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !842, line: 29, size: 32960, elements: !844)
!844 = !{!845, !846, !847, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !843, file: !842, line: 32, baseType: !768, size: 32768)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !843, file: !842, line: 35, baseType: !803, size: 64, offset: 32768)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !843, file: !842, line: 38, baseType: !626, size: 64, offset: 32832)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !843, file: !842, line: 39, baseType: !626, size: 64, offset: 32896)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !608, line: 103, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !608, line: 51, size: 1216, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !993, !1001, !1006, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1021, !1023, !1024, !1026, !1027, !1028, !1029}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !608, line: 54, baseType: !674, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !853, file: !608, line: 55, baseType: !674, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !853, file: !608, line: 56, baseType: !674, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !853, file: !608, line: 57, baseType: !674, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !853, file: !608, line: 58, baseType: !674, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !853, file: !608, line: 61, baseType: !861, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !108, line: 356, size: 134336, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !899, !900, !901, !902, !903, !904, !906, !907, !908, !909, !910, !911, !922, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !990, !991, !992}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !863, file: !108, line: 359, baseType: !624, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !863, file: !108, line: 362, baseType: !629, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !863, file: !108, line: 365, baseType: !631, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !863, file: !108, line: 366, baseType: !631, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !863, file: !108, line: 367, baseType: !631, size: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !863, file: !108, line: 368, baseType: !631, size: 32, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !863, file: !108, line: 371, baseType: !674, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !863, file: !108, line: 372, baseType: !674, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !863, file: !108, line: 373, baseType: !674, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !863, file: !108, line: 374, baseType: !674, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !863, file: !108, line: 377, baseType: !626, size: 64, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !863, file: !108, line: 378, baseType: !626, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !863, file: !108, line: 379, baseType: !626, size: 64, offset: 576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !863, file: !108, line: 382, baseType: !702, size: 32, offset: 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !863, file: !108, line: 385, baseType: !704, size: 32, offset: 672)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !863, file: !108, line: 388, baseType: !672, size: 32, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !863, file: !108, line: 391, baseType: !626, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !863, file: !108, line: 394, baseType: !674, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !863, file: !108, line: 395, baseType: !674, size: 64, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !863, file: !108, line: 396, baseType: !674, size: 64, offset: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !863, file: !108, line: 397, baseType: !674, size: 64, offset: 1024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !863, file: !108, line: 398, baseType: !674, size: 64, offset: 1088)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !863, file: !108, line: 401, baseType: !652, size: 64, offset: 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !863, file: !108, line: 402, baseType: !652, size: 64, offset: 1216)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !863, file: !108, line: 405, baseType: !639, size: 64, offset: 1280)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !863, file: !108, line: 406, baseType: !639, size: 64, offset: 1344)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !863, file: !108, line: 407, baseType: !639, size: 64, offset: 1408)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !863, file: !108, line: 410, baseType: !631, size: 32, offset: 1472)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !863, file: !108, line: 411, baseType: !631, size: 32, offset: 1504)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !863, file: !108, line: 414, baseType: !626, size: 64, offset: 1536)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !863, file: !108, line: 417, baseType: !622, size: 32, offset: 1600)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !863, file: !108, line: 420, baseType: !823, size: 32, offset: 1632)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !863, file: !108, line: 423, baseType: !898, size: 32, offset: 1664)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !192, line: 59, baseType: !191)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !863, file: !108, line: 426, baseType: !679, size: 64, offset: 1728)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !863, file: !108, line: 429, baseType: !631, size: 32, offset: 1792)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !863, file: !108, line: 430, baseType: !631, size: 32, offset: 1824)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !863, file: !108, line: 433, baseType: !674, size: 64, offset: 1856)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !863, file: !108, line: 434, baseType: !674, size: 64, offset: 1920)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !863, file: !108, line: 437, baseType: !905, size: 32, offset: 1984)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !224)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !863, file: !108, line: 440, baseType: !615, size: 64, offset: 2048)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !863, file: !108, line: 443, baseType: !670, size: 64, offset: 2112)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !863, file: !108, line: 446, baseType: !743, size: 64, offset: 2176)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !863, file: !108, line: 449, baseType: !670, size: 64, offset: 2240)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !863, file: !108, line: 450, baseType: !670, size: 64, offset: 2304)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !863, file: !108, line: 453, baseType: !912, size: 64, offset: 2368)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !913, line: 26, baseType: !914)
!913 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!626, !917, !919, !921}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !863, file: !108, line: 456, baseType: !923, size: 64, offset: 2432)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !925, line: 7, baseType: !926)
!925 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !927, line: 49, size: 1728, elements: !928)
!927 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !944, !946, !947, !948, !950, !951, !953, !957, !960, !962, !965, !968, !969, !970, !971, !972}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !926, file: !927, line: 51, baseType: !478, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !926, file: !927, line: 54, baseType: !674, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !926, file: !927, line: 55, baseType: !674, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !926, file: !927, line: 56, baseType: !674, size: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !926, file: !927, line: 57, baseType: !674, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !926, file: !927, line: 58, baseType: !674, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !926, file: !927, line: 59, baseType: !674, size: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !926, file: !927, line: 60, baseType: !674, size: 64, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !926, file: !927, line: 61, baseType: !674, size: 64, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !926, file: !927, line: 64, baseType: !674, size: 64, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !926, file: !927, line: 65, baseType: !674, size: 64, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !926, file: !927, line: 66, baseType: !674, size: 64, offset: 704)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !926, file: !927, line: 68, baseType: !942, size: 64, offset: 768)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !927, line: 36, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !926, file: !927, line: 70, baseType: !945, size: 64, offset: 832)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !926, file: !927, line: 72, baseType: !478, size: 32, offset: 896)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !926, file: !927, line: 73, baseType: !478, size: 32, offset: 928)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !926, file: !927, line: 74, baseType: !949, size: 64, offset: 960)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !682, line: 152, baseType: !683)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !926, file: !927, line: 77, baseType: !644, size: 16, offset: 1024)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !926, file: !927, line: 78, baseType: !952, size: 8, offset: 1040)
!952 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !926, file: !927, line: 79, baseType: !954, size: 8, offset: 1048)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 8, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 1)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !926, file: !927, line: 81, baseType: !958, size: 64, offset: 1088)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !927, line: 43, baseType: null)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !926, file: !927, line: 89, baseType: !961, size: 64, offset: 1152)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !682, line: 153, baseType: !683)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !926, file: !927, line: 91, baseType: !963, size: 64, offset: 1216)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !927, line: 37, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !926, file: !927, line: 92, baseType: !966, size: 64, offset: 1280)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !927, line: 38, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !926, file: !927, line: 93, baseType: !945, size: 64, offset: 1344)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !926, file: !927, line: 94, baseType: !670, size: 64, offset: 1408)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !926, file: !927, line: 95, baseType: !626, size: 64, offset: 1472)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !926, file: !927, line: 96, baseType: !478, size: 32, offset: 1536)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !926, file: !927, line: 98, baseType: !973, size: 160, offset: 1568)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 160, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 20)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !863, file: !108, line: 459, baseType: !670, size: 64, offset: 2496)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !863, file: !108, line: 462, baseType: !626, size: 64, offset: 2560)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !863, file: !108, line: 465, baseType: !768, size: 32768, offset: 2624)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !863, file: !108, line: 466, baseType: !768, size: 32768, offset: 35392)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !863, file: !108, line: 467, baseType: !768, size: 32768, offset: 68160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !863, file: !108, line: 468, baseType: !768, size: 32768, offset: 100928)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !863, file: !108, line: 471, baseType: !631, size: 32, offset: 133696)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !863, file: !108, line: 474, baseType: !674, size: 64, offset: 133760)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !863, file: !108, line: 477, baseType: !626, size: 64, offset: 133824)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !863, file: !108, line: 478, baseType: !626, size: 64, offset: 133888)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !863, file: !108, line: 481, baseType: !639, size: 64, offset: 133952)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !863, file: !108, line: 484, baseType: !626, size: 64, offset: 134016)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !863, file: !108, line: 487, baseType: !989, size: 32, offset: 134080)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !863, file: !108, line: 490, baseType: !639, size: 64, offset: 134112)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !863, file: !108, line: 493, baseType: !670, size: 64, offset: 134208)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !863, file: !108, line: 496, baseType: !631, size: 32, offset: 134272)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !853, file: !608, line: 64, baseType: !994, size: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !608, line: 43, baseType: !996)
!996 = !DISubroutineType(types: !997)
!997 = !{!615, !998, !1000}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !853, file: !608, line: 67, baseType: !1002, size: 64, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !608, line: 46, baseType: !1004)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!631, !998, !615}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !853, file: !608, line: 70, baseType: !1007, size: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !608, line: 49, baseType: !1009)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!631, !1011, !921}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !853, file: !608, line: 73, baseType: !670, size: 64, offset: 576)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !853, file: !608, line: 76, baseType: !631, size: 32, offset: 640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !853, file: !608, line: 77, baseType: !631, size: 32, offset: 672)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !853, file: !608, line: 78, baseType: !631, size: 32, offset: 704)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !853, file: !608, line: 79, baseType: !631, size: 32, offset: 736)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !853, file: !608, line: 80, baseType: !631, size: 32, offset: 768)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !853, file: !608, line: 83, baseType: !1020, size: 32, offset: 800)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !608, line: 33, baseType: !607)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !853, file: !608, line: 86, baseType: !1022, size: 32, offset: 832)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !853, file: !608, line: 89, baseType: !631, size: 32, offset: 864)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !853, file: !608, line: 92, baseType: !1025, size: 64, offset: 896)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !608, line: 93, baseType: !1025, size: 64, offset: 960)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !853, file: !608, line: 96, baseType: !626, size: 64, offset: 1024)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !853, file: !608, line: 99, baseType: !674, size: 64, offset: 1088)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !853, file: !608, line: 102, baseType: !787, size: 64, offset: 1152)
!1030 = !{i32 7, !"Dwarf Version", i32 5}
!1031 = !{i32 2, !"Debug Info Version", i32 3}
!1032 = !{i32 1, !"wchar_size", i32 4}
!1033 = !{i32 7, !"PIC Level", i32 2}
!1034 = !{i32 7, !"PIE Level", i32 2}
!1035 = !{i32 7, !"uwtable", i32 2}
!1036 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1037 = distinct !DISubprogram(name: "MagickDeleteImageArtifact", scope: !1038, file: !1038, line: 80, type: !1039, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1069)
!1038 = !DIFile(filename: "apps/538.imagick_r/src/wand/magick-property.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bbad2ace85759dc953cc4f4e915e3231")
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!631, !1041, !748}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickWand", file: !1043, line: 69, baseType: !1044)
!1043 = !DIFile(filename: "apps/538.imagick_r/src/wand/MagickWand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ffc9981fe595b674b5932183b4455d96")
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickWand", file: !1045, line: 50, size: 33280, elements: !1046)
!1045 = !DIFile(filename: "apps/538.imagick_r/src/wand/magick-wand-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "acd9e5d3507eb9a242a35f2a3efc4904")
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1064, !1065, !1066, !1067, !1068}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1044, file: !1045, line: 53, baseType: !626, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1044, file: !1045, line: 56, baseType: !768, size: 32768, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !1044, file: !1045, line: 59, baseType: !1000, size: 64, offset: 32832)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !1044, file: !1045, line: 62, baseType: !861, size: 64, offset: 32896)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_info", scope: !1044, file: !1045, line: 65, baseType: !1052, size: 64, offset: 32960)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantizeInfo", file: !445, line: 57, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantizeInfo", file: !445, line: 35, size: 384, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "number_colors", scope: !1054, file: !445, line: 38, baseType: !626, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "tree_depth", scope: !1054, file: !445, line: 41, baseType: !626, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1054, file: !445, line: 44, baseType: !631, size: 32, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1054, file: !445, line: 47, baseType: !622, size: 32, offset: 160)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "measure_error", scope: !1054, file: !445, line: 50, baseType: !631, size: 32, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1054, file: !445, line: 53, baseType: !626, size: 64, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "dither_method", scope: !1054, file: !445, line: 56, baseType: !1063, size: 32, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "DitherMethod", file: !445, line: 33, baseType: !444)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !1044, file: !1045, line: 68, baseType: !615, size: 64, offset: 33024)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "insert_before", scope: !1044, file: !1045, line: 71, baseType: !631, size: 32, offset: 33088)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "image_pending", scope: !1044, file: !1045, line: 72, baseType: !631, size: 32, offset: 33120)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1044, file: !1045, line: 73, baseType: !631, size: 32, offset: 33152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1044, file: !1045, line: 76, baseType: !626, size: 64, offset: 33216)
!1069 = !{!1070, !1071}
!1070 = !DILocalVariable(name: "wand", arg: 1, scope: !1037, file: !1038, line: 80, type: !1041)
!1071 = !DILocalVariable(name: "artifact", arg: 2, scope: !1037, file: !1038, line: 81, type: !748)
!1072 = !DILocation(line: 0, scope: !1037)
!1073 = !DILocation(line: 85, column: 13, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1037, file: !1038, line: 85, column: 7)
!1075 = !{!1076, !1078, i64 4144}
!1076 = !{!"_MagickWand", !1077, i64 0, !1078, i64 8, !1080, i64 4104, !1080, i64 4112, !1080, i64 4120, !1080, i64 4128, !1078, i64 4136, !1078, i64 4140, !1078, i64 4144, !1077, i64 4152}
!1077 = !{!"long", !1078, i64 0}
!1078 = !{!"omnipotent char", !1079, i64 0}
!1079 = !{!"Simple C/C++ TBAA"}
!1080 = !{!"any pointer", !1078, i64 0}
!1081 = !DILocation(line: 85, column: 19, scope: !1074)
!1082 = !DILocation(line: 85, column: 7, scope: !1037)
!1083 = !DILocation(line: 86, column: 66, scope: !1074)
!1084 = !DILocation(line: 86, column: 12, scope: !1074)
!1085 = !DILocation(line: 86, column: 5, scope: !1074)
!1086 = !DILocation(line: 87, column: 13, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1037, file: !1038, line: 87, column: 7)
!1088 = !{!1076, !1080, i64 4128}
!1089 = !DILocation(line: 87, column: 20, scope: !1087)
!1090 = !DILocation(line: 87, column: 7, scope: !1037)
!1091 = !DILocation(line: 89, column: 41, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1087, file: !1038, line: 88, column: 5)
!1093 = !{!1076, !1080, i64 4104}
!1094 = !DILocation(line: 90, column: 41, scope: !1092)
!1095 = !DILocation(line: 89, column: 14, scope: !1092)
!1096 = !DILocation(line: 91, column: 7, scope: !1092)
!1097 = !DILocation(line: 93, column: 10, scope: !1037)
!1098 = !DILocation(line: 93, column: 3, scope: !1037)
!1099 = !DILocation(line: 94, column: 1, scope: !1037)
!1100 = !DISubprogram(name: "LogMagickEvent", scope: !452, file: !452, line: 83, type: !1101, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!631, !1103, !748, !748, !921, !748, null}
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !452, line: 58, baseType: !451)
!1105 = !{}
!1106 = !DISubprogram(name: "ThrowMagickException", scope: !10, file: !10, line: 156, type: !1107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!631, !1000, !748, !748, !921, !1109, !748, !748, null}
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!1110 = !DISubprogram(name: "DeleteImageArtifact", scope: !1111, file: !1111, line: 35, type: !1112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1111 = !DIFile(filename: "apps/538.imagick_r/src/magick/artifact.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2fff4b6fe3176ac9e10f3231e40b4948")
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!631, !615, !748}
!1114 = distinct !DISubprogram(name: "MagickDeleteImageProperty", scope: !1038, file: !1038, line: 121, type: !1039, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1115)
!1115 = !{!1116, !1117}
!1116 = !DILocalVariable(name: "wand", arg: 1, scope: !1114, file: !1038, line: 121, type: !1041)
!1117 = !DILocalVariable(name: "property", arg: 2, scope: !1114, file: !1038, line: 122, type: !748)
!1118 = !DILocation(line: 0, scope: !1114)
!1119 = !DILocation(line: 126, column: 13, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1114, file: !1038, line: 126, column: 7)
!1121 = !DILocation(line: 126, column: 19, scope: !1120)
!1122 = !DILocation(line: 126, column: 7, scope: !1114)
!1123 = !DILocation(line: 127, column: 66, scope: !1120)
!1124 = !DILocation(line: 127, column: 12, scope: !1120)
!1125 = !DILocation(line: 127, column: 5, scope: !1120)
!1126 = !DILocation(line: 128, column: 13, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1114, file: !1038, line: 128, column: 7)
!1128 = !DILocation(line: 128, column: 20, scope: !1127)
!1129 = !DILocation(line: 128, column: 7, scope: !1114)
!1130 = !DILocation(line: 130, column: 41, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1127, file: !1038, line: 129, column: 5)
!1132 = !DILocation(line: 131, column: 41, scope: !1131)
!1133 = !DILocation(line: 130, column: 14, scope: !1131)
!1134 = !DILocation(line: 132, column: 7, scope: !1131)
!1135 = !DILocation(line: 134, column: 10, scope: !1114)
!1136 = !DILocation(line: 134, column: 3, scope: !1114)
!1137 = !DILocation(line: 135, column: 1, scope: !1114)
!1138 = !DISubprogram(name: "DeleteImageProperty", scope: !1139, file: !1139, line: 37, type: !1112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1139 = !DIFile(filename: "apps/538.imagick_r/src/magick/property.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "517489a50b093ded1c4a01c3e2b58c3c")
!1140 = distinct !DISubprogram(name: "MagickDeleteOption", scope: !1038, file: !1038, line: 162, type: !1039, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1141)
!1141 = !{!1142, !1143}
!1142 = !DILocalVariable(name: "wand", arg: 1, scope: !1140, file: !1038, line: 162, type: !1041)
!1143 = !DILocalVariable(name: "option", arg: 2, scope: !1140, file: !1038, line: 163, type: !748)
!1144 = !DILocation(line: 0, scope: !1140)
!1145 = !DILocation(line: 167, column: 13, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1140, file: !1038, line: 167, column: 7)
!1147 = !DILocation(line: 167, column: 19, scope: !1146)
!1148 = !DILocation(line: 167, column: 7, scope: !1140)
!1149 = !DILocation(line: 168, column: 66, scope: !1146)
!1150 = !DILocation(line: 168, column: 12, scope: !1146)
!1151 = !DILocation(line: 168, column: 5, scope: !1146)
!1152 = !DILocation(line: 169, column: 34, scope: !1140)
!1153 = !{!1076, !1080, i64 4112}
!1154 = !DILocation(line: 169, column: 10, scope: !1140)
!1155 = !DILocation(line: 169, column: 3, scope: !1140)
!1156 = !DISubprogram(name: "DeleteImageOption", scope: !477, file: !477, line: 163, type: !1157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!631, !861, !748}
!1159 = distinct !DISubprogram(name: "MagickGetAntialias", scope: !1038, file: !1038, line: 195, type: !1160, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1164)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!631, !1162}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1164 = !{!1165}
!1165 = !DILocalVariable(name: "wand", arg: 1, scope: !1159, file: !1038, line: 195, type: !1162)
!1166 = !DILocation(line: 0, scope: !1159)
!1167 = !DILocation(line: 199, column: 13, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1159, file: !1038, line: 199, column: 7)
!1169 = !DILocation(line: 199, column: 19, scope: !1168)
!1170 = !DILocation(line: 199, column: 7, scope: !1159)
!1171 = !DILocation(line: 200, column: 66, scope: !1168)
!1172 = !DILocation(line: 200, column: 12, scope: !1168)
!1173 = !DILocation(line: 200, column: 5, scope: !1168)
!1174 = !DILocation(line: 201, column: 16, scope: !1159)
!1175 = !DILocation(line: 201, column: 28, scope: !1159)
!1176 = !{!1177, !1078, i64 20}
!1177 = !{!"_ImageInfo", !1078, i64 0, !1078, i64 4, !1078, i64 8, !1078, i64 12, !1078, i64 16, !1078, i64 20, !1080, i64 24, !1080, i64 32, !1080, i64 40, !1080, i64 48, !1077, i64 56, !1077, i64 64, !1077, i64 72, !1078, i64 80, !1078, i64 84, !1078, i64 88, !1077, i64 96, !1080, i64 104, !1080, i64 112, !1080, i64 120, !1080, i64 128, !1080, i64 136, !1178, i64 144, !1178, i64 152, !1179, i64 160, !1179, i64 168, !1179, i64 176, !1078, i64 184, !1078, i64 188, !1077, i64 192, !1078, i64 200, !1078, i64 204, !1078, i64 208, !1077, i64 216, !1078, i64 224, !1078, i64 228, !1080, i64 232, !1080, i64 240, !1078, i64 248, !1080, i64 256, !1080, i64 264, !1080, i64 272, !1080, i64 280, !1080, i64 288, !1080, i64 296, !1080, i64 304, !1080, i64 312, !1077, i64 320, !1078, i64 328, !1078, i64 4424, !1078, i64 8520, !1078, i64 12616, !1078, i64 16712, !1080, i64 16720, !1077, i64 16728, !1077, i64 16736, !1179, i64 16744, !1077, i64 16752, !1078, i64 16760, !1179, i64 16764, !1080, i64 16776, !1078, i64 16784}
!1178 = !{!"double", !1078, i64 0}
!1179 = !{!"_PixelPacket", !1180, i64 0, !1180, i64 2, !1180, i64 4, !1180, i64 6}
!1180 = !{!"short", !1078, i64 0}
!1181 = !DILocation(line: 201, column: 3, scope: !1159)
!1182 = distinct !DISubprogram(name: "MagickGetBackgroundColor", scope: !1038, file: !1038, line: 226, type: !1183, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1189)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!1185, !1041}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelWand", file: !1187, line: 26, baseType: !1188)
!1187 = !DIFile(filename: "apps/538.imagick_r/src/wand/pixel-wand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3c7d71f46771b27e3f74acd989c109c4")
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelWand", file: !1187, line: 25, flags: DIFlagFwdDecl)
!1189 = !{!1190, !1191}
!1190 = !DILocalVariable(name: "wand", arg: 1, scope: !1182, file: !1038, line: 226, type: !1041)
!1191 = !DILocalVariable(name: "background_color", scope: !1182, file: !1038, line: 229, type: !1185)
!1192 = !DILocation(line: 0, scope: !1182)
!1193 = !DILocation(line: 233, column: 13, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1182, file: !1038, line: 233, column: 7)
!1195 = !DILocation(line: 233, column: 19, scope: !1194)
!1196 = !DILocation(line: 233, column: 7, scope: !1182)
!1197 = !DILocation(line: 234, column: 66, scope: !1194)
!1198 = !DILocation(line: 234, column: 12, scope: !1194)
!1199 = !DILocation(line: 234, column: 5, scope: !1194)
!1200 = !DILocation(line: 235, column: 20, scope: !1182)
!1201 = !DILocation(line: 236, column: 48, scope: !1182)
!1202 = !DILocation(line: 236, column: 60, scope: !1182)
!1203 = !DILocation(line: 236, column: 3, scope: !1182)
!1204 = !DILocation(line: 237, column: 3, scope: !1182)
!1205 = !DISubprogram(name: "NewPixelWand", scope: !1187, file: !1187, line: 62, type: !1206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!1185}
!1208 = !DISubprogram(name: "PixelSetQuantumColor", scope: !1187, file: !1187, line: 104, type: !1209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null, !1185, !1211}
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!1213 = distinct !DISubprogram(name: "MagickGetColorspace", scope: !1038, file: !1038, line: 262, type: !1214, scopeLine: 263, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1216)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!622, !1041}
!1216 = !{!1217}
!1217 = !DILocalVariable(name: "wand", arg: 1, scope: !1213, file: !1038, line: 262, type: !1041)
!1218 = !DILocation(line: 0, scope: !1213)
!1219 = !DILocation(line: 266, column: 13, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1213, file: !1038, line: 266, column: 7)
!1221 = !DILocation(line: 266, column: 19, scope: !1220)
!1222 = !DILocation(line: 266, column: 7, scope: !1213)
!1223 = !DILocation(line: 267, column: 66, scope: !1220)
!1224 = !DILocation(line: 267, column: 12, scope: !1220)
!1225 = !DILocation(line: 267, column: 5, scope: !1220)
!1226 = !DILocation(line: 268, column: 16, scope: !1213)
!1227 = !DILocation(line: 268, column: 28, scope: !1213)
!1228 = !{!1177, !1078, i64 200}
!1229 = !DILocation(line: 268, column: 3, scope: !1213)
!1230 = distinct !DISubprogram(name: "MagickGetCompression", scope: !1038, file: !1038, line: 293, type: !1231, scopeLine: 294, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1233)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!624, !1041}
!1233 = !{!1234}
!1234 = !DILocalVariable(name: "wand", arg: 1, scope: !1230, file: !1038, line: 293, type: !1041)
!1235 = !DILocation(line: 0, scope: !1230)
!1236 = !DILocation(line: 297, column: 13, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1230, file: !1038, line: 297, column: 7)
!1238 = !DILocation(line: 297, column: 19, scope: !1237)
!1239 = !DILocation(line: 297, column: 7, scope: !1230)
!1240 = !DILocation(line: 298, column: 66, scope: !1237)
!1241 = !DILocation(line: 298, column: 12, scope: !1237)
!1242 = !DILocation(line: 298, column: 5, scope: !1237)
!1243 = !DILocation(line: 299, column: 16, scope: !1230)
!1244 = !DILocation(line: 299, column: 28, scope: !1230)
!1245 = !{!1177, !1078, i64 0}
!1246 = !DILocation(line: 299, column: 3, scope: !1230)
!1247 = distinct !DISubprogram(name: "MagickGetCompressionQuality", scope: !1038, file: !1038, line: 324, type: !1248, scopeLine: 325, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1250)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!626, !1041}
!1250 = !{!1251}
!1251 = !DILocalVariable(name: "wand", arg: 1, scope: !1247, file: !1038, line: 324, type: !1041)
!1252 = !DILocation(line: 0, scope: !1247)
!1253 = !DILocation(line: 328, column: 13, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1247, file: !1038, line: 328, column: 7)
!1255 = !DILocation(line: 328, column: 19, scope: !1254)
!1256 = !DILocation(line: 328, column: 7, scope: !1247)
!1257 = !DILocation(line: 329, column: 66, scope: !1254)
!1258 = !DILocation(line: 329, column: 12, scope: !1254)
!1259 = !DILocation(line: 329, column: 5, scope: !1254)
!1260 = !DILocation(line: 330, column: 16, scope: !1247)
!1261 = !DILocation(line: 330, column: 28, scope: !1247)
!1262 = !{!1177, !1077, i64 96}
!1263 = !DILocation(line: 330, column: 3, scope: !1247)
!1264 = distinct !DISubprogram(name: "MagickGetCopyright", scope: !1038, file: !1038, line: 352, type: !1265, scopeLine: 353, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1105)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!748}
!1267 = !DILocation(line: 354, column: 10, scope: !1264)
!1268 = !DILocation(line: 354, column: 3, scope: !1264)
!1269 = !DISubprogram(name: "GetMagickCopyright", scope: !1270, file: !1270, line: 94, type: !1265, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1270 = !DIFile(filename: "apps/538.imagick_r/src/magick/version.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5bbd8280cb91779d444e54bd210c3e35")
!1271 = distinct !DISubprogram(name: "MagickGetFilename", scope: !1038, file: !1038, line: 379, type: !1272, scopeLine: 380, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1274)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!674, !1162}
!1274 = !{!1275}
!1275 = !DILocalVariable(name: "wand", arg: 1, scope: !1271, file: !1038, line: 379, type: !1162)
!1276 = !DILocation(line: 0, scope: !1271)
!1277 = !DILocation(line: 383, column: 13, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1271, file: !1038, line: 383, column: 7)
!1279 = !DILocation(line: 383, column: 19, scope: !1278)
!1280 = !DILocation(line: 383, column: 7, scope: !1271)
!1281 = !DILocation(line: 384, column: 66, scope: !1278)
!1282 = !DILocation(line: 384, column: 12, scope: !1278)
!1283 = !DILocation(line: 384, column: 5, scope: !1278)
!1284 = !DILocation(line: 385, column: 30, scope: !1271)
!1285 = !DILocation(line: 385, column: 42, scope: !1271)
!1286 = !DILocation(line: 385, column: 10, scope: !1271)
!1287 = !DILocation(line: 385, column: 3, scope: !1271)
!1288 = !DISubprogram(name: "AcquireString", scope: !842, file: !842, line: 43, type: !1289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!674, !748}
!1291 = distinct !DISubprogram(name: "MagickGetFont", scope: !1038, file: !1038, line: 410, type: !1292, scopeLine: 411, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1294)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!674, !1041}
!1294 = !{!1295}
!1295 = !DILocalVariable(name: "wand", arg: 1, scope: !1291, file: !1038, line: 410, type: !1041)
!1296 = !DILocation(line: 0, scope: !1291)
!1297 = !DILocation(line: 414, column: 13, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1291, file: !1038, line: 414, column: 7)
!1299 = !DILocation(line: 414, column: 19, scope: !1298)
!1300 = !DILocation(line: 414, column: 7, scope: !1291)
!1301 = !DILocation(line: 415, column: 66, scope: !1298)
!1302 = !DILocation(line: 415, column: 12, scope: !1298)
!1303 = !DILocation(line: 415, column: 5, scope: !1298)
!1304 = !DILocation(line: 416, column: 13, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1291, file: !1038, line: 416, column: 7)
!1306 = !DILocation(line: 416, column: 25, scope: !1305)
!1307 = !{!1177, !1080, i64 120}
!1308 = !DILocation(line: 416, column: 30, scope: !1305)
!1309 = !DILocation(line: 416, column: 7, scope: !1291)
!1310 = !DILocation(line: 418, column: 10, scope: !1291)
!1311 = !DILocation(line: 418, column: 3, scope: !1291)
!1312 = !DILocation(line: 419, column: 1, scope: !1291)
!1313 = distinct !DISubprogram(name: "MagickGetFormat", scope: !1038, file: !1038, line: 443, type: !1292, scopeLine: 444, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1314)
!1314 = !{!1315}
!1315 = !DILocalVariable(name: "wand", arg: 1, scope: !1313, file: !1038, line: 443, type: !1041)
!1316 = !DILocation(line: 0, scope: !1313)
!1317 = !DILocation(line: 447, column: 13, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1313, file: !1038, line: 447, column: 7)
!1319 = !DILocation(line: 447, column: 19, scope: !1318)
!1320 = !DILocation(line: 447, column: 7, scope: !1313)
!1321 = !DILocation(line: 448, column: 66, scope: !1318)
!1322 = !DILocation(line: 448, column: 12, scope: !1318)
!1323 = !DILocation(line: 448, column: 5, scope: !1318)
!1324 = !DILocation(line: 449, column: 30, scope: !1313)
!1325 = !DILocation(line: 449, column: 42, scope: !1313)
!1326 = !DILocation(line: 449, column: 10, scope: !1313)
!1327 = !DILocation(line: 449, column: 3, scope: !1313)
!1328 = distinct !DISubprogram(name: "MagickGetGravity", scope: !1038, file: !1038, line: 474, type: !1329, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1331)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!706, !1041}
!1331 = !{!1332, !1333, !1334}
!1332 = !DILocalVariable(name: "wand", arg: 1, scope: !1328, file: !1038, line: 474, type: !1041)
!1333 = !DILocalVariable(name: "option", scope: !1328, file: !1038, line: 477, type: !748)
!1334 = !DILocalVariable(name: "type", scope: !1328, file: !1038, line: 480, type: !706)
!1335 = !DILocation(line: 0, scope: !1328)
!1336 = !DILocation(line: 484, column: 13, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1328, file: !1038, line: 484, column: 7)
!1338 = !DILocation(line: 484, column: 19, scope: !1337)
!1339 = !DILocation(line: 484, column: 7, scope: !1328)
!1340 = !DILocation(line: 485, column: 66, scope: !1337)
!1341 = !DILocation(line: 485, column: 12, scope: !1337)
!1342 = !DILocation(line: 485, column: 5, scope: !1337)
!1343 = !DILocation(line: 486, column: 31, scope: !1328)
!1344 = !DILocation(line: 486, column: 10, scope: !1328)
!1345 = !DILocation(line: 487, column: 14, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1328, file: !1038, line: 487, column: 7)
!1347 = !DILocation(line: 487, column: 7, scope: !1328)
!1348 = !DILocation(line: 489, column: 22, scope: !1328)
!1349 = !DILocation(line: 489, column: 8, scope: !1328)
!1350 = !DILocation(line: 490, column: 3, scope: !1328)
!1351 = !DILocation(line: 491, column: 1, scope: !1328)
!1352 = !DISubprogram(name: "GetImageOption", scope: !477, file: !477, line: 158, type: !1353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!748, !998, !748}
!1355 = !DISubprogram(name: "ParseCommandOption", scope: !477, file: !477, line: 172, type: !1356, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!679, !1358, !1360, !748}
!1358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1359)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "CommandOption", file: !477, line: 99, baseType: !476)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!1361 = distinct !DISubprogram(name: "MagickGetHomeURL", scope: !1038, file: !1038, line: 511, type: !1362, scopeLine: 512, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1105)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!674}
!1364 = !DILocation(line: 513, column: 10, scope: !1361)
!1365 = !DILocation(line: 513, column: 3, scope: !1361)
!1366 = !DISubprogram(name: "GetMagickHomeURL", scope: !1270, file: !1270, line: 91, type: !1362, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1367 = distinct !DISubprogram(name: "MagickGetImageArtifact", scope: !1038, file: !1038, line: 542, type: !1368, scopeLine: 543, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1370)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!674, !1041, !748}
!1370 = !{!1371, !1372, !1373}
!1371 = !DILocalVariable(name: "wand", arg: 1, scope: !1367, file: !1038, line: 542, type: !1041)
!1372 = !DILocalVariable(name: "artifact", arg: 2, scope: !1367, file: !1038, line: 542, type: !748)
!1373 = !DILocalVariable(name: "value", scope: !1367, file: !1038, line: 545, type: !748)
!1374 = !DILocation(line: 0, scope: !1367)
!1375 = !DILocation(line: 549, column: 13, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1367, file: !1038, line: 549, column: 7)
!1377 = !DILocation(line: 549, column: 19, scope: !1376)
!1378 = !DILocation(line: 549, column: 7, scope: !1367)
!1379 = !DILocation(line: 550, column: 66, scope: !1376)
!1380 = !DILocation(line: 550, column: 12, scope: !1376)
!1381 = !DILocation(line: 550, column: 5, scope: !1376)
!1382 = !DILocation(line: 551, column: 13, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1367, file: !1038, line: 551, column: 7)
!1384 = !DILocation(line: 551, column: 20, scope: !1383)
!1385 = !DILocation(line: 551, column: 7, scope: !1367)
!1386 = !DILocation(line: 553, column: 41, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1383, file: !1038, line: 552, column: 5)
!1388 = !DILocation(line: 554, column: 41, scope: !1387)
!1389 = !DILocation(line: 553, column: 14, scope: !1387)
!1390 = !DILocation(line: 555, column: 7, scope: !1387)
!1391 = !DILocation(line: 557, column: 9, scope: !1367)
!1392 = !DILocation(line: 558, column: 13, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1367, file: !1038, line: 558, column: 7)
!1394 = !DILocation(line: 558, column: 7, scope: !1367)
!1395 = !DILocation(line: 560, column: 10, scope: !1367)
!1396 = !DILocation(line: 560, column: 3, scope: !1367)
!1397 = !DILocation(line: 561, column: 1, scope: !1367)
!1398 = !DISubprogram(name: "GetImageArtifact", scope: !1111, file: !1111, line: 30, type: !1399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!748, !917, !748}
!1401 = !DISubprogram(name: "ConstantString", scope: !842, file: !842, line: 45, type: !1289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1402 = distinct !DISubprogram(name: "MagickGetImageArtifacts", scope: !1038, file: !1038, line: 593, type: !1403, scopeLine: 595, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1406)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!835, !1041, !748, !1405}
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!1406 = !{!1407, !1408, !1409, !1410, !1411, !1412, !1413}
!1407 = !DILocalVariable(name: "wand", arg: 1, scope: !1402, file: !1038, line: 593, type: !1041)
!1408 = !DILocalVariable(name: "pattern", arg: 2, scope: !1402, file: !1038, line: 594, type: !748)
!1409 = !DILocalVariable(name: "number_artifacts", arg: 3, scope: !1402, file: !1038, line: 594, type: !1405)
!1410 = !DILocalVariable(name: "artifacts", scope: !1402, file: !1038, line: 597, type: !835)
!1411 = !DILocalVariable(name: "artifact", scope: !1402, file: !1038, line: 600, type: !748)
!1412 = !DILocalVariable(name: "i", scope: !1402, file: !1038, line: 603, type: !679)
!1413 = !DILocalVariable(name: "length", scope: !1402, file: !1038, line: 606, type: !626)
!1414 = !DILocation(line: 0, scope: !1402)
!1415 = !DILocation(line: 610, column: 13, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1402, file: !1038, line: 610, column: 7)
!1417 = !DILocation(line: 610, column: 19, scope: !1416)
!1418 = !DILocation(line: 610, column: 7, scope: !1402)
!1419 = !DILocation(line: 611, column: 66, scope: !1416)
!1420 = !DILocation(line: 611, column: 12, scope: !1416)
!1421 = !DILocation(line: 611, column: 5, scope: !1416)
!1422 = !DILocation(line: 612, column: 13, scope: !1423)
!1423 = distinct !DILexicalBlock(scope: !1402, file: !1038, line: 612, column: 7)
!1424 = !DILocation(line: 612, column: 20, scope: !1423)
!1425 = !DILocation(line: 612, column: 7, scope: !1402)
!1426 = !DILocation(line: 614, column: 41, scope: !1427)
!1427 = distinct !DILexicalBlock(scope: !1423, file: !1038, line: 613, column: 5)
!1428 = !DILocation(line: 615, column: 41, scope: !1427)
!1429 = !DILocation(line: 614, column: 14, scope: !1427)
!1430 = !DILocation(line: 616, column: 7, scope: !1427)
!1431 = !DILocation(line: 618, column: 10, scope: !1402)
!1432 = !DILocation(line: 620, column: 23, scope: !1402)
!1433 = !DILocation(line: 621, column: 17, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1402, file: !1038, line: 621, column: 7)
!1435 = !DILocation(line: 621, column: 7, scope: !1402)
!1436 = !DILocation(line: 623, column: 36, scope: !1402)
!1437 = !DILocation(line: 623, column: 3, scope: !1402)
!1438 = !DILocation(line: 624, column: 39, scope: !1402)
!1439 = !DILocation(line: 624, column: 12, scope: !1402)
!1440 = !DILocation(line: 625, column: 22, scope: !1441)
!1441 = distinct !DILexicalBlock(scope: !1442, file: !1038, line: 625, column: 3)
!1442 = distinct !DILexicalBlock(scope: !1402, file: !1038, line: 625, column: 3)
!1443 = !DILocation(line: 625, column: 3, scope: !1442)
!1444 = !DILocation(line: 627, column: 10, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1446, file: !1038, line: 627, column: 9)
!1446 = distinct !DILexicalBlock(scope: !1441, file: !1038, line: 626, column: 3)
!1447 = !{!1078, !1078, i64 0}
!1448 = !DILocation(line: 627, column: 20, scope: !1445)
!1449 = !DILocation(line: 627, column: 28, scope: !1445)
!1450 = !DILocation(line: 628, column: 10, scope: !1445)
!1451 = !DILocation(line: 628, column: 55, scope: !1445)
!1452 = !DILocation(line: 627, column: 9, scope: !1446)
!1453 = !DILocation(line: 630, column: 15, scope: !1454)
!1454 = distinct !DILexicalBlock(scope: !1455, file: !1038, line: 630, column: 13)
!1455 = distinct !DILexicalBlock(scope: !1445, file: !1038, line: 629, column: 7)
!1456 = !DILocation(line: 630, column: 19, scope: !1454)
!1457 = !DILocation(line: 630, column: 13, scope: !1455)
!1458 = !DILocation(line: 632, column: 19, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !1454, file: !1038, line: 631, column: 11)
!1460 = !DILocation(line: 633, column: 33, scope: !1459)
!1461 = !DILocation(line: 635, column: 27, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1459, file: !1038, line: 635, column: 17)
!1463 = !DILocation(line: 635, column: 17, scope: !1459)
!1464 = !DILocation(line: 637, column: 51, scope: !1465)
!1465 = distinct !DILexicalBlock(scope: !1462, file: !1038, line: 636, column: 15)
!1466 = !DILocation(line: 639, column: 25, scope: !1465)
!1467 = !DILocation(line: 637, column: 24, scope: !1465)
!1468 = !DILocation(line: 640, column: 17, scope: !1465)
!1469 = !DILocation(line: 643, column: 22, scope: !1455)
!1470 = !DILocation(line: 643, column: 9, scope: !1455)
!1471 = !DILocation(line: 643, column: 21, scope: !1455)
!1472 = !{!1080, !1080, i64 0}
!1473 = !DILocation(line: 645, column: 7, scope: !1455)
!1474 = !DILocation(line: 0, scope: !1442)
!1475 = !DILocation(line: 646, column: 41, scope: !1446)
!1476 = !DILocation(line: 646, column: 14, scope: !1446)
!1477 = distinct !{!1477, !1443, !1478, !1479, !1480}
!1478 = !DILocation(line: 647, column: 3, scope: !1442)
!1479 = !{!"llvm.loop.mustprogress"}
!1480 = !{!"llvm.loop.unroll.disable"}
!1481 = !DILocation(line: 648, column: 3, scope: !1402)
!1482 = !DILocation(line: 648, column: 15, scope: !1402)
!1483 = !DILocation(line: 649, column: 20, scope: !1402)
!1484 = !{!1077, !1077, i64 0}
!1485 = !DILocation(line: 650, column: 3, scope: !1402)
!1486 = !DILocation(line: 651, column: 1, scope: !1402)
!1487 = !DISubprogram(name: "GetImageProperty", scope: !1139, file: !1139, line: 31, type: !1399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1488 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1489, file: !1489, line: 42, type: !1490, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1489 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!670, !921, !921}
!1492 = !DISubprogram(name: "ResetImagePropertyIterator", scope: !1139, file: !1139, line: 44, type: !1493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{null, !917}
!1495 = !DISubprogram(name: "GetNextImageProperty", scope: !1139, file: !1139, line: 26, type: !1496, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!674, !917}
!1498 = !DISubprogram(name: "GlobExpression", scope: !1499, file: !1499, line: 36, type: !1500, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1499 = !DIFile(filename: "apps/538.imagick_r/src/magick/token.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f90c1544ca665b41425c6912f2cbc1e4")
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!631, !748, !748, !1360}
!1502 = !DISubprogram(name: "ResizeQuantumMemory", scope: !1489, file: !1489, line: 55, type: !1503, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!670, !670, !921, !921}
!1505 = distinct !DISubprogram(name: "MagickGetImageProfile", scope: !1038, file: !1038, line: 680, type: !1506, scopeLine: 682, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1508)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!803, !1041, !748, !1405}
!1508 = !{!1509, !1510, !1511, !1512, !1515}
!1509 = !DILocalVariable(name: "wand", arg: 1, scope: !1505, file: !1038, line: 680, type: !1041)
!1510 = !DILocalVariable(name: "name", arg: 2, scope: !1505, file: !1038, line: 681, type: !748)
!1511 = !DILocalVariable(name: "length", arg: 3, scope: !1505, file: !1038, line: 681, type: !1405)
!1512 = !DILocalVariable(name: "profile", scope: !1505, file: !1038, line: 684, type: !1513)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !841)
!1515 = !DILocalVariable(name: "datum", scope: !1505, file: !1038, line: 687, type: !803)
!1516 = !DILocation(line: 0, scope: !1505)
!1517 = !DILocation(line: 691, column: 13, scope: !1518)
!1518 = distinct !DILexicalBlock(scope: !1505, file: !1038, line: 691, column: 7)
!1519 = !DILocation(line: 691, column: 19, scope: !1518)
!1520 = !DILocation(line: 691, column: 7, scope: !1505)
!1521 = !DILocation(line: 692, column: 66, scope: !1518)
!1522 = !DILocation(line: 692, column: 12, scope: !1518)
!1523 = !DILocation(line: 692, column: 5, scope: !1518)
!1524 = !DILocation(line: 693, column: 13, scope: !1525)
!1525 = distinct !DILexicalBlock(scope: !1505, file: !1038, line: 693, column: 7)
!1526 = !DILocation(line: 693, column: 20, scope: !1525)
!1527 = !DILocation(line: 693, column: 7, scope: !1505)
!1528 = !DILocation(line: 695, column: 41, scope: !1529)
!1529 = distinct !DILexicalBlock(scope: !1525, file: !1038, line: 694, column: 5)
!1530 = !DILocation(line: 696, column: 41, scope: !1529)
!1531 = !DILocation(line: 695, column: 14, scope: !1529)
!1532 = !DILocation(line: 697, column: 7, scope: !1529)
!1533 = !DILocation(line: 699, column: 10, scope: !1505)
!1534 = !DILocation(line: 700, column: 21, scope: !1535)
!1535 = distinct !DILexicalBlock(scope: !1505, file: !1038, line: 700, column: 7)
!1536 = !{!1537, !1080, i64 216}
!1537 = !{!"_Image", !1078, i64 0, !1078, i64 4, !1078, i64 8, !1077, i64 16, !1078, i64 24, !1078, i64 28, !1078, i64 32, !1077, i64 40, !1077, i64 48, !1077, i64 56, !1077, i64 64, !1080, i64 72, !1179, i64 80, !1179, i64 88, !1179, i64 96, !1178, i64 104, !1538, i64 112, !1078, i64 208, !1080, i64 216, !1078, i64 224, !1080, i64 232, !1080, i64 240, !1080, i64 248, !1077, i64 256, !1178, i64 264, !1178, i64 272, !1540, i64 280, !1540, i64 312, !1540, i64 344, !1178, i64 376, !1178, i64 384, !1178, i64 392, !1078, i64 400, !1078, i64 404, !1078, i64 408, !1078, i64 412, !1078, i64 416, !1078, i64 420, !1080, i64 424, !1077, i64 432, !1077, i64 440, !1077, i64 448, !1077, i64 456, !1077, i64 464, !1077, i64 472, !1541, i64 480, !1542, i64 504, !1080, i64 568, !1080, i64 576, !1080, i64 584, !1080, i64 592, !1080, i64 600, !1080, i64 608, !1078, i64 616, !1078, i64 4712, !1078, i64 8808, !1077, i64 12904, !1077, i64 12912, !1544, i64 12920, !1078, i64 12976, !1077, i64 12984, !1080, i64 12992, !1546, i64 13000, !1546, i64 13032, !1080, i64 13064, !1077, i64 13072, !1077, i64 13080, !1080, i64 13088, !1080, i64 13096, !1080, i64 13104, !1078, i64 13112, !1078, i64 13116, !1179, i64 13120, !1080, i64 13128, !1540, i64 13136, !1080, i64 13168, !1080, i64 13176, !1078, i64 13184, !1078, i64 13188, !1547, i64 13192, !1078, i64 13200, !1077, i64 13208, !1077, i64 13216, !1078, i64 13224, !1077, i64 13232}
!1538 = !{!"_ChromaticityInfo", !1539, i64 0, !1539, i64 24, !1539, i64 48, !1539, i64 72}
!1539 = !{!"_PrimaryInfo", !1178, i64 0, !1178, i64 8, !1178, i64 16}
!1540 = !{!"_RectangleInfo", !1077, i64 0, !1077, i64 8, !1077, i64 16, !1077, i64 24}
!1541 = !{!"_ErrorInfo", !1178, i64 0, !1178, i64 8, !1178, i64 16}
!1542 = !{!"_TimerInfo", !1543, i64 0, !1543, i64 24, !1078, i64 48, !1077, i64 56}
!1543 = !{!"_Timer", !1178, i64 0, !1178, i64 8, !1178, i64 16}
!1544 = !{!"_ExceptionInfo", !1078, i64 0, !1545, i64 4, !1080, i64 8, !1080, i64 16, !1080, i64 24, !1078, i64 32, !1080, i64 40, !1077, i64 48}
!1545 = !{!"int", !1078, i64 0}
!1546 = !{!"_ProfileInfo", !1080, i64 0, !1077, i64 8, !1080, i64 16, !1077, i64 24}
!1547 = !{!"long long", !1078, i64 0}
!1548 = !DILocation(line: 700, column: 30, scope: !1535)
!1549 = !DILocation(line: 700, column: 7, scope: !1505)
!1550 = !DILocation(line: 702, column: 11, scope: !1505)
!1551 = !DILocation(line: 703, column: 15, scope: !1552)
!1552 = distinct !DILexicalBlock(scope: !1505, file: !1038, line: 703, column: 7)
!1553 = !DILocation(line: 703, column: 7, scope: !1505)
!1554 = !DILocation(line: 705, column: 48, scope: !1505)
!1555 = !DILocation(line: 705, column: 27, scope: !1505)
!1556 = !DILocation(line: 707, column: 13, scope: !1557)
!1557 = distinct !DILexicalBlock(scope: !1505, file: !1038, line: 707, column: 7)
!1558 = !DILocation(line: 707, column: 7, scope: !1505)
!1559 = !DILocation(line: 709, column: 33, scope: !1505)
!1560 = !DILocation(line: 710, column: 5, scope: !1505)
!1561 = !DILocation(line: 709, column: 10, scope: !1505)
!1562 = !DILocation(line: 711, column: 20, scope: !1505)
!1563 = !DILocation(line: 711, column: 10, scope: !1505)
!1564 = !DILocation(line: 712, column: 3, scope: !1505)
!1565 = !DILocation(line: 713, column: 1, scope: !1505)
!1566 = !DISubprogram(name: "GetImageProfile", scope: !252, file: !252, line: 55, type: !1567, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!1513, !917, !748}
!1569 = !DISubprogram(name: "GetStringInfoLength", scope: !842, file: !842, line: 80, type: !1570, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!626, !1513}
!1572 = !DISubprogram(name: "CopyMagickMemory", scope: !1489, file: !1489, line: 44, type: !1573, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!670, !670, !919, !921}
!1575 = !DISubprogram(name: "GetStringInfoDatum", scope: !842, file: !842, line: 97, type: !1576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1105)
!1576 = !DISubroutineType(types: !1577)
!1577 = !{!803, !1513}
!1578 = distinct !DISubprogram(name: "MagickGetImageProfiles", scope: !1038, file: !1038, line: 745, type: !1403, scopeLine: 747, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1579)
!1579 = !{!1580, !1581, !1582, !1583, !1584, !1585, !1586}
!1580 = !DILocalVariable(name: "wand", arg: 1, scope: !1578, file: !1038, line: 745, type: !1041)
!1581 = !DILocalVariable(name: "pattern", arg: 2, scope: !1578, file: !1038, line: 745, type: !748)
!1582 = !DILocalVariable(name: "number_profiles", arg: 3, scope: !1578, file: !1038, line: 746, type: !1405)
!1583 = !DILocalVariable(name: "profiles", scope: !1578, file: !1038, line: 749, type: !835)
!1584 = !DILocalVariable(name: "property", scope: !1578, file: !1038, line: 752, type: !748)
!1585 = !DILocalVariable(name: "i", scope: !1578, file: !1038, line: 755, type: !679)
!1586 = !DILocalVariable(name: "length", scope: !1578, file: !1038, line: 758, type: !626)
!1587 = !DILocation(line: 0, scope: !1578)
!1588 = !DILocation(line: 762, column: 13, scope: !1589)
!1589 = distinct !DILexicalBlock(scope: !1578, file: !1038, line: 762, column: 7)
!1590 = !DILocation(line: 762, column: 19, scope: !1589)
!1591 = !DILocation(line: 762, column: 7, scope: !1578)
!1592 = !DILocation(line: 763, column: 66, scope: !1589)
!1593 = !DILocation(line: 763, column: 12, scope: !1589)
!1594 = !DILocation(line: 763, column: 5, scope: !1589)
!1595 = !DILocation(line: 764, column: 13, scope: !1596)
!1596 = distinct !DILexicalBlock(scope: !1578, file: !1038, line: 764, column: 7)
!1597 = !DILocation(line: 764, column: 20, scope: !1596)
!1598 = !DILocation(line: 764, column: 7, scope: !1578)
