; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/wand/magick-wand.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/wand/magick-wand.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagickWand = type { i64, [4096 x i8], ptr, ptr, ptr, ptr, i32, i32, i32, i64 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._ConfigureInfo = type { ptr, ptr, ptr, i32, i32, ptr, ptr, i64 }
%struct._TypeMetric = type { %struct._PointInfo, double, double, double, double, double, double, double, %struct._SegmentInfo, %struct._PointInfo }
%struct._SegmentInfo = type { double, double, double, double }
%struct._PointInfo = type { double, double }
%struct._DrawInfo = type { ptr, ptr, %struct._RectangleInfo, %struct._AffineMatrix, i32, %struct._PixelPacket, %struct._PixelPacket, double, %struct._GradientInfo, ptr, ptr, ptr, i32, i32, i32, i32, i32, i64, double, i32, i32, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, double, ptr, i32, %struct._PixelPacket, %struct._PixelPacket, ptr, ptr, ptr, %struct._SegmentInfo, i32, i16, i32, %struct._ElementReference, i32, i64, double, double, double, i32 }
%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._AffineMatrix = type { double, double, double, double, double, double }

!476 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 70, baseType: !5, size: 32, elements: !478)
!477 = !DIFile(filename: "apps/538.imagick_r/src/magick/draw.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7430ad7998fb3d4ef58bbf5582967ea1")
!478 = !{!479, !480, !481}
!479 = !DIEnumerator(name: "UndefinedGradient", value: 0)
!480 = !DIEnumerator(name: "LinearGradient", value: 1)
!481 = !DIEnumerator(name: "RadialGradient", value: 2)
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 129, baseType: !5, size: 32, elements: !483)
!483 = !{!484, !485, !486, !487}
!484 = !DIEnumerator(name: "UndefinedSpread", value: 0)
!485 = !DIEnumerator(name: "PadSpread", value: 1)
!486 = !DIEnumerator(name: "ReflectSpread", value: 2)
!487 = !DIEnumerator(name: "RepeatSpread", value: 3)
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 62, baseType: !5, size: 32, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIEnumerator(name: "UndefinedRule", value: 0)
!491 = !DIEnumerator(name: "EvenOddRule", value: 1)
!492 = !DIEnumerator(name: "NonZeroRule", value: 2)
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 77, baseType: !5, size: 32, elements: !494)
!494 = !{!495, !496, !497, !498}
!495 = !DIEnumerator(name: "UndefinedCap", value: 0)
!496 = !DIEnumerator(name: "ButtCap", value: 1)
!497 = !DIEnumerator(name: "RoundCap", value: 2)
!498 = !DIEnumerator(name: "SquareCap", value: 3)
!499 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 85, baseType: !5, size: 32, elements: !500)
!500 = !{!501, !502, !503, !504}
!501 = !DIEnumerator(name: "UndefinedJoin", value: 0)
!502 = !DIEnumerator(name: "MiterJoin", value: 1)
!503 = !DIEnumerator(name: "RoundJoin", value: 2)
!504 = !DIEnumerator(name: "BevelJoin", value: 3)
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 46, baseType: !5, size: 32, elements: !506)
!506 = !{!507, !508, !509, !510, !511}
!507 = !DIEnumerator(name: "UndefinedDecoration", value: 0)
!508 = !DIEnumerator(name: "NoDecoration", value: 1)
!509 = !DIEnumerator(name: "UnderlineDecoration", value: 2)
!510 = !DIEnumerator(name: "OverlineDecoration", value: 3)
!511 = !DIEnumerator(name: "LineThroughDecoration", value: 4)
!512 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !513, line: 40, baseType: !5, size: 32, elements: !514)
!513 = !DIFile(filename: "apps/538.imagick_r/src/magick/type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e03df4f5f7c27edd01aa629b64253bee")
!514 = !{!515, !516, !517, !518, !519}
!515 = !DIEnumerator(name: "UndefinedStyle", value: 0)
!516 = !DIEnumerator(name: "NormalStyle", value: 1)
!517 = !DIEnumerator(name: "ItalicStyle", value: 2)
!518 = !DIEnumerator(name: "ObliqueStyle", value: 3)
!519 = !DIEnumerator(name: "AnyStyle", value: 4)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !513, line: 25, baseType: !5, size: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!522 = !DIEnumerator(name: "UndefinedStretch", value: 0)
!523 = !DIEnumerator(name: "NormalStretch", value: 1)
!524 = !DIEnumerator(name: "UltraCondensedStretch", value: 2)
!525 = !DIEnumerator(name: "ExtraCondensedStretch", value: 3)
!526 = !DIEnumerator(name: "CondensedStretch", value: 4)
!527 = !DIEnumerator(name: "SemiCondensedStretch", value: 5)
!528 = !DIEnumerator(name: "SemiExpandedStretch", value: 6)
!529 = !DIEnumerator(name: "ExpandedStretch", value: 7)
!530 = !DIEnumerator(name: "ExtraExpandedStretch", value: 8)
!531 = !DIEnumerator(name: "UltraExpandedStretch", value: 9)
!532 = !DIEnumerator(name: "AnyStretch", value: 10)
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 30, baseType: !5, size: 32, elements: !534)
!534 = !{!535, !536, !537, !538}
!535 = !DIEnumerator(name: "UndefinedAlign", value: 0)
!536 = !DIEnumerator(name: "LeftAlign", value: 1)
!537 = !DIEnumerator(name: "CenterAlign", value: 2)
!538 = !DIEnumerator(name: "RightAlign", value: 3)
!539 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 38, baseType: !5, size: 32, elements: !540)
!540 = !{!541, !542, !543, !544}
!541 = !DIEnumerator(name: "UndefinedPathUnits", value: 0)
!542 = !DIEnumerator(name: "UserSpace", value: 1)
!543 = !DIEnumerator(name: "UserSpaceOnUse", value: 2)
!544 = !DIEnumerator(name: "ObjectBoundingBox", value: 3)
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 123, baseType: !5, size: 32, elements: !546)
!546 = !{!547, !548}
!547 = !DIEnumerator(name: "UndefinedReference", value: 0)
!548 = !DIEnumerator(name: "GradientReference", value: 1)
!549 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 55, baseType: !5, size: 32, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIEnumerator(name: "UndefinedDirection", value: 0)
!552 = !DIEnumerator(name: "RightToLeftDirection", value: 1)
!553 = !DIEnumerator(name: "LeftToRightDirection", value: 2)
!554 = !{!555, !556, !572, !573, !593, !638, !606, !586, !938, !595, !673, !940, !956, !957}
!555 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantizeInfo", file: !445, line: 57, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantizeInfo", file: !445, line: 35, size: 384, elements: !559)
!559 = !{!560, !563, !564, !566, !568, !569, !570}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "number_colors", scope: !558, file: !445, line: 38, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !562, line: 46, baseType: !555)
!562 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tree_depth", scope: !558, file: !445, line: 41, baseType: !561, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !558, file: !445, line: 44, baseType: !565, size: 32, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !78, line: 215, baseType: !77)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !558, file: !445, line: 47, baseType: !567, size: 32, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !141, line: 61, baseType: !140)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "measure_error", scope: !558, file: !445, line: 50, baseType: !565, size: 32, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !558, file: !445, line: 53, baseType: !561, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dither_method", scope: !558, file: !445, line: 56, baseType: !571, size: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "DitherMethod", file: !445, line: 33, baseType: !444)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickWand", file: !575, line: 69, baseType: !576)
!575 = !DIFile(filename: "apps/538.imagick_r/src/wand/MagickWand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ffc9981fe595b674b5932183b4455d96")
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickWand", file: !577, line: 50, size: 33280, elements: !578)
!577 = !DIFile(filename: "apps/538.imagick_r/src/wand/magick-wand-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "acd9e5d3507eb9a242a35f2a3efc4904")
!578 = !{!579, !580, !585, !605, !932, !933, !934, !935, !936, !937}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !576, file: !577, line: 53, baseType: !561, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !576, file: !577, line: 56, baseType: !581, size: 32768, offset: 64)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 32768, elements: !583)
!582 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!583 = !{!584}
!584 = !DISubrange(count: 4096)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !576, file: !577, line: 59, baseType: !586, size: 64, offset: 32832)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !78, line: 219, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !4, line: 102, size: 448, elements: !589)
!589 = !{!590, !592, !594, !596, !597, !598, !599, !604}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !588, file: !4, line: 105, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !4, line: 100, baseType: !3)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !588, file: !4, line: 108, baseType: !593, size: 32, offset: 32)
!593 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !588, file: !4, line: 111, baseType: !595, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !588, file: !4, line: 112, baseType: !595, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !588, file: !4, line: 115, baseType: !572, size: 64, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !588, file: !4, line: 118, baseType: !565, size: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !588, file: !4, line: 121, baseType: !600, size: 64, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !602, line: 26, baseType: !603)
!602 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !602, line: 25, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !588, file: !4, line: 124, baseType: !561, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !576, file: !577, line: 62, baseType: !606, size: 64, offset: 32896)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !78, line: 223, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !108, line: 356, size: 134336, elements: !609)
!609 = !{!610, !612, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !627, !629, !631, !632, !633, !634, !635, !636, !637, !639, !640, !650, !651, !652, !653, !654, !655, !656, !658, !660, !666, !667, !668, !669, !670, !672, !846, !847, !848, !849, !850, !861, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !929, !930, !931}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !608, file: !108, line: 359, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !83, line: 49, baseType: !82)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !608, file: !108, line: 362, baseType: !613, size: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !108, line: 86, baseType: !107)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !608, file: !108, line: 365, baseType: !565, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !608, file: !108, line: 366, baseType: !565, size: 32, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !608, file: !108, line: 367, baseType: !565, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !608, file: !108, line: 368, baseType: !565, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !608, file: !108, line: 371, baseType: !595, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !608, file: !108, line: 372, baseType: !595, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !608, file: !108, line: 373, baseType: !595, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !608, file: !108, line: 374, baseType: !595, size: 64, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !608, file: !108, line: 377, baseType: !561, size: 64, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !608, file: !108, line: 378, baseType: !561, size: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !608, file: !108, line: 379, baseType: !561, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !608, file: !108, line: 382, baseType: !626, size: 32, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !108, line: 73, baseType: !119)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !608, file: !108, line: 385, baseType: !628, size: 32, offset: 672)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !130, line: 35, baseType: !129)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !608, file: !108, line: 388, baseType: !630, size: 32, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !108, line: 93, baseType: !135)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !608, file: !108, line: 391, baseType: !561, size: 64, offset: 768)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !608, file: !108, line: 394, baseType: !595, size: 64, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !608, file: !108, line: 395, baseType: !595, size: 64, offset: 896)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !608, file: !108, line: 396, baseType: !595, size: 64, offset: 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !608, file: !108, line: 397, baseType: !595, size: 64, offset: 1024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !608, file: !108, line: 398, baseType: !595, size: 64, offset: 1088)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !608, file: !108, line: 401, baseType: !638, size: 64, offset: 1152)
!638 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !608, file: !108, line: 402, baseType: !638, size: 64, offset: 1216)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !608, file: !108, line: 405, baseType: !641, size: 64, offset: 1280)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !643)
!643 = !{!644, !647, !648, !649}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !642, file: !395, line: 143, baseType: !645, size: 16)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !78, line: 93, baseType: !646)
!646 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !642, file: !395, line: 144, baseType: !645, size: 16, offset: 16)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !642, file: !395, line: 145, baseType: !645, size: 16, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !642, file: !395, line: 146, baseType: !645, size: 16, offset: 48)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !608, file: !108, line: 406, baseType: !641, size: 64, offset: 1344)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !608, file: !108, line: 407, baseType: !641, size: 64, offset: 1408)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !608, file: !108, line: 410, baseType: !565, size: 32, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !608, file: !108, line: 411, baseType: !565, size: 32, offset: 1504)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !608, file: !108, line: 414, baseType: !561, size: 64, offset: 1536)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !608, file: !108, line: 417, baseType: !567, size: 32, offset: 1600)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !108, line: 420, baseType: !657, size: 32, offset: 1632)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !108, line: 61, baseType: !177)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !608, file: !108, line: 423, baseType: !659, size: 32, offset: 1664)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !192, line: 59, baseType: !191)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !608, file: !108, line: 426, baseType: !661, size: 64, offset: 1728)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !662, line: 77, baseType: !663)
!662 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !664, line: 193, baseType: !665)
!664 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!665 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !608, file: !108, line: 429, baseType: !565, size: 32, offset: 1792)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !608, file: !108, line: 430, baseType: !565, size: 32, offset: 1824)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !608, file: !108, line: 433, baseType: !595, size: 64, offset: 1856)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !608, file: !108, line: 434, baseType: !595, size: 64, offset: 1920)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !608, file: !108, line: 437, baseType: !671, size: 32, offset: 1984)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !78, line: 202, baseType: !224)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !608, file: !108, line: 440, baseType: !673, size: 64, offset: 2048)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !78, line: 221, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !108, line: 150, size: 105920, elements: !676)
!676 = !{!677, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !691, !692, !693, !694, !695, !709, !711, !712, !713, !714, !715, !716, !717, !718, !719, !727, !728, !729, !730, !731, !732, !734, !735, !736, !738, !740, !742, !744, !745, !746, !747, !748, !749, !750, !758, !773, !787, !788, !789, !790, !794, !798, !799, !800, !801, !802, !803, !804, !805, !807, !808, !818, !819, !821, !822, !823, !824, !825, !826, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !843, !845}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !675, file: !108, line: 153, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !78, line: 209, baseType: !246)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !675, file: !108, line: 156, baseType: !567, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !675, file: !108, line: 159, baseType: !611, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !675, file: !108, line: 162, baseType: !561, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !675, file: !108, line: 165, baseType: !613, size: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !675, file: !108, line: 168, baseType: !565, size: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !675, file: !108, line: 169, baseType: !565, size: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !675, file: !108, line: 172, baseType: !561, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !675, file: !108, line: 173, baseType: !561, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !675, file: !108, line: 174, baseType: !561, size: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !675, file: !108, line: 175, baseType: !561, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !675, file: !108, line: 178, baseType: !690, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !675, file: !108, line: 179, baseType: !641, size: 64, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !675, file: !108, line: 180, baseType: !641, size: 64, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !675, file: !108, line: 181, baseType: !641, size: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !675, file: !108, line: 184, baseType: !638, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !675, file: !108, line: 187, baseType: !696, size: 768, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !108, line: 128, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !108, line: 121, size: 768, elements: !698)
!698 = !{!699, !706, !707, !708}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !697, file: !108, line: 124, baseType: !700, size: 192)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !108, line: 101, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !108, line: 95, size: 192, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !701, file: !108, line: 98, baseType: !638, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !701, file: !108, line: 99, baseType: !638, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !701, file: !108, line: 100, baseType: !638, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !697, file: !108, line: 125, baseType: !700, size: 192, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !697, file: !108, line: 126, baseType: !700, size: 192, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !697, file: !108, line: 127, baseType: !700, size: 192, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !675, file: !108, line: 190, baseType: !710, size: 32, offset: 1664)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !252, line: 49, baseType: !251)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !675, file: !108, line: 193, baseType: !572, size: 64, offset: 1728)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !675, file: !108, line: 196, baseType: !630, size: 32, offset: 1792)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !675, file: !108, line: 199, baseType: !595, size: 64, offset: 1856)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !675, file: !108, line: 200, baseType: !595, size: 64, offset: 1920)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !675, file: !108, line: 201, baseType: !595, size: 64, offset: 1984)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !675, file: !108, line: 204, baseType: !661, size: 64, offset: 2048)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !675, file: !108, line: 207, baseType: !638, size: 64, offset: 2112)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !675, file: !108, line: 208, baseType: !638, size: 64, offset: 2176)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !675, file: !108, line: 211, baseType: !720, size: 256, offset: 2240)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !295, line: 130, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !295, line: 121, size: 256, elements: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !721, file: !295, line: 124, baseType: !561, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !721, file: !295, line: 125, baseType: !561, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !721, file: !295, line: 128, baseType: !661, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !721, file: !295, line: 129, baseType: !661, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !675, file: !108, line: 212, baseType: !720, size: 256, offset: 2496)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !675, file: !108, line: 213, baseType: !720, size: 256, offset: 2752)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !675, file: !108, line: 216, baseType: !638, size: 64, offset: 3008)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !675, file: !108, line: 217, baseType: !638, size: 64, offset: 3072)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !675, file: !108, line: 218, baseType: !638, size: 64, offset: 3136)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !675, file: !108, line: 221, baseType: !733, size: 32, offset: 3200)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !260, line: 66, baseType: !259)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !675, file: !108, line: 224, baseType: !626, size: 32, offset: 3232)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !675, file: !108, line: 227, baseType: !628, size: 32, offset: 3264)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !675, file: !108, line: 230, baseType: !737, size: 32, offset: 3296)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !295, line: 91, baseType: !294)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !675, file: !108, line: 233, baseType: !739, size: 32, offset: 3328)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !310, line: 99, baseType: !309)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !675, file: !108, line: 236, baseType: !741, size: 32, offset: 3360)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !381, line: 32, baseType: !380)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !675, file: !108, line: 239, baseType: !743, size: 64, offset: 3392)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !675, file: !108, line: 242, baseType: !561, size: 64, offset: 3456)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !675, file: !108, line: 243, baseType: !561, size: 64, offset: 3520)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !675, file: !108, line: 246, baseType: !661, size: 64, offset: 3584)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !675, file: !108, line: 249, baseType: !561, size: 64, offset: 3648)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !675, file: !108, line: 250, baseType: !561, size: 64, offset: 3712)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !675, file: !108, line: 253, baseType: !661, size: 64, offset: 3776)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !675, file: !108, line: 256, baseType: !751, size: 192, offset: 3840)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !752, line: 68, baseType: !753)
!752 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !752, line: 62, size: 192, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !753, file: !752, line: 65, baseType: !638, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !753, file: !752, line: 66, baseType: !638, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !753, file: !752, line: 67, baseType: !638, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !675, file: !108, line: 259, baseType: !759, size: 512, offset: 4032)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !389, line: 51, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !389, line: 40, size: 512, elements: !761)
!761 = !{!762, !769, !770, !772}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !760, file: !389, line: 43, baseType: !763, size: 192)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !389, line: 38, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !389, line: 32, size: 192, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !764, file: !389, line: 35, baseType: !638, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !764, file: !389, line: 36, baseType: !638, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !764, file: !389, line: 37, baseType: !638, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !760, file: !389, line: 44, baseType: !763, size: 192, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !760, file: !389, line: 47, baseType: !771, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !389, line: 30, baseType: !388)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !760, file: !389, line: 50, baseType: !561, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !675, file: !108, line: 262, baseType: !774, size: 64, offset: 4544)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !775, line: 26, baseType: !776)
!775 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!565, !779, !781, !784, !572}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !78, line: 150, baseType: !783)
!783 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !78, line: 151, baseType: !786)
!786 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !675, file: !108, line: 265, baseType: !572, size: 64, offset: 4608)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !675, file: !108, line: 266, baseType: !572, size: 64, offset: 4672)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !675, file: !108, line: 267, baseType: !572, size: 64, offset: 4736)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !675, file: !108, line: 270, baseType: !791, size: 64, offset: 4800)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !83, line: 52, baseType: !793)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !83, line: 51, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !675, file: !108, line: 273, baseType: !795, size: 64, offset: 4864)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !78, line: 217, baseType: !797)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !78, line: 217, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !675, file: !108, line: 276, baseType: !581, size: 32768, offset: 4928)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !675, file: !108, line: 277, baseType: !581, size: 32768, offset: 37696)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !675, file: !108, line: 278, baseType: !581, size: 32768, offset: 70464)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !675, file: !108, line: 281, baseType: !561, size: 64, offset: 103232)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !675, file: !108, line: 282, baseType: !561, size: 64, offset: 103296)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !675, file: !108, line: 285, baseType: !587, size: 448, offset: 103360)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !675, file: !108, line: 288, baseType: !565, size: 32, offset: 103808)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !675, file: !108, line: 291, baseType: !806, size: 64, offset: 103872)
!806 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !661)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !675, file: !108, line: 294, baseType: !600, size: 64, offset: 103936)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !675, file: !108, line: 297, baseType: !809, size: 256, offset: 104000)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !252, line: 40, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !252, line: 27, size: 256, elements: !811)
!811 = !{!812, !813, !814, !817}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !810, file: !252, line: 30, baseType: !595, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !810, file: !252, line: 33, baseType: !561, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !810, file: !252, line: 36, baseType: !815, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !810, file: !252, line: 39, baseType: !561, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !675, file: !108, line: 298, baseType: !809, size: 256, offset: 104256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !675, file: !108, line: 299, baseType: !820, size: 64, offset: 104512)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !675, file: !108, line: 302, baseType: !561, size: 64, offset: 104576)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !675, file: !108, line: 305, baseType: !561, size: 64, offset: 104640)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !675, file: !108, line: 308, baseType: !743, size: 64, offset: 104704)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !675, file: !108, line: 309, baseType: !743, size: 64, offset: 104768)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !108, line: 310, baseType: !743, size: 64, offset: 104832)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !675, file: !108, line: 313, baseType: !827, size: 32, offset: 104896)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !675, file: !108, line: 316, baseType: !565, size: 32, offset: 104928)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !675, file: !108, line: 319, baseType: !641, size: 64, offset: 104960)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !675, file: !108, line: 322, baseType: !743, size: 64, offset: 105024)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !675, file: !108, line: 325, baseType: !720, size: 256, offset: 105088)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !675, file: !108, line: 328, baseType: !572, size: 64, offset: 105344)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !675, file: !108, line: 329, baseType: !572, size: 64, offset: 105408)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !108, line: 332, baseType: !657, size: 32, offset: 105472)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !675, file: !108, line: 335, baseType: !565, size: 32, offset: 105504)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !675, file: !108, line: 338, baseType: !785, size: 64, offset: 105536)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !675, file: !108, line: 341, baseType: !565, size: 32, offset: 105600)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !675, file: !108, line: 344, baseType: !561, size: 64, offset: 105664)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !675, file: !108, line: 347, baseType: !840, size: 64, offset: 105728)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !841, line: 7, baseType: !842)
!841 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !664, line: 160, baseType: !665)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !675, file: !108, line: 350, baseType: !844, size: 32, offset: 105792)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !675, file: !108, line: 353, baseType: !561, size: 64, offset: 105856)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !608, file: !108, line: 443, baseType: !572, size: 64, offset: 2112)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !608, file: !108, line: 446, baseType: !774, size: 64, offset: 2176)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !608, file: !108, line: 449, baseType: !572, size: 64, offset: 2240)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !608, file: !108, line: 450, baseType: !572, size: 64, offset: 2304)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !608, file: !108, line: 453, baseType: !851, size: 64, offset: 2368)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !852, line: 26, baseType: !853)
!852 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!561, !856, !858, !860}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !608, file: !108, line: 456, baseType: !862, size: 64, offset: 2432)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !864, line: 7, baseType: !865)
!864 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !866, line: 49, size: 1728, elements: !867)
!866 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !883, !885, !886, !887, !889, !890, !892, !896, !899, !901, !904, !907, !908, !909, !910, !911}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !865, file: !866, line: 51, baseType: !593, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !865, file: !866, line: 54, baseType: !595, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !865, file: !866, line: 55, baseType: !595, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !865, file: !866, line: 56, baseType: !595, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !865, file: !866, line: 57, baseType: !595, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !865, file: !866, line: 58, baseType: !595, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !865, file: !866, line: 59, baseType: !595, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !865, file: !866, line: 60, baseType: !595, size: 64, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !865, file: !866, line: 61, baseType: !595, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !865, file: !866, line: 64, baseType: !595, size: 64, offset: 576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !865, file: !866, line: 65, baseType: !595, size: 64, offset: 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !865, file: !866, line: 66, baseType: !595, size: 64, offset: 704)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !865, file: !866, line: 68, baseType: !881, size: 64, offset: 768)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !866, line: 36, flags: DIFlagFwdDecl)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !865, file: !866, line: 70, baseType: !884, size: 64, offset: 832)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !865, file: !866, line: 72, baseType: !593, size: 32, offset: 896)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !865, file: !866, line: 73, baseType: !593, size: 32, offset: 928)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !865, file: !866, line: 74, baseType: !888, size: 64, offset: 960)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !664, line: 152, baseType: !665)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !865, file: !866, line: 77, baseType: !646, size: 16, offset: 1024)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !865, file: !866, line: 78, baseType: !891, size: 8, offset: 1040)
!891 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !865, file: !866, line: 79, baseType: !893, size: 8, offset: 1048)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 8, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 1)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !865, file: !866, line: 81, baseType: !897, size: 64, offset: 1088)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !866, line: 43, baseType: null)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !865, file: !866, line: 89, baseType: !900, size: 64, offset: 1152)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !664, line: 153, baseType: !665)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !865, file: !866, line: 91, baseType: !902, size: 64, offset: 1216)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !866, line: 37, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !865, file: !866, line: 92, baseType: !905, size: 64, offset: 1280)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !866, line: 38, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !865, file: !866, line: 93, baseType: !884, size: 64, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !865, file: !866, line: 94, baseType: !572, size: 64, offset: 1408)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !865, file: !866, line: 95, baseType: !561, size: 64, offset: 1472)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !865, file: !866, line: 96, baseType: !593, size: 32, offset: 1536)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !865, file: !866, line: 98, baseType: !912, size: 160, offset: 1568)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 160, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 20)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !608, file: !108, line: 459, baseType: !572, size: 64, offset: 2496)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !608, file: !108, line: 462, baseType: !561, size: 64, offset: 2560)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !608, file: !108, line: 465, baseType: !581, size: 32768, offset: 2624)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !608, file: !108, line: 466, baseType: !581, size: 32768, offset: 35392)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !608, file: !108, line: 467, baseType: !581, size: 32768, offset: 68160)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !608, file: !108, line: 468, baseType: !581, size: 32768, offset: 100928)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !608, file: !108, line: 471, baseType: !565, size: 32, offset: 133696)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !608, file: !108, line: 474, baseType: !595, size: 64, offset: 133760)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !608, file: !108, line: 477, baseType: !561, size: 64, offset: 133824)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !608, file: !108, line: 478, baseType: !561, size: 64, offset: 133888)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !608, file: !108, line: 481, baseType: !641, size: 64, offset: 133952)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !608, file: !108, line: 484, baseType: !561, size: 64, offset: 134016)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !608, file: !108, line: 487, baseType: !928, size: 32, offset: 134080)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !608, file: !108, line: 490, baseType: !641, size: 64, offset: 134112)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !608, file: !108, line: 493, baseType: !572, size: 64, offset: 134208)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !608, file: !108, line: 496, baseType: !565, size: 32, offset: 134272)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_info", scope: !576, file: !577, line: 65, baseType: !556, size: 64, offset: 32960)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !576, file: !577, line: 68, baseType: !673, size: 64, offset: 33024)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "insert_before", scope: !576, file: !577, line: 71, baseType: !565, size: 32, offset: 33088)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "image_pending", scope: !576, file: !577, line: 72, baseType: !565, size: 32, offset: 33120)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !576, file: !577, line: 73, baseType: !565, size: 32, offset: 33152)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !576, file: !577, line: 76, baseType: !561, size: 64, offset: 33216)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConfigureInfo", file: !944, line: 44, baseType: !945)
!944 = !DIFile(filename: "apps/538.imagick_r/src/magick/configure.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "509000215663377a353fdb892d1d0c76")
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ConfigureInfo", file: !944, line: 27, size: 448, elements: !946)
!946 = !{!947, !948, !949, !950, !951, !952, !954, !955}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !945, file: !944, line: 30, baseType: !595, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !944, line: 31, baseType: !595, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !945, file: !944, line: 32, baseType: !595, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !945, file: !944, line: 35, baseType: !565, size: 32, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !945, file: !944, line: 36, baseType: !565, size: 32, offset: 224)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !945, file: !944, line: 39, baseType: !953, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !945, file: !944, line: 40, baseType: !953, size: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !945, file: !944, line: 43, baseType: !561, size: 64, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawInfo", file: !477, line: 333, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DrawInfo", file: !477, line: 205, size: 5760, elements: !960)
!960 = !{!961, !962, !963, !964, !974, !975, !976, !977, !978, !1027, !1028, !1029, !1030, !1031, !1032, !1034, !1036, !1038, !1039, !1040, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1050, !1052, !1053, !1054, !1055, !1056, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1066, !1067, !1068, !1080, !1081, !1082, !1083, !1084, !1085}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !959, file: !477, line: 208, baseType: !595, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !959, file: !477, line: 209, baseType: !595, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "viewbox", scope: !959, file: !477, line: 212, baseType: !720, size: 256, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "affine", scope: !959, file: !477, line: 215, baseType: !965, size: 384, offset: 384)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !295, line: 102, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !295, line: 93, size: 384, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !973}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !966, file: !295, line: 96, baseType: !638, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !966, file: !295, line: 97, baseType: !638, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !966, file: !295, line: 98, baseType: !638, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !966, file: !295, line: 99, baseType: !638, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !966, file: !295, line: 100, baseType: !638, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !966, file: !295, line: 101, baseType: !638, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !959, file: !477, line: 218, baseType: !737, size: 32, offset: 768)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !959, file: !477, line: 221, baseType: !641, size: 64, offset: 800)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !959, file: !477, line: 222, baseType: !641, size: 64, offset: 864)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_width", scope: !959, file: !477, line: 225, baseType: !638, size: 64, offset: 960)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !959, file: !477, line: 228, baseType: !979, size: 1024, offset: 1024)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientInfo", file: !477, line: 184, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GradientInfo", file: !477, line: 153, size: 1024, elements: !981)
!981 = !{!982, !984, !985, !993, !1015, !1016, !1018, !1019, !1020, !1026}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !980, file: !477, line: 156, baseType: !983, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientType", file: !477, line: 75, baseType: !476)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "bounding_box", scope: !980, file: !477, line: 159, baseType: !720, size: 256, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_vector", scope: !980, file: !477, line: 162, baseType: !986, size: 256, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !108, line: 110, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !108, line: 103, size: 256, elements: !988)
!988 = !{!989, !990, !991, !992}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !987, file: !108, line: 106, baseType: !638, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !987, file: !108, line: 107, baseType: !638, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !987, file: !108, line: 108, baseType: !638, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !987, file: !108, line: 109, baseType: !638, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "stops", scope: !980, file: !477, line: 165, baseType: !994, size: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "StopInfo", file: !477, line: 151, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StopInfo", file: !477, line: 144, size: 512, elements: !997)
!997 = !{!998, !1014}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !996, file: !477, line: 147, baseType: !999, size: 448)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !395, line: 127, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !395, line: 104, size: 448, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1010, !1011, !1012, !1013}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1000, file: !395, line: 107, baseType: !678, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1000, file: !395, line: 110, baseType: !567, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1000, file: !395, line: 113, baseType: !565, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1000, file: !395, line: 116, baseType: !638, size: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1000, file: !395, line: 119, baseType: !561, size: 64, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1000, file: !395, line: 122, baseType: !1008, size: 32, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !78, line: 78, baseType: !1009)
!1009 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1000, file: !395, line: 123, baseType: !1008, size: 32, offset: 288)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1000, file: !395, line: 124, baseType: !1008, size: 32, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1000, file: !395, line: 125, baseType: !1008, size: 32, offset: 352)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1000, file: !395, line: 126, baseType: !1008, size: 32, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !996, file: !477, line: 150, baseType: !1008, size: 32, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "number_stops", scope: !980, file: !477, line: 168, baseType: !561, size: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !980, file: !477, line: 171, baseType: !1017, size: 32, offset: 704)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpreadMethod", file: !477, line: 135, baseType: !482)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !980, file: !477, line: 174, baseType: !565, size: 32, offset: 736)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !980, file: !477, line: 177, baseType: !561, size: 64, offset: 768)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !980, file: !477, line: 180, baseType: !1021, size: 128, offset: 832)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !477, line: 142, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !477, line: 137, size: 128, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1022, file: !477, line: 140, baseType: !638, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1022, file: !477, line: 141, baseType: !638, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !980, file: !477, line: 183, baseType: !1008, size: 32, offset: 960)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fill_pattern", scope: !959, file: !477, line: 231, baseType: !673, size: 64, offset: 2048)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !959, file: !477, line: 232, baseType: !673, size: 64, offset: 2112)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_pattern", scope: !959, file: !477, line: 233, baseType: !673, size: 64, offset: 2176)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_antialias", scope: !959, file: !477, line: 236, baseType: !565, size: 32, offset: 2240)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "text_antialias", scope: !959, file: !477, line: 237, baseType: !565, size: 32, offset: 2272)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !959, file: !477, line: 240, baseType: !1033, size: 32, offset: 2304)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "FillRule", file: !477, line: 68, baseType: !488)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "linecap", scope: !959, file: !477, line: 243, baseType: !1035, size: 32, offset: 2336)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineCap", file: !477, line: 83, baseType: !493)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "linejoin", scope: !959, file: !477, line: 246, baseType: !1037, size: 32, offset: 2368)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineJoin", file: !477, line: 91, baseType: !499)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "miterlimit", scope: !959, file: !477, line: 249, baseType: !561, size: 64, offset: 2432)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !959, file: !477, line: 252, baseType: !638, size: 64, offset: 2496)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "decorate", scope: !959, file: !477, line: 255, baseType: !1041, size: 32, offset: 2560)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecorationType", file: !477, line: 53, baseType: !505)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !959, file: !477, line: 258, baseType: !739, size: 32, offset: 2592)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !959, file: !477, line: 261, baseType: !595, size: 64, offset: 2624)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !959, file: !477, line: 264, baseType: !561, size: 64, offset: 2688)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !959, file: !477, line: 267, baseType: !595, size: 64, offset: 2752)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !959, file: !477, line: 268, baseType: !595, size: 64, offset: 2816)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !959, file: !477, line: 269, baseType: !595, size: 64, offset: 2880)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !959, file: !477, line: 272, baseType: !1049, size: 32, offset: 2944)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleType", file: !513, line: 47, baseType: !512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !959, file: !477, line: 275, baseType: !1051, size: 32, offset: 2976)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "StretchType", file: !513, line: 38, baseType: !520)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !959, file: !477, line: 278, baseType: !561, size: 64, offset: 3008)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !959, file: !477, line: 281, baseType: !595, size: 64, offset: 3072)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !959, file: !477, line: 284, baseType: !638, size: 64, offset: 3136)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !959, file: !477, line: 287, baseType: !595, size: 64, offset: 3200)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !959, file: !477, line: 290, baseType: !1057, size: 32, offset: 3264)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlignType", file: !477, line: 36, baseType: !533)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "undercolor", scope: !959, file: !477, line: 293, baseType: !641, size: 64, offset: 3296)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !959, file: !477, line: 294, baseType: !641, size: 64, offset: 3360)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !959, file: !477, line: 297, baseType: !595, size: 64, offset: 3456)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "dash_pattern", scope: !959, file: !477, line: 300, baseType: !956, size: 64, offset: 3520)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !959, file: !477, line: 303, baseType: !595, size: 64, offset: 3584)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !959, file: !477, line: 306, baseType: !986, size: 256, offset: 3648)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "clip_units", scope: !959, file: !477, line: 309, baseType: !1065, size: 32, offset: 3904)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClipPathUnits", file: !477, line: 44, baseType: !539)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !959, file: !477, line: 312, baseType: !645, size: 16, offset: 3936)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "render", scope: !959, file: !477, line: 315, baseType: !565, size: 32, offset: 3968)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "element_reference", scope: !959, file: !477, line: 318, baseType: !1069, size: 1344, offset: 4032)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementReference", file: !477, line: 203, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ElementReference", file: !477, line: 186, size: 1344, elements: !1071)
!1071 = !{!1072, !1073, !1075, !1076, !1077, !1079}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1070, file: !477, line: 189, baseType: !595, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1070, file: !477, line: 192, baseType: !1074, size: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReferenceType", file: !477, line: 127, baseType: !545)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !1070, file: !477, line: 195, baseType: !979, size: 1024, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1070, file: !477, line: 198, baseType: !561, size: 64, offset: 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1070, file: !477, line: 201, baseType: !1078, size: 64, offset: 1216)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1070, file: !477, line: 202, baseType: !1078, size: 64, offset: 1280)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !959, file: !477, line: 321, baseType: !565, size: 32, offset: 5376)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !959, file: !477, line: 324, baseType: !561, size: 64, offset: 5440)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !959, file: !477, line: 327, baseType: !638, size: 64, offset: 5504)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "interword_spacing", scope: !959, file: !477, line: 328, baseType: !638, size: 64, offset: 5568)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "interline_spacing", scope: !959, file: !477, line: 329, baseType: !638, size: 64, offset: 5632)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !959, file: !477, line: 332, baseType: !1086, size: 32, offset: 5696)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectionType", file: !477, line: 60, baseType: !549)
!1087 = !{i32 7, !"Dwarf Version", i32 5}
!1088 = !{i32 2, !"Debug Info Version", i32 3}
!1089 = !{i32 1, !"wchar_size", i32 4}
!1090 = !{i32 7, !"PIC Level", i32 2}
!1091 = !{i32 7, !"PIE Level", i32 2}
!1092 = !{i32 7, !"uwtable", i32 2}
!1093 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1094 = distinct !DISubprogram(name: "ClearMagickWand", scope: !1095, file: !1095, line: 77, type: !1096, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1098)
!1095 = !DIFile(filename: "apps/538.imagick_r/src/wand/magick-wand.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c164eff20c0049a1630a14d8ddf5e0fc")
!1096 = !DISubroutineType(types: !1097)
!1097 = !{null, !573}
!1098 = !{!1099}
!1099 = !DILocalVariable(name: "wand", arg: 1, scope: !1094, file: !1095, line: 77, type: !573)
!1100 = !DILocation(line: 0, scope: !1094)
!1101 = !DILocation(line: 81, column: 13, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1094, file: !1095, line: 81, column: 7)
!1103 = !{!1104, !1106, i64 4144}
!1104 = !{!"_MagickWand", !1105, i64 0, !1106, i64 8, !1108, i64 4104, !1108, i64 4112, !1108, i64 4120, !1108, i64 4128, !1106, i64 4136, !1106, i64 4140, !1106, i64 4144, !1105, i64 4152}
!1105 = !{!"long", !1106, i64 0}
!1106 = !{!"omnipotent char", !1107, i64 0}
!1107 = !{!"Simple C/C++ TBAA"}
!1108 = !{!"any pointer", !1106, i64 0}
!1109 = !DILocation(line: 81, column: 19, scope: !1102)
!1110 = !DILocation(line: 81, column: 7, scope: !1094)
!1111 = !DILocation(line: 82, column: 66, scope: !1102)
!1112 = !DILocation(line: 82, column: 12, scope: !1102)
!1113 = !DILocation(line: 82, column: 5, scope: !1102)
!1114 = !DILocation(line: 83, column: 49, scope: !1094)
!1115 = !{!1104, !1108, i64 4120}
!1116 = !DILocation(line: 83, column: 23, scope: !1094)
!1117 = !DILocation(line: 83, column: 22, scope: !1094)
!1118 = !DILocation(line: 84, column: 43, scope: !1094)
!1119 = !{!1104, !1108, i64 4112}
!1120 = !DILocation(line: 84, column: 20, scope: !1094)
!1121 = !DILocation(line: 84, column: 19, scope: !1094)
!1122 = !DILocation(line: 85, column: 39, scope: !1094)
!1123 = !{!1104, !1108, i64 4128}
!1124 = !DILocation(line: 85, column: 16, scope: !1094)
!1125 = !DILocation(line: 85, column: 15, scope: !1094)
!1126 = !DILocation(line: 86, column: 20, scope: !1094)
!1127 = !DILocation(line: 86, column: 19, scope: !1094)
!1128 = !DILocation(line: 87, column: 23, scope: !1094)
!1129 = !DILocation(line: 87, column: 22, scope: !1094)
!1130 = !DILocation(line: 88, column: 9, scope: !1094)
!1131 = !DILocation(line: 88, column: 22, scope: !1094)
!1132 = !{!1104, !1106, i64 4136}
!1133 = !DILocation(line: 89, column: 9, scope: !1094)
!1134 = !DILocation(line: 89, column: 22, scope: !1094)
!1135 = !{!1104, !1106, i64 4140}
!1136 = !DILocation(line: 90, column: 30, scope: !1094)
!1137 = !{!1104, !1108, i64 4104}
!1138 = !DILocation(line: 90, column: 3, scope: !1094)
!1139 = !DILocation(line: 91, column: 15, scope: !1094)
!1140 = !DILocation(line: 91, column: 14, scope: !1094)
!1141 = !DILocation(line: 92, column: 1, scope: !1094)
!1142 = !DISubprogram(name: "LogMagickEvent", scope: !452, file: !452, line: 83, type: !1143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!565, !1145, !779, !779, !860, !779, null}
!1145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !452, line: 58, baseType: !451)
!1147 = !{}
!1148 = !DISubprogram(name: "DestroyQuantizeInfo", scope: !445, file: !445, line: 73, type: !1149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!556, !556}
!1151 = !DISubprogram(name: "DestroyImageInfo", scope: !108, file: !108, line: 522, type: !1152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!606, !606}
!1154 = !DISubprogram(name: "DestroyImageList", scope: !1155, file: !1155, line: 28, type: !1156, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1155 = !DIFile(filename: "apps/538.imagick_r/src/magick/list.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53876be9fc59b89d67d5ff7fa85db93a")
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!673, !673}
!1158 = !DISubprogram(name: "AcquireImageInfo", scope: !108, file: !108, line: 520, type: !1159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!606}
!1161 = !DISubprogram(name: "CloneQuantizeInfo", scope: !445, file: !445, line: 72, type: !1162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!556, !1164}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!1166 = !DISubprogram(name: "ClearMagickException", scope: !4, file: !4, line: 165, type: !1167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{null, !586}
!1169 = !DISubprogram(name: "IsEventLogging", scope: !452, file: !452, line: 80, type: !1170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!565}
!1172 = distinct !DISubprogram(name: "CloneMagickWand", scope: !1095, file: !1095, line: 116, type: !1173, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1175)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!573, !938}
!1175 = !{!1176, !1177, !1178}
!1176 = !DILocalVariable(name: "wand", arg: 1, scope: !1172, file: !1095, line: 116, type: !938)
!1177 = !DILocalVariable(name: "clone_wand", scope: !1172, file: !1095, line: 119, type: !573)
!1178 = !DILocalVariable(name: "exception", scope: !1179, file: !1095, line: 127, type: !587)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !1095, line: 127, column: 5)
!1180 = distinct !DILexicalBlock(scope: !1172, file: !1095, line: 126, column: 7)
!1181 = !DILocation(line: 0, scope: !1172)
!1182 = !DILocation(line: 123, column: 13, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1172, file: !1095, line: 123, column: 7)
!1184 = !DILocation(line: 123, column: 19, scope: !1183)
!1185 = !DILocation(line: 123, column: 7, scope: !1172)
!1186 = !DILocation(line: 124, column: 66, scope: !1183)
!1187 = !DILocation(line: 124, column: 12, scope: !1183)
!1188 = !DILocation(line: 124, column: 5, scope: !1183)
!1189 = !DILocation(line: 125, column: 29, scope: !1172)
!1190 = !DILocation(line: 126, column: 18, scope: !1180)
!1191 = !DILocation(line: 126, column: 7, scope: !1172)
!1192 = !DILocation(line: 127, column: 5, scope: !1179)
!1193 = !DILocation(line: 129, column: 10, scope: !1172)
!1194 = !DILocation(line: 130, column: 18, scope: !1172)
!1195 = !DILocation(line: 130, column: 17, scope: !1172)
!1196 = !{!1104, !1105, i64 0}
!1197 = !DILocation(line: 131, column: 41, scope: !1172)
!1198 = !DILocation(line: 132, column: 18, scope: !1172)
!1199 = !DILocation(line: 131, column: 10, scope: !1172)
!1200 = !DILocation(line: 133, column: 25, scope: !1172)
!1201 = !DILocation(line: 133, column: 15, scope: !1172)
!1202 = !DILocation(line: 133, column: 24, scope: !1172)
!1203 = !DILocation(line: 134, column: 48, scope: !1172)
!1204 = !DILocation(line: 134, column: 3, scope: !1172)
!1205 = !DILocation(line: 135, column: 47, scope: !1172)
!1206 = !DILocation(line: 135, column: 26, scope: !1172)
!1207 = !DILocation(line: 135, column: 15, scope: !1172)
!1208 = !DILocation(line: 135, column: 25, scope: !1172)
!1209 = !DILocation(line: 136, column: 53, scope: !1172)
!1210 = !DILocation(line: 136, column: 29, scope: !1172)
!1211 = !DILocation(line: 136, column: 15, scope: !1172)
!1212 = !DILocation(line: 136, column: 28, scope: !1172)
!1213 = !DILocation(line: 137, column: 43, scope: !1172)
!1214 = !DILocation(line: 137, column: 62, scope: !1172)
!1215 = !DILocation(line: 137, column: 22, scope: !1172)
!1216 = !DILocation(line: 137, column: 15, scope: !1172)
!1217 = !DILocation(line: 137, column: 21, scope: !1172)
!1218 = !DILocation(line: 138, column: 15, scope: !1172)
!1219 = !DILocation(line: 138, column: 28, scope: !1172)
!1220 = !DILocation(line: 139, column: 15, scope: !1172)
!1221 = !DILocation(line: 139, column: 28, scope: !1172)
!1222 = !DILocation(line: 140, column: 21, scope: !1172)
!1223 = !DILocation(line: 140, column: 15, scope: !1172)
!1224 = !DILocation(line: 140, column: 20, scope: !1172)
!1225 = !DILocation(line: 141, column: 25, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1172, file: !1095, line: 141, column: 7)
!1227 = !DILocation(line: 141, column: 7, scope: !1172)
!1228 = !DILocation(line: 142, column: 12, scope: !1226)
!1229 = !DILocation(line: 142, column: 5, scope: !1226)
!1230 = !DILocation(line: 143, column: 15, scope: !1172)
!1231 = !DILocation(line: 143, column: 24, scope: !1172)
!1232 = !{!1104, !1105, i64 4152}
!1233 = !DILocation(line: 144, column: 3, scope: !1172)
!1234 = !DISubprogram(name: "AcquireMagickMemory", scope: !1235, file: !1235, line: 40, type: !1236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1235 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!572, !860}
!1238 = !DISubprogram(name: "GetExceptionInfo", scope: !4, file: !4, line: 166, type: !1167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1239 = !DISubprogram(name: "ThrowMagickException", scope: !4, file: !4, line: 156, type: !1240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!565, !586, !779, !779, !860, !1242, !779, !779, null}
!1242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!1243 = !DISubprogram(name: "CatchException", scope: !4, file: !4, line: 164, type: !1167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1244 = !DISubprogram(name: "DestroyExceptionInfo", scope: !4, file: !4, line: 148, type: !1245, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!586, !586}
!1247 = distinct !DISubprogram(name: "MagickWandTerminus", scope: !1095, file: !1095, line: 1033, type: !1248, scopeLine: 1034, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1147)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{null}
!1250 = !DILocation(line: 1035, column: 3, scope: !1247)
!1251 = !DILocation(line: 1036, column: 3, scope: !1247)
!1252 = !DILocation(line: 1037, column: 1, scope: !1247)
!1253 = !DISubprogram(name: "ResetMagickMemory", scope: !1235, file: !1235, line: 52, type: !1254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!572, !572, !593, !860}
!1256 = !DISubprogram(name: "AcquireWandId", scope: !1257, file: !1257, line: 26, type: !1258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1257 = !DIFile(filename: "apps/538.imagick_r/src/wand/wand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04fee0d7de953bb2b067eac76943bcb6")
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!561}
!1260 = !DISubprogram(name: "FormatLocaleString", scope: !1261, file: !1261, line: 71, type: !1262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1261 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "156c27c5fb4b55284e5f6c924766571a")
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!661, !1264, !860, !1265, null}
!1264 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !595)
!1265 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !779)
!1266 = !DISubprogram(name: "AcquireExceptionInfo", scope: !4, file: !4, line: 146, type: !1267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!586}
!1269 = !DISubprogram(name: "InheritException", scope: !4, file: !4, line: 167, type: !1270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{null, !586, !1272}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!1274 = !DISubprogram(name: "CloneImageInfo", scope: !108, file: !108, line: 521, type: !1275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!606, !1277}
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!1279 = !DISubprogram(name: "CloneImageList", scope: !1155, file: !1155, line: 26, type: !1280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!673, !856, !586}
!1282 = distinct !DISubprogram(name: "DestroyMagickWand", scope: !1095, file: !1095, line: 169, type: !1283, scopeLine: 170, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1285)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!573, !573}
!1285 = !{!1286}
!1286 = !DILocalVariable(name: "wand", arg: 1, scope: !1282, file: !1095, line: 169, type: !573)
!1287 = !DILocation(line: 0, scope: !1282)
!1288 = !DILocation(line: 173, column: 13, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1282, file: !1095, line: 173, column: 7)
!1290 = !DILocation(line: 173, column: 19, scope: !1289)
!1291 = !DILocation(line: 173, column: 7, scope: !1282)
!1292 = !DILocation(line: 174, column: 66, scope: !1289)
!1293 = !DILocation(line: 174, column: 12, scope: !1289)
!1294 = !DILocation(line: 174, column: 5, scope: !1289)
!1295 = !DILocation(line: 175, column: 39, scope: !1282)
!1296 = !DILocation(line: 175, column: 16, scope: !1282)
!1297 = !DILocation(line: 175, column: 15, scope: !1282)
!1298 = !DILocation(line: 176, column: 13, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1282, file: !1095, line: 176, column: 7)
!1300 = !DILocation(line: 176, column: 27, scope: !1299)
!1301 = !DILocation(line: 176, column: 7, scope: !1282)
!1302 = !DILocation(line: 177, column: 25, scope: !1299)
!1303 = !DILocation(line: 177, column: 24, scope: !1299)
!1304 = !DILocation(line: 177, column: 5, scope: !1299)
!1305 = !DILocation(line: 178, column: 13, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1282, file: !1095, line: 178, column: 7)
!1307 = !DILocation(line: 178, column: 24, scope: !1306)
!1308 = !DILocation(line: 178, column: 7, scope: !1282)
!1309 = !DILocation(line: 179, column: 22, scope: !1306)
!1310 = !DILocation(line: 179, column: 21, scope: !1306)
!1311 = !DILocation(line: 179, column: 5, scope: !1306)
!1312 = !DILocation(line: 180, column: 13, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1282, file: !1095, line: 180, column: 7)
!1314 = !DILocation(line: 180, column: 23, scope: !1313)
!1315 = !DILocation(line: 180, column: 7, scope: !1282)
!1316 = !DILocation(line: 181, column: 21, scope: !1313)
!1317 = !DILocation(line: 181, column: 20, scope: !1313)
!1318 = !DILocation(line: 181, column: 5, scope: !1313)
!1319 = !DILocation(line: 182, column: 26, scope: !1282)
!1320 = !DILocation(line: 182, column: 3, scope: !1282)
!1321 = !DILocation(line: 183, column: 9, scope: !1282)
!1322 = !DILocation(line: 183, column: 18, scope: !1282)
!1323 = !DILocation(line: 184, column: 23, scope: !1282)
!1324 = !DILocation(line: 185, column: 3, scope: !1282)
!1325 = !DISubprogram(name: "RelinquishWandId", scope: !1257, file: !1257, line: 30, type: !1326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{null, !860}
!1328 = !DISubprogram(name: "RelinquishMagickMemory", scope: !1235, file: !1235, line: 51, type: !1329, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!572, !572}
!1331 = distinct !DISubprogram(name: "IsMagickWand", scope: !1095, file: !1095, line: 210, type: !1332, scopeLine: 211, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1334)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!565, !938}
!1334 = !{!1335}
!1335 = !DILocalVariable(name: "wand", arg: 1, scope: !1331, file: !1095, line: 210, type: !938)
!1336 = !DILocation(line: 0, scope: !1331)
!1337 = !DILocation(line: 212, column: 12, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1331, file: !1095, line: 212, column: 7)
!1339 = !DILocation(line: 212, column: 7, scope: !1331)
!1340 = !DILocation(line: 214, column: 13, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1331, file: !1095, line: 214, column: 7)
!1342 = !DILocation(line: 214, column: 23, scope: !1341)
!1343 = !DILocation(line: 214, column: 7, scope: !1331)
!1344 = !DILocation(line: 216, column: 28, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1331, file: !1095, line: 216, column: 7)
!1346 = !DILocation(line: 216, column: 7, scope: !1345)
!1347 = !DILocation(line: 216, column: 68, scope: !1345)
!1348 = !DILocation(line: 219, column: 1, scope: !1331)
!1349 = !DISubprogram(name: "LocaleNCompare", scope: !1350, file: !1350, line: 67, type: !1351, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1350 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!593, !779, !779, !860}
!1353 = distinct !DISubprogram(name: "MagickClearException", scope: !1095, file: !1095, line: 243, type: !1354, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1356)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!565, !573}
!1356 = !{!1357}
!1357 = !DILocalVariable(name: "wand", arg: 1, scope: !1353, file: !1095, line: 243, type: !573)
!1358 = !DILocation(line: 0, scope: !1353)
!1359 = !DILocation(line: 247, column: 13, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !1353, file: !1095, line: 247, column: 7)
!1361 = !DILocation(line: 247, column: 19, scope: !1360)
!1362 = !DILocation(line: 247, column: 7, scope: !1353)
!1363 = !DILocation(line: 248, column: 66, scope: !1360)
!1364 = !DILocation(line: 248, column: 12, scope: !1360)
!1365 = !DILocation(line: 248, column: 5, scope: !1360)
!1366 = !DILocation(line: 249, column: 30, scope: !1353)
!1367 = !DILocation(line: 249, column: 3, scope: !1353)
!1368 = !DILocation(line: 250, column: 3, scope: !1353)
!1369 = distinct !DISubprogram(name: "MagickGetException", scope: !1095, file: !1095, line: 278, type: !1370, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1373)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!595, !938, !1372}
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!1373 = !{!1374, !1375, !1376}
!1374 = !DILocalVariable(name: "wand", arg: 1, scope: !1369, file: !1095, line: 278, type: !938)
!1375 = !DILocalVariable(name: "severity", arg: 2, scope: !1369, file: !1095, line: 279, type: !1372)
!1376 = !DILocalVariable(name: "description", scope: !1369, file: !1095, line: 282, type: !595)
!1377 = !DILocation(line: 0, scope: !1369)
!1378 = !DILocation(line: 286, column: 13, scope: !1379)
!1379 = distinct !DILexicalBlock(scope: !1369, file: !1095, line: 286, column: 7)
!1380 = !DILocation(line: 286, column: 19, scope: !1379)
!1381 = !DILocation(line: 286, column: 7, scope: !1369)
!1382 = !DILocation(line: 287, column: 66, scope: !1379)
!1383 = !DILocation(line: 287, column: 12, scope: !1379)
!1384 = !DILocation(line: 287, column: 5, scope: !1379)
!1385 = !DILocation(line: 289, column: 19, scope: !1369)
!1386 = !DILocation(line: 289, column: 30, scope: !1369)
!1387 = !{!1388, !1106, i64 0}
!1388 = !{!"_ExceptionInfo", !1106, i64 0, !1389, i64 4, !1108, i64 8, !1108, i64 16, !1108, i64 24, !1106, i64 32, !1108, i64 40, !1105, i64 48}
!1389 = !{!"int", !1106, i64 0}
!1390 = !DILocation(line: 289, column: 12, scope: !1369)
!1391 = !{!1106, !1106, i64 0}
!1392 = !DILocation(line: 290, column: 24, scope: !1369)
!1393 = !DILocation(line: 292, column: 19, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1369, file: !1095, line: 292, column: 7)
!1395 = !DILocation(line: 292, column: 7, scope: !1369)
!1396 = !DILocation(line: 294, column: 41, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !1394, file: !1095, line: 293, column: 5)
!1398 = !DILocation(line: 295, column: 47, scope: !1397)
!1399 = !DILocation(line: 294, column: 14, scope: !1397)
!1400 = !DILocation(line: 296, column: 7, scope: !1397)
!1401 = !DILocation(line: 298, column: 15, scope: !1369)
!1402 = !DILocation(line: 299, column: 13, scope: !1403)
!1403 = distinct !DILexicalBlock(scope: !1369, file: !1095, line: 299, column: 7)
!1404 = !DILocation(line: 299, column: 24, scope: !1403)
!1405 = !{!1388, !1108, i64 8}
!1406 = !DILocation(line: 299, column: 31, scope: !1403)
!1407 = !DILocation(line: 299, column: 7, scope: !1369)
!1408 = !DILocation(line: 301, column: 24, scope: !1403)
!1409 = !DILocation(line: 300, column: 41, scope: !1403)
!1410 = !DILocation(line: 300, column: 12, scope: !1403)
!1411 = !DILocation(line: 302, column: 13, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1369, file: !1095, line: 302, column: 7)
!1413 = !DILocation(line: 300, column: 5, scope: !1403)
!1414 = !DILocation(line: 302, column: 24, scope: !1412)
!1415 = !{!1388, !1108, i64 16}
!1416 = !DILocation(line: 302, column: 36, scope: !1412)
!1417 = !DILocation(line: 302, column: 7, scope: !1369)
!1418 = !DILocation(line: 304, column: 14, scope: !1419)
!1419 = distinct !DILexicalBlock(scope: !1412, file: !1095, line: 303, column: 5)
!1420 = !DILocation(line: 306, column: 15, scope: !1419)
!1421 = !DILocation(line: 306, column: 26, scope: !1419)
!1422 = !DILocation(line: 306, column: 52, scope: !1419)
!1423 = !DILocation(line: 305, column: 50, scope: !1419)
!1424 = !DILocation(line: 305, column: 14, scope: !1419)
!1425 = !DILocation(line: 307, column: 14, scope: !1419)
!1426 = !DILocation(line: 308, column: 5, scope: !1419)
!1427 = !DILocation(line: 310, column: 1, scope: !1369)
!1428 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1235, file: !1235, line: 42, type: !1429, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!572, !860, !860}
!1431 = !DISubprogram(name: "CopyMagickString", scope: !1350, file: !1350, line: 78, type: !1432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!561, !595, !779, !860}
!1434 = !DISubprogram(name: "GetLocaleExceptionMessage", scope: !4, file: !4, line: 140, type: !1435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!779, !1242, !779}
!1437 = !DISubprogram(name: "ConcatenateMagickString", scope: !1350, file: !1350, line: 76, type: !1432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1438 = distinct !DISubprogram(name: "MagickGetExceptionType", scope: !1095, file: !1095, line: 335, type: !1439, scopeLine: 336, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1441)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!591, !938}
!1441 = !{!1442}
!1442 = !DILocalVariable(name: "wand", arg: 1, scope: !1438, file: !1095, line: 335, type: !938)
!1443 = !DILocation(line: 0, scope: !1438)
!1444 = !DILocation(line: 339, column: 13, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1438, file: !1095, line: 339, column: 7)
!1446 = !DILocation(line: 339, column: 19, scope: !1445)
!1447 = !DILocation(line: 339, column: 7, scope: !1438)
!1448 = !DILocation(line: 340, column: 66, scope: !1445)
!1449 = !DILocation(line: 340, column: 12, scope: !1445)
!1450 = !DILocation(line: 340, column: 5, scope: !1445)
!1451 = !DILocation(line: 341, column: 16, scope: !1438)
!1452 = !DILocation(line: 341, column: 27, scope: !1438)
!1453 = !DILocation(line: 341, column: 3, scope: !1438)
!1454 = distinct !DISubprogram(name: "MagickGetIteratorIndex", scope: !1095, file: !1095, line: 367, type: !1455, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1457)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!661, !573}
!1457 = !{!1458}
!1458 = !DILocalVariable(name: "wand", arg: 1, scope: !1454, file: !1095, line: 367, type: !573)
!1459 = !DILocation(line: 0, scope: !1454)
!1460 = !DILocation(line: 371, column: 13, scope: !1461)
!1461 = distinct !DILexicalBlock(scope: !1454, file: !1095, line: 371, column: 7)
!1462 = !DILocation(line: 371, column: 19, scope: !1461)
!1463 = !DILocation(line: 371, column: 7, scope: !1454)
!1464 = !DILocation(line: 372, column: 66, scope: !1461)
!1465 = !DILocation(line: 372, column: 12, scope: !1461)
!1466 = !DILocation(line: 372, column: 5, scope: !1461)
!1467 = !DILocation(line: 373, column: 13, scope: !1468)
!1468 = distinct !DILexicalBlock(scope: !1454, file: !1095, line: 373, column: 7)
!1469 = !DILocation(line: 373, column: 20, scope: !1468)
!1470 = !DILocation(line: 373, column: 7, scope: !1454)
!1471 = !DILocation(line: 375, column: 41, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !1468, file: !1095, line: 374, column: 5)
!1473 = !DILocation(line: 376, column: 44, scope: !1472)
!1474 = !DILocation(line: 375, column: 14, scope: !1472)
!1475 = !DILocation(line: 377, column: 7, scope: !1472)
!1476 = !DILocation(line: 379, column: 10, scope: !1454)
!1477 = !DILocation(line: 379, column: 3, scope: !1454)
!1478 = !DILocation(line: 380, column: 1, scope: !1454)
!1479 = !DISubprogram(name: "GetImageIndexInList", scope: !1155, file: !1155, line: 48, type: !1480, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1147)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!661, !856}
!1482 = distinct !DISubprogram(name: "MagickQueryConfigureOption", scope: !1095, file: !1095, line: 405, type: !1483, scopeLine: 406, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1485)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!595, !779}
!1485 = !{!1486, !1487, !1488, !1489, !1490}
!1486 = !DILocalVariable(name: "option", arg: 1, scope: !1482, file: !1095, line: 405, type: !779)
!1487 = !DILocalVariable(name: "value", scope: !1482, file: !1095, line: 408, type: !595)
!1488 = !DILocalVariable(name: "configure_info", scope: !1482, file: !1095, line: 411, type: !940)
!1489 = !DILocalVariable(name: "exception", scope: !1482, file: !1095, line: 414, type: !586)
!1490 = !DILocalVariable(name: "number_options", scope: !1482, file: !1095, line: 417, type: !561)
!1491 = !DILocation(line: 0, scope: !1482)
!1492 = !DILocation(line: 416, column: 3, scope: !1482)
!1493 = !DILocation(line: 419, column: 13, scope: !1482)
!1494 = !DILocation(line: 420, column: 18, scope: !1482)
!1495 = !DILocation(line: 421, column: 13, scope: !1482)
!1496 = !DILocation(line: 422, column: 22, scope: !1497)
!1497 = distinct !DILexicalBlock(scope: !1482, file: !1095, line: 422, column: 7)
!1498 = !DILocation(line: 422, column: 7, scope: !1482)
!1499 = !DILocation(line: 424, column: 23, scope: !1482)
!1500 = !{!1108, !1108, i64 0}
!1501 = !DILocation(line: 424, column: 42, scope: !1482)
!1502 = !{!1503, !1108, i64 16}
