; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/matrix.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/matrix.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MatrixInfo = type { i32, i64, i64, i64, i64, i32, i32, [4096 x i8], i32, ptr, ptr, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }

!397 = !{!398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!398 = !DIEnumerator(name: "UndefinedPreview", value: 0)
!399 = !DIEnumerator(name: "RotatePreview", value: 1)
!400 = !DIEnumerator(name: "ShearPreview", value: 2)
!401 = !DIEnumerator(name: "RollPreview", value: 3)
!402 = !DIEnumerator(name: "HuePreview", value: 4)
!403 = !DIEnumerator(name: "SaturationPreview", value: 5)
!404 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!405 = !DIEnumerator(name: "GammaPreview", value: 7)
!406 = !DIEnumerator(name: "SpiffPreview", value: 8)
!407 = !DIEnumerator(name: "DullPreview", value: 9)
!408 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!409 = !DIEnumerator(name: "QuantizePreview", value: 11)
!410 = !DIEnumerator(name: "DespecklePreview", value: 12)
!411 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!412 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!413 = !DIEnumerator(name: "SharpenPreview", value: 15)
!414 = !DIEnumerator(name: "BlurPreview", value: 16)
!415 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!416 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!417 = !DIEnumerator(name: "SpreadPreview", value: 19)
!418 = !DIEnumerator(name: "SolarizePreview", value: 20)
!419 = !DIEnumerator(name: "ShadePreview", value: 21)
!420 = !DIEnumerator(name: "RaisePreview", value: 22)
!421 = !DIEnumerator(name: "SegmentPreview", value: 23)
!422 = !DIEnumerator(name: "SwirlPreview", value: 24)
!423 = !DIEnumerator(name: "ImplodePreview", value: 25)
!424 = !DIEnumerator(name: "WavePreview", value: 26)
!425 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!426 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!427 = !DIEnumerator(name: "JPEGPreview", value: 29)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 177, baseType: !5, size: 32, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!430 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!431 = !DIEnumerator(name: "RedChannel", value: 1)
!432 = !DIEnumerator(name: "GrayChannel", value: 1)
!433 = !DIEnumerator(name: "CyanChannel", value: 1)
!434 = !DIEnumerator(name: "GreenChannel", value: 2)
!435 = !DIEnumerator(name: "MagentaChannel", value: 2)
!436 = !DIEnumerator(name: "BlueChannel", value: 4)
!437 = !DIEnumerator(name: "YellowChannel", value: 4)
!438 = !DIEnumerator(name: "AlphaChannel", value: 8)
!439 = !DIEnumerator(name: "OpacityChannel", value: 8)
!440 = !DIEnumerator(name: "MatteChannel", value: 8)
!441 = !DIEnumerator(name: "BlackChannel", value: 32)
!442 = !DIEnumerator(name: "IndexChannel", value: 32)
!443 = !DIEnumerator(name: "CompositeChannels", value: 47)
!444 = !DIEnumerator(name: "AllChannels", value: 134217727)
!445 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!446 = !DIEnumerator(name: "RGBChannels", value: 128)
!447 = !DIEnumerator(name: "GrayChannels", value: 128)
!448 = !DIEnumerator(name: "SyncChannels", value: 256)
!449 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !451, line: 27, baseType: !5, size: 32, elements: !452)
!451 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!453 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!454 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!455 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!456 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!457 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!458 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!459 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!460 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!461 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!462 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!463 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!464 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!465 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!466 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!467 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!468 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!469 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!470 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!471 = !{!472, !500, !507, !487, !481, !483, !509, !511, !514, !512, !519, !520, !522, !524, !513, !549, !717, !544, !849, !498, !851}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatrixInfo", file: !474, line: 26, baseType: !475)
!474 = !DIFile(filename: "apps/538.imagick_r/src/magick/matrix.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "eb3e46c8fbd61488836928d66ca395c0")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatrixInfo", file: !476, line: 58, size: 33408, elements: !477)
!476 = !DIFile(filename: "apps/538.imagick_r/src/magick/matrix.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7de4b70325a6cf17d0ec2bd7ad5e2d07")
!477 = !{!478, !480, !484, !485, !486, !489, !491, !492, !497, !499, !501, !506}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !476, line: 61, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheType", file: !4, line: 35, baseType: !3)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !475, file: !476, line: 64, baseType: !481, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !482, line: 46, baseType: !483)
!482 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!483 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !475, file: !476, line: 65, baseType: !481, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !475, file: !476, line: 66, baseType: !481, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !475, file: !476, line: 69, baseType: !487, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !14, line: 151, baseType: !488)
!488 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !475, file: !476, line: 72, baseType: !490, size: 32, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !14, line: 215, baseType: !13)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !475, file: !476, line: 73, baseType: !490, size: 32, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !475, file: !476, line: 76, baseType: !493, size: 32768, offset: 384)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 32768, elements: !495)
!494 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!495 = !{!496}
!496 = !DISubrange(count: 4096)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !475, file: !476, line: 79, baseType: !498, size: 32, offset: 33152)
!498 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !475, file: !476, line: 82, baseType: !500, size: 64, offset: 33216)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !475, file: !476, line: 85, baseType: !502, size: 64, offset: 33280)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !504, line: 26, baseType: !505)
!504 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !504, line: 25, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !475, file: !476, line: 88, baseType: !481, size: 64, offset: 33344)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !515, line: 77, baseType: !516)
!515 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !517, line: 193, baseType: !518)
!517 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!518 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !14, line: 150, baseType: !521)
!521 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !14, line: 221, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !177, line: 150, size: 105920, elements: !527)
!527 = !{!528, !530, !532, !534, !535, !537, !538, !539, !540, !541, !542, !543, !553, !554, !555, !556, !557, !571, !573, !574, !576, !578, !579, !580, !581, !582, !583, !591, !592, !593, !594, !595, !596, !598, !600, !602, !604, !606, !608, !610, !611, !612, !613, !614, !615, !616, !624, !639, !647, !648, !649, !650, !654, !658, !659, !660, !661, !662, !663, !676, !677, !679, !680, !688, !689, !691, !692, !693, !694, !695, !696, !698, !699, !700, !701, !702, !703, !704, !706, !707, !708, !709, !710, !714, !716}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !526, file: !177, line: 153, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !14, line: 209, baseType: !109)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !526, file: !177, line: 156, baseType: !531, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !115, line: 61, baseType: !114)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !526, file: !177, line: 159, baseType: !533, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !152, line: 49, baseType: !151)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !526, file: !177, line: 162, baseType: !481, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !526, file: !177, line: 165, baseType: !536, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !177, line: 86, baseType: !176)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !526, file: !177, line: 168, baseType: !490, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !526, file: !177, line: 169, baseType: !490, size: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !526, file: !177, line: 172, baseType: !481, size: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !526, file: !177, line: 173, baseType: !481, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !526, file: !177, line: 174, baseType: !481, size: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !526, file: !177, line: 175, baseType: !481, size: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !526, file: !177, line: 178, baseType: !544, size: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !353, line: 148, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !353, line: 131, size: 64, elements: !547)
!547 = !{!548, !550, !551, !552}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !546, file: !353, line: 143, baseType: !549, size: 16)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !14, line: 93, baseType: !510)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !546, file: !353, line: 144, baseType: !549, size: 16, offset: 16)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !546, file: !353, line: 145, baseType: !549, size: 16, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !546, file: !353, line: 146, baseType: !549, size: 16, offset: 48)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !526, file: !177, line: 179, baseType: !545, size: 64, offset: 640)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !526, file: !177, line: 180, baseType: !545, size: 64, offset: 704)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !526, file: !177, line: 181, baseType: !545, size: 64, offset: 768)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !526, file: !177, line: 184, baseType: !513, size: 64, offset: 832)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !526, file: !177, line: 187, baseType: !558, size: 768, offset: 896)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !177, line: 128, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !177, line: 121, size: 768, elements: !560)
!560 = !{!561, !568, !569, !570}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !559, file: !177, line: 124, baseType: !562, size: 192)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !177, line: 101, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !177, line: 95, size: 192, elements: !564)
!564 = !{!565, !566, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !563, file: !177, line: 98, baseType: !513, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !563, file: !177, line: 99, baseType: !513, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !563, file: !177, line: 100, baseType: !513, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !559, file: !177, line: 125, baseType: !562, size: 192, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !559, file: !177, line: 126, baseType: !562, size: 192, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !559, file: !177, line: 127, baseType: !562, size: 192, offset: 576)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !526, file: !177, line: 190, baseType: !572, size: 32, offset: 1664)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !189, line: 49, baseType: !188)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !526, file: !177, line: 193, baseType: !500, size: 64, offset: 1728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !526, file: !177, line: 196, baseType: !575, size: 32, offset: 1792)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !177, line: 93, baseType: !196)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !526, file: !177, line: 199, baseType: !577, size: 64, offset: 1856)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !526, file: !177, line: 200, baseType: !577, size: 64, offset: 1920)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !526, file: !177, line: 201, baseType: !577, size: 64, offset: 1984)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !526, file: !177, line: 204, baseType: !514, size: 64, offset: 2048)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !526, file: !177, line: 207, baseType: !513, size: 64, offset: 2112)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !526, file: !177, line: 208, baseType: !513, size: 64, offset: 2176)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !526, file: !177, line: 211, baseType: !584, size: 256, offset: 2240)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !253, line: 130, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !253, line: 121, size: 256, elements: !586)
!586 = !{!587, !588, !589, !590}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !585, file: !253, line: 124, baseType: !481, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !585, file: !253, line: 125, baseType: !481, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !585, file: !253, line: 128, baseType: !514, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !585, file: !253, line: 129, baseType: !514, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !526, file: !177, line: 212, baseType: !584, size: 256, offset: 2496)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !526, file: !177, line: 213, baseType: !584, size: 256, offset: 2752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !526, file: !177, line: 216, baseType: !513, size: 64, offset: 3008)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !526, file: !177, line: 217, baseType: !513, size: 64, offset: 3072)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !526, file: !177, line: 218, baseType: !513, size: 64, offset: 3136)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !526, file: !177, line: 221, baseType: !597, size: 32, offset: 3200)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !202, line: 66, baseType: !201)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !526, file: !177, line: 224, baseType: !599, size: 32, offset: 3232)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !177, line: 73, baseType: !236)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !526, file: !177, line: 227, baseType: !601, size: 32, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !247, line: 35, baseType: !246)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !526, file: !177, line: 230, baseType: !603, size: 32, offset: 3296)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !253, line: 91, baseType: !252)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !526, file: !177, line: 233, baseType: !605, size: 32, offset: 3328)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !268, line: 99, baseType: !267)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !526, file: !177, line: 236, baseType: !607, size: 32, offset: 3360)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !339, line: 32, baseType: !338)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !526, file: !177, line: 239, baseType: !609, size: 64, offset: 3392)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !526, file: !177, line: 242, baseType: !481, size: 64, offset: 3456)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !526, file: !177, line: 243, baseType: !481, size: 64, offset: 3520)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !526, file: !177, line: 246, baseType: !514, size: 64, offset: 3584)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !526, file: !177, line: 249, baseType: !481, size: 64, offset: 3648)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !526, file: !177, line: 250, baseType: !481, size: 64, offset: 3712)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !526, file: !177, line: 253, baseType: !514, size: 64, offset: 3776)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !526, file: !177, line: 256, baseType: !617, size: 192, offset: 3840)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !618, line: 68, baseType: !619)
!618 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !618, line: 62, size: 192, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !619, file: !618, line: 65, baseType: !513, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !619, file: !618, line: 66, baseType: !513, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !619, file: !618, line: 67, baseType: !513, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !526, file: !177, line: 259, baseType: !625, size: 512, offset: 4032)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !347, line: 51, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !347, line: 40, size: 512, elements: !627)
!627 = !{!628, !635, !636, !638}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !626, file: !347, line: 43, baseType: !629, size: 192)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !347, line: 38, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !347, line: 32, size: 192, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !630, file: !347, line: 35, baseType: !513, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !630, file: !347, line: 36, baseType: !513, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !630, file: !347, line: 37, baseType: !513, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !626, file: !347, line: 44, baseType: !629, size: 192, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !626, file: !347, line: 47, baseType: !637, size: 32, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !347, line: 30, baseType: !346)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !626, file: !347, line: 50, baseType: !481, size: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !526, file: !177, line: 262, baseType: !640, size: 64, offset: 4544)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !641, line: 26, baseType: !642)
!641 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!490, !507, !645, !646, !500}
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !526, file: !177, line: 265, baseType: !500, size: 64, offset: 4608)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !526, file: !177, line: 266, baseType: !500, size: 64, offset: 4672)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !526, file: !177, line: 267, baseType: !500, size: 64, offset: 4736)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !526, file: !177, line: 270, baseType: !651, size: 64, offset: 4800)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !152, line: 52, baseType: !653)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !152, line: 51, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !526, file: !177, line: 273, baseType: !655, size: 64, offset: 4864)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !14, line: 217, baseType: !657)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !14, line: 217, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !526, file: !177, line: 276, baseType: !493, size: 32768, offset: 4928)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !526, file: !177, line: 277, baseType: !493, size: 32768, offset: 37696)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !526, file: !177, line: 278, baseType: !493, size: 32768, offset: 70464)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !526, file: !177, line: 281, baseType: !481, size: 64, offset: 103232)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !526, file: !177, line: 282, baseType: !481, size: 64, offset: 103296)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !526, file: !177, line: 285, baseType: !664, size: 448, offset: 103360)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !14, line: 219, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !19, line: 102, size: 448, elements: !666)
!666 = !{!667, !669, !670, !671, !672, !673, !674, !675}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !665, file: !19, line: 105, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !19, line: 100, baseType: !18)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !665, file: !19, line: 108, baseType: !498, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !665, file: !19, line: 111, baseType: !577, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !665, file: !19, line: 112, baseType: !577, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !665, file: !19, line: 115, baseType: !500, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !665, file: !19, line: 118, baseType: !490, size: 32, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !665, file: !19, line: 121, baseType: !502, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !665, file: !19, line: 124, baseType: !481, size: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !526, file: !177, line: 288, baseType: !490, size: 32, offset: 103808)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !526, file: !177, line: 291, baseType: !678, size: 64, offset: 103872)
!678 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !514)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !526, file: !177, line: 294, baseType: !502, size: 64, offset: 103936)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !526, file: !177, line: 297, baseType: !681, size: 256, offset: 104000)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !189, line: 40, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !189, line: 27, size: 256, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !682, file: !189, line: 30, baseType: !577, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !682, file: !189, line: 33, baseType: !481, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !682, file: !189, line: 36, baseType: !522, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !682, file: !189, line: 39, baseType: !481, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !526, file: !177, line: 298, baseType: !681, size: 256, offset: 104256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !526, file: !177, line: 299, baseType: !690, size: 64, offset: 104512)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !526, file: !177, line: 302, baseType: !481, size: 64, offset: 104576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !526, file: !177, line: 305, baseType: !481, size: 64, offset: 104640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !526, file: !177, line: 308, baseType: !609, size: 64, offset: 104704)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !526, file: !177, line: 309, baseType: !609, size: 64, offset: 104768)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !177, line: 310, baseType: !609, size: 64, offset: 104832)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !526, file: !177, line: 313, baseType: !697, size: 32, offset: 104896)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !353, line: 47, baseType: !352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !526, file: !177, line: 316, baseType: !490, size: 32, offset: 104928)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !526, file: !177, line: 319, baseType: !545, size: 64, offset: 104960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !526, file: !177, line: 322, baseType: !609, size: 64, offset: 105024)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !526, file: !177, line: 325, baseType: !584, size: 256, offset: 105088)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !526, file: !177, line: 328, baseType: !500, size: 64, offset: 105344)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !526, file: !177, line: 329, baseType: !500, size: 64, offset: 105408)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !526, file: !177, line: 332, baseType: !705, size: 32, offset: 105472)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !177, line: 61, baseType: !369)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !526, file: !177, line: 335, baseType: !490, size: 32, offset: 105504)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !526, file: !177, line: 338, baseType: !487, size: 64, offset: 105536)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !526, file: !177, line: 341, baseType: !490, size: 32, offset: 105600)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !526, file: !177, line: 344, baseType: !481, size: 64, offset: 105664)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !526, file: !177, line: 347, baseType: !711, size: 64, offset: 105728)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !712, line: 7, baseType: !713)
!712 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !517, line: 160, baseType: !518)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !526, file: !177, line: 350, baseType: !715, size: 32, offset: 105792)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !353, line: 79, baseType: !383)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !526, file: !177, line: 353, baseType: !481, size: 64, offset: 105856)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !14, line: 223, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !177, line: 356, size: 134336, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !755, !756, !757, !758, !759, !760, !762, !763, !764, !765, !766, !767, !778, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !846, !847, !848}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !719, file: !177, line: 359, baseType: !533, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !719, file: !177, line: 362, baseType: !536, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !719, file: !177, line: 365, baseType: !490, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !719, file: !177, line: 366, baseType: !490, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !719, file: !177, line: 367, baseType: !490, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !719, file: !177, line: 368, baseType: !490, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !719, file: !177, line: 371, baseType: !577, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !719, file: !177, line: 372, baseType: !577, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !719, file: !177, line: 373, baseType: !577, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !719, file: !177, line: 374, baseType: !577, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !719, file: !177, line: 377, baseType: !481, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !719, file: !177, line: 378, baseType: !481, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !719, file: !177, line: 379, baseType: !481, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !719, file: !177, line: 382, baseType: !599, size: 32, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !719, file: !177, line: 385, baseType: !601, size: 32, offset: 672)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !719, file: !177, line: 388, baseType: !575, size: 32, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !719, file: !177, line: 391, baseType: !481, size: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !719, file: !177, line: 394, baseType: !577, size: 64, offset: 832)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !719, file: !177, line: 395, baseType: !577, size: 64, offset: 896)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !719, file: !177, line: 396, baseType: !577, size: 64, offset: 960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !719, file: !177, line: 397, baseType: !577, size: 64, offset: 1024)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !719, file: !177, line: 398, baseType: !577, size: 64, offset: 1088)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !719, file: !177, line: 401, baseType: !513, size: 64, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !719, file: !177, line: 402, baseType: !513, size: 64, offset: 1216)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !719, file: !177, line: 405, baseType: !545, size: 64, offset: 1280)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !719, file: !177, line: 406, baseType: !545, size: 64, offset: 1344)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !719, file: !177, line: 407, baseType: !545, size: 64, offset: 1408)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !719, file: !177, line: 410, baseType: !490, size: 32, offset: 1472)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !719, file: !177, line: 411, baseType: !490, size: 32, offset: 1504)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !719, file: !177, line: 414, baseType: !481, size: 64, offset: 1536)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !719, file: !177, line: 417, baseType: !531, size: 32, offset: 1600)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !719, file: !177, line: 420, baseType: !705, size: 32, offset: 1632)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !719, file: !177, line: 423, baseType: !754, size: 32, offset: 1664)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !396, line: 59, baseType: !395)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !719, file: !177, line: 426, baseType: !514, size: 64, offset: 1728)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !719, file: !177, line: 429, baseType: !490, size: 32, offset: 1792)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !719, file: !177, line: 430, baseType: !490, size: 32, offset: 1824)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !719, file: !177, line: 433, baseType: !577, size: 64, offset: 1856)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !719, file: !177, line: 434, baseType: !577, size: 64, offset: 1920)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !719, file: !177, line: 437, baseType: !761, size: 32, offset: 1984)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !14, line: 202, baseType: !428)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !719, file: !177, line: 440, baseType: !524, size: 64, offset: 2048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !719, file: !177, line: 443, baseType: !500, size: 64, offset: 2112)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !719, file: !177, line: 446, baseType: !640, size: 64, offset: 2176)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !719, file: !177, line: 449, baseType: !500, size: 64, offset: 2240)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !719, file: !177, line: 450, baseType: !500, size: 64, offset: 2304)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !719, file: !177, line: 453, baseType: !768, size: 64, offset: 2368)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !769, line: 26, baseType: !770)
!769 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!481, !773, !775, !777}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !719, file: !177, line: 456, baseType: !779, size: 64, offset: 2432)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !781, line: 7, baseType: !782)
!781 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !783, line: 49, size: 1728, elements: !784)
!783 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !800, !802, !803, !804, !806, !807, !809, !813, !816, !818, !821, !824, !825, !826, !827, !828}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !782, file: !783, line: 51, baseType: !498, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !782, file: !783, line: 54, baseType: !577, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !782, file: !783, line: 55, baseType: !577, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !782, file: !783, line: 56, baseType: !577, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !782, file: !783, line: 57, baseType: !577, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !782, file: !783, line: 58, baseType: !577, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !782, file: !783, line: 59, baseType: !577, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !782, file: !783, line: 60, baseType: !577, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !782, file: !783, line: 61, baseType: !577, size: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !782, file: !783, line: 64, baseType: !577, size: 64, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !782, file: !783, line: 65, baseType: !577, size: 64, offset: 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !782, file: !783, line: 66, baseType: !577, size: 64, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !782, file: !783, line: 68, baseType: !798, size: 64, offset: 768)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !783, line: 36, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !782, file: !783, line: 70, baseType: !801, size: 64, offset: 832)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !782, file: !783, line: 72, baseType: !498, size: 32, offset: 896)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !782, file: !783, line: 73, baseType: !498, size: 32, offset: 928)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !782, file: !783, line: 74, baseType: !805, size: 64, offset: 960)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !517, line: 152, baseType: !518)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !782, file: !783, line: 77, baseType: !510, size: 16, offset: 1024)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !782, file: !783, line: 78, baseType: !808, size: 8, offset: 1040)
!808 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !782, file: !783, line: 79, baseType: !810, size: 8, offset: 1048)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 8, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 1)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !782, file: !783, line: 81, baseType: !814, size: 64, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !783, line: 43, baseType: null)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !782, file: !783, line: 89, baseType: !817, size: 64, offset: 1152)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !517, line: 153, baseType: !518)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !782, file: !783, line: 91, baseType: !819, size: 64, offset: 1216)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !783, line: 37, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !782, file: !783, line: 92, baseType: !822, size: 64, offset: 1280)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !783, line: 38, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !782, file: !783, line: 93, baseType: !801, size: 64, offset: 1344)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !782, file: !783, line: 94, baseType: !500, size: 64, offset: 1408)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !782, file: !783, line: 95, baseType: !481, size: 64, offset: 1472)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !782, file: !783, line: 96, baseType: !498, size: 32, offset: 1536)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !782, file: !783, line: 98, baseType: !829, size: 160, offset: 1568)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 160, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 20)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !719, file: !177, line: 459, baseType: !500, size: 64, offset: 2496)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !719, file: !177, line: 462, baseType: !481, size: 64, offset: 2560)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !719, file: !177, line: 465, baseType: !493, size: 32768, offset: 2624)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !719, file: !177, line: 466, baseType: !493, size: 32768, offset: 35392)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !719, file: !177, line: 467, baseType: !493, size: 32768, offset: 68160)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !719, file: !177, line: 468, baseType: !493, size: 32768, offset: 100928)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !719, file: !177, line: 471, baseType: !490, size: 32, offset: 133696)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !719, file: !177, line: 474, baseType: !577, size: 64, offset: 133760)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !719, file: !177, line: 477, baseType: !481, size: 64, offset: 133824)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !719, file: !177, line: 478, baseType: !481, size: 64, offset: 133888)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !719, file: !177, line: 481, baseType: !545, size: 64, offset: 133952)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !719, file: !177, line: 484, baseType: !481, size: 64, offset: 134016)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !719, file: !177, line: 487, baseType: !845, size: 32, offset: 134080)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !451, line: 47, baseType: !450)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !719, file: !177, line: 490, baseType: !545, size: 64, offset: 134112)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !719, file: !177, line: 493, baseType: !500, size: 64, offset: 134208)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !719, file: !177, line: 496, baseType: !490, size: 32, offset: 134272)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !14, line: 78, baseType: !852)
!852 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!853 = !{i32 7, !"Dwarf Version", i32 5}
!854 = !{i32 2, !"Debug Info Version", i32 3}
!855 = !{i32 1, !"wchar_size", i32 4}
!856 = !{i32 7, !"PIC Level", i32 2}
!857 = !{i32 7, !"PIE Level", i32 2}
!858 = !{i32 7, !"uwtable", i32 2}
!859 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!860 = distinct !DISubprogram(name: "AcquireMatrixInfo", scope: !476, file: !476, line: 211, type: !861, scopeLine: 213, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !864)
!861 = !DISubroutineType(types: !862)
!862 = !{!472, !777, !777, !777, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!864 = !{!865, !866, !867, !868, !869, !870, !871}
!865 = !DILocalVariable(name: "columns", arg: 1, scope: !860, file: !476, line: 211, type: !777)
!866 = !DILocalVariable(name: "rows", arg: 2, scope: !860, file: !476, line: 212, type: !777)
!867 = !DILocalVariable(name: "stride", arg: 3, scope: !860, file: !476, line: 212, type: !777)
!868 = !DILocalVariable(name: "exception", arg: 4, scope: !860, file: !476, line: 212, type: !863)
!869 = !DILocalVariable(name: "synchronize", scope: !860, file: !476, line: 215, type: !577)
!870 = !DILocalVariable(name: "status", scope: !860, file: !476, line: 218, type: !490)
!871 = !DILocalVariable(name: "matrix_info", scope: !860, file: !476, line: 221, type: !472)
!872 = !DILocation(line: 0, scope: !860)
!873 = !DILocation(line: 223, column: 30, scope: !860)
!874 = !DILocation(line: 224, column: 19, scope: !875)
!875 = distinct !DILexicalBlock(scope: !860, file: !476, line: 224, column: 7)
!876 = !DILocation(line: 224, column: 7, scope: !860)
!877 = !DILocation(line: 226, column: 10, scope: !860)
!878 = !DILocation(line: 227, column: 16, scope: !860)
!879 = !DILocation(line: 227, column: 25, scope: !860)
!880 = !{!881, !884, i64 4168}
!881 = !{!"_MatrixInfo", !882, i64 0, !884, i64 8, !884, i64 16, !884, i64 24, !885, i64 32, !882, i64 40, !882, i64 44, !882, i64 48, !886, i64 4144, !887, i64 4152, !887, i64 4160, !884, i64 4168}
!882 = !{!"omnipotent char", !883, i64 0}
!883 = !{!"Simple C/C++ TBAA"}
!884 = !{!"long", !882, i64 0}
!885 = !{!"long long", !882, i64 0}
!886 = !{!"int", !882, i64 0}
!887 = !{!"any pointer", !882, i64 0}
!888 = !DILocation(line: 228, column: 16, scope: !860)
!889 = !DILocation(line: 228, column: 23, scope: !860)
!890 = !{!881, !884, i64 8}
!891 = !DILocation(line: 229, column: 16, scope: !860)
!892 = !DILocation(line: 229, column: 20, scope: !860)
!893 = !{!881, !884, i64 16}
!894 = !DILocation(line: 230, column: 16, scope: !860)
!895 = !DILocation(line: 230, column: 22, scope: !860)
!896 = !{!881, !884, i64 24}
!897 = !DILocation(line: 231, column: 26, scope: !860)
!898 = !DILocation(line: 231, column: 16, scope: !860)
!899 = !DILocation(line: 231, column: 25, scope: !860)
!900 = !{!881, !887, i64 4160}
!901 = !DILocation(line: 232, column: 15, scope: !860)
!902 = !DILocation(line: 233, column: 19, scope: !903)
!903 = distinct !DILexicalBlock(scope: !860, file: !476, line: 233, column: 7)
!904 = !DILocation(line: 233, column: 7, scope: !860)
!905 = !DILocation(line: 235, column: 32, scope: !906)
!906 = distinct !DILexicalBlock(scope: !903, file: !476, line: 234, column: 5)
!907 = !DILocation(line: 235, column: 20, scope: !906)
!908 = !DILocation(line: 235, column: 31, scope: !906)
!909 = !{!881, !882, i64 44}
!910 = !DILocation(line: 236, column: 19, scope: !906)
