; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/output/matroska.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/output/matroska.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_output_t = type { ptr, ptr, ptr, ptr, ptr }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, float, float, float, i32, float, i32, i32, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }
%struct.mkv_hnd_t = type { ptr, i32, i32, i32, i32, i64, i8, i32, i32 }
%struct.x264_nal_t = type { i32, i32, i32, ptr }
%struct.x264_picture_t = type { i32, i32, i32, i32, i64, i64, ptr, %struct.x264_image_t, %struct.x264_hrd_t, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mkv_output", scope: !2, file: !13, line: 211, type: !14, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !12, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/output/matroska.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "1a7ca5fe13daa7a376c13c3ae71ee0de")
!4 = !{!5, !6, !11}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !7, line: 27, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !9, line: 44, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!10 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!0}
!13 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/matroska.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1a7ca5fe13daa7a376c13c3ae71ee0de")
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_output_t", file: !16, line: 34, baseType: !17)
!16 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/output.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2609bd03b72b40b15579de35b2e5f690")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 27, size: 320, elements: !18)
!18 = !{!19, !28, !208, !221, !258}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !17, file: !16, line: 29, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!11, !23, !25}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !27, line: 30, baseType: !5)
!27 = !DIFile(filename: "apps/525.x264_r/src/x264_src/muxers.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bcea0820748b2dc47392b7f6393a96ff")
!28 = !DIDerivedType(tag: DW_TAG_member, name: "set_param", scope: !17, file: !16, line: 30, baseType: !29, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!11, !26, !32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !34, line: 376, baseType: !35)
!34 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !34, line: 176, size: 5632, elements: !36)
!36 = !{!37, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !87, !88, !89, !90, !94, !95, !109, !110, !111, !112, !113, !144, !186, !187, !188, !189, !190, !191, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !35, file: !34, line: 179, baseType: !38, size: 32)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !35, file: !34, line: 180, baseType: !11, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !35, file: !34, line: 181, baseType: !11, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !35, file: !34, line: 182, baseType: !11, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !35, file: !34, line: 183, baseType: !11, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !35, file: !34, line: 186, baseType: !11, size: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !35, file: !34, line: 187, baseType: !11, size: 32, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !35, file: !34, line: 188, baseType: !11, size: 32, offset: 224)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !35, file: !34, line: 189, baseType: !11, size: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !35, file: !34, line: 190, baseType: !11, size: 32, offset: 288)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !35, file: !34, line: 198, baseType: !11, size: 32, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !35, file: !34, line: 215, baseType: !50, size: 288, offset: 352)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !35, file: !34, line: 200, size: 288, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !50, file: !34, line: 203, baseType: !11, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !50, file: !34, line: 204, baseType: !11, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !50, file: !34, line: 206, baseType: !11, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !50, file: !34, line: 209, baseType: !11, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !50, file: !34, line: 210, baseType: !11, size: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !50, file: !34, line: 211, baseType: !11, size: 32, offset: 160)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !50, file: !34, line: 212, baseType: !11, size: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !50, file: !34, line: 213, baseType: !11, size: 32, offset: 224)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !50, file: !34, line: 214, baseType: !11, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !35, file: !34, line: 218, baseType: !11, size: 32, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !35, file: !34, line: 219, baseType: !11, size: 32, offset: 672)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !35, file: !34, line: 220, baseType: !11, size: 32, offset: 704)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !35, file: !34, line: 221, baseType: !11, size: 32, offset: 736)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !35, file: !34, line: 222, baseType: !11, size: 32, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !35, file: !34, line: 224, baseType: !11, size: 32, offset: 800)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !35, file: !34, line: 225, baseType: !11, size: 32, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !35, file: !34, line: 226, baseType: !11, size: 32, offset: 864)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !35, file: !34, line: 227, baseType: !11, size: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !35, file: !34, line: 229, baseType: !11, size: 32, offset: 928)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !35, file: !34, line: 230, baseType: !11, size: 32, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !35, file: !34, line: 231, baseType: !11, size: 32, offset: 992)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !35, file: !34, line: 233, baseType: !11, size: 32, offset: 1024)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !35, file: !34, line: 234, baseType: !11, size: 32, offset: 1056)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !35, file: !34, line: 236, baseType: !11, size: 32, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !35, file: !34, line: 237, baseType: !11, size: 32, offset: 1120)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !35, file: !34, line: 239, baseType: !11, size: 32, offset: 1152)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !35, file: !34, line: 240, baseType: !23, size: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !35, file: !34, line: 241, baseType: !80, size: 128, offset: 1280)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 128, elements: !85)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !82, line: 24, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !9, line: 38, baseType: !84)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !35, file: !34, line: 242, baseType: !80, size: 128, offset: 1408)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !35, file: !34, line: 243, baseType: !80, size: 128, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !35, file: !34, line: 244, baseType: !80, size: 128, offset: 1664)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !35, file: !34, line: 245, baseType: !91, size: 512, offset: 1792)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 512, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !35, file: !34, line: 246, baseType: !91, size: 512, offset: 2304)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !35, file: !34, line: 249, baseType: !96, size: 64, offset: 2816)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !5, !11, !99, !101}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !103)
!103 = !{!104, !106, !107, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !102, file: !105, line: 211, baseType: !38, size: 32)
!105 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/matroska.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !102, file: !105, line: 211, baseType: !38, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !102, file: !105, line: 211, baseType: !5, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !102, file: !105, line: 211, baseType: !5, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !35, file: !34, line: 250, baseType: !5, size: 64, offset: 2880)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !35, file: !34, line: 251, baseType: !11, size: 32, offset: 2944)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !35, file: !34, line: 252, baseType: !11, size: 32, offset: 2976)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !35, file: !34, line: 253, baseType: !23, size: 64, offset: 3008)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !35, file: !34, line: 287, baseType: !114, size: 800, offset: 3072)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !35, file: !34, line: 256, size: 800, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !136, !137, !138, !142, !143}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !114, file: !34, line: 258, baseType: !38, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !114, file: !34, line: 259, baseType: !38, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !114, file: !34, line: 261, baseType: !11, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !114, file: !34, line: 262, baseType: !11, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !114, file: !34, line: 263, baseType: !11, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !114, file: !34, line: 264, baseType: !11, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !114, file: !34, line: 265, baseType: !11, size: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !114, file: !34, line: 267, baseType: !11, size: 32, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !114, file: !34, line: 268, baseType: !11, size: 32, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !114, file: !34, line: 269, baseType: !11, size: 32, offset: 288)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !114, file: !34, line: 270, baseType: !11, size: 32, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !114, file: !34, line: 271, baseType: !11, size: 32, offset: 352)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !114, file: !34, line: 272, baseType: !11, size: 32, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !114, file: !34, line: 273, baseType: !11, size: 32, offset: 416)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !114, file: !34, line: 274, baseType: !11, size: 32, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !114, file: !34, line: 275, baseType: !11, size: 32, offset: 480)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !114, file: !34, line: 276, baseType: !11, size: 32, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !114, file: !34, line: 277, baseType: !11, size: 32, offset: 544)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !114, file: !34, line: 278, baseType: !135, size: 32, offset: 576)
!135 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !114, file: !34, line: 279, baseType: !135, size: 32, offset: 608)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !114, file: !34, line: 280, baseType: !11, size: 32, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !114, file: !34, line: 283, baseType: !139, size: 64, offset: 672)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 2)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !114, file: !34, line: 285, baseType: !11, size: 32, offset: 736)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !114, file: !34, line: 286, baseType: !11, size: 32, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !35, file: !34, line: 327, baseType: !145, size: 1152, offset: 3904)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !35, file: !34, line: 290, size: 1152, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !184, !185}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !145, file: !34, line: 292, baseType: !11, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !145, file: !34, line: 294, baseType: !11, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !145, file: !34, line: 295, baseType: !11, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !145, file: !34, line: 296, baseType: !11, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !145, file: !34, line: 297, baseType: !11, size: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !145, file: !34, line: 299, baseType: !11, size: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !145, file: !34, line: 300, baseType: !135, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !145, file: !34, line: 301, baseType: !135, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !145, file: !34, line: 302, baseType: !135, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !145, file: !34, line: 303, baseType: !11, size: 32, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !145, file: !34, line: 304, baseType: !11, size: 32, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !145, file: !34, line: 305, baseType: !135, size: 32, offset: 352)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !145, file: !34, line: 306, baseType: !135, size: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !145, file: !34, line: 307, baseType: !135, size: 32, offset: 416)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !145, file: !34, line: 309, baseType: !11, size: 32, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !145, file: !34, line: 310, baseType: !135, size: 32, offset: 480)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !145, file: !34, line: 311, baseType: !11, size: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !145, file: !34, line: 312, baseType: !11, size: 32, offset: 544)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !145, file: !34, line: 315, baseType: !11, size: 32, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !145, file: !34, line: 316, baseType: !23, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !145, file: !34, line: 317, baseType: !11, size: 32, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !145, file: !34, line: 318, baseType: !23, size: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !145, file: !34, line: 321, baseType: !135, size: 32, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !145, file: !34, line: 322, baseType: !135, size: 32, offset: 864)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !145, file: !34, line: 323, baseType: !135, size: 32, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !145, file: !34, line: 324, baseType: !173, size: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !34, line: 174, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 167, size: 256, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !175, file: !34, line: 169, baseType: !11, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !175, file: !34, line: 169, baseType: !11, size: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !175, file: !34, line: 170, baseType: !11, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !175, file: !34, line: 171, baseType: !11, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !175, file: !34, line: 172, baseType: !135, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !175, file: !34, line: 173, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !145, file: !34, line: 325, baseType: !11, size: 32, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !145, file: !34, line: 326, baseType: !23, size: 64, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !35, file: !34, line: 330, baseType: !11, size: 32, offset: 5056)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !35, file: !34, line: 331, baseType: !11, size: 32, offset: 5088)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !35, file: !34, line: 332, baseType: !11, size: 32, offset: 5120)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !35, file: !34, line: 334, baseType: !11, size: 32, offset: 5152)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !35, file: !34, line: 335, baseType: !11, size: 32, offset: 5184)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !35, file: !34, line: 336, baseType: !192, size: 32, offset: 5216)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !82, line: 26, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 42, baseType: !38)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !35, file: !34, line: 337, baseType: !192, size: 32, offset: 5248)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !35, file: !34, line: 338, baseType: !192, size: 32, offset: 5280)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !35, file: !34, line: 339, baseType: !192, size: 32, offset: 5312)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !35, file: !34, line: 340, baseType: !11, size: 32, offset: 5344)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !35, file: !34, line: 344, baseType: !11, size: 32, offset: 5376)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !35, file: !34, line: 356, baseType: !11, size: 32, offset: 5408)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !35, file: !34, line: 364, baseType: !11, size: 32, offset: 5440)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !35, file: !34, line: 367, baseType: !11, size: 32, offset: 5472)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !35, file: !34, line: 368, baseType: !11, size: 32, offset: 5504)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !35, file: !34, line: 369, baseType: !11, size: 32, offset: 5536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !35, file: !34, line: 375, baseType: !205, size: 64, offset: 5568)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !5}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "write_headers", scope: !17, file: !16, line: 31, baseType: !209, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!11, !26, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !34, line: 604, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 593, size: 192, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !214, file: !34, line: 595, baseType: !11, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !214, file: !34, line: 596, baseType: !11, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !214, file: !34, line: 599, baseType: !11, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !214, file: !34, line: 603, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame", scope: !17, file: !16, line: 32, baseType: !222, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!11, !26, !220, !11, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !34, line: 549, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 513, size: 1088, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !248, !257}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !227, file: !34, line: 521, baseType: !11, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !227, file: !34, line: 523, baseType: !11, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !227, file: !34, line: 526, baseType: !11, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !227, file: !34, line: 529, baseType: !11, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !227, file: !34, line: 531, baseType: !6, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !227, file: !34, line: 534, baseType: !6, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !227, file: !34, line: 541, baseType: !32, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !227, file: !34, line: 543, baseType: !237, size: 448, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !34, line: 511, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 505, size: 448, elements: !239)
!239 = !{!240, !241, !242, !246}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !238, file: !34, line: 507, baseType: !11, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !238, file: !34, line: 508, baseType: !11, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !238, file: !34, line: 509, baseType: !243, size: 128, offset: 64)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 128, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 4)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !238, file: !34, line: 510, baseType: !247, size: 256, offset: 192)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 256, elements: !244)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !227, file: !34, line: 545, baseType: !249, size: 256, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !34, line: 503, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 496, size: 256, elements: !251)
!251 = !{!252, !254, !255, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !250, file: !34, line: 498, baseType: !253, size: 64)
!253 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !250, file: !34, line: 499, baseType: !253, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !250, file: !34, line: 500, baseType: !253, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !250, file: !34, line: 502, baseType: !253, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !227, file: !34, line: 548, baseType: !5, size: 64, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !17, file: !16, line: 33, baseType: !259, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!11, !26, !6, !6}
!262 = !{i32 7, !"Dwarf Version", i32 5}
!263 = !{i32 2, !"Debug Info Version", i32 3}
!264 = !{i32 1, !"wchar_size", i32 4}
!265 = !{i32 7, !"PIC Level", i32 2}
!266 = !{i32 7, !"PIE Level", i32 2}
!267 = !{i32 7, !"uwtable", i32 2}
!268 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!269 = distinct !DISubprogram(name: "open_file", scope: !13, file: !13, line: 38, type: !21, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !270)
!270 = !{!271, !272, !273}
!271 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !269, file: !13, line: 38, type: !23)
!272 = !DILocalVariable(name: "p_handle", arg: 2, scope: !269, file: !13, line: 38, type: !25)
!273 = !DILocalVariable(name: "p_mkv", scope: !269, file: !13, line: 40, type: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "mkv_hnd_t", file: !13, line: 36, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 24, size: 384, elements: !277)
!277 = !{!278, !283, !284, !285, !286, !287, !288, !290, !291}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !276, file: !13, line: 26, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_writer", file: !281, line: 24, baseType: !282)
!281 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/matroska_ebml.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1745c5eb41455b01e98496f56a8b1e8e")
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "mk_writer", file: !281, line: 24, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !276, file: !13, line: 28, baseType: !11, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !276, file: !13, line: 28, baseType: !11, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "d_width", scope: !276, file: !13, line: 28, baseType: !11, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "d_height", scope: !276, file: !13, line: 28, baseType: !11, size: 32, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "frame_duration", scope: !276, file: !13, line: 30, baseType: !6, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_writing_frame", scope: !276, file: !13, line: 32, baseType: !289, size: 8, offset: 256)
!289 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !276, file: !13, line: 33, baseType: !192, size: 32, offset: 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !276, file: !13, line: 34, baseType: !192, size: 32, offset: 320)
!292 = !DILocation(line: 0, scope: !269)
!293 = !DILocation(line: 42, column: 15, scope: !269)
!294 = !{!295, !295, i64 0}
!295 = !{!"any pointer", !296, i64 0}
!296 = !{!"omnipotent char", !297, i64 0}
!297 = !{!"Simple C/C++ TBAA"}
!298 = !DILocation(line: 44, column: 14, scope: !269)
!299 = !DILocation(line: 45, column: 10, scope: !300)
!300 = distinct !DILexicalBlock(scope: !269, file: !13, line: 45, column: 9)
!301 = !DILocation(line: 45, column: 9, scope: !269)
!302 = !DILocation(line: 50, column: 16, scope: !269)
!303 = !DILocation(line: 50, column: 14, scope: !269)
!304 = !{!305, !295, i64 0}
!305 = !{!"", !295, i64 0, !306, i64 8, !306, i64 12, !306, i64 16, !306, i64 20, !307, i64 24, !296, i64 32, !306, i64 36, !306, i64 40}
!306 = !{!"int", !296, i64 0}
!307 = !{!"long", !296, i64 0}
!308 = !DILocation(line: 51, column: 10, scope: !309)
!309 = distinct !DILexicalBlock(scope: !269, file: !13, line: 51, column: 9)
!310 = !DILocation(line: 51, column: 9, scope: !269)
!311 = !DILocation(line: 53, column: 9, scope: !312)
!312 = distinct !DILexicalBlock(scope: !309, file: !13, line: 52, column: 5)
!313 = !DILocation(line: 54, column: 9, scope: !312)
!314 = !DILocation(line: 57, column: 15, scope: !269)
!315 = !DILocation(line: 59, column: 5, scope: !269)
!316 = !DILocation(line: 60, column: 1, scope: !269)
!317 = distinct !DISubprogram(name: "set_param", scope: !13, file: !13, line: 62, type: !30, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !318)
!318 = !{!319, !320, !321, !322, !323, !324}
!319 = !DILocalVariable(name: "handle", arg: 1, scope: !317, file: !13, line: 62, type: !26)
!320 = !DILocalVariable(name: "p_param", arg: 2, scope: !317, file: !13, line: 62, type: !32)
!321 = !DILocalVariable(name: "p_mkv", scope: !317, file: !13, line: 64, type: !274)
!322 = !DILocalVariable(name: "dw", scope: !317, file: !13, line: 65, type: !6)
!323 = !DILocalVariable(name: "dh", scope: !317, file: !13, line: 65, type: !6)
!324 = !DILocalVariable(name: "x", scope: !325, file: !13, line: 93, type: !6)
!325 = distinct !DILexicalBlock(scope: !326, file: !13, line: 92, column: 5)
!326 = distinct !DILexicalBlock(scope: !317, file: !13, line: 91, column: 9)
!327 = !DILocation(line: 0, scope: !317)
!328 = !DILocation(line: 67, column: 18, scope: !329)
!329 = distinct !DILexicalBlock(scope: !317, file: !13, line: 67, column: 9)
!330 = !{!331, !306, i64 652}
!331 = !{!"x264_param_t", !306, i64 0, !306, i64 4, !306, i64 8, !306, i64 12, !306, i64 16, !306, i64 20, !306, i64 24, !306, i64 28, !306, i64 32, !306, i64 36, !306, i64 40, !332, i64 44, !306, i64 80, !306, i64 84, !306, i64 88, !306, i64 92, !306, i64 96, !306, i64 100, !306, i64 104, !306, i64 108, !306, i64 112, !306, i64 116, !306, i64 120, !306, i64 124, !306, i64 128, !306, i64 132, !306, i64 136, !306, i64 140, !306, i64 144, !295, i64 152, !296, i64 160, !296, i64 176, !296, i64 192, !296, i64 208, !296, i64 224, !296, i64 288, !295, i64 352, !295, i64 360, !306, i64 368, !306, i64 372, !295, i64 376, !333, i64 384, !335, i64 488, !306, i64 632, !306, i64 636, !306, i64 640, !306, i64 644, !306, i64 648, !306, i64 652, !306, i64 656, !306, i64 660, !306, i64 664, !306, i64 668, !306, i64 672, !306, i64 676, !306, i64 680, !306, i64 684, !306, i64 688, !306, i64 692, !295, i64 696}
!332 = !{!"", !306, i64 0, !306, i64 4, !306, i64 8, !306, i64 12, !306, i64 16, !306, i64 20, !306, i64 24, !306, i64 28, !306, i64 32}
