; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/output/matroska_ebml.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/output/matroska_ebml.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mk_writer = type { ptr, i32, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i8, i8, i8, i8 }
%struct.mk_context = type { ptr, ptr, ptr, ptr, i32, ptr, i32, i32 }

@.str = private unnamed_addr constant [2 x i8] c"-\00", align 1
@stdout = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.3 = private unnamed_addr constant [25 x i8] c"Haali Matroska Writer b0\00", align 1

; Function Attrs: nounwind uwtable
define dso_local ptr @mk_create_writer(ptr nocapture noundef readonly %filename) local_unnamed_addr #0 !dbg !15 {
entry:
  call void @llvm.dbg.value(metadata ptr %filename, metadata !121, metadata !DIExpression()), !dbg !123
  %calloc = call dereferenceable_or_null(104) ptr @calloc(i64 1, i64 104), !dbg !124
  call void @llvm.dbg.value(metadata ptr %calloc, metadata !122, metadata !DIExpression()), !dbg !123
  %tobool.not = icmp eq ptr %calloc, null, !dbg !125
  br i1 %tobool.not, label %cleanup, label %if.else.i, !dbg !127

if.else.i:                                        ; preds = %entry

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/output/matroska_ebml.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "1fa174e60935636d7a8dc8807d29ae1b")
!2 = !{!3, !4, !5, !7}
!3 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!4 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !{i32 7, !"Dwarf Version", i32 5}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 1, !"wchar_size", i32 4}
!11 = !{i32 7, !"PIC Level", i32 2}
!12 = !{i32 7, !"PIE Level", i32 2}
!13 = !{i32 7, !"uwtable", i32 2}
!14 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!15 = distinct !DISubprogram(name: "mk_create_writer", scope: !16, file: !16, line: 287, type: !17, scopeLine: 288, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !120)
!16 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/matroska_ebml.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1fa174e60935636d7a8dc8807d29ae1b")
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !118}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_writer", file: !21, line: 24, baseType: !22)
!21 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/matroska_ebml.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1745c5eb41455b01e98496f56a8b1e8e")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mk_writer", file: !16, line: 43, size: 832, elements: !23)
!23 = !{!24, !85, !87, !102, !103, !104, !105, !106, !110, !111, !112, !113, !114, !115, !116, !117}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !22, file: !16, line: 45, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !27, line: 7, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 49, size: 1728, elements: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!30 = !{!31, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !47, !49, !50, !51, !55, !57, !59, !63, !66, !68, !71, !74, !75, !76, !80, !81}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !28, file: !29, line: 51, baseType: !32, size: 32)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !28, file: !29, line: 54, baseType: !5, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !28, file: !29, line: 55, baseType: !5, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !28, file: !29, line: 56, baseType: !5, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !28, file: !29, line: 57, baseType: !5, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !28, file: !29, line: 58, baseType: !5, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !28, file: !29, line: 59, baseType: !5, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !28, file: !29, line: 60, baseType: !5, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !28, file: !29, line: 61, baseType: !5, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !28, file: !29, line: 64, baseType: !5, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !28, file: !29, line: 65, baseType: !5, size: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !28, file: !29, line: 66, baseType: !5, size: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !28, file: !29, line: 68, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !29, line: 36, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !28, file: !29, line: 70, baseType: !48, size: 64, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !28, file: !29, line: 72, baseType: !32, size: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !28, file: !29, line: 73, baseType: !32, size: 32, offset: 928)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !28, file: !29, line: 74, baseType: !52, size: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !53, line: 152, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !28, file: !29, line: 77, baseType: !56, size: 16, offset: 1024)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !28, file: !29, line: 78, baseType: !58, size: 8, offset: 1040)
!58 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !28, file: !29, line: 79, baseType: !60, size: 8, offset: 1048)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 1)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !28, file: !29, line: 81, baseType: !64, size: 64, offset: 1088)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !29, line: 43, baseType: null)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !28, file: !29, line: 89, baseType: !67, size: 64, offset: 1152)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !53, line: 153, baseType: !54)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !28, file: !29, line: 91, baseType: !69, size: 64, offset: 1216)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !29, line: 37, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !28, file: !29, line: 92, baseType: !72, size: 64, offset: 1280)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !29, line: 38, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !28, file: !29, line: 93, baseType: !48, size: 64, offset: 1344)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !28, file: !29, line: 94, baseType: !7, size: 64, offset: 1408)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !28, file: !29, line: 95, baseType: !77, size: 64, offset: 1472)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 46, baseType: !79)
!78 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!79 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !28, file: !29, line: 96, baseType: !32, size: 32, offset: 1536)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !28, file: !29, line: 98, baseType: !82, size: 160, offset: 1568)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 20)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "duration_ptr", scope: !22, file: !16, line: 47, baseType: !86, size: 32, offset: 64)
!86 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !22, file: !16, line: 49, baseType: !88, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_context", file: !16, line: 41, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mk_context", file: !16, line: 31, size: 448, elements: !91)
!91 = !{!92, !94, !96, !97, !98, !99, !100, !101}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !90, file: !16, line: 33, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !90, file: !16, line: 33, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !90, file: !16, line: 33, baseType: !93, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !90, file: !16, line: 34, baseType: !19, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !90, file: !16, line: 35, baseType: !86, size: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !16, line: 37, baseType: !7, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !90, file: !16, line: 38, baseType: !86, size: 32, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !90, file: !16, line: 38, baseType: !86, size: 32, offset: 416)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cluster", scope: !22, file: !16, line: 49, baseType: !88, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !22, file: !16, line: 49, baseType: !88, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !22, file: !16, line: 50, baseType: !88, size: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "actlist", scope: !22, file: !16, line: 51, baseType: !88, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "def_duration", scope: !22, file: !16, line: 53, baseType: !107, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !108, line: 27, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 44, baseType: !54)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "timescale", scope: !22, file: !16, line: 54, baseType: !107, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_tc_scaled", scope: !22, file: !16, line: 55, baseType: !107, size: 64, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "frame_tc", scope: !22, file: !16, line: 56, baseType: !107, size: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_tc", scope: !22, file: !16, line: 56, baseType: !107, size: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "wrote_header", scope: !22, file: !16, line: 58, baseType: !58, size: 8, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "in_frame", scope: !22, file: !16, line: 58, baseType: !58, size: 8, offset: 776)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe", scope: !22, file: !16, line: 58, baseType: !58, size: 8, offset: 784)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "skippable", scope: !22, file: !16, line: 58, baseType: !58, size: 8, offset: 792)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!120 = !{!121, !122}
!121 = !DILocalVariable(name: "filename", arg: 1, scope: !15, file: !16, line: 287, type: !118)
!122 = !DILocalVariable(name: "w", scope: !15, file: !16, line: 289, type: !19)
!123 = !DILocation(line: 0, scope: !15)
!124 = !DILocation(line: 289, column: 20, scope: !15)
!125 = !DILocation(line: 290, column: 10, scope: !126)
!126 = distinct !DILexicalBlock(scope: !15, file: !16, line: 290, column: 9)
!127 = !DILocation(line: 290, column: 9, scope: !15)
!128 = !DILocalVariable(name: "w", arg: 1, scope: !129, file: !16, line: 61, type: !19)
!129 = distinct !DISubprogram(name: "mk_create_context", scope: !16, file: !16, line: 61, type: !130, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{!88, !19, !88, !86}
!132 = !{!128, !133, !134, !135}
!133 = !DILocalVariable(name: "parent", arg: 2, scope: !129, file: !16, line: 61, type: !88)
!134 = !DILocalVariable(name: "id", arg: 3, scope: !129, file: !16, line: 61, type: !86)
!135 = !DILocalVariable(name: "c", scope: !129, file: !16, line: 63, type: !88)
!136 = !DILocation(line: 0, scope: !129, inlinedAt: !137)
!137 = distinct !DILocation(line: 295, column: 15, scope: !15)
!138 = !DILocation(line: 65, column: 12, scope: !139, inlinedAt: !137)
!139 = distinct !DILexicalBlock(scope: !129, file: !16, line: 65, column: 9)
!140 = !DILocation(line: 72, column: 13, scope: !141, inlinedAt: !137)
!141 = distinct !DILexicalBlock(scope: !139, file: !16, line: 71, column: 5)
!142 = !DILocation(line: 73, column: 14, scope: !143, inlinedAt: !137)
!143 = distinct !DILexicalBlock(scope: !141, file: !16, line: 73, column: 13)
!144 = !DILocation(line: 73, column: 13, scope: !141, inlinedAt: !137)
!145 = !DILocation(line: 298, column: 9, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !16, line: 297, column: 5)
!147 = distinct !DILexicalBlock(scope: !15, file: !16, line: 296, column: 9)
!148 = !DILocation(line: 299, column: 9, scope: !146)
!149 = !DILocation(line: 79, column: 8, scope: !129, inlinedAt: !137)
!150 = !DILocation(line: 79, column: 14, scope: !129, inlinedAt: !137)
!151 = !{!152, !153, i64 24}
!152 = !{!"mk_context", !153, i64 0, !153, i64 8, !153, i64 16, !153, i64 24, !156, i64 32, !153, i64 40, !156, i64 48, !156, i64 52}
!153 = !{!"any pointer", !154, i64 0}
!154 = !{!"omnipotent char", !155, i64 0}
!155 = !{!"Simple C/C++ TBAA"}
!156 = !{!"int", !154, i64 0}
!157 = !DILocation(line: 82, column: 19, scope: !158, inlinedAt: !137)
!158 = distinct !DILexicalBlock(scope: !129, file: !16, line: 82, column: 9)
!159 = !DILocation(line: 85, column: 8, scope: !129, inlinedAt: !137)
!160 = !DILocation(line: 85, column: 13, scope: !129, inlinedAt: !137)
!161 = !{!152, !153, i64 8}
!162 = !DILocation(line: 86, column: 23, scope: !129, inlinedAt: !137)
!163 = !{!164, !153, i64 48}
!164 = !{!"mk_writer", !153, i64 0, !156, i64 8, !153, i64 16, !153, i64 24, !153, i64 32, !153, i64 40, !153, i64 48, !165, i64 56, !165, i64 64, !165, i64 72, !165, i64 80, !165, i64 88, !154, i64 96, !154, i64 97, !154, i64 98, !154, i64 99}
!165 = !{!"long", !154, i64 0}
!166 = !DILocation(line: 295, column: 8, scope: !15)
!167 = !DILocation(line: 295, column: 13, scope: !15)
!168 = !{!164, !153, i64 16}
!169 = !DILocation(line: 302, column: 10, scope: !170)
!170 = distinct !DILexicalBlock(scope: !15, file: !16, line: 302, column: 9)
!171 = !DILocation(line: 302, column: 9, scope: !15)
!172 = !DILocation(line: 303, column: 17, scope: !170)
!173 = !{!153, !153, i64 0}
!174 = !DILocation(line: 303, column: 9, scope: !170)
!175 = !DILocation(line: 305, column: 17, scope: !170)
