; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/common/mc.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/mc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, ptr, [8 x i8] }
%struct.x264_frame = type { i32, i32, i32, i64, i64, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, float, float, i32, i32, [3 x i32], [3 x i32], [3 x i32], i32, i32, i32, [3 x ptr], [4 x ptr], [4 x ptr], ptr, [4 x ptr], [4 x ptr], [8 x i8], [16 x [3 x %struct.x264_weight_t]], [16 x ptr], i32, ptr, ptr, ptr, [2 x ptr], ptr, [2 x [17 x ptr]], [18 x [18 x ptr]], [2 x [17 x ptr]], [2 x ptr], [2 x i32], [2 x [16 x i32]], [2 x i16], [18 x [18 x i32]], [18 x [18 x i32]], i32, [18 x i32], [18 x [18 x ptr]], ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, ptr, i32, [18 x float], i32, i64, %struct.x264_hrd_t, [251 x i8], [251 x i32], [251 x double], i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32 }
%struct.x264_hrd_t = type { double, double, double, double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "weight_none", scope: !2, file: !28, line: 171, type: !70, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/mc.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "5b5840f7c133c196a2452d152d36293d")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9056d80edbb4dc2514d271d596c298e")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "PIXEL_16x16", value: 0)
!10 = !DIEnumerator(name: "PIXEL_16x8", value: 1)
!11 = !DIEnumerator(name: "PIXEL_8x16", value: 2)
!12 = !DIEnumerator(name: "PIXEL_8x8", value: 3)
!13 = !DIEnumerator(name: "PIXEL_8x4", value: 4)
!14 = !DIEnumerator(name: "PIXEL_4x8", value: 5)
!15 = !DIEnumerator(name: "PIXEL_4x4", value: 6)
!16 = !DIEnumerator(name: "PIXEL_4x2", value: 7)
!17 = !DIEnumerator(name: "PIXEL_2x4", value: 8)
!18 = !DIEnumerator(name: "PIXEL_2x2", value: 9)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !21, line: 27, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 44, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!24 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!25 = !{!0, !26, !37, !39}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "hpel_ref0", scope: !2, file: !28, line: 206, type: !29, isLocal: true, isDefinition: true)
!28 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5b5840f7c133c196a2452d152d36293d")
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !35)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !23, line: 38, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!36}
!36 = !DISubrange(count: 16)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "hpel_ref1", scope: !2, file: !28, line: 207, type: !29, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "x264_mc_weight_wtab", scope: !2, file: !28, line: 162, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 384, elements: !68)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !43, line: 25, baseType: !44)
!43 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !47, !48, !47, !48, !49, !48}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !43, line: 26, size: 512, elements: !52)
!52 = !{!53, !60, !61, !64, !65, !66}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !51, file: !43, line: 30, baseType: !54, size: 128, align: 128)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !58)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !21, line: 25, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !23, line: 39, baseType: !57)
!57 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!58 = !{!59}
!59 = !DISubrange(count: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !51, file: !43, line: 31, baseType: !54, size: 128, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !51, file: !43, line: 32, baseType: !62, size: 32, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !21, line: 26, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !23, line: 41, baseType: !48)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !51, file: !43, line: 33, baseType: !62, size: 32, offset: 288)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !51, file: !43, line: 34, baseType: !62, size: 32, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !51, file: !43, line: 35, baseType: !67, size: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!68 = !{!69}
!69 = !DISubrange(count: 6)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1536, align: 128, elements: !73)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !43, line: 36, baseType: !51, align: 128)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !{i32 7, !"Dwarf Version", i32 5}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{i32 1, !"wchar_size", i32 4}
!78 = !{i32 7, !"PIC Level", i32 2}
!79 = !{i32 7, !"PIE Level", i32 2}
!80 = !{i32 7, !"uwtable", i32 2}
!81 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!82 = distinct !DISubprogram(name: "x264_plane_copy_c", scope: !28, file: !28, line: 299, type: !83, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !85)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !47, !48, !47, !48, !48, !48}
!85 = !{!86, !87, !88, !89, !90, !91}
!86 = !DILocalVariable(name: "dst", arg: 1, scope: !82, file: !28, line: 299, type: !47)
!87 = !DILocalVariable(name: "i_dst", arg: 2, scope: !82, file: !28, line: 299, type: !48)
!88 = !DILocalVariable(name: "src", arg: 3, scope: !82, file: !28, line: 300, type: !47)
!89 = !DILocalVariable(name: "i_src", arg: 4, scope: !82, file: !28, line: 300, type: !48)
!90 = !DILocalVariable(name: "w", arg: 5, scope: !82, file: !28, line: 300, type: !48)
!91 = !DILocalVariable(name: "h", arg: 6, scope: !82, file: !28, line: 300, type: !48)
!92 = !DILocation(line: 0, scope: !82)
!93 = !DILocation(line: 302, column: 5, scope: !82)
!94 = !DILocation(line: 302, column: 13, scope: !82)
!95 = !DILocation(line: 304, column: 9, scope: !96)
!96 = distinct !DILexicalBlock(scope: !82, file: !28, line: 303, column: 5)
!97 = !DILocation(line: 305, column: 13, scope: !96)
!98 = !DILocation(line: 306, column: 13, scope: !96)
!99 = distinct !{!99, !93, !100, !101, !102}
!100 = !DILocation(line: 307, column: 5, scope: !82)
!101 = !{!"llvm.loop.mustprogress"}
!102 = !{!"llvm.loop.unroll.disable"}
!103 = !DILocation(line: 308, column: 1, scope: !82)
!104 = distinct !DISubprogram(name: "x264_frame_init_lowres", scope: !28, file: !28, line: 356, type: !105, scopeLine: 357, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1376)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107, !566}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !111, line: 381, size: 266752, elements: !112)
!111 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!112 = !{!113, !284, !288, !289, !290, !291, !292, !293, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !427, !429, !454, !456, !457, !458, !464, !468, !469, !470, !477, !481, !482, !483, !488, !491, !492, !544, !561, !722, !723, !724, !725, !729, !730, !731, !732, !733, !734, !735, !750, !944, !948, !1009, !1012, !1014, !1016, !1017, !1020, !1025, !1034, !1035, !1043, !1045, !1050, !1125, !1208, !1252, !1274, !1323, !1352}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !110, file: !111, line: 384, baseType: !114, size: 5632)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !109, line: 376, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !109, line: 176, size: 5632, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !160, !162, !163, !164, !165, !169, !170, !185, !186, !187, !188, !189, !220, !262, !263, !264, !265, !266, !267, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !115, file: !109, line: 179, baseType: !7, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !115, file: !109, line: 180, baseType: !48, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !115, file: !109, line: 181, baseType: !48, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !115, file: !109, line: 182, baseType: !48, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !115, file: !109, line: 183, baseType: !48, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !115, file: !109, line: 186, baseType: !48, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !115, file: !109, line: 187, baseType: !48, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !115, file: !109, line: 188, baseType: !48, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !115, file: !109, line: 189, baseType: !48, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !115, file: !109, line: 190, baseType: !48, size: 32, offset: 288)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !115, file: !109, line: 198, baseType: !48, size: 32, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !115, file: !109, line: 215, baseType: !129, size: 288, offset: 352)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !115, file: !109, line: 200, size: 288, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !129, file: !109, line: 203, baseType: !48, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !129, file: !109, line: 204, baseType: !48, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !129, file: !109, line: 206, baseType: !48, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !129, file: !109, line: 209, baseType: !48, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !129, file: !109, line: 210, baseType: !48, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !129, file: !109, line: 211, baseType: !48, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !129, file: !109, line: 212, baseType: !48, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !129, file: !109, line: 213, baseType: !48, size: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !129, file: !109, line: 214, baseType: !48, size: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !115, file: !109, line: 218, baseType: !48, size: 32, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !115, file: !109, line: 219, baseType: !48, size: 32, offset: 672)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !115, file: !109, line: 220, baseType: !48, size: 32, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !115, file: !109, line: 221, baseType: !48, size: 32, offset: 736)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !115, file: !109, line: 222, baseType: !48, size: 32, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !115, file: !109, line: 224, baseType: !48, size: 32, offset: 800)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !115, file: !109, line: 225, baseType: !48, size: 32, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !115, file: !109, line: 226, baseType: !48, size: 32, offset: 864)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !115, file: !109, line: 227, baseType: !48, size: 32, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !115, file: !109, line: 229, baseType: !48, size: 32, offset: 928)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !115, file: !109, line: 230, baseType: !48, size: 32, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !115, file: !109, line: 231, baseType: !48, size: 32, offset: 992)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !115, file: !109, line: 233, baseType: !48, size: 32, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !115, file: !109, line: 234, baseType: !48, size: 32, offset: 1056)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !115, file: !109, line: 236, baseType: !48, size: 32, offset: 1088)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !115, file: !109, line: 237, baseType: !48, size: 32, offset: 1120)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !115, file: !109, line: 239, baseType: !48, size: 32, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !115, file: !109, line: 240, baseType: !158, size: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !115, file: !109, line: 241, baseType: !161, size: 128, offset: 1280)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !35)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !115, file: !109, line: 242, baseType: !161, size: 128, offset: 1408)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !115, file: !109, line: 243, baseType: !161, size: 128, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !115, file: !109, line: 244, baseType: !161, size: 128, offset: 1664)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !115, file: !109, line: 245, baseType: !166, size: 512, offset: 1792)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 512, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !115, file: !109, line: 246, baseType: !166, size: 512, offset: 2304)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !115, file: !109, line: 249, baseType: !171, size: 64, offset: 2816)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174, !48, !175, !177}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !179)
!179 = !{!180, !182, !183, !184}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !178, file: !181, line: 308, baseType: !7, size: 32)
!181 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !178, file: !181, line: 308, baseType: !7, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !178, file: !181, line: 308, baseType: !174, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !178, file: !181, line: 308, baseType: !174, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !115, file: !109, line: 250, baseType: !174, size: 64, offset: 2880)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !115, file: !109, line: 251, baseType: !48, size: 32, offset: 2944)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !115, file: !109, line: 252, baseType: !48, size: 32, offset: 2976)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !115, file: !109, line: 253, baseType: !158, size: 64, offset: 3008)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !115, file: !109, line: 287, baseType: !190, size: 800, offset: 3072)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !115, file: !109, line: 256, size: 800, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !212, !213, !214, !218, !219}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !190, file: !109, line: 258, baseType: !7, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !190, file: !109, line: 259, baseType: !7, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !190, file: !109, line: 261, baseType: !48, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !190, file: !109, line: 262, baseType: !48, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !190, file: !109, line: 263, baseType: !48, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !190, file: !109, line: 264, baseType: !48, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !190, file: !109, line: 265, baseType: !48, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !190, file: !109, line: 267, baseType: !48, size: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !190, file: !109, line: 268, baseType: !48, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !190, file: !109, line: 269, baseType: !48, size: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !190, file: !109, line: 270, baseType: !48, size: 32, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !190, file: !109, line: 271, baseType: !48, size: 32, offset: 352)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !190, file: !109, line: 272, baseType: !48, size: 32, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !190, file: !109, line: 273, baseType: !48, size: 32, offset: 416)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !190, file: !109, line: 274, baseType: !48, size: 32, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !190, file: !109, line: 275, baseType: !48, size: 32, offset: 480)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !190, file: !109, line: 276, baseType: !48, size: 32, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !190, file: !109, line: 277, baseType: !48, size: 32, offset: 544)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !190, file: !109, line: 278, baseType: !211, size: 32, offset: 576)
!211 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !190, file: !109, line: 279, baseType: !211, size: 32, offset: 608)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !190, file: !109, line: 280, baseType: !48, size: 32, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !190, file: !109, line: 283, baseType: !215, size: 64, offset: 672)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 2)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !190, file: !109, line: 285, baseType: !48, size: 32, offset: 736)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !190, file: !109, line: 286, baseType: !48, size: 32, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !115, file: !109, line: 327, baseType: !221, size: 1152, offset: 3904)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !115, file: !109, line: 290, size: 1152, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !260, !261}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !221, file: !109, line: 292, baseType: !48, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !221, file: !109, line: 294, baseType: !48, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !221, file: !109, line: 295, baseType: !48, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !221, file: !109, line: 296, baseType: !48, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !221, file: !109, line: 297, baseType: !48, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !221, file: !109, line: 299, baseType: !48, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !221, file: !109, line: 300, baseType: !211, size: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !221, file: !109, line: 301, baseType: !211, size: 32, offset: 224)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !221, file: !109, line: 302, baseType: !211, size: 32, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !221, file: !109, line: 303, baseType: !48, size: 32, offset: 288)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !221, file: !109, line: 304, baseType: !48, size: 32, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !221, file: !109, line: 305, baseType: !211, size: 32, offset: 352)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !221, file: !109, line: 306, baseType: !211, size: 32, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !221, file: !109, line: 307, baseType: !211, size: 32, offset: 416)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !221, file: !109, line: 309, baseType: !48, size: 32, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !221, file: !109, line: 310, baseType: !211, size: 32, offset: 480)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !221, file: !109, line: 311, baseType: !48, size: 32, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !221, file: !109, line: 312, baseType: !48, size: 32, offset: 544)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !221, file: !109, line: 315, baseType: !48, size: 32, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !221, file: !109, line: 316, baseType: !158, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !221, file: !109, line: 317, baseType: !48, size: 32, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !221, file: !109, line: 318, baseType: !158, size: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !221, file: !109, line: 321, baseType: !211, size: 32, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !221, file: !109, line: 322, baseType: !211, size: 32, offset: 864)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !221, file: !109, line: 323, baseType: !211, size: 32, offset: 896)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !221, file: !109, line: 324, baseType: !249, size: 64, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !109, line: 174, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 167, size: 256, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !251, file: !109, line: 169, baseType: !48, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !251, file: !109, line: 169, baseType: !48, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !251, file: !109, line: 170, baseType: !48, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !251, file: !109, line: 171, baseType: !48, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !251, file: !109, line: 172, baseType: !211, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !251, file: !109, line: 173, baseType: !259, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !221, file: !109, line: 325, baseType: !48, size: 32, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !221, file: !109, line: 326, baseType: !158, size: 64, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !115, file: !109, line: 330, baseType: !48, size: 32, offset: 5056)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !115, file: !109, line: 331, baseType: !48, size: 32, offset: 5088)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !115, file: !109, line: 332, baseType: !48, size: 32, offset: 5120)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !115, file: !109, line: 334, baseType: !48, size: 32, offset: 5152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !115, file: !109, line: 335, baseType: !48, size: 32, offset: 5184)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !115, file: !109, line: 336, baseType: !268, size: 32, offset: 5216)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 26, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !23, line: 42, baseType: !7)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !115, file: !109, line: 337, baseType: !268, size: 32, offset: 5248)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !115, file: !109, line: 338, baseType: !268, size: 32, offset: 5280)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !115, file: !109, line: 339, baseType: !268, size: 32, offset: 5312)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !115, file: !109, line: 340, baseType: !48, size: 32, offset: 5344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !115, file: !109, line: 344, baseType: !48, size: 32, offset: 5376)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !115, file: !109, line: 356, baseType: !48, size: 32, offset: 5408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !115, file: !109, line: 364, baseType: !48, size: 32, offset: 5440)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !115, file: !109, line: 367, baseType: !48, size: 32, offset: 5472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !115, file: !109, line: 368, baseType: !48, size: 32, offset: 5504)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !115, file: !109, line: 369, baseType: !48, size: 32, offset: 5536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !115, file: !109, line: 375, baseType: !281, size: 64, offset: 5568)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !174}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !110, file: !111, line: 386, baseType: !285, size: 8256, offset: 5632)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 8256, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 129)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !110, file: !111, line: 387, baseType: !48, size: 32, offset: 13888)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !110, file: !111, line: 388, baseType: !48, size: 32, offset: 13920)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !110, file: !111, line: 389, baseType: !48, size: 32, offset: 13952)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !110, file: !111, line: 390, baseType: !48, size: 32, offset: 13984)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !110, file: !111, line: 391, baseType: !48, size: 32, offset: 14016)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !110, file: !111, line: 402, baseType: !294, size: 576, offset: 14080)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !111, line: 394, size: 576, elements: !295)
!295 = !{!296, !297, !298, !307, !308, !309}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !294, file: !111, line: 396, baseType: !48, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !294, file: !111, line: 397, baseType: !48, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !294, file: !111, line: 398, baseType: !299, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !109, line: 604, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 593, size: 192, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !301, file: !109, line: 595, baseType: !48, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !301, file: !109, line: 596, baseType: !48, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !301, file: !109, line: 599, baseType: !48, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !301, file: !109, line: 603, baseType: !47, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !294, file: !111, line: 399, baseType: !48, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !294, file: !111, line: 400, baseType: !47, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !294, file: !111, line: 401, baseType: !310, size: 320, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !311, line: 56, baseType: !312)
!311 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !311, line: 47, size: 320, elements: !313)
!313 = !{!314, !315, !316, !317, !320, !321}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !312, file: !311, line: 49, baseType: !47, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !312, file: !311, line: 50, baseType: !47, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !312, file: !311, line: 51, baseType: !47, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !312, file: !311, line: 53, baseType: !318, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !319, line: 87, baseType: !24)
!319 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !312, file: !311, line: 54, baseType: !48, size: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !312, file: !311, line: 55, baseType: !48, size: 32, offset: 288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !110, file: !111, line: 404, baseType: !47, size: 64, offset: 14656)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !110, file: !111, line: 405, baseType: !48, size: 32, offset: 14720)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !110, file: !111, line: 410, baseType: !48, size: 32, offset: 14752)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !110, file: !111, line: 411, baseType: !48, size: 32, offset: 14784)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !110, file: !111, line: 413, baseType: !48, size: 32, offset: 14816)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !110, file: !111, line: 415, baseType: !48, size: 32, offset: 14848)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !110, file: !111, line: 416, baseType: !48, size: 32, offset: 14880)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !110, file: !111, line: 418, baseType: !48, size: 32, offset: 14912)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !110, file: !111, line: 419, baseType: !48, size: 32, offset: 14944)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !110, file: !111, line: 420, baseType: !48, size: 32, offset: 14976)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !110, file: !111, line: 421, baseType: !48, size: 32, offset: 15008)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !110, file: !111, line: 422, baseType: !48, size: 32, offset: 15040)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !110, file: !111, line: 424, baseType: !48, size: 32, offset: 15072)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !110, file: !111, line: 425, baseType: !48, size: 32, offset: 15104)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !110, file: !111, line: 427, baseType: !48, size: 32, offset: 15136)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !110, file: !111, line: 430, baseType: !338, size: 10400, offset: 15168)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 10400, elements: !425)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !340, line: 154, baseType: !341)
!340 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 52, size: 10400, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !360, !361, !362, !363, !364, !365, !366, !367, !368, !375, !376, !424}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !341, file: !340, line: 54, baseType: !48, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !341, file: !340, line: 56, baseType: !48, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !341, file: !340, line: 57, baseType: !48, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !341, file: !340, line: 59, baseType: !48, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !341, file: !340, line: 60, baseType: !48, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !341, file: !340, line: 61, baseType: !48, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !341, file: !340, line: 63, baseType: !48, size: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !341, file: !340, line: 65, baseType: !48, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !341, file: !340, line: 67, baseType: !48, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !341, file: !340, line: 69, baseType: !48, size: 32, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !341, file: !340, line: 70, baseType: !48, size: 32, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !341, file: !340, line: 71, baseType: !48, size: 32, offset: 352)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !341, file: !340, line: 72, baseType: !48, size: 32, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !341, file: !340, line: 73, baseType: !357, size: 8192, offset: 416)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8192, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !341, file: !340, line: 75, baseType: !48, size: 32, offset: 8608)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !341, file: !340, line: 76, baseType: !48, size: 32, offset: 8640)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !341, file: !340, line: 77, baseType: !48, size: 32, offset: 8672)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !341, file: !340, line: 78, baseType: !48, size: 32, offset: 8704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !341, file: !340, line: 79, baseType: !48, size: 32, offset: 8736)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !341, file: !340, line: 80, baseType: !48, size: 32, offset: 8768)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !341, file: !340, line: 81, baseType: !48, size: 32, offset: 8800)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !341, file: !340, line: 83, baseType: !48, size: 32, offset: 8832)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !341, file: !340, line: 90, baseType: !369, size: 128, offset: 8864)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !341, file: !340, line: 84, size: 128, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !369, file: !340, line: 86, baseType: !48, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !369, file: !340, line: 87, baseType: !48, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !369, file: !340, line: 88, baseType: !48, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !369, file: !340, line: 89, baseType: !48, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !341, file: !340, line: 92, baseType: !48, size: 32, offset: 8992)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !341, file: !340, line: 150, baseType: !377, size: 1344, offset: 9024)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !341, file: !340, line: 93, size: 1344, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !377, file: !340, line: 95, baseType: !48, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !377, file: !340, line: 96, baseType: !48, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !377, file: !340, line: 97, baseType: !48, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !377, file: !340, line: 99, baseType: !48, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !377, file: !340, line: 100, baseType: !48, size: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !377, file: !340, line: 102, baseType: !48, size: 32, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !377, file: !340, line: 103, baseType: !48, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !377, file: !340, line: 104, baseType: !48, size: 32, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !377, file: !340, line: 105, baseType: !48, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !377, file: !340, line: 106, baseType: !48, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !377, file: !340, line: 107, baseType: !48, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !377, file: !340, line: 108, baseType: !48, size: 32, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !377, file: !340, line: 110, baseType: !48, size: 32, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !377, file: !340, line: 111, baseType: !48, size: 32, offset: 416)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !377, file: !340, line: 112, baseType: !48, size: 32, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !377, file: !340, line: 114, baseType: !48, size: 32, offset: 480)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !377, file: !340, line: 115, baseType: !268, size: 32, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !377, file: !340, line: 116, baseType: !268, size: 32, offset: 544)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !377, file: !340, line: 117, baseType: !48, size: 32, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !377, file: !340, line: 119, baseType: !48, size: 32, offset: 608)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !377, file: !340, line: 120, baseType: !48, size: 32, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !377, file: !340, line: 137, baseType: !401, size: 384, offset: 672)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !340, line: 122, size: 384, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !401, file: !340, line: 124, baseType: !48, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !401, file: !340, line: 125, baseType: !48, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !401, file: !340, line: 126, baseType: !48, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !401, file: !340, line: 127, baseType: !48, size: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !401, file: !340, line: 128, baseType: !48, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !401, file: !340, line: 129, baseType: !48, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !401, file: !340, line: 130, baseType: !48, size: 32, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !401, file: !340, line: 131, baseType: !48, size: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !401, file: !340, line: 133, baseType: !48, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !401, file: !340, line: 134, baseType: !48, size: 32, offset: 288)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !401, file: !340, line: 135, baseType: !48, size: 32, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !401, file: !340, line: 136, baseType: !48, size: 32, offset: 352)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !377, file: !340, line: 139, baseType: !48, size: 32, offset: 1056)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !377, file: !340, line: 140, baseType: !48, size: 32, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !377, file: !340, line: 141, baseType: !48, size: 32, offset: 1120)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !377, file: !340, line: 142, baseType: !48, size: 32, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !377, file: !340, line: 143, baseType: !48, size: 32, offset: 1184)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !377, file: !340, line: 144, baseType: !48, size: 32, offset: 1216)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !377, file: !340, line: 145, baseType: !48, size: 32, offset: 1248)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !377, file: !340, line: 146, baseType: !48, size: 32, offset: 1280)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !377, file: !340, line: 147, baseType: !48, size: 32, offset: 1312)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !341, file: !340, line: 152, baseType: !48, size: 32, offset: 10368)
!425 = !{!426}
!426 = !DISubrange(count: 1)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !110, file: !111, line: 431, baseType: !428, size: 64, offset: 25600)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !110, file: !111, line: 432, baseType: !430, size: 960, offset: 25664)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 960, elements: !425)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !340, line: 186, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 156, size: 960, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !432, file: !340, line: 158, baseType: !48, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !432, file: !340, line: 159, baseType: !48, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !432, file: !340, line: 161, baseType: !48, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !432, file: !340, line: 163, baseType: !48, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !432, file: !340, line: 164, baseType: !48, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !432, file: !340, line: 166, baseType: !48, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !432, file: !340, line: 167, baseType: !48, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !432, file: !340, line: 169, baseType: !48, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !432, file: !340, line: 170, baseType: !48, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !432, file: !340, line: 172, baseType: !48, size: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !432, file: !340, line: 173, baseType: !48, size: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !432, file: !340, line: 175, baseType: !48, size: 32, offset: 352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !432, file: !340, line: 177, baseType: !48, size: 32, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !432, file: !340, line: 178, baseType: !48, size: 32, offset: 416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !432, file: !340, line: 179, baseType: !48, size: 32, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !432, file: !340, line: 181, baseType: !48, size: 32, offset: 480)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !432, file: !340, line: 183, baseType: !48, size: 32, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !432, file: !340, line: 184, baseType: !452, size: 384, offset: 576)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 384, elements: !68)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !110, file: !111, line: 433, baseType: !455, size: 64, offset: 26624)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !110, file: !111, line: 434, baseType: !48, size: 32, offset: 26688)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !110, file: !111, line: 437, baseType: !48, size: 32, offset: 26720)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !110, file: !111, line: 440, baseType: !459, size: 256, offset: 26752)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 256, elements: !462)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 512, elements: !35)
!462 = !{!463}
!463 = !DISubrange(count: 4)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !110, file: !111, line: 441, baseType: !465, size: 128, offset: 27008)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 128, elements: !216)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !167)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !110, file: !111, line: 443, baseType: !459, size: 256, offset: 27136)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !110, file: !111, line: 444, baseType: !465, size: 128, offset: 27392)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !110, file: !111, line: 446, baseType: !471, size: 256, offset: 27520)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 256, elements: !462)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 256, elements: !35)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !32, line: 25, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 40, baseType: !476)
!476 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !110, file: !111, line: 447, baseType: !478, size: 128, offset: 27776)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 128, elements: !216)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 1024, elements: !167)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !110, file: !111, line: 448, baseType: !471, size: 256, offset: 27904)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !110, file: !111, line: 449, baseType: !478, size: 128, offset: 28160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !110, file: !111, line: 454, baseType: !484, size: 5888, offset: 28288)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 5888, elements: !486)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!486 = !{!487}
!487 = !DISubrange(count: 92)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !110, file: !111, line: 455, baseType: !489, size: 23552, offset: 34176)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 23552, elements: !490)
!490 = !{!487, !463}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !110, file: !111, line: 457, baseType: !453, size: 64, offset: 57728)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !110, file: !111, line: 460, baseType: !493, size: 53376, offset: 57856)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !111, line: 364, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 302, size: 53376, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !524, !528, !529, !530, !536, !537, !538, !539, !540, !541, !542, !543}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !494, file: !111, line: 304, baseType: !428, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !494, file: !111, line: 305, baseType: !455, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !494, file: !111, line: 307, baseType: !48, size: 32, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !494, file: !111, line: 308, baseType: !48, size: 32, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !494, file: !111, line: 309, baseType: !48, size: 32, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !494, file: !111, line: 311, baseType: !48, size: 32, offset: 224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !494, file: !111, line: 313, baseType: !48, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !494, file: !111, line: 315, baseType: !48, size: 32, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !494, file: !111, line: 316, baseType: !48, size: 32, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !494, file: !111, line: 317, baseType: !48, size: 32, offset: 352)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !494, file: !111, line: 319, baseType: !48, size: 32, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !494, file: !111, line: 321, baseType: !48, size: 32, offset: 416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !494, file: !111, line: 322, baseType: !48, size: 32, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !494, file: !111, line: 324, baseType: !215, size: 64, offset: 480)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !494, file: !111, line: 325, baseType: !48, size: 32, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !494, file: !111, line: 327, baseType: !48, size: 32, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !494, file: !111, line: 329, baseType: !48, size: 32, offset: 608)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !494, file: !111, line: 330, baseType: !48, size: 32, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !494, file: !111, line: 331, baseType: !48, size: 32, offset: 672)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !494, file: !111, line: 333, baseType: !48, size: 32, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !494, file: !111, line: 334, baseType: !48, size: 32, offset: 736)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !494, file: !111, line: 339, baseType: !518, size: 2048, offset: 768)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 2048, elements: !523)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !111, line: 335, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !519, file: !111, line: 337, baseType: !48, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !519, file: !111, line: 338, baseType: !48, size: 32, offset: 32)
!523 = !{!217, !36}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !494, file: !111, line: 342, baseType: !525, size: 49152, align: 128, offset: 2816)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 49152, align: 128, elements: !526)
!526 = !{!527, !74}
!527 = !DISubrange(count: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !494, file: !111, line: 344, baseType: !48, size: 32, offset: 51968)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !494, file: !111, line: 345, baseType: !48, size: 32, offset: 52000)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !494, file: !111, line: 350, baseType: !531, size: 1024, offset: 52032)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 1024, elements: !35)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !111, line: 346, size: 64, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !532, file: !111, line: 348, baseType: !48, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !532, file: !111, line: 349, baseType: !48, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !494, file: !111, line: 352, baseType: !48, size: 32, offset: 53056)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !494, file: !111, line: 354, baseType: !48, size: 32, offset: 53088)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !494, file: !111, line: 355, baseType: !48, size: 32, offset: 53120)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !494, file: !111, line: 356, baseType: !48, size: 32, offset: 53152)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !494, file: !111, line: 357, baseType: !48, size: 32, offset: 53184)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !494, file: !111, line: 360, baseType: !48, size: 32, offset: 53216)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !494, file: !111, line: 361, baseType: !48, size: 32, offset: 53248)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !494, file: !111, line: 362, baseType: !48, size: 32, offset: 53280)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !110, file: !111, line: 463, baseType: !545, size: 4096, offset: 111232)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !546, line: 46, baseType: !547)
!546 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !546, line: 27, size: 4096, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !547, file: !546, line: 30, baseType: !48, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !547, file: !546, line: 31, baseType: !48, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !547, file: !546, line: 34, baseType: !48, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !547, file: !546, line: 35, baseType: !48, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !547, file: !546, line: 37, baseType: !47, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !547, file: !546, line: 38, baseType: !47, size: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !547, file: !546, line: 39, baseType: !47, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !547, file: !546, line: 42, baseType: !48, size: 32, align: 128, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !547, file: !546, line: 45, baseType: !558, size: 3680, offset: 416)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 3680, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 460)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !110, file: !111, line: 494, baseType: !562, size: 2112, offset: 115328)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !111, line: 465, size: 2112, elements: !563)
!563 = !{!564, !702, !704, !705, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !718, !719, !720, !721}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !562, file: !111, line: 468, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !568, line: 146, baseType: !569)
!568 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !568, line: 31, size: 125056, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !598, !599, !600, !601, !602, !603, !605, !607, !608, !609, !610, !611, !614, !616, !617, !619, !624, !625, !629, !630, !634, !638, !641, !643, !644, !646, !647, !649, !650, !651, !654, !656, !657, !658, !660, !661, !662, !663, !664, !665, !666, !667, !669, !670, !674, !683, !687, !689, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !569, file: !568, line: 34, baseType: !48, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !569, file: !568, line: 35, baseType: !48, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !569, file: !568, line: 36, baseType: !48, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !569, file: !568, line: 37, baseType: !20, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !569, file: !568, line: 38, baseType: !20, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !569, file: !568, line: 39, baseType: !48, size: 32, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !569, file: !568, line: 40, baseType: !48, size: 32, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !569, file: !568, line: 41, baseType: !48, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !569, file: !568, line: 42, baseType: !48, size: 32, offset: 352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !569, file: !568, line: 43, baseType: !581, size: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !569, file: !568, line: 45, baseType: !48, size: 32, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !569, file: !568, line: 46, baseType: !48, size: 32, offset: 480)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !569, file: !568, line: 47, baseType: !48, size: 32, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !569, file: !568, line: 48, baseType: !48, size: 32, offset: 544)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !569, file: !568, line: 49, baseType: !48, size: 32, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !569, file: !568, line: 50, baseType: !48, size: 32, offset: 608)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !569, file: !568, line: 51, baseType: !48, size: 32, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !569, file: !568, line: 52, baseType: !31, size: 8, offset: 672)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !569, file: !568, line: 53, baseType: !31, size: 8, offset: 680)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !569, file: !568, line: 54, baseType: !31, size: 8, offset: 688)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !569, file: !568, line: 55, baseType: !211, size: 32, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !569, file: !568, line: 56, baseType: !211, size: 32, offset: 736)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !569, file: !568, line: 57, baseType: !48, size: 32, offset: 768)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !569, file: !568, line: 60, baseType: !48, size: 32, offset: 800)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !569, file: !568, line: 61, baseType: !597, size: 96, offset: 832)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !73)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !569, file: !568, line: 62, baseType: !597, size: 96, offset: 928)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !569, file: !568, line: 63, baseType: !597, size: 96, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !569, file: !568, line: 64, baseType: !48, size: 32, offset: 1120)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !569, file: !568, line: 65, baseType: !48, size: 32, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !569, file: !568, line: 66, baseType: !48, size: 32, offset: 1184)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !569, file: !568, line: 67, baseType: !604, size: 192, offset: 1216)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 192, elements: !73)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !569, file: !568, line: 68, baseType: !606, size: 256, offset: 1408)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 256, elements: !462)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !569, file: !568, line: 69, baseType: !606, size: 256, offset: 1664)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !569, file: !568, line: 70, baseType: !485, size: 64, offset: 1920)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !569, file: !568, line: 74, baseType: !606, size: 256, offset: 1984)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !569, file: !568, line: 75, baseType: !606, size: 256, offset: 2240)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !569, file: !568, line: 77, baseType: !612, size: 24576, align: 128, offset: 2560)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 24576, align: 128, elements: !613)
!613 = !{!36, !74}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !569, file: !568, line: 78, baseType: !615, size: 1024, offset: 27136)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1024, elements: !35)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !569, file: !568, line: 79, baseType: !48, size: 32, offset: 28160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !569, file: !568, line: 80, baseType: !618, size: 64, offset: 28224)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !569, file: !568, line: 83, baseType: !620, size: 64, offset: 28288)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !21, line: 24, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !23, line: 37, baseType: !623)
!623 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !569, file: !568, line: 84, baseType: !47, size: 64, offset: 28352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !569, file: !568, line: 85, baseType: !626, size: 128, offset: 28416)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 128, elements: !216)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !216)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !569, file: !568, line: 86, baseType: !627, size: 64, offset: 28544)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !569, file: !568, line: 87, baseType: !631, size: 2176, offset: 28608)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 2176, elements: !632)
!632 = !{!217, !633}
!633 = !DISubrange(count: 17)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !569, file: !568, line: 92, baseType: !635, size: 20736, offset: 30784)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 20736, elements: !636)
!636 = !{!637, !637}
!637 = !DISubrange(count: 18)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !569, file: !568, line: 96, baseType: !639, size: 2176, offset: 51520)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 2176, elements: !632)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !569, file: !568, line: 97, baseType: !642, size: 128, offset: 53696)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 128, elements: !216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !569, file: !568, line: 98, baseType: !215, size: 64, offset: 53824)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !569, file: !568, line: 99, baseType: !645, size: 1024, offset: 53888)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 1024, elements: !523)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !569, file: !568, line: 100, baseType: !628, size: 32, offset: 54912)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !569, file: !568, line: 105, baseType: !648, size: 10368, offset: 54944)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 10368, elements: !636)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !569, file: !568, line: 106, baseType: !648, size: 10368, offset: 65312)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !569, file: !568, line: 107, baseType: !48, size: 32, offset: 75680)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !569, file: !568, line: 108, baseType: !652, size: 576, offset: 75712)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 576, elements: !653)
!653 = !{!637}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !569, file: !568, line: 109, baseType: !655, size: 20736, offset: 76288)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 20736, elements: !636)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !569, file: !568, line: 110, baseType: !640, size: 64, offset: 97024)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !569, file: !568, line: 111, baseType: !640, size: 64, offset: 97088)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !569, file: !568, line: 112, baseType: !659, size: 64, offset: 97152)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !569, file: !568, line: 113, baseType: !659, size: 64, offset: 97216)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !569, file: !568, line: 114, baseType: !659, size: 64, offset: 97280)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !569, file: !568, line: 115, baseType: !48, size: 32, offset: 97344)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !569, file: !568, line: 116, baseType: !485, size: 64, offset: 97408)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !569, file: !568, line: 117, baseType: !485, size: 64, offset: 97472)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !569, file: !568, line: 118, baseType: !485, size: 64, offset: 97536)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !569, file: !568, line: 119, baseType: !48, size: 32, offset: 97600)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !569, file: !568, line: 120, baseType: !668, size: 576, offset: 97632)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 576, elements: !653)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !569, file: !568, line: 121, baseType: !268, size: 32, offset: 98208)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !569, file: !568, line: 122, baseType: !671, size: 64, offset: 98240)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !32, line: 27, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !23, line: 45, baseType: !673)
!673 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !569, file: !568, line: 125, baseType: !675, size: 256, offset: 98304)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !109, line: 503, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 496, size: 256, elements: !677)
!677 = !{!678, !680, !681, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !676, file: !109, line: 498, baseType: !679, size: 64)
!679 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !676, file: !109, line: 499, baseType: !679, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !676, file: !109, line: 500, baseType: !679, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !676, file: !109, line: 502, baseType: !679, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !569, file: !568, line: 128, baseType: !684, size: 2008, offset: 98560)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2008, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 251)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !569, file: !568, line: 129, baseType: !688, size: 8032, offset: 100576)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8032, elements: !685)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !569, file: !568, line: 130, baseType: !690, size: 16064, offset: 108608)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 16064, elements: !685)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !569, file: !568, line: 131, baseType: !48, size: 32, offset: 124672)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !569, file: !568, line: 132, baseType: !48, size: 32, offset: 124704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !569, file: !568, line: 135, baseType: !48, size: 32, offset: 124736)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !569, file: !568, line: 136, baseType: !48, size: 32, offset: 124768)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !569, file: !568, line: 137, baseType: !48, size: 32, offset: 124800)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !569, file: !568, line: 138, baseType: !48, size: 32, offset: 124832)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !569, file: !568, line: 139, baseType: !48, size: 32, offset: 124864)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !569, file: !568, line: 142, baseType: !211, size: 32, offset: 124896)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !569, file: !568, line: 143, baseType: !48, size: 32, offset: 124928)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !569, file: !568, line: 144, baseType: !48, size: 32, offset: 124960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !569, file: !568, line: 145, baseType: !48, size: 32, offset: 124992)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !562, file: !111, line: 470, baseType: !703, size: 128, offset: 64)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 128, elements: !216)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !562, file: !111, line: 473, baseType: !565, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !562, file: !111, line: 476, baseType: !706, size: 1152, offset: 256)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 1152, elements: !653)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !562, file: !111, line: 478, baseType: !48, size: 32, offset: 1408)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !562, file: !111, line: 480, baseType: !48, size: 32, offset: 1440)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !562, file: !111, line: 482, baseType: !48, size: 32, offset: 1472)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !562, file: !111, line: 483, baseType: !48, size: 32, offset: 1504)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !562, file: !111, line: 484, baseType: !48, size: 32, offset: 1536)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !562, file: !111, line: 485, baseType: !48, size: 32, offset: 1568)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !562, file: !111, line: 486, baseType: !48, size: 32, offset: 1600)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !562, file: !111, line: 487, baseType: !20, size: 64, offset: 1664)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !562, file: !111, line: 488, baseType: !20, size: 64, offset: 1728)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !562, file: !111, line: 489, baseType: !717, size: 128, offset: 1792)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !562, file: !111, line: 490, baseType: !20, size: 64, offset: 1920)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !562, file: !111, line: 491, baseType: !20, size: 64, offset: 1984)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !562, file: !111, line: 492, baseType: !48, size: 32, offset: 2048)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !562, file: !111, line: 493, baseType: !48, size: 32, offset: 2080)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !110, file: !111, line: 497, baseType: !566, size: 64, offset: 117440)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !110, file: !111, line: 500, baseType: !566, size: 64, offset: 117504)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !110, file: !111, line: 503, baseType: !48, size: 32, offset: 117568)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !110, file: !111, line: 504, baseType: !726, size: 1216, offset: 117632)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 1216, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 19)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !110, file: !111, line: 505, baseType: !48, size: 32, offset: 118848)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !110, file: !111, line: 506, baseType: !726, size: 1216, offset: 118912)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !110, file: !111, line: 507, baseType: !215, size: 64, offset: 120128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !110, file: !111, line: 510, baseType: !48, size: 32, offset: 120192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !110, file: !111, line: 511, baseType: !48, size: 32, offset: 120224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !110, file: !111, line: 512, baseType: !20, size: 64, offset: 120256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !110, file: !111, line: 522, baseType: !736, size: 10624, offset: 120320)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !111, line: 515, size: 10624, elements: !737)
!737 = !{!738, !740, !743, !746}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !736, file: !111, line: 517, baseType: !739, size: 256, align: 128)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 256, elements: !35)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !736, file: !111, line: 518, baseType: !741, size: 128, align: 128, offset: 256)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !742)
!742 = !{!217, !463}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !736, file: !111, line: 520, baseType: !744, size: 4096, align: 128, offset: 384)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 4096, elements: !745)
!745 = !{!463, !168}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !736, file: !111, line: 521, baseType: !747, size: 6144, align: 128, offset: 4480)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 6144, elements: !748)
!748 = !{!749, !36}
!749 = !DISubrange(count: 24)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !110, file: !111, line: 732, baseType: !751, size: 82688, offset: 130944)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !111, line: 525, size: 82688, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !780, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !798, !801, !805, !806, !807, !812, !813, !816, !817, !818, !819, !820, !821, !822, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !882, !913, !914, !915, !916, !917, !918, !919, !920, !921, !924, !925, !926, !929, !932, !934, !937, !939, !940}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !751, file: !111, line: 527, baseType: !48, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !751, file: !111, line: 530, baseType: !48, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !751, file: !111, line: 531, baseType: !48, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !751, file: !111, line: 532, baseType: !48, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !751, file: !111, line: 535, baseType: !48, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !751, file: !111, line: 536, baseType: !48, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !751, file: !111, line: 537, baseType: !48, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !751, file: !111, line: 538, baseType: !48, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !751, file: !111, line: 539, baseType: !48, size: 32, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !751, file: !111, line: 542, baseType: !48, size: 32, offset: 288)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !751, file: !111, line: 543, baseType: !48, size: 32, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !751, file: !111, line: 544, baseType: !48, size: 32, offset: 352)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !751, file: !111, line: 545, baseType: !48, size: 32, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !751, file: !111, line: 546, baseType: !48, size: 32, offset: 416)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !751, file: !111, line: 547, baseType: !48, size: 32, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !751, file: !111, line: 548, baseType: !48, size: 32, offset: 480)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !751, file: !111, line: 549, baseType: !48, size: 32, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !751, file: !111, line: 551, baseType: !48, size: 32, offset: 544)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !751, file: !111, line: 554, baseType: !215, size: 64, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !751, file: !111, line: 555, baseType: !215, size: 64, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !751, file: !111, line: 558, baseType: !215, size: 64, offset: 704)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !751, file: !111, line: 559, baseType: !215, size: 64, offset: 768)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !751, file: !111, line: 561, baseType: !215, size: 64, offset: 832)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !751, file: !111, line: 562, baseType: !215, size: 64, offset: 896)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !751, file: !111, line: 565, baseType: !7, size: 32, offset: 960)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !751, file: !111, line: 566, baseType: !779, size: 128, offset: 992)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !462)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !751, file: !111, line: 567, baseType: !781, size: 512, offset: 1120)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !35)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !751, file: !111, line: 568, baseType: !7, size: 32, offset: 1632)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !751, file: !111, line: 569, baseType: !7, size: 32, offset: 1664)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !751, file: !111, line: 570, baseType: !48, size: 32, offset: 1696)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !751, file: !111, line: 571, baseType: !48, size: 32, offset: 1728)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !751, file: !111, line: 572, baseType: !48, size: 32, offset: 1760)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !751, file: !111, line: 573, baseType: !48, size: 32, offset: 1792)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !751, file: !111, line: 574, baseType: !48, size: 32, offset: 1824)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !751, file: !111, line: 575, baseType: !48, size: 32, offset: 1856)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !751, file: !111, line: 576, baseType: !48, size: 32, offset: 1888)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !751, file: !111, line: 577, baseType: !48, size: 32, offset: 1920)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !751, file: !111, line: 578, baseType: !48, size: 32, offset: 1952)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !751, file: !111, line: 585, baseType: !620, size: 64, offset: 1984)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !751, file: !111, line: 586, baseType: !47, size: 64, offset: 2048)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !751, file: !111, line: 587, baseType: !620, size: 64, offset: 2112)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !751, file: !111, line: 588, baseType: !797, size: 64, offset: 2176)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !751, file: !111, line: 589, baseType: !799, size: 64, offset: 2240)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 64, elements: !58)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !751, file: !111, line: 591, baseType: !802, size: 64, offset: 2304)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 192, elements: !804)
!804 = !{!749}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !751, file: !111, line: 592, baseType: !620, size: 64, offset: 2368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !751, file: !111, line: 593, baseType: !626, size: 128, offset: 2432)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !751, file: !111, line: 594, baseType: !808, size: 128, offset: 2560)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 128, elements: !216)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !811)
!811 = !{!59, !217}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !751, file: !111, line: 595, baseType: !642, size: 128, offset: 2688)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !751, file: !111, line: 596, baseType: !814, size: 4096, offset: 2816)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 4096, elements: !815)
!815 = !{!217, !527}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !751, file: !111, line: 597, baseType: !620, size: 64, offset: 6912)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !751, file: !111, line: 598, baseType: !620, size: 64, offset: 6976)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !751, file: !111, line: 599, baseType: !485, size: 64, offset: 7040)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !751, file: !111, line: 603, baseType: !615, size: 1024, offset: 7104)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !751, file: !111, line: 606, baseType: !48, size: 32, offset: 8128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !751, file: !111, line: 607, baseType: !48, size: 32, offset: 8160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !751, file: !111, line: 608, baseType: !823, size: 32, align: 32, offset: 8192)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, elements: !462)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !751, file: !111, line: 609, baseType: !48, size: 32, offset: 8224)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !751, file: !111, line: 611, baseType: !48, size: 32, offset: 8256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !751, file: !111, line: 612, baseType: !48, size: 32, offset: 8288)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !751, file: !111, line: 614, baseType: !48, size: 32, offset: 8320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !751, file: !111, line: 615, baseType: !48, size: 32, offset: 8352)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !751, file: !111, line: 621, baseType: !48, size: 32, offset: 8384)
