; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/encoder/me.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/encoder/me.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon.15 = type { i32, i32 }
%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, ptr, [8 x i8] }
%struct.x264_me_t = type { i32, ptr, i32, i32, ptr, [6 x ptr], ptr, [3 x ptr], ptr, [2 x i32], [2 x i16], i32, i32, [2 x i16] }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, float, float, float, i32, float, i32, i32, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "x264_pixel_size", scope: !2, file: !6, line: 47, type: !1830, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !80, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/encoder/me.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "f207a98fe290f3dc3c9af0aa958dfc24")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9056d80edbb4dc2514d271d596c298e")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "PIXEL_16x16", value: 0)
!10 = !DIEnumerator(name: "PIXEL_16x8", value: 1)
!11 = !DIEnumerator(name: "PIXEL_8x16", value: 2)
!12 = !DIEnumerator(name: "PIXEL_8x8", value: 3)
!13 = !DIEnumerator(name: "PIXEL_8x4", value: 4)
!14 = !DIEnumerator(name: "PIXEL_4x8", value: 5)
!15 = !DIEnumerator(name: "PIXEL_4x4", value: 6)
!16 = !DIEnumerator(name: "PIXEL_4x2", value: 7)
!17 = !DIEnumerator(name: "PIXEL_2x4", value: 8)
!18 = !DIEnumerator(name: "PIXEL_2x2", value: 9)
!19 = !{!20, !44, !57, !73, !62}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !22, line: 89, baseType: !23)
!22 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!23 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !22, line: 89, size: 32, elements: !24)
!24 = !{!25, !30, !37}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !23, file: !22, line: 89, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !27, line: 26, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !29, line: 42, baseType: !7)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!30 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !23, file: !22, line: 89, baseType: !31, size: 32)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !35)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !27, line: 25, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !29, line: 40, baseType: !34)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !{!36}
!36 = !DISubrange(count: 2)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !23, file: !22, line: 89, baseType: !38, size: 32)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32, elements: !42)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !27, line: 24, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !29, line: 38, baseType: !41)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !{!43}
!43 = !DISubrange(count: 4)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "mvsad_t", file: !46, line: 58, baseType: !47)
!46 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/me.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9ed8adb24d2511c1244c72a9a0793ae7")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 55, size: 64, elements: !48)
!48 = !{!49, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !47, file: !46, line: 56, baseType: !50, size: 32)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !47, file: !46, line: 57, baseType: !52, size: 32, offset: 32)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !35)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !54, line: 25, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !29, line: 39, baseType: !56)
!56 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !22, line: 90, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !22, line: 90, size: 64, elements: !60)
!60 = !{!61, !65, !67, !69}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !59, file: !22, line: 90, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !27, line: 27, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !29, line: 45, baseType: !64)
!64 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !59, file: !22, line: 90, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !35)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !59, file: !22, line: 90, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !42)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !59, file: !22, line: 90, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 8)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union16_t", file: !22, line: 88, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !22, line: 88, size: 16, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !75, file: !22, line: 88, baseType: !32, size: 16)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !75, file: !22, line: 88, baseType: !79, size: 16)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 16, elements: !35)
!80 = !{!81, !1690, !1693, !1697, !1702, !0, !1704, !1707, !1710, !1714, !1719, !1816, !1821, !1825, !1828}
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "x264_pixel_size_shift", scope: !83, file: !84, line: 380, type: !1689, isLocal: true, isDefinition: true)
!83 = distinct !DISubprogram(name: "x264_me_search_ref", scope: !84, file: !84, line: 173, type: !85, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1393)
!84 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/me.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f207a98fe290f3dc3c9af0aa958dfc24")
!85 = !DISubroutineType(types: !86)
!86 = !{null, !87, !1374, !628, !50, !640}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !89, line: 46, baseType: !90)
!89 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !22, line: 381, size: 266752, elements: !91)
!91 = !{!92, !261, !265, !266, !267, !268, !269, !270, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !406, !408, !436, !438, !439, !440, !444, !448, !449, !450, !454, !458, !459, !460, !465, !468, !469, !542, !559, !719, !720, !721, !722, !726, !727, !728, !729, !730, !731, !732, !747, !940, !944, !1005, !1008, !1010, !1011, !1012, !1015, !1020, !1029, !1030, !1038, !1040, !1045, !1120, !1206, !1250, !1272, !1321, !1350}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !90, file: !22, line: 384, baseType: !93, size: 5632)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !89, line: 376, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !89, line: 176, size: 5632, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !139, !143, !144, !145, !146, !150, !151, !166, !167, !168, !169, !170, !199, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !94, file: !89, line: 179, baseType: !7, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !94, file: !89, line: 180, baseType: !50, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !94, file: !89, line: 181, baseType: !50, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !94, file: !89, line: 182, baseType: !50, size: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !94, file: !89, line: 183, baseType: !50, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !94, file: !89, line: 186, baseType: !50, size: 32, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !94, file: !89, line: 187, baseType: !50, size: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !94, file: !89, line: 188, baseType: !50, size: 32, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !94, file: !89, line: 189, baseType: !50, size: 32, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !94, file: !89, line: 190, baseType: !50, size: 32, offset: 288)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !94, file: !89, line: 198, baseType: !50, size: 32, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !94, file: !89, line: 215, baseType: !108, size: 288, offset: 352)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !94, file: !89, line: 200, size: 288, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !108, file: !89, line: 203, baseType: !50, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !108, file: !89, line: 204, baseType: !50, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !108, file: !89, line: 206, baseType: !50, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !108, file: !89, line: 209, baseType: !50, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !108, file: !89, line: 210, baseType: !50, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !108, file: !89, line: 211, baseType: !50, size: 32, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !108, file: !89, line: 212, baseType: !50, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !108, file: !89, line: 213, baseType: !50, size: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !108, file: !89, line: 214, baseType: !50, size: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !94, file: !89, line: 218, baseType: !50, size: 32, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !94, file: !89, line: 219, baseType: !50, size: 32, offset: 672)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !94, file: !89, line: 220, baseType: !50, size: 32, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !94, file: !89, line: 221, baseType: !50, size: 32, offset: 736)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !94, file: !89, line: 222, baseType: !50, size: 32, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !94, file: !89, line: 224, baseType: !50, size: 32, offset: 800)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !94, file: !89, line: 225, baseType: !50, size: 32, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !94, file: !89, line: 226, baseType: !50, size: 32, offset: 864)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !94, file: !89, line: 227, baseType: !50, size: 32, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !94, file: !89, line: 229, baseType: !50, size: 32, offset: 928)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !94, file: !89, line: 230, baseType: !50, size: 32, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !94, file: !89, line: 231, baseType: !50, size: 32, offset: 992)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !94, file: !89, line: 233, baseType: !50, size: 32, offset: 1024)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !94, file: !89, line: 234, baseType: !50, size: 32, offset: 1056)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !94, file: !89, line: 236, baseType: !50, size: 32, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !94, file: !89, line: 237, baseType: !50, size: 32, offset: 1120)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !94, file: !89, line: 239, baseType: !50, size: 32, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !94, file: !89, line: 240, baseType: !137, size: 64, offset: 1216)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !94, file: !89, line: 241, baseType: !140, size: 128, offset: 1280)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !94, file: !89, line: 242, baseType: !140, size: 128, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !94, file: !89, line: 243, baseType: !140, size: 128, offset: 1536)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !94, file: !89, line: 244, baseType: !140, size: 128, offset: 1664)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !94, file: !89, line: 245, baseType: !147, size: 512, offset: 1792)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 512, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !94, file: !89, line: 246, baseType: !147, size: 512, offset: 2304)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !94, file: !89, line: 249, baseType: !152, size: 64, offset: 2816)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155, !50, !156, !158}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !160)
!160 = !{!161, !163, !164, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !159, file: !162, baseType: !7, size: 32)
!162 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/me.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !159, file: !162, baseType: !7, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !159, file: !162, baseType: !155, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !159, file: !162, baseType: !155, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !94, file: !89, line: 250, baseType: !155, size: 64, offset: 2880)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !94, file: !89, line: 251, baseType: !50, size: 32, offset: 2944)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !94, file: !89, line: 252, baseType: !50, size: 32, offset: 2976)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !94, file: !89, line: 253, baseType: !137, size: 64, offset: 3008)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !94, file: !89, line: 287, baseType: !171, size: 800, offset: 3072)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !94, file: !89, line: 256, size: 800, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !193, !194, !195, !197, !198}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !171, file: !89, line: 258, baseType: !7, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !171, file: !89, line: 259, baseType: !7, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !171, file: !89, line: 261, baseType: !50, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !171, file: !89, line: 262, baseType: !50, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !171, file: !89, line: 263, baseType: !50, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !171, file: !89, line: 264, baseType: !50, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !171, file: !89, line: 265, baseType: !50, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !171, file: !89, line: 267, baseType: !50, size: 32, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !171, file: !89, line: 268, baseType: !50, size: 32, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !171, file: !89, line: 269, baseType: !50, size: 32, offset: 288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !171, file: !89, line: 270, baseType: !50, size: 32, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !171, file: !89, line: 271, baseType: !50, size: 32, offset: 352)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !171, file: !89, line: 272, baseType: !50, size: 32, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !171, file: !89, line: 273, baseType: !50, size: 32, offset: 416)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !171, file: !89, line: 274, baseType: !50, size: 32, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !171, file: !89, line: 275, baseType: !50, size: 32, offset: 480)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !171, file: !89, line: 276, baseType: !50, size: 32, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !171, file: !89, line: 277, baseType: !50, size: 32, offset: 544)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !171, file: !89, line: 278, baseType: !192, size: 32, offset: 576)
!192 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !171, file: !89, line: 279, baseType: !192, size: 32, offset: 608)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !171, file: !89, line: 280, baseType: !50, size: 32, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !171, file: !89, line: 283, baseType: !196, size: 64, offset: 672)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !35)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !171, file: !89, line: 285, baseType: !50, size: 32, offset: 736)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !171, file: !89, line: 286, baseType: !50, size: 32, offset: 768)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !94, file: !89, line: 327, baseType: !200, size: 1152, offset: 3904)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !94, file: !89, line: 290, size: 1152, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !239, !240}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !200, file: !89, line: 292, baseType: !50, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !200, file: !89, line: 294, baseType: !50, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !200, file: !89, line: 295, baseType: !50, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !200, file: !89, line: 296, baseType: !50, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !200, file: !89, line: 297, baseType: !50, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !200, file: !89, line: 299, baseType: !50, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !200, file: !89, line: 300, baseType: !192, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !200, file: !89, line: 301, baseType: !192, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !200, file: !89, line: 302, baseType: !192, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !200, file: !89, line: 303, baseType: !50, size: 32, offset: 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !200, file: !89, line: 304, baseType: !50, size: 32, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !200, file: !89, line: 305, baseType: !192, size: 32, offset: 352)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !200, file: !89, line: 306, baseType: !192, size: 32, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !200, file: !89, line: 307, baseType: !192, size: 32, offset: 416)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !200, file: !89, line: 309, baseType: !50, size: 32, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !200, file: !89, line: 310, baseType: !192, size: 32, offset: 480)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !200, file: !89, line: 311, baseType: !50, size: 32, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !200, file: !89, line: 312, baseType: !50, size: 32, offset: 544)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !200, file: !89, line: 315, baseType: !50, size: 32, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !200, file: !89, line: 316, baseType: !137, size: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !200, file: !89, line: 317, baseType: !50, size: 32, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !200, file: !89, line: 318, baseType: !137, size: 64, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !200, file: !89, line: 321, baseType: !192, size: 32, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !200, file: !89, line: 322, baseType: !192, size: 32, offset: 864)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !200, file: !89, line: 323, baseType: !192, size: 32, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !200, file: !89, line: 324, baseType: !228, size: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !89, line: 174, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 167, size: 256, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !230, file: !89, line: 169, baseType: !50, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !230, file: !89, line: 169, baseType: !50, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !230, file: !89, line: 170, baseType: !50, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !230, file: !89, line: 171, baseType: !50, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !230, file: !89, line: 172, baseType: !192, size: 32, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !230, file: !89, line: 173, baseType: !238, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !200, file: !89, line: 325, baseType: !50, size: 32, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !200, file: !89, line: 326, baseType: !137, size: 64, offset: 1088)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !94, file: !89, line: 330, baseType: !50, size: 32, offset: 5056)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !94, file: !89, line: 331, baseType: !50, size: 32, offset: 5088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !94, file: !89, line: 332, baseType: !50, size: 32, offset: 5120)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !94, file: !89, line: 334, baseType: !50, size: 32, offset: 5152)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !94, file: !89, line: 335, baseType: !50, size: 32, offset: 5184)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !94, file: !89, line: 336, baseType: !26, size: 32, offset: 5216)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !94, file: !89, line: 337, baseType: !26, size: 32, offset: 5248)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !94, file: !89, line: 338, baseType: !26, size: 32, offset: 5280)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !94, file: !89, line: 339, baseType: !26, size: 32, offset: 5312)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !94, file: !89, line: 340, baseType: !50, size: 32, offset: 5344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !94, file: !89, line: 344, baseType: !50, size: 32, offset: 5376)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !94, file: !89, line: 356, baseType: !50, size: 32, offset: 5408)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !94, file: !89, line: 364, baseType: !50, size: 32, offset: 5440)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !94, file: !89, line: 367, baseType: !50, size: 32, offset: 5472)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !94, file: !89, line: 368, baseType: !50, size: 32, offset: 5504)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !94, file: !89, line: 369, baseType: !50, size: 32, offset: 5536)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !94, file: !89, line: 375, baseType: !258, size: 64, offset: 5568)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !155}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !90, file: !22, line: 386, baseType: !262, size: 8256, offset: 5632)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8256, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 129)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !90, file: !22, line: 387, baseType: !50, size: 32, offset: 13888)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !90, file: !22, line: 388, baseType: !50, size: 32, offset: 13920)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !90, file: !22, line: 389, baseType: !50, size: 32, offset: 13952)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !90, file: !22, line: 390, baseType: !50, size: 32, offset: 13984)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !90, file: !22, line: 391, baseType: !50, size: 32, offset: 14016)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !90, file: !22, line: 402, baseType: !271, size: 576, offset: 14080)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !22, line: 394, size: 576, elements: !272)
!272 = !{!273, !274, !275, !285, !286, !287}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !271, file: !22, line: 396, baseType: !50, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !271, file: !22, line: 397, baseType: !50, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !271, file: !22, line: 398, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !89, line: 604, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 593, size: 192, elements: !279)
!279 = !{!280, !281, !282, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !278, file: !89, line: 595, baseType: !50, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !278, file: !89, line: 596, baseType: !50, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !278, file: !89, line: 599, baseType: !50, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !278, file: !89, line: 603, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !271, file: !22, line: 399, baseType: !50, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !271, file: !22, line: 400, baseType: !284, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !271, file: !22, line: 401, baseType: !288, size: 320, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !289, line: 56, baseType: !290)
!289 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !289, line: 47, size: 320, elements: !291)
!291 = !{!292, !293, !294, !295, !299, !300}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !290, file: !289, line: 49, baseType: !284, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !290, file: !289, line: 50, baseType: !284, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !290, file: !289, line: 51, baseType: !284, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !290, file: !289, line: 53, baseType: !296, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !297, line: 87, baseType: !298)
!297 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!298 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !290, file: !289, line: 54, baseType: !50, size: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !290, file: !289, line: 55, baseType: !50, size: 32, offset: 288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !90, file: !22, line: 404, baseType: !284, size: 64, offset: 14656)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !90, file: !22, line: 405, baseType: !50, size: 32, offset: 14720)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !90, file: !22, line: 410, baseType: !50, size: 32, offset: 14752)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !90, file: !22, line: 411, baseType: !50, size: 32, offset: 14784)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !90, file: !22, line: 413, baseType: !50, size: 32, offset: 14816)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !90, file: !22, line: 415, baseType: !50, size: 32, offset: 14848)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !90, file: !22, line: 416, baseType: !50, size: 32, offset: 14880)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !90, file: !22, line: 418, baseType: !50, size: 32, offset: 14912)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !90, file: !22, line: 419, baseType: !50, size: 32, offset: 14944)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !90, file: !22, line: 420, baseType: !50, size: 32, offset: 14976)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !90, file: !22, line: 421, baseType: !50, size: 32, offset: 15008)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !90, file: !22, line: 422, baseType: !50, size: 32, offset: 15040)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !90, file: !22, line: 424, baseType: !50, size: 32, offset: 15072)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !90, file: !22, line: 425, baseType: !50, size: 32, offset: 15104)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !90, file: !22, line: 427, baseType: !50, size: 32, offset: 15136)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !90, file: !22, line: 430, baseType: !317, size: 10400, offset: 15168)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 10400, elements: !404)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !319, line: 154, baseType: !320)
!319 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 52, size: 10400, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !339, !340, !341, !342, !343, !344, !345, !346, !347, !354, !355, !403}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !320, file: !319, line: 54, baseType: !50, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !320, file: !319, line: 56, baseType: !50, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !320, file: !319, line: 57, baseType: !50, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !320, file: !319, line: 59, baseType: !50, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !320, file: !319, line: 60, baseType: !50, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !320, file: !319, line: 61, baseType: !50, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !320, file: !319, line: 63, baseType: !50, size: 32, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !320, file: !319, line: 65, baseType: !50, size: 32, offset: 224)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !320, file: !319, line: 67, baseType: !50, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !320, file: !319, line: 69, baseType: !50, size: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !320, file: !319, line: 70, baseType: !50, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !320, file: !319, line: 71, baseType: !50, size: 32, offset: 352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !320, file: !319, line: 72, baseType: !50, size: 32, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !320, file: !319, line: 73, baseType: !336, size: 8192, offset: 416)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8192, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !320, file: !319, line: 75, baseType: !50, size: 32, offset: 8608)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !320, file: !319, line: 76, baseType: !50, size: 32, offset: 8640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !320, file: !319, line: 77, baseType: !50, size: 32, offset: 8672)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !320, file: !319, line: 78, baseType: !50, size: 32, offset: 8704)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !320, file: !319, line: 79, baseType: !50, size: 32, offset: 8736)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !320, file: !319, line: 80, baseType: !50, size: 32, offset: 8768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !320, file: !319, line: 81, baseType: !50, size: 32, offset: 8800)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !320, file: !319, line: 83, baseType: !50, size: 32, offset: 8832)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !320, file: !319, line: 90, baseType: !348, size: 128, offset: 8864)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !319, line: 84, size: 128, elements: !349)
!349 = !{!350, !351, !352, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !348, file: !319, line: 86, baseType: !50, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !348, file: !319, line: 87, baseType: !50, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !348, file: !319, line: 88, baseType: !50, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !348, file: !319, line: 89, baseType: !50, size: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !320, file: !319, line: 92, baseType: !50, size: 32, offset: 8992)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !320, file: !319, line: 150, baseType: !356, size: 1344, offset: 9024)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !319, line: 93, size: 1344, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !394, !395, !396, !397, !398, !399, !400, !401, !402}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !356, file: !319, line: 95, baseType: !50, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !356, file: !319, line: 96, baseType: !50, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !356, file: !319, line: 97, baseType: !50, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !356, file: !319, line: 99, baseType: !50, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !356, file: !319, line: 100, baseType: !50, size: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !356, file: !319, line: 102, baseType: !50, size: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !356, file: !319, line: 103, baseType: !50, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !356, file: !319, line: 104, baseType: !50, size: 32, offset: 224)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !356, file: !319, line: 105, baseType: !50, size: 32, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !356, file: !319, line: 106, baseType: !50, size: 32, offset: 288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !356, file: !319, line: 107, baseType: !50, size: 32, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !356, file: !319, line: 108, baseType: !50, size: 32, offset: 352)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !356, file: !319, line: 110, baseType: !50, size: 32, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !356, file: !319, line: 111, baseType: !50, size: 32, offset: 416)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !356, file: !319, line: 112, baseType: !50, size: 32, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !356, file: !319, line: 114, baseType: !50, size: 32, offset: 480)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !356, file: !319, line: 115, baseType: !26, size: 32, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !356, file: !319, line: 116, baseType: !26, size: 32, offset: 544)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !356, file: !319, line: 117, baseType: !50, size: 32, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !356, file: !319, line: 119, baseType: !50, size: 32, offset: 608)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !356, file: !319, line: 120, baseType: !50, size: 32, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !356, file: !319, line: 137, baseType: !380, size: 384, offset: 672)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !356, file: !319, line: 122, size: 384, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !380, file: !319, line: 124, baseType: !50, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !380, file: !319, line: 125, baseType: !50, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !380, file: !319, line: 126, baseType: !50, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !380, file: !319, line: 127, baseType: !50, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !380, file: !319, line: 128, baseType: !50, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !380, file: !319, line: 129, baseType: !50, size: 32, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !380, file: !319, line: 130, baseType: !50, size: 32, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !380, file: !319, line: 131, baseType: !50, size: 32, offset: 224)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !380, file: !319, line: 133, baseType: !50, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !380, file: !319, line: 134, baseType: !50, size: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !380, file: !319, line: 135, baseType: !50, size: 32, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !380, file: !319, line: 136, baseType: !50, size: 32, offset: 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !356, file: !319, line: 139, baseType: !50, size: 32, offset: 1056)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !356, file: !319, line: 140, baseType: !50, size: 32, offset: 1088)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !356, file: !319, line: 141, baseType: !50, size: 32, offset: 1120)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !356, file: !319, line: 142, baseType: !50, size: 32, offset: 1152)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !356, file: !319, line: 143, baseType: !50, size: 32, offset: 1184)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !356, file: !319, line: 144, baseType: !50, size: 32, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !356, file: !319, line: 145, baseType: !50, size: 32, offset: 1248)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !356, file: !319, line: 146, baseType: !50, size: 32, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !356, file: !319, line: 147, baseType: !50, size: 32, offset: 1312)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !320, file: !319, line: 152, baseType: !50, size: 32, offset: 10368)
!404 = !{!405}
!405 = !DISubrange(count: 1)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !90, file: !22, line: 431, baseType: !407, size: 64, offset: 25600)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !90, file: !22, line: 432, baseType: !409, size: 960, offset: 25664)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 960, elements: !404)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !319, line: 186, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 156, size: 960, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !411, file: !319, line: 158, baseType: !50, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !411, file: !319, line: 159, baseType: !50, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !411, file: !319, line: 161, baseType: !50, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !411, file: !319, line: 163, baseType: !50, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !411, file: !319, line: 164, baseType: !50, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !411, file: !319, line: 166, baseType: !50, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !411, file: !319, line: 167, baseType: !50, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !411, file: !319, line: 169, baseType: !50, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !411, file: !319, line: 170, baseType: !50, size: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !411, file: !319, line: 172, baseType: !50, size: 32, offset: 288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !411, file: !319, line: 173, baseType: !50, size: 32, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !411, file: !319, line: 175, baseType: !50, size: 32, offset: 352)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !411, file: !319, line: 177, baseType: !50, size: 32, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !411, file: !319, line: 178, baseType: !50, size: 32, offset: 416)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !411, file: !319, line: 179, baseType: !50, size: 32, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !411, file: !319, line: 181, baseType: !50, size: 32, offset: 480)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !411, file: !319, line: 183, baseType: !50, size: 32, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !411, file: !319, line: 184, baseType: !431, size: 384, offset: 576)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 384, elements: !434)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!434 = !{!435}
!435 = !DISubrange(count: 6)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !90, file: !22, line: 433, baseType: !437, size: 64, offset: 26624)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !90, file: !22, line: 434, baseType: !50, size: 32, offset: 26688)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !90, file: !22, line: 437, baseType: !50, size: 32, offset: 26720)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !90, file: !22, line: 440, baseType: !441, size: 256, offset: 26752)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 256, elements: !42)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 512, elements: !141)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !90, file: !22, line: 441, baseType: !445, size: 128, offset: 27008)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 128, elements: !35)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !148)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !90, file: !22, line: 443, baseType: !441, size: 256, offset: 27136)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !90, file: !22, line: 444, baseType: !445, size: 128, offset: 27392)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !90, file: !22, line: 446, baseType: !451, size: 256, offset: 27520)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 256, elements: !42)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, elements: !141)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !90, file: !22, line: 447, baseType: !455, size: 128, offset: 27776)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 128, elements: !35)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, elements: !148)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !90, file: !22, line: 448, baseType: !451, size: 256, offset: 27904)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !90, file: !22, line: 449, baseType: !455, size: 128, offset: 28160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !90, file: !22, line: 454, baseType: !461, size: 5888, offset: 28288)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 5888, elements: !463)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!463 = !{!464}
!464 = !DISubrange(count: 92)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !90, file: !22, line: 455, baseType: !466, size: 23552, offset: 34176)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 23552, elements: !467)
!467 = !{!464, !43}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !90, file: !22, line: 457, baseType: !432, size: 64, offset: 57728)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !90, file: !22, line: 460, baseType: !470, size: 53376, offset: 57856)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !22, line: 364, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 302, size: 53376, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !501, !526, !527, !528, !534, !535, !536, !537, !538, !539, !540, !541}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !471, file: !22, line: 304, baseType: !407, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !471, file: !22, line: 305, baseType: !437, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !471, file: !22, line: 307, baseType: !50, size: 32, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !471, file: !22, line: 308, baseType: !50, size: 32, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !471, file: !22, line: 309, baseType: !50, size: 32, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !471, file: !22, line: 311, baseType: !50, size: 32, offset: 224)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !471, file: !22, line: 313, baseType: !50, size: 32, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !471, file: !22, line: 315, baseType: !50, size: 32, offset: 288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !471, file: !22, line: 316, baseType: !50, size: 32, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !471, file: !22, line: 317, baseType: !50, size: 32, offset: 352)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !471, file: !22, line: 319, baseType: !50, size: 32, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !471, file: !22, line: 321, baseType: !50, size: 32, offset: 416)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !471, file: !22, line: 322, baseType: !50, size: 32, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !471, file: !22, line: 324, baseType: !196, size: 64, offset: 480)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !471, file: !22, line: 325, baseType: !50, size: 32, offset: 544)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !471, file: !22, line: 327, baseType: !50, size: 32, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !471, file: !22, line: 329, baseType: !50, size: 32, offset: 608)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !471, file: !22, line: 330, baseType: !50, size: 32, offset: 640)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !471, file: !22, line: 331, baseType: !50, size: 32, offset: 672)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !471, file: !22, line: 333, baseType: !50, size: 32, offset: 704)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !471, file: !22, line: 334, baseType: !50, size: 32, offset: 736)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !471, file: !22, line: 339, baseType: !495, size: 2048, offset: 768)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 2048, elements: !500)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !471, file: !22, line: 335, size: 64, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !496, file: !22, line: 337, baseType: !50, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !496, file: !22, line: 338, baseType: !50, size: 32, offset: 32)
!500 = !{!36, !142}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !471, file: !22, line: 342, baseType: !502, size: 49152, align: 128, offset: 2816)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 49152, align: 128, elements: !523)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !504, line: 36, baseType: !505, align: 128)
!504 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !504, line: 26, size: 512, elements: !506)
!506 = !{!507, !509, !510, !513, !514, !515}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !505, file: !504, line: 30, baseType: !508, size: 128, align: 128)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !71)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !505, file: !504, line: 31, baseType: !508, size: 128, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !505, file: !504, line: 32, baseType: !511, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !54, line: 26, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !29, line: 41, baseType: !50)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !505, file: !504, line: 33, baseType: !511, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !505, file: !504, line: 34, baseType: !511, size: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !505, file: !504, line: 35, baseType: !516, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !504, line: 25, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !284, !50, !284, !50, !521, !50}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!523 = !{!524, !525}
!524 = !DISubrange(count: 32)
!525 = !DISubrange(count: 3)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !471, file: !22, line: 344, baseType: !50, size: 32, offset: 51968)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !471, file: !22, line: 345, baseType: !50, size: 32, offset: 52000)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !471, file: !22, line: 350, baseType: !529, size: 1024, offset: 52032)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 1024, elements: !141)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !471, file: !22, line: 346, size: 64, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !530, file: !22, line: 348, baseType: !50, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !530, file: !22, line: 349, baseType: !50, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !471, file: !22, line: 352, baseType: !50, size: 32, offset: 53056)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !471, file: !22, line: 354, baseType: !50, size: 32, offset: 53088)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !471, file: !22, line: 355, baseType: !50, size: 32, offset: 53120)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !471, file: !22, line: 356, baseType: !50, size: 32, offset: 53152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !471, file: !22, line: 357, baseType: !50, size: 32, offset: 53184)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !471, file: !22, line: 360, baseType: !50, size: 32, offset: 53216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !471, file: !22, line: 361, baseType: !50, size: 32, offset: 53248)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !471, file: !22, line: 362, baseType: !50, size: 32, offset: 53280)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !90, file: !22, line: 463, baseType: !543, size: 4096, offset: 111232)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !544, line: 46, baseType: !545)
!544 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !544, line: 27, size: 4096, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !545, file: !544, line: 30, baseType: !50, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !545, file: !544, line: 31, baseType: !50, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !545, file: !544, line: 34, baseType: !50, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !545, file: !544, line: 35, baseType: !50, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !545, file: !544, line: 37, baseType: !284, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !545, file: !544, line: 38, baseType: !284, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !545, file: !544, line: 39, baseType: !284, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !545, file: !544, line: 42, baseType: !50, size: 32, align: 128, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !545, file: !544, line: 45, baseType: !556, size: 3680, offset: 416)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 3680, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 460)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !90, file: !22, line: 494, baseType: !560, size: 2112, offset: 115328)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !22, line: 465, size: 2112, elements: !561)
!561 = !{!562, !699, !701, !702, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !715, !716, !717, !718}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !560, file: !22, line: 468, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !566, line: 146, baseType: !567)
!566 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !566, line: 31, size: 125056, elements: !568)
!568 = !{!569, !570, !571, !572, !575, !576, !577, !578, !579, !580, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !599, !600, !601, !602, !603, !604, !606, !608, !609, !610, !611, !612, !615, !617, !618, !620, !625, !626, !629, !630, !634, !638, !641, !643, !644, !646, !647, !649, !650, !651, !654, !656, !657, !658, !660, !661, !662, !663, !664, !665, !666, !667, !669, !670, !671, !680, !684, !686, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !567, file: !566, line: 34, baseType: !50, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !567, file: !566, line: 35, baseType: !50, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !567, file: !566, line: 36, baseType: !50, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !567, file: !566, line: 37, baseType: !573, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 27, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !29, line: 44, baseType: !298)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !567, file: !566, line: 38, baseType: !573, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !567, file: !566, line: 39, baseType: !50, size: 32, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !567, file: !566, line: 40, baseType: !50, size: 32, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !567, file: !566, line: 41, baseType: !50, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !567, file: !566, line: 42, baseType: !50, size: 32, offset: 352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !567, file: !566, line: 43, baseType: !581, size: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !567, file: !566, line: 45, baseType: !50, size: 32, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !567, file: !566, line: 46, baseType: !50, size: 32, offset: 480)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !567, file: !566, line: 47, baseType: !50, size: 32, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !567, file: !566, line: 48, baseType: !50, size: 32, offset: 544)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !567, file: !566, line: 49, baseType: !50, size: 32, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !567, file: !566, line: 50, baseType: !50, size: 32, offset: 608)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !567, file: !566, line: 51, baseType: !50, size: 32, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !567, file: !566, line: 52, baseType: !39, size: 8, offset: 672)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !567, file: !566, line: 53, baseType: !39, size: 8, offset: 680)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !567, file: !566, line: 54, baseType: !39, size: 8, offset: 688)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !567, file: !566, line: 55, baseType: !192, size: 32, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !567, file: !566, line: 56, baseType: !192, size: 32, offset: 736)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !567, file: !566, line: 57, baseType: !50, size: 32, offset: 768)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !567, file: !566, line: 60, baseType: !50, size: 32, offset: 800)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !567, file: !566, line: 61, baseType: !597, size: 96, offset: 832)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 96, elements: !598)
!598 = !{!525}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !567, file: !566, line: 62, baseType: !597, size: 96, offset: 928)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !567, file: !566, line: 63, baseType: !597, size: 96, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !567, file: !566, line: 64, baseType: !50, size: 32, offset: 1120)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !567, file: !566, line: 65, baseType: !50, size: 32, offset: 1152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !567, file: !566, line: 66, baseType: !50, size: 32, offset: 1184)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !567, file: !566, line: 67, baseType: !605, size: 192, offset: 1216)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 192, elements: !598)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !567, file: !566, line: 68, baseType: !607, size: 256, offset: 1408)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 256, elements: !42)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !567, file: !566, line: 69, baseType: !607, size: 256, offset: 1664)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !567, file: !566, line: 70, baseType: !462, size: 64, offset: 1920)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !567, file: !566, line: 74, baseType: !607, size: 256, offset: 1984)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !567, file: !566, line: 75, baseType: !607, size: 256, offset: 2240)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !567, file: !566, line: 77, baseType: !613, size: 24576, align: 128, offset: 2560)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 24576, align: 128, elements: !614)
!614 = !{!142, !525}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !567, file: !566, line: 78, baseType: !616, size: 1024, offset: 27136)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 1024, elements: !141)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !567, file: !566, line: 79, baseType: !50, size: 32, offset: 28160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !567, file: !566, line: 80, baseType: !619, size: 64, offset: 28224)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !567, file: !566, line: 83, baseType: !621, size: 64, offset: 28288)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !54, line: 24, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !29, line: 37, baseType: !624)
!624 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !567, file: !566, line: 84, baseType: !284, size: 64, offset: 28352)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !567, file: !566, line: 85, baseType: !627, size: 128, offset: 28416)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 128, elements: !35)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !567, file: !566, line: 86, baseType: !628, size: 64, offset: 28544)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !567, file: !566, line: 87, baseType: !631, size: 2176, offset: 28608)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 2176, elements: !632)
!632 = !{!36, !633}
!633 = !DISubrange(count: 17)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !567, file: !566, line: 92, baseType: !635, size: 20736, offset: 30784)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 20736, elements: !636)
!636 = !{!637, !637}
!637 = !DISubrange(count: 18)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !567, file: !566, line: 96, baseType: !639, size: 2176, offset: 51520)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 2176, elements: !632)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !567, file: !566, line: 97, baseType: !642, size: 128, offset: 53696)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 128, elements: !35)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !567, file: !566, line: 98, baseType: !196, size: 64, offset: 53824)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !567, file: !566, line: 99, baseType: !645, size: 1024, offset: 53888)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1024, elements: !500)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !567, file: !566, line: 100, baseType: !52, size: 32, offset: 54912)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !567, file: !566, line: 105, baseType: !648, size: 10368, offset: 54944)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 10368, elements: !636)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !567, file: !566, line: 106, baseType: !648, size: 10368, offset: 65312)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !567, file: !566, line: 107, baseType: !50, size: 32, offset: 75680)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !567, file: !566, line: 108, baseType: !652, size: 576, offset: 75712)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 576, elements: !653)
!653 = !{!637}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !567, file: !566, line: 109, baseType: !655, size: 20736, offset: 76288)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 20736, elements: !636)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !567, file: !566, line: 110, baseType: !640, size: 64, offset: 97024)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !567, file: !566, line: 111, baseType: !640, size: 64, offset: 97088)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !567, file: !566, line: 112, baseType: !659, size: 64, offset: 97152)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !567, file: !566, line: 113, baseType: !659, size: 64, offset: 97216)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !567, file: !566, line: 114, baseType: !659, size: 64, offset: 97280)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !567, file: !566, line: 115, baseType: !50, size: 32, offset: 97344)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !567, file: !566, line: 116, baseType: !462, size: 64, offset: 97408)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !567, file: !566, line: 117, baseType: !462, size: 64, offset: 97472)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !567, file: !566, line: 118, baseType: !462, size: 64, offset: 97536)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !567, file: !566, line: 119, baseType: !50, size: 32, offset: 97600)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !567, file: !566, line: 120, baseType: !668, size: 576, offset: 97632)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 576, elements: !653)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !567, file: !566, line: 121, baseType: !26, size: 32, offset: 98208)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !567, file: !566, line: 122, baseType: !62, size: 64, offset: 98240)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !567, file: !566, line: 125, baseType: !672, size: 256, offset: 98304)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !89, line: 503, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 496, size: 256, elements: !674)
!674 = !{!675, !677, !678, !679}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !673, file: !89, line: 498, baseType: !676, size: 64)
!676 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !673, file: !89, line: 499, baseType: !676, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !673, file: !89, line: 500, baseType: !676, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !673, file: !89, line: 502, baseType: !676, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !567, file: !566, line: 128, baseType: !681, size: 2008, offset: 98560)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 2008, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 251)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !567, file: !566, line: 129, baseType: !685, size: 8032, offset: 100576)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8032, elements: !682)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !567, file: !566, line: 130, baseType: !687, size: 16064, offset: 108608)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 16064, elements: !682)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !567, file: !566, line: 131, baseType: !50, size: 32, offset: 124672)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !567, file: !566, line: 132, baseType: !50, size: 32, offset: 124704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !567, file: !566, line: 135, baseType: !50, size: 32, offset: 124736)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !567, file: !566, line: 136, baseType: !50, size: 32, offset: 124768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !567, file: !566, line: 137, baseType: !50, size: 32, offset: 124800)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !567, file: !566, line: 138, baseType: !50, size: 32, offset: 124832)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !567, file: !566, line: 139, baseType: !50, size: 32, offset: 124864)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !567, file: !566, line: 142, baseType: !192, size: 32, offset: 124896)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !567, file: !566, line: 143, baseType: !50, size: 32, offset: 124928)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !567, file: !566, line: 144, baseType: !50, size: 32, offset: 124960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !567, file: !566, line: 145, baseType: !50, size: 32, offset: 124992)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !560, file: !22, line: 470, baseType: !700, size: 128, offset: 64)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 128, elements: !35)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !560, file: !22, line: 473, baseType: !563, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !560, file: !22, line: 476, baseType: !703, size: 1152, offset: 256)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1152, elements: !653)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !560, file: !22, line: 478, baseType: !50, size: 32, offset: 1408)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !560, file: !22, line: 480, baseType: !50, size: 32, offset: 1440)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !560, file: !22, line: 482, baseType: !50, size: 32, offset: 1472)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !560, file: !22, line: 483, baseType: !50, size: 32, offset: 1504)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !560, file: !22, line: 484, baseType: !50, size: 32, offset: 1536)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !560, file: !22, line: 485, baseType: !50, size: 32, offset: 1568)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !560, file: !22, line: 486, baseType: !50, size: 32, offset: 1600)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !560, file: !22, line: 487, baseType: !573, size: 64, offset: 1664)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !560, file: !22, line: 488, baseType: !573, size: 64, offset: 1728)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !560, file: !22, line: 489, baseType: !714, size: 128, offset: 1792)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 128, elements: !35)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !560, file: !22, line: 490, baseType: !573, size: 64, offset: 1920)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !560, file: !22, line: 491, baseType: !573, size: 64, offset: 1984)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !560, file: !22, line: 492, baseType: !50, size: 32, offset: 2048)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !560, file: !22, line: 493, baseType: !50, size: 32, offset: 2080)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !90, file: !22, line: 497, baseType: !564, size: 64, offset: 117440)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !90, file: !22, line: 500, baseType: !564, size: 64, offset: 117504)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !90, file: !22, line: 503, baseType: !50, size: 32, offset: 117568)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !90, file: !22, line: 504, baseType: !723, size: 1216, offset: 117632)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1216, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 19)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !90, file: !22, line: 505, baseType: !50, size: 32, offset: 118848)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !90, file: !22, line: 506, baseType: !723, size: 1216, offset: 118912)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !90, file: !22, line: 507, baseType: !196, size: 64, offset: 120128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !90, file: !22, line: 510, baseType: !50, size: 32, offset: 120192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !90, file: !22, line: 511, baseType: !50, size: 32, offset: 120224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !90, file: !22, line: 512, baseType: !573, size: 64, offset: 120256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !90, file: !22, line: 522, baseType: !733, size: 10624, offset: 120320)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !22, line: 515, size: 10624, elements: !734)
!734 = !{!735, !737, !740, !743}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !733, file: !22, line: 517, baseType: !736, size: 256, align: 128)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 256, elements: !141)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !733, file: !22, line: 518, baseType: !738, size: 128, align: 128, offset: 256)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !739)
!739 = !{!36, !43}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !733, file: !22, line: 520, baseType: !741, size: 4096, align: 128, offset: 384)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 4096, elements: !742)
!742 = !{!43, !149}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !733, file: !22, line: 521, baseType: !744, size: 6144, align: 128, offset: 4480)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 6144, elements: !745)
!745 = !{!746, !142}
!746 = !DISubrange(count: 24)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !90, file: !22, line: 732, baseType: !748, size: 82688, offset: 130944)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !22, line: 525, size: 82688, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !777, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !795, !798, !802, !803, !804, !809, !810, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !878, !909, !910, !911, !912, !913, !914, !915, !916, !917, !920, !921, !922, !925, !928, !930, !933, !935, !936}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !748, file: !22, line: 527, baseType: !50, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !748, file: !22, line: 530, baseType: !50, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !748, file: !22, line: 531, baseType: !50, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !748, file: !22, line: 532, baseType: !50, size: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !748, file: !22, line: 535, baseType: !50, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !748, file: !22, line: 536, baseType: !50, size: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !748, file: !22, line: 537, baseType: !50, size: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !748, file: !22, line: 538, baseType: !50, size: 32, offset: 224)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !748, file: !22, line: 539, baseType: !50, size: 32, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !748, file: !22, line: 542, baseType: !50, size: 32, offset: 288)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !748, file: !22, line: 543, baseType: !50, size: 32, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !748, file: !22, line: 544, baseType: !50, size: 32, offset: 352)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !748, file: !22, line: 545, baseType: !50, size: 32, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !748, file: !22, line: 546, baseType: !50, size: 32, offset: 416)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !748, file: !22, line: 547, baseType: !50, size: 32, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !748, file: !22, line: 548, baseType: !50, size: 32, offset: 480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !748, file: !22, line: 549, baseType: !50, size: 32, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !748, file: !22, line: 551, baseType: !50, size: 32, offset: 544)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !748, file: !22, line: 554, baseType: !196, size: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !748, file: !22, line: 555, baseType: !196, size: 64, offset: 640)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !748, file: !22, line: 558, baseType: !196, size: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !748, file: !22, line: 559, baseType: !196, size: 64, offset: 768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !748, file: !22, line: 561, baseType: !196, size: 64, offset: 832)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !748, file: !22, line: 562, baseType: !196, size: 64, offset: 896)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !748, file: !22, line: 565, baseType: !7, size: 32, offset: 960)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !748, file: !22, line: 566, baseType: !776, size: 128, offset: 992)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !42)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !748, file: !22, line: 567, baseType: !778, size: 512, offset: 1120)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !141)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !748, file: !22, line: 568, baseType: !7, size: 32, offset: 1632)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !748, file: !22, line: 569, baseType: !7, size: 32, offset: 1664)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !748, file: !22, line: 570, baseType: !50, size: 32, offset: 1696)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !748, file: !22, line: 571, baseType: !50, size: 32, offset: 1728)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !748, file: !22, line: 572, baseType: !50, size: 32, offset: 1760)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !748, file: !22, line: 573, baseType: !50, size: 32, offset: 1792)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !748, file: !22, line: 574, baseType: !50, size: 32, offset: 1824)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !748, file: !22, line: 575, baseType: !50, size: 32, offset: 1856)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !748, file: !22, line: 576, baseType: !50, size: 32, offset: 1888)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !748, file: !22, line: 577, baseType: !50, size: 32, offset: 1920)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !748, file: !22, line: 578, baseType: !50, size: 32, offset: 1952)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !22, line: 585, baseType: !621, size: 64, offset: 1984)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !748, file: !22, line: 586, baseType: !284, size: 64, offset: 2048)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !748, file: !22, line: 587, baseType: !621, size: 64, offset: 2112)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !748, file: !22, line: 588, baseType: !794, size: 64, offset: 2176)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !748, file: !22, line: 589, baseType: !796, size: 64, offset: 2240)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 64, elements: !71)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !748, file: !22, line: 591, baseType: !799, size: 64, offset: 2304)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, elements: !801)
!801 = !{!746}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !748, file: !22, line: 592, baseType: !621, size: 64, offset: 2368)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !748, file: !22, line: 593, baseType: !627, size: 128, offset: 2432)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !748, file: !22, line: 594, baseType: !805, size: 128, offset: 2560)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 128, elements: !35)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !808)
!808 = !{!72, !36}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !748, file: !22, line: 595, baseType: !642, size: 128, offset: 2688)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !748, file: !22, line: 596, baseType: !811, size: 4096, offset: 2816)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 4096, elements: !812)
!812 = !{!36, !524}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !748, file: !22, line: 597, baseType: !621, size: 64, offset: 6912)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !748, file: !22, line: 598, baseType: !621, size: 64, offset: 6976)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !748, file: !22, line: 599, baseType: !462, size: 64, offset: 7040)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !748, file: !22, line: 603, baseType: !616, size: 1024, offset: 7104)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !748, file: !22, line: 606, baseType: !50, size: 32, offset: 8128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !748, file: !22, line: 607, baseType: !50, size: 32, offset: 8160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !748, file: !22, line: 608, baseType: !38, size: 32, align: 32, offset: 8192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !748, file: !22, line: 609, baseType: !50, size: 32, offset: 8224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !748, file: !22, line: 611, baseType: !50, size: 32, offset: 8256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !748, file: !22, line: 612, baseType: !50, size: 32, offset: 8288)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !748, file: !22, line: 614, baseType: !50, size: 32, offset: 8320)
