; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/memory.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/memory.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._MemoryInfo = type { [4096 x i8], i32, i64, ptr, i64 }

@memory_methods.0 = internal unnamed_addr global ptr @malloc, align 8, !dbg !0
@memory_methods.1 = internal unnamed_addr global ptr @realloc, align 8, !dbg !151
@memory_methods.2 = internal unnamed_addr global ptr @free, align 8, !dbg !152
@.str = private unnamed_addr constant [85 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/memory.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [23 x i8] c"MemoryAllocationFailed\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1

; Function Attrs: mustprogress nofree nounwind willreturn allocsize(0,1) uwtable
define dso_local ptr @AcquireAlignedMemory(i64 noundef %count, i64 noundef %quantum) local_unnamed_addr #0 !dbg !160 {
entry:
  call void @llvm.dbg.value(metadata i64 %count, metadata !165, metadata !DIExpression()), !dbg !173

!37 = !DIEnumerator(name: "RegistryWarning", value: 390)
!38 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!39 = !DIEnumerator(name: "PolicyWarning", value: 399)
!40 = !DIEnumerator(name: "ErrorException", value: 400)
!41 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!42 = !DIEnumerator(name: "TypeError", value: 405)
!43 = !DIEnumerator(name: "OptionError", value: 410)
!44 = !DIEnumerator(name: "DelegateError", value: 415)
!45 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!46 = !DIEnumerator(name: "CorruptImageError", value: 425)
!47 = !DIEnumerator(name: "FileOpenError", value: 430)
!48 = !DIEnumerator(name: "BlobError", value: 435)
!49 = !DIEnumerator(name: "StreamError", value: 440)
!50 = !DIEnumerator(name: "CacheError", value: 445)
!51 = !DIEnumerator(name: "CoderError", value: 450)
!52 = !DIEnumerator(name: "FilterError", value: 452)
!53 = !DIEnumerator(name: "ModuleError", value: 455)
!54 = !DIEnumerator(name: "DrawError", value: 460)
!55 = !DIEnumerator(name: "ImageError", value: 465)
!56 = !DIEnumerator(name: "WandError", value: 470)
!57 = !DIEnumerator(name: "RandomError", value: 475)
!58 = !DIEnumerator(name: "XServerError", value: 480)
!59 = !DIEnumerator(name: "MonitorError", value: 485)
!60 = !DIEnumerator(name: "RegistryError", value: 490)
!61 = !DIEnumerator(name: "ConfigureError", value: 495)
!62 = !DIEnumerator(name: "PolicyError", value: 499)
!63 = !DIEnumerator(name: "FatalErrorException", value: 700)
!64 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!65 = !DIEnumerator(name: "TypeFatalError", value: 705)
!66 = !DIEnumerator(name: "OptionFatalError", value: 710)
!67 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!68 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!69 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!70 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!71 = !DIEnumerator(name: "BlobFatalError", value: 735)
!72 = !DIEnumerator(name: "StreamFatalError", value: 740)
!73 = !DIEnumerator(name: "CacheFatalError", value: 745)
!74 = !DIEnumerator(name: "CoderFatalError", value: 750)
!75 = !DIEnumerator(name: "FilterFatalError", value: 752)
!76 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!77 = !DIEnumerator(name: "DrawFatalError", value: 760)
!78 = !DIEnumerator(name: "ImageFatalError", value: 765)
!79 = !DIEnumerator(name: "WandFatalError", value: 770)
!80 = !DIEnumerator(name: "RandomFatalError", value: 775)
!81 = !DIEnumerator(name: "XServerFatalError", value: 780)
!82 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!83 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!84 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!85 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 211, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "MagickFalse", value: 0)
!90 = !DIEnumerator(name: "MagickTrue", value: 1)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !92, line: 25, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102}
!94 = !DIEnumerator(name: "UndefinedResource", value: 0)
!95 = !DIEnumerator(name: "AreaResource", value: 1)
!96 = !DIEnumerator(name: "DiskResource", value: 2)
!97 = !DIEnumerator(name: "FileResource", value: 3)
!98 = !DIEnumerator(name: "MapResource", value: 4)
!99 = !DIEnumerator(name: "MemoryResource", value: 5)
!100 = !DIEnumerator(name: "ThreadResource", value: 6)
!101 = !DIEnumerator(name: "TimeResource", value: 7)
!102 = !DIEnumerator(name: "ThrottleResource", value: 8)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 30, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "aeac60f5bee0fb1a4f0bd1456ae975f0")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "ReadMode", value: 0)
!107 = !DIEnumerator(name: "WriteMode", value: 1)
!108 = !DIEnumerator(name: "IOMode", value: 2)
!109 = !{!110, !111, !114, !115, !113, !130, !131, !135, !139}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 46, baseType: !113)
!112 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!113 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryInfo", file: !117, line: 26, baseType: !118)
!117 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MemoryInfo", file: !6, line: 129, size: 33024, elements: !119)
!119 = !{!120, !125, !127, !128, !129}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !118, file: !6, line: 132, baseType: !121, size: 32768)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 32768, elements: !123)
!122 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!123 = !{!124}
!124 = !DISubrange(count: 4096)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !6, line: 135, baseType: !126, size: 32, offset: 32768)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualMemoryType", file: !6, line: 98, baseType: !5)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !118, file: !6, line: 138, baseType: !111, size: 64, offset: 32832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !118, file: !6, line: 141, baseType: !110, size: 64, offset: 32896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !118, file: !6, line: 144, baseType: !111, size: 64, offset: 32960)
!130 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AcquireMemoryHandler", file: !117, line: 29, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!110, !111}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResizeMemoryHandler", file: !117, line: 31, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!110, !110, !111}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "DestroyMemoryHandler", file: !117, line: 30, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !110}
!143 = !{!144}
!144 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickMemoryMethods", file: !6, line: 127, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickMemoryMethods", file: !6, line: 117, size: 192, elements: !147)
!147 = !{!148, !149, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "acquire_memory_handler", scope: !146, file: !6, line: 120, baseType: !131, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "resize_memory_handler", scope: !146, file: !6, line: 123, baseType: !135, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_memory_handler", scope: !146, file: !6, line: 126, baseType: !139, size: 64, offset: 128)
!151 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!152 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 128, 64))
!153 = !{i32 7, !"Dwarf Version", i32 5}
!154 = !{i32 2, !"Debug Info Version", i32 3}
!155 = !{i32 1, !"wchar_size", i32 4}
!156 = !{i32 7, !"PIC Level", i32 2}
!157 = !{i32 7, !"PIE Level", i32 2}
!158 = !{i32 7, !"uwtable", i32 2}
!159 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!160 = distinct !DISubprogram(name: "AcquireAlignedMemory", scope: !6, file: !6, line: 237, type: !161, scopeLine: 238, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !164)
!161 = !DISubroutineType(types: !162)
!162 = !{!110, !163, !163}
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!164 = !{!165, !166, !167, !168, !169, !170, !171}
!165 = !DILocalVariable(name: "count", arg: 1, scope: !160, file: !6, line: 237, type: !163)
!166 = !DILocalVariable(name: "quantum", arg: 2, scope: !160, file: !6, line: 237, type: !163)
!167 = !DILocalVariable(name: "alignment", scope: !160, file: !6, line: 243, type: !111)
!168 = !DILocalVariable(name: "extent", scope: !160, file: !6, line: 244, type: !111)
!169 = !DILocalVariable(name: "size", scope: !160, file: !6, line: 245, type: !111)
!170 = !DILocalVariable(name: "memory", scope: !160, file: !6, line: 248, type: !110)
!171 = !DILocalVariable(name: "p", scope: !172, file: !6, line: 269, type: !110)
!172 = distinct !DILexicalBlock(scope: !160, file: !6, line: 267, column: 3)
!173 = !DILocation(line: 0, scope: !160)
!174 = !DILocation(line: 250, column: 13, scope: !160)
!175 = !DILocation(line: 251, column: 14, scope: !176)
!176 = distinct !DILexicalBlock(scope: !160, file: !6, line: 251, column: 7)
!177 = !DILocation(line: 251, column: 20, scope: !176)
!178 = !DILocation(line: 251, column: 7, scope: !160)
!179 = !DILocation(line: 253, column: 7, scope: !180)
!180 = distinct !DILexicalBlock(scope: !176, file: !6, line: 252, column: 5)
!181 = !DILocation(line: 253, column: 12, scope: !180)
!182 = !{!183, !183, i64 0}
!183 = !{!"int", !184, i64 0}
!184 = !{!"omnipotent char", !185, i64 0}
!185 = !{!"Simple C/C++ TBAA"}
!186 = !DILocation(line: 254, column: 7, scope: !180)
!187 = !DILocation(line: 259, column: 13, scope: !188)
!188 = distinct !DILexicalBlock(scope: !160, file: !6, line: 259, column: 7)
!189 = !DILocation(line: 259, column: 19, scope: !188)
!190 = !DILocation(line: 258, column: 10, scope: !160)
!191 = !DILocation(line: 259, column: 62, scope: !188)
!192 = !DILocation(line: 259, column: 7, scope: !160)
!193 = !DILocation(line: 271, column: 30, scope: !172)
!194 = !DILocation(line: 274, column: 11, scope: !195)
!195 = distinct !DILexicalBlock(scope: !196, file: !6, line: 273, column: 7)
!196 = distinct !DILexicalBlock(scope: !172, file: !6, line: 272, column: 9)
!197 = !DILocation(line: 0, scope: !172)
!198 = !DILocation(line: 275, column: 15, scope: !199)
!199 = distinct !DILexicalBlock(scope: !195, file: !6, line: 275, column: 13)
!200 = !DILocation(line: 275, column: 13, scope: !195)
!201 = !DILocation(line: 277, column: 29, scope: !202)
!202 = distinct !DILexicalBlock(scope: !199, file: !6, line: 276, column: 11)
!203 = !DILocation(line: 277, column: 20, scope: !202)
!204 = !DILocation(line: 278, column: 31, scope: !202)
!205 = !DILocation(line: 278, column: 34, scope: !202)
!206 = !{!207, !207, i64 0}
!207 = !{!"any pointer", !184, i64 0}
!208 = !DILocation(line: 279, column: 11, scope: !202)
!209 = !DILocation(line: 284, column: 1, scope: !160)
!210 = distinct !DISubprogram(name: "AcquireMagickMemory", scope: !6, file: !6, line: 458, type: !211, scopeLine: 459, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{!110, !163}
!213 = !{!214, !215}
!214 = !DILocalVariable(name: "size", arg: 1, scope: !210, file: !6, line: 458, type: !163)
!215 = !DILocalVariable(name: "memory", scope: !210, file: !6, line: 461, type: !110)
!216 = !DILocation(line: 0, scope: !210)
!217 = !DILocation(line: 464, column: 25, scope: !210)
!218 = !{!219, !207, i64 0}
!219 = !{!"_MagickMemoryMethods", !207, i64 0, !207, i64 8, !207, i64 16}
!220 = !DILocation(line: 464, column: 53, scope: !210)
!221 = !DILocation(line: 464, column: 48, scope: !210)
!222 = !DILocation(line: 464, column: 10, scope: !210)
!223 = !DILocation(line: 501, column: 3, scope: !210)
!224 = distinct !DISubprogram(name: "AcquireQuantumMemory", scope: !6, file: !6, line: 529, type: !161, scopeLine: 530, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !225)
!225 = !{!226, !227, !228}
!226 = !DILocalVariable(name: "count", arg: 1, scope: !224, file: !6, line: 529, type: !163)
!227 = !DILocalVariable(name: "quantum", arg: 2, scope: !224, file: !6, line: 529, type: !163)
!228 = !DILocalVariable(name: "size", scope: !224, file: !6, line: 532, type: !111)
!229 = !DILocation(line: 0, scope: !224)
!230 = !DILocation(line: 534, column: 13, scope: !224)
!231 = !DILocation(line: 535, column: 14, scope: !232)
!232 = distinct !DILexicalBlock(scope: !224, file: !6, line: 535, column: 7)
!233 = !DILocation(line: 535, column: 20, scope: !232)
!234 = !DILocation(line: 535, column: 7, scope: !224)
!235 = !DILocation(line: 537, column: 7, scope: !236)
!236 = distinct !DILexicalBlock(scope: !232, file: !6, line: 536, column: 5)
!237 = !DILocation(line: 537, column: 12, scope: !236)
!238 = !DILocation(line: 538, column: 7, scope: !236)
!239 = !DILocation(line: 0, scope: !210, inlinedAt: !240)
!240 = distinct !DILocation(line: 540, column: 10, scope: !224)
!241 = !DILocation(line: 464, column: 25, scope: !210, inlinedAt: !240)
!242 = !DILocation(line: 464, column: 53, scope: !210, inlinedAt: !240)
!243 = !DILocation(line: 464, column: 48, scope: !210, inlinedAt: !240)
!244 = !DILocation(line: 464, column: 10, scope: !210, inlinedAt: !240)
!245 = !DILocation(line: 540, column: 3, scope: !224)
!246 = !DILocation(line: 541, column: 1, scope: !224)
!247 = distinct !DISubprogram(name: "AcquireVirtualMemory", scope: !6, file: !6, line: 568, type: !248, scopeLine: 570, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !250)
!248 = !DISubroutineType(types: !249)
!249 = !{!115, !163, !163}
!250 = !{!251, !252, !253, !254, !255, !259, !277}
!251 = !DILocalVariable(name: "count", arg: 1, scope: !247, file: !6, line: 568, type: !163)
!252 = !DILocalVariable(name: "quantum", arg: 2, scope: !247, file: !6, line: 569, type: !163)
!253 = !DILocalVariable(name: "memory_info", scope: !247, file: !6, line: 572, type: !115)
!254 = !DILocalVariable(name: "length", scope: !247, file: !6, line: 575, type: !111)
!255 = !DILocalVariable(name: "message", scope: !256, file: !6, line: 586, type: !258)
!256 = distinct !DILexicalBlock(scope: !257, file: !6, line: 586, column: 5)
!257 = distinct !DILexicalBlock(scope: !247, file: !6, line: 585, column: 7)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!259 = !DILocalVariable(name: "exception", scope: !256, file: !6, line: 586, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !87, line: 219, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !14, line: 102, size: 448, elements: !262)
!262 = !{!263, !265, !266, !267, !268, !269, !271, !276}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !261, file: !14, line: 105, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !14, line: 100, baseType: !13)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !261, file: !14, line: 108, baseType: !130, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !261, file: !14, line: 111, baseType: !258, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !261, file: !14, line: 112, baseType: !258, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !261, file: !14, line: 115, baseType: !110, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !261, file: !14, line: 118, baseType: !270, size: 32, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !87, line: 215, baseType: !86)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !261, file: !14, line: 121, baseType: !272, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !274, line: 26, baseType: !275)
!274 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !274, line: 25, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !261, file: !14, line: 124, baseType: !111, size: 64, offset: 384)
!277 = !DILocalVariable(name: "file", scope: !278, file: !6, line: 613, type: !130)
!278 = distinct !DILexicalBlock(scope: !279, file: !6, line: 611, column: 5)
!279 = distinct !DILexicalBlock(scope: !247, file: !6, line: 610, column: 7)
!280 = !DILocation(line: 0, scope: !247)
!281 = !DILocation(line: 577, column: 15, scope: !247)
!282 = !DILocation(line: 578, column: 14, scope: !283)
!283 = distinct !DILexicalBlock(scope: !247, file: !6, line: 578, column: 7)
!284 = !DILocation(line: 578, column: 20, scope: !283)
!285 = !DILocation(line: 578, column: 7, scope: !247)
!286 = !DILocation(line: 580, column: 7, scope: !287)
!287 = distinct !DILexicalBlock(scope: !283, file: !6, line: 579, column: 5)
!288 = !DILocation(line: 580, column: 12, scope: !287)
!289 = !DILocation(line: 581, column: 7, scope: !287)
!290 = !DILocation(line: 0, scope: !160, inlinedAt: !291)
!291 = distinct !DILocation(line: 583, column: 30, scope: !247)
!292 = !DILocation(line: 274, column: 11, scope: !195, inlinedAt: !291)
!293 = !DILocation(line: 0, scope: !172, inlinedAt: !291)
!294 = !DILocation(line: 275, column: 15, scope: !199, inlinedAt: !291)
!295 = !DILocation(line: 275, column: 13, scope: !195, inlinedAt: !291)
!296 = !DILocation(line: 277, column: 29, scope: !202, inlinedAt: !291)
!297 = !DILocation(line: 277, column: 20, scope: !202, inlinedAt: !291)
!298 = !DILocation(line: 278, column: 31, scope: !202, inlinedAt: !291)
!299 = !DILocation(line: 278, column: 34, scope: !202, inlinedAt: !291)
!300 = !DILocation(line: 585, column: 19, scope: !257)
!301 = !DILocation(line: 585, column: 7, scope: !247)
!302 = !DILocation(line: 586, column: 5, scope: !256)
!303 = !DILocation(line: 0, scope: !256)
!304 = !DILocalVariable(name: "memory", arg: 1, scope: !305, file: !6, line: 1081, type: !110)
!305 = distinct !DISubprogram(name: "ResetMagickMemory", scope: !6, file: !6, line: 1081, type: !306, scopeLine: 1082, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{!110, !110, !130, !163}
!308 = !{!304, !309, !310}
!309 = !DILocalVariable(name: "byte", arg: 2, scope: !305, file: !6, line: 1081, type: !130)
!310 = !DILocalVariable(name: "size", arg: 3, scope: !305, file: !6, line: 1081, type: !163)
!311 = !DILocation(line: 0, scope: !305, inlinedAt: !312)
!312 = distinct !DILocation(line: 587, column: 10, scope: !247)
!313 = !DILocation(line: 1084, column: 10, scope: !305, inlinedAt: !312)
!314 = !DILocation(line: 588, column: 16, scope: !247)
!315 = !DILocation(line: 588, column: 22, scope: !247)
!316 = !{!317, !318, i64 4104}
!317 = !{!"_MemoryInfo", !184, i64 0, !184, i64 4096, !318, i64 4104, !207, i64 4112, !318, i64 4120}
!318 = !{!"long", !184, i64 0}
!319 = !DILocation(line: 589, column: 16, scope: !247)
!320 = !DILocation(line: 589, column: 25, scope: !247)
!321 = !{!317, !318, i64 4120}
!322 = !DILocation(line: 590, column: 7, scope: !323)
!323 = distinct !DILexicalBlock(scope: !247, file: !6, line: 590, column: 7)
!324 = !DILocation(line: 590, column: 52, scope: !323)
!325 = !DILocation(line: 590, column: 7, scope: !247)
!326 = !DILocation(line: 0, scope: !160, inlinedAt: !327)
!327 = distinct !DILocation(line: 592, column: 25, scope: !328)
!328 = distinct !DILexicalBlock(scope: !323, file: !6, line: 591, column: 5)
!329 = !DILocation(line: 259, column: 13, scope: !188, inlinedAt: !327)
!330 = !DILocation(line: 259, column: 19, scope: !188, inlinedAt: !327)
!331 = !DILocation(line: 258, column: 10, scope: !160, inlinedAt: !327)
!332 = !DILocation(line: 259, column: 62, scope: !188, inlinedAt: !327)
!333 = !DILocation(line: 259, column: 7, scope: !160, inlinedAt: !327)
!334 = !DILocation(line: 271, column: 30, scope: !172, inlinedAt: !327)
!335 = !DILocation(line: 274, column: 11, scope: !195, inlinedAt: !327)
