; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r/llvm-ir/544.nab_r_bc/src/memutil.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/memutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@stderr = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [11 x i8] c"FATAL: %s\0A\00", align 1
@nabout = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [41 x i8] c"allocation failure in vector: nh = %lld\0A\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"allocation failure in vector()\00", align 1
@.str.3 = private unnamed_addr constant [32 x i8] c"allocation failure in ivector()\00", align 1
@.str.4 = private unnamed_addr constant [33 x i8] c"allocation failure in ipvector()\00", align 1
@.str.5 = private unnamed_addr constant [33 x i8] c"allocation failure 1 in matrix()\00", align 1
@.str.6 = private unnamed_addr constant [33 x i8] c"allocation failure 2 in matrix()\00", align 1

; Function Attrs: noreturn nounwind uwtable
define dso_local void @nrerror(ptr noundef %msg) local_unnamed_addr #0 !dbg !19 {
entry:
  call void @llvm.dbg.value(metadata ptr %msg, metadata !24, metadata !DIExpression()), !dbg !25
  %0 = load ptr, ptr @stderr, align 8, !dbg !26, !tbaa !27

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/memutil.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r", checksumkind: CSK_MD5, checksum: "69fa2a4216f25d0cb4fca617d474b59c")
!2 = !{!3, !5, !6, !8, !9, !10}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!5 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !{i32 7, !"Dwarf Version", i32 5}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{i32 7, !"PIC Level", i32 2}
!16 = !{i32 7, !"PIE Level", i32 2}
!17 = !{i32 7, !"uwtable", i32 2}
!18 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!19 = distinct !DISubprogram(name: "nrerror", scope: !20, file: !20, line: 6, type: !21, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !23)
!20 = !DIFile(filename: "apps/544.nab_r/src/memutil.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "69fa2a4216f25d0cb4fca617d474b59c")
!21 = !DISubroutineType(types: !22)
!22 = !{null, !10}
!23 = !{!24}
!24 = !DILocalVariable(name: "msg", arg: 1, scope: !19, file: !20, line: 6, type: !10)
!25 = !DILocation(line: 0, scope: !19)
!26 = !DILocation(line: 12, column: 11, scope: !19)
!27 = !{!28, !28, i64 0}
!28 = !{!"any pointer", !29, i64 0}
!29 = !{!"omnipotent char", !30, i64 0}
!30 = !{!"Simple C/C++ TBAA"}
!31 = !DILocation(line: 12, column: 2, scope: !19)
!32 = !DILocation(line: 13, column: 2, scope: !19)
!33 = distinct !DISubprogram(name: "vector", scope: !20, file: !20, line: 16, type: !34, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !39)
!34 = !DISubroutineType(types: !35)
!35 = !{!3, !36, !36}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 46, baseType: !38)
!37 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !{!40, !41, !42}
!40 = !DILocalVariable(name: "nl", arg: 1, scope: !33, file: !20, line: 16, type: !36)
!41 = !DILocalVariable(name: "nh", arg: 2, scope: !33, file: !20, line: 16, type: !36)
!42 = !DILocalVariable(name: "v", scope: !33, file: !20, line: 18, type: !3)
!43 = !DILocation(line: 0, scope: !33)
!44 = !DILocation(line: 29, column: 31, scope: !33)
!45 = !DILocation(line: 29, column: 42, scope: !33)
!46 = !DILocation(line: 29, column: 18, scope: !33)
!47 = !DILocation(line: 30, column: 7, scope: !48)
!48 = distinct !DILexicalBlock(scope: !33, file: !20, line: 30, column: 6)
!49 = !DILocation(line: 30, column: 6, scope: !33)
!50 = !DILocation(line: 31, column: 19, scope: !51)
!51 = distinct !DILexicalBlock(scope: !48, file: !20, line: 30, column: 11)
!52 = !DILocation(line: 31, column: 10, scope: !51)
!53 = !DILocation(line: 32, column: 10, scope: !51)
!54 = !DILocation(line: 32, column: 3, scope: !51)
!55 = !DILocation(line: 0, scope: !19, inlinedAt: !56)
!56 = distinct !DILocation(line: 33, column: 3, scope: !51)
!57 = !DILocation(line: 12, column: 11, scope: !19, inlinedAt: !56)
!58 = !DILocation(line: 12, column: 2, scope: !19, inlinedAt: !56)
!59 = !DILocation(line: 13, column: 2, scope: !19, inlinedAt: !56)
!60 = !DILocation(line: 39, column: 12, scope: !33)
!61 = !DILocation(line: 39, column: 2, scope: !33)
!62 = !DISubprogram(name: "fflush", scope: !63, file: !63, line: 218, type: !64, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !123)
!63 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!64 = !DISubroutineType(types: !65)
!65 = !{!7, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !68, line: 7, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !70, line: 49, size: 1728, elements: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !89, !90, !91, !95, !97, !99, !103, !106, !108, !111, !114, !115, !117, !118, !119}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !69, file: !70, line: 51, baseType: !7, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !69, file: !70, line: 54, baseType: !10, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !69, file: !70, line: 55, baseType: !10, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !69, file: !70, line: 56, baseType: !10, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !69, file: !70, line: 57, baseType: !10, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !69, file: !70, line: 58, baseType: !10, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !69, file: !70, line: 59, baseType: !10, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !69, file: !70, line: 60, baseType: !10, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !69, file: !70, line: 61, baseType: !10, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !69, file: !70, line: 64, baseType: !10, size: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !69, file: !70, line: 65, baseType: !10, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !69, file: !70, line: 66, baseType: !10, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !69, file: !70, line: 68, baseType: !85, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !70, line: 36, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !69, file: !70, line: 70, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !69, file: !70, line: 72, baseType: !7, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !69, file: !70, line: 73, baseType: !7, size: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !69, file: !70, line: 74, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !93, line: 152, baseType: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!94 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !69, file: !70, line: 77, baseType: !96, size: 16, offset: 1024)
!96 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !69, file: !70, line: 78, baseType: !98, size: 8, offset: 1040)
!98 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !69, file: !70, line: 79, baseType: !100, size: 8, offset: 1048)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 1)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !69, file: !70, line: 81, baseType: !104, size: 64, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !70, line: 43, baseType: null)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !69, file: !70, line: 89, baseType: !107, size: 64, offset: 1152)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !93, line: 153, baseType: !94)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !69, file: !70, line: 91, baseType: !109, size: 64, offset: 1216)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !70, line: 37, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !69, file: !70, line: 92, baseType: !112, size: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !70, line: 38, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !69, file: !70, line: 93, baseType: !88, size: 64, offset: 1344)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !69, file: !70, line: 94, baseType: !116, size: 64, offset: 1408)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !69, file: !70, line: 95, baseType: !36, size: 64, offset: 1472)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !69, file: !70, line: 96, baseType: !7, size: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !69, file: !70, line: 98, baseType: !120, size: 160, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !{}
!124 = distinct !DISubprogram(name: "ivector", scope: !20, file: !20, line: 42, type: !125, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !127)
!125 = !DISubroutineType(types: !126)
!126 = !{!6, !7, !7}
!127 = !{!128, !129, !130}
!128 = !DILocalVariable(name: "nl", arg: 1, scope: !124, file: !20, line: 42, type: !7)
!129 = !DILocalVariable(name: "nh", arg: 2, scope: !124, file: !20, line: 42, type: !7)
!130 = !DILocalVariable(name: "v", scope: !124, file: !20, line: 47, type: !6)
!131 = !DILocation(line: 0, scope: !124)
!132 = !DILocation(line: 49, column: 28, scope: !124)
!133 = !DILocation(line: 49, column: 33, scope: !124)
!134 = !DILocation(line: 49, column: 23, scope: !124)
!135 = !DILocation(line: 49, column: 39, scope: !124)
!136 = !DILocation(line: 49, column: 15, scope: !124)
!137 = !DILocation(line: 50, column: 7, scope: !138)
!138 = distinct !DILexicalBlock(scope: !124, file: !20, line: 50, column: 6)
!139 = !DILocation(line: 50, column: 6, scope: !124)
!140 = !DILocation(line: 0, scope: !19, inlinedAt: !141)
!141 = distinct !DILocation(line: 51, column: 3, scope: !138)
!142 = !DILocation(line: 12, column: 11, scope: !19, inlinedAt: !141)
!143 = !DILocation(line: 12, column: 2, scope: !19, inlinedAt: !141)
!144 = !DILocation(line: 13, column: 2, scope: !19, inlinedAt: !141)
!145 = !DILocation(line: 52, column: 12, scope: !124)
!146 = !DILocation(line: 52, column: 2, scope: !124)
!147 = distinct !DISubprogram(name: "ipvector", scope: !20, file: !20, line: 55, type: !125, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !148)
!148 = !{!149, !150, !151}
!149 = !DILocalVariable(name: "nl", arg: 1, scope: !147, file: !20, line: 55, type: !7)
!150 = !DILocalVariable(name: "nh", arg: 2, scope: !147, file: !20, line: 55, type: !7)
!151 = !DILocalVariable(name: "v", scope: !147, file: !20, line: 60, type: !6)
!152 = !DILocation(line: 0, scope: !147)
!153 = !DILocation(line: 62, column: 28, scope: !147)
!154 = !DILocation(line: 62, column: 33, scope: !147)
!155 = !DILocation(line: 62, column: 23, scope: !147)
!156 = !DILocation(line: 62, column: 39, scope: !147)
!157 = !DILocation(line: 62, column: 15, scope: !147)
!158 = !DILocation(line: 63, column: 7, scope: !159)
!159 = distinct !DILexicalBlock(scope: !147, file: !20, line: 63, column: 6)
!160 = !DILocation(line: 63, column: 6, scope: !147)
!161 = !DILocation(line: 0, scope: !19, inlinedAt: !162)
!162 = distinct !DILocation(line: 64, column: 3, scope: !159)
!163 = !DILocation(line: 12, column: 11, scope: !19, inlinedAt: !162)
!164 = !DILocation(line: 12, column: 2, scope: !19, inlinedAt: !162)
!165 = !DILocation(line: 13, column: 2, scope: !19, inlinedAt: !162)
!166 = !DILocation(line: 65, column: 12, scope: !147)
!167 = !DILocation(line: 65, column: 2, scope: !147)
!168 = distinct !DISubprogram(name: "matrix", scope: !20, file: !20, line: 69, type: !169, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !171)
!169 = !DISubroutineType(types: !170)
!170 = !{!8, !7, !7, !7, !7}
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179}
!172 = !DILocalVariable(name: "nrl", arg: 1, scope: !168, file: !20, line: 69, type: !7)
!173 = !DILocalVariable(name: "nrh", arg: 2, scope: !168, file: !20, line: 69, type: !7)
!174 = !DILocalVariable(name: "ncl", arg: 3, scope: !168, file: !20, line: 69, type: !7)
!175 = !DILocalVariable(name: "nch", arg: 4, scope: !168, file: !20, line: 69, type: !7)
