; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/mime.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/mime.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._MimeInfo = type { ptr, ptr, ptr, ptr, i64, i64, i64, i32, i64, i64, i32, i64, ptr, i32, i64 }

@mime_cache = internal unnamed_addr global ptr null, align 8, !dbg !0
@mime_semaphore = internal global ptr null, align 8, !dbg !357
@.str = private unnamed_addr constant [83 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/mime.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"*\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"...\00", align 1
@stdout = external local_unnamed_addr global ptr, align 8
@.str.5 = private unnamed_addr constant [12 x i8] c"\0APath: %s\0A\0A\00", align 1
@.str.6 = private unnamed_addr constant [36 x i8] c"Type                   Description\0A\00", align 1
@.str.7 = private unnamed_addr constant [81 x i8] c"-------------------------------------------------------------------------------\0A\00", align 1

!159 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!160 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!161 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!162 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!163 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!164 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!165 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!166 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!167 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!168 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!169 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!170 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!171 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!172 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!173 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!174 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!175 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!176 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!177 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!178 = !DIEnumerator(name: "MagickListOptions", value: 38)
!179 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!180 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!181 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!182 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!183 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!184 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!185 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!186 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!187 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!188 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!189 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!190 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!191 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!192 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!193 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!194 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!195 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!196 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!197 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!198 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!199 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!200 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!201 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!202 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!203 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!204 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!205 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!206 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!207 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!208 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!209 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!210 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !212, line: 46, baseType: !7, size: 32, elements: !213)
!212 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!214 = !DIEnumerator(name: "_ISupper", value: 256)
!215 = !DIEnumerator(name: "_ISlower", value: 512)
!216 = !DIEnumerator(name: "_ISalpha", value: 1024)
!217 = !DIEnumerator(name: "_ISdigit", value: 2048)
!218 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!219 = !DIEnumerator(name: "_ISspace", value: 8192)
!220 = !DIEnumerator(name: "_ISprint", value: 16384)
!221 = !DIEnumerator(name: "_ISgraph", value: 32768)
!222 = !DIEnumerator(name: "_ISblank", value: 1)
!223 = !DIEnumerator(name: "_IScntrl", value: 2)
!224 = !DIEnumerator(name: "_ISpunct", value: 4)
!225 = !DIEnumerator(name: "_ISalnum", value: 8)
!226 = !{!227, !231, !232, !271, !240, !255, !246, !257, !266, !273, !274, !275, !276, !331, !333, !137, !337, !350, !259, !263, !267, !305, !252}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !229, line: 34, baseType: !230)
!229 = !DIFile(filename: "apps/538.imagick_r/src/magick/hashmap.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "683c2bd26601474466c188c023adadf2")
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !229, line: 33, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "MimeInfo", file: !235, line: 26, baseType: !236)
!235 = !DIFile(filename: "apps/538.imagick_r/src/magick/mime.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1f3a6bef5019fd5f2dadd5518bbd368c")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MimeInfo", file: !237, line: 68, size: 960, elements: !238)
!237 = !DIFile(filename: "apps/538.imagick_r/src/magick/mime.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "6543c84b74462340c150e9cc58d83c21")
!238 = !{!239, !242, !243, !244, !245, !251, !254, !258, !260, !261, !262, !264, !265, !268, !270}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !236, file: !237, line: 71, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !237, line: 72, baseType: !240, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !236, file: !237, line: 73, baseType: !240, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !236, file: !237, line: 74, baseType: !240, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !236, file: !237, line: 77, baseType: !246, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !247, line: 77, baseType: !248)
!247 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !249, line: 193, baseType: !250)
!249 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!250 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !236, file: !237, line: 80, baseType: !252, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !253)
!253 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !236, file: !237, line: 83, baseType: !255, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !256, line: 46, baseType: !257)
!256 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!257 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !236, file: !237, line: 86, baseType: !259, size: 32, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataType", file: !85, line: 32, baseType: !84)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !236, file: !237, line: 89, baseType: !246, size: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !236, file: !237, line: 90, baseType: !246, size: 64, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !236, file: !237, line: 93, baseType: !263, size: 32, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !93, line: 35, baseType: !92)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !236, file: !237, line: 96, baseType: !255, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !236, file: !237, line: 99, baseType: !266, size: 64, offset: 768)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !236, file: !237, line: 102, baseType: !269, size: 32, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !236, file: !237, line: 105, baseType: !255, size: 64, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !279, line: 7, baseType: !280)
!279 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !281, line: 49, size: 1728, elements: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !298, !300, !301, !302, !304, !306, !308, !312, !315, !317, !320, !323, !324, !325, !326, !327}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !280, file: !281, line: 51, baseType: !137, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !280, file: !281, line: 54, baseType: !240, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !280, file: !281, line: 55, baseType: !240, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !280, file: !281, line: 56, baseType: !240, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !280, file: !281, line: 57, baseType: !240, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !280, file: !281, line: 58, baseType: !240, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !280, file: !281, line: 59, baseType: !240, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !280, file: !281, line: 60, baseType: !240, size: 64, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !280, file: !281, line: 61, baseType: !240, size: 64, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !280, file: !281, line: 64, baseType: !240, size: 64, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !280, file: !281, line: 65, baseType: !240, size: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !280, file: !281, line: 66, baseType: !240, size: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !280, file: !281, line: 68, baseType: !296, size: 64, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !281, line: 36, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !280, file: !281, line: 70, baseType: !299, size: 64, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !280, file: !281, line: 72, baseType: !137, size: 32, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !280, file: !281, line: 73, baseType: !137, size: 32, offset: 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !280, file: !281, line: 74, baseType: !303, size: 64, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !249, line: 152, baseType: !250)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !280, file: !281, line: 77, baseType: !305, size: 16, offset: 1024)
!305 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !280, file: !281, line: 78, baseType: !307, size: 8, offset: 1040)
!307 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !280, file: !281, line: 79, baseType: !309, size: 8, offset: 1048)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 8, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 1)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !280, file: !281, line: 81, baseType: !313, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !281, line: 43, baseType: null)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !280, file: !281, line: 89, baseType: !316, size: 64, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !249, line: 153, baseType: !250)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !280, file: !281, line: 91, baseType: !318, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !281, line: 37, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !280, file: !281, line: 92, baseType: !321, size: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !281, line: 38, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !280, file: !281, line: 93, baseType: !299, size: 64, offset: 1344)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !280, file: !281, line: 94, baseType: !231, size: 64, offset: 1408)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !280, file: !281, line: 95, baseType: !255, size: 64, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !280, file: !281, line: 96, baseType: !137, size: 32, offset: 1536)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !280, file: !281, line: 98, baseType: !328, size: 160, offset: 1568)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 160, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 20)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !335, line: 26, baseType: !336)
!335 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !335, line: 25, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !340, line: 40, baseType: !341)
!340 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !340, line: 29, size: 32960, elements: !342)
!342 = !{!343, !347, !348, !349}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !341, file: !340, line: 32, baseType: !344, size: 32768)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 32768, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 4096)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !341, file: !340, line: 35, baseType: !266, size: 64, offset: 32768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !341, file: !340, line: 38, baseType: !255, size: 64, offset: 32832)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !341, file: !340, line: 39, baseType: !255, size: 64, offset: 32896)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLTreeInfo", file: !352, line: 29, baseType: !353)
!352 = !DIFile(filename: "apps/538.imagick_r/src/magick/xml-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e544995a74b1ca30ba5edadca4a5927")
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XMLTreeInfo", file: !352, line: 28, flags: DIFlagFwdDecl)
!354 = !{!355, !0, !357}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "MimeMap", scope: !2, file: !237, line: 112, type: !331, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "mime_semaphore", scope: !2, file: !237, line: 121, type: !333, isLocal: true, isDefinition: true)
!359 = !{i32 7, !"Dwarf Version", i32 5}
!360 = !{i32 2, !"Debug Info Version", i32 3}
!361 = !{i32 1, !"wchar_size", i32 4}
!362 = !{i32 7, !"PIC Level", i32 2}
!363 = !{i32 7, !"PIE Level", i32 2}
!364 = !{i32 7, !"uwtable", i32 2}
!365 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!366 = distinct !DISubprogram(name: "LoadMimeLists", scope: !237, file: !237, line: 194, type: !367, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !382)
!367 = !DISubroutineType(types: !368)
!368 = !{!269, !331, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !12, line: 102, size: 448, elements: !372)
!372 = !{!373, !375, !376, !377, !378, !379, !380, !381}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !371, file: !12, line: 105, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !12, line: 100, baseType: !11)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !371, file: !12, line: 108, baseType: !137, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !371, file: !12, line: 111, baseType: !240, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !371, file: !12, line: 112, baseType: !240, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !371, file: !12, line: 115, baseType: !231, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !371, file: !12, line: 118, baseType: !269, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !371, file: !12, line: 121, baseType: !333, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !371, file: !12, line: 124, baseType: !255, size: 64, offset: 384)
!382 = !{!383, !384}
!383 = !DILocalVariable(name: "name", arg: 1, scope: !366, file: !237, line: 194, type: !331)
!384 = !DILocalVariable(name: "exception", arg: 2, scope: !366, file: !237, line: 195, type: !369)
!385 = !DILocation(line: 0, scope: !366)
!386 = !DILocation(line: 197, column: 14, scope: !366)
!387 = !DILocation(line: 197, column: 13, scope: !366)
!388 = !{!389, !389, i64 0}
!389 = !{!"any pointer", !390, i64 0}
!390 = !{!"omnipotent char", !391, i64 0}
!391 = !{!"Simple C/C++ TBAA"}
!392 = !DILocation(line: 198, column: 21, scope: !366)
!393 = !DILocation(line: 198, column: 3, scope: !366)
!394 = distinct !DISubprogram(name: "AcquireMimeCache", scope: !237, file: !237, line: 157, type: !395, scopeLine: 159, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!227, !331, !369}
!397 = !{!398, !399, !400, !401, !403, !406, !407, !409}
!398 = !DILocalVariable(name: "filename", arg: 1, scope: !394, file: !237, line: 157, type: !331)
!399 = !DILocalVariable(name: "exception", arg: 2, scope: !394, file: !237, line: 158, type: !369)
!400 = !DILocalVariable(name: "mime_cache", scope: !394, file: !237, line: 161, type: !227)
!401 = !DILocalVariable(name: "status", scope: !394, file: !237, line: 164, type: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !6, line: 147, baseType: !7)
!403 = !DILocalVariable(name: "message", scope: !404, file: !237, line: 168, type: !240)
!404 = distinct !DILexicalBlock(scope: !405, file: !237, line: 168, column: 5)
!405 = distinct !DILexicalBlock(scope: !394, file: !237, line: 167, column: 7)
!406 = !DILocalVariable(name: "exception", scope: !404, file: !237, line: 168, type: !370)
!407 = !DILocalVariable(name: "option", scope: !408, file: !237, line: 173, type: !337)
!408 = distinct !DILexicalBlock(scope: !394, file: !237, line: 171, column: 3)
!409 = !DILocalVariable(name: "options", scope: !408, file: !237, line: 176, type: !227)
!410 = !DILocation(line: 0, scope: !394)
!411 = !DILocation(line: 166, column: 14, scope: !394)
!412 = !DILocation(line: 167, column: 18, scope: !405)
!413 = !DILocation(line: 167, column: 7, scope: !394)
!414 = !DILocation(line: 168, column: 5, scope: !404)
!415 = !{!416, !416, i64 0}
!416 = !{!"int", !390, i64 0}
!417 = !DILocation(line: 0, scope: !404)
!418 = !DILocation(line: 178, column: 13, scope: !408)
!419 = !DILocation(line: 0, scope: !408)
!420 = !DILocation(line: 179, column: 33, scope: !408)
!421 = !DILocation(line: 180, column: 19, scope: !408)
!422 = !DILocation(line: 180, column: 5, scope: !408)
!423 = !DILocation(line: 183, column: 9, scope: !424)
!424 = distinct !DILexicalBlock(scope: !408, file: !237, line: 181, column: 5)
!425 = !DILocation(line: 183, column: 36, scope: !424)
!426 = !DILocation(line: 182, column: 15, scope: !424)
!427 = !DILocation(line: 184, column: 35, scope: !424)
!428 = distinct !{!428, !422, !429, !430, !431}
!429 = !DILocation(line: 185, column: 5, scope: !408)
!430 = !{!"llvm.loop.mustprogress"}
!431 = !{!"llvm.loop.unroll.disable"}
!432 = !DILocation(line: 186, column: 13, scope: !408)
!433 = !DILocation(line: 189, column: 7, scope: !434)
!434 = distinct !DILexicalBlock(scope: !394, file: !237, line: 189, column: 7)
!435 = !DILocation(line: 189, column: 37, scope: !434)
!436 = !DILocation(line: 189, column: 7, scope: !394)
!437 = !DILocation(line: 190, column: 13, scope: !434)
!438 = !DILocation(line: 190, column: 5, scope: !434)
!439 = !DILocation(line: 191, column: 3, scope: !394)
!440 = distinct !DISubprogram(name: "GetMimeInfo", scope: !237, file: !237, line: 234, type: !441, scopeLine: 236, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !444)
