; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/module.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!352 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!354 = !DIEnumerator(name: "OptimizeType", value: 10)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 39, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "apps/538.imagick_r/src/magick/policy.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "6242d97ee47d0d7f0e3878e07f1ce5b1")
!370 = !{!371, !372, !373, !374, !375}
!371 = !DIEnumerator(name: "UndefinedPolicyRights", value: 0)
!372 = !DIEnumerator(name: "NoPolicyRights", value: 0)
!373 = !DIEnumerator(name: "ReadPolicyRights", value: 1)
!374 = !DIEnumerator(name: "WritePolicyRights", value: 2)
!375 = !DIEnumerator(name: "ExecutePolicyRights", value: 4)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !377, line: 34, baseType: !5, size: 32, elements: !378)
!377 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!379 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!380 = !DIEnumerator(name: "NoEvents", value: 0)
!381 = !DIEnumerator(name: "TraceEvent", value: 1)
!382 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!383 = !DIEnumerator(name: "BlobEvent", value: 4)
!384 = !DIEnumerator(name: "CacheEvent", value: 8)
!385 = !DIEnumerator(name: "CoderEvent", value: 16)
!386 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!387 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!388 = !DIEnumerator(name: "DrawEvent", value: 128)
!389 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!390 = !DIEnumerator(name: "ImageEvent", value: 512)
!391 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!392 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!393 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!394 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!395 = !DIEnumerator(name: "TransformEvent", value: 16384)
!396 = !DIEnumerator(name: "UserEvent", value: 36864)
!397 = !DIEnumerator(name: "WandEvent", value: 65536)
!398 = !DIEnumerator(name: "X11Event", value: 131072)
!399 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!400 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 28, baseType: !5, size: 32, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409}
!403 = !DIEnumerator(name: "UndefinedPolicyDomain", value: 0)
!404 = !DIEnumerator(name: "CoderPolicyDomain", value: 1)
!405 = !DIEnumerator(name: "DelegatePolicyDomain", value: 2)
!406 = !DIEnumerator(name: "FilterPolicyDomain", value: 3)
!407 = !DIEnumerator(name: "PathPolicyDomain", value: 4)
!408 = !DIEnumerator(name: "ResourcePolicyDomain", value: 5)
!409 = !DIEnumerator(name: "SystemPolicyDomain", value: 6)
!410 = !{!411, !412, !473, !417}
!411 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageFilterHandler", file: !414, line: 67, baseType: !415)
!414 = !DIFile(filename: "apps/538.imagick_r/src/magick/module.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bdec26acbe0c4d083452859cca3e7b82")
!415 = !DISubroutineType(types: !416)
!416 = !{!417, !419, !639, !640, !641}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !418, line: 46, baseType: !411)
!418 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !150, line: 150, size: 105920, elements: !423)
!423 = !{!424, !426, !428, !430, !431, !433, !435, !436, !437, !438, !439, !440, !451, !452, !453, !454, !456, !470, !472, !474, !476, !479, !480, !481, !487, !488, !489, !497, !498, !499, !500, !501, !502, !504, !506, !508, !510, !512, !514, !516, !517, !518, !519, !520, !521, !522, !530, !545, !559, !560, !561, !562, !566, !570, !574, !575, !576, !577, !578, !596, !597, !599, !600, !610, !611, !613, !614, !615, !616, !617, !618, !620, !621, !622, !623, !624, !625, !626, !628, !629, !630, !631, !632, !636, !638}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !422, file: !150, line: 153, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !82)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !422, file: !150, line: 156, baseType: !427, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !88, line: 61, baseType: !87)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !422, file: !150, line: 159, baseType: !429, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !125, line: 49, baseType: !124)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !422, file: !150, line: 162, baseType: !417, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !422, file: !150, line: 165, baseType: !432, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !150, line: 86, baseType: !149)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !422, file: !150, line: 168, baseType: !434, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !422, file: !150, line: 169, baseType: !434, size: 32, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !422, file: !150, line: 172, baseType: !417, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !422, file: !150, line: 173, baseType: !417, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !422, file: !150, line: 174, baseType: !417, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !422, file: !150, line: 175, baseType: !417, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !422, file: !150, line: 178, baseType: !441, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !444)
!444 = !{!445, !448, !449, !450}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !443, file: !326, line: 143, baseType: !446, size: 16)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !447)
!447 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !443, file: !326, line: 144, baseType: !446, size: 16, offset: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !443, file: !326, line: 145, baseType: !446, size: 16, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !443, file: !326, line: 146, baseType: !446, size: 16, offset: 48)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !422, file: !150, line: 179, baseType: !442, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !422, file: !150, line: 180, baseType: !442, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !422, file: !150, line: 181, baseType: !442, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !422, file: !150, line: 184, baseType: !455, size: 64, offset: 832)
!455 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !422, file: !150, line: 187, baseType: !457, size: 768, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !150, line: 128, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !150, line: 121, size: 768, elements: !459)
!459 = !{!460, !467, !468, !469}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !458, file: !150, line: 124, baseType: !461, size: 192)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !150, line: 101, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !150, line: 95, size: 192, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !462, file: !150, line: 98, baseType: !455, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !462, file: !150, line: 99, baseType: !455, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !462, file: !150, line: 100, baseType: !455, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !458, file: !150, line: 125, baseType: !461, size: 192, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !458, file: !150, line: 126, baseType: !461, size: 192, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !458, file: !150, line: 127, baseType: !461, size: 192, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !422, file: !150, line: 190, baseType: !471, size: 32, offset: 1664)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !162, line: 49, baseType: !161)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !422, file: !150, line: 193, baseType: !473, size: 64, offset: 1728)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !422, file: !150, line: 196, baseType: !475, size: 32, offset: 1792)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !150, line: 93, baseType: !169)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !422, file: !150, line: 199, baseType: !477, size: 64, offset: 1856)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !422, file: !150, line: 200, baseType: !477, size: 64, offset: 1920)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !422, file: !150, line: 201, baseType: !477, size: 64, offset: 1984)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !422, file: !150, line: 204, baseType: !482, size: 64, offset: 2048)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !483, line: 77, baseType: !484)
!483 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !485, line: 193, baseType: !486)
!485 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!486 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !422, file: !150, line: 207, baseType: !455, size: 64, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !422, file: !150, line: 208, baseType: !455, size: 64, offset: 2176)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !422, file: !150, line: 211, baseType: !490, size: 256, offset: 2240)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !226, line: 130, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !226, line: 121, size: 256, elements: !492)
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !491, file: !226, line: 124, baseType: !417, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !491, file: !226, line: 125, baseType: !417, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !491, file: !226, line: 128, baseType: !482, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !491, file: !226, line: 129, baseType: !482, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !422, file: !150, line: 212, baseType: !490, size: 256, offset: 2496)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !422, file: !150, line: 213, baseType: !490, size: 256, offset: 2752)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !422, file: !150, line: 216, baseType: !455, size: 64, offset: 3008)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !422, file: !150, line: 217, baseType: !455, size: 64, offset: 3072)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !422, file: !150, line: 218, baseType: !455, size: 64, offset: 3136)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !422, file: !150, line: 221, baseType: !503, size: 32, offset: 3200)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !175, line: 66, baseType: !174)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !422, file: !150, line: 224, baseType: !505, size: 32, offset: 3232)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !150, line: 73, baseType: !209)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !422, file: !150, line: 227, baseType: !507, size: 32, offset: 3264)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !220, line: 35, baseType: !219)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !422, file: !150, line: 230, baseType: !509, size: 32, offset: 3296)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !226, line: 91, baseType: !225)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !422, file: !150, line: 233, baseType: !511, size: 32, offset: 3328)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !241, line: 99, baseType: !240)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !422, file: !150, line: 236, baseType: !513, size: 32, offset: 3360)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !312, line: 32, baseType: !311)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !422, file: !150, line: 239, baseType: !515, size: 64, offset: 3392)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !422, file: !150, line: 242, baseType: !417, size: 64, offset: 3456)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !422, file: !150, line: 243, baseType: !417, size: 64, offset: 3520)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !422, file: !150, line: 246, baseType: !482, size: 64, offset: 3584)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !422, file: !150, line: 249, baseType: !417, size: 64, offset: 3648)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !422, file: !150, line: 250, baseType: !417, size: 64, offset: 3712)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !422, file: !150, line: 253, baseType: !482, size: 64, offset: 3776)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !422, file: !150, line: 256, baseType: !523, size: 192, offset: 3840)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !524, line: 68, baseType: !525)
!524 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !524, line: 62, size: 192, elements: !526)
!526 = !{!527, !528, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !525, file: !524, line: 65, baseType: !455, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !525, file: !524, line: 66, baseType: !455, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !525, file: !524, line: 67, baseType: !455, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !422, file: !150, line: 259, baseType: !531, size: 512, offset: 4032)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !320, line: 51, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !320, line: 40, size: 512, elements: !533)
!533 = !{!534, !541, !542, !544}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !532, file: !320, line: 43, baseType: !535, size: 192)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !320, line: 38, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !320, line: 32, size: 192, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !536, file: !320, line: 35, baseType: !455, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !536, file: !320, line: 36, baseType: !455, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !536, file: !320, line: 37, baseType: !455, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !532, file: !320, line: 44, baseType: !535, size: 192, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !532, file: !320, line: 47, baseType: !543, size: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !320, line: 30, baseType: !319)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !532, file: !320, line: 50, baseType: !417, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !422, file: !150, line: 262, baseType: !546, size: 64, offset: 4544)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !547, line: 26, baseType: !548)
!547 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!434, !551, !553, !556, !473}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !555)
!555 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !558)
!558 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !422, file: !150, line: 265, baseType: !473, size: 64, offset: 4608)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !422, file: !150, line: 266, baseType: !473, size: 64, offset: 4672)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !422, file: !150, line: 267, baseType: !473, size: 64, offset: 4736)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !422, file: !150, line: 270, baseType: !563, size: 64, offset: 4800)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !125, line: 52, baseType: !565)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !125, line: 51, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !422, file: !150, line: 273, baseType: !567, size: 64, offset: 4864)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !569)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !422, file: !150, line: 276, baseType: !571, size: 32768, offset: 4928)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 32768, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 4096)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !422, file: !150, line: 277, baseType: !571, size: 32768, offset: 37696)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !422, file: !150, line: 278, baseType: !571, size: 32768, offset: 70464)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !422, file: !150, line: 281, baseType: !417, size: 64, offset: 103232)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !422, file: !150, line: 282, baseType: !417, size: 64, offset: 103296)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !422, file: !150, line: 285, baseType: !579, size: 448, offset: 103360)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !10, line: 102, size: 448, elements: !581)
!581 = !{!582, !584, !586, !587, !588, !589, !590, !595}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !580, file: !10, line: 105, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !10, line: 100, baseType: !9)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !580, file: !10, line: 108, baseType: !585, size: 32, offset: 32)
!585 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !580, file: !10, line: 111, baseType: !477, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !580, file: !10, line: 112, baseType: !477, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !580, file: !10, line: 115, baseType: !473, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !580, file: !10, line: 118, baseType: !434, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !580, file: !10, line: 121, baseType: !591, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !593, line: 26, baseType: !594)
!593 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !593, line: 25, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !580, file: !10, line: 124, baseType: !417, size: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !422, file: !150, line: 288, baseType: !434, size: 32, offset: 103808)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !422, file: !150, line: 291, baseType: !598, size: 64, offset: 103872)
!598 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !482)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !422, file: !150, line: 294, baseType: !591, size: 64, offset: 103936)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !422, file: !150, line: 297, baseType: !601, size: 256, offset: 104000)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !162, line: 40, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !162, line: 27, size: 256, elements: !603)
!603 = !{!604, !605, !606, !609}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !162, line: 30, baseType: !477, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !602, file: !162, line: 33, baseType: !417, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !602, file: !162, line: 36, baseType: !607, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !602, file: !162, line: 39, baseType: !417, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !422, file: !150, line: 298, baseType: !601, size: 256, offset: 104256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !422, file: !150, line: 299, baseType: !612, size: 64, offset: 104512)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !422, file: !150, line: 302, baseType: !417, size: 64, offset: 104576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !422, file: !150, line: 305, baseType: !417, size: 64, offset: 104640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !422, file: !150, line: 308, baseType: !515, size: 64, offset: 104704)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !422, file: !150, line: 309, baseType: !515, size: 64, offset: 104768)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !150, line: 310, baseType: !515, size: 64, offset: 104832)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !422, file: !150, line: 313, baseType: !619, size: 32, offset: 104896)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !422, file: !150, line: 316, baseType: !434, size: 32, offset: 104928)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !422, file: !150, line: 319, baseType: !442, size: 64, offset: 104960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !422, file: !150, line: 322, baseType: !515, size: 64, offset: 105024)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !422, file: !150, line: 325, baseType: !490, size: 256, offset: 105088)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !422, file: !150, line: 328, baseType: !473, size: 64, offset: 105344)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !422, file: !150, line: 329, baseType: !473, size: 64, offset: 105408)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !422, file: !150, line: 332, baseType: !627, size: 32, offset: 105472)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !150, line: 61, baseType: !342)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !422, file: !150, line: 335, baseType: !434, size: 32, offset: 105504)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !422, file: !150, line: 338, baseType: !557, size: 64, offset: 105536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !422, file: !150, line: 341, baseType: !434, size: 32, offset: 105600)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !422, file: !150, line: 344, baseType: !417, size: 64, offset: 105664)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !422, file: !150, line: 347, baseType: !633, size: 64, offset: 105728)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !634, line: 7, baseType: !635)
!634 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !485, line: 160, baseType: !486)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !422, file: !150, line: 350, baseType: !637, size: 32, offset: 105792)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !422, file: !150, line: 353, baseType: !417, size: 64, offset: 105856)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!642 = !{i32 7, !"Dwarf Version", i32 5}
!643 = !{i32 2, !"Debug Info Version", i32 3}
!644 = !{i32 1, !"wchar_size", i32 4}
!645 = !{i32 7, !"PIC Level", i32 2}
!646 = !{i32 7, !"PIE Level", i32 2}
!647 = !{i32 7, !"uwtable", i32 2}
!648 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!649 = distinct !DISubprogram(name: "ListModuleInfo", scope: !650, file: !650, line: 1622, type: !651, scopeLine: 1624, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !706)
!650 = !DIFile(filename: "apps/538.imagick_r/src/magick/module.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "072c0abdbc11ef889512beff36bac3fc")
!651 = !DISubroutineType(types: !652)
!652 = !{!434, !653, !641}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !655, line: 7, baseType: !656)
!655 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !657, line: 49, size: 1728, elements: !658)
!657 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !674, !676, !677, !678, !680, !681, !683, !687, !690, !692, !695, !698, !699, !700, !701, !702}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !656, file: !657, line: 51, baseType: !585, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !656, file: !657, line: 54, baseType: !477, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !656, file: !657, line: 55, baseType: !477, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !656, file: !657, line: 56, baseType: !477, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !656, file: !657, line: 57, baseType: !477, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !656, file: !657, line: 58, baseType: !477, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !656, file: !657, line: 59, baseType: !477, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !656, file: !657, line: 60, baseType: !477, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !656, file: !657, line: 61, baseType: !477, size: 64, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !656, file: !657, line: 64, baseType: !477, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !656, file: !657, line: 65, baseType: !477, size: 64, offset: 640)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !656, file: !657, line: 66, baseType: !477, size: 64, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !656, file: !657, line: 68, baseType: !672, size: 64, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !657, line: 36, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !656, file: !657, line: 70, baseType: !675, size: 64, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !656, file: !657, line: 72, baseType: !585, size: 32, offset: 896)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !656, file: !657, line: 73, baseType: !585, size: 32, offset: 928)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !656, file: !657, line: 74, baseType: !679, size: 64, offset: 960)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !485, line: 152, baseType: !486)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !656, file: !657, line: 77, baseType: !447, size: 16, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !656, file: !657, line: 78, baseType: !682, size: 8, offset: 1040)
!682 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !656, file: !657, line: 79, baseType: !684, size: 8, offset: 1048)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 8, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 1)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !656, file: !657, line: 81, baseType: !688, size: 64, offset: 1088)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !657, line: 43, baseType: null)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !656, file: !657, line: 89, baseType: !691, size: 64, offset: 1152)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !485, line: 153, baseType: !486)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !656, file: !657, line: 91, baseType: !693, size: 64, offset: 1216)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !657, line: 37, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !656, file: !657, line: 92, baseType: !696, size: 64, offset: 1280)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !657, line: 38, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !656, file: !657, line: 93, baseType: !675, size: 64, offset: 1344)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !656, file: !657, line: 94, baseType: !473, size: 64, offset: 1408)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !656, file: !657, line: 95, baseType: !417, size: 64, offset: 1472)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !656, file: !657, line: 96, baseType: !585, size: 32, offset: 1536)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !656, file: !657, line: 98, baseType: !703, size: 160, offset: 1568)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 160, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 20)
!706 = !{!707, !708}
!707 = !DILocalVariable(name: "file", arg: 1, scope: !649, file: !650, line: 1622, type: !653)
!708 = !DILocalVariable(name: "exception", arg: 2, scope: !649, file: !650, line: 1623, type: !641)
!709 = !DILocation(line: 0, scope: !649)
!710 = !DILocation(line: 1627, column: 3, scope: !649)
!711 = distinct !DISubprogram(name: "InvokeDynamicImageFilter", scope: !650, file: !650, line: 1630, type: !712, scopeLine: 1632, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !714)
!712 = !DISubroutineType(types: !713)
!713 = !{!434, !551, !419, !639, !640, !641}
!714 = !{!715, !716, !717, !718, !719, !720, !722, !724}
!715 = !DILocalVariable(name: "tag", arg: 1, scope: !711, file: !650, line: 1630, type: !551)
!716 = !DILocalVariable(name: "image", arg: 2, scope: !711, file: !650, line: 1631, type: !419)
!717 = !DILocalVariable(name: "argc", arg: 3, scope: !711, file: !650, line: 1631, type: !639)
!718 = !DILocalVariable(name: "argv", arg: 4, scope: !711, file: !650, line: 1631, type: !640)
!719 = !DILocalVariable(name: "exception", arg: 5, scope: !711, file: !650, line: 1631, type: !641)
!720 = !DILocalVariable(name: "rights", scope: !711, file: !650, line: 1634, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyRights", file: !369, line: 46, baseType: !368)
!722 = !DILocalVariable(name: "image_filter", scope: !723, file: !650, line: 1656, type: !412)
!723 = distinct !DILexicalBlock(scope: !711, file: !650, line: 1654, column: 3)
!724 = !DILocalVariable(name: "signature", scope: !725, file: !650, line: 1667, type: !417)
!725 = distinct !DILexicalBlock(scope: !726, file: !650, line: 1665, column: 7)
!726 = distinct !DILexicalBlock(scope: !723, file: !650, line: 1661, column: 9)
!727 = !DILocation(line: 0, scope: !711)
!728 = !DILocation(line: 1638, column: 8, scope: !729)
!729 = distinct !DILexicalBlock(scope: !711, file: !650, line: 1638, column: 7)
!730 = !{!731, !731, i64 0}
!731 = !{!"any pointer", !732, i64 0}
!732 = !{!"omnipotent char", !733, i64 0}
!733 = !{!"Simple C/C++ TBAA"}
!734 = !DILocation(line: 1638, column: 17, scope: !729)
!735 = !{!736, !732, i64 12976}
!736 = !{!"_Image", !732, i64 0, !732, i64 4, !732, i64 8, !737, i64 16, !732, i64 24, !732, i64 28, !732, i64 32, !737, i64 40, !737, i64 48, !737, i64 56, !737, i64 64, !731, i64 72, !738, i64 80, !738, i64 88, !738, i64 96, !740, i64 104, !741, i64 112, !732, i64 208, !731, i64 216, !732, i64 224, !731, i64 232, !731, i64 240, !731, i64 248, !737, i64 256, !740, i64 264, !740, i64 272, !743, i64 280, !743, i64 312, !743, i64 344, !740, i64 376, !740, i64 384, !740, i64 392, !732, i64 400, !732, i64 404, !732, i64 408, !732, i64 412, !732, i64 416, !732, i64 420, !731, i64 424, !737, i64 432, !737, i64 440, !737, i64 448, !737, i64 456, !737, i64 464, !737, i64 472, !744, i64 480, !745, i64 504, !731, i64 568, !731, i64 576, !731, i64 584, !731, i64 592, !731, i64 600, !731, i64 608, !732, i64 616, !732, i64 4712, !732, i64 8808, !737, i64 12904, !737, i64 12912, !747, i64 12920, !732, i64 12976, !737, i64 12984, !731, i64 12992, !749, i64 13000, !749, i64 13032, !731, i64 13064, !737, i64 13072, !737, i64 13080, !731, i64 13088, !731, i64 13096, !731, i64 13104, !732, i64 13112, !732, i64 13116, !738, i64 13120, !731, i64 13128, !743, i64 13136, !731, i64 13168, !731, i64 13176, !732, i64 13184, !732, i64 13188, !750, i64 13192, !732, i64 13200, !737, i64 13208, !737, i64 13216, !732, i64 13224, !737, i64 13232}
!737 = !{!"long", !732, i64 0}
!738 = !{!"_PixelPacket", !739, i64 0, !739, i64 2, !739, i64 4, !739, i64 6}
!739 = !{!"short", !732, i64 0}
!740 = !{!"double", !732, i64 0}
