; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/monitor.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/monitor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!403 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!404 = !DIEnumerator(name: "RedChannel", value: 1)
!405 = !DIEnumerator(name: "GrayChannel", value: 1)
!406 = !DIEnumerator(name: "CyanChannel", value: 1)
!407 = !DIEnumerator(name: "GreenChannel", value: 2)
!408 = !DIEnumerator(name: "MagentaChannel", value: 2)
!409 = !DIEnumerator(name: "BlueChannel", value: 4)
!410 = !DIEnumerator(name: "YellowChannel", value: 4)
!411 = !DIEnumerator(name: "AlphaChannel", value: 8)
!412 = !DIEnumerator(name: "OpacityChannel", value: 8)
!413 = !DIEnumerator(name: "MatteChannel", value: 8)
!414 = !DIEnumerator(name: "BlackChannel", value: 32)
!415 = !DIEnumerator(name: "IndexChannel", value: 32)
!416 = !DIEnumerator(name: "CompositeChannels", value: 47)
!417 = !DIEnumerator(name: "AllChannels", value: 134217727)
!418 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!419 = !DIEnumerator(name: "RGBChannels", value: 128)
!420 = !DIEnumerator(name: "GrayChannels", value: 128)
!421 = !DIEnumerator(name: "SyncChannels", value: 256)
!422 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 27, baseType: !5, size: 32, elements: !425)
!424 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!426 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!427 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!428 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!429 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!430 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!431 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!432 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!433 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!434 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!435 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!436 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!437 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!438 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!439 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!440 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!441 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!442 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!443 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!444 = !{i32 7, !"Dwarf Version", i32 5}
!445 = !{i32 2, !"Debug Info Version", i32 3}
!446 = !{i32 1, !"wchar_size", i32 4}
!447 = !{i32 7, !"PIC Level", i32 2}
!448 = !{i32 7, !"PIE Level", i32 2}
!449 = !{i32 7, !"uwtable", i32 2}
!450 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!451 = distinct !DISubprogram(name: "SetImageProgressMonitor", scope: !452, file: !452, line: 85, type: !453, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !678)
!452 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d93c92495ddbc74ac2bb3360684e52e4")
!453 = !DISubroutineType(types: !454)
!454 = !{!455, !471, !677, !470}
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !456, line: 26, baseType: !457)
!456 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !461, !464, !467, !470}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !466)
!466 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !469)
!469 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !474)
!474 = !{!475, !477, !479, !481, !485, !487, !488, !489, !490, !491, !492, !493, !504, !505, !506, !507, !509, !523, !525, !526, !528, !530, !531, !532, !538, !539, !540, !548, !549, !550, !551, !552, !553, !555, !557, !559, !561, !563, !565, !567, !568, !569, !570, !571, !572, !573, !581, !596, !597, !598, !599, !600, !604, !608, !612, !613, !614, !615, !616, !634, !635, !637, !638, !648, !649, !651, !652, !653, !654, !655, !656, !658, !659, !660, !661, !662, !663, !664, !666, !667, !668, !669, !670, !674, !676}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !473, file: !77, line: 153, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !473, file: !77, line: 156, baseType: !478, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !473, file: !77, line: 159, baseType: !480, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !473, file: !77, line: 162, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !483, line: 46, baseType: !484)
!483 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!484 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !473, file: !77, line: 165, baseType: !486, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !473, file: !77, line: 168, baseType: !460, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !473, file: !77, line: 169, baseType: !460, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !473, file: !77, line: 172, baseType: !482, size: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !473, file: !77, line: 173, baseType: !482, size: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !473, file: !77, line: 174, baseType: !482, size: 64, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !473, file: !77, line: 175, baseType: !482, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !473, file: !77, line: 178, baseType: !494, size: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !497)
!497 = !{!498, !501, !502, !503}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !496, file: !326, line: 143, baseType: !499, size: 16)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !500)
!500 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !496, file: !326, line: 144, baseType: !499, size: 16, offset: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !496, file: !326, line: 145, baseType: !499, size: 16, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !496, file: !326, line: 146, baseType: !499, size: 16, offset: 48)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !473, file: !77, line: 179, baseType: !495, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !473, file: !77, line: 180, baseType: !495, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !473, file: !77, line: 181, baseType: !495, size: 64, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !473, file: !77, line: 184, baseType: !508, size: 64, offset: 832)
!508 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !473, file: !77, line: 187, baseType: !510, size: 768, offset: 896)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !512)
!512 = !{!513, !520, !521, !522}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !511, file: !77, line: 124, baseType: !514, size: 192)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !515, file: !77, line: 98, baseType: !508, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !515, file: !77, line: 99, baseType: !508, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !515, file: !77, line: 100, baseType: !508, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !511, file: !77, line: 125, baseType: !514, size: 192, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !511, file: !77, line: 126, baseType: !514, size: 192, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !511, file: !77, line: 127, baseType: !514, size: 192, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !473, file: !77, line: 190, baseType: !524, size: 32, offset: 1664)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !473, file: !77, line: 193, baseType: !470, size: 64, offset: 1728)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !473, file: !77, line: 196, baseType: !527, size: 32, offset: 1792)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !473, file: !77, line: 199, baseType: !529, size: 64, offset: 1856)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !473, file: !77, line: 200, baseType: !529, size: 64, offset: 1920)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !473, file: !77, line: 201, baseType: !529, size: 64, offset: 1984)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !473, file: !77, line: 204, baseType: !533, size: 64, offset: 2048)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !534, line: 77, baseType: !535)
!534 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !536, line: 193, baseType: !537)
!536 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!537 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !473, file: !77, line: 207, baseType: !508, size: 64, offset: 2112)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !473, file: !77, line: 208, baseType: !508, size: 64, offset: 2176)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !473, file: !77, line: 211, baseType: !541, size: 256, offset: 2240)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !543)
!543 = !{!544, !545, !546, !547}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !542, file: !153, line: 124, baseType: !482, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !542, file: !153, line: 125, baseType: !482, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !542, file: !153, line: 128, baseType: !533, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !542, file: !153, line: 129, baseType: !533, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !473, file: !77, line: 212, baseType: !541, size: 256, offset: 2496)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !473, file: !77, line: 213, baseType: !541, size: 256, offset: 2752)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !473, file: !77, line: 216, baseType: !508, size: 64, offset: 3008)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !473, file: !77, line: 217, baseType: !508, size: 64, offset: 3072)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !473, file: !77, line: 218, baseType: !508, size: 64, offset: 3136)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !473, file: !77, line: 221, baseType: !554, size: 32, offset: 3200)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !473, file: !77, line: 224, baseType: !556, size: 32, offset: 3232)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !473, file: !77, line: 227, baseType: !558, size: 32, offset: 3264)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !473, file: !77, line: 230, baseType: !560, size: 32, offset: 3296)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !473, file: !77, line: 233, baseType: !562, size: 32, offset: 3328)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !473, file: !77, line: 236, baseType: !564, size: 32, offset: 3360)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !473, file: !77, line: 239, baseType: !566, size: 64, offset: 3392)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !473, file: !77, line: 242, baseType: !482, size: 64, offset: 3456)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !473, file: !77, line: 243, baseType: !482, size: 64, offset: 3520)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !473, file: !77, line: 246, baseType: !533, size: 64, offset: 3584)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !473, file: !77, line: 249, baseType: !482, size: 64, offset: 3648)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !473, file: !77, line: 250, baseType: !482, size: 64, offset: 3712)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !473, file: !77, line: 253, baseType: !533, size: 64, offset: 3776)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !473, file: !77, line: 256, baseType: !574, size: 192, offset: 3840)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !575, line: 68, baseType: !576)
!575 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !575, line: 62, size: 192, elements: !577)
!577 = !{!578, !579, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !576, file: !575, line: 65, baseType: !508, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !576, file: !575, line: 66, baseType: !508, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !576, file: !575, line: 67, baseType: !508, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !473, file: !77, line: 259, baseType: !582, size: 512, offset: 4032)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !584)
!584 = !{!585, !592, !593, !595}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !583, file: !247, line: 43, baseType: !586, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !587, file: !247, line: 35, baseType: !508, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !587, file: !247, line: 36, baseType: !508, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !587, file: !247, line: 37, baseType: !508, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !583, file: !247, line: 44, baseType: !586, size: 192, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !583, file: !247, line: 47, baseType: !594, size: 32, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !583, file: !247, line: 50, baseType: !482, size: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !473, file: !77, line: 262, baseType: !455, size: 64, offset: 4544)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !473, file: !77, line: 265, baseType: !470, size: 64, offset: 4608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !473, file: !77, line: 266, baseType: !470, size: 64, offset: 4672)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !473, file: !77, line: 267, baseType: !470, size: 64, offset: 4736)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !473, file: !77, line: 270, baseType: !601, size: 64, offset: 4800)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !603)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !473, file: !77, line: 273, baseType: !605, size: 64, offset: 4864)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !607)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !473, file: !77, line: 276, baseType: !609, size: 32768, offset: 4928)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 32768, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 4096)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !473, file: !77, line: 277, baseType: !609, size: 32768, offset: 37696)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !473, file: !77, line: 278, baseType: !609, size: 32768, offset: 70464)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !473, file: !77, line: 281, baseType: !482, size: 64, offset: 103232)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !473, file: !77, line: 282, baseType: !482, size: 64, offset: 103296)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !473, file: !77, line: 285, baseType: !617, size: 448, offset: 103360)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !619)
!619 = !{!620, !622, !624, !625, !626, !627, !628, !633}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !618, file: !253, line: 105, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !618, file: !253, line: 108, baseType: !623, size: 32, offset: 32)
!623 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !618, file: !253, line: 111, baseType: !529, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !618, file: !253, line: 112, baseType: !529, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !618, file: !253, line: 115, baseType: !470, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !618, file: !253, line: 118, baseType: !460, size: 32, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !618, file: !253, line: 121, baseType: !629, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !631, line: 26, baseType: !632)
!631 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !631, line: 25, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !618, file: !253, line: 124, baseType: !482, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !473, file: !77, line: 288, baseType: !460, size: 32, offset: 103808)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !473, file: !77, line: 291, baseType: !636, size: 64, offset: 103872)
!636 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !533)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !473, file: !77, line: 294, baseType: !629, size: 64, offset: 103936)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !473, file: !77, line: 297, baseType: !639, size: 256, offset: 104000)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !641)
!641 = !{!642, !643, !644, !647}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !640, file: !89, line: 30, baseType: !529, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !640, file: !89, line: 33, baseType: !482, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !640, file: !89, line: 36, baseType: !645, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !640, file: !89, line: 39, baseType: !482, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !473, file: !77, line: 298, baseType: !639, size: 256, offset: 104256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !473, file: !77, line: 299, baseType: !650, size: 64, offset: 104512)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !473, file: !77, line: 302, baseType: !482, size: 64, offset: 104576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !473, file: !77, line: 305, baseType: !482, size: 64, offset: 104640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !473, file: !77, line: 308, baseType: !566, size: 64, offset: 104704)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !473, file: !77, line: 309, baseType: !566, size: 64, offset: 104768)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !473, file: !77, line: 310, baseType: !566, size: 64, offset: 104832)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !473, file: !77, line: 313, baseType: !657, size: 32, offset: 104896)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !473, file: !77, line: 316, baseType: !460, size: 32, offset: 104928)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !473, file: !77, line: 319, baseType: !495, size: 64, offset: 104960)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !473, file: !77, line: 322, baseType: !566, size: 64, offset: 105024)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !473, file: !77, line: 325, baseType: !541, size: 256, offset: 105088)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !473, file: !77, line: 328, baseType: !470, size: 64, offset: 105344)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !473, file: !77, line: 329, baseType: !470, size: 64, offset: 105408)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !473, file: !77, line: 332, baseType: !665, size: 32, offset: 105472)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !473, file: !77, line: 335, baseType: !460, size: 32, offset: 105504)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !473, file: !77, line: 338, baseType: !468, size: 64, offset: 105536)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !473, file: !77, line: 341, baseType: !460, size: 32, offset: 105600)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !473, file: !77, line: 344, baseType: !482, size: 64, offset: 105664)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !473, file: !77, line: 347, baseType: !671, size: 64, offset: 105728)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !672, line: 7, baseType: !673)
!672 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !536, line: 160, baseType: !537)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !473, file: !77, line: 350, baseType: !675, size: 32, offset: 105792)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !473, file: !77, line: 353, baseType: !482, size: 64, offset: 105856)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!678 = !{!679, !680, !681, !682}
!679 = !DILocalVariable(name: "image", arg: 1, scope: !451, file: !452, line: 85, type: !471)
!680 = !DILocalVariable(name: "progress_monitor", arg: 2, scope: !451, file: !452, line: 86, type: !677)
!681 = !DILocalVariable(name: "client_data", arg: 3, scope: !451, file: !452, line: 86, type: !470)
!682 = !DILocalVariable(name: "previous_monitor", scope: !451, file: !452, line: 89, type: !455)
!683 = !DILocation(line: 0, scope: !451)
!684 = !DILocation(line: 91, column: 27, scope: !451)
!685 = !{!686, !690, i64 568}
!686 = !{!"_Image", !687, i64 0, !687, i64 4, !687, i64 8, !689, i64 16, !687, i64 24, !687, i64 28, !687, i64 32, !689, i64 40, !689, i64 48, !689, i64 56, !689, i64 64, !690, i64 72, !691, i64 80, !691, i64 88, !691, i64 96, !693, i64 104, !694, i64 112, !687, i64 208, !690, i64 216, !687, i64 224, !690, i64 232, !690, i64 240, !690, i64 248, !689, i64 256, !693, i64 264, !693, i64 272, !696, i64 280, !696, i64 312, !696, i64 344, !693, i64 376, !693, i64 384, !693, i64 392, !687, i64 400, !687, i64 404, !687, i64 408, !687, i64 412, !687, i64 416, !687, i64 420, !690, i64 424, !689, i64 432, !689, i64 440, !689, i64 448, !689, i64 456, !689, i64 464, !689, i64 472, !697, i64 480, !698, i64 504, !690, i64 568, !690, i64 576, !690, i64 584, !690, i64 592, !690, i64 600, !690, i64 608, !687, i64 616, !687, i64 4712, !687, i64 8808, !689, i64 12904, !689, i64 12912, !700, i64 12920, !687, i64 12976, !689, i64 12984, !690, i64 12992, !702, i64 13000, !702, i64 13032, !690, i64 13064, !689, i64 13072, !689, i64 13080, !690, i64 13088, !690, i64 13096, !690, i64 13104, !687, i64 13112, !687, i64 13116, !691, i64 13120, !690, i64 13128, !696, i64 13136, !690, i64 13168, !690, i64 13176, !687, i64 13184, !687, i64 13188, !703, i64 13192, !687, i64 13200, !689, i64 13208, !689, i64 13216, !687, i64 13224, !689, i64 13232}
!687 = !{!"omnipotent char", !688, i64 0}
!688 = !{!"Simple C/C++ TBAA"}
!689 = !{!"long", !687, i64 0}
!690 = !{!"any pointer", !687, i64 0}
!691 = !{!"_PixelPacket", !692, i64 0, !692, i64 2, !692, i64 4, !692, i64 6}
!692 = !{!"short", !687, i64 0}
!693 = !{!"double", !687, i64 0}
!694 = !{!"_ChromaticityInfo", !695, i64 0, !695, i64 24, !695, i64 48, !695, i64 72}
!695 = !{!"_PrimaryInfo", !693, i64 0, !693, i64 8, !693, i64 16}
!696 = !{!"_RectangleInfo", !689, i64 0, !689, i64 8, !689, i64 16, !689, i64 24}
!697 = !{!"_ErrorInfo", !693, i64 0, !693, i64 8, !693, i64 16}
!698 = !{!"_TimerInfo", !699, i64 0, !699, i64 24, !687, i64 48, !689, i64 56}
!699 = !{!"_Timer", !693, i64 0, !693, i64 8, !693, i64 16}
!700 = !{!"_ExceptionInfo", !687, i64 0, !701, i64 4, !690, i64 8, !690, i64 16, !690, i64 24, !687, i64 32, !690, i64 40, !689, i64 48}
!701 = !{!"int", !687, i64 0}
!702 = !{!"_ProfileInfo", !690, i64 0, !689, i64 8, !690, i64 16, !689, i64 24}
!703 = !{!"long long", !687, i64 0}
!704 = !DILocation(line: 92, column: 26, scope: !451)
!705 = !DILocation(line: 93, column: 10, scope: !451)
!706 = !DILocation(line: 93, column: 21, scope: !451)
!707 = !{!686, !690, i64 576}
!708 = !DILocation(line: 94, column: 3, scope: !451)
!709 = distinct !DISubprogram(name: "SetImageInfoProgressMonitor", scope: !452, file: !452, line: 134, type: !710, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !844)
!710 = !DISubroutineType(types: !711)
!711 = !{!455, !712, !677, !470}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !77, line: 356, size: 134336, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !750, !751, !752, !753, !754, !755, !757, !758, !759, !760, !761, !762, !773, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !841, !842, !843}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !714, file: !77, line: 359, baseType: !480, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !714, file: !77, line: 362, baseType: !486, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !714, file: !77, line: 365, baseType: !460, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !714, file: !77, line: 366, baseType: !460, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !714, file: !77, line: 367, baseType: !460, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !714, file: !77, line: 368, baseType: !460, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !714, file: !77, line: 371, baseType: !529, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !714, file: !77, line: 372, baseType: !529, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !714, file: !77, line: 373, baseType: !529, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !714, file: !77, line: 374, baseType: !529, size: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !714, file: !77, line: 377, baseType: !482, size: 64, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !714, file: !77, line: 378, baseType: !482, size: 64, offset: 512)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !714, file: !77, line: 379, baseType: !482, size: 64, offset: 576)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !714, file: !77, line: 382, baseType: !556, size: 32, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !714, file: !77, line: 385, baseType: !558, size: 32, offset: 672)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !714, file: !77, line: 388, baseType: !527, size: 32, offset: 704)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !714, file: !77, line: 391, baseType: !482, size: 64, offset: 768)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !714, file: !77, line: 394, baseType: !529, size: 64, offset: 832)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !714, file: !77, line: 395, baseType: !529, size: 64, offset: 896)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !714, file: !77, line: 396, baseType: !529, size: 64, offset: 960)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !714, file: !77, line: 397, baseType: !529, size: 64, offset: 1024)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !714, file: !77, line: 398, baseType: !529, size: 64, offset: 1088)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !714, file: !77, line: 401, baseType: !508, size: 64, offset: 1152)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !714, file: !77, line: 402, baseType: !508, size: 64, offset: 1216)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !714, file: !77, line: 405, baseType: !495, size: 64, offset: 1280)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !714, file: !77, line: 406, baseType: !495, size: 64, offset: 1344)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !714, file: !77, line: 407, baseType: !495, size: 64, offset: 1408)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !714, file: !77, line: 410, baseType: !460, size: 32, offset: 1472)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !714, file: !77, line: 411, baseType: !460, size: 32, offset: 1504)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !714, file: !77, line: 414, baseType: !482, size: 64, offset: 1536)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !714, file: !77, line: 417, baseType: !478, size: 32, offset: 1600)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !714, file: !77, line: 420, baseType: !665, size: 32, offset: 1632)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !714, file: !77, line: 423, baseType: !749, size: 32, offset: 1664)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !369, line: 59, baseType: !368)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !714, file: !77, line: 426, baseType: !533, size: 64, offset: 1728)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !714, file: !77, line: 429, baseType: !460, size: 32, offset: 1792)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !714, file: !77, line: 430, baseType: !460, size: 32, offset: 1824)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !714, file: !77, line: 433, baseType: !529, size: 64, offset: 1856)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !714, file: !77, line: 434, baseType: !529, size: 64, offset: 1920)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !714, file: !77, line: 437, baseType: !756, size: 32, offset: 1984)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !401)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !714, file: !77, line: 440, baseType: !471, size: 64, offset: 2048)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !714, file: !77, line: 443, baseType: !470, size: 64, offset: 2112)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !714, file: !77, line: 446, baseType: !455, size: 64, offset: 2176)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !714, file: !77, line: 449, baseType: !470, size: 64, offset: 2240)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !714, file: !77, line: 450, baseType: !470, size: 64, offset: 2304)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !714, file: !77, line: 453, baseType: !763, size: 64, offset: 2368)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !764, line: 26, baseType: !765)
!764 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!482, !768, !770, !772}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !714, file: !77, line: 456, baseType: !774, size: 64, offset: 2432)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !776, line: 7, baseType: !777)
!776 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !778, line: 49, size: 1728, elements: !779)
!778 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !795, !797, !798, !799, !801, !802, !804, !808, !811, !813, !816, !819, !820, !821, !822, !823}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !777, file: !778, line: 51, baseType: !623, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !777, file: !778, line: 54, baseType: !529, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !777, file: !778, line: 55, baseType: !529, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !777, file: !778, line: 56, baseType: !529, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !777, file: !778, line: 57, baseType: !529, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !777, file: !778, line: 58, baseType: !529, size: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !777, file: !778, line: 59, baseType: !529, size: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !777, file: !778, line: 60, baseType: !529, size: 64, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !777, file: !778, line: 61, baseType: !529, size: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !777, file: !778, line: 64, baseType: !529, size: 64, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !777, file: !778, line: 65, baseType: !529, size: 64, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !777, file: !778, line: 66, baseType: !529, size: 64, offset: 704)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !777, file: !778, line: 68, baseType: !793, size: 64, offset: 768)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !778, line: 36, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !777, file: !778, line: 70, baseType: !796, size: 64, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !777, file: !778, line: 72, baseType: !623, size: 32, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !777, file: !778, line: 73, baseType: !623, size: 32, offset: 928)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !777, file: !778, line: 74, baseType: !800, size: 64, offset: 960)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !536, line: 152, baseType: !537)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !777, file: !778, line: 77, baseType: !500, size: 16, offset: 1024)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !777, file: !778, line: 78, baseType: !803, size: 8, offset: 1040)
!803 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !777, file: !778, line: 79, baseType: !805, size: 8, offset: 1048)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 8, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 1)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !777, file: !778, line: 81, baseType: !809, size: 64, offset: 1088)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !778, line: 43, baseType: null)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !777, file: !778, line: 89, baseType: !812, size: 64, offset: 1152)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !536, line: 153, baseType: !537)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !777, file: !778, line: 91, baseType: !814, size: 64, offset: 1216)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !778, line: 37, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !777, file: !778, line: 92, baseType: !817, size: 64, offset: 1280)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !778, line: 38, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !777, file: !778, line: 93, baseType: !796, size: 64, offset: 1344)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !777, file: !778, line: 94, baseType: !470, size: 64, offset: 1408)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !777, file: !778, line: 95, baseType: !482, size: 64, offset: 1472)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !777, file: !778, line: 96, baseType: !623, size: 32, offset: 1536)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !777, file: !778, line: 98, baseType: !824, size: 160, offset: 1568)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 160, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 20)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !714, file: !77, line: 459, baseType: !470, size: 64, offset: 2496)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !714, file: !77, line: 462, baseType: !482, size: 64, offset: 2560)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !714, file: !77, line: 465, baseType: !609, size: 32768, offset: 2624)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !714, file: !77, line: 466, baseType: !609, size: 32768, offset: 35392)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !714, file: !77, line: 467, baseType: !609, size: 32768, offset: 68160)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !714, file: !77, line: 468, baseType: !609, size: 32768, offset: 100928)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !714, file: !77, line: 471, baseType: !460, size: 32, offset: 133696)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !714, file: !77, line: 474, baseType: !529, size: 64, offset: 133760)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !714, file: !77, line: 477, baseType: !482, size: 64, offset: 133824)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !714, file: !77, line: 478, baseType: !482, size: 64, offset: 133888)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !714, file: !77, line: 481, baseType: !495, size: 64, offset: 133952)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !714, file: !77, line: 484, baseType: !482, size: 64, offset: 134016)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !714, file: !77, line: 487, baseType: !840, size: 32, offset: 134080)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !714, file: !77, line: 490, baseType: !495, size: 64, offset: 134112)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !714, file: !77, line: 493, baseType: !470, size: 64, offset: 134208)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !714, file: !77, line: 496, baseType: !460, size: 32, offset: 134272)
!844 = !{!845, !846, !847, !848}
!845 = !DILocalVariable(name: "image_info", arg: 1, scope: !709, file: !452, line: 135, type: !712)
!846 = !DILocalVariable(name: "progress_monitor", arg: 2, scope: !709, file: !452, line: 135, type: !677)
!847 = !DILocalVariable(name: "client_data", arg: 3, scope: !709, file: !452, line: 136, type: !470)
!848 = !DILocalVariable(name: "previous_monitor", scope: !709, file: !452, line: 139, type: !455)
!849 = !DILocation(line: 0, scope: !709)
!850 = !DILocation(line: 141, column: 32, scope: !709)
!851 = !{!852, !690, i64 272}
!852 = !{!"_ImageInfo", !687, i64 0, !687, i64 4, !687, i64 8, !687, i64 12, !687, i64 16, !687, i64 20, !690, i64 24, !690, i64 32, !690, i64 40, !690, i64 48, !689, i64 56, !689, i64 64, !689, i64 72, !687, i64 80, !687, i64 84, !687, i64 88, !689, i64 96, !690, i64 104, !690, i64 112, !690, i64 120, !690, i64 128, !690, i64 136, !693, i64 144, !693, i64 152, !691, i64 160, !691, i64 168, !691, i64 176, !687, i64 184, !687, i64 188, !689, i64 192, !687, i64 200, !687, i64 204, !687, i64 208, !689, i64 216, !687, i64 224, !687, i64 228, !690, i64 232, !690, i64 240, !687, i64 248, !690, i64 256, !690, i64 264, !690, i64 272, !690, i64 280, !690, i64 288, !690, i64 296, !690, i64 304, !690, i64 312, !689, i64 320, !687, i64 328, !687, i64 4424, !687, i64 8520, !687, i64 12616, !687, i64 16712, !690, i64 16720, !689, i64 16728, !689, i64 16736, !691, i64 16744, !689, i64 16752, !687, i64 16760, !691, i64 16764, !690, i64 16776, !687, i64 16784}
!853 = !DILocation(line: 142, column: 31, scope: !709)
!854 = !DILocation(line: 143, column: 15, scope: !709)
!855 = !DILocation(line: 143, column: 26, scope: !709)
!856 = !{!852, !690, i64 280}
!857 = !DILocation(line: 144, column: 3, scope: !709)
