; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/morphology.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/morphology.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._GeometryInfo = type { double, double, double, double, double }
%struct.KernelInfo = type { i32, i64, i64, i64, i64, ptr, double, double, double, double, double, ptr, i64 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }

!514 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!515 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!516 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!517 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!518 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!519 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!520 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!521 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!522 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!523 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!524 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!525 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!526 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!527 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!528 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!529 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!530 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!531 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!532 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!533 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!534 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!535 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!536 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!537 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!538 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!539 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!540 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!541 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!542 = !DIEnumerator(name: "MagickListOptions", value: 38)
!543 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!544 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!545 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!546 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!547 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!548 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!549 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!550 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!551 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!552 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!553 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!554 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!555 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!556 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!557 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!558 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!559 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!560 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!561 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!562 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!563 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!564 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!565 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!566 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!567 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!568 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!569 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!570 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!571 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!572 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!573 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!574 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!575 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 30, baseType: !5, size: 32, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!577 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!578 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!579 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!580 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!581 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!582 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!583 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!584 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!585 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!586 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!587 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!588 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!589 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!590 = !{!591, !594, !501, !595, !596, !597, !626, !617, !604, !609, !616, !613, !627, !832, !653, !708, !833, !606, !834, !602, !835, !648, !837, !840, !839, !743, !841, !843}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!595 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!596 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfo", file: !4, line: 128, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernelInfo", file: !4, line: 102, size: 832, elements: !600)
!600 = !{!601, !603, !607, !608, !614, !615, !618, !619, !620, !621, !622, !623, !625}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !4, line: 105, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfoType", file: !4, line: 67, baseType: !3)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !599, file: !4, line: 108, baseType: !604, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !605, line: 46, baseType: !606)
!605 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!606 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !599, file: !4, line: 109, baseType: !604, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !599, file: !4, line: 112, baseType: !609, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !610, line: 77, baseType: !611)
!610 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !612, line: 193, baseType: !613)
!612 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!613 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !599, file: !4, line: 113, baseType: !609, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !599, file: !4, line: 116, baseType: !616, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !599, file: !4, line: 117, baseType: !617, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !599, file: !4, line: 118, baseType: !617, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "negative_range", scope: !599, file: !4, line: 119, baseType: !617, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "positive_range", scope: !599, file: !4, line: 120, baseType: !617, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !599, file: !4, line: 121, baseType: !617, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !599, file: !4, line: 124, baseType: !624, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !599, file: !4, line: 127, baseType: !604, size: 64, offset: 768)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !90, line: 221, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !158, line: 150, size: 105920, elements: !630)
!630 = !{!631, !633, !635, !637, !638, !640, !642, !643, !644, !645, !646, !647, !657, !658, !659, !660, !661, !675, !677, !678, !680, !681, !682, !683, !684, !685, !686, !694, !695, !696, !697, !698, !699, !701, !703, !705, !707, !709, !711, !713, !714, !715, !716, !717, !718, !719, !727, !742, !754, !755, !756, !757, !761, !765, !769, !770, !771, !772, !773, !790, !791, !793, !794, !803, !804, !806, !807, !808, !809, !810, !811, !813, !814, !815, !816, !817, !818, !819, !821, !822, !823, !824, !825, !829, !831}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !629, file: !158, line: 153, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !90, line: 209, baseType: !89)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !629, file: !158, line: 156, baseType: !634, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !96, line: 61, baseType: !95)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !629, file: !158, line: 159, baseType: !636, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !133, line: 49, baseType: !132)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !629, file: !158, line: 162, baseType: !604, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !629, file: !158, line: 165, baseType: !639, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !158, line: 86, baseType: !157)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !629, file: !158, line: 168, baseType: !641, size: 32, offset: 224)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !90, line: 215, baseType: !169)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !629, file: !158, line: 169, baseType: !641, size: 32, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !629, file: !158, line: 172, baseType: !604, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !629, file: !158, line: 173, baseType: !604, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !629, file: !158, line: 174, baseType: !604, size: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !629, file: !158, line: 175, baseType: !604, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !629, file: !158, line: 178, baseType: !648, size: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !410, line: 148, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !410, line: 131, size: 64, elements: !651)
!651 = !{!652, !654, !655, !656}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !650, file: !410, line: 143, baseType: !653, size: 16)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !90, line: 93, baseType: !596)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !650, file: !410, line: 144, baseType: !653, size: 16, offset: 16)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !650, file: !410, line: 145, baseType: !653, size: 16, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !650, file: !410, line: 146, baseType: !653, size: 16, offset: 48)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !629, file: !158, line: 179, baseType: !649, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !629, file: !158, line: 180, baseType: !649, size: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !629, file: !158, line: 181, baseType: !649, size: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !629, file: !158, line: 184, baseType: !617, size: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !629, file: !158, line: 187, baseType: !662, size: 768, offset: 896)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !158, line: 128, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !158, line: 121, size: 768, elements: !664)
!664 = !{!665, !672, !673, !674}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !663, file: !158, line: 124, baseType: !666, size: 192)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !158, line: 101, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !158, line: 95, size: 192, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !667, file: !158, line: 98, baseType: !617, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !667, file: !158, line: 99, baseType: !617, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !667, file: !158, line: 100, baseType: !617, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !663, file: !158, line: 125, baseType: !666, size: 192, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !663, file: !158, line: 126, baseType: !666, size: 192, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !663, file: !158, line: 127, baseType: !666, size: 192, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !629, file: !158, line: 190, baseType: !676, size: 32, offset: 1664)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !174, line: 49, baseType: !173)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !629, file: !158, line: 193, baseType: !594, size: 64, offset: 1728)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !629, file: !158, line: 196, baseType: !679, size: 32, offset: 1792)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !158, line: 93, baseType: !181)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !629, file: !158, line: 199, baseType: !626, size: 64, offset: 1856)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !629, file: !158, line: 200, baseType: !626, size: 64, offset: 1920)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !629, file: !158, line: 201, baseType: !626, size: 64, offset: 1984)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !629, file: !158, line: 204, baseType: !609, size: 64, offset: 2048)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !629, file: !158, line: 207, baseType: !617, size: 64, offset: 2112)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !629, file: !158, line: 208, baseType: !617, size: 64, offset: 2176)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !629, file: !158, line: 211, baseType: !687, size: 256, offset: 2240)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !61, line: 130, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !61, line: 121, size: 256, elements: !689)
!689 = !{!690, !691, !692, !693}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !688, file: !61, line: 124, baseType: !604, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !688, file: !61, line: 125, baseType: !604, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !688, file: !61, line: 128, baseType: !609, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !688, file: !61, line: 129, baseType: !609, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !629, file: !158, line: 212, baseType: !687, size: 256, offset: 2496)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !629, file: !158, line: 213, baseType: !687, size: 256, offset: 2752)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !629, file: !158, line: 216, baseType: !617, size: 64, offset: 3008)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !629, file: !158, line: 217, baseType: !617, size: 64, offset: 3072)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !629, file: !158, line: 218, baseType: !617, size: 64, offset: 3136)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !629, file: !158, line: 221, baseType: !700, size: 32, offset: 3200)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !187, line: 66, baseType: !186)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !629, file: !158, line: 224, baseType: !702, size: 32, offset: 3232)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !158, line: 73, baseType: !221)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !629, file: !158, line: 227, baseType: !704, size: 32, offset: 3264)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !232, line: 35, baseType: !231)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !629, file: !158, line: 230, baseType: !706, size: 32, offset: 3296)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !61, line: 91, baseType: !237)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !629, file: !158, line: 233, baseType: !708, size: 32, offset: 3328)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !252, line: 99, baseType: !251)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !629, file: !158, line: 236, baseType: !710, size: 32, offset: 3360)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !323, line: 32, baseType: !322)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !629, file: !158, line: 239, baseType: !712, size: 64, offset: 3392)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !629, file: !158, line: 242, baseType: !604, size: 64, offset: 3456)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !629, file: !158, line: 243, baseType: !604, size: 64, offset: 3520)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !629, file: !158, line: 246, baseType: !609, size: 64, offset: 3584)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !629, file: !158, line: 249, baseType: !604, size: 64, offset: 3648)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !629, file: !158, line: 250, baseType: !604, size: 64, offset: 3712)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !629, file: !158, line: 253, baseType: !609, size: 64, offset: 3776)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !629, file: !158, line: 256, baseType: !720, size: 192, offset: 3840)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !721, line: 68, baseType: !722)
!721 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !721, line: 62, size: 192, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !722, file: !721, line: 65, baseType: !617, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !722, file: !721, line: 66, baseType: !617, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !722, file: !721, line: 67, baseType: !617, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !629, file: !158, line: 259, baseType: !728, size: 512, offset: 4032)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !331, line: 51, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !331, line: 40, size: 512, elements: !730)
!730 = !{!731, !738, !739, !741}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !729, file: !331, line: 43, baseType: !732, size: 192)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !331, line: 38, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !331, line: 32, size: 192, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !733, file: !331, line: 35, baseType: !617, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !733, file: !331, line: 36, baseType: !617, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !733, file: !331, line: 37, baseType: !617, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !729, file: !331, line: 44, baseType: !732, size: 192, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !729, file: !331, line: 47, baseType: !740, size: 32, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !331, line: 30, baseType: !330)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !729, file: !331, line: 50, baseType: !604, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !629, file: !158, line: 262, baseType: !743, size: 64, offset: 4544)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !744, line: 26, baseType: !745)
!744 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!641, !591, !748, !751, !594}
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !90, line: 150, baseType: !750)
!750 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !90, line: 151, baseType: !753)
!753 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !629, file: !158, line: 265, baseType: !594, size: 64, offset: 4608)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !629, file: !158, line: 266, baseType: !594, size: 64, offset: 4672)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !629, file: !158, line: 267, baseType: !594, size: 64, offset: 4736)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !629, file: !158, line: 270, baseType: !758, size: 64, offset: 4800)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !133, line: 52, baseType: !760)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !133, line: 51, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !629, file: !158, line: 273, baseType: !762, size: 64, offset: 4864)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !90, line: 217, baseType: !764)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !90, line: 217, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !629, file: !158, line: 276, baseType: !766, size: 32768, offset: 4928)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 32768, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 4096)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !629, file: !158, line: 277, baseType: !766, size: 32768, offset: 37696)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !629, file: !158, line: 278, baseType: !766, size: 32768, offset: 70464)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !629, file: !158, line: 281, baseType: !604, size: 64, offset: 103232)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !629, file: !158, line: 282, baseType: !604, size: 64, offset: 103296)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !629, file: !158, line: 285, baseType: !774, size: 448, offset: 103360)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !90, line: 219, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !337, line: 102, size: 448, elements: !776)
!776 = !{!777, !779, !780, !781, !782, !783, !784, !789}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !775, file: !337, line: 105, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !337, line: 100, baseType: !336)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !775, file: !337, line: 108, baseType: !501, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !775, file: !337, line: 111, baseType: !626, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !775, file: !337, line: 112, baseType: !626, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !775, file: !337, line: 115, baseType: !594, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !775, file: !337, line: 118, baseType: !641, size: 32, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !775, file: !337, line: 121, baseType: !785, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !787, line: 26, baseType: !788)
!787 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !787, line: 25, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !775, file: !337, line: 124, baseType: !604, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !629, file: !158, line: 288, baseType: !641, size: 32, offset: 103808)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !629, file: !158, line: 291, baseType: !792, size: 64, offset: 103872)
!792 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !609)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !629, file: !158, line: 294, baseType: !785, size: 64, offset: 103936)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !629, file: !158, line: 297, baseType: !795, size: 256, offset: 104000)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !174, line: 40, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !174, line: 27, size: 256, elements: !797)
!797 = !{!798, !799, !800, !802}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !174, line: 30, baseType: !626, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !796, file: !174, line: 33, baseType: !604, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !796, file: !174, line: 36, baseType: !801, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !796, file: !174, line: 39, baseType: !604, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !629, file: !158, line: 298, baseType: !795, size: 256, offset: 104256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !629, file: !158, line: 299, baseType: !805, size: 64, offset: 104512)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !629, file: !158, line: 302, baseType: !604, size: 64, offset: 104576)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !629, file: !158, line: 305, baseType: !604, size: 64, offset: 104640)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !629, file: !158, line: 308, baseType: !712, size: 64, offset: 104704)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !629, file: !158, line: 309, baseType: !712, size: 64, offset: 104768)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !629, file: !158, line: 310, baseType: !712, size: 64, offset: 104832)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !629, file: !158, line: 313, baseType: !812, size: 32, offset: 104896)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !410, line: 47, baseType: !409)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !629, file: !158, line: 316, baseType: !641, size: 32, offset: 104928)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !629, file: !158, line: 319, baseType: !649, size: 64, offset: 104960)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !629, file: !158, line: 322, baseType: !712, size: 64, offset: 105024)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !629, file: !158, line: 325, baseType: !687, size: 256, offset: 105088)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !629, file: !158, line: 328, baseType: !594, size: 64, offset: 105344)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !629, file: !158, line: 329, baseType: !594, size: 64, offset: 105408)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !629, file: !158, line: 332, baseType: !820, size: 32, offset: 105472)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !158, line: 61, baseType: !426)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !629, file: !158, line: 335, baseType: !641, size: 32, offset: 105504)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !629, file: !158, line: 338, baseType: !752, size: 64, offset: 105536)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !629, file: !158, line: 341, baseType: !641, size: 32, offset: 105600)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !629, file: !158, line: 344, baseType: !604, size: 64, offset: 105664)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !629, file: !158, line: 347, baseType: !826, size: 64, offset: 105728)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !827, line: 7, baseType: !828)
!827 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !612, line: 160, baseType: !613)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !629, file: !158, line: 350, baseType: !830, size: 32, offset: 105792)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !410, line: 79, baseType: !440)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !629, file: !158, line: 353, baseType: !604, size: 64, offset: 105856)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !90, line: 202, baseType: !452)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryFlags", file: !61, line: 61, baseType: !60)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !410, line: 129, baseType: !653)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !90, line: 78, baseType: !842)
!842 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!844 = !{i32 7, !"Dwarf Version", i32 5}
!845 = !{i32 2, !"Debug Info Version", i32 3}
!846 = !{i32 1, !"wchar_size", i32 4}
!847 = !{i32 7, !"PIC Level", i32 2}
!848 = !{i32 7, !"PIE Level", i32 2}
!849 = !{i32 7, !"uwtable", i32 2}
!850 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!851 = distinct !DISubprogram(name: "AcquireKernelInfo", scope: !852, file: !852, line: 492, type: !853, scopeLine: 493, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !855)
!852 = !DIFile(filename: "apps/538.imagick_r/src/magick/morphology.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b7287e7ed7d316e4ffe93c4641bef5bc")
!853 = !DISubroutineType(types: !854)
!854 = !{!597, !591}
!855 = !{!856, !857, !858, !859, !860}
!856 = !DILocalVariable(name: "kernel_string", arg: 1, scope: !851, file: !852, line: 492, type: !591)
!857 = !DILocalVariable(name: "kernel", scope: !851, file: !852, line: 495, type: !597)
!858 = !DILocalVariable(name: "new_kernel", scope: !851, file: !852, line: 496, type: !597)
!859 = !DILocalVariable(name: "token", scope: !851, file: !852, line: 499, type: !766)
!860 = !DILocalVariable(name: "p", scope: !851, file: !852, line: 502, type: !591)
!861 = !DILocation(line: 0, scope: !851)
!862 = !DILocation(line: 498, column: 3, scope: !851)
!863 = !DILocation(line: 499, column: 5, scope: !851)
!864 = !DILocation(line: 504, column: 21, scope: !865)
!865 = distinct !DILexicalBlock(scope: !851, file: !852, line: 504, column: 7)
!866 = !DILocation(line: 504, column: 7, scope: !851)
!867 = !DILocation(line: 509, column: 3, scope: !851)
!868 = !DILocalVariable(name: "kernel_string", arg: 1, scope: !869, file: !852, line: 221, type: !591)
!869 = distinct !DISubprogram(name: "ParseKernelArray", scope: !852, file: !852, line: 221, type: !853, scopeLine: 222, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !870)
!870 = !{!868, !871, !872, !873, !874, !875, !876, !877, !879}
!871 = !DILocalVariable(name: "kernel", scope: !869, file: !852, line: 224, type: !597)
!872 = !DILocalVariable(name: "token", scope: !869, file: !852, line: 227, type: !766)
!873 = !DILocalVariable(name: "p", scope: !869, file: !852, line: 230, type: !591)
!874 = !DILocalVariable(name: "end", scope: !869, file: !852, line: 231, type: !591)
!875 = !DILocalVariable(name: "i", scope: !869, file: !852, line: 234, type: !609)
!876 = !DILocalVariable(name: "nan", scope: !869, file: !852, line: 237, type: !617)
!877 = !DILocalVariable(name: "flags", scope: !869, file: !852, line: 240, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !90, line: 147, baseType: !5)
!879 = !DILocalVariable(name: "args", scope: !869, file: !852, line: 243, type: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryInfo", file: !61, line: 112, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GeometryInfo", file: !61, line: 104, size: 320, elements: !882)
!882 = !{!883, !884, !885, !886, !887}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !881, file: !61, line: 107, baseType: !617, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !881, file: !61, line: 108, baseType: !617, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !881, file: !61, line: 109, baseType: !617, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !881, file: !61, line: 110, baseType: !617, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "chi", scope: !881, file: !61, line: 111, baseType: !617, size: 64, offset: 256)
!888 = !DILocation(line: 0, scope: !869, inlinedAt: !889)
!889 = distinct !DILocation(line: 505, column: 12, scope: !865)
!890 = !DILocation(line: 227, column: 5, scope: !869, inlinedAt: !889)
!891 = !DILocation(line: 237, column: 11, scope: !869, inlinedAt: !889)
!892 = !DILocation(line: 243, column: 5, scope: !869, inlinedAt: !889)
!893 = !DILocation(line: 245, column: 25, scope: !869, inlinedAt: !889)
!894 = !DILocation(line: 246, column: 14, scope: !895, inlinedAt: !889)
!895 = distinct !DILexicalBlock(scope: !869, file: !852, line: 246, column: 7)
!896 = !DILocation(line: 246, column: 7, scope: !869, inlinedAt: !889)
!897 = !DILocation(line: 248, column: 10, scope: !869, inlinedAt: !889)
!898 = !DILocation(line: 249, column: 11, scope: !869, inlinedAt: !889)
!899 = !DILocation(line: 249, column: 37, scope: !869, inlinedAt: !889)
!900 = !DILocation(line: 251, column: 16, scope: !869, inlinedAt: !889)
!901 = !{!902, !903, i64 0}
!902 = !{!"KernelInfo", !903, i64 0, !905, i64 8, !905, i64 16, !905, i64 24, !905, i64 32, !906, i64 40, !907, i64 48, !907, i64 56, !907, i64 64, !907, i64 72, !907, i64 80, !906, i64 88, !905, i64 96}
!903 = !{!"omnipotent char", !904, i64 0}
!904 = !{!"Simple C/C++ TBAA"}
!905 = !{!"long", !903, i64 0}
!906 = !{!"any pointer", !903, i64 0}
!907 = !{!"double", !903, i64 0}
!908 = !DILocation(line: 252, column: 11, scope: !869, inlinedAt: !889)
!909 = !DILocation(line: 252, column: 16, scope: !869, inlinedAt: !889)
!910 = !{!902, !906, i64 88}
!911 = !DILocation(line: 253, column: 11, scope: !869, inlinedAt: !889)
!912 = !DILocation(line: 253, column: 21, scope: !869, inlinedAt: !889)
!913 = !{!902, !905, i64 96}
!914 = !DILocation(line: 509, column: 10, scope: !851)
!915 = !DILocation(line: 509, column: 40, scope: !851)
!916 = !{!903, !903, i64 0}
!917 = !DILocation(line: 515, column: 13, scope: !918)
!918 = distinct !DILexicalBlock(scope: !919, file: !852, line: 515, column: 13)
!919 = distinct !DILexicalBlock(scope: !920, file: !852, line: 513, column: 7)
!920 = distinct !DILexicalBlock(scope: !921, file: !852, line: 512, column: 9)
!921 = distinct !DILexicalBlock(scope: !851, file: !852, line: 510, column: 3)
!922 = !{!906, !906, i64 0}
!923 = !{!924, !924, i64 0}
!924 = !{!"short", !903, i64 0}
!925 = !DILocation(line: 515, column: 53, scope: !918)
!926 = !DILocation(line: 515, column: 13, scope: !919)
!927 = !DILocalVariable(name: "kernel_string", arg: 1, scope: !928, file: !852, line: 380, type: !591)
!928 = distinct !DISubprogram(name: "ParseKernelName", scope: !852, file: !852, line: 380, type: !853, scopeLine: 381, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !929)
!929 = !{!927, !930, !931, !932, !933, !934, !935, !936}
!930 = !DILocalVariable(name: "token", scope: !928, file: !852, line: 383, type: !766)
!931 = !DILocalVariable(name: "p", scope: !928, file: !852, line: 386, type: !591)
!932 = !DILocalVariable(name: "end", scope: !928, file: !852, line: 387, type: !591)
!933 = !DILocalVariable(name: "args", scope: !928, file: !852, line: 390, type: !880)
!934 = !DILocalVariable(name: "kernel", scope: !928, file: !852, line: 393, type: !597)
!935 = !DILocalVariable(name: "flags", scope: !928, file: !852, line: 396, type: !878)
!936 = !DILocalVariable(name: "type", scope: !928, file: !852, line: 399, type: !609)
!937 = !DILocation(line: 0, scope: !928, inlinedAt: !938)
!938 = distinct !DILocation(line: 516, column: 22, scope: !918)
!939 = !DILocation(line: 382, column: 3, scope: !928, inlinedAt: !938)
!940 = !DILocation(line: 383, column: 5, scope: !928, inlinedAt: !938)
!941 = !DILocation(line: 385, column: 3, scope: !928, inlinedAt: !938)
!942 = !DILocation(line: 389, column: 3, scope: !928, inlinedAt: !938)
!943 = !DILocation(line: 390, column: 5, scope: !928, inlinedAt: !938)
!944 = !DILocation(line: 402, column: 3, scope: !928, inlinedAt: !938)
!945 = !DILocation(line: 403, column: 8, scope: !928, inlinedAt: !938)
!946 = !DILocation(line: 404, column: 13, scope: !947, inlinedAt: !938)
!947 = distinct !DILexicalBlock(scope: !928, file: !852, line: 404, column: 8)
!948 = !DILocation(line: 404, column: 17, scope: !947, inlinedAt: !938)
!949 = !DILocation(line: 407, column: 12, scope: !928, inlinedAt: !938)
!950 = !DILocation(line: 407, column: 3, scope: !928, inlinedAt: !938)
!951 = !DILocation(line: 407, column: 48, scope: !928, inlinedAt: !938)
!952 = !DILocation(line: 407, column: 54, scope: !928, inlinedAt: !938)
!953 = !DILocation(line: 408, column: 56, scope: !928, inlinedAt: !938)
!954 = !DILocation(line: 409, column: 6, scope: !928, inlinedAt: !938)
!955 = distinct !{!955, !950, !954, !956, !957}
!956 = !{!"llvm.loop.mustprogress"}
!957 = !{!"llvm.loop.unroll.disable"}
!958 = !DILocation(line: 411, column: 9, scope: !928, inlinedAt: !938)
!959 = !DILocation(line: 412, column: 12, scope: !960, inlinedAt: !938)
!960 = distinct !DILexicalBlock(scope: !928, file: !852, line: 412, column: 8)
!961 = !DILocation(line: 412, column: 8, scope: !928, inlinedAt: !938)
!962 = !DILocation(line: 413, column: 11, scope: !960, inlinedAt: !938)
!963 = !DILocation(line: 413, column: 5, scope: !960, inlinedAt: !938)
!964 = !DILocation(line: 416, column: 33, scope: !928, inlinedAt: !938)
!965 = !DILocation(line: 416, column: 3, scope: !928, inlinedAt: !938)
!966 = !DILocation(line: 417, column: 3, scope: !928, inlinedAt: !938)
!967 = !DILocation(line: 417, column: 16, scope: !928, inlinedAt: !938)
!968 = !DILocation(line: 418, column: 3, scope: !928, inlinedAt: !938)
!969 = !DILocation(line: 419, column: 11, scope: !928, inlinedAt: !938)
!970 = !DILocation(line: 428, column: 3, scope: !928, inlinedAt: !938)
!971 = !DILocation(line: 431, column: 19, scope: !972, inlinedAt: !938)
!972 = distinct !DILexicalBlock(scope: !973, file: !852, line: 431, column: 12)
!973 = distinct !DILexicalBlock(scope: !928, file: !852, line: 428, column: 18)
!974 = !DILocation(line: 431, column: 33, scope: !972, inlinedAt: !938)
!975 = !DILocation(line: 431, column: 12, scope: !973, inlinedAt: !938)
!976 = !DILocation(line: 432, column: 18, scope: !972, inlinedAt: !938)
!977 = !{!978, !907, i64 0}
!978 = !{!"_GeometryInfo", !907, i64 0, !907, i64 8, !907, i64 16, !907, i64 24, !907, i64 32}
!979 = !DILocation(line: 432, column: 9, scope: !972, inlinedAt: !938)
!980 = !DILocation(line: 440, column: 19, scope: !981, inlinedAt: !938)
!981 = distinct !DILexicalBlock(scope: !973, file: !852, line: 440, column: 12)
!982 = !DILocation(line: 440, column: 34, scope: !981, inlinedAt: !938)
!983 = !DILocation(line: 440, column: 12, scope: !973, inlinedAt: !938)
!984 = !DILocation(line: 441, column: 20, scope: !981, inlinedAt: !938)
!985 = !{!978, !907, i64 8}
!986 = !DILocation(line: 441, column: 9, scope: !981, inlinedAt: !938)
!987 = !DILocation(line: 444, column: 19, scope: !988, inlinedAt: !938)
!988 = distinct !DILexicalBlock(scope: !973, file: !852, line: 444, column: 12)
!989 = !DILocation(line: 444, column: 29, scope: !988, inlinedAt: !938)
!990 = !DILocation(line: 444, column: 12, scope: !973, inlinedAt: !938)
!991 = !DILocation(line: 445, column: 17, scope: !988, inlinedAt: !938)
!992 = !{!978, !907, i64 16}
!993 = !DILocation(line: 445, column: 9, scope: !988, inlinedAt: !938)
!994 = !DILocation(line: 448, column: 19, scope: !995, inlinedAt: !938)
!995 = distinct !DILexicalBlock(scope: !973, file: !852, line: 448, column: 12)
!996 = !DILocation(line: 448, column: 33, scope: !995, inlinedAt: !938)
!997 = !DILocation(line: 448, column: 12, scope: !973, inlinedAt: !938)
!998 = !DILocation(line: 449, column: 25, scope: !995, inlinedAt: !938)
!999 = !DILocation(line: 449, column: 18, scope: !995, inlinedAt: !938)
!1000 = !DILocation(line: 449, column: 9, scope: !995, inlinedAt: !938)
!1001 = !DILocation(line: 450, column: 17, scope: !1002, inlinedAt: !938)
!1002 = distinct !DILexicalBlock(scope: !973, file: !852, line: 450, column: 12)
!1003 = !DILocation(line: 450, column: 21, scope: !1002, inlinedAt: !938)
!1004 = !DILocation(line: 450, column: 12, scope: !973, inlinedAt: !938)
!1005 = !DILocation(line: 451, column: 20, scope: !1002, inlinedAt: !938)
!1006 = !DILocation(line: 451, column: 11, scope: !1002, inlinedAt: !938)
!1007 = !DILocation(line: 452, column: 17, scope: !1008, inlinedAt: !938)
!1008 = distinct !DILexicalBlock(scope: !973, file: !852, line: 452, column: 12)
!1009 = !DILocation(line: 452, column: 23, scope: !1008, inlinedAt: !938)
!1010 = !DILocation(line: 452, column: 12, scope: !973, inlinedAt: !938)
!1011 = !DILocation(line: 453, column: 20, scope: !1008, inlinedAt: !938)
!1012 = !DILocation(line: 453, column: 9, scope: !1008, inlinedAt: !938)
!1013 = !DILocation(line: 454, column: 19, scope: !1014, inlinedAt: !938)
!1014 = distinct !DILexicalBlock(scope: !973, file: !852, line: 454, column: 12)
!1015 = !DILocation(line: 454, column: 29, scope: !1014, inlinedAt: !938)
!1016 = !DILocation(line: 454, column: 12, scope: !973, inlinedAt: !938)
!1017 = !DILocation(line: 455, column: 29, scope: !1014, inlinedAt: !938)
!1018 = !DILocation(line: 455, column: 46, scope: !1014, inlinedAt: !938)
!1019 = !DILocation(line: 455, column: 49, scope: !1014, inlinedAt: !938)
!1020 = !DILocation(line: 455, column: 19, scope: !1014, inlinedAt: !938)
!1021 = !DILocation(line: 455, column: 17, scope: !1014, inlinedAt: !938)
!1022 = !DILocation(line: 455, column: 9, scope: !1014, inlinedAt: !938)
!1023 = !DILocation(line: 456, column: 19, scope: !1024, inlinedAt: !938)
!1024 = distinct !DILexicalBlock(scope: !973, file: !852, line: 456, column: 12)
!1025 = !DILocation(line: 456, column: 29, scope: !1024, inlinedAt: !938)
!1026 = !DILocation(line: 456, column: 12, scope: !973, inlinedAt: !938)
!1027 = !DILocation(line: 457, column: 30, scope: !1024, inlinedAt: !938)
!1028 = !DILocation(line: 457, column: 49, scope: !1024, inlinedAt: !938)
!1029 = !DILocation(line: 457, column: 52, scope: !1024, inlinedAt: !938)
!1030 = !DILocation(line: 457, column: 20, scope: !1024, inlinedAt: !938)
!1031 = !DILocation(line: 457, column: 18, scope: !1024, inlinedAt: !938)
!1032 = !{!978, !907, i64 24}
!1033 = !DILocation(line: 457, column: 9, scope: !1024, inlinedAt: !938)
!1034 = !DILocation(line: 464, column: 19, scope: !1035, inlinedAt: !938)
!1035 = distinct !DILexicalBlock(scope: !973, file: !852, line: 464, column: 12)
!1036 = !DILocation(line: 464, column: 34, scope: !1035, inlinedAt: !938)
!1037 = !DILocation(line: 464, column: 12, scope: !973, inlinedAt: !938)
!1038 = !DILocation(line: 465, column: 20, scope: !1035, inlinedAt: !938)
!1039 = !DILocation(line: 465, column: 9, scope: !1035, inlinedAt: !938)
!1040 = !DILocation(line: 466, column: 24, scope: !1041, inlinedAt: !938)
!1041 = distinct !DILexicalBlock(scope: !1035, file: !852, line: 466, column: 17)
!1042 = !DILocation(line: 466, column: 40, scope: !1041, inlinedAt: !938)
!1043 = !DILocation(line: 466, column: 17, scope: !1035, inlinedAt: !938)
!1044 = !DILocation(line: 467, column: 41, scope: !1041, inlinedAt: !938)
!1045 = !DILocation(line: 467, column: 46, scope: !1041, inlinedAt: !938)
!1046 = !DILocation(line: 467, column: 34, scope: !1041, inlinedAt: !938)
!1047 = !DILocation(line: 467, column: 20, scope: !1041, inlinedAt: !938)
!1048 = !DILocation(line: 467, column: 9, scope: !1041, inlinedAt: !938)
!1049 = !DILocation(line: 468, column: 24, scope: !1050, inlinedAt: !938)
!1050 = distinct !DILexicalBlock(scope: !1041, file: !852, line: 468, column: 17)
!1051 = !DILocation(line: 468, column: 41, scope: !1050, inlinedAt: !938)
!1052 = !DILocation(line: 468, column: 17, scope: !1041, inlinedAt: !938)
!1053 = !DILocation(line: 469, column: 20, scope: !1050, inlinedAt: !938)
!1054 = !DILocation(line: 469, column: 9, scope: !1050, inlinedAt: !938)
!1055 = !DILocation(line: 475, column: 33, scope: !928, inlinedAt: !938)
!1056 = !DILocation(line: 475, column: 12, scope: !928, inlinedAt: !938)
!1057 = !DILocation(line: 476, column: 15, scope: !1058, inlinedAt: !938)
!1058 = distinct !DILexicalBlock(scope: !928, file: !852, line: 476, column: 8)
!1059 = !DILocation(line: 476, column: 8, scope: !928, inlinedAt: !938)
!1060 = !DILocation(line: 480, column: 16, scope: !1061, inlinedAt: !938)
!1061 = distinct !DILexicalBlock(scope: !928, file: !852, line: 480, column: 8)
!1062 = !DILocation(line: 480, column: 21, scope: !1061, inlinedAt: !938)
!1063 = !DILocation(line: 480, column: 8, scope: !928, inlinedAt: !938)
!1064 = !DILocation(line: 481, column: 17, scope: !1065, inlinedAt: !938)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !852, line: 481, column: 10)
!1066 = distinct !DILexicalBlock(scope: !1061, file: !852, line: 480, column: 46)
!1067 = !DILocation(line: 481, column: 30, scope: !1065, inlinedAt: !938)
!1068 = !DILocation(line: 481, column: 10, scope: !1066, inlinedAt: !938)
!1069 = !DILocation(line: 482, column: 7, scope: !1065, inlinedAt: !938)
!1070 = !DILocation(line: 483, column: 22, scope: !1071, inlinedAt: !938)
!1071 = distinct !DILexicalBlock(scope: !1065, file: !852, line: 483, column: 15)
!1072 = !DILocation(line: 483, column: 38, scope: !1071, inlinedAt: !938)
!1073 = !DILocation(line: 483, column: 15, scope: !1065, inlinedAt: !938)
!1074 = !DILocation(line: 484, column: 7, scope: !1071, inlinedAt: !938)
!1075 = !DILocation(line: 485, column: 22, scope: !1076, inlinedAt: !938)
!1076 = distinct !DILexicalBlock(scope: !1071, file: !852, line: 485, column: 15)
!1077 = !DILocation(line: 485, column: 35, scope: !1076, inlinedAt: !938)
!1078 = !DILocation(line: 485, column: 15, scope: !1071, inlinedAt: !938)
!1079 = !DILocation(line: 486, column: 7, scope: !1076, inlinedAt: !938)
!1080 = !DILocation(line: 490, column: 1, scope: !928, inlinedAt: !938)
!1081 = !DILocation(line: 516, column: 11, scope: !918)
!1082 = !DILocation(line: 518, column: 22, scope: !918)
!1083 = !DILocation(line: 0, scope: !918)
!1084 = !DILocation(line: 521, column: 24, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !919, file: !852, line: 521, column: 13)
!1086 = !DILocation(line: 0, scope: !919)
!1087 = !DILocation(line: 521, column: 13, scope: !919)
!1088 = !DILocation(line: 523, column: 17, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1085, file: !852, line: 522, column: 11)
!1090 = !DILocation(line: 524, column: 22, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1089, file: !852, line: 523, column: 17)
!1092 = !DILocation(line: 524, column: 15, scope: !1091)
!1093 = !DILocation(line: 529, column: 13, scope: !919)
!1094 = !DILocalVariable(name: "kernel", arg: 1, scope: !1095, file: !852, line: 126, type: !597)
!1095 = distinct !DISubprogram(name: "LastKernelInfo", scope: !852, file: !852, line: 126, type: !1096, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1098)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!597, !597}
!1098 = !{!1094}
!1099 = !DILocation(line: 0, scope: !1095, inlinedAt: !1100)
!1100 = distinct !DILocation(line: 532, column: 11, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !919, file: !852, line: 529, column: 13)
!1102 = !DILocation(line: 128, column: 18, scope: !1095, inlinedAt: !1100)
!1103 = !DILocation(line: 128, column: 23, scope: !1095, inlinedAt: !1100)
!1104 = !DILocation(line: 128, column: 3, scope: !1095, inlinedAt: !1100)
!1105 = distinct !{!1105, !1104, !1106, !956, !957}
!1106 = !DILocation(line: 129, column: 20, scope: !1095, inlinedAt: !1100)
!1107 = !DILocation(line: 532, column: 39, scope: !1101)
!1108 = !DILocation(line: 536, column: 7, scope: !921)
!1109 = !DILocation(line: 537, column: 11, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !921, file: !852, line: 537, column: 9)
!1111 = !DILocation(line: 539, column: 6, scope: !921)
!1112 = !DILocation(line: 537, column: 9, scope: !921)
!1113 = distinct !{!1113, !867, !1114, !956, !957}
!1114 = !DILocation(line: 540, column: 3, scope: !851)
!1115 = !DILocation(line: 542, column: 1, scope: !851)
!1116 = !DILocation(line: 0, scope: !869)
!1117 = !DILocation(line: 226, column: 3, scope: !869)
!1118 = !DILocation(line: 227, column: 5, scope: !869)
!1119 = !DILocation(line: 229, column: 3, scope: !869)
!1120 = !DILocation(line: 237, column: 11, scope: !869)
!1121 = !DILocation(line: 242, column: 3, scope: !869)
!1122 = !DILocation(line: 243, column: 5, scope: !869)
!1123 = !DILocation(line: 245, column: 25, scope: !869)
!1124 = !DILocation(line: 246, column: 14, scope: !895)
!1125 = !DILocation(line: 246, column: 7, scope: !869)
!1126 = !DILocation(line: 248, column: 10, scope: !869)
!1127 = !DILocation(line: 249, column: 29, scope: !869)
!1128 = !DILocation(line: 249, column: 11, scope: !869)
!1129 = !DILocation(line: 250, column: 36, scope: !869)
!1130 = !DILocation(line: 250, column: 11, scope: !869)
!1131 = !DILocation(line: 249, column: 37, scope: !869)
!1132 = !DILocation(line: 251, column: 16, scope: !869)
!1133 = !DILocation(line: 252, column: 11, scope: !869)
!1134 = !DILocation(line: 252, column: 16, scope: !869)
!1135 = !DILocation(line: 253, column: 11, scope: !869)
!1136 = !DILocation(line: 253, column: 21, scope: !869)
!1137 = !DILocation(line: 254, column: 21, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !869, file: !852, line: 254, column: 7)
!1139 = !DILocation(line: 254, column: 7, scope: !869)
!1140 = !DILocation(line: 258, column: 9, scope: !869)
!1141 = !DILocation(line: 259, column: 12, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !869, file: !852, line: 259, column: 8)
!1143 = !DILocation(line: 259, column: 8, scope: !869)
!1144 = !DILocation(line: 260, column: 11, scope: !1142)
!1145 = !DILocation(line: 260, column: 5, scope: !1142)
!1146 = !DILocation(line: 268, column: 7, scope: !869)
!1147 = !DILocation(line: 268, column: 5, scope: !869)
!1148 = !DILocation(line: 269, column: 10, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !869, file: !852, line: 269, column: 8)
!1150 = !DILocation(line: 269, column: 27, scope: !1149)
!1151 = !DILocation(line: 304, column: 7, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1149, file: !852, line: 301, column: 5)
!1153 = !DILocation(line: 272, column: 47, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1149, file: !852, line: 270, column: 5)
!1155 = !DILocation(line: 272, column: 7, scope: !1154)
!1156 = !DILocation(line: 273, column: 7, scope: !1154)
!1157 = !DILocation(line: 273, column: 30, scope: !1154)
!1158 = !DILocation(line: 274, column: 7, scope: !1154)
!1159 = !DILocation(line: 275, column: 15, scope: !1154)
!1160 = !DILocation(line: 278, column: 19, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1154, file: !852, line: 278, column: 12)
!1162 = !DILocation(line: 278, column: 33, scope: !1161)
!1163 = !DILocation(line: 278, column: 12, scope: !1154)
!1164 = !DILocation(line: 279, column: 25, scope: !1161)
!1165 = !DILocation(line: 279, column: 18, scope: !1161)
!1166 = !DILocation(line: 279, column: 9, scope: !1161)
!1167 = !DILocation(line: 280, column: 17, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1154, file: !852, line: 280, column: 12)
!1169 = !DILocation(line: 280, column: 21, scope: !1168)
!1170 = !DILocation(line: 280, column: 12, scope: !1154)
!1171 = !DILocation(line: 281, column: 19, scope: !1168)
!1172 = !DILocation(line: 281, column: 10, scope: !1168)
!1173 = !DILocation(line: 282, column: 17, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1154, file: !852, line: 282, column: 12)
!1175 = !DILocation(line: 282, column: 23, scope: !1174)
!1176 = !DILocation(line: 282, column: 12, scope: !1154)
!1177 = !DILocation(line: 283, column: 20, scope: !1174)
!1178 = !DILocation(line: 283, column: 9, scope: !1174)
!1179 = !DILocation(line: 285, column: 37, scope: !1154)
!1180 = !DILocation(line: 284, column: 23, scope: !1154)
!1181 = !DILocation(line: 284, column: 15, scope: !1154)
!1182 = !DILocation(line: 284, column: 21, scope: !1154)
!1183 = !{!902, !905, i64 8}
!1184 = !DILocation(line: 285, column: 24, scope: !1154)
!1185 = !DILocation(line: 285, column: 15, scope: !1154)
!1186 = !DILocation(line: 285, column: 22, scope: !1154)
!1187 = !{!902, !905, i64 16}
!1188 = !DILocation(line: 288, column: 17, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1154, file: !852, line: 288, column: 12)
!1190 = !DILocation(line: 288, column: 21, scope: !1189)
!1191 = !DILocation(line: 288, column: 27, scope: !1189)
!1192 = !DILocation(line: 289, column: 16, scope: !1189)
!1193 = !DILocation(line: 289, column: 9, scope: !1189)
!1194 = !DILocation(line: 290, column: 27, scope: !1154)
!1195 = !DILocation(line: 290, column: 36, scope: !1154)
!1196 = !DILocation(line: 290, column: 19, scope: !1154)
!1197 = !DILocation(line: 290, column: 43, scope: !1154)
!1198 = !DILocation(line: 291, column: 67, scope: !1154)
!1199 = !DILocation(line: 291, column: 70, scope: !1154)
!1200 = !DILocation(line: 290, column: 15, scope: !1154)
!1201 = !DILocation(line: 290, column: 17, scope: !1154)
!1202 = !{!902, !905, i64 24}
!1203 = !DILocation(line: 292, column: 27, scope: !1154)
!1204 = !DILocation(line: 292, column: 36, scope: !1154)
!1205 = !DILocation(line: 292, column: 19, scope: !1154)
!1206 = !DILocation(line: 292, column: 43, scope: !1154)
!1207 = !DILocation(line: 293, column: 68, scope: !1154)
!1208 = !DILocation(line: 293, column: 71, scope: !1154)
!1209 = !DILocation(line: 292, column: 15, scope: !1154)
!1210 = !DILocation(line: 292, column: 17, scope: !1154)
!1211 = !{!902, !905, i64 32}
!1212 = !DILocation(line: 294, column: 22, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1154, file: !852, line: 294, column: 12)
!1214 = !DILocation(line: 294, column: 49, scope: !1213)
!1215 = !DILocation(line: 296, column: 16, scope: !1213)
!1216 = !DILocation(line: 296, column: 9, scope: !1213)
!1217 = !DILocation(line: 298, column: 8, scope: !1154)
!1218 = !DILocation(line: 299, column: 5, scope: !1154)
!1219 = !DILocation(line: 0, scope: !1152)
!1220 = !DILocation(line: 304, column: 15, scope: !1152)
!1221 = !DILocation(line: 304, column: 51, scope: !1152)
!1222 = !DILocation(line: 304, column: 57, scope: !1152)
!1223 = !DILocation(line: 305, column: 10, scope: !1152)
!1224 = distinct !{!1224, !1151, !1223, !956, !957}
!1225 = !DILocation(line: 306, column: 19, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1227, file: !852, line: 306, column: 7)
!1227 = distinct !DILexicalBlock(scope: !1152, file: !852, line: 306, column: 7)
!1228 = !DILocation(line: 306, column: 7, scope: !1227)
!1229 = !DILocation(line: 308, column: 9, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1226, file: !852, line: 307, column: 7)
!1231 = !DILocation(line: 309, column: 13, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1230, file: !852, line: 309, column: 13)
!1233 = !DILocation(line: 309, column: 20, scope: !1232)
!1234 = !DILocation(line: 309, column: 13, scope: !1230)
!1235 = !DILocation(line: 310, column: 26, scope: !1232)
!1236 = !DILocation(line: 310, column: 11, scope: !1232)
!1237 = !DILocation(line: 306, column: 27, scope: !1226)
!1238 = !DILocation(line: 306, column: 17, scope: !1226)
!1239 = distinct !{!1239, !1228, !1240, !956, !957}
!1240 = !DILocation(line: 311, column: 7, scope: !1227)
!1241 = !DILocation(line: 313, column: 53, scope: !1152)
!1242 = !DILocation(line: 313, column: 48, scope: !1152)
!1243 = !DILocation(line: 313, column: 39, scope: !1152)
!1244 = !DILocation(line: 313, column: 31, scope: !1152)
!1245 = !DILocation(line: 313, column: 37, scope: !1152)
!1246 = !DILocation(line: 313, column: 15, scope: !1152)
!1247 = !DILocation(line: 313, column: 21, scope: !1152)
!1248 = !DILocation(line: 314, column: 55, scope: !1152)
!1249 = !DILocation(line: 314, column: 58, scope: !1152)
!1250 = !DILocation(line: 314, column: 27, scope: !1152)
!1251 = !DILocation(line: 314, column: 29, scope: !1152)
!1252 = !DILocation(line: 314, column: 15, scope: !1152)
!1253 = !DILocation(line: 314, column: 17, scope: !1152)
!1254 = !DILocation(line: 316, column: 7, scope: !1152)
!1255 = !DILocation(line: 316, column: 15, scope: !1152)
!1256 = !DILocation(line: 316, column: 51, scope: !1152)
!1257 = !DILocation(line: 316, column: 57, scope: !1152)
!1258 = !DILocation(line: 317, column: 10, scope: !1152)
!1259 = distinct !{!1259, !1254, !1258, !956, !957}
!1260 = !DILocation(line: 321, column: 29, scope: !869)
!1261 = !DILocation(line: 321, column: 11, scope: !869)
!1262 = !DILocation(line: 321, column: 17, scope: !869)
!1263 = !{!902, !906, i64 40}
!1264 = !DILocation(line: 323, column: 22, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !869, file: !852, line: 323, column: 7)
!1266 = !DILocation(line: 323, column: 7, scope: !869)
!1267 = !DILocation(line: 324, column: 12, scope: !1265)
!1268 = !DILocation(line: 324, column: 5, scope: !1265)
!1269 = !DILocation(line: 325, column: 18, scope: !869)
!1270 = !{!902, !907, i64 48}
!1271 = !DILocation(line: 326, column: 18, scope: !869)
!1272 = !{!902, !907, i64 56}
!1273 = !DILocation(line: 327, column: 26, scope: !869)
!1274 = !DILocation(line: 328, column: 37, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !852, line: 328, column: 3)
!1276 = distinct !DILexicalBlock(scope: !869, file: !852, line: 328, column: 3)
!1277 = !DILocation(line: 328, column: 51, scope: !1275)
!1278 = !DILocation(line: 328, column: 42, scope: !1275)
!1279 = !DILocation(line: 328, column: 16, scope: !1275)
!1280 = !DILocation(line: 328, column: 60, scope: !1275)
!1281 = !DILocation(line: 328, column: 64, scope: !1275)
!1282 = !DILocation(line: 328, column: 66, scope: !1275)
!1283 = !DILocation(line: 328, column: 3, scope: !1276)
!1284 = !DILocation(line: 330, column: 5, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1275, file: !852, line: 329, column: 3)
!1286 = !DILocation(line: 331, column: 9, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1285, file: !852, line: 331, column: 9)
!1288 = !DILocation(line: 331, column: 16, scope: !1287)
!1289 = !DILocation(line: 331, column: 9, scope: !1285)
!1290 = !DILocation(line: 332, column: 22, scope: !1287)
!1291 = !DILocation(line: 332, column: 7, scope: !1287)
!1292 = !DILocation(line: 333, column: 13, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1285, file: !852, line: 333, column: 13)
!1294 = !DILocation(line: 333, column: 40, scope: !1293)
!1295 = !DILocation(line: 334, column: 9, scope: !1293)
!1296 = !DILocation(line: 334, column: 12, scope: !1293)
!1297 = !DILocation(line: 334, column: 37, scope: !1293)
!1298 = !DILocation(line: 333, column: 13, scope: !1285)
!1299 = !DILocation(line: 335, column: 15, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1293, file: !852, line: 334, column: 44)
!1301 = !DILocation(line: 335, column: 7, scope: !1300)
!1302 = !DILocation(line: 335, column: 25, scope: !1300)
!1303 = !{!907, !907, i64 0}
!1304 = !DILocation(line: 336, column: 5, scope: !1300)
!1305 = !DILocalVariable(name: "string", arg: 1, scope: !1306, file: !1307, line: 42, type: !1310)
!1306 = distinct !DISubprogram(name: "StringToDouble", scope: !1307, file: !1307, line: 42, type: !1308, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1312)
!1307 = !DIFile(filename: "apps/538.imagick_r/src/magick/string-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "af275f9a9b26a4e8bc1a481724207dee")
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!617, !1310, !1311}
!1310 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !591)
!1311 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !834)
!1312 = !{!1305, !1313}
!1313 = !DILocalVariable(name: "sentinal", arg: 2, scope: !1306, file: !1307, line: 43, type: !1311)
!1314 = !DILocation(line: 0, scope: !1306, inlinedAt: !1315)
!1315 = distinct !DILocation(line: 338, column: 27, scope: !1316)
!1316 = distinct !DILexicalBlock(scope: !1293, file: !852, line: 337, column: 10)
!1317 = !DILocation(line: 45, column: 10, scope: !1306, inlinedAt: !1315)
!1318 = !DILocation(line: 338, column: 15, scope: !1316)
!1319 = !DILocation(line: 338, column: 7, scope: !1316)
!1320 = !DILocation(line: 338, column: 25, scope: !1316)
!1321 = !DILocation(line: 339, column: 27, scope: !1316)
!1322 = !DILocation(line: 339, column: 7, scope: !1316)
!1323 = !DILocation(line: 0, scope: !1316)
!1324 = !DILocation(line: 342, column: 7, scope: !1316)
!1325 = !DILocalVariable(name: "x", arg: 1, scope: !1326, file: !852, line: 91, type: !1329)
!1326 = distinct !DISubprogram(name: "MagickMin", scope: !852, file: !852, line: 91, type: !1327, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1330)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!617, !1329, !1329}
!1329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!1330 = !{!1325, !1331}
!1331 = !DILocalVariable(name: "y", arg: 2, scope: !1326, file: !852, line: 91, type: !1329)
!1332 = !DILocation(line: 0, scope: !1326, inlinedAt: !1333)
!1333 = distinct !DILocation(line: 342, column: 7, scope: !1316)
!1334 = !DILocation(line: 93, column: 13, scope: !1326, inlinedAt: !1333)
!1335 = !DILocation(line: 93, column: 11, scope: !1326, inlinedAt: !1333)
!1336 = !DILocation(line: 343, column: 7, scope: !1316)
!1337 = !DILocalVariable(name: "x", arg: 1, scope: !1338, file: !852, line: 95, type: !1329)
!1338 = distinct !DISubprogram(name: "MagickMax", scope: !852, file: !852, line: 95, type: !1327, scopeLine: 96, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1339)
!1339 = !{!1337, !1340}
!1340 = !DILocalVariable(name: "y", arg: 2, scope: !1338, file: !852, line: 95, type: !1329)
!1341 = !DILocation(line: 0, scope: !1338, inlinedAt: !1342)
!1342 = distinct !DILocation(line: 343, column: 7, scope: !1316)
!1343 = !DILocation(line: 97, column: 13, scope: !1338, inlinedAt: !1342)
!1344 = !DILocation(line: 97, column: 11, scope: !1338, inlinedAt: !1342)
!1345 = !DILocation(line: 328, column: 75, scope: !1275)
!1346 = distinct !{!1346, !1283, !1347, !956, !957}
!1347 = !DILocation(line: 345, column: 3, scope: !1276)
!1348 = !DILocation(line: 0, scope: !1276)
!1349 = !DILocation(line: 348, column: 18, scope: !869)
!1350 = !DILocation(line: 348, column: 3, scope: !869)
!1351 = !DILocation(line: 349, column: 8, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !869, file: !852, line: 349, column: 8)
!1353 = !DILocation(line: 349, column: 23, scope: !1352)
!1354 = !DILocation(line: 350, column: 12, scope: !1352)
!1355 = !DILocation(line: 350, column: 5, scope: !1352)
!1356 = !DILocation(line: 362, column: 31, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !869, file: !852, line: 362, column: 8)
!1358 = !DILocation(line: 362, column: 45, scope: !1357)
!1359 = !DILocation(line: 362, column: 36, scope: !1357)
!1360 = !DILocation(line: 362, column: 10, scope: !1357)
!1361 = !DILocation(line: 362, column: 8, scope: !869)
!1362 = !DILocation(line: 363, column: 12, scope: !1357)
!1363 = !DILocation(line: 363, column: 5, scope: !1357)
!1364 = !DILocation(line: 367, column: 15, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !869, file: !852, line: 367, column: 7)
!1366 = !DILocation(line: 367, column: 23, scope: !1365)
!1367 = !DILocation(line: 367, column: 7, scope: !869)
!1368 = !DILocation(line: 368, column: 12, scope: !1365)
!1369 = !DILocation(line: 368, column: 5, scope: !1365)
!1370 = !DILocation(line: 370, column: 15, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !869, file: !852, line: 370, column: 8)
!1372 = !DILocation(line: 370, column: 28, scope: !1371)
!1373 = !DILocation(line: 370, column: 8, scope: !869)
!1374 = !DILocation(line: 371, column: 5, scope: !1371)
!1375 = !DILocation(line: 372, column: 20, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1371, file: !852, line: 372, column: 13)
!1377 = !DILocation(line: 372, column: 36, scope: !1376)
!1378 = !DILocation(line: 372, column: 13, scope: !1371)
!1379 = !DILocation(line: 373, column: 5, scope: !1376)
!1380 = !DILocation(line: 374, column: 20, scope: !1381)
!1381 = distinct !DILexicalBlock(scope: !1376, file: !852, line: 374, column: 13)
!1382 = !DILocation(line: 374, column: 33, scope: !1381)
!1383 = !DILocation(line: 374, column: 13, scope: !1376)
!1384 = !DILocation(line: 375, column: 5, scope: !1381)
!1385 = !DILocation(line: 378, column: 1, scope: !869)
!1386 = !DISubprogram(name: "GetMagickToken", scope: !1387, file: !1387, line: 45, type: !1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1391)
!1387 = !DIFile(filename: "apps/538.imagick_r/src/magick/token.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f90c1544ca665b41425c6912f2cbc1e4")
!1388 = !DISubroutineType(types: !1389)
!1389 = !{null, !591, !1390, !626}
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!1391 = !{}
!1392 = distinct !DISubprogram(name: "DestroyKernelInfo", scope: !852, file: !852, line: 2250, type: !1096, scopeLine: 2251, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1393)
!1393 = !{!1394}
!1394 = !DILocalVariable(name: "kernel", arg: 1, scope: !1392, file: !852, line: 2250, type: !597)
!1395 = !DILocation(line: 0, scope: !1392)
!1396 = !DILocation(line: 2253, column: 15, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !1392, file: !852, line: 2253, column: 7)
!1398 = !DILocation(line: 2253, column: 20, scope: !1397)
!1399 = !DILocation(line: 2253, column: 7, scope: !1392)
!1400 = !DILocation(line: 2254, column: 18, scope: !1397)
!1401 = !DILocation(line: 2254, column: 17, scope: !1397)
!1402 = !DILocation(line: 2254, column: 5, scope: !1397)
!1403 = !DILocation(line: 2255, column: 61, scope: !1392)
!1404 = !DILocation(line: 2255, column: 29, scope: !1392)
!1405 = !DILocation(line: 2255, column: 17, scope: !1392)
!1406 = !DILocation(line: 2256, column: 25, scope: !1392)
!1407 = !DILocation(line: 2257, column: 3, scope: !1392)
!1408 = distinct !DISubprogram(name: "AcquireKernelBuiltIn", scope: !852, file: !852, line: 948, type: !1409, scopeLine: 950, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1414)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!597, !1411, !1412}
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !880)
!1414 = !{!1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1425, !1426, !1427, !1428, !1429, !1431, !1432, !1433, !1435, !1436, !1438, !1442, !1444, !1446, !1448, !1449, !1450, !1456, !1460, !1462, !1464, !1471}
!1415 = !DILocalVariable(name: "type", arg: 1, scope: !1408, file: !852, line: 948, type: !1411)
!1416 = !DILocalVariable(name: "args", arg: 2, scope: !1408, file: !852, line: 949, type: !1412)
!1417 = !DILocalVariable(name: "kernel", scope: !1408, file: !852, line: 952, type: !597)
!1418 = !DILocalVariable(name: "i", scope: !1408, file: !852, line: 955, type: !609)
!1419 = !DILocalVariable(name: "u", scope: !1408, file: !852, line: 958, type: !609)
!1420 = !DILocalVariable(name: "v", scope: !1408, file: !852, line: 959, type: !609)
!1421 = !DILocalVariable(name: "nan", scope: !1408, file: !852, line: 962, type: !617)
!1422 = !DILocalVariable(name: "sigma", scope: !1423, file: !852, line: 1046, type: !617)
!1423 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1045, column: 7)
!1424 = distinct !DILexicalBlock(scope: !1408, file: !852, line: 1026, column: 16)
!1425 = !DILocalVariable(name: "sigma2", scope: !1423, file: !852, line: 1047, type: !617)
!1426 = !DILocalVariable(name: "A", scope: !1423, file: !852, line: 1048, type: !617)
!1427 = !DILocalVariable(name: "B", scope: !1423, file: !852, line: 1048, type: !617)
!1428 = !DILocalVariable(name: "R", scope: !1423, file: !852, line: 1048, type: !617)
!1429 = !DILocalVariable(name: "sigma", scope: !1430, file: !852, line: 1138, type: !617)
!1430 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1137, column: 7)
!1431 = !DILocalVariable(name: "alpha", scope: !1430, file: !852, line: 1139, type: !617)
!1432 = !DILocalVariable(name: "beta", scope: !1430, file: !852, line: 1139, type: !617)
!1433 = !DILocalVariable(name: "sigma", scope: !1434, file: !852, line: 1225, type: !617)
!1434 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1224, column: 7)
!1435 = !DILocalVariable(name: "A", scope: !1434, file: !852, line: 1226, type: !617)
!1436 = !DILocalVariable(name: "order_f", scope: !1437, file: !852, line: 1294, type: !604)
!1437 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1292, column: 7)
!1438 = !DILocalVariable(name: "alpha", scope: !1439, file: !852, line: 1312, type: !604)
!1439 = distinct !DILexicalBlock(scope: !1440, file: !852, line: 1311, column: 11)
!1440 = distinct !DILexicalBlock(scope: !1441, file: !852, line: 1310, column: 9)
!1441 = distinct !DILexicalBlock(scope: !1437, file: !852, line: 1310, column: 9)
!1442 = !DILocalVariable(name: "scale", scope: !1443, file: !852, line: 1554, type: !617)
!1443 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1553, column: 7)
!1444 = !DILocalVariable(name: "limit", scope: !1445, file: !852, line: 1616, type: !609)
!1445 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1614, column: 9)
!1446 = !DILocalVariable(name: "limit1", scope: !1447, file: !852, line: 1687, type: !609)
!1447 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1685, column: 9)
!1448 = !DILocalVariable(name: "limit2", scope: !1447, file: !852, line: 1688, type: !609)
!1449 = !DILocalVariable(name: "scale", scope: !1447, file: !852, line: 1689, type: !609)
!1450 = !DILocalVariable(name: "radius", scope: !1451, file: !852, line: 1717, type: !609)
!1451 = distinct !DILexicalBlock(scope: !1452, file: !852, line: 1717, column: 15)
!1452 = distinct !DILexicalBlock(scope: !1453, file: !852, line: 1716, column: 13)
!1453 = distinct !DILexicalBlock(scope: !1454, file: !852, line: 1716, column: 13)
!1454 = distinct !DILexicalBlock(scope: !1455, file: !852, line: 1715, column: 11)
!1455 = distinct !DILexicalBlock(scope: !1447, file: !852, line: 1715, column: 11)
!1456 = !DILocalVariable(name: "new_kernel", scope: !1457, file: !852, line: 1756, type: !597)
!1457 = distinct !DILexicalBlock(scope: !1458, file: !852, line: 1755, column: 15)
!1458 = distinct !DILexicalBlock(scope: !1459, file: !852, line: 1752, column: 38)
!1459 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1751, column: 9)
!1460 = !DILocalVariable(name: "new_kernel", scope: !1461, file: !852, line: 1849, type: !597)
!1461 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1847, column: 9)
!1462 = !DILocalVariable(name: "new_kernel", scope: !1463, file: !852, line: 1916, type: !597)
!1463 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1914, column: 9)
!1464 = !DILocalVariable(name: "r1", scope: !1465, file: !852, line: 2127, type: !617)
!1465 = distinct !DILexicalBlock(scope: !1466, file: !852, line: 2125, column: 13)
!1466 = distinct !DILexicalBlock(scope: !1467, file: !852, line: 2124, column: 11)
!1467 = distinct !DILexicalBlock(scope: !1468, file: !852, line: 2124, column: 11)
!1468 = distinct !DILexicalBlock(scope: !1469, file: !852, line: 2123, column: 9)
!1469 = distinct !DILexicalBlock(scope: !1470, file: !852, line: 2123, column: 9)
!1470 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 2111, column: 7)
!1471 = !DILocalVariable(name: "r2", scope: !1465, file: !852, line: 2128, type: !617)
!1472 = !DILocation(line: 0, scope: !1408)
!1473 = !DILocation(line: 962, column: 11, scope: !1408)
!1474 = !DILocation(line: 966, column: 3, scope: !1408)
!1475 = !DILocation(line: 1014, column: 29, scope: !1476)
!1476 = distinct !DILexicalBlock(scope: !1408, file: !852, line: 966, column: 16)
!1477 = !DILocation(line: 1015, column: 18, scope: !1478)
!1478 = distinct !DILexicalBlock(scope: !1476, file: !852, line: 1015, column: 11)
!1479 = !DILocation(line: 1015, column: 11, scope: !1476)
!1480 = !DILocation(line: 1017, column: 14, scope: !1476)
!1481 = !DILocation(line: 1018, column: 15, scope: !1476)
!1482 = !DILocation(line: 1018, column: 41, scope: !1476)
!1483 = !DILocation(line: 1020, column: 20, scope: !1476)
!1484 = !DILocation(line: 1021, column: 15, scope: !1476)
!1485 = !DILocation(line: 1021, column: 20, scope: !1476)
!1486 = !DILocation(line: 1022, column: 15, scope: !1476)
!1487 = !DILocation(line: 1022, column: 25, scope: !1476)
!1488 = !DILocation(line: 1023, column: 7, scope: !1476)
!1489 = !DILocation(line: 1026, column: 3, scope: !1408)
!1490 = !DILocation(line: 1032, column: 34, scope: !1491)
!1491 = distinct !DILexicalBlock(scope: !1424, file: !852, line: 1031, column: 7)
!1492 = !DILocation(line: 1032, column: 40, scope: !1491)
!1493 = !DILocation(line: 1032, column: 17, scope: !1491)
!1494 = !DILocation(line: 1032, column: 24, scope: !1491)
!1495 = !DILocation(line: 1033, column: 17, scope: !1491)
!1496 = !DILocation(line: 1033, column: 19, scope: !1491)
!1497 = !DILocation(line: 1034, column: 35, scope: !1491)
!1498 = !DILocation(line: 1034, column: 17, scope: !1491)
!1499 = !DILocation(line: 1034, column: 23, scope: !1491)
!1500 = !DILocation(line: 1036, column: 28, scope: !1501)
!1501 = distinct !DILexicalBlock(scope: !1491, file: !852, line: 1036, column: 13)
!1502 = !DILocation(line: 1036, column: 13, scope: !1491)
!1503 = !DILocation(line: 1037, column: 18, scope: !1501)
!1504 = !DILocation(line: 1037, column: 11, scope: !1501)
!1505 = !DILocation(line: 1038, column: 53, scope: !1491)
!1506 = !DILocation(line: 1038, column: 45, scope: !1491)
!1507 = !DILocation(line: 1038, column: 17, scope: !1491)
!1508 = !DILocation(line: 1038, column: 25, scope: !1491)
!1509 = !DILocation(line: 1039, column: 9, scope: !1491)
!1510 = !DILocation(line: 1046, column: 30, scope: !1423)
!1511 = !DILocation(line: 1046, column: 19, scope: !1423)
!1512 = !DILocation(line: 0, scope: !1423)
!1513 = !DILocation(line: 1047, column: 31, scope: !1423)
!1514 = !DILocation(line: 1047, column: 20, scope: !1423)
!1515 = !DILocation(line: 1050, column: 20, scope: !1516)
!1516 = distinct !DILexicalBlock(scope: !1423, file: !852, line: 1050, column: 14)
!1517 = !DILocation(line: 1050, column: 24, scope: !1516)
!1518 = !DILocation(line: 1050, column: 14, scope: !1423)
!1519 = !DILocation(line: 1051, column: 27, scope: !1516)
!1520 = !DILocation(line: 1051, column: 44, scope: !1516)
!1521 = !DILocation(line: 1051, column: 46, scope: !1516)
!1522 = !DILocation(line: 1051, column: 11, scope: !1516)
!1523 = !DILocation(line: 1052, column: 25, scope: !1524)
!1524 = distinct !DILexicalBlock(scope: !1516, file: !852, line: 1052, column: 19)
!1525 = !DILocation(line: 1052, column: 39, scope: !1524)
!1526 = !DILocation(line: 1053, column: 27, scope: !1524)
!1527 = !DILocation(line: 1053, column: 11, scope: !1524)
!1528 = !DILocation(line: 1055, column: 27, scope: !1524)
!1529 = !DILocation(line: 0, scope: !1516)
!1530 = !DILocation(line: 1056, column: 17, scope: !1423)
!1531 = !DILocation(line: 1056, column: 24, scope: !1423)
!1532 = !DILocation(line: 1057, column: 57, scope: !1423)
!1533 = !DILocation(line: 1057, column: 60, scope: !1423)
!1534 = !DILocation(line: 1057, column: 29, scope: !1423)
!1535 = !DILocation(line: 1057, column: 31, scope: !1423)
!1536 = !DILocation(line: 1057, column: 17, scope: !1423)
!1537 = !DILocation(line: 1057, column: 19, scope: !1423)
!1538 = !DILocation(line: 1058, column: 35, scope: !1423)
!1539 = !DILocation(line: 1058, column: 17, scope: !1423)
!1540 = !DILocation(line: 1058, column: 23, scope: !1423)
!1541 = !DILocation(line: 1060, column: 28, scope: !1542)
!1542 = distinct !DILexicalBlock(scope: !1423, file: !852, line: 1060, column: 13)
!1543 = !DILocation(line: 1060, column: 13, scope: !1423)
!1544 = !DILocation(line: 1061, column: 18, scope: !1542)
!1545 = !DILocation(line: 1070, column: 37, scope: !1546)
!1546 = distinct !DILexicalBlock(scope: !1423, file: !852, line: 1070, column: 14)
!1547 = !DILocation(line: 1072, column: 24, scope: !1548)
!1548 = distinct !DILexicalBlock(scope: !1549, file: !852, line: 1072, column: 18)
!1549 = distinct !DILexicalBlock(scope: !1546, file: !852, line: 1071, column: 11)
!1550 = !DILocation(line: 1072, column: 18, scope: !1549)
!1551 = !DILocation(line: 1073, column: 29, scope: !1552)
!1552 = distinct !DILexicalBlock(scope: !1548, file: !852, line: 1073, column: 15)
!1553 = !DILocation(line: 1073, column: 35, scope: !1552)
!1554 = !DILocation(line: 1073, column: 24, scope: !1552)
!1555 = !DILocation(line: 1074, column: 45, scope: !1552)
!1556 = !DILocation(line: 1074, column: 51, scope: !1552)
!1557 = !DILocation(line: 1074, column: 34, scope: !1552)
!1558 = !DILocation(line: 1075, column: 39, scope: !1559)
!1559 = distinct !DILexicalBlock(scope: !1552, file: !852, line: 1075, column: 17)
!1560 = !DILocation(line: 1075, column: 44, scope: !1561)
!1561 = distinct !DILexicalBlock(scope: !1559, file: !852, line: 1075, column: 17)
!1562 = !DILocation(line: 1075, column: 17, scope: !1559)
!1563 = !DILocation(line: 1075, column: 30, scope: !1559)
!1564 = !DILocation(line: 1076, column: 36, scope: !1565)
!1565 = distinct !DILexicalBlock(scope: !1561, file: !852, line: 1076, column: 19)
!1566 = !DILocation(line: 1076, column: 41, scope: !1567)
!1567 = distinct !DILexicalBlock(scope: !1565, file: !852, line: 1076, column: 19)
!1568 = !DILocation(line: 1076, column: 19, scope: !1565)
!1569 = !DILocation(line: 1076, column: 27, scope: !1565)
!1570 = !DILocation(line: 1077, column: 59, scope: !1567)
!1571 = !DILocation(line: 1077, column: 61, scope: !1567)
!1572 = !DILocation(line: 1077, column: 49, scope: !1567)
!1573 = !DILocation(line: 1077, column: 47, scope: !1567)
!1574 = !DILocation(line: 1077, column: 67, scope: !1567)
!1575 = !DILocation(line: 1077, column: 43, scope: !1567)
!1576 = !DILocation(line: 1077, column: 70, scope: !1567)
!1577 = !DILocation(line: 1077, column: 31, scope: !1567)
!1578 = !DILocation(line: 1077, column: 23, scope: !1567)
!1579 = !DILocation(line: 1077, column: 41, scope: !1567)
!1580 = !DILocation(line: 1076, column: 65, scope: !1567)
!1581 = !DILocation(line: 1076, column: 70, scope: !1567)
!1582 = !DILocation(line: 1076, column: 61, scope: !1567)
!1583 = distinct !{!1583, !1568, !1584, !956, !957}
!1584 = !DILocation(line: 1077, column: 71, scope: !1565)
!1585 = !DILocation(line: 1075, column: 64, scope: !1561)
!1586 = !DILocation(line: 1075, column: 68, scope: !1561)
!1587 = !DILocation(line: 0, scope: !1559)
!1588 = distinct !{!1588, !1562, !1589, !956, !957}
!1589 = !DILocation(line: 1077, column: 71, scope: !1559)
!1590 = !DILocation(line: 1081, column: 27, scope: !1591)
!1591 = distinct !DILexicalBlock(scope: !1548, file: !852, line: 1080, column: 15)
!1592 = !DILocation(line: 1081, column: 41, scope: !1591)
!1593 = !DILocation(line: 1081, column: 32, scope: !1591)
!1594 = !DILocation(line: 1081, column: 47, scope: !1591)
!1595 = !DILocation(line: 1080, column: 24, scope: !1591)
!1596 = !DILocation(line: 1082, column: 25, scope: !1591)
!1597 = !DILocation(line: 1082, column: 40, scope: !1591)
!1598 = !DILocation(line: 1082, column: 50, scope: !1591)
!1599 = !DILocation(line: 1082, column: 60, scope: !1591)
!1600 = !DILocation(line: 1082, column: 51, scope: !1591)
!1601 = !DILocation(line: 1082, column: 41, scope: !1591)
!1602 = !DILocation(line: 1082, column: 17, scope: !1591)
!1603 = !DILocation(line: 1082, column: 67, scope: !1591)
!1604 = !DILocation(line: 1086, column: 14, scope: !1423)
!1605 = !DILocation(line: 1088, column: 25, scope: !1606)
!1606 = distinct !DILexicalBlock(scope: !1607, file: !852, line: 1088, column: 18)
!1607 = distinct !DILexicalBlock(scope: !1608, file: !852, line: 1087, column: 11)
!1608 = distinct !DILexicalBlock(scope: !1423, file: !852, line: 1086, column: 14)
!1609 = !DILocation(line: 1088, column: 18, scope: !1607)
!1610 = !DILocation(line: 1090, column: 29, scope: !1611)
!1611 = distinct !DILexicalBlock(scope: !1606, file: !852, line: 1089, column: 15)
!1612 = !DILocation(line: 1090, column: 35, scope: !1611)
!1613 = !DILocation(line: 1090, column: 24, scope: !1611)
!1614 = !DILocation(line: 1091, column: 45, scope: !1611)
!1615 = !DILocation(line: 1091, column: 51, scope: !1611)
!1616 = !DILocation(line: 1091, column: 34, scope: !1611)
!1617 = !DILocation(line: 1092, column: 39, scope: !1618)
!1618 = distinct !DILexicalBlock(scope: !1611, file: !852, line: 1092, column: 17)
!1619 = !DILocation(line: 1092, column: 44, scope: !1620)
!1620 = distinct !DILexicalBlock(scope: !1618, file: !852, line: 1092, column: 17)
!1621 = !DILocation(line: 1092, column: 17, scope: !1618)
!1622 = !DILocation(line: 1092, column: 30, scope: !1618)
!1623 = !DILocation(line: 1093, column: 36, scope: !1624)
!1624 = distinct !DILexicalBlock(scope: !1620, file: !852, line: 1093, column: 19)
!1625 = !DILocation(line: 1093, column: 41, scope: !1626)
!1626 = distinct !DILexicalBlock(scope: !1624, file: !852, line: 1093, column: 19)
!1627 = !DILocation(line: 1093, column: 19, scope: !1624)
!1628 = !DILocation(line: 1093, column: 27, scope: !1624)
!1629 = !DILocation(line: 1094, column: 58, scope: !1626)
!1630 = !DILocation(line: 1094, column: 60, scope: !1626)
!1631 = !DILocation(line: 1094, column: 48, scope: !1626)
!1632 = !DILocation(line: 1094, column: 46, scope: !1626)
!1633 = !DILocation(line: 1094, column: 66, scope: !1626)
!1634 = !DILocation(line: 1094, column: 42, scope: !1626)
!1635 = !DILocation(line: 1094, column: 29, scope: !1626)
!1636 = !DILocation(line: 1094, column: 21, scope: !1626)
!1637 = !DILocation(line: 1094, column: 39, scope: !1626)
!1638 = !DILocation(line: 1093, column: 65, scope: !1626)
!1639 = !DILocation(line: 1093, column: 70, scope: !1626)
!1640 = !DILocation(line: 1093, column: 61, scope: !1626)
!1641 = distinct !{!1641, !1627, !1642, !956, !957}
!1642 = !DILocation(line: 1094, column: 70, scope: !1624)
!1643 = !DILocation(line: 1092, column: 64, scope: !1620)
!1644 = !DILocation(line: 1092, column: 68, scope: !1620)
!1645 = !DILocation(line: 0, scope: !1618)
!1646 = distinct !{!1646, !1621, !1647, !956, !957}
!1647 = !DILocation(line: 1094, column: 70, scope: !1618)
!1648 = !DILocation(line: 1097, column: 38, scope: !1606)
!1649 = !DILocation(line: 1097, column: 48, scope: !1606)
!1650 = !DILocation(line: 1097, column: 58, scope: !1606)
!1651 = !DILocation(line: 1097, column: 49, scope: !1606)
!1652 = !DILocation(line: 1097, column: 39, scope: !1606)
!1653 = !DILocation(line: 1097, column: 15, scope: !1606)
!1654 = !DILocation(line: 1097, column: 65, scope: !1606)
!1655 = !DILocation(line: 1100, column: 14, scope: !1423)
!1656 = !DILocation(line: 1100, column: 19, scope: !1657)
!1657 = distinct !DILexicalBlock(scope: !1423, file: !852, line: 1100, column: 14)
!1658 = !DILocation(line: 1102, column: 24, scope: !1659)
!1659 = distinct !DILexicalBlock(scope: !1660, file: !852, line: 1102, column: 18)
!1660 = distinct !DILexicalBlock(scope: !1657, file: !852, line: 1101, column: 11)
!1661 = !DILocation(line: 1102, column: 18, scope: !1660)
!1662 = !DILocation(line: 1103, column: 29, scope: !1663)
!1663 = distinct !DILexicalBlock(scope: !1659, file: !852, line: 1103, column: 15)
!1664 = !DILocation(line: 1103, column: 35, scope: !1663)
!1665 = !DILocation(line: 1103, column: 24, scope: !1663)
!1666 = !DILocation(line: 1104, column: 44, scope: !1663)
!1667 = !DILocation(line: 1104, column: 50, scope: !1663)
!1668 = !DILocation(line: 1104, column: 56, scope: !1663)
!1669 = !DILocation(line: 1104, column: 62, scope: !1663)
!1670 = !DILocation(line: 1104, column: 34, scope: !1663)
!1671 = !DILocation(line: 1105, column: 39, scope: !1672)
!1672 = distinct !DILexicalBlock(scope: !1663, file: !852, line: 1105, column: 17)
!1673 = !DILocation(line: 1105, column: 44, scope: !1674)
!1674 = distinct !DILexicalBlock(scope: !1672, file: !852, line: 1105, column: 17)
!1675 = !DILocation(line: 1105, column: 17, scope: !1672)
!1676 = !DILocation(line: 1105, column: 30, scope: !1672)
!1677 = !DILocation(line: 1106, column: 36, scope: !1678)
!1678 = distinct !DILexicalBlock(scope: !1674, file: !852, line: 1106, column: 19)
!1679 = !DILocation(line: 1106, column: 41, scope: !1680)
!1680 = distinct !DILexicalBlock(scope: !1678, file: !852, line: 1106, column: 19)
!1681 = !DILocation(line: 1106, column: 19, scope: !1678)
!1682 = !DILocation(line: 1106, column: 27, scope: !1678)
!1683 = !DILocation(line: 1107, column: 38, scope: !1684)
!1684 = distinct !DILexicalBlock(scope: !1680, file: !852, line: 1107, column: 21)
!1685 = !DILocation(line: 1107, column: 40, scope: !1684)
!1686 = !DILocation(line: 1107, column: 28, scope: !1684)
!1687 = !DILocation(line: 1107, column: 46, scope: !1684)
!1688 = !DILocation(line: 1108, column: 45, scope: !1684)
!1689 = !DILocation(line: 1108, column: 53, scope: !1684)
!1690 = !DILocation(line: 1108, column: 49, scope: !1684)
!1691 = !DILocation(line: 1108, column: 48, scope: !1684)
!1692 = !DILocation(line: 1108, column: 56, scope: !1684)
!1693 = !DILocation(line: 1108, column: 31, scope: !1684)
!1694 = !DILocation(line: 1108, column: 23, scope: !1684)
!1695 = !DILocation(line: 1108, column: 41, scope: !1684)
!1696 = !DILocation(line: 1106, column: 65, scope: !1680)
!1697 = !DILocation(line: 1106, column: 70, scope: !1680)
!1698 = !DILocation(line: 1106, column: 61, scope: !1680)
!1699 = distinct !{!1699, !1681, !1700, !956, !957}
!1700 = !DILocation(line: 1109, column: 21, scope: !1678)
!1701 = !DILocation(line: 1105, column: 64, scope: !1674)
!1702 = !DILocation(line: 1105, column: 68, scope: !1674)
!1703 = !DILocation(line: 0, scope: !1672)
!1704 = distinct !{!1704, !1675, !1705, !956, !957}
!1705 = !DILocation(line: 1109, column: 21, scope: !1672)
!1706 = !DILocation(line: 1113, column: 27, scope: !1707)
!1707 = distinct !DILexicalBlock(scope: !1659, file: !852, line: 1112, column: 15)
!1708 = !DILocation(line: 1113, column: 41, scope: !1707)
!1709 = !DILocation(line: 1113, column: 32, scope: !1707)
!1710 = !DILocation(line: 1113, column: 47, scope: !1707)
!1711 = !DILocation(line: 1112, column: 24, scope: !1707)
!1712 = !DILocation(line: 1114, column: 25, scope: !1707)
!1713 = !DILocation(line: 1114, column: 40, scope: !1707)
!1714 = !DILocation(line: 1114, column: 50, scope: !1707)
!1715 = !DILocation(line: 1114, column: 60, scope: !1707)
!1716 = !DILocation(line: 1114, column: 51, scope: !1707)
!1717 = !DILocation(line: 1114, column: 41, scope: !1707)
!1718 = !DILocation(line: 1114, column: 17, scope: !1707)
!1719 = !DILocation(line: 1114, column: 67, scope: !1707)
!1720 = !DILocalVariable(name: "kernel", arg: 1, scope: !1721, file: !852, line: 2456, type: !597)
!1721 = distinct !DISubprogram(name: "CalcKernelMetaData", scope: !852, file: !852, line: 2456, type: !1722, scopeLine: 2457, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1724)
!1722 = !DISubroutineType(types: !1723)
!1723 = !{null, !597}
!1724 = !{!1720, !1725}
!1725 = !DILocalVariable(name: "i", scope: !1721, file: !852, line: 2459, type: !604)
!1726 = !DILocation(line: 0, scope: !1721, inlinedAt: !1727)
!1727 = distinct !DILocation(line: 1131, column: 9, scope: !1423)
!1728 = !DILocation(line: 2461, column: 29, scope: !1721, inlinedAt: !1727)
!1729 = !DILocation(line: 2461, column: 11, scope: !1721, inlinedAt: !1727)
!1730 = !DILocation(line: 2462, column: 36, scope: !1721, inlinedAt: !1727)
!1731 = !DILocation(line: 2462, column: 11, scope: !1721, inlinedAt: !1727)
!1732 = !DILocation(line: 2461, column: 19, scope: !1721, inlinedAt: !1727)
!1733 = !DILocation(line: 2463, column: 15, scope: !1734, inlinedAt: !1727)
!1734 = distinct !DILexicalBlock(scope: !1735, file: !852, line: 2463, column: 3)
!1735 = distinct !DILexicalBlock(scope: !1721, file: !852, line: 2463, column: 3)
!1736 = !DILocation(line: 2463, column: 3, scope: !1735, inlinedAt: !1727)
!1737 = !DILocation(line: 2465, column: 17, scope: !1738, inlinedAt: !1727)
!1738 = distinct !DILexicalBlock(scope: !1739, file: !852, line: 2465, column: 12)
!1739 = distinct !DILexicalBlock(scope: !1734, file: !852, line: 2464, column: 5)
!1740 = !DILocation(line: 2465, column: 12, scope: !1738, inlinedAt: !1727)
!1741 = !DILocation(line: 2465, column: 36, scope: !1738, inlinedAt: !1727)
!1742 = !DILocation(line: 2465, column: 12, scope: !1739, inlinedAt: !1727)
!1743 = !DILocation(line: 2466, column: 27, scope: !1738, inlinedAt: !1727)
!1744 = !DILocation(line: 2469, column: 39, scope: !1739, inlinedAt: !1727)
!1745 = !{!902, !907, i64 72}
!1746 = !DILocation(line: 2470, column: 7, scope: !1739, inlinedAt: !1727)
!1747 = !DILocation(line: 2471, column: 7, scope: !1739, inlinedAt: !1727)
!1748 = !DILocation(line: 2467, column: 7, scope: !1739, inlinedAt: !1727)
!1749 = !DILocation(line: 2467, column: 27, scope: !1739, inlinedAt: !1727)
!1750 = !DILocation(line: 2468, column: 39, scope: !1739, inlinedAt: !1727)
!1751 = !{!902, !907, i64 64}
!1752 = !DILocation(line: 0, scope: !1326, inlinedAt: !1753)
!1753 = distinct !DILocation(line: 2470, column: 7, scope: !1739, inlinedAt: !1727)
!1754 = !DILocation(line: 93, column: 13, scope: !1326, inlinedAt: !1753)
!1755 = !DILocation(line: 93, column: 11, scope: !1326, inlinedAt: !1753)
!1756 = !DILocation(line: 0, scope: !1338, inlinedAt: !1757)
!1757 = distinct !DILocation(line: 2471, column: 7, scope: !1739, inlinedAt: !1727)
!1758 = !DILocation(line: 97, column: 13, scope: !1338, inlinedAt: !1757)
!1759 = !DILocation(line: 97, column: 11, scope: !1338, inlinedAt: !1757)
!1760 = !DILocation(line: 2463, column: 50, scope: !1734, inlinedAt: !1727)
!1761 = distinct !{!1761, !1736, !1762, !956, !957}
!1762 = !DILocation(line: 2472, column: 5, scope: !1735, inlinedAt: !1727)
!1763 = !DILocation(line: 1132, column: 9, scope: !1423)
!1764 = !DILocation(line: 1138, column: 30, scope: !1430)
!1765 = !DILocation(line: 1138, column: 19, scope: !1430)
!1766 = !DILocation(line: 0, scope: !1430)
!1767 = !DILocation(line: 1141, column: 20, scope: !1768)
!1768 = distinct !DILexicalBlock(scope: !1430, file: !852, line: 1141, column: 14)
!1769 = !DILocation(line: 1141, column: 24, scope: !1768)
!1770 = !DILocation(line: 1141, column: 14, scope: !1430)
!1771 = !DILocation(line: 1142, column: 27, scope: !1768)
!1772 = !DILocation(line: 1142, column: 44, scope: !1768)
!1773 = !DILocation(line: 1142, column: 46, scope: !1768)
!1774 = !DILocation(line: 1142, column: 11, scope: !1768)
!1775 = !DILocation(line: 1144, column: 27, scope: !1768)
!1776 = !DILocation(line: 0, scope: !1768)
!1777 = !DILocation(line: 1144, column: 19, scope: !1768)
!1778 = !DILocation(line: 1144, column: 25, scope: !1768)
!1779 = !DILocation(line: 1145, column: 17, scope: !1430)
!1780 = !DILocation(line: 1145, column: 24, scope: !1430)
!1781 = !DILocation(line: 1146, column: 45, scope: !1430)
!1782 = !DILocation(line: 1146, column: 48, scope: !1430)
!1783 = !DILocation(line: 1146, column: 17, scope: !1430)
!1784 = !DILocation(line: 1146, column: 19, scope: !1430)
!1785 = !DILocation(line: 1147, column: 17, scope: !1430)
!1786 = !DILocation(line: 1147, column: 19, scope: !1430)
!1787 = !DILocation(line: 1148, column: 17, scope: !1430)
!1788 = !DILocation(line: 1148, column: 57, scope: !1430)
!1789 = !DILocation(line: 1149, column: 35, scope: !1430)
!1790 = !DILocation(line: 1149, column: 17, scope: !1430)
