; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/common/mvpred.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/mvpred.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [129 x ptr], i32, i32, i32, i32, i32, %struct.anon.2, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [92 x ptr], [92 x [4 x ptr]], ptr, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, ptr, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], ptr, [2 x [3 x ptr]], [2 x ptr], [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], ptr, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, ptr, [8 x i8] }

!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !72, line: 24, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !74, line: 38, baseType: !86)
!86 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!87 = !{!88}
!88 = !DISubrange(count: 4)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !80)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !94, line: 25, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !74, line: 39, baseType: !96)
!96 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union16_t", file: !28, line: 88, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 88, size: 16, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !99, file: !28, line: 88, baseType: !77, size: 16)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !99, file: !28, line: 88, baseType: !103, size: 16)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 16, elements: !80)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !28, line: 90, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 90, size: 64, elements: !107)
!107 = !{!108, !112, !114, !116}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !106, file: !28, line: 90, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !72, line: 27, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !74, line: 45, baseType: !111)
!111 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !106, file: !28, line: 90, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !80)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !106, file: !28, line: 90, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !87)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !106, file: !28, line: 90, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 8)
!120 = !{!0}
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 864, elements: !124)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !{!125}
!125 = !DISubrange(count: 27)
!126 = !{i32 7, !"Dwarf Version", i32 5}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{i32 1, !"wchar_size", i32 4}
!129 = !{i32 7, !"PIC Level", i32 2}
!130 = !{i32 7, !"PIE Level", i32 2}
!131 = !{i32 7, !"uwtable", i32 2}
!132 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!133 = distinct !DISubprogram(name: "x264_mb_predict_mv", scope: !134, file: !134, line: 27, type: !135, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1425)
!134 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mvpred.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3012a7d0e2b81d922088fb8c07eaaf20")
!135 = !DISubroutineType(types: !136)
!136 = !{null, !137, !123, !123, !123, !844}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !139, line: 46, baseType: !140)
!139 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !28, line: 381, size: 266752, elements: !141)
!141 = !{!142, !310, !314, !315, !316, !317, !318, !319, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !455, !457, !485, !487, !488, !489, !493, !497, !498, !499, !503, !507, !508, !509, !514, !517, !518, !591, !608, !769, !770, !771, !772, !776, !777, !778, !779, !780, !781, !782, !797, !990, !994, !1055, !1058, !1060, !1061, !1062, !1065, !1070, !1079, !1080, !1088, !1090, !1095, !1171, !1257, !1301, !1323, !1372, !1401}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !140, file: !28, line: 384, baseType: !143, size: 5632)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !139, line: 376, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !139, line: 176, size: 5632, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !189, !193, !194, !195, !196, !200, !201, !215, !216, !217, !218, !219, !248, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !144, file: !139, line: 179, baseType: !7, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !144, file: !139, line: 180, baseType: !123, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !144, file: !139, line: 181, baseType: !123, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !144, file: !139, line: 182, baseType: !123, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !144, file: !139, line: 183, baseType: !123, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !144, file: !139, line: 186, baseType: !123, size: 32, offset: 160)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !144, file: !139, line: 187, baseType: !123, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !144, file: !139, line: 188, baseType: !123, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !144, file: !139, line: 189, baseType: !123, size: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !144, file: !139, line: 190, baseType: !123, size: 32, offset: 288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !144, file: !139, line: 198, baseType: !123, size: 32, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !144, file: !139, line: 215, baseType: !158, size: 288, offset: 352)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !139, line: 200, size: 288, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !158, file: !139, line: 203, baseType: !123, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !158, file: !139, line: 204, baseType: !123, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !158, file: !139, line: 206, baseType: !123, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !158, file: !139, line: 209, baseType: !123, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !158, file: !139, line: 210, baseType: !123, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !158, file: !139, line: 211, baseType: !123, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !158, file: !139, line: 212, baseType: !123, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !158, file: !139, line: 213, baseType: !123, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !158, file: !139, line: 214, baseType: !123, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !144, file: !139, line: 218, baseType: !123, size: 32, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !144, file: !139, line: 219, baseType: !123, size: 32, offset: 672)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !144, file: !139, line: 220, baseType: !123, size: 32, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !144, file: !139, line: 221, baseType: !123, size: 32, offset: 736)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !144, file: !139, line: 222, baseType: !123, size: 32, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !144, file: !139, line: 224, baseType: !123, size: 32, offset: 800)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !144, file: !139, line: 225, baseType: !123, size: 32, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !144, file: !139, line: 226, baseType: !123, size: 32, offset: 864)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !144, file: !139, line: 227, baseType: !123, size: 32, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !144, file: !139, line: 229, baseType: !123, size: 32, offset: 928)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !144, file: !139, line: 230, baseType: !123, size: 32, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !144, file: !139, line: 231, baseType: !123, size: 32, offset: 992)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !144, file: !139, line: 233, baseType: !123, size: 32, offset: 1024)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !144, file: !139, line: 234, baseType: !123, size: 32, offset: 1056)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !144, file: !139, line: 236, baseType: !123, size: 32, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !144, file: !139, line: 237, baseType: !123, size: 32, offset: 1120)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !144, file: !139, line: 239, baseType: !123, size: 32, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !144, file: !139, line: 240, baseType: !187, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !144, file: !139, line: 241, baseType: !190, size: 128, offset: 1280)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !144, file: !139, line: 242, baseType: !190, size: 128, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !144, file: !139, line: 243, baseType: !190, size: 128, offset: 1536)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !144, file: !139, line: 244, baseType: !190, size: 128, offset: 1664)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !144, file: !139, line: 245, baseType: !197, size: 512, offset: 1792)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !144, file: !139, line: 246, baseType: !197, size: 512, offset: 2304)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !144, file: !139, line: 249, baseType: !202, size: 64, offset: 2816)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !89, !123, !205, !207}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !209)
!209 = !{!210, !212, !213, !214}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !208, file: !211, baseType: !7, size: 32)
!211 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mvpred.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !208, file: !211, baseType: !7, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !208, file: !211, baseType: !89, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !208, file: !211, baseType: !89, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !144, file: !139, line: 250, baseType: !89, size: 64, offset: 2880)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !144, file: !139, line: 251, baseType: !123, size: 32, offset: 2944)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !144, file: !139, line: 252, baseType: !123, size: 32, offset: 2976)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !144, file: !139, line: 253, baseType: !187, size: 64, offset: 3008)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !144, file: !139, line: 287, baseType: !220, size: 800, offset: 3072)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !139, line: 256, size: 800, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !242, !243, !244, !246, !247}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !220, file: !139, line: 258, baseType: !7, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !220, file: !139, line: 259, baseType: !7, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !220, file: !139, line: 261, baseType: !123, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !220, file: !139, line: 262, baseType: !123, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !220, file: !139, line: 263, baseType: !123, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !220, file: !139, line: 264, baseType: !123, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !220, file: !139, line: 265, baseType: !123, size: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !220, file: !139, line: 267, baseType: !123, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !220, file: !139, line: 268, baseType: !123, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !220, file: !139, line: 269, baseType: !123, size: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !220, file: !139, line: 270, baseType: !123, size: 32, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !220, file: !139, line: 271, baseType: !123, size: 32, offset: 352)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !220, file: !139, line: 272, baseType: !123, size: 32, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !220, file: !139, line: 273, baseType: !123, size: 32, offset: 416)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !220, file: !139, line: 274, baseType: !123, size: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !220, file: !139, line: 275, baseType: !123, size: 32, offset: 480)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !220, file: !139, line: 276, baseType: !123, size: 32, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !220, file: !139, line: 277, baseType: !123, size: 32, offset: 544)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !220, file: !139, line: 278, baseType: !241, size: 32, offset: 576)
!241 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !220, file: !139, line: 279, baseType: !241, size: 32, offset: 608)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !220, file: !139, line: 280, baseType: !123, size: 32, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !220, file: !139, line: 283, baseType: !245, size: 64, offset: 672)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !80)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !220, file: !139, line: 285, baseType: !123, size: 32, offset: 736)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !220, file: !139, line: 286, baseType: !123, size: 32, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !144, file: !139, line: 327, baseType: !249, size: 1152, offset: 3904)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !139, line: 290, size: 1152, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !288, !289}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !249, file: !139, line: 292, baseType: !123, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !249, file: !139, line: 294, baseType: !123, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !249, file: !139, line: 295, baseType: !123, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !249, file: !139, line: 296, baseType: !123, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !249, file: !139, line: 297, baseType: !123, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !249, file: !139, line: 299, baseType: !123, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !249, file: !139, line: 300, baseType: !241, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !249, file: !139, line: 301, baseType: !241, size: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !249, file: !139, line: 302, baseType: !241, size: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !249, file: !139, line: 303, baseType: !123, size: 32, offset: 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !249, file: !139, line: 304, baseType: !123, size: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !249, file: !139, line: 305, baseType: !241, size: 32, offset: 352)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !249, file: !139, line: 306, baseType: !241, size: 32, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !249, file: !139, line: 307, baseType: !241, size: 32, offset: 416)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !249, file: !139, line: 309, baseType: !123, size: 32, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !249, file: !139, line: 310, baseType: !241, size: 32, offset: 480)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !249, file: !139, line: 311, baseType: !123, size: 32, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !249, file: !139, line: 312, baseType: !123, size: 32, offset: 544)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !249, file: !139, line: 315, baseType: !123, size: 32, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !249, file: !139, line: 316, baseType: !187, size: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !249, file: !139, line: 317, baseType: !123, size: 32, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !249, file: !139, line: 318, baseType: !187, size: 64, offset: 768)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !249, file: !139, line: 321, baseType: !241, size: 32, offset: 832)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !249, file: !139, line: 322, baseType: !241, size: 32, offset: 864)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !249, file: !139, line: 323, baseType: !241, size: 32, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !249, file: !139, line: 324, baseType: !277, size: 64, offset: 960)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !139, line: 174, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 167, size: 256, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !279, file: !139, line: 169, baseType: !123, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !279, file: !139, line: 169, baseType: !123, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !279, file: !139, line: 170, baseType: !123, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !279, file: !139, line: 171, baseType: !123, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !279, file: !139, line: 172, baseType: !241, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !279, file: !139, line: 173, baseType: !287, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !249, file: !139, line: 325, baseType: !123, size: 32, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !249, file: !139, line: 326, baseType: !187, size: 64, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !144, file: !139, line: 330, baseType: !123, size: 32, offset: 5056)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !144, file: !139, line: 331, baseType: !123, size: 32, offset: 5088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !144, file: !139, line: 332, baseType: !123, size: 32, offset: 5120)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !144, file: !139, line: 334, baseType: !123, size: 32, offset: 5152)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !144, file: !139, line: 335, baseType: !123, size: 32, offset: 5184)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !144, file: !139, line: 336, baseType: !71, size: 32, offset: 5216)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !144, file: !139, line: 337, baseType: !71, size: 32, offset: 5248)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !144, file: !139, line: 338, baseType: !71, size: 32, offset: 5280)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !144, file: !139, line: 339, baseType: !71, size: 32, offset: 5312)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !144, file: !139, line: 340, baseType: !123, size: 32, offset: 5344)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !144, file: !139, line: 344, baseType: !123, size: 32, offset: 5376)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !144, file: !139, line: 356, baseType: !123, size: 32, offset: 5408)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !144, file: !139, line: 364, baseType: !123, size: 32, offset: 5440)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !144, file: !139, line: 367, baseType: !123, size: 32, offset: 5472)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !144, file: !139, line: 368, baseType: !123, size: 32, offset: 5504)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !144, file: !139, line: 369, baseType: !123, size: 32, offset: 5536)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !144, file: !139, line: 375, baseType: !307, size: 64, offset: 5568)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !89}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !140, file: !28, line: 386, baseType: !311, size: 8256, offset: 5632)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 8256, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 129)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !140, file: !28, line: 387, baseType: !123, size: 32, offset: 13888)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !140, file: !28, line: 388, baseType: !123, size: 32, offset: 13920)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !140, file: !28, line: 389, baseType: !123, size: 32, offset: 13952)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !140, file: !28, line: 390, baseType: !123, size: 32, offset: 13984)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !140, file: !28, line: 391, baseType: !123, size: 32, offset: 14016)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !140, file: !28, line: 402, baseType: !320, size: 576, offset: 14080)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !28, line: 394, size: 576, elements: !321)
!321 = !{!322, !323, !324, !334, !335, !336}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !320, file: !28, line: 396, baseType: !123, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !320, file: !28, line: 397, baseType: !123, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !320, file: !28, line: 398, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !139, line: 604, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 593, size: 192, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !327, file: !139, line: 595, baseType: !123, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !327, file: !139, line: 596, baseType: !123, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !327, file: !139, line: 599, baseType: !123, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !327, file: !139, line: 603, baseType: !333, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !320, file: !28, line: 399, baseType: !123, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !320, file: !28, line: 400, baseType: !333, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !320, file: !28, line: 401, baseType: !337, size: 320, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !338, line: 56, baseType: !339)
!338 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !338, line: 47, size: 320, elements: !340)
!340 = !{!341, !342, !343, !344, !348, !349}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !339, file: !338, line: 49, baseType: !333, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !339, file: !338, line: 50, baseType: !333, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !339, file: !338, line: 51, baseType: !333, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !339, file: !338, line: 53, baseType: !345, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !346, line: 87, baseType: !347)
!346 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!347 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !339, file: !338, line: 54, baseType: !123, size: 32, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !339, file: !338, line: 55, baseType: !123, size: 32, offset: 288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !140, file: !28, line: 404, baseType: !333, size: 64, offset: 14656)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !140, file: !28, line: 405, baseType: !123, size: 32, offset: 14720)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !140, file: !28, line: 410, baseType: !123, size: 32, offset: 14752)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !140, file: !28, line: 411, baseType: !123, size: 32, offset: 14784)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !140, file: !28, line: 413, baseType: !123, size: 32, offset: 14816)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !140, file: !28, line: 415, baseType: !123, size: 32, offset: 14848)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !140, file: !28, line: 416, baseType: !123, size: 32, offset: 14880)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !140, file: !28, line: 418, baseType: !123, size: 32, offset: 14912)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !140, file: !28, line: 419, baseType: !123, size: 32, offset: 14944)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !140, file: !28, line: 420, baseType: !123, size: 32, offset: 14976)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !140, file: !28, line: 421, baseType: !123, size: 32, offset: 15008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !140, file: !28, line: 422, baseType: !123, size: 32, offset: 15040)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !140, file: !28, line: 424, baseType: !123, size: 32, offset: 15072)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !140, file: !28, line: 425, baseType: !123, size: 32, offset: 15104)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !140, file: !28, line: 427, baseType: !123, size: 32, offset: 15136)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !140, file: !28, line: 430, baseType: !366, size: 10400, offset: 15168)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 10400, elements: !453)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !368, line: 154, baseType: !369)
!368 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 52, size: 10400, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !388, !389, !390, !391, !392, !393, !394, !395, !396, !403, !404, !452}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !369, file: !368, line: 54, baseType: !123, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !369, file: !368, line: 56, baseType: !123, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !369, file: !368, line: 57, baseType: !123, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !369, file: !368, line: 59, baseType: !123, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !369, file: !368, line: 60, baseType: !123, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !369, file: !368, line: 61, baseType: !123, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !369, file: !368, line: 63, baseType: !123, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !369, file: !368, line: 65, baseType: !123, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !369, file: !368, line: 67, baseType: !123, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !369, file: !368, line: 69, baseType: !123, size: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !369, file: !368, line: 70, baseType: !123, size: 32, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !369, file: !368, line: 71, baseType: !123, size: 32, offset: 352)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !369, file: !368, line: 72, baseType: !123, size: 32, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !369, file: !368, line: 73, baseType: !385, size: 8192, offset: 416)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8192, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !369, file: !368, line: 75, baseType: !123, size: 32, offset: 8608)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !369, file: !368, line: 76, baseType: !123, size: 32, offset: 8640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !369, file: !368, line: 77, baseType: !123, size: 32, offset: 8672)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !369, file: !368, line: 78, baseType: !123, size: 32, offset: 8704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !369, file: !368, line: 79, baseType: !123, size: 32, offset: 8736)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !369, file: !368, line: 80, baseType: !123, size: 32, offset: 8768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !369, file: !368, line: 81, baseType: !123, size: 32, offset: 8800)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !369, file: !368, line: 83, baseType: !123, size: 32, offset: 8832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !369, file: !368, line: 90, baseType: !397, size: 128, offset: 8864)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !368, line: 84, size: 128, elements: !398)
!398 = !{!399, !400, !401, !402}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !397, file: !368, line: 86, baseType: !123, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !397, file: !368, line: 87, baseType: !123, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !397, file: !368, line: 88, baseType: !123, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !397, file: !368, line: 89, baseType: !123, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !369, file: !368, line: 92, baseType: !123, size: 32, offset: 8992)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !369, file: !368, line: 150, baseType: !405, size: 1344, offset: 9024)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !368, line: 93, size: 1344, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !405, file: !368, line: 95, baseType: !123, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !405, file: !368, line: 96, baseType: !123, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !405, file: !368, line: 97, baseType: !123, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !405, file: !368, line: 99, baseType: !123, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !405, file: !368, line: 100, baseType: !123, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !405, file: !368, line: 102, baseType: !123, size: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !405, file: !368, line: 103, baseType: !123, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !405, file: !368, line: 104, baseType: !123, size: 32, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !405, file: !368, line: 105, baseType: !123, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !405, file: !368, line: 106, baseType: !123, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !405, file: !368, line: 107, baseType: !123, size: 32, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !405, file: !368, line: 108, baseType: !123, size: 32, offset: 352)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !405, file: !368, line: 110, baseType: !123, size: 32, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !405, file: !368, line: 111, baseType: !123, size: 32, offset: 416)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !405, file: !368, line: 112, baseType: !123, size: 32, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !405, file: !368, line: 114, baseType: !123, size: 32, offset: 480)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !405, file: !368, line: 115, baseType: !71, size: 32, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !405, file: !368, line: 116, baseType: !71, size: 32, offset: 544)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !405, file: !368, line: 117, baseType: !123, size: 32, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !405, file: !368, line: 119, baseType: !123, size: 32, offset: 608)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !405, file: !368, line: 120, baseType: !123, size: 32, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !405, file: !368, line: 137, baseType: !429, size: 384, offset: 672)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !405, file: !368, line: 122, size: 384, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !429, file: !368, line: 124, baseType: !123, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !429, file: !368, line: 125, baseType: !123, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !429, file: !368, line: 126, baseType: !123, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !429, file: !368, line: 127, baseType: !123, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !429, file: !368, line: 128, baseType: !123, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !429, file: !368, line: 129, baseType: !123, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !429, file: !368, line: 130, baseType: !123, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !429, file: !368, line: 131, baseType: !123, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !429, file: !368, line: 133, baseType: !123, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !429, file: !368, line: 134, baseType: !123, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !429, file: !368, line: 135, baseType: !123, size: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !429, file: !368, line: 136, baseType: !123, size: 32, offset: 352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !405, file: !368, line: 139, baseType: !123, size: 32, offset: 1056)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !405, file: !368, line: 140, baseType: !123, size: 32, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !405, file: !368, line: 141, baseType: !123, size: 32, offset: 1120)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !405, file: !368, line: 142, baseType: !123, size: 32, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !405, file: !368, line: 143, baseType: !123, size: 32, offset: 1184)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !405, file: !368, line: 144, baseType: !123, size: 32, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !405, file: !368, line: 145, baseType: !123, size: 32, offset: 1248)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !405, file: !368, line: 146, baseType: !123, size: 32, offset: 1280)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !405, file: !368, line: 147, baseType: !123, size: 32, offset: 1312)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !369, file: !368, line: 152, baseType: !123, size: 32, offset: 10368)
!453 = !{!454}
!454 = !DISubrange(count: 1)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !140, file: !28, line: 431, baseType: !456, size: 64, offset: 25600)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !140, file: !28, line: 432, baseType: !458, size: 960, offset: 25664)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 960, elements: !453)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !368, line: 186, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 156, size: 960, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !460, file: !368, line: 158, baseType: !123, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !460, file: !368, line: 159, baseType: !123, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !460, file: !368, line: 161, baseType: !123, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !460, file: !368, line: 163, baseType: !123, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !460, file: !368, line: 164, baseType: !123, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !460, file: !368, line: 166, baseType: !123, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !460, file: !368, line: 167, baseType: !123, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !460, file: !368, line: 169, baseType: !123, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !460, file: !368, line: 170, baseType: !123, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !460, file: !368, line: 172, baseType: !123, size: 32, offset: 288)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !460, file: !368, line: 173, baseType: !123, size: 32, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !460, file: !368, line: 175, baseType: !123, size: 32, offset: 352)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !460, file: !368, line: 177, baseType: !123, size: 32, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !460, file: !368, line: 178, baseType: !123, size: 32, offset: 416)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !460, file: !368, line: 179, baseType: !123, size: 32, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !460, file: !368, line: 181, baseType: !123, size: 32, offset: 480)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !460, file: !368, line: 183, baseType: !123, size: 32, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !460, file: !368, line: 184, baseType: !480, size: 384, offset: 576)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 384, elements: !483)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!483 = !{!484}
!484 = !DISubrange(count: 6)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !140, file: !28, line: 433, baseType: !486, size: 64, offset: 26624)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !140, file: !28, line: 434, baseType: !123, size: 32, offset: 26688)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !140, file: !28, line: 437, baseType: !123, size: 32, offset: 26720)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !140, file: !28, line: 440, baseType: !490, size: 256, offset: 26752)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 256, elements: !87)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 512, elements: !191)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !140, file: !28, line: 441, baseType: !494, size: 128, offset: 27008)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 128, elements: !80)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 2048, elements: !198)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !140, file: !28, line: 443, baseType: !490, size: 256, offset: 27136)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !140, file: !28, line: 444, baseType: !494, size: 128, offset: 27392)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !140, file: !28, line: 446, baseType: !500, size: 256, offset: 27520)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 256, elements: !87)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 256, elements: !191)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !140, file: !28, line: 447, baseType: !504, size: 128, offset: 27776)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 128, elements: !80)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1024, elements: !198)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !140, file: !28, line: 448, baseType: !500, size: 256, offset: 27904)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !140, file: !28, line: 449, baseType: !504, size: 128, offset: 28160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !140, file: !28, line: 454, baseType: !510, size: 5888, offset: 28288)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 5888, elements: !512)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!512 = !{!513}
!513 = !DISubrange(count: 92)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !140, file: !28, line: 455, baseType: !515, size: 23552, offset: 34176)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 23552, elements: !516)
!516 = !{!513, !88}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !140, file: !28, line: 457, baseType: !481, size: 64, offset: 57728)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !140, file: !28, line: 460, baseType: !519, size: 53376, offset: 57856)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !28, line: 364, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 302, size: 53376, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !550, !575, !576, !577, !583, !584, !585, !586, !587, !588, !589, !590}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !520, file: !28, line: 304, baseType: !456, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !520, file: !28, line: 305, baseType: !486, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !520, file: !28, line: 307, baseType: !123, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !520, file: !28, line: 308, baseType: !123, size: 32, offset: 160)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !520, file: !28, line: 309, baseType: !123, size: 32, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !520, file: !28, line: 311, baseType: !123, size: 32, offset: 224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !520, file: !28, line: 313, baseType: !123, size: 32, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !520, file: !28, line: 315, baseType: !123, size: 32, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !520, file: !28, line: 316, baseType: !123, size: 32, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !520, file: !28, line: 317, baseType: !123, size: 32, offset: 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !520, file: !28, line: 319, baseType: !123, size: 32, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !520, file: !28, line: 321, baseType: !123, size: 32, offset: 416)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !520, file: !28, line: 322, baseType: !123, size: 32, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !520, file: !28, line: 324, baseType: !245, size: 64, offset: 480)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !520, file: !28, line: 325, baseType: !123, size: 32, offset: 544)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !520, file: !28, line: 327, baseType: !123, size: 32, offset: 576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !520, file: !28, line: 329, baseType: !123, size: 32, offset: 608)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !520, file: !28, line: 330, baseType: !123, size: 32, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !520, file: !28, line: 331, baseType: !123, size: 32, offset: 672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !520, file: !28, line: 333, baseType: !123, size: 32, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !520, file: !28, line: 334, baseType: !123, size: 32, offset: 736)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !520, file: !28, line: 339, baseType: !544, size: 2048, offset: 768)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 2048, elements: !549)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !520, file: !28, line: 335, size: 64, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !545, file: !28, line: 337, baseType: !123, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !545, file: !28, line: 338, baseType: !123, size: 32, offset: 32)
!549 = !{!81, !192}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !520, file: !28, line: 342, baseType: !551, size: 49152, align: 128, offset: 2816)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 49152, align: 128, elements: !572)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !553, line: 36, baseType: !554, align: 128)
!553 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !553, line: 26, size: 512, elements: !555)
!555 = !{!556, !558, !559, !562, !563, !564}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !554, file: !553, line: 30, baseType: !557, size: 128, align: 128)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !118)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !554, file: !553, line: 31, baseType: !557, size: 128, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !554, file: !553, line: 32, baseType: !560, size: 32, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !94, line: 26, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !74, line: 41, baseType: !123)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !554, file: !553, line: 33, baseType: !560, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !554, file: !553, line: 34, baseType: !560, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !554, file: !553, line: 35, baseType: !565, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !553, line: 25, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !333, !123, !333, !123, !570, !123}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!572 = !{!573, !574}
!573 = !DISubrange(count: 32)
!574 = !DISubrange(count: 3)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !520, file: !28, line: 344, baseType: !123, size: 32, offset: 51968)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !520, file: !28, line: 345, baseType: !123, size: 32, offset: 52000)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !520, file: !28, line: 350, baseType: !578, size: 1024, offset: 52032)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 1024, elements: !191)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !520, file: !28, line: 346, size: 64, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !579, file: !28, line: 348, baseType: !123, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !579, file: !28, line: 349, baseType: !123, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !520, file: !28, line: 352, baseType: !123, size: 32, offset: 53056)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !520, file: !28, line: 354, baseType: !123, size: 32, offset: 53088)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !520, file: !28, line: 355, baseType: !123, size: 32, offset: 53120)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !520, file: !28, line: 356, baseType: !123, size: 32, offset: 53152)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !520, file: !28, line: 357, baseType: !123, size: 32, offset: 53184)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !520, file: !28, line: 360, baseType: !123, size: 32, offset: 53216)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !520, file: !28, line: 361, baseType: !123, size: 32, offset: 53248)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !520, file: !28, line: 362, baseType: !123, size: 32, offset: 53280)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !140, file: !28, line: 463, baseType: !592, size: 4096, offset: 111232)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !593, line: 46, baseType: !594)
!593 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 27, size: 4096, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !594, file: !593, line: 30, baseType: !123, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !594, file: !593, line: 31, baseType: !123, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !594, file: !593, line: 34, baseType: !123, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !594, file: !593, line: 35, baseType: !123, size: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !594, file: !593, line: 37, baseType: !333, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !594, file: !593, line: 38, baseType: !333, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !594, file: !593, line: 39, baseType: !333, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !594, file: !593, line: 42, baseType: !123, size: 32, align: 128, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !594, file: !593, line: 45, baseType: !605, size: 3680, offset: 416)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 3680, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 460)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !140, file: !28, line: 494, baseType: !609, size: 2112, offset: 115328)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !28, line: 465, size: 2112, elements: !610)
!610 = !{!611, !749, !751, !752, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !765, !766, !767, !768}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !609, file: !28, line: 468, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !615, line: 146, baseType: !616)
!615 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !615, line: 31, size: 125056, elements: !617)
!617 = !{!618, !619, !620, !621, !624, !625, !626, !627, !628, !629, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !648, !649, !650, !651, !652, !653, !655, !657, !658, !659, !660, !661, !664, !666, !667, !669, !674, !675, !679, !680, !684, !688, !691, !693, !694, !696, !697, !699, !700, !701, !704, !706, !707, !708, !710, !711, !712, !713, !714, !715, !716, !717, !719, !720, !721, !730, !734, !736, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !616, file: !615, line: 34, baseType: !123, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !616, file: !615, line: 35, baseType: !123, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !616, file: !615, line: 36, baseType: !123, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !616, file: !615, line: 37, baseType: !622, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !94, line: 27, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !74, line: 44, baseType: !347)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !616, file: !615, line: 38, baseType: !622, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !616, file: !615, line: 39, baseType: !123, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !616, file: !615, line: 40, baseType: !123, size: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !616, file: !615, line: 41, baseType: !123, size: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !616, file: !615, line: 42, baseType: !123, size: 32, offset: 352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !616, file: !615, line: 43, baseType: !630, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !616, file: !615, line: 45, baseType: !123, size: 32, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !616, file: !615, line: 46, baseType: !123, size: 32, offset: 480)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !616, file: !615, line: 47, baseType: !123, size: 32, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !616, file: !615, line: 48, baseType: !123, size: 32, offset: 544)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !616, file: !615, line: 49, baseType: !123, size: 32, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !616, file: !615, line: 50, baseType: !123, size: 32, offset: 608)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !616, file: !615, line: 51, baseType: !123, size: 32, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !616, file: !615, line: 52, baseType: !84, size: 8, offset: 672)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !616, file: !615, line: 53, baseType: !84, size: 8, offset: 680)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !616, file: !615, line: 54, baseType: !84, size: 8, offset: 688)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !616, file: !615, line: 55, baseType: !241, size: 32, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !616, file: !615, line: 56, baseType: !241, size: 32, offset: 736)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !616, file: !615, line: 57, baseType: !123, size: 32, offset: 768)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !616, file: !615, line: 60, baseType: !123, size: 32, offset: 800)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !616, file: !615, line: 61, baseType: !646, size: 96, offset: 832)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 96, elements: !647)
!647 = !{!574}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !616, file: !615, line: 62, baseType: !646, size: 96, offset: 928)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !616, file: !615, line: 63, baseType: !646, size: 96, offset: 1024)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !616, file: !615, line: 64, baseType: !123, size: 32, offset: 1120)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !616, file: !615, line: 65, baseType: !123, size: 32, offset: 1152)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !616, file: !615, line: 66, baseType: !123, size: 32, offset: 1184)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !616, file: !615, line: 67, baseType: !654, size: 192, offset: 1216)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 192, elements: !647)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !616, file: !615, line: 68, baseType: !656, size: 256, offset: 1408)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 256, elements: !87)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !616, file: !615, line: 69, baseType: !656, size: 256, offset: 1664)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !616, file: !615, line: 70, baseType: !511, size: 64, offset: 1920)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !616, file: !615, line: 74, baseType: !656, size: 256, offset: 1984)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !616, file: !615, line: 75, baseType: !656, size: 256, offset: 2240)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !616, file: !615, line: 77, baseType: !662, size: 24576, align: 128, offset: 2560)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 24576, align: 128, elements: !663)
!663 = !{!192, !574}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !616, file: !615, line: 78, baseType: !665, size: 1024, offset: 27136)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 1024, elements: !191)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !616, file: !615, line: 79, baseType: !123, size: 32, offset: 28160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !616, file: !615, line: 80, baseType: !668, size: 64, offset: 28224)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !616, file: !615, line: 83, baseType: !670, size: 64, offset: 28288)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !94, line: 24, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !74, line: 37, baseType: !673)
!673 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !616, file: !615, line: 84, baseType: !333, size: 64, offset: 28352)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !616, file: !615, line: 85, baseType: !676, size: 128, offset: 28416)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 128, elements: !80)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !80)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !616, file: !615, line: 86, baseType: !677, size: 64, offset: 28544)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !616, file: !615, line: 87, baseType: !681, size: 2176, offset: 28608)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 2176, elements: !682)
!682 = !{!81, !683}
!683 = !DISubrange(count: 17)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !616, file: !615, line: 92, baseType: !685, size: 20736, offset: 30784)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 20736, elements: !686)
!686 = !{!687, !687}
!687 = !DISubrange(count: 18)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !616, file: !615, line: 96, baseType: !689, size: 2176, offset: 51520)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 2176, elements: !682)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !616, file: !615, line: 97, baseType: !692, size: 128, offset: 53696)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 128, elements: !80)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !616, file: !615, line: 98, baseType: !245, size: 64, offset: 53824)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !616, file: !615, line: 99, baseType: !695, size: 1024, offset: 53888)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 1024, elements: !549)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !616, file: !615, line: 100, baseType: !678, size: 32, offset: 54912)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !616, file: !615, line: 105, baseType: !698, size: 10368, offset: 54944)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 10368, elements: !686)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !616, file: !615, line: 106, baseType: !698, size: 10368, offset: 65312)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !616, file: !615, line: 107, baseType: !123, size: 32, offset: 75680)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !616, file: !615, line: 108, baseType: !702, size: 576, offset: 75712)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 576, elements: !703)
!703 = !{!687}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !616, file: !615, line: 109, baseType: !705, size: 20736, offset: 76288)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 20736, elements: !686)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !616, file: !615, line: 110, baseType: !690, size: 64, offset: 97024)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !616, file: !615, line: 111, baseType: !690, size: 64, offset: 97088)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !616, file: !615, line: 112, baseType: !709, size: 64, offset: 97152)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !616, file: !615, line: 113, baseType: !709, size: 64, offset: 97216)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !616, file: !615, line: 114, baseType: !709, size: 64, offset: 97280)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !616, file: !615, line: 115, baseType: !123, size: 32, offset: 97344)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !616, file: !615, line: 116, baseType: !511, size: 64, offset: 97408)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !616, file: !615, line: 117, baseType: !511, size: 64, offset: 97472)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !616, file: !615, line: 118, baseType: !511, size: 64, offset: 97536)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !616, file: !615, line: 119, baseType: !123, size: 32, offset: 97600)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !616, file: !615, line: 120, baseType: !718, size: 576, offset: 97632)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 576, elements: !703)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !616, file: !615, line: 121, baseType: !71, size: 32, offset: 98208)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !616, file: !615, line: 122, baseType: !109, size: 64, offset: 98240)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !616, file: !615, line: 125, baseType: !722, size: 256, offset: 98304)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !139, line: 503, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 496, size: 256, elements: !724)
!724 = !{!725, !727, !728, !729}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !723, file: !139, line: 498, baseType: !726, size: 64)
!726 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !723, file: !139, line: 499, baseType: !726, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !723, file: !139, line: 500, baseType: !726, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !723, file: !139, line: 502, baseType: !726, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !616, file: !615, line: 128, baseType: !731, size: 2008, offset: 98560)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2008, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 251)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !616, file: !615, line: 129, baseType: !735, size: 8032, offset: 100576)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8032, elements: !732)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !616, file: !615, line: 130, baseType: !737, size: 16064, offset: 108608)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 16064, elements: !732)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !616, file: !615, line: 131, baseType: !123, size: 32, offset: 124672)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !616, file: !615, line: 132, baseType: !123, size: 32, offset: 124704)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !616, file: !615, line: 135, baseType: !123, size: 32, offset: 124736)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !616, file: !615, line: 136, baseType: !123, size: 32, offset: 124768)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !616, file: !615, line: 137, baseType: !123, size: 32, offset: 124800)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !616, file: !615, line: 138, baseType: !123, size: 32, offset: 124832)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !616, file: !615, line: 139, baseType: !123, size: 32, offset: 124864)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !616, file: !615, line: 142, baseType: !241, size: 32, offset: 124896)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !616, file: !615, line: 143, baseType: !123, size: 32, offset: 124928)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !616, file: !615, line: 144, baseType: !123, size: 32, offset: 124960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !616, file: !615, line: 145, baseType: !123, size: 32, offset: 124992)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !609, file: !28, line: 470, baseType: !750, size: 128, offset: 64)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 128, elements: !80)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !609, file: !28, line: 473, baseType: !612, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !609, file: !28, line: 476, baseType: !753, size: 1152, offset: 256)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 1152, elements: !703)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !609, file: !28, line: 478, baseType: !123, size: 32, offset: 1408)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !609, file: !28, line: 480, baseType: !123, size: 32, offset: 1440)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !609, file: !28, line: 482, baseType: !123, size: 32, offset: 1472)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !609, file: !28, line: 483, baseType: !123, size: 32, offset: 1504)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !609, file: !28, line: 484, baseType: !123, size: 32, offset: 1536)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !609, file: !28, line: 485, baseType: !123, size: 32, offset: 1568)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !609, file: !28, line: 486, baseType: !123, size: 32, offset: 1600)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !609, file: !28, line: 487, baseType: !622, size: 64, offset: 1664)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !609, file: !28, line: 488, baseType: !622, size: 64, offset: 1728)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !609, file: !28, line: 489, baseType: !764, size: 128, offset: 1792)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 128, elements: !80)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !609, file: !28, line: 490, baseType: !622, size: 64, offset: 1920)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !609, file: !28, line: 491, baseType: !622, size: 64, offset: 1984)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !609, file: !28, line: 492, baseType: !123, size: 32, offset: 2048)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !609, file: !28, line: 493, baseType: !123, size: 32, offset: 2080)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !140, file: !28, line: 497, baseType: !613, size: 64, offset: 117440)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !140, file: !28, line: 500, baseType: !613, size: 64, offset: 117504)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !140, file: !28, line: 503, baseType: !123, size: 32, offset: 117568)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !140, file: !28, line: 504, baseType: !773, size: 1216, offset: 117632)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 1216, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 19)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !140, file: !28, line: 505, baseType: !123, size: 32, offset: 118848)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !140, file: !28, line: 506, baseType: !773, size: 1216, offset: 118912)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !140, file: !28, line: 507, baseType: !245, size: 64, offset: 120128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !140, file: !28, line: 510, baseType: !123, size: 32, offset: 120192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !140, file: !28, line: 511, baseType: !123, size: 32, offset: 120224)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !140, file: !28, line: 512, baseType: !622, size: 64, offset: 120256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !140, file: !28, line: 522, baseType: !783, size: 10624, offset: 120320)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !28, line: 515, size: 10624, elements: !784)
!784 = !{!785, !787, !790, !793}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !783, file: !28, line: 517, baseType: !786, size: 256, align: 128)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 256, elements: !191)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !783, file: !28, line: 518, baseType: !788, size: 128, align: 128, offset: 256)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !789)
!789 = !{!81, !88}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !783, file: !28, line: 520, baseType: !791, size: 4096, align: 128, offset: 384)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 4096, elements: !792)
!792 = !{!88, !199}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !783, file: !28, line: 521, baseType: !794, size: 6144, align: 128, offset: 4480)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 6144, elements: !795)
!795 = !{!796, !192}
!796 = !DISubrange(count: 24)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !140, file: !28, line: 732, baseType: !798, size: 82688, offset: 130944)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !28, line: 525, size: 82688, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !827, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !845, !848, !852, !853, !854, !859, !860, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !928, !959, !960, !961, !962, !963, !964, !965, !966, !967, !970, !971, !972, !975, !978, !980, !983, !985, !986}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !798, file: !28, line: 527, baseType: !123, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !798, file: !28, line: 530, baseType: !123, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !798, file: !28, line: 531, baseType: !123, size: 32, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !798, file: !28, line: 532, baseType: !123, size: 32, offset: 96)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !798, file: !28, line: 535, baseType: !123, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !798, file: !28, line: 536, baseType: !123, size: 32, offset: 160)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !798, file: !28, line: 537, baseType: !123, size: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !798, file: !28, line: 538, baseType: !123, size: 32, offset: 224)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !798, file: !28, line: 539, baseType: !123, size: 32, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !798, file: !28, line: 542, baseType: !123, size: 32, offset: 288)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !798, file: !28, line: 543, baseType: !123, size: 32, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !798, file: !28, line: 544, baseType: !123, size: 32, offset: 352)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !798, file: !28, line: 545, baseType: !123, size: 32, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !798, file: !28, line: 546, baseType: !123, size: 32, offset: 416)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !798, file: !28, line: 547, baseType: !123, size: 32, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !798, file: !28, line: 548, baseType: !123, size: 32, offset: 480)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !798, file: !28, line: 549, baseType: !123, size: 32, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !798, file: !28, line: 551, baseType: !123, size: 32, offset: 544)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !798, file: !28, line: 554, baseType: !245, size: 64, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !798, file: !28, line: 555, baseType: !245, size: 64, offset: 640)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !798, file: !28, line: 558, baseType: !245, size: 64, offset: 704)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !798, file: !28, line: 559, baseType: !245, size: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !798, file: !28, line: 561, baseType: !245, size: 64, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !798, file: !28, line: 562, baseType: !245, size: 64, offset: 896)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !798, file: !28, line: 565, baseType: !7, size: 32, offset: 960)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !798, file: !28, line: 566, baseType: !826, size: 128, offset: 992)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !87)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !798, file: !28, line: 567, baseType: !828, size: 512, offset: 1120)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !191)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !798, file: !28, line: 568, baseType: !7, size: 32, offset: 1632)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !798, file: !28, line: 569, baseType: !7, size: 32, offset: 1664)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !798, file: !28, line: 570, baseType: !123, size: 32, offset: 1696)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !798, file: !28, line: 571, baseType: !123, size: 32, offset: 1728)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !798, file: !28, line: 572, baseType: !123, size: 32, offset: 1760)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !798, file: !28, line: 573, baseType: !123, size: 32, offset: 1792)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !798, file: !28, line: 574, baseType: !123, size: 32, offset: 1824)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !798, file: !28, line: 575, baseType: !123, size: 32, offset: 1856)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !798, file: !28, line: 576, baseType: !123, size: 32, offset: 1888)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !798, file: !28, line: 577, baseType: !123, size: 32, offset: 1920)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !798, file: !28, line: 578, baseType: !123, size: 32, offset: 1952)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !798, file: !28, line: 585, baseType: !670, size: 64, offset: 1984)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !798, file: !28, line: 586, baseType: !333, size: 64, offset: 2048)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !798, file: !28, line: 587, baseType: !670, size: 64, offset: 2112)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !798, file: !28, line: 588, baseType: !844, size: 64, offset: 2176)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !798, file: !28, line: 589, baseType: !846, size: 64, offset: 2240)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 64, elements: !118)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !798, file: !28, line: 591, baseType: !849, size: 64, offset: 2304)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 192, elements: !851)
!851 = !{!796}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !798, file: !28, line: 592, baseType: !670, size: 64, offset: 2368)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !798, file: !28, line: 593, baseType: !676, size: 128, offset: 2432)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !798, file: !28, line: 594, baseType: !855, size: 128, offset: 2560)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 128, elements: !80)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !858)
!858 = !{!119, !81}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !798, file: !28, line: 595, baseType: !692, size: 128, offset: 2688)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !798, file: !28, line: 596, baseType: !861, size: 4096, offset: 2816)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 4096, elements: !862)
!862 = !{!81, !573}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !798, file: !28, line: 597, baseType: !670, size: 64, offset: 6912)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !798, file: !28, line: 598, baseType: !670, size: 64, offset: 6976)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !798, file: !28, line: 599, baseType: !511, size: 64, offset: 7040)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !798, file: !28, line: 603, baseType: !665, size: 1024, offset: 7104)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !798, file: !28, line: 606, baseType: !123, size: 32, offset: 8128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !798, file: !28, line: 607, baseType: !123, size: 32, offset: 8160)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !798, file: !28, line: 608, baseType: !83, size: 32, align: 32, offset: 8192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !798, file: !28, line: 609, baseType: !123, size: 32, offset: 8224)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !798, file: !28, line: 611, baseType: !123, size: 32, offset: 8256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !798, file: !28, line: 612, baseType: !123, size: 32, offset: 8288)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !798, file: !28, line: 614, baseType: !123, size: 32, offset: 8320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !798, file: !28, line: 615, baseType: !123, size: 32, offset: 8352)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !798, file: !28, line: 621, baseType: !123, size: 32, offset: 8384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !798, file: !28, line: 624, baseType: !123, size: 32, offset: 8416)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !798, file: !28, line: 626, baseType: !123, size: 32, offset: 8448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !798, file: !28, line: 627, baseType: !123, size: 32, offset: 8480)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !798, file: !28, line: 671, baseType: !880, size: 60672, offset: 8576)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !798, file: !28, line: 629, size: 60672, elements: !881)
!881 = !{!882, !886, !890, !892, !893, !896, !900, !902, !903, !904, !905, !906, !909, !913, !916, !917, !918, !919, !920, !923, !925, !927}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !880, file: !28, line: 634, baseType: !883, size: 3072, align: 128)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 3072, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !880, file: !28, line: 635, baseType: !887, size: 6912, align: 128, offset: 3072)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 6912, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 864)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !880, file: !28, line: 638, baseType: !891, size: 2048, align: 128, offset: 9984)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !386)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !880, file: !28, line: 639, baseType: !891, size: 2048, align: 128, offset: 12032)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !880, file: !28, line: 640, baseType: !894, size: 3072, align: 128, offset: 14080)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 3072, elements: !895)
!895 = !{!574, !199}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !880, file: !28, line: 641, baseType: !897, size: 3840, align: 128, offset: 17152)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 3840, elements: !898)
!898 = !{!899, !192}
!899 = !DISubrange(count: 15)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !880, file: !28, line: 642, baseType: !901, size: 128, offset: 20992)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !87)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !880, file: !28, line: 643, baseType: !901, size: 128, offset: 21120)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !880, file: !28, line: 644, baseType: !123, size: 32, offset: 21248)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !880, file: !28, line: 645, baseType: !123, size: 32, offset: 21280)
