; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/option.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/option.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._OptionInfo = type { ptr, i64, i64, i32 }
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i64, i64, i64, i32, i32, i32, i64, ptr, ptr, ptr, ptr, ptr, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, ptr, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, ptr, i32 }
%struct._PixelPacket = type { i16, i16, i16, i16 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }

@.str = private unnamed_addr constant [85 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/option.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"MemoryAllocationFailed\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1

!492 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!493 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!494 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!495 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!496 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!497 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!498 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!499 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!500 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!501 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!502 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!503 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!504 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!505 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!506 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!507 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!508 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!509 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!510 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!511 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!512 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!513 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!514 = !DIEnumerator(name: "MagickListOptions", value: 38)
!515 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!516 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!517 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!518 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!519 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!520 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!521 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!522 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!523 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!524 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!525 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!526 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!527 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!528 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!529 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!530 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!531 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!532 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!533 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!534 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!535 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!536 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!537 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!538 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!539 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!540 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!541 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!542 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!543 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!544 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!545 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!546 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !548, line: 46, baseType: !7, size: 32, elements: !549)
!548 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561}
!550 = !DIEnumerator(name: "_ISupper", value: 256)
!551 = !DIEnumerator(name: "_ISlower", value: 512)
!552 = !DIEnumerator(name: "_ISalpha", value: 1024)
!553 = !DIEnumerator(name: "_ISdigit", value: 2048)
!554 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!555 = !DIEnumerator(name: "_ISspace", value: 8192)
!556 = !DIEnumerator(name: "_ISprint", value: 16384)
!557 = !DIEnumerator(name: "_ISgraph", value: 32768)
!558 = !DIEnumerator(name: "_ISblank", value: 1)
!559 = !DIEnumerator(name: "_IScntrl", value: 2)
!560 = !DIEnumerator(name: "_ISpunct", value: 4)
!561 = !DIEnumerator(name: "_ISalnum", value: 8)
!562 = !{!563, !564, !565, !569, !572, !575, !590, !473, !591, !592, !593, !594, !596, !582}
!563 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !567, line: 26, baseType: !568)
!567 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !567, line: 25, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!564, !564}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "OptionInfo", file: !472, line: 130, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_OptionInfo", file: !472, line: 119, size: 256, elements: !579)
!579 = !{!580, !581, !587, !588}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic", scope: !578, file: !472, line: 122, baseType: !572, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !578, file: !472, line: 125, baseType: !582, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !583, line: 77, baseType: !584)
!583 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !585, line: 193, baseType: !586)
!585 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!586 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !578, file: !472, line: 126, baseType: !582, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !578, file: !472, line: 129, baseType: !589, size: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!591 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!592 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !595, line: 46, baseType: !563)
!595 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !598, line: 7, baseType: !599)
!598 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !600, line: 49, size: 1728, elements: !601)
!600 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !617, !619, !620, !621, !623, !624, !626, !630, !633, !635, !638, !641, !642, !643, !644, !645}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !599, file: !600, line: 51, baseType: !473, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !599, file: !600, line: 54, baseType: !590, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !599, file: !600, line: 55, baseType: !590, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !599, file: !600, line: 56, baseType: !590, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !599, file: !600, line: 57, baseType: !590, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !599, file: !600, line: 58, baseType: !590, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !599, file: !600, line: 59, baseType: !590, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !599, file: !600, line: 60, baseType: !590, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !599, file: !600, line: 61, baseType: !590, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !599, file: !600, line: 64, baseType: !590, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !599, file: !600, line: 65, baseType: !590, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !599, file: !600, line: 66, baseType: !590, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !599, file: !600, line: 68, baseType: !615, size: 64, offset: 768)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !600, line: 36, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !599, file: !600, line: 70, baseType: !618, size: 64, offset: 832)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !599, file: !600, line: 72, baseType: !473, size: 32, offset: 896)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !599, file: !600, line: 73, baseType: !473, size: 32, offset: 928)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !599, file: !600, line: 74, baseType: !622, size: 64, offset: 960)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !585, line: 152, baseType: !586)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !599, file: !600, line: 77, baseType: !592, size: 16, offset: 1024)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !599, file: !600, line: 78, baseType: !625, size: 8, offset: 1040)
!625 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !599, file: !600, line: 79, baseType: !627, size: 8, offset: 1048)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 8, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 1)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !599, file: !600, line: 81, baseType: !631, size: 64, offset: 1088)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !600, line: 43, baseType: null)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !599, file: !600, line: 89, baseType: !634, size: 64, offset: 1152)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !585, line: 153, baseType: !586)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !599, file: !600, line: 91, baseType: !636, size: 64, offset: 1216)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !600, line: 37, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !599, file: !600, line: 92, baseType: !639, size: 64, offset: 1280)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !600, line: 38, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !599, file: !600, line: 93, baseType: !618, size: 64, offset: 1344)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !599, file: !600, line: 94, baseType: !564, size: 64, offset: 1408)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !599, file: !600, line: 95, baseType: !594, size: 64, offset: 1472)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !599, file: !600, line: 96, baseType: !473, size: 32, offset: 1536)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !599, file: !600, line: 98, baseType: !646, size: 160, offset: 1568)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 160, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 20)
!649 = !{!0, !650, !656, !661, !666, !671, !676, !678, !683, !688, !693, !698, !703, !705, !710, !712, !714, !719, !724, !726, !728, !730, !732, !737, !739, !744, !749, !751, !753, !758, !763, !768, !770, !772, !777, !782, !787, !789, !794, !796, !798, !803, !805, !810, !812, !814, !816, !818, !820, !822, !824, !826, !828, !830, !835}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "AlphaOptions", scope: !2, file: !652, line: 94, type: !653, isLocal: true, isDefinition: true)
!652 = !DIFile(filename: "apps/538.imagick_r/src/magick/option.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d1b02d8a7f2f006aac66efe5e47db142")
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 4096, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 16)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "BooleanOptions", scope: !2, file: !652, line: 113, type: !658, isLocal: true, isDefinition: true)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1280, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 5)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "CacheOptions", scope: !2, file: !652, line: 121, type: !663, isLocal: true, isDefinition: true)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1536, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 6)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "ChannelOptions", scope: !2, file: !652, line: 130, type: !668, isLocal: true, isDefinition: true)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 8704, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 34)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "ClassOptions", scope: !2, file: !652, line: 167, type: !673, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1024, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 4)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "ClipPathOptions", scope: !2, file: !652, line: 174, type: !658, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "ColorspaceOptions", scope: !2, file: !652, line: 879, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 9216, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 36)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "CommandOptions", scope: !2, file: !652, line: 182, type: !685, isLocal: true, isDefinition: true)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 151040, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 590)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "ComplexOptions", scope: !2, file: !652, line: 918, type: !690, isLocal: true, isDefinition: true)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2304, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 9)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "ComposeOptions", scope: !2, file: !652, line: 775, type: !695, isLocal: true, isDefinition: true)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 18688, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 73)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "CompressOptions", scope: !2, file: !652, line: 851, type: !700, isLocal: true, isDefinition: true)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 6400, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 25)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "DataTypeOptions", scope: !2, file: !652, line: 930, type: !663, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "LogEventOptions", scope: !2, file: !652, line: 1315, type: !707, isLocal: true, isDefinition: true)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 5632, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 22)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "DecorateOptions", scope: !2, file: !652, line: 939, type: !663, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "DirectionOptions", scope: !2, file: !652, line: 948, type: !673, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "DisposeOptions", scope: !2, file: !652, line: 955, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2560, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 10)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "DistortOptions", scope: !2, file: !652, line: 968, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 5376, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 21)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "DitherOptions", scope: !2, file: !652, line: 992, type: !658, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "EndianOptions", scope: !2, file: !652, line: 1000, type: !673, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "EvaluateOptions", scope: !2, file: !652, line: 1007, type: !680, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "FillRuleOptions", scope: !2, file: !652, line: 1046, type: !673, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "FilterOptions", scope: !2, file: !652, line: 1053, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 8960, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 35)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "FunctionOptions", scope: !2, file: !652, line: 1092, type: !663, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "GravityOptions", scope: !2, file: !652, line: 1101, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 3584, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 14)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "PixelIntensityOptions", scope: !2, file: !652, line: 1513, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2816, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 11)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "IntentOptions", scope: !2, file: !652, line: 1118, type: !663, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "InterlaceOptions", scope: !2, file: !652, line: 1127, type: !690, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "InterpolateOptions", scope: !2, file: !652, line: 1139, type: !755, isLocal: true, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 4352, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 17)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "KernelOptions", scope: !2, file: !652, line: 1160, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 10240, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 40)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "LayerOptions", scope: !2, file: !652, line: 1203, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 4608, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 18)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "LineCapOptions", scope: !2, file: !652, line: 1224, type: !658, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "LineJoinOptions", scope: !2, file: !652, line: 1232, type: !658, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "ListOptions", scope: !2, file: !652, line: 1240, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 18432, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 72)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "MetricOptions", scope: !2, file: !652, line: 1340, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 3072, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 12)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "MethodOptions", scope: !2, file: !652, line: 1355, type: !784, isLocal: true, isDefinition: true)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1792, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 7)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "ModeOptions", scope: !2, file: !652, line: 1365, type: !658, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "MorphologyOptions", scope: !2, file: !652, line: 1373, type: !791, isLocal: true, isDefinition: true)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 7680, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 30)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "NoiseOptions", scope: !2, file: !652, line: 1406, type: !690, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "OrientationOptions", scope: !2, file: !652, line: 1418, type: !716, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "PolicyDomainOptions", scope: !2, file: !652, line: 1431, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2048, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 8)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "PolicyRightsOptions", scope: !2, file: !652, line: 1442, type: !663, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "PreviewOptions", scope: !2, file: !652, line: 1451, type: !807, isLocal: true, isDefinition: true)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 7936, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 31)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "PrimitiveOptions", scope: !2, file: !652, line: 1485, type: !755, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "QuantumFormatOptions", scope: !2, file: !652, line: 1505, type: !658, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "ResolutionOptions", scope: !2, file: !652, line: 1527, type: !673, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "ResourceOptions", scope: !2, file: !652, line: 1534, type: !690, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "SparseColorOptions", scope: !2, file: !652, line: 1546, type: !784, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "StatisticOptions", scope: !2, file: !652, line: 1556, type: !716, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "StorageOptions", scope: !2, file: !652, line: 1569, type: !690, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "StretchOptions", scope: !2, file: !652, line: 1581, type: !779, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "StyleOptions", scope: !2, file: !652, line: 1596, type: !663, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "TypeOptions", scope: !2, file: !652, line: 1605, type: !765, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "ValidateOptions", scope: !2, file: !652, line: 1626, type: !832, isLocal: true, isDefinition: true)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 3840, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 15)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "VirtualPixelOptions", scope: !2, file: !652, line: 1644, type: !837, isLocal: true, isDefinition: true)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 4864, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 19)
!840 = !{i32 7, !"Dwarf Version", i32 5}
!841 = !{i32 2, !"Debug Info Version", i32 3}
!842 = !{i32 1, !"wchar_size", i32 4}
!843 = !{i32 7, !"PIC Level", i32 2}
!844 = !{i32 7, !"PIE Level", i32 2}
!845 = !{i32 7, !"uwtable", i32 2}
!846 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!847 = distinct !DISubprogram(name: "CloneImageOptions", scope: !652, file: !652, line: 1692, type: !848, scopeLine: 1694, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1136)
!848 = !DISubroutineType(types: !849)
!849 = !{!589, !850, !1134}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !6, line: 223, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !37, line: 356, size: 134336, elements: !853)
!853 = !{!854, !856, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !871, !873, !875, !876, !877, !878, !879, !880, !881, !883, !884, !893, !894, !895, !896, !897, !898, !900, !902, !904, !905, !906, !907, !908, !909, !911, !1101, !1102, !1103, !1104, !1105, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1131, !1132, !1133}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !852, file: !37, line: 359, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !12, line: 49, baseType: !11)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !852, file: !37, line: 362, baseType: !857, size: 32, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !37, line: 86, baseType: !36)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !852, file: !37, line: 365, baseType: !589, size: 32, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !852, file: !37, line: 366, baseType: !589, size: 32, offset: 96)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !852, file: !37, line: 367, baseType: !589, size: 32, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !852, file: !37, line: 368, baseType: !589, size: 32, offset: 160)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !852, file: !37, line: 371, baseType: !590, size: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !852, file: !37, line: 372, baseType: !590, size: 64, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !852, file: !37, line: 373, baseType: !590, size: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !852, file: !37, line: 374, baseType: !590, size: 64, offset: 384)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !852, file: !37, line: 377, baseType: !594, size: 64, offset: 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !852, file: !37, line: 378, baseType: !594, size: 64, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !852, file: !37, line: 379, baseType: !594, size: 64, offset: 576)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !852, file: !37, line: 382, baseType: !870, size: 32, offset: 640)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !37, line: 73, baseType: !48)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !852, file: !37, line: 385, baseType: !872, size: 32, offset: 672)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !59, line: 35, baseType: !58)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !852, file: !37, line: 388, baseType: !874, size: 32, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !37, line: 93, baseType: !64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !852, file: !37, line: 391, baseType: !594, size: 64, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !852, file: !37, line: 394, baseType: !590, size: 64, offset: 832)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !852, file: !37, line: 395, baseType: !590, size: 64, offset: 896)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !852, file: !37, line: 396, baseType: !590, size: 64, offset: 960)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !852, file: !37, line: 397, baseType: !590, size: 64, offset: 1024)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !852, file: !37, line: 398, baseType: !590, size: 64, offset: 1088)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !852, file: !37, line: 401, baseType: !882, size: 64, offset: 1152)
!882 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !852, file: !37, line: 402, baseType: !882, size: 64, offset: 1216)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !852, file: !37, line: 405, baseType: !885, size: 64, offset: 1280)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !397, line: 148, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !397, line: 131, size: 64, elements: !887)
!887 = !{!888, !890, !891, !892}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !886, file: !397, line: 143, baseType: !889, size: 16)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !592)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !886, file: !397, line: 144, baseType: !889, size: 16, offset: 16)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !886, file: !397, line: 145, baseType: !889, size: 16, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !886, file: !397, line: 146, baseType: !889, size: 16, offset: 48)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !852, file: !37, line: 406, baseType: !885, size: 64, offset: 1344)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !852, file: !37, line: 407, baseType: !885, size: 64, offset: 1408)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !852, file: !37, line: 410, baseType: !589, size: 32, offset: 1472)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !852, file: !37, line: 411, baseType: !589, size: 32, offset: 1504)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !852, file: !37, line: 414, baseType: !594, size: 64, offset: 1536)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !852, file: !37, line: 417, baseType: !899, size: 32, offset: 1600)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !70, line: 61, baseType: !69)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !852, file: !37, line: 420, baseType: !901, size: 32, offset: 1632)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !37, line: 61, baseType: !106)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !852, file: !37, line: 423, baseType: !903, size: 32, offset: 1664)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !121, line: 59, baseType: !120)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !852, file: !37, line: 426, baseType: !582, size: 64, offset: 1728)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !852, file: !37, line: 429, baseType: !589, size: 32, offset: 1792)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !852, file: !37, line: 430, baseType: !589, size: 32, offset: 1824)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !852, file: !37, line: 433, baseType: !590, size: 64, offset: 1856)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !852, file: !37, line: 434, baseType: !590, size: 64, offset: 1920)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !852, file: !37, line: 437, baseType: !910, size: 32, offset: 1984)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !153)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !852, file: !37, line: 440, baseType: !912, size: 64, offset: 2048)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !37, line: 150, size: 105920, elements: !915)
!915 = !{!916, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !930, !931, !932, !933, !934, !948, !950, !951, !952, !953, !954, !955, !956, !957, !958, !966, !967, !968, !969, !970, !971, !973, !974, !975, !977, !979, !981, !983, !984, !985, !986, !987, !988, !989, !997, !1012, !1024, !1025, !1026, !1027, !1031, !1035, !1039, !1040, !1041, !1042, !1043, !1060, !1061, !1063, !1064, !1073, !1074, !1076, !1077, !1078, !1079, !1080, !1081, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1098, !1100}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !914, file: !37, line: 153, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !175)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !914, file: !37, line: 156, baseType: !899, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !914, file: !37, line: 159, baseType: !855, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !914, file: !37, line: 162, baseType: !594, size: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !914, file: !37, line: 165, baseType: !857, size: 32, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !914, file: !37, line: 168, baseType: !589, size: 32, offset: 224)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !914, file: !37, line: 169, baseType: !589, size: 32, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !914, file: !37, line: 172, baseType: !594, size: 64, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !914, file: !37, line: 173, baseType: !594, size: 64, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !914, file: !37, line: 174, baseType: !594, size: 64, offset: 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !914, file: !37, line: 175, baseType: !594, size: 64, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !914, file: !37, line: 178, baseType: !929, size: 64, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !914, file: !37, line: 179, baseType: !885, size: 64, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !914, file: !37, line: 180, baseType: !885, size: 64, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !914, file: !37, line: 181, baseType: !885, size: 64, offset: 768)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !914, file: !37, line: 184, baseType: !882, size: 64, offset: 832)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !914, file: !37, line: 187, baseType: !935, size: 768, offset: 896)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !37, line: 128, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !37, line: 121, size: 768, elements: !937)
!937 = !{!938, !945, !946, !947}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !936, file: !37, line: 124, baseType: !939, size: 192)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !37, line: 101, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !37, line: 95, size: 192, elements: !941)
!941 = !{!942, !943, !944}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !940, file: !37, line: 98, baseType: !882, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !940, file: !37, line: 99, baseType: !882, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !940, file: !37, line: 100, baseType: !882, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !936, file: !37, line: 125, baseType: !939, size: 192, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !936, file: !37, line: 126, baseType: !939, size: 192, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !936, file: !37, line: 127, baseType: !939, size: 192, offset: 576)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !914, file: !37, line: 190, baseType: !949, size: 32, offset: 1664)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !181, line: 49, baseType: !180)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !914, file: !37, line: 193, baseType: !564, size: 64, offset: 1728)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !914, file: !37, line: 196, baseType: !874, size: 32, offset: 1792)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !914, file: !37, line: 199, baseType: !590, size: 64, offset: 1856)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !914, file: !37, line: 200, baseType: !590, size: 64, offset: 1920)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !914, file: !37, line: 201, baseType: !590, size: 64, offset: 1984)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !914, file: !37, line: 204, baseType: !582, size: 64, offset: 2048)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !914, file: !37, line: 207, baseType: !882, size: 64, offset: 2112)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !914, file: !37, line: 208, baseType: !882, size: 64, offset: 2176)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !914, file: !37, line: 211, baseType: !959, size: 256, offset: 2240)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !224, line: 130, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !224, line: 121, size: 256, elements: !961)
!961 = !{!962, !963, !964, !965}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !960, file: !224, line: 124, baseType: !594, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !960, file: !224, line: 125, baseType: !594, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !960, file: !224, line: 128, baseType: !582, size: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !960, file: !224, line: 129, baseType: !582, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !914, file: !37, line: 212, baseType: !959, size: 256, offset: 2496)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !914, file: !37, line: 213, baseType: !959, size: 256, offset: 2752)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !914, file: !37, line: 216, baseType: !882, size: 64, offset: 3008)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !914, file: !37, line: 217, baseType: !882, size: 64, offset: 3072)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !914, file: !37, line: 218, baseType: !882, size: 64, offset: 3136)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !914, file: !37, line: 221, baseType: !972, size: 32, offset: 3200)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !189, line: 66, baseType: !188)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !914, file: !37, line: 224, baseType: !870, size: 32, offset: 3232)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !914, file: !37, line: 227, baseType: !872, size: 32, offset: 3264)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !914, file: !37, line: 230, baseType: !976, size: 32, offset: 3296)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !224, line: 91, baseType: !223)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !914, file: !37, line: 233, baseType: !978, size: 32, offset: 3328)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !239, line: 99, baseType: !238)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !914, file: !37, line: 236, baseType: !980, size: 32, offset: 3360)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !310, line: 32, baseType: !309)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !914, file: !37, line: 239, baseType: !982, size: 64, offset: 3392)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !914, file: !37, line: 242, baseType: !594, size: 64, offset: 3456)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !914, file: !37, line: 243, baseType: !594, size: 64, offset: 3520)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !914, file: !37, line: 246, baseType: !582, size: 64, offset: 3584)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !914, file: !37, line: 249, baseType: !594, size: 64, offset: 3648)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !914, file: !37, line: 250, baseType: !594, size: 64, offset: 3712)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !914, file: !37, line: 253, baseType: !582, size: 64, offset: 3776)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !914, file: !37, line: 256, baseType: !990, size: 192, offset: 3840)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !991, line: 68, baseType: !992)
!991 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !991, line: 62, size: 192, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !992, file: !991, line: 65, baseType: !882, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !992, file: !991, line: 66, baseType: !882, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !992, file: !991, line: 67, baseType: !882, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !914, file: !37, line: 259, baseType: !998, size: 512, offset: 4032)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !318, line: 51, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !318, line: 40, size: 512, elements: !1000)
!1000 = !{!1001, !1008, !1009, !1011}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !999, file: !318, line: 43, baseType: !1002, size: 192)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !318, line: 38, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !318, line: 32, size: 192, elements: !1004)
!1004 = !{!1005, !1006, !1007}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1003, file: !318, line: 35, baseType: !882, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1003, file: !318, line: 36, baseType: !882, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1003, file: !318, line: 37, baseType: !882, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !999, file: !318, line: 44, baseType: !1002, size: 192, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !999, file: !318, line: 47, baseType: !1010, size: 32, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !318, line: 30, baseType: !317)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !999, file: !318, line: 50, baseType: !594, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !914, file: !37, line: 262, baseType: !1013, size: 64, offset: 4544)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !1014, line: 26, baseType: !1015)
!1014 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!589, !572, !1018, !1021, !564}
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !1020)
!1020 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !1023)
!1023 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !914, file: !37, line: 265, baseType: !564, size: 64, offset: 4608)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !914, file: !37, line: 266, baseType: !564, size: 64, offset: 4672)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !914, file: !37, line: 267, baseType: !564, size: 64, offset: 4736)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !914, file: !37, line: 270, baseType: !1028, size: 64, offset: 4800)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !12, line: 52, baseType: !1030)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !12, line: 51, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !914, file: !37, line: 273, baseType: !1032, size: 64, offset: 4864)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !1034)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !914, file: !37, line: 276, baseType: !1036, size: 32768, offset: 4928)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 32768, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 4096)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !914, file: !37, line: 277, baseType: !1036, size: 32768, offset: 37696)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !914, file: !37, line: 278, baseType: !1036, size: 32768, offset: 70464)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !914, file: !37, line: 281, baseType: !594, size: 64, offset: 103232)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !914, file: !37, line: 282, baseType: !594, size: 64, offset: 103296)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !914, file: !37, line: 285, baseType: !1044, size: 448, offset: 103360)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !324, line: 102, size: 448, elements: !1046)
!1046 = !{!1047, !1049, !1050, !1051, !1052, !1053, !1054, !1059}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !1045, file: !324, line: 105, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !324, line: 100, baseType: !323)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !1045, file: !324, line: 108, baseType: !473, size: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !1045, file: !324, line: 111, baseType: !590, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1045, file: !324, line: 112, baseType: !590, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !1045, file: !324, line: 115, baseType: !564, size: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !1045, file: !324, line: 118, baseType: !589, size: 32, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1045, file: !324, line: 121, baseType: !1055, size: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !1057, line: 26, baseType: !1058)
!1057 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!1058 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !1057, line: 25, flags: DIFlagFwdDecl)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1045, file: !324, line: 124, baseType: !594, size: 64, offset: 384)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !914, file: !37, line: 288, baseType: !589, size: 32, offset: 103808)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !914, file: !37, line: 291, baseType: !1062, size: 64, offset: 103872)
!1062 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !582)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !914, file: !37, line: 294, baseType: !1055, size: 64, offset: 103936)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !914, file: !37, line: 297, baseType: !1065, size: 256, offset: 104000)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !181, line: 40, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !181, line: 27, size: 256, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1072}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1066, file: !181, line: 30, baseType: !590, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1066, file: !181, line: 33, baseType: !594, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1066, file: !181, line: 36, baseType: !1071, size: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1066, file: !181, line: 39, baseType: !594, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !914, file: !37, line: 298, baseType: !1065, size: 256, offset: 104256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !914, file: !37, line: 299, baseType: !1075, size: 64, offset: 104512)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !914, file: !37, line: 302, baseType: !594, size: 64, offset: 104576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !914, file: !37, line: 305, baseType: !594, size: 64, offset: 104640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !914, file: !37, line: 308, baseType: !982, size: 64, offset: 104704)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !914, file: !37, line: 309, baseType: !982, size: 64, offset: 104768)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !914, file: !37, line: 310, baseType: !982, size: 64, offset: 104832)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !914, file: !37, line: 313, baseType: !1082, size: 32, offset: 104896)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !397, line: 47, baseType: !396)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !914, file: !37, line: 316, baseType: !589, size: 32, offset: 104928)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !914, file: !37, line: 319, baseType: !885, size: 64, offset: 104960)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !914, file: !37, line: 322, baseType: !982, size: 64, offset: 105024)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !914, file: !37, line: 325, baseType: !959, size: 256, offset: 105088)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !914, file: !37, line: 328, baseType: !564, size: 64, offset: 105344)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !914, file: !37, line: 329, baseType: !564, size: 64, offset: 105408)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !914, file: !37, line: 332, baseType: !901, size: 32, offset: 105472)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !914, file: !37, line: 335, baseType: !589, size: 32, offset: 105504)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !914, file: !37, line: 338, baseType: !1022, size: 64, offset: 105536)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !914, file: !37, line: 341, baseType: !589, size: 32, offset: 105600)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !914, file: !37, line: 344, baseType: !594, size: 64, offset: 105664)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !914, file: !37, line: 347, baseType: !1095, size: 64, offset: 105728)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1096, line: 7, baseType: !1097)
!1096 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !585, line: 160, baseType: !586)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !914, file: !37, line: 350, baseType: !1099, size: 32, offset: 105792)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !397, line: 79, baseType: !413)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !914, file: !37, line: 353, baseType: !594, size: 64, offset: 105856)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !852, file: !37, line: 443, baseType: !564, size: 64, offset: 2112)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !852, file: !37, line: 446, baseType: !1013, size: 64, offset: 2176)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !852, file: !37, line: 449, baseType: !564, size: 64, offset: 2240)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !852, file: !37, line: 450, baseType: !564, size: 64, offset: 2304)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !852, file: !37, line: 453, baseType: !1106, size: 64, offset: 2368)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1107, line: 26, baseType: !1108)
!1107 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!594, !1111, !1113, !1115}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !852, file: !37, line: 456, baseType: !596, size: 64, offset: 2432)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !852, file: !37, line: 459, baseType: !564, size: 64, offset: 2496)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !852, file: !37, line: 462, baseType: !594, size: 64, offset: 2560)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !852, file: !37, line: 465, baseType: !1036, size: 32768, offset: 2624)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !852, file: !37, line: 466, baseType: !1036, size: 32768, offset: 35392)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !852, file: !37, line: 467, baseType: !1036, size: 32768, offset: 68160)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !852, file: !37, line: 468, baseType: !1036, size: 32768, offset: 100928)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !852, file: !37, line: 471, baseType: !589, size: 32, offset: 133696)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !852, file: !37, line: 474, baseType: !590, size: 64, offset: 133760)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !852, file: !37, line: 477, baseType: !594, size: 64, offset: 133824)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !852, file: !37, line: 478, baseType: !594, size: 64, offset: 133888)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !852, file: !37, line: 481, baseType: !885, size: 64, offset: 133952)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !852, file: !37, line: 484, baseType: !594, size: 64, offset: 134016)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !852, file: !37, line: 487, baseType: !1130, size: 32, offset: 134080)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !426, line: 47, baseType: !425)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !852, file: !37, line: 490, baseType: !885, size: 64, offset: 134112)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !852, file: !37, line: 493, baseType: !564, size: 64, offset: 134208)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !852, file: !37, line: 496, baseType: !589, size: 32, offset: 134272)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!1136 = !{!1137, !1138}
!1137 = !DILocalVariable(name: "image_info", arg: 1, scope: !847, file: !652, line: 1692, type: !850)
!1138 = !DILocalVariable(name: "clone_info", arg: 2, scope: !847, file: !652, line: 1693, type: !1134)
!1139 = !DILocation(line: 0, scope: !847)
!1140 = !DILocation(line: 1697, column: 19, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !847, file: !652, line: 1697, column: 7)
!1142 = !{!1143, !1144, i64 16712}
!1143 = !{!"_ImageInfo", !1144, i64 0, !1144, i64 4, !1144, i64 8, !1144, i64 12, !1144, i64 16, !1144, i64 20, !1146, i64 24, !1146, i64 32, !1146, i64 40, !1146, i64 48, !1147, i64 56, !1147, i64 64, !1147, i64 72, !1144, i64 80, !1144, i64 84, !1144, i64 88, !1147, i64 96, !1146, i64 104, !1146, i64 112, !1146, i64 120, !1146, i64 128, !1146, i64 136, !1148, i64 144, !1148, i64 152, !1149, i64 160, !1149, i64 168, !1149, i64 176, !1144, i64 184, !1144, i64 188, !1147, i64 192, !1144, i64 200, !1144, i64 204, !1144, i64 208, !1147, i64 216, !1144, i64 224, !1144, i64 228, !1146, i64 232, !1146, i64 240, !1144, i64 248, !1146, i64 256, !1146, i64 264, !1146, i64 272, !1146, i64 280, !1146, i64 288, !1146, i64 296, !1146, i64 304, !1146, i64 312, !1147, i64 320, !1144, i64 328, !1144, i64 4424, !1144, i64 8520, !1144, i64 12616, !1144, i64 16712, !1146, i64 16720, !1147, i64 16728, !1147, i64 16736, !1149, i64 16744, !1147, i64 16752, !1144, i64 16760, !1149, i64 16764, !1146, i64 16776, !1144, i64 16784}
!1144 = !{!"omnipotent char", !1145, i64 0}
!1145 = !{!"Simple C/C++ TBAA"}
!1146 = !{!"any pointer", !1144, i64 0}
!1147 = !{!"long", !1144, i64 0}
!1148 = !{!"double", !1144, i64 0}
!1149 = !{!"_PixelPacket", !1150, i64 0, !1150, i64 2, !1150, i64 4, !1150, i64 6}
!1150 = !{!"short", !1144, i64 0}
!1151 = !DILocation(line: 1697, column: 25, scope: !1141)
!1152 = !DILocation(line: 1697, column: 7, scope: !847)
!1153 = !DILocation(line: 1699, column: 19, scope: !1141)
!1154 = !DILocation(line: 1698, column: 12, scope: !1141)
!1155 = !DILocation(line: 1698, column: 5, scope: !1141)
!1156 = !DILocation(line: 1702, column: 19, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !847, file: !652, line: 1702, column: 7)
!1158 = !{!1143, !1146, i64 264}
!1159 = !DILocation(line: 1702, column: 27, scope: !1157)
!1160 = !DILocation(line: 1702, column: 7, scope: !847)
!1161 = !DILocation(line: 1704, column: 23, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !652, line: 1704, column: 11)
!1163 = distinct !DILexicalBlock(scope: !1157, file: !652, line: 1703, column: 5)
!1164 = !DILocation(line: 1704, column: 31, scope: !1162)
!1165 = !DILocation(line: 1704, column: 11, scope: !1163)
!1166 = !DILocalVariable(name: "image_info", arg: 1, scope: !1167, file: !652, line: 1820, type: !850)
!1167 = distinct !DISubprogram(name: "DestroyImageOptions", scope: !652, file: !652, line: 1820, type: !1168, scopeLine: 1821, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1170)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{null, !850}
!1170 = !{!1166}
!1171 = !DILocation(line: 0, scope: !1167, inlinedAt: !1172)
!1172 = distinct !DILocation(line: 1705, column: 9, scope: !1162)
!1173 = !DILocation(line: 1824, column: 19, scope: !1174, inlinedAt: !1172)
!1174 = distinct !DILexicalBlock(scope: !1167, file: !652, line: 1824, column: 7)
!1175 = !DILocation(line: 1824, column: 25, scope: !1174, inlinedAt: !1172)
!1176 = !DILocation(line: 1824, column: 7, scope: !1167, inlinedAt: !1172)
!1177 = !DILocation(line: 1826, column: 19, scope: !1174, inlinedAt: !1172)
!1178 = !DILocation(line: 1825, column: 12, scope: !1174, inlinedAt: !1172)
