; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/paint.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/paint.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._PixelPacket = type { i16, i16, i16, i16 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }

!484 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!485 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!486 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!487 = !DIEnumerator(name: "TransformEvent", value: 16384)
!488 = !DIEnumerator(name: "UserEvent", value: 36864)
!489 = !DIEnumerator(name: "WandEvent", value: 65536)
!490 = !DIEnumerator(name: "X11Event", value: 131072)
!491 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!492 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 30, baseType: !5, size: 32, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!495 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!496 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!497 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!498 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!499 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!500 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!501 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!502 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!503 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!504 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!505 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!506 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!507 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 27, baseType: !5, size: 32, elements: !510)
!509 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!511 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!512 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!513 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!514 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!515 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!516 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!517 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!518 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!519 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!520 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!521 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!522 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!523 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!524 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!525 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!526 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!527 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!528 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!529 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !530, line: 25, baseType: !5, size: 32, elements: !531)
!530 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540}
!532 = !DIEnumerator(name: "UndefinedResource", value: 0)
!533 = !DIEnumerator(name: "AreaResource", value: 1)
!534 = !DIEnumerator(name: "DiskResource", value: 2)
!535 = !DIEnumerator(name: "FileResource", value: 3)
!536 = !DIEnumerator(name: "MapResource", value: 4)
!537 = !DIEnumerator(name: "MemoryResource", value: 5)
!538 = !DIEnumerator(name: "ThreadResource", value: 6)
!539 = !DIEnumerator(name: "TimeResource", value: 7)
!540 = !DIEnumerator(name: "ThrottleResource", value: 8)
!541 = !{!542, !543, !548, !550, !603, !764, !768, !585, !561, !776, !573, !778, !779, !780, !801, !803, !671, !794, !802, !733}
!542 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !544, line: 77, baseType: !545)
!544 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !546, line: 193, baseType: !547)
!546 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!547 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !549)
!549 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !553)
!553 = !{!554, !556, !558, !560, !563, !565, !567, !568, !569, !570, !571, !572, !581, !582, !583, !584, !586, !600, !602, !604, !606, !609, !610, !611, !612, !613, !614, !622, !623, !624, !625, !626, !627, !629, !631, !633, !635, !637, !639, !641, !642, !643, !644, !645, !646, !647, !655, !670, !684, !685, !686, !687, !691, !695, !699, !700, !701, !702, !703, !721, !722, !724, !725, !735, !736, !738, !739, !740, !741, !742, !743, !745, !746, !747, !748, !749, !750, !751, !753, !754, !755, !756, !757, !761, !763}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !552, file: !77, line: 153, baseType: !555, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !552, file: !77, line: 156, baseType: !557, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !552, file: !77, line: 159, baseType: !559, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !552, file: !77, line: 162, baseType: !561, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !562, line: 46, baseType: !542)
!562 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!563 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !552, file: !77, line: 165, baseType: !564, size: 32, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !552, file: !77, line: 168, baseType: !566, size: 32, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !552, file: !77, line: 169, baseType: !566, size: 32, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !552, file: !77, line: 172, baseType: !561, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !552, file: !77, line: 173, baseType: !561, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !552, file: !77, line: 174, baseType: !561, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !552, file: !77, line: 175, baseType: !561, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !552, file: !77, line: 178, baseType: !573, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !576)
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !575, file: !326, line: 143, baseType: !548, size: 16)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !575, file: !326, line: 144, baseType: !548, size: 16, offset: 16)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !575, file: !326, line: 145, baseType: !548, size: 16, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !575, file: !326, line: 146, baseType: !548, size: 16, offset: 48)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !552, file: !77, line: 179, baseType: !574, size: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !552, file: !77, line: 180, baseType: !574, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !552, file: !77, line: 181, baseType: !574, size: 64, offset: 768)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !552, file: !77, line: 184, baseType: !585, size: 64, offset: 832)
!585 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !552, file: !77, line: 187, baseType: !587, size: 768, offset: 896)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !589)
!589 = !{!590, !597, !598, !599}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !588, file: !77, line: 124, baseType: !591, size: 192)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !592, file: !77, line: 98, baseType: !585, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !592, file: !77, line: 99, baseType: !585, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !592, file: !77, line: 100, baseType: !585, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !588, file: !77, line: 125, baseType: !591, size: 192, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !588, file: !77, line: 126, baseType: !591, size: 192, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !588, file: !77, line: 127, baseType: !591, size: 192, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !552, file: !77, line: 190, baseType: !601, size: 32, offset: 1664)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !552, file: !77, line: 193, baseType: !603, size: 64, offset: 1728)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !552, file: !77, line: 196, baseType: !605, size: 32, offset: 1792)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !552, file: !77, line: 199, baseType: !607, size: 64, offset: 1856)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !552, file: !77, line: 200, baseType: !607, size: 64, offset: 1920)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !552, file: !77, line: 201, baseType: !607, size: 64, offset: 1984)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !552, file: !77, line: 204, baseType: !543, size: 64, offset: 2048)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !552, file: !77, line: 207, baseType: !585, size: 64, offset: 2112)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !552, file: !77, line: 208, baseType: !585, size: 64, offset: 2176)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !552, file: !77, line: 211, baseType: !615, size: 256, offset: 2240)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !617)
!617 = !{!618, !619, !620, !621}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !616, file: !153, line: 124, baseType: !561, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !616, file: !153, line: 125, baseType: !561, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !616, file: !153, line: 128, baseType: !543, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !616, file: !153, line: 129, baseType: !543, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !552, file: !77, line: 212, baseType: !615, size: 256, offset: 2496)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !552, file: !77, line: 213, baseType: !615, size: 256, offset: 2752)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !552, file: !77, line: 216, baseType: !585, size: 64, offset: 3008)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !552, file: !77, line: 217, baseType: !585, size: 64, offset: 3072)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !552, file: !77, line: 218, baseType: !585, size: 64, offset: 3136)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !552, file: !77, line: 221, baseType: !628, size: 32, offset: 3200)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !552, file: !77, line: 224, baseType: !630, size: 32, offset: 3232)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !552, file: !77, line: 227, baseType: !632, size: 32, offset: 3264)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !552, file: !77, line: 230, baseType: !634, size: 32, offset: 3296)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !552, file: !77, line: 233, baseType: !636, size: 32, offset: 3328)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !552, file: !77, line: 236, baseType: !638, size: 32, offset: 3360)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !552, file: !77, line: 239, baseType: !640, size: 64, offset: 3392)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !552, file: !77, line: 242, baseType: !561, size: 64, offset: 3456)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !552, file: !77, line: 243, baseType: !561, size: 64, offset: 3520)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !552, file: !77, line: 246, baseType: !543, size: 64, offset: 3584)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !552, file: !77, line: 249, baseType: !561, size: 64, offset: 3648)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !552, file: !77, line: 250, baseType: !561, size: 64, offset: 3712)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !552, file: !77, line: 253, baseType: !543, size: 64, offset: 3776)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !552, file: !77, line: 256, baseType: !648, size: 192, offset: 3840)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !649, line: 68, baseType: !650)
!649 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !649, line: 62, size: 192, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !650, file: !649, line: 65, baseType: !585, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !650, file: !649, line: 66, baseType: !585, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !650, file: !649, line: 67, baseType: !585, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !552, file: !77, line: 259, baseType: !656, size: 512, offset: 4032)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !658)
!658 = !{!659, !666, !667, !669}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !657, file: !247, line: 43, baseType: !660, size: 192)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !662)
!662 = !{!663, !664, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !661, file: !247, line: 35, baseType: !585, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !661, file: !247, line: 36, baseType: !585, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !661, file: !247, line: 37, baseType: !585, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !657, file: !247, line: 44, baseType: !660, size: 192, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !657, file: !247, line: 47, baseType: !668, size: 32, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !657, file: !247, line: 50, baseType: !561, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !552, file: !77, line: 262, baseType: !671, size: 64, offset: 4544)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !672, line: 26, baseType: !673)
!672 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!566, !676, !678, !681, !603}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !680)
!680 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !683)
!683 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !552, file: !77, line: 265, baseType: !603, size: 64, offset: 4608)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !552, file: !77, line: 266, baseType: !603, size: 64, offset: 4672)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !552, file: !77, line: 267, baseType: !603, size: 64, offset: 4736)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !552, file: !77, line: 270, baseType: !688, size: 64, offset: 4800)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !690)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !552, file: !77, line: 273, baseType: !692, size: 64, offset: 4864)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !552, file: !77, line: 276, baseType: !696, size: 32768, offset: 4928)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 32768, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 4096)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !552, file: !77, line: 277, baseType: !696, size: 32768, offset: 37696)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !552, file: !77, line: 278, baseType: !696, size: 32768, offset: 70464)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !552, file: !77, line: 281, baseType: !561, size: 64, offset: 103232)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !552, file: !77, line: 282, baseType: !561, size: 64, offset: 103296)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !552, file: !77, line: 285, baseType: !704, size: 448, offset: 103360)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !706)
!706 = !{!707, !709, !711, !712, !713, !714, !715, !720}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !705, file: !253, line: 105, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !705, file: !253, line: 108, baseType: !710, size: 32, offset: 32)
!710 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !705, file: !253, line: 111, baseType: !607, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !705, file: !253, line: 112, baseType: !607, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !705, file: !253, line: 115, baseType: !603, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !705, file: !253, line: 118, baseType: !566, size: 32, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !705, file: !253, line: 121, baseType: !716, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !718, line: 26, baseType: !719)
!718 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !718, line: 25, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !705, file: !253, line: 124, baseType: !561, size: 64, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !552, file: !77, line: 288, baseType: !566, size: 32, offset: 103808)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !552, file: !77, line: 291, baseType: !723, size: 64, offset: 103872)
!723 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !543)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !552, file: !77, line: 294, baseType: !716, size: 64, offset: 103936)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !552, file: !77, line: 297, baseType: !726, size: 256, offset: 104000)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !728)
!728 = !{!729, !730, !731, !734}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !727, file: !89, line: 30, baseType: !607, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !727, file: !89, line: 33, baseType: !561, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !727, file: !89, line: 36, baseType: !732, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !727, file: !89, line: 39, baseType: !561, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !552, file: !77, line: 298, baseType: !726, size: 256, offset: 104256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !552, file: !77, line: 299, baseType: !737, size: 64, offset: 104512)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !552, file: !77, line: 302, baseType: !561, size: 64, offset: 104576)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !552, file: !77, line: 305, baseType: !561, size: 64, offset: 104640)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !552, file: !77, line: 308, baseType: !640, size: 64, offset: 104704)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !552, file: !77, line: 309, baseType: !640, size: 64, offset: 104768)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !552, file: !77, line: 310, baseType: !640, size: 64, offset: 104832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !552, file: !77, line: 313, baseType: !744, size: 32, offset: 104896)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !552, file: !77, line: 316, baseType: !566, size: 32, offset: 104928)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !552, file: !77, line: 319, baseType: !574, size: 64, offset: 104960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !552, file: !77, line: 322, baseType: !640, size: 64, offset: 105024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !552, file: !77, line: 325, baseType: !615, size: 256, offset: 105088)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !552, file: !77, line: 328, baseType: !603, size: 64, offset: 105344)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !552, file: !77, line: 329, baseType: !603, size: 64, offset: 105408)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !552, file: !77, line: 332, baseType: !752, size: 32, offset: 105472)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !552, file: !77, line: 335, baseType: !566, size: 32, offset: 105504)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !552, file: !77, line: 338, baseType: !682, size: 64, offset: 105536)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !552, file: !77, line: 341, baseType: !566, size: 32, offset: 105600)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !552, file: !77, line: 344, baseType: !561, size: 64, offset: 105664)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !552, file: !77, line: 347, baseType: !758, size: 64, offset: 105728)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !759, line: 7, baseType: !760)
!759 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !546, line: 160, baseType: !547)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !552, file: !77, line: 350, baseType: !762, size: 32, offset: 105792)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !552, file: !77, line: 353, baseType: !561, size: 64, offset: 105856)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryInfo", file: !766, line: 26, baseType: !767)
!766 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MemoryInfo", file: !766, line: 25, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !77, line: 110, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !77, line: 103, size: 256, elements: !771)
!771 = !{!772, !773, !774, !775}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !770, file: !77, line: 106, baseType: !585, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !770, file: !77, line: 107, baseType: !585, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !770, file: !77, line: 108, baseType: !585, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !770, file: !77, line: 109, baseType: !585, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !548)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "StopInfo", file: !391, line: 151, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StopInfo", file: !391, line: 144, size: 512, elements: !783)
!783 = !{!784, !800}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !782, file: !391, line: 147, baseType: !785, size: 448)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !796, !797, !798, !799}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !786, file: !326, line: 107, baseType: !555, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !786, file: !326, line: 110, baseType: !557, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !786, file: !326, line: 113, baseType: !566, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !786, file: !326, line: 116, baseType: !585, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !786, file: !326, line: 119, baseType: !561, size: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !786, file: !326, line: 122, baseType: !794, size: 32, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !795)
!795 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !786, file: !326, line: 123, baseType: !794, size: 32, offset: 288)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !786, file: !326, line: 124, baseType: !794, size: 32, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !786, file: !326, line: 125, baseType: !794, size: 32, offset: 352)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !786, file: !326, line: 126, baseType: !794, size: 32, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !782, file: !391, line: 150, baseType: !794, size: 32, offset: 448)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!805 = !{i32 7, !"Dwarf Version", i32 5}
!806 = !{i32 2, !"Debug Info Version", i32 3}
!807 = !{i32 1, !"wchar_size", i32 4}
!808 = !{i32 7, !"PIC Level", i32 2}
!809 = !{i32 7, !"PIE Level", i32 2}
!810 = !{i32 7, !"uwtable", i32 2}
!811 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!812 = distinct !DISubprogram(name: "FloodfillPaintImage", scope: !813, file: !813, line: 107, type: !814, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !926)
!813 = !DIFile(filename: "apps/538.imagick_r/src/magick/paint.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b6c498e55ae73bc8e15c1bc95712f35f")
!814 = !DISubroutineType(types: !815)
!815 = !{!566, !550, !816, !818, !922, !924, !924, !925}
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !368)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawInfo", file: !391, line: 333, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DrawInfo", file: !391, line: 205, size: 5760, elements: !822)
!822 = !{!823, !824, !825, !826, !836, !837, !838, !839, !840, !861, !862, !863, !864, !865, !866, !868, !870, !872, !873, !874, !876, !877, !878, !879, !880, !881, !882, !884, !886, !887, !888, !889, !890, !892, !893, !894, !895, !897, !898, !899, !901, !902, !903, !915, !916, !917, !918, !919, !920}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !821, file: !391, line: 208, baseType: !607, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !821, file: !391, line: 209, baseType: !607, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "viewbox", scope: !821, file: !391, line: 212, baseType: !615, size: 256, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "affine", scope: !821, file: !391, line: 215, baseType: !827, size: 384, offset: 384)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !153, line: 102, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !153, line: 93, size: 384, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !828, file: !153, line: 96, baseType: !585, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !828, file: !153, line: 97, baseType: !585, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !828, file: !153, line: 98, baseType: !585, size: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !828, file: !153, line: 99, baseType: !585, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !828, file: !153, line: 100, baseType: !585, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !828, file: !153, line: 101, baseType: !585, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !821, file: !391, line: 218, baseType: !634, size: 32, offset: 768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !821, file: !391, line: 221, baseType: !574, size: 64, offset: 800)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !821, file: !391, line: 222, baseType: !574, size: 64, offset: 864)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_width", scope: !821, file: !391, line: 225, baseType: !585, size: 64, offset: 960)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !821, file: !391, line: 228, baseType: !841, size: 1024, offset: 1024)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientInfo", file: !391, line: 184, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GradientInfo", file: !391, line: 153, size: 1024, elements: !843)
!843 = !{!844, !846, !847, !848, !849, !850, !852, !853, !854, !860}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !842, file: !391, line: 156, baseType: !845, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientType", file: !391, line: 75, baseType: !390)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bounding_box", scope: !842, file: !391, line: 159, baseType: !615, size: 256, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_vector", scope: !842, file: !391, line: 162, baseType: !769, size: 256, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "stops", scope: !842, file: !391, line: 165, baseType: !780, size: 64, offset: 576)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "number_stops", scope: !842, file: !391, line: 168, baseType: !561, size: 64, offset: 640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !842, file: !391, line: 171, baseType: !851, size: 32, offset: 704)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpreadMethod", file: !391, line: 135, baseType: !396)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !842, file: !391, line: 174, baseType: !566, size: 32, offset: 736)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !842, file: !391, line: 177, baseType: !561, size: 64, offset: 768)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !842, file: !391, line: 180, baseType: !855, size: 128, offset: 832)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !391, line: 142, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !391, line: 137, size: 128, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !856, file: !391, line: 140, baseType: !585, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !856, file: !391, line: 141, baseType: !585, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !842, file: !391, line: 183, baseType: !794, size: 32, offset: 960)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fill_pattern", scope: !821, file: !391, line: 231, baseType: !550, size: 64, offset: 2048)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !821, file: !391, line: 232, baseType: !550, size: 64, offset: 2112)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_pattern", scope: !821, file: !391, line: 233, baseType: !550, size: 64, offset: 2176)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_antialias", scope: !821, file: !391, line: 236, baseType: !566, size: 32, offset: 2240)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "text_antialias", scope: !821, file: !391, line: 237, baseType: !566, size: 32, offset: 2272)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !821, file: !391, line: 240, baseType: !867, size: 32, offset: 2304)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "FillRule", file: !391, line: 68, baseType: !402)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "linecap", scope: !821, file: !391, line: 243, baseType: !869, size: 32, offset: 2336)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineCap", file: !391, line: 83, baseType: !407)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "linejoin", scope: !821, file: !391, line: 246, baseType: !871, size: 32, offset: 2368)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineJoin", file: !391, line: 91, baseType: !413)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "miterlimit", scope: !821, file: !391, line: 249, baseType: !561, size: 64, offset: 2432)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !821, file: !391, line: 252, baseType: !585, size: 64, offset: 2496)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decorate", scope: !821, file: !391, line: 255, baseType: !875, size: 32, offset: 2560)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecorationType", file: !391, line: 53, baseType: !419)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !821, file: !391, line: 258, baseType: !636, size: 32, offset: 2592)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !821, file: !391, line: 261, baseType: !607, size: 64, offset: 2624)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !821, file: !391, line: 264, baseType: !561, size: 64, offset: 2688)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !821, file: !391, line: 267, baseType: !607, size: 64, offset: 2752)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !821, file: !391, line: 268, baseType: !607, size: 64, offset: 2816)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !821, file: !391, line: 269, baseType: !607, size: 64, offset: 2880)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !821, file: !391, line: 272, baseType: !883, size: 32, offset: 2944)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleType", file: !427, line: 47, baseType: !426)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !821, file: !391, line: 275, baseType: !885, size: 32, offset: 2976)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "StretchType", file: !427, line: 38, baseType: !434)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !821, file: !391, line: 278, baseType: !561, size: 64, offset: 3008)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !821, file: !391, line: 281, baseType: !607, size: 64, offset: 3072)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !821, file: !391, line: 284, baseType: !585, size: 64, offset: 3136)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !821, file: !391, line: 287, baseType: !607, size: 64, offset: 3200)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !821, file: !391, line: 290, baseType: !891, size: 32, offset: 3264)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlignType", file: !391, line: 36, baseType: !447)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "undercolor", scope: !821, file: !391, line: 293, baseType: !574, size: 64, offset: 3296)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !821, file: !391, line: 294, baseType: !574, size: 64, offset: 3360)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !821, file: !391, line: 297, baseType: !607, size: 64, offset: 3456)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "dash_pattern", scope: !821, file: !391, line: 300, baseType: !896, size: 64, offset: 3520)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !821, file: !391, line: 303, baseType: !607, size: 64, offset: 3584)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !821, file: !391, line: 306, baseType: !769, size: 256, offset: 3648)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "clip_units", scope: !821, file: !391, line: 309, baseType: !900, size: 32, offset: 3904)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClipPathUnits", file: !391, line: 44, baseType: !453)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !821, file: !391, line: 312, baseType: !548, size: 16, offset: 3936)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "render", scope: !821, file: !391, line: 315, baseType: !566, size: 32, offset: 3968)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "element_reference", scope: !821, file: !391, line: 318, baseType: !904, size: 1344, offset: 4032)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementReference", file: !391, line: 203, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ElementReference", file: !391, line: 186, size: 1344, elements: !906)
!906 = !{!907, !908, !910, !911, !912, !914}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !905, file: !391, line: 189, baseType: !607, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !905, file: !391, line: 192, baseType: !909, size: 32, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReferenceType", file: !391, line: 127, baseType: !459)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !905, file: !391, line: 195, baseType: !841, size: 1024, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !905, file: !391, line: 198, baseType: !561, size: 64, offset: 1152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !905, file: !391, line: 201, baseType: !913, size: 64, offset: 1216)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !905, file: !391, line: 202, baseType: !913, size: 64, offset: 1280)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !821, file: !391, line: 321, baseType: !566, size: 32, offset: 5376)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !821, file: !391, line: 324, baseType: !561, size: 64, offset: 5440)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !821, file: !391, line: 327, baseType: !585, size: 64, offset: 5504)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "interword_spacing", scope: !821, file: !391, line: 328, baseType: !585, size: 64, offset: 5568)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "interline_spacing", scope: !821, file: !391, line: 329, baseType: !585, size: 64, offset: 5632)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !821, file: !391, line: 332, baseType: !921, size: 32, offset: 5696)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectionType", file: !391, line: 60, baseType: !463)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!926 = !{!927, !928, !929, !930, !931, !932, !933, !934, !938, !939, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !958, !960, !961, !963, !967, !969, !970}
!927 = !DILocalVariable(name: "image", arg: 1, scope: !812, file: !813, line: 107, type: !550)
!928 = !DILocalVariable(name: "channel", arg: 2, scope: !812, file: !813, line: 108, type: !816)
!929 = !DILocalVariable(name: "draw_info", arg: 3, scope: !812, file: !813, line: 108, type: !818)
!930 = !DILocalVariable(name: "target", arg: 4, scope: !812, file: !813, line: 109, type: !922)
!931 = !DILocalVariable(name: "x_offset", arg: 5, scope: !812, file: !813, line: 109, type: !924)
!932 = !DILocalVariable(name: "y_offset", arg: 6, scope: !812, file: !813, line: 109, type: !924)
!933 = !DILocalVariable(name: "invert", arg: 7, scope: !812, file: !813, line: 110, type: !925)
!934 = !DILocalVariable(name: "floodplane_view", scope: !812, file: !813, line: 131, type: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !509, line: 50, baseType: !937)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!938 = !DILocalVariable(name: "image_view", scope: !812, file: !813, line: 132, type: !935)
!939 = !DILocalVariable(name: "exception", scope: !812, file: !813, line: 135, type: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!941 = !DILocalVariable(name: "floodplane_image", scope: !812, file: !813, line: 138, type: !550)
!942 = !DILocalVariable(name: "skip", scope: !812, file: !813, line: 141, type: !566)
!943 = !DILocalVariable(name: "fill", scope: !812, file: !813, line: 144, type: !785)
!944 = !DILocalVariable(name: "pixel", scope: !812, file: !813, line: 145, type: !785)
!945 = !DILocalVariable(name: "segment_info", scope: !812, file: !813, line: 148, type: !764)
!946 = !DILocalVariable(name: "fill_color", scope: !812, file: !813, line: 151, type: !574)
!947 = !DILocalVariable(name: "s", scope: !812, file: !813, line: 154, type: !768)
!948 = !DILocalVariable(name: "segment_stack", scope: !812, file: !813, line: 157, type: !768)
!949 = !DILocalVariable(name: "offset", scope: !812, file: !813, line: 160, type: !543)
!950 = !DILocalVariable(name: "start", scope: !812, file: !813, line: 161, type: !543)
!951 = !DILocalVariable(name: "x", scope: !812, file: !813, line: 162, type: !543)
!952 = !DILocalVariable(name: "x1", scope: !812, file: !813, line: 163, type: !543)
!953 = !DILocalVariable(name: "x2", scope: !812, file: !813, line: 164, type: !543)
!954 = !DILocalVariable(name: "y", scope: !812, file: !813, line: 165, type: !543)
!955 = !DILocalVariable(name: "indexes", scope: !956, file: !813, line: 219, type: !957)
!956 = distinct !DILexicalBlock(scope: !812, file: !813, line: 217, column: 3)
!957 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !803)
!958 = !DILocalVariable(name: "p", scope: !956, file: !813, line: 222, type: !959)
!959 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !776)
!960 = !DILocalVariable(name: "x", scope: !956, file: !813, line: 225, type: !543)
!961 = !DILocalVariable(name: "q", scope: !956, file: !813, line: 228, type: !962)
!962 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !573)
!963 = !DILocalVariable(name: "p", scope: !964, file: !813, line: 330, type: !959)
