; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/pixel.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/pixel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }

!363 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !334, line: 67, baseType: !13, size: 32, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!366 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!367 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!368 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!369 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!370 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!371 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!372 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!373 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!374 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!375 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !377, line: 25, baseType: !13, size: 32, elements: !378)
!377 = !DIFile(filename: "apps/538.imagick_r/src/magick/constitute.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "43cd9878a55016fc93758a53f2f400b5")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386}
!379 = !DIEnumerator(name: "UndefinedPixel", value: 0)
!380 = !DIEnumerator(name: "CharPixel", value: 1)
!381 = !DIEnumerator(name: "DoublePixel", value: 2)
!382 = !DIEnumerator(name: "FloatPixel", value: 3)
!383 = !DIEnumerator(name: "IntegerPixel", value: 4)
!384 = !DIEnumerator(name: "LongPixel", value: 5)
!385 = !DIEnumerator(name: "QuantumPixel", value: 6)
!386 = !DIEnumerator(name: "ShortPixel", value: 7)
!387 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !228, line: 52, baseType: !13, size: 32, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!389 = !DIEnumerator(name: "UndefinedQuantum", value: 0)
!390 = !DIEnumerator(name: "AlphaQuantum", value: 1)
!391 = !DIEnumerator(name: "BlackQuantum", value: 2)
!392 = !DIEnumerator(name: "BlueQuantum", value: 3)
!393 = !DIEnumerator(name: "CMYKAQuantum", value: 4)
!394 = !DIEnumerator(name: "CMYKQuantum", value: 5)
!395 = !DIEnumerator(name: "CyanQuantum", value: 6)
!396 = !DIEnumerator(name: "GrayAlphaQuantum", value: 7)
!397 = !DIEnumerator(name: "GrayQuantum", value: 8)
!398 = !DIEnumerator(name: "GreenQuantum", value: 9)
!399 = !DIEnumerator(name: "IndexAlphaQuantum", value: 10)
!400 = !DIEnumerator(name: "IndexQuantum", value: 11)
!401 = !DIEnumerator(name: "MagentaQuantum", value: 12)
!402 = !DIEnumerator(name: "OpacityQuantum", value: 13)
!403 = !DIEnumerator(name: "RedQuantum", value: 14)
!404 = !DIEnumerator(name: "RGBAQuantum", value: 15)
!405 = !DIEnumerator(name: "BGRAQuantum", value: 16)
!406 = !DIEnumerator(name: "RGBOQuantum", value: 17)
!407 = !DIEnumerator(name: "RGBQuantum", value: 18)
!408 = !DIEnumerator(name: "YellowQuantum", value: 19)
!409 = !DIEnumerator(name: "GrayPadQuantum", value: 20)
!410 = !DIEnumerator(name: "RGBPadQuantum", value: 21)
!411 = !DIEnumerator(name: "CbYCrYQuantum", value: 22)
!412 = !DIEnumerator(name: "CbYCrQuantum", value: 23)
!413 = !DIEnumerator(name: "CbYCrAQuantum", value: 24)
!414 = !DIEnumerator(name: "CMYKOQuantum", value: 25)
!415 = !DIEnumerator(name: "BGRQuantum", value: 26)
!416 = !DIEnumerator(name: "BGROQuantum", value: 27)
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !418, line: 34, baseType: !13, size: 32, elements: !419)
!418 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!420 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!421 = !DIEnumerator(name: "NoEvents", value: 0)
!422 = !DIEnumerator(name: "TraceEvent", value: 1)
!423 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!424 = !DIEnumerator(name: "BlobEvent", value: 4)
!425 = !DIEnumerator(name: "CacheEvent", value: 8)
!426 = !DIEnumerator(name: "CoderEvent", value: 16)
!427 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!428 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!429 = !DIEnumerator(name: "DrawEvent", value: 128)
!430 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!431 = !DIEnumerator(name: "ImageEvent", value: 512)
!432 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!433 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!434 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!435 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!436 = !DIEnumerator(name: "TransformEvent", value: 16384)
!437 = !DIEnumerator(name: "UserEvent", value: 36864)
!438 = !DIEnumerator(name: "WandEvent", value: 65536)
!439 = !DIEnumerator(name: "X11Event", value: 131072)
!440 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!441 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!442 = !{!443, !465, !457, !466, !467, !459, !6, !469, !471, !476, !682, !455, !684, !650, !686, !651, !689, !690, !460, !691, !13, !692, !693, !468, !694, !494, !696, !688, !697, !698, !700, !601, !702, !704}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !334, line: 127, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !334, line: 104, size: 448, elements: !446)
!446 = !{!447, !449, !451, !453, !454, !458, !461, !462, !463, !464}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !445, file: !334, line: 107, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !12, line: 209, baseType: !11)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !445, file: !334, line: 110, baseType: !450, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !19, line: 61, baseType: !18)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !445, file: !334, line: 113, baseType: !452, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !12, line: 215, baseType: !55)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !445, file: !334, line: 116, baseType: !6, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !445, file: !334, line: 119, baseType: !455, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !456, line: 46, baseType: !457)
!456 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!457 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !445, file: !334, line: 122, baseType: !459, size: 32, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !12, line: 78, baseType: !460)
!460 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !445, file: !334, line: 123, baseType: !459, size: 32, offset: 288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !445, file: !334, line: 124, baseType: !459, size: 32, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !445, file: !334, line: 125, baseType: !459, size: 32, offset: 352)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !445, file: !334, line: 126, baseType: !459, size: 32, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!466 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !12, line: 93, baseType: !468)
!468 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumType", file: !228, line: 82, baseType: !387)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !472, line: 77, baseType: !473)
!472 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !474, line: 193, baseType: !475)
!474 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!475 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !12, line: 221, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !158, line: 150, size: 105920, elements: !479)
!479 = !{!480, !481, !482, !484, !485, !487, !488, !489, !490, !491, !492, !493, !502, !503, !504, !505, !506, !520, !522, !523, !525, !528, !529, !530, !531, !532, !533, !541, !542, !543, !544, !545, !546, !548, !550, !552, !554, !556, !558, !560, !561, !562, !563, !564, !565, !566, !574, !589, !603, !604, !605, !606, !610, !614, !618, !619, !620, !621, !622, !639, !640, !642, !643, !653, !654, !656, !657, !658, !659, !660, !661, !663, !664, !665, !666, !667, !668, !669, !671, !672, !673, !674, !675, !679, !681}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !478, file: !158, line: 153, baseType: !448, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !478, file: !158, line: 156, baseType: !450, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !478, file: !158, line: 159, baseType: !483, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !133, line: 49, baseType: !132)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !478, file: !158, line: 162, baseType: !455, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !478, file: !158, line: 165, baseType: !486, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !158, line: 86, baseType: !157)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !478, file: !158, line: 168, baseType: !452, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !478, file: !158, line: 169, baseType: !452, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !478, file: !158, line: 172, baseType: !455, size: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !478, file: !158, line: 173, baseType: !455, size: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !478, file: !158, line: 174, baseType: !455, size: 64, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !478, file: !158, line: 175, baseType: !455, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !478, file: !158, line: 178, baseType: !494, size: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !334, line: 148, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !334, line: 131, size: 64, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !496, file: !334, line: 143, baseType: !467, size: 16)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !496, file: !334, line: 144, baseType: !467, size: 16, offset: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !496, file: !334, line: 145, baseType: !467, size: 16, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !496, file: !334, line: 146, baseType: !467, size: 16, offset: 48)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !478, file: !158, line: 179, baseType: !495, size: 64, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !478, file: !158, line: 180, baseType: !495, size: 64, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !478, file: !158, line: 181, baseType: !495, size: 64, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !478, file: !158, line: 184, baseType: !6, size: 64, offset: 832)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !478, file: !158, line: 187, baseType: !507, size: 768, offset: 896)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !158, line: 128, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !158, line: 121, size: 768, elements: !509)
!509 = !{!510, !517, !518, !519}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !508, file: !158, line: 124, baseType: !511, size: 192)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !158, line: 101, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !158, line: 95, size: 192, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !512, file: !158, line: 98, baseType: !6, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !512, file: !158, line: 99, baseType: !6, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !512, file: !158, line: 100, baseType: !6, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !508, file: !158, line: 125, baseType: !511, size: 192, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !508, file: !158, line: 126, baseType: !511, size: 192, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !508, file: !158, line: 127, baseType: !511, size: 192, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !478, file: !158, line: 190, baseType: !521, size: 32, offset: 1664)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !170, line: 49, baseType: !169)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !478, file: !158, line: 193, baseType: !465, size: 64, offset: 1728)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !478, file: !158, line: 196, baseType: !524, size: 32, offset: 1792)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !158, line: 93, baseType: !177)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !478, file: !158, line: 199, baseType: !526, size: 64, offset: 1856)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !478, file: !158, line: 200, baseType: !526, size: 64, offset: 1920)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !478, file: !158, line: 201, baseType: !526, size: 64, offset: 1984)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !478, file: !158, line: 204, baseType: !471, size: 64, offset: 2048)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !478, file: !158, line: 207, baseType: !6, size: 64, offset: 2112)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !478, file: !158, line: 208, baseType: !6, size: 64, offset: 2176)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !478, file: !158, line: 211, baseType: !534, size: 256, offset: 2240)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !234, line: 130, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !234, line: 121, size: 256, elements: !536)
!536 = !{!537, !538, !539, !540}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !535, file: !234, line: 124, baseType: !455, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !535, file: !234, line: 125, baseType: !455, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !535, file: !234, line: 128, baseType: !471, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !535, file: !234, line: 129, baseType: !471, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !478, file: !158, line: 212, baseType: !534, size: 256, offset: 2496)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !478, file: !158, line: 213, baseType: !534, size: 256, offset: 2752)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !478, file: !158, line: 216, baseType: !6, size: 64, offset: 3008)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !478, file: !158, line: 217, baseType: !6, size: 64, offset: 3072)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !478, file: !158, line: 218, baseType: !6, size: 64, offset: 3136)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !478, file: !158, line: 221, baseType: !547, size: 32, offset: 3200)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !183, line: 66, baseType: !182)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !478, file: !158, line: 224, baseType: !549, size: 32, offset: 3232)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !158, line: 73, baseType: !217)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !478, file: !158, line: 227, baseType: !551, size: 32, offset: 3264)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !228, line: 35, baseType: !227)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !478, file: !158, line: 230, baseType: !553, size: 32, offset: 3296)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !234, line: 91, baseType: !233)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !478, file: !158, line: 233, baseType: !555, size: 32, offset: 3328)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !249, line: 99, baseType: !248)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !478, file: !158, line: 236, baseType: !557, size: 32, offset: 3360)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !320, line: 32, baseType: !319)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !478, file: !158, line: 239, baseType: !559, size: 64, offset: 3392)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !478, file: !158, line: 242, baseType: !455, size: 64, offset: 3456)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !478, file: !158, line: 243, baseType: !455, size: 64, offset: 3520)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !478, file: !158, line: 246, baseType: !471, size: 64, offset: 3584)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !478, file: !158, line: 249, baseType: !455, size: 64, offset: 3648)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !478, file: !158, line: 250, baseType: !455, size: 64, offset: 3712)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !478, file: !158, line: 253, baseType: !471, size: 64, offset: 3776)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !478, file: !158, line: 256, baseType: !567, size: 192, offset: 3840)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !568, line: 68, baseType: !569)
!568 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !568, line: 62, size: 192, elements: !570)
!570 = !{!571, !572, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !569, file: !568, line: 65, baseType: !6, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !569, file: !568, line: 66, baseType: !6, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !569, file: !568, line: 67, baseType: !6, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !478, file: !158, line: 259, baseType: !575, size: 512, offset: 4032)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !328, line: 51, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !328, line: 40, size: 512, elements: !577)
!577 = !{!578, !585, !586, !588}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !576, file: !328, line: 43, baseType: !579, size: 192)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !328, line: 38, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !328, line: 32, size: 192, elements: !581)
!581 = !{!582, !583, !584}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !580, file: !328, line: 35, baseType: !6, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !580, file: !328, line: 36, baseType: !6, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !580, file: !328, line: 37, baseType: !6, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !576, file: !328, line: 44, baseType: !579, size: 192, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !576, file: !328, line: 47, baseType: !587, size: 32, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !328, line: 30, baseType: !327)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !576, file: !328, line: 50, baseType: !455, size: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !478, file: !158, line: 262, baseType: !590, size: 64, offset: 4544)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !591, line: 26, baseType: !592)
!591 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!452, !595, !597, !600, !465}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !12, line: 150, baseType: !599)
!599 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !12, line: 151, baseType: !602)
!602 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !478, file: !158, line: 265, baseType: !465, size: 64, offset: 4608)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !478, file: !158, line: 266, baseType: !465, size: 64, offset: 4672)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !478, file: !158, line: 267, baseType: !465, size: 64, offset: 4736)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !478, file: !158, line: 270, baseType: !607, size: 64, offset: 4800)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !133, line: 52, baseType: !609)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !133, line: 51, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !478, file: !158, line: 273, baseType: !611, size: 64, offset: 4864)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !12, line: 217, baseType: !613)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !12, line: 217, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !478, file: !158, line: 276, baseType: !615, size: 32768, offset: 4928)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 32768, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 4096)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !478, file: !158, line: 277, baseType: !615, size: 32768, offset: 37696)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !478, file: !158, line: 278, baseType: !615, size: 32768, offset: 70464)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !478, file: !158, line: 281, baseType: !455, size: 64, offset: 103232)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !478, file: !158, line: 282, baseType: !455, size: 64, offset: 103296)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !478, file: !158, line: 285, baseType: !623, size: 448, offset: 103360)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !12, line: 219, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !60, line: 102, size: 448, elements: !625)
!625 = !{!626, !628, !629, !630, !631, !632, !633, !638}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !624, file: !60, line: 105, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !60, line: 100, baseType: !59)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !624, file: !60, line: 108, baseType: !466, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !624, file: !60, line: 111, baseType: !526, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !624, file: !60, line: 112, baseType: !526, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !624, file: !60, line: 115, baseType: !465, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !624, file: !60, line: 118, baseType: !452, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !624, file: !60, line: 121, baseType: !634, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !636, line: 26, baseType: !637)
!636 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !636, line: 25, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !624, file: !60, line: 124, baseType: !455, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !478, file: !158, line: 288, baseType: !452, size: 32, offset: 103808)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !478, file: !158, line: 291, baseType: !641, size: 64, offset: 103872)
!641 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !471)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !478, file: !158, line: 294, baseType: !634, size: 64, offset: 103936)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !478, file: !158, line: 297, baseType: !644, size: 256, offset: 104000)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !170, line: 40, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !170, line: 27, size: 256, elements: !646)
!646 = !{!647, !648, !649, !652}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !645, file: !170, line: 30, baseType: !526, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !645, file: !170, line: 33, baseType: !455, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !645, file: !170, line: 36, baseType: !650, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !645, file: !170, line: 39, baseType: !455, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !478, file: !158, line: 298, baseType: !644, size: 256, offset: 104256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !478, file: !158, line: 299, baseType: !655, size: 64, offset: 104512)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !478, file: !158, line: 302, baseType: !455, size: 64, offset: 104576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !478, file: !158, line: 305, baseType: !455, size: 64, offset: 104640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !478, file: !158, line: 308, baseType: !559, size: 64, offset: 104704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !478, file: !158, line: 309, baseType: !559, size: 64, offset: 104768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !478, file: !158, line: 310, baseType: !559, size: 64, offset: 104832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !478, file: !158, line: 313, baseType: !662, size: 32, offset: 104896)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !334, line: 47, baseType: !333)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !478, file: !158, line: 316, baseType: !452, size: 32, offset: 104928)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !478, file: !158, line: 319, baseType: !495, size: 64, offset: 104960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !478, file: !158, line: 322, baseType: !559, size: 64, offset: 105024)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !478, file: !158, line: 325, baseType: !534, size: 256, offset: 105088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !478, file: !158, line: 328, baseType: !465, size: 64, offset: 105344)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !478, file: !158, line: 329, baseType: !465, size: 64, offset: 105408)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !158, line: 332, baseType: !670, size: 32, offset: 105472)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !158, line: 61, baseType: !350)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !478, file: !158, line: 335, baseType: !452, size: 32, offset: 105504)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !478, file: !158, line: 338, baseType: !601, size: 64, offset: 105536)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !478, file: !158, line: 341, baseType: !452, size: 32, offset: 105600)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !478, file: !158, line: 344, baseType: !455, size: 64, offset: 105664)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !478, file: !158, line: 347, baseType: !676, size: 64, offset: 105728)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !677, line: 7, baseType: !678)
!677 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !474, line: 160, baseType: !475)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !478, file: !158, line: 350, baseType: !680, size: 32, offset: 105792)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !334, line: 79, baseType: !364)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !478, file: !158, line: 353, baseType: !455, size: 64, offset: 105856)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !334, line: 129, baseType: !467)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!706 = !{!707, !0, !712, !728}
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "coefficient", scope: !2, file: !3, line: 141, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 576, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 9)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "coefficient", scope: !714, file: !3, line: 230, type: !709, isLocal: true, isDefinition: true)
!714 = distinct !DISubprogram(name: "EncodeGamma", scope: !3, file: !3, line: 218, type: !4, scopeLine: 219, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !715)
!715 = !{!716, !717, !724, !725, !727}
!716 = !DILocalVariable(name: "x", arg: 1, scope: !714, file: !3, line: 218, type: !7)
!717 = !DILocalVariable(name: "quotient", scope: !714, file: !3, line: 221, type: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !719, line: 62, baseType: !720)
!719 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !719, line: 58, size: 64, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !720, file: !719, line: 60, baseType: !466, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !720, file: !719, line: 61, baseType: !466, size: 32, offset: 32)
!724 = !DILocalVariable(name: "p", scope: !714, file: !3, line: 224, type: !6)
!725 = !DILocalVariable(name: "term", scope: !714, file: !3, line: 225, type: !726)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 576, elements: !710)
!727 = !DILocalVariable(name: "exponent", scope: !714, file: !3, line: 228, type: !466)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "powers_of_two", scope: !714, file: !3, line: 243, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 768, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 12)
!733 = !{!734, !735, !736, !737, !738}
!734 = !DILocalVariable(name: "x", arg: 1, scope: !2, file: !3, line: 129, type: !7)
!735 = !DILocalVariable(name: "quotient", scope: !2, file: !3, line: 132, type: !718)
!736 = !DILocalVariable(name: "p", scope: !2, file: !3, line: 135, type: !6)
!737 = !DILocalVariable(name: "term", scope: !2, file: !3, line: 136, type: !726)
!738 = !DILocalVariable(name: "exponent", scope: !2, file: !3, line: 139, type: !466)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 320, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 5)
!742 = !{i32 7, !"Dwarf Version", i32 5}
!743 = !{i32 2, !"Debug Info Version", i32 3}
!744 = !{i32 1, !"wchar_size", i32 4}
!745 = !{i32 7, !"PIC Level", i32 2}
!746 = !{i32 7, !"PIE Level", i32 2}
!747 = !{i32 7, !"uwtable", i32 2}
!748 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!749 = distinct !DISubprogram(name: "CloneMagickPixelPacket", scope: !3, file: !3, line: 92, type: !750, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !754)
!750 = !DISubroutineType(types: !751)
!751 = !{!443, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!754 = !{!755, !756, !757, !760}
!755 = !DILocalVariable(name: "pixel", arg: 1, scope: !749, file: !3, line: 93, type: !752)
!756 = !DILocalVariable(name: "clone_pixel", scope: !749, file: !3, line: 96, type: !443)
!757 = !DILocalVariable(name: "message", scope: !758, file: !3, line: 101, type: !526)
!758 = distinct !DILexicalBlock(scope: !759, file: !3, line: 101, column: 5)
!759 = distinct !DILexicalBlock(scope: !749, file: !3, line: 100, column: 7)
!760 = !DILocalVariable(name: "exception", scope: !758, file: !3, line: 101, type: !623)
!761 = !DILocation(line: 0, scope: !749)
!762 = !DILocation(line: 98, column: 37, scope: !749)
!763 = !DILocation(line: 100, column: 19, scope: !759)
!764 = !DILocation(line: 100, column: 7, scope: !749)
!765 = !DILocation(line: 101, column: 5, scope: !758)
!766 = !{!767, !767, i64 0}
!767 = !{!"int", !768, i64 0}
!768 = !{!"omnipotent char", !769, i64 0}
!769 = !{!"Simple C/C++ TBAA"}
!770 = !DILocation(line: 0, scope: !758)
!771 = !DILocation(line: 102, column: 17, scope: !749)
!772 = !{i64 0, i64 4, !773, i64 4, i64 4, !773, i64 8, i64 4, !773, i64 16, i64 8, !774, i64 24, i64 8, !776, i64 32, i64 4, !778, i64 36, i64 4, !778, i64 40, i64 4, !778, i64 44, i64 4, !778, i64 48, i64 4, !778}
!773 = !{!768, !768, i64 0}
!774 = !{!775, !775, i64 0}
!775 = !{!"double", !768, i64 0}
!776 = !{!777, !777, i64 0}
!777 = !{!"long", !768, i64 0}
!778 = !{!779, !779, i64 0}
!779 = !{!"float", !768, i64 0}
!780 = !DILocation(line: 103, column: 3, scope: !749)
!781 = !DISubprogram(name: "AcquireAlignedMemory", scope: !782, file: !782, line: 38, type: !783, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !786)
!782 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!783 = !DISubroutineType(types: !784)
!784 = !{!465, !785, !785}
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!786 = !{}
!787 = !DISubprogram(name: "GetExceptionInfo", scope: !60, file: !60, line: 166, type: !788, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !786)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!791 = !DISubprogram(name: "GetExceptionMessage", scope: !60, file: !60, line: 137, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !786)
!792 = !DISubroutineType(types: !793)
!793 = !{!526, !794}
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!795 = !DISubprogram(name: "ThrowMagickException", scope: !60, file: !60, line: 156, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !786)
!796 = !DISubroutineType(types: !797)
!797 = !{!452, !790, !595, !595, !785, !798, !595, !595, null}
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!799 = !DISubprogram(name: "DestroyString", scope: !800, file: !800, line: 46, type: !801, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !786)
!800 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!801 = !DISubroutineType(types: !802)
!802 = !{!526, !526}
!803 = !DISubprogram(name: "CatchException", scope: !60, file: !60, line: 164, type: !788, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !786)
!804 = !DISubprogram(name: "DestroyExceptionInfo", scope: !60, file: !60, line: 148, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !786)
!805 = !DISubroutineType(types: !806)
!806 = !{!790, !790}
!807 = !DISubprogram(name: "MagickCoreTerminus", scope: !808, file: !808, line: 147, type: !809, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !786)
!808 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!809 = !DISubroutineType(types: !810)
!810 = !{null}
!811 = distinct !DISubprogram(name: "DecodePixelGamma", scope: !3, file: !3, line: 187, type: !812, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !815)
!812 = !DISubroutineType(types: !813)
!813 = !{!459, !814}
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!815 = !{!816}
!816 = !DILocalVariable(name: "pixel", arg: 1, scope: !811, file: !3, line: 187, type: !814)
!817 = !DILocation(line: 0, scope: !811)
!818 = !DILocation(line: 189, column: 7, scope: !819)
!819 = distinct !DILexicalBlock(scope: !811, file: !3, line: 189, column: 7)
!820 = !DILocation(line: 189, column: 13, scope: !819)
!821 = !DILocation(line: 189, column: 7, scope: !811)
!822 = !DILocation(line: 190, column: 17, scope: !819)
!823 = !DILocation(line: 190, column: 5, scope: !819)
!824 = !DILocation(line: 192, column: 10, scope: !811)
!825 = !DILocation(line: 192, column: 17, scope: !811)
!826 = !DILocation(line: 0, scope: !2, inlinedAt: !827)
!827 = distinct !DILocation(line: 191, column: 41, scope: !811)
!828 = !DILocation(line: 138, column: 3, scope: !2, inlinedAt: !827)
!829 = !DILocation(line: 167, column: 15, scope: !2, inlinedAt: !827)
!830 = !DILocation(line: 178, column: 16, scope: !2, inlinedAt: !827)
!831 = !DILocation(line: 178, column: 24, scope: !2, inlinedAt: !827)
!832 = !DILocation(line: 178, column: 12, scope: !2, inlinedAt: !827)
!833 = !DILocation(line: 179, column: 20, scope: !834, inlinedAt: !827)
!834 = distinct !DILexicalBlock(scope: !2, file: !3, line: 179, column: 7)
!835 = !DILocation(line: 179, column: 7, scope: !2, inlinedAt: !827)
!836 = !DILocation(line: 181, column: 20, scope: !837, inlinedAt: !827)
!837 = distinct !DILexicalBlock(scope: !834, file: !3, line: 180, column: 5)
!838 = !DILocation(line: 182, column: 19, scope: !837, inlinedAt: !827)
!839 = !DILocation(line: 183, column: 5, scope: !837, inlinedAt: !827)
!840 = !DILocation(line: 167, column: 33, scope: !2, inlinedAt: !827)
!841 = !DILocation(line: 168, column: 14, scope: !2, inlinedAt: !827)
!842 = !DILocation(line: 168, column: 30, scope: !2, inlinedAt: !827)
!843 = !DILocation(line: 169, column: 30, scope: !2, inlinedAt: !827)
!844 = !DILocation(line: 170, column: 30, scope: !2, inlinedAt: !827)
!845 = !DILocation(line: 171, column: 30, scope: !2, inlinedAt: !827)
!846 = !DILocation(line: 172, column: 30, scope: !2, inlinedAt: !827)
!847 = !DILocation(line: 173, column: 30, scope: !2, inlinedAt: !827)
!848 = !DILocation(line: 174, column: 30, scope: !2, inlinedAt: !827)
!849 = !DILocation(line: 175, column: 42, scope: !2, inlinedAt: !827)
!850 = !DILocation(line: 175, column: 27, scope: !2, inlinedAt: !827)
!851 = !DILocation(line: 175, column: 50, scope: !2, inlinedAt: !827)
!852 = !DILocation(line: 175, column: 73, scope: !2, inlinedAt: !827)
!853 = !DILocation(line: 176, column: 27, scope: !2, inlinedAt: !827)
!854 = !DILocation(line: 176, column: 50, scope: !2, inlinedAt: !827)
!855 = !DILocation(line: 176, column: 73, scope: !2, inlinedAt: !827)
!856 = !DILocation(line: 177, column: 27, scope: !2, inlinedAt: !827)
!857 = !DILocation(line: 177, column: 50, scope: !2, inlinedAt: !827)
!858 = !DILocation(line: 184, column: 18, scope: !2, inlinedAt: !827)
!859 = !DILocation(line: 184, column: 45, scope: !2, inlinedAt: !827)
!860 = !DILocation(line: 184, column: 49, scope: !2, inlinedAt: !827)
!861 = !DILocation(line: 184, column: 12, scope: !2, inlinedAt: !827)
!862 = !DILocation(line: 184, column: 11, scope: !2, inlinedAt: !827)
!863 = !DILocation(line: 185, column: 1, scope: !2, inlinedAt: !827)
!864 = !DILocation(line: 191, column: 40, scope: !811)
!865 = !DILocation(line: 191, column: 10, scope: !811)
!866 = !DILocation(line: 191, column: 3, scope: !811)
!867 = !DILocation(line: 193, column: 1, scope: !811)
!868 = distinct !DISubprogram(name: "EncodePixelGamma", scope: !3, file: !3, line: 283, type: !812, scopeLine: 284, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !869)
!869 = !{!870}
!870 = !DILocalVariable(name: "pixel", arg: 1, scope: !868, file: !3, line: 283, type: !814)
!871 = !DILocation(line: 0, scope: !868)
!872 = !DILocation(line: 285, column: 7, scope: !873)
!873 = distinct !DILexicalBlock(scope: !868, file: !3, line: 285, column: 7)
!874 = !DILocation(line: 285, column: 13, scope: !873)
!875 = !DILocation(line: 285, column: 7, scope: !868)
!876 = !DILocation(line: 286, column: 18, scope: !873)
!877 = !DILocation(line: 286, column: 5, scope: !873)
!878 = !DILocation(line: 287, column: 80, scope: !868)
!879 = !DILocation(line: 0, scope: !714, inlinedAt: !880)
!880 = distinct !DILocation(line: 287, column: 47, scope: !868)
!881 = !DILocation(line: 227, column: 3, scope: !714, inlinedAt: !880)
!882 = !DILocation(line: 263, column: 15, scope: !714, inlinedAt: !880)
!883 = !DILocation(line: 274, column: 16, scope: !714, inlinedAt: !880)
!884 = !DILocation(line: 274, column: 24, scope: !714, inlinedAt: !880)
!885 = !DILocation(line: 274, column: 12, scope: !714, inlinedAt: !880)
!886 = !DILocation(line: 275, column: 20, scope: !887, inlinedAt: !880)
!887 = distinct !DILexicalBlock(scope: !714, file: !3, line: 275, column: 7)
!888 = !DILocation(line: 275, column: 7, scope: !714, inlinedAt: !880)
!889 = !DILocation(line: 277, column: 20, scope: !890, inlinedAt: !880)
!890 = distinct !DILexicalBlock(scope: !887, file: !3, line: 276, column: 5)
!891 = !DILocation(line: 278, column: 19, scope: !890, inlinedAt: !880)
!892 = !DILocation(line: 279, column: 5, scope: !890, inlinedAt: !880)
!893 = !DILocation(line: 263, column: 33, scope: !714, inlinedAt: !880)
!894 = !DILocation(line: 264, column: 14, scope: !714, inlinedAt: !880)
!895 = !DILocation(line: 264, column: 30, scope: !714, inlinedAt: !880)
!896 = !DILocation(line: 265, column: 30, scope: !714, inlinedAt: !880)
!897 = !DILocation(line: 266, column: 30, scope: !714, inlinedAt: !880)
!898 = !DILocation(line: 267, column: 30, scope: !714, inlinedAt: !880)
!899 = !DILocation(line: 268, column: 30, scope: !714, inlinedAt: !880)
!900 = !DILocation(line: 269, column: 30, scope: !714, inlinedAt: !880)
!901 = !DILocation(line: 270, column: 30, scope: !714, inlinedAt: !880)
!902 = !DILocation(line: 271, column: 42, scope: !714, inlinedAt: !880)
!903 = !DILocation(line: 271, column: 27, scope: !714, inlinedAt: !880)
!904 = !DILocation(line: 271, column: 50, scope: !714, inlinedAt: !880)
!905 = !DILocation(line: 271, column: 73, scope: !714, inlinedAt: !880)
!906 = !DILocation(line: 272, column: 27, scope: !714, inlinedAt: !880)
!907 = !DILocation(line: 272, column: 50, scope: !714, inlinedAt: !880)
!908 = !DILocation(line: 272, column: 73, scope: !714, inlinedAt: !880)
!909 = !DILocation(line: 273, column: 27, scope: !714, inlinedAt: !880)
!910 = !DILocation(line: 273, column: 50, scope: !714, inlinedAt: !880)
!911 = !DILocation(line: 280, column: 16, scope: !714, inlinedAt: !880)
!912 = !DILocation(line: 280, column: 43, scope: !714, inlinedAt: !880)
!913 = !DILocation(line: 280, column: 47, scope: !714, inlinedAt: !880)
!914 = !DILocation(line: 280, column: 10, scope: !714, inlinedAt: !880)
!915 = !DILocation(line: 281, column: 1, scope: !714, inlinedAt: !880)
!916 = !DILocation(line: 288, column: 11, scope: !868)
!917 = !DILocation(line: 287, column: 39, scope: !868)
!918 = !DILocation(line: 287, column: 9, scope: !868)
!919 = !DILocation(line: 287, column: 3, scope: !868)
!920 = !DILocation(line: 289, column: 1, scope: !868)
!921 = distinct !DISubprogram(name: "ExportImagePixels", scope: !3, file: !3, line: 1826, type: !922, scopeLine: 1829, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !927)
!922 = !DISubroutineType(types: !923)
!923 = !{!452, !682, !924, !924, !785, !785, !595, !925, !465, !790}
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorageType", file: !377, line: 35, baseType: !376)
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!928 = !DILocalVariable(name: "image", arg: 1, scope: !921, file: !3, line: 1826, type: !682)
!929 = !DILocalVariable(name: "x", arg: 2, scope: !921, file: !3, line: 1827, type: !924)
!930 = !DILocalVariable(name: "y", arg: 3, scope: !921, file: !3, line: 1827, type: !924)
!931 = !DILocalVariable(name: "width", arg: 4, scope: !921, file: !3, line: 1827, type: !785)
!932 = !DILocalVariable(name: "height", arg: 5, scope: !921, file: !3, line: 1827, type: !785)
!933 = !DILocalVariable(name: "map", arg: 6, scope: !921, file: !3, line: 1828, type: !595)
!934 = !DILocalVariable(name: "type", arg: 7, scope: !921, file: !3, line: 1828, type: !925)
!935 = !DILocalVariable(name: "pixels", arg: 8, scope: !921, file: !3, line: 1828, type: !465)
!936 = !DILocalVariable(name: "exception", arg: 9, scope: !921, file: !3, line: 1828, type: !790)
!937 = !DILocalVariable(name: "quantum_map", scope: !921, file: !3, line: 1831, type: !469)
!938 = !DILocalVariable(name: "roi", scope: !921, file: !3, line: 1834, type: !534)
!939 = !DILocalVariable(name: "i", scope: !921, file: !3, line: 1837, type: !471)
!940 = !DILocalVariable(name: "length", scope: !921, file: !3, line: 1840, type: !455)
!941 = !DILocation(line: 0, scope: !921)
!942 = !DILocation(line: 1844, column: 14, scope: !943)
!943 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1844, column: 7)
!944 = !{!945, !768, i64 12976}
!945 = !{!"_Image", !768, i64 0, !768, i64 4, !768, i64 8, !777, i64 16, !768, i64 24, !768, i64 28, !768, i64 32, !777, i64 40, !777, i64 48, !777, i64 56, !777, i64 64, !946, i64 72, !947, i64 80, !947, i64 88, !947, i64 96, !775, i64 104, !949, i64 112, !768, i64 208, !946, i64 216, !768, i64 224, !946, i64 232, !946, i64 240, !946, i64 248, !777, i64 256, !775, i64 264, !775, i64 272, !951, i64 280, !951, i64 312, !951, i64 344, !775, i64 376, !775, i64 384, !775, i64 392, !768, i64 400, !768, i64 404, !768, i64 408, !768, i64 412, !768, i64 416, !768, i64 420, !946, i64 424, !777, i64 432, !777, i64 440, !777, i64 448, !777, i64 456, !777, i64 464, !777, i64 472, !952, i64 480, !953, i64 504, !946, i64 568, !946, i64 576, !946, i64 584, !946, i64 592, !946, i64 600, !946, i64 608, !768, i64 616, !768, i64 4712, !768, i64 8808, !777, i64 12904, !777, i64 12912, !955, i64 12920, !768, i64 12976, !777, i64 12984, !946, i64 12992, !956, i64 13000, !956, i64 13032, !946, i64 13064, !777, i64 13072, !777, i64 13080, !946, i64 13088, !946, i64 13096, !946, i64 13104, !768, i64 13112, !768, i64 13116, !947, i64 13120, !946, i64 13128, !951, i64 13136, !946, i64 13168, !946, i64 13176, !768, i64 13184, !768, i64 13188, !957, i64 13192, !768, i64 13200, !777, i64 13208, !777, i64 13216, !768, i64 13224, !777, i64 13232}
!946 = !{!"any pointer", !768, i64 0}
!947 = !{!"_PixelPacket", !948, i64 0, !948, i64 2, !948, i64 4, !948, i64 6}
!948 = !{!"short", !768, i64 0}
!949 = !{!"_ChromaticityInfo", !950, i64 0, !950, i64 24, !950, i64 48, !950, i64 72}
!950 = !{!"_PrimaryInfo", !775, i64 0, !775, i64 8, !775, i64 16}
!951 = !{!"_RectangleInfo", !777, i64 0, !777, i64 8, !777, i64 16, !777, i64 24}
!952 = !{!"_ErrorInfo", !775, i64 0, !775, i64 8, !775, i64 16}
!953 = !{!"_TimerInfo", !954, i64 0, !954, i64 24, !768, i64 48, !777, i64 56}
!954 = !{!"_Timer", !775, i64 0, !775, i64 8, !775, i64 16}
!955 = !{!"_ExceptionInfo", !768, i64 0, !767, i64 4, !946, i64 8, !946, i64 16, !946, i64 24, !768, i64 32, !946, i64 40, !777, i64 48}
!956 = !{!"_ProfileInfo", !946, i64 0, !777, i64 8, !946, i64 16, !777, i64 24}
!957 = !{!"long long", !768, i64 0}
!958 = !DILocation(line: 1844, column: 20, scope: !943)
!959 = !DILocation(line: 1844, column: 7, scope: !921)
!960 = !DILocation(line: 1845, column: 68, scope: !943)
!961 = !DILocation(line: 1845, column: 12, scope: !943)
!962 = !DILocation(line: 1845, column: 5, scope: !943)
!963 = !DILocation(line: 1846, column: 10, scope: !921)
!964 = !DILocation(line: 1847, column: 31, scope: !921)
!965 = !DILocation(line: 1848, column: 19, scope: !966)
!966 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1848, column: 7)
!967 = !DILocation(line: 1848, column: 7, scope: !921)
!968 = !DILocation(line: 1854, column: 15, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !3, line: 1854, column: 3)
!970 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1854, column: 3)
!971 = !DILocation(line: 1854, column: 3, scope: !970)
!972 = !DILocation(line: 1851, column: 67, scope: !973)
!973 = distinct !DILexicalBlock(scope: !966, file: !3, line: 1849, column: 5)
!974 = !DILocation(line: 1850, column: 14, scope: !973)
!975 = !DILocation(line: 1852, column: 7, scope: !973)
!976 = !DILocation(line: 1856, column: 13, scope: !977)
!977 = distinct !DILexicalBlock(scope: !969, file: !3, line: 1855, column: 3)
!978 = !DILocation(line: 1856, column: 5, scope: !977)
!979 = !DILocation(line: 1868, column: 9, scope: !980)
!980 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1866, column: 7)
!981 = distinct !DILexicalBlock(scope: !977, file: !3, line: 1857, column: 5)
!982 = !DILocation(line: 1873, column: 9, scope: !983)
!983 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1872, column: 7)
!984 = !DILocation(line: 1873, column: 23, scope: !983)
!985 = !DILocation(line: 1874, column: 20, scope: !986)
!986 = distinct !DILexicalBlock(scope: !983, file: !3, line: 1874, column: 13)
!987 = !{!945, !768, i64 4}
!988 = !DILocation(line: 1874, column: 31, scope: !986)
!989 = !DILocation(line: 1874, column: 13, scope: !983)
!990 = !DILocation(line: 1876, column: 37, scope: !983)
!991 = !DILocation(line: 1877, column: 16, scope: !983)
!992 = !DILocation(line: 1879, column: 9, scope: !983)
!993 = !DILocation(line: 1885, column: 9, scope: !994)
!994 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1883, column: 7)
!995 = !DILocation(line: 1891, column: 9, scope: !996)
!996 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1889, column: 7)
!997 = !DILocation(line: 1896, column: 9, scope: !998)
!998 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1895, column: 7)
!999 = !DILocation(line: 1896, column: 23, scope: !998)
!1000 = !DILocation(line: 1897, column: 20, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !998, file: !3, line: 1897, column: 13)
!1002 = !DILocation(line: 1897, column: 31, scope: !1001)
!1003 = !DILocation(line: 1897, column: 13, scope: !998)
!1004 = !DILocation(line: 1899, column: 37, scope: !998)
!1005 = !DILocation(line: 1900, column: 16, scope: !998)
!1006 = !DILocation(line: 1902, column: 9, scope: !998)
!1007 = !DILocation(line: 1907, column: 9, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1906, column: 7)
!1009 = !DILocation(line: 1907, column: 23, scope: !1008)
!1010 = !DILocation(line: 1908, column: 20, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 1908, column: 13)
!1012 = !DILocation(line: 1908, column: 31, scope: !1011)
!1013 = !DILocation(line: 1908, column: 13, scope: !1008)
!1014 = !DILocation(line: 1910, column: 37, scope: !1008)
!1015 = !DILocation(line: 1911, column: 16, scope: !1008)
!1016 = !DILocation(line: 1913, column: 9, scope: !1008)
!1017 = !DILocation(line: 1919, column: 9, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1917, column: 7)
!1019 = !DILocation(line: 1925, column: 9, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1923, column: 7)
!1021 = !DILocation(line: 1931, column: 9, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1929, column: 7)
!1023 = !DILocation(line: 1936, column: 9, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1935, column: 7)
!1025 = !DILocation(line: 1936, column: 23, scope: !1024)
!1026 = !DILocation(line: 1937, column: 20, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 1937, column: 13)
!1028 = !DILocation(line: 1937, column: 31, scope: !1027)
!1029 = !DILocation(line: 1937, column: 13, scope: !1024)
!1030 = !DILocation(line: 1939, column: 37, scope: !1024)
!1031 = !DILocation(line: 1940, column: 16, scope: !1024)
!1032 = !DILocation(line: 1942, column: 9, scope: !1024)
!1033 = !DILocation(line: 1946, column: 37, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1945, column: 7)
!1035 = !DILocation(line: 1947, column: 16, scope: !1034)
!1036 = !DILocation(line: 1949, column: 9, scope: !1034)
!1037 = !DILocation(line: 0, scope: !981)
!1038 = !DILocation(line: 1854, column: 36, scope: !969)
!1039 = distinct !{!1039, !971, !1040, !1041, !1042}
!1040 = !DILocation(line: 1952, column: 3, scope: !970)
!1041 = !{!"llvm.loop.mustprogress"}
!1042 = !{!"llvm.loop.unroll.disable"}
!1043 = !DILocation(line: 1957, column: 3, scope: !921)
!1044 = !{!1045}
!1045 = distinct !{!1045, !1046, !"ExportCharPixel: %map"}
!1046 = distinct !{!1046, !"ExportCharPixel"}
!1047 = !DILocation(line: 1961, column: 7, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 1960, column: 5)
!1049 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1958, column: 3)
!1050 = !DILocalVariable(name: "image", arg: 1, scope: !1051, file: !3, line: 346, type: !476)
!1051 = distinct !DISubprogram(name: "ExportCharPixel", scope: !3, file: !3, line: 346, type: !1052, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !1059)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !476, !1054, !1056, !1057, !465, !790}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!1056 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !595)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!1059 = !{!1050, !1060, !1061, !1062, !1063, !1064, !1065, !1067, !1069, !1070, !1071, !1072, !1073}
!1060 = !DILocalVariable(name: "roi", arg: 2, scope: !1051, file: !3, line: 346, type: !1054)
!1061 = !DILocalVariable(name: "map", arg: 3, scope: !1051, file: !3, line: 347, type: !1056)
!1062 = !DILocalVariable(name: "quantum_map", arg: 4, scope: !1051, file: !3, line: 347, type: !1057)
!1063 = !DILocalVariable(name: "pixels", arg: 5, scope: !1051, file: !3, line: 347, type: !465)
!1064 = !DILocalVariable(name: "exception", arg: 6, scope: !1051, file: !3, line: 348, type: !790)
!1065 = !DILocalVariable(name: "indexes", scope: !1051, file: !3, line: 351, type: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !686)
!1067 = !DILocalVariable(name: "p", scope: !1051, file: !3, line: 354, type: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !684)
!1069 = !DILocalVariable(name: "x", scope: !1051, file: !3, line: 357, type: !471)
!1070 = !DILocalVariable(name: "q", scope: !1051, file: !3, line: 360, type: !650)
!1071 = !DILocalVariable(name: "length", scope: !1051, file: !3, line: 363, type: !455)
!1072 = !DILocalVariable(name: "y", scope: !1051, file: !3, line: 366, type: !471)
!1073 = !DILocalVariable(name: "i", scope: !1074, file: !3, line: 500, type: !471)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 498, column: 5)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 497, column: 5)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 497, column: 5)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 492, column: 3)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 491, column: 3)
!1079 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 491, column: 3)
!1080 = !DILocation(line: 0, scope: !1051, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 1961, column: 7, scope: !1048)
!1082 = !DILocation(line: 369, column: 7, scope: !1083, inlinedAt: !1081)
!1083 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 369, column: 7)
!1084 = !DILocation(line: 369, column: 32, scope: !1083, inlinedAt: !1081)
!1085 = !DILocation(line: 369, column: 7, scope: !1051, inlinedAt: !1081)
!1086 = !DILocation(line: 371, column: 19, scope: !1087, inlinedAt: !1081)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 371, column: 7)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 371, column: 7)
!1089 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 370, column: 5)
!1090 = !DILocation(line: 371, column: 7, scope: !1088, inlinedAt: !1081)
!1091 = !DILocation(line: 373, column: 47, scope: !1092, inlinedAt: !1081)
!1092 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 372, column: 7)
!1093 = !DILocation(line: 373, column: 11, scope: !1092, inlinedAt: !1081)
!1094 = !DILocation(line: 374, column: 15, scope: !1095, inlinedAt: !1081)
!1095 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 374, column: 13)
!1096 = !DILocation(line: 374, column: 13, scope: !1092, inlinedAt: !1081)
!1097 = !DILocation(line: 376, column: 9, scope: !1098, inlinedAt: !1081)
!1098 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 376, column: 9)
!1099 = !DILocation(line: 378, column: 35, scope: !1100, inlinedAt: !1081)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 377, column: 9)
!1101 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 376, column: 9)
!1102 = !{!947, !948, i64 0}
!1103 = !DILocalVariable(name: "quantum", arg: 1, scope: !1104, file: !228, line: 114, type: !703)
!1104 = distinct !DISubprogram(name: "ScaleQuantumToChar", scope: !228, file: !228, line: 114, type: !1105, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !1107)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!651, !703}
!1107 = !{!1103}
!1108 = !DILocation(line: 0, scope: !1104, inlinedAt: !1109)
!1109 = distinct !DILocation(line: 378, column: 16, scope: !1100, inlinedAt: !1081)
!1110 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1109)
!1111 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1109)
!1112 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1109)
!1113 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1109)
!1114 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1109)
!1115 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1109)
!1116 = !DILocation(line: 378, column: 13, scope: !1100, inlinedAt: !1081)
!1117 = !DILocation(line: 378, column: 15, scope: !1100, inlinedAt: !1081)
!1118 = !DILocation(line: 379, column: 35, scope: !1100, inlinedAt: !1081)
!1119 = !{!947, !948, i64 2}
!1120 = !DILocation(line: 0, scope: !1104, inlinedAt: !1121)
!1121 = distinct !DILocation(line: 379, column: 16, scope: !1100, inlinedAt: !1081)
!1122 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1121)
!1123 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1121)
!1124 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1121)
!1125 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1121)
!1126 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1121)
!1127 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1121)
!1128 = !DILocation(line: 379, column: 13, scope: !1100, inlinedAt: !1081)
!1129 = !DILocation(line: 379, column: 15, scope: !1100, inlinedAt: !1081)
!1130 = !DILocation(line: 380, column: 35, scope: !1100, inlinedAt: !1081)
!1131 = !{!947, !948, i64 4}
!1132 = !DILocation(line: 0, scope: !1104, inlinedAt: !1133)
!1133 = distinct !DILocation(line: 380, column: 16, scope: !1100, inlinedAt: !1081)
!1134 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1133)
!1135 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1133)
!1136 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1133)
!1137 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1133)
!1138 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1133)
!1139 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1133)
!1140 = !DILocation(line: 380, column: 13, scope: !1100, inlinedAt: !1081)
!1141 = !DILocation(line: 380, column: 15, scope: !1100, inlinedAt: !1081)
!1142 = !DILocation(line: 381, column: 12, scope: !1100, inlinedAt: !1081)
!1143 = !DILocation(line: 376, column: 46, scope: !1101, inlinedAt: !1081)
!1144 = !DILocation(line: 376, column: 21, scope: !1101, inlinedAt: !1081)
!1145 = distinct !{!1145, !1097, !1146, !1041, !1042}
!1146 = !DILocation(line: 382, column: 9, scope: !1098, inlinedAt: !1081)
!1147 = !DILocation(line: 371, column: 45, scope: !1087, inlinedAt: !1081)
!1148 = distinct !{!1148, !1090, !1149, !1041, !1042}
!1149 = !DILocation(line: 383, column: 7, scope: !1088, inlinedAt: !1081)
!1150 = !DILocation(line: 386, column: 7, scope: !1151, inlinedAt: !1081)
!1151 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 386, column: 7)
!1152 = !DILocation(line: 386, column: 33, scope: !1151, inlinedAt: !1081)
!1153 = !DILocation(line: 386, column: 7, scope: !1051, inlinedAt: !1081)
!1154 = !DILocation(line: 388, column: 19, scope: !1155, inlinedAt: !1081)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 388, column: 7)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 388, column: 7)
!1157 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 387, column: 5)
!1158 = !DILocation(line: 388, column: 7, scope: !1156, inlinedAt: !1081)
!1159 = !DILocation(line: 390, column: 47, scope: !1160, inlinedAt: !1081)
!1160 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 389, column: 7)
!1161 = !DILocation(line: 390, column: 11, scope: !1160, inlinedAt: !1081)
!1162 = !DILocation(line: 391, column: 15, scope: !1163, inlinedAt: !1081)
!1163 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 391, column: 13)
!1164 = !DILocation(line: 391, column: 13, scope: !1160, inlinedAt: !1081)
!1165 = !DILocation(line: 393, column: 9, scope: !1166, inlinedAt: !1081)
!1166 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 393, column: 9)
!1167 = !DILocation(line: 395, column: 35, scope: !1168, inlinedAt: !1081)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 394, column: 9)
!1169 = distinct !DILexicalBlock(scope: !1166, file: !3, line: 393, column: 9)
!1170 = !DILocation(line: 0, scope: !1104, inlinedAt: !1171)
!1171 = distinct !DILocation(line: 395, column: 16, scope: !1168, inlinedAt: !1081)
!1172 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1171)
!1173 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1171)
!1174 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1171)
!1175 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1171)
!1176 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1171)
!1177 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1171)
!1178 = !DILocation(line: 395, column: 13, scope: !1168, inlinedAt: !1081)
!1179 = !DILocation(line: 395, column: 15, scope: !1168, inlinedAt: !1081)
!1180 = !DILocation(line: 396, column: 35, scope: !1168, inlinedAt: !1081)
!1181 = !DILocation(line: 0, scope: !1104, inlinedAt: !1182)
!1182 = distinct !DILocation(line: 396, column: 16, scope: !1168, inlinedAt: !1081)
!1183 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1182)
!1184 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1182)
!1185 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1182)
!1186 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1182)
!1187 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1182)
!1188 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1182)
!1189 = !DILocation(line: 396, column: 13, scope: !1168, inlinedAt: !1081)
!1190 = !DILocation(line: 396, column: 15, scope: !1168, inlinedAt: !1081)
!1191 = !DILocation(line: 397, column: 35, scope: !1168, inlinedAt: !1081)
!1192 = !DILocation(line: 0, scope: !1104, inlinedAt: !1193)
!1193 = distinct !DILocation(line: 397, column: 16, scope: !1168, inlinedAt: !1081)
!1194 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1193)
!1195 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1193)
!1196 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1193)
!1197 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1193)
!1198 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1193)
!1199 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1193)
!1200 = !DILocation(line: 397, column: 13, scope: !1168, inlinedAt: !1081)
!1201 = !DILocation(line: 397, column: 15, scope: !1168, inlinedAt: !1081)
!1202 = !DILocation(line: 398, column: 45, scope: !1168, inlinedAt: !1081)
!1203 = !{!947, !948, i64 6}
!1204 = !DILocation(line: 0, scope: !1104, inlinedAt: !1205)
!1205 = distinct !DILocation(line: 398, column: 16, scope: !1168, inlinedAt: !1081)
!1206 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1205)
!1207 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1205)
!1208 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1205)
!1209 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1205)
!1210 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1205)
!1211 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1205)
!1212 = !DILocation(line: 398, column: 13, scope: !1168, inlinedAt: !1081)
!1213 = !DILocation(line: 398, column: 15, scope: !1168, inlinedAt: !1081)
!1214 = !DILocation(line: 399, column: 12, scope: !1168, inlinedAt: !1081)
!1215 = !DILocation(line: 393, column: 46, scope: !1169, inlinedAt: !1081)
!1216 = !DILocation(line: 393, column: 21, scope: !1169, inlinedAt: !1081)
!1217 = distinct !{!1217, !1165, !1218, !1041, !1042}
!1218 = !DILocation(line: 400, column: 9, scope: !1166, inlinedAt: !1081)
!1219 = !DILocation(line: 388, column: 45, scope: !1155, inlinedAt: !1081)
!1220 = distinct !{!1220, !1158, !1221, !1041, !1042}
!1221 = !DILocation(line: 401, column: 7, scope: !1156, inlinedAt: !1081)
!1222 = !DILocation(line: 404, column: 7, scope: !1223, inlinedAt: !1081)
!1223 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 404, column: 7)
!1224 = !DILocation(line: 404, column: 33, scope: !1223, inlinedAt: !1081)
!1225 = !DILocation(line: 404, column: 7, scope: !1051, inlinedAt: !1081)
!1226 = !DILocation(line: 406, column: 19, scope: !1227, inlinedAt: !1081)
!1227 = distinct !DILexicalBlock(scope: !1228, file: !3, line: 406, column: 7)
!1228 = distinct !DILexicalBlock(scope: !1229, file: !3, line: 406, column: 7)
!1229 = distinct !DILexicalBlock(scope: !1223, file: !3, line: 405, column: 5)
!1230 = !DILocation(line: 406, column: 7, scope: !1228, inlinedAt: !1081)
!1231 = !DILocation(line: 408, column: 47, scope: !1232, inlinedAt: !1081)
!1232 = distinct !DILexicalBlock(scope: !1227, file: !3, line: 407, column: 7)
!1233 = !DILocation(line: 408, column: 11, scope: !1232, inlinedAt: !1081)
!1234 = !DILocation(line: 409, column: 15, scope: !1235, inlinedAt: !1081)
!1235 = distinct !DILexicalBlock(scope: !1232, file: !3, line: 409, column: 13)
!1236 = !DILocation(line: 409, column: 13, scope: !1232, inlinedAt: !1081)
!1237 = !DILocation(line: 411, column: 9, scope: !1238, inlinedAt: !1081)
!1238 = distinct !DILexicalBlock(scope: !1232, file: !3, line: 411, column: 9)
!1239 = !DILocation(line: 413, column: 35, scope: !1240, inlinedAt: !1081)
!1240 = distinct !DILexicalBlock(scope: !1241, file: !3, line: 412, column: 9)
!1241 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 411, column: 9)
!1242 = !DILocation(line: 0, scope: !1104, inlinedAt: !1243)
!1243 = distinct !DILocation(line: 413, column: 16, scope: !1240, inlinedAt: !1081)
!1244 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1243)
!1245 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1243)
!1246 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1243)
!1247 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1243)
!1248 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1243)
!1249 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1243)
!1250 = !DILocation(line: 413, column: 13, scope: !1240, inlinedAt: !1081)
!1251 = !DILocation(line: 413, column: 15, scope: !1240, inlinedAt: !1081)
!1252 = !DILocation(line: 414, column: 35, scope: !1240, inlinedAt: !1081)
!1253 = !DILocation(line: 0, scope: !1104, inlinedAt: !1254)
!1254 = distinct !DILocation(line: 414, column: 16, scope: !1240, inlinedAt: !1081)
!1255 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1254)
!1256 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1254)
!1257 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1254)
!1258 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1254)
!1259 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1254)
!1260 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1254)
!1261 = !DILocation(line: 414, column: 13, scope: !1240, inlinedAt: !1081)
!1262 = !DILocation(line: 414, column: 15, scope: !1240, inlinedAt: !1081)
!1263 = !DILocation(line: 415, column: 35, scope: !1240, inlinedAt: !1081)
!1264 = !DILocation(line: 0, scope: !1104, inlinedAt: !1265)
!1265 = distinct !DILocation(line: 415, column: 16, scope: !1240, inlinedAt: !1081)
!1266 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1265)
!1267 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1265)
!1268 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1265)
!1269 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1265)
!1270 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1265)
!1271 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1265)
!1272 = !DILocation(line: 415, column: 13, scope: !1240, inlinedAt: !1081)
!1273 = !DILocation(line: 415, column: 15, scope: !1240, inlinedAt: !1081)
!1274 = !DILocation(line: 0, scope: !1104, inlinedAt: !1275)
!1275 = distinct !DILocation(line: 416, column: 16, scope: !1240, inlinedAt: !1081)
!1276 = !DILocation(line: 416, column: 13, scope: !1240, inlinedAt: !1081)
!1277 = !DILocation(line: 416, column: 15, scope: !1240, inlinedAt: !1081)
!1278 = !DILocation(line: 417, column: 12, scope: !1240, inlinedAt: !1081)
!1279 = !DILocation(line: 411, column: 46, scope: !1241, inlinedAt: !1081)
!1280 = !DILocation(line: 411, column: 21, scope: !1241, inlinedAt: !1081)
!1281 = distinct !{!1281, !1237, !1282, !1041, !1042}
!1282 = !DILocation(line: 418, column: 9, scope: !1238, inlinedAt: !1081)
!1283 = !DILocation(line: 406, column: 45, scope: !1227, inlinedAt: !1081)
!1284 = distinct !{!1284, !1230, !1285, !1041, !1042}
!1285 = !DILocation(line: 419, column: 7, scope: !1228, inlinedAt: !1081)
!1286 = !DILocation(line: 422, column: 7, scope: !1287, inlinedAt: !1081)
!1287 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 422, column: 7)
!1288 = !DILocation(line: 422, column: 30, scope: !1287, inlinedAt: !1081)
!1289 = !DILocation(line: 422, column: 7, scope: !1051, inlinedAt: !1081)
!1290 = !DILocation(line: 424, column: 19, scope: !1291, inlinedAt: !1081)
!1291 = distinct !DILexicalBlock(scope: !1292, file: !3, line: 424, column: 7)
!1292 = distinct !DILexicalBlock(scope: !1293, file: !3, line: 424, column: 7)
!1293 = distinct !DILexicalBlock(scope: !1287, file: !3, line: 423, column: 5)
!1294 = !DILocation(line: 424, column: 7, scope: !1292, inlinedAt: !1081)
!1295 = !DILocation(line: 426, column: 47, scope: !1296, inlinedAt: !1081)
!1296 = distinct !DILexicalBlock(scope: !1291, file: !3, line: 425, column: 7)
!1297 = !DILocation(line: 426, column: 11, scope: !1296, inlinedAt: !1081)
!1298 = !DILocation(line: 427, column: 15, scope: !1299, inlinedAt: !1081)
!1299 = distinct !DILexicalBlock(scope: !1296, file: !3, line: 427, column: 13)
!1300 = !DILocation(line: 427, column: 13, scope: !1296, inlinedAt: !1081)
!1301 = !DILocation(line: 429, column: 9, scope: !1302, inlinedAt: !1081)
!1302 = distinct !DILexicalBlock(scope: !1296, file: !3, line: 429, column: 9)
!1303 = !DILocation(line: 431, column: 50, scope: !1304, inlinedAt: !1081)
!1304 = distinct !DILexicalBlock(scope: !1305, file: !3, line: 430, column: 9)
!1305 = distinct !DILexicalBlock(scope: !1302, file: !3, line: 429, column: 9)
!1306 = !DILocalVariable(name: "value", arg: 1, scope: !1307, file: !228, line: 87, type: !814)
!1307 = distinct !DISubprogram(name: "ClampToQuantum", scope: !228, file: !228, line: 87, type: !1308, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !1310)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!467, !814}
!1310 = !{!1306}
!1311 = !DILocation(line: 0, scope: !1307, inlinedAt: !1312)
!1312 = distinct !DILocation(line: 431, column: 35, scope: !1304, inlinedAt: !1081)
!1313 = !DILocation(line: 92, column: 13, scope: !1314, inlinedAt: !1312)
!1314 = distinct !DILexicalBlock(scope: !1307, file: !228, line: 92, column: 7)
!1315 = !DILocation(line: 92, column: 7, scope: !1307, inlinedAt: !1312)
!1316 = !DILocation(line: 94, column: 13, scope: !1317, inlinedAt: !1312)
!1317 = distinct !DILexicalBlock(scope: !1307, file: !228, line: 94, column: 7)
!1318 = !DILocation(line: 94, column: 7, scope: !1307, inlinedAt: !1312)
!1319 = !DILocation(line: 96, column: 26, scope: !1307, inlinedAt: !1312)
!1320 = !DILocation(line: 96, column: 10, scope: !1307, inlinedAt: !1312)
!1321 = !DILocation(line: 96, column: 3, scope: !1307, inlinedAt: !1312)
!1322 = !DILocation(line: 0, scope: !1104, inlinedAt: !1323)
!1323 = distinct !DILocation(line: 431, column: 16, scope: !1304, inlinedAt: !1081)
!1324 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1323)
!1325 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1323)
!1326 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1323)
!1327 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1323)
!1328 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1323)
!1329 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1323)
!1330 = !DILocation(line: 431, column: 13, scope: !1304, inlinedAt: !1081)
!1331 = !DILocation(line: 431, column: 15, scope: !1304, inlinedAt: !1081)
!1332 = !DILocation(line: 432, column: 12, scope: !1304, inlinedAt: !1081)
!1333 = !DILocation(line: 429, column: 46, scope: !1305, inlinedAt: !1081)
!1334 = !DILocation(line: 429, column: 21, scope: !1305, inlinedAt: !1081)
!1335 = distinct !{!1335, !1301, !1336, !1041, !1042}
!1336 = !DILocation(line: 433, column: 9, scope: !1302, inlinedAt: !1081)
!1337 = !DILocation(line: 424, column: 45, scope: !1291, inlinedAt: !1081)
!1338 = distinct !{!1338, !1294, !1339, !1041, !1042}
!1339 = !DILocation(line: 434, column: 7, scope: !1292, inlinedAt: !1081)
!1340 = !DILocation(line: 437, column: 7, scope: !1341, inlinedAt: !1081)
!1341 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 437, column: 7)
!1342 = !DILocation(line: 437, column: 32, scope: !1341, inlinedAt: !1081)
!1343 = !DILocation(line: 437, column: 7, scope: !1051, inlinedAt: !1081)
!1344 = !DILocation(line: 439, column: 19, scope: !1345, inlinedAt: !1081)
!1345 = distinct !DILexicalBlock(scope: !1346, file: !3, line: 439, column: 7)
!1346 = distinct !DILexicalBlock(scope: !1347, file: !3, line: 439, column: 7)
!1347 = distinct !DILexicalBlock(scope: !1341, file: !3, line: 438, column: 5)
!1348 = !DILocation(line: 439, column: 7, scope: !1346, inlinedAt: !1081)
!1349 = !DILocation(line: 441, column: 47, scope: !1350, inlinedAt: !1081)
!1350 = distinct !DILexicalBlock(scope: !1345, file: !3, line: 440, column: 7)
!1351 = !DILocation(line: 441, column: 11, scope: !1350, inlinedAt: !1081)
!1352 = !DILocation(line: 442, column: 15, scope: !1353, inlinedAt: !1081)
!1353 = distinct !DILexicalBlock(scope: !1350, file: !3, line: 442, column: 13)
!1354 = !DILocation(line: 442, column: 13, scope: !1350, inlinedAt: !1081)
!1355 = !DILocation(line: 444, column: 9, scope: !1356, inlinedAt: !1081)
!1356 = distinct !DILexicalBlock(scope: !1350, file: !3, line: 444, column: 9)
!1357 = !DILocation(line: 446, column: 35, scope: !1358, inlinedAt: !1081)
!1358 = distinct !DILexicalBlock(scope: !1359, file: !3, line: 445, column: 9)
!1359 = distinct !DILexicalBlock(scope: !1356, file: !3, line: 444, column: 9)
!1360 = !DILocation(line: 0, scope: !1104, inlinedAt: !1361)
!1361 = distinct !DILocation(line: 446, column: 16, scope: !1358, inlinedAt: !1081)
!1362 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1361)
!1363 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1361)
!1364 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1361)
!1365 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1361)
!1366 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1361)
!1367 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1361)
!1368 = !DILocation(line: 446, column: 13, scope: !1358, inlinedAt: !1081)
!1369 = !DILocation(line: 446, column: 15, scope: !1358, inlinedAt: !1081)
!1370 = !DILocation(line: 447, column: 35, scope: !1358, inlinedAt: !1081)
!1371 = !DILocation(line: 0, scope: !1104, inlinedAt: !1372)
!1372 = distinct !DILocation(line: 447, column: 16, scope: !1358, inlinedAt: !1081)
!1373 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1372)
!1374 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1372)
!1375 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1372)
!1376 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1372)
!1377 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1372)
!1378 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1372)
!1379 = !DILocation(line: 447, column: 13, scope: !1358, inlinedAt: !1081)
!1380 = !DILocation(line: 447, column: 15, scope: !1358, inlinedAt: !1081)
!1381 = !DILocation(line: 448, column: 35, scope: !1358, inlinedAt: !1081)
!1382 = !DILocation(line: 0, scope: !1104, inlinedAt: !1383)
!1383 = distinct !DILocation(line: 448, column: 16, scope: !1358, inlinedAt: !1081)
!1384 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1383)
!1385 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1383)
!1386 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1383)
!1387 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1383)
!1388 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1383)
!1389 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1383)
!1390 = !DILocation(line: 448, column: 13, scope: !1358, inlinedAt: !1081)
!1391 = !DILocation(line: 448, column: 15, scope: !1358, inlinedAt: !1081)
!1392 = !DILocation(line: 449, column: 12, scope: !1358, inlinedAt: !1081)
!1393 = !DILocation(line: 444, column: 46, scope: !1359, inlinedAt: !1081)
!1394 = !DILocation(line: 444, column: 21, scope: !1359, inlinedAt: !1081)
!1395 = distinct !{!1395, !1355, !1396, !1041, !1042}
!1396 = !DILocation(line: 450, column: 9, scope: !1356, inlinedAt: !1081)
!1397 = !DILocation(line: 439, column: 45, scope: !1345, inlinedAt: !1081)
!1398 = distinct !{!1398, !1348, !1399, !1041, !1042}
!1399 = !DILocation(line: 451, column: 7, scope: !1346, inlinedAt: !1081)
!1400 = !DILocation(line: 454, column: 7, scope: !1401, inlinedAt: !1081)
!1401 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 454, column: 7)
!1402 = !DILocation(line: 454, column: 33, scope: !1401, inlinedAt: !1081)
!1403 = !DILocation(line: 454, column: 7, scope: !1051, inlinedAt: !1081)
!1404 = !DILocation(line: 456, column: 19, scope: !1405, inlinedAt: !1081)
!1405 = distinct !DILexicalBlock(scope: !1406, file: !3, line: 456, column: 7)
!1406 = distinct !DILexicalBlock(scope: !1407, file: !3, line: 456, column: 7)
!1407 = distinct !DILexicalBlock(scope: !1401, file: !3, line: 455, column: 5)
!1408 = !DILocation(line: 456, column: 7, scope: !1406, inlinedAt: !1081)
!1409 = !DILocation(line: 458, column: 47, scope: !1410, inlinedAt: !1081)
!1410 = distinct !DILexicalBlock(scope: !1405, file: !3, line: 457, column: 7)
!1411 = !DILocation(line: 458, column: 11, scope: !1410, inlinedAt: !1081)
!1412 = !DILocation(line: 459, column: 15, scope: !1413, inlinedAt: !1081)
!1413 = distinct !DILexicalBlock(scope: !1410, file: !3, line: 459, column: 13)
!1414 = !DILocation(line: 459, column: 13, scope: !1410, inlinedAt: !1081)
!1415 = !DILocation(line: 461, column: 9, scope: !1416, inlinedAt: !1081)
!1416 = distinct !DILexicalBlock(scope: !1410, file: !3, line: 461, column: 9)
!1417 = !DILocation(line: 463, column: 35, scope: !1418, inlinedAt: !1081)
!1418 = distinct !DILexicalBlock(scope: !1419, file: !3, line: 462, column: 9)
!1419 = distinct !DILexicalBlock(scope: !1416, file: !3, line: 461, column: 9)
!1420 = !DILocation(line: 0, scope: !1104, inlinedAt: !1421)
!1421 = distinct !DILocation(line: 463, column: 16, scope: !1418, inlinedAt: !1081)
!1422 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1421)
!1423 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1421)
!1424 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1421)
!1425 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1421)
!1426 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1421)
!1427 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1421)
!1428 = !DILocation(line: 463, column: 13, scope: !1418, inlinedAt: !1081)
!1429 = !DILocation(line: 463, column: 15, scope: !1418, inlinedAt: !1081)
!1430 = !DILocation(line: 464, column: 35, scope: !1418, inlinedAt: !1081)
!1431 = !DILocation(line: 0, scope: !1104, inlinedAt: !1432)
!1432 = distinct !DILocation(line: 464, column: 16, scope: !1418, inlinedAt: !1081)
!1433 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1432)
!1434 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1432)
!1435 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1432)
!1436 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1432)
!1437 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1432)
!1438 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1432)
!1439 = !DILocation(line: 464, column: 13, scope: !1418, inlinedAt: !1081)
!1440 = !DILocation(line: 464, column: 15, scope: !1418, inlinedAt: !1081)
!1441 = !DILocation(line: 465, column: 35, scope: !1418, inlinedAt: !1081)
!1442 = !DILocation(line: 0, scope: !1104, inlinedAt: !1443)
!1443 = distinct !DILocation(line: 465, column: 16, scope: !1418, inlinedAt: !1081)
!1444 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1443)
!1445 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1443)
!1446 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1443)
!1447 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1443)
!1448 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1443)
!1449 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1443)
!1450 = !DILocation(line: 465, column: 13, scope: !1418, inlinedAt: !1081)
!1451 = !DILocation(line: 465, column: 15, scope: !1418, inlinedAt: !1081)
!1452 = !DILocation(line: 466, column: 45, scope: !1418, inlinedAt: !1081)
!1453 = !DILocation(line: 0, scope: !1104, inlinedAt: !1454)
!1454 = distinct !DILocation(line: 466, column: 16, scope: !1418, inlinedAt: !1081)
!1455 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1454)
!1456 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1454)
!1457 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1454)
!1458 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1454)
!1459 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1454)
!1460 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1454)
!1461 = !DILocation(line: 466, column: 13, scope: !1418, inlinedAt: !1081)
!1462 = !DILocation(line: 466, column: 15, scope: !1418, inlinedAt: !1081)
!1463 = !DILocation(line: 467, column: 12, scope: !1418, inlinedAt: !1081)
!1464 = !DILocation(line: 461, column: 46, scope: !1419, inlinedAt: !1081)
!1465 = !DILocation(line: 461, column: 21, scope: !1419, inlinedAt: !1081)
!1466 = distinct !{!1466, !1415, !1467, !1041, !1042}
!1467 = !DILocation(line: 468, column: 9, scope: !1416, inlinedAt: !1081)
!1468 = !DILocation(line: 456, column: 45, scope: !1405, inlinedAt: !1081)
!1469 = distinct !{!1469, !1408, !1470, !1041, !1042}
!1470 = !DILocation(line: 469, column: 7, scope: !1406, inlinedAt: !1081)
!1471 = !DILocation(line: 472, column: 7, scope: !1472, inlinedAt: !1081)
!1472 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 472, column: 7)
!1473 = !DILocation(line: 472, column: 33, scope: !1472, inlinedAt: !1081)
!1474 = !DILocation(line: 472, column: 7, scope: !1051, inlinedAt: !1081)
!1475 = !DILocation(line: 474, column: 19, scope: !1476, inlinedAt: !1081)
!1476 = distinct !DILexicalBlock(scope: !1477, file: !3, line: 474, column: 7)
!1477 = distinct !DILexicalBlock(scope: !1478, file: !3, line: 474, column: 7)
!1478 = distinct !DILexicalBlock(scope: !1472, file: !3, line: 473, column: 5)
!1479 = !DILocation(line: 474, column: 7, scope: !1477, inlinedAt: !1081)
!1480 = !DILocation(line: 476, column: 47, scope: !1481, inlinedAt: !1081)
!1481 = distinct !DILexicalBlock(scope: !1476, file: !3, line: 475, column: 7)
!1482 = !DILocation(line: 476, column: 11, scope: !1481, inlinedAt: !1081)
!1483 = !DILocation(line: 477, column: 15, scope: !1484, inlinedAt: !1081)
!1484 = distinct !DILexicalBlock(scope: !1481, file: !3, line: 477, column: 13)
!1485 = !DILocation(line: 477, column: 13, scope: !1481, inlinedAt: !1081)
!1486 = !DILocation(line: 479, column: 9, scope: !1487, inlinedAt: !1081)
!1487 = distinct !DILexicalBlock(scope: !1481, file: !3, line: 479, column: 9)
!1488 = !DILocation(line: 481, column: 35, scope: !1489, inlinedAt: !1081)
!1489 = distinct !DILexicalBlock(scope: !1490, file: !3, line: 480, column: 9)
!1490 = distinct !DILexicalBlock(scope: !1487, file: !3, line: 479, column: 9)
!1491 = !DILocation(line: 0, scope: !1104, inlinedAt: !1492)
!1492 = distinct !DILocation(line: 481, column: 16, scope: !1489, inlinedAt: !1081)
!1493 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1492)
!1494 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1492)
!1495 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1492)
!1496 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1492)
!1497 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1492)
!1498 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1492)
!1499 = !DILocation(line: 481, column: 13, scope: !1489, inlinedAt: !1081)
!1500 = !DILocation(line: 481, column: 15, scope: !1489, inlinedAt: !1081)
!1501 = !DILocation(line: 482, column: 35, scope: !1489, inlinedAt: !1081)
!1502 = !DILocation(line: 0, scope: !1104, inlinedAt: !1503)
!1503 = distinct !DILocation(line: 482, column: 16, scope: !1489, inlinedAt: !1081)
!1504 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1503)
!1505 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1503)
!1506 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1503)
!1507 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1503)
!1508 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1503)
!1509 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1503)
!1510 = !DILocation(line: 482, column: 13, scope: !1489, inlinedAt: !1081)
!1511 = !DILocation(line: 482, column: 15, scope: !1489, inlinedAt: !1081)
!1512 = !DILocation(line: 483, column: 35, scope: !1489, inlinedAt: !1081)
!1513 = !DILocation(line: 0, scope: !1104, inlinedAt: !1514)
!1514 = distinct !DILocation(line: 483, column: 16, scope: !1489, inlinedAt: !1081)
!1515 = !DILocation(line: 117, column: 29, scope: !1104, inlinedAt: !1514)
!1516 = !DILocation(line: 117, column: 36, scope: !1104, inlinedAt: !1514)
!1517 = !DILocation(line: 117, column: 61, scope: !1104, inlinedAt: !1514)
!1518 = !DILocation(line: 117, column: 43, scope: !1104, inlinedAt: !1514)
!1519 = !DILocation(line: 117, column: 68, scope: !1104, inlinedAt: !1514)
!1520 = !DILocation(line: 117, column: 10, scope: !1104, inlinedAt: !1514)
!1521 = !DILocation(line: 483, column: 13, scope: !1489, inlinedAt: !1081)
!1522 = !DILocation(line: 483, column: 15, scope: !1489, inlinedAt: !1081)
!1523 = !DILocation(line: 0, scope: !1104, inlinedAt: !1524)
!1524 = distinct !DILocation(line: 484, column: 16, scope: !1489, inlinedAt: !1081)
!1525 = !DILocation(line: 484, column: 13, scope: !1489, inlinedAt: !1081)
!1526 = !DILocation(line: 484, column: 15, scope: !1489, inlinedAt: !1081)
!1527 = !DILocation(line: 485, column: 12, scope: !1489, inlinedAt: !1081)
!1528 = !DILocation(line: 479, column: 46, scope: !1490, inlinedAt: !1081)
!1529 = !DILocation(line: 479, column: 21, scope: !1490, inlinedAt: !1081)
!1530 = distinct !{!1530, !1486, !1531, !1041, !1042}
!1531 = !DILocation(line: 486, column: 9, scope: !1487, inlinedAt: !1081)
!1532 = !DILocation(line: 474, column: 45, scope: !1476, inlinedAt: !1081)
!1533 = distinct !{!1533, !1479, !1534, !1041, !1042}
!1534 = !DILocation(line: 487, column: 7, scope: !1477, inlinedAt: !1081)
!1535 = !DILocation(line: 490, column: 10, scope: !1051, inlinedAt: !1081)
!1536 = !DILocation(line: 491, column: 15, scope: !1078, inlinedAt: !1081)
!1537 = !DILocation(line: 491, column: 3, scope: !1079, inlinedAt: !1081)
!1538 = !DILocation(line: 493, column: 43, scope: !1077, inlinedAt: !1081)
!1539 = !DILocation(line: 493, column: 7, scope: !1077, inlinedAt: !1081)
!1540 = !DILocation(line: 494, column: 11, scope: !1541, inlinedAt: !1081)
!1541 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 494, column: 9)
!1542 = !DILocation(line: 494, column: 9, scope: !1077, inlinedAt: !1081)
!1543 = !DILocation(line: 496, column: 13, scope: !1077, inlinedAt: !1081)
!1544 = !DILocation(line: 497, column: 5, scope: !1076, inlinedAt: !1081)
!1545 = !DILocation(line: 538, column: 37, scope: !1546, inlinedAt: !1081)
!1546 = distinct !DILexicalBlock(scope: !1547, file: !3, line: 537, column: 17)
!1547 = distinct !DILexicalBlock(scope: !1548, file: !3, line: 536, column: 11)
!1548 = distinct !DILexicalBlock(scope: !1549, file: !3, line: 506, column: 9)
!1549 = distinct !DILexicalBlock(scope: !1550, file: !3, line: 503, column: 7)
!1550 = distinct !DILexicalBlock(scope: !1551, file: !3, line: 502, column: 7)
