; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/wand/pixel-wand.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/wand/pixel-wand.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._PixelWand = type { i64, [4096 x i8], ptr, %struct._MagickPixelPacket, i64, i32, i64 }
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._PixelPacket = type { i16, i16, i16, i16 }

@.str = private unnamed_addr constant [87 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/wand/pixel-wand.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"MemoryAllocationFailed\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"%s-%.20g\00", align 1
@.str.6 = private unnamed_addr constant [10 x i8] c"PixelWand\00", align 1
@.str.7 = private unnamed_addr constant [21 x i8] c"QuantumDepthMismatch\00", align 1
@.str.8 = private unnamed_addr constant [9 x i8] c"%g,%g,%g\00", align 1

!329 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61)
!330 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62)
!331 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63)
!332 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64)
!333 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65)
!334 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66)
!335 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67)
!336 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !337, line: 25, baseType: !5, size: 32, elements: !338)
!337 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!338 = !{!339, !340, !341, !342, !343}
!339 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!340 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!341 = !DIEnumerator(name: "NoneDispose", value: 1)
!342 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!343 = !DIEnumerator(name: "PreviousDispose", value: 3)
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !345, line: 25, baseType: !5, size: 32, elements: !346)
!345 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!346 = !{!347, !348, !349}
!347 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!348 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!349 = !DIEnumerator(name: "RunningTimerState", value: 2)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !351, line: 31, baseType: !5, size: 32, elements: !352)
!351 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!353 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!354 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!355 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!356 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!357 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!358 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!359 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!360 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!361 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!362 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!363 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!364 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!365 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!366 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !175, line: 47, baseType: !5, size: 32, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!369 = !DIEnumerator(name: "UndefinedType", value: 0)
!370 = !DIEnumerator(name: "BilevelType", value: 1)
!371 = !DIEnumerator(name: "GrayscaleType", value: 2)
!372 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!373 = !DIEnumerator(name: "PaletteType", value: 4)
!374 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!375 = !DIEnumerator(name: "TrueColorType", value: 6)
!376 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!377 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!378 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!379 = !DIEnumerator(name: "OptimizeType", value: 10)
!380 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !351, line: 67, baseType: !5, size: 32, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!383 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!384 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!385 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!386 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!387 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!388 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!389 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!390 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!391 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!392 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!393 = !{!394, !395, !422, !417, !441, !453, !402, !454, !459, !461, !484, !580, !419, !648, !444}
!394 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelWand", file: !397, line: 26, baseType: !398)
!397 = !DIFile(filename: "apps/538.imagick_r/src/wand/pixel-wand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3c7d71f46771b27e3f74acd989c109c4")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelWand", file: !399, line: 63, size: 33536, elements: !400)
!399 = !DIFile(filename: "apps/538.imagick_r/src/wand/pixel-wand.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "23bebe1a8d7557b14c7ac04df153a5b9")
!400 = !{!401, !404, !409, !431, !450, !451, !452}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !398, file: !399, line: 66, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !403, line: 46, baseType: !394)
!403 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!404 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !399, line: 69, baseType: !405, size: 32768, offset: 64)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 32768, elements: !407)
!406 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!407 = !{!408}
!408 = !DISubrange(count: 4096)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !398, file: !399, line: 72, baseType: !410, size: 64, offset: 32832)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !78, line: 219, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !4, line: 102, size: 448, elements: !413)
!413 = !{!414, !416, !418, !420, !421, !423, !425, !430}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !412, file: !4, line: 105, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !4, line: 100, baseType: !3)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !412, file: !4, line: 108, baseType: !417, size: 32, offset: 32)
!417 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !412, file: !4, line: 111, baseType: !419, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !412, file: !4, line: 112, baseType: !419, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !412, file: !4, line: 115, baseType: !422, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !412, file: !4, line: 118, baseType: !424, size: 32, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !78, line: 215, baseType: !77)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !412, file: !4, line: 121, baseType: !426, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !428, line: 26, baseType: !429)
!428 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !428, line: 25, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !412, file: !4, line: 124, baseType: !402, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !398, file: !399, line: 75, baseType: !432, size: 448, offset: 32896)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !351, line: 127, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !351, line: 104, size: 448, elements: !434)
!434 = !{!435, !437, !439, !440, !442, !443, !446, !447, !448, !449}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !433, file: !351, line: 107, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !78, line: 209, baseType: !82)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !433, file: !351, line: 110, baseType: !438, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !88, line: 61, baseType: !87)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !433, file: !351, line: 113, baseType: !424, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !433, file: !351, line: 116, baseType: !441, size: 64, offset: 128)
!441 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !433, file: !351, line: 119, baseType: !402, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !433, file: !351, line: 122, baseType: !444, size: 32, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !78, line: 78, baseType: !445)
!445 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !433, file: !351, line: 123, baseType: !444, size: 32, offset: 288)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !433, file: !351, line: 124, baseType: !444, size: 32, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !433, file: !351, line: 125, baseType: !444, size: 32, offset: 352)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !433, file: !351, line: 126, baseType: !444, size: 32, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !398, file: !399, line: 78, baseType: !402, size: 64, offset: 33344)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !398, file: !399, line: 81, baseType: !424, size: 32, offset: 33408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !398, file: !399, line: 84, baseType: !402, size: 64, offset: 33472)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !455, line: 77, baseType: !456)
!455 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !457, line: 193, baseType: !458)
!457 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!458 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !78, line: 221, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !175, line: 150, size: 105920, elements: !464)
!464 = !{!465, !466, !467, !469, !470, !472, !473, !474, !475, !476, !477, !478, !489, !490, !491, !492, !493, !507, !509, !510, !512, !513, !514, !515, !516, !517, !518, !526, !527, !528, !529, !530, !531, !533, !535, !537, !539, !541, !543, !545, !546, !547, !548, !549, !550, !551, !559, !574, !588, !589, !590, !591, !595, !599, !600, !601, !602, !603, !604, !605, !606, !608, !609, !619, !620, !622, !623, !624, !625, !626, !627, !629, !630, !631, !632, !633, !634, !635, !637, !638, !639, !640, !641, !645, !647}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !463, file: !175, line: 153, baseType: !436, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !463, file: !175, line: 156, baseType: !438, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !463, file: !175, line: 159, baseType: !468, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !150, line: 49, baseType: !149)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !463, file: !175, line: 162, baseType: !402, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !463, file: !175, line: 165, baseType: !471, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !175, line: 86, baseType: !174)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !463, file: !175, line: 168, baseType: !424, size: 32, offset: 224)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !463, file: !175, line: 169, baseType: !424, size: 32, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !463, file: !175, line: 172, baseType: !402, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !463, file: !175, line: 173, baseType: !402, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !463, file: !175, line: 174, baseType: !402, size: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !463, file: !175, line: 175, baseType: !402, size: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !463, file: !175, line: 178, baseType: !479, size: 64, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !351, line: 148, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !351, line: 131, size: 64, elements: !482)
!482 = !{!483, !486, !487, !488}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !481, file: !351, line: 143, baseType: !484, size: 16)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !78, line: 93, baseType: !485)
!485 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !481, file: !351, line: 144, baseType: !484, size: 16, offset: 16)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !481, file: !351, line: 145, baseType: !484, size: 16, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !481, file: !351, line: 146, baseType: !484, size: 16, offset: 48)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !463, file: !175, line: 179, baseType: !480, size: 64, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !463, file: !175, line: 180, baseType: !480, size: 64, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !463, file: !175, line: 181, baseType: !480, size: 64, offset: 768)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !463, file: !175, line: 184, baseType: !441, size: 64, offset: 832)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !463, file: !175, line: 187, baseType: !494, size: 768, offset: 896)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !175, line: 128, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !175, line: 121, size: 768, elements: !496)
!496 = !{!497, !504, !505, !506}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !495, file: !175, line: 124, baseType: !498, size: 192)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !175, line: 101, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !175, line: 95, size: 192, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !499, file: !175, line: 98, baseType: !441, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !499, file: !175, line: 99, baseType: !441, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !499, file: !175, line: 100, baseType: !441, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !495, file: !175, line: 125, baseType: !498, size: 192, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !495, file: !175, line: 126, baseType: !498, size: 192, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !495, file: !175, line: 127, baseType: !498, size: 192, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !463, file: !175, line: 190, baseType: !508, size: 32, offset: 1664)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !187, line: 49, baseType: !186)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !463, file: !175, line: 193, baseType: !422, size: 64, offset: 1728)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !463, file: !175, line: 196, baseType: !511, size: 32, offset: 1792)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !175, line: 93, baseType: !194)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !463, file: !175, line: 199, baseType: !419, size: 64, offset: 1856)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !463, file: !175, line: 200, baseType: !419, size: 64, offset: 1920)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !463, file: !175, line: 201, baseType: !419, size: 64, offset: 1984)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !463, file: !175, line: 204, baseType: !454, size: 64, offset: 2048)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !463, file: !175, line: 207, baseType: !441, size: 64, offset: 2112)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !463, file: !175, line: 208, baseType: !441, size: 64, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !463, file: !175, line: 211, baseType: !519, size: 256, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !251, line: 130, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !251, line: 121, size: 256, elements: !521)
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !520, file: !251, line: 124, baseType: !402, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !520, file: !251, line: 125, baseType: !402, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !520, file: !251, line: 128, baseType: !454, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !520, file: !251, line: 129, baseType: !454, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !463, file: !175, line: 212, baseType: !519, size: 256, offset: 2496)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !463, file: !175, line: 213, baseType: !519, size: 256, offset: 2752)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !463, file: !175, line: 216, baseType: !441, size: 64, offset: 3008)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !463, file: !175, line: 217, baseType: !441, size: 64, offset: 3072)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !463, file: !175, line: 218, baseType: !441, size: 64, offset: 3136)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !463, file: !175, line: 221, baseType: !532, size: 32, offset: 3200)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !200, line: 66, baseType: !199)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !463, file: !175, line: 224, baseType: !534, size: 32, offset: 3232)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !175, line: 73, baseType: !234)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !463, file: !175, line: 227, baseType: !536, size: 32, offset: 3264)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !245, line: 35, baseType: !244)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !463, file: !175, line: 230, baseType: !538, size: 32, offset: 3296)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !251, line: 91, baseType: !250)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !463, file: !175, line: 233, baseType: !540, size: 32, offset: 3328)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !266, line: 99, baseType: !265)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !463, file: !175, line: 236, baseType: !542, size: 32, offset: 3360)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !337, line: 32, baseType: !336)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !463, file: !175, line: 239, baseType: !544, size: 64, offset: 3392)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !463, file: !175, line: 242, baseType: !402, size: 64, offset: 3456)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !463, file: !175, line: 243, baseType: !402, size: 64, offset: 3520)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !463, file: !175, line: 246, baseType: !454, size: 64, offset: 3584)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !463, file: !175, line: 249, baseType: !402, size: 64, offset: 3648)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !463, file: !175, line: 250, baseType: !402, size: 64, offset: 3712)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !463, file: !175, line: 253, baseType: !454, size: 64, offset: 3776)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !463, file: !175, line: 256, baseType: !552, size: 192, offset: 3840)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !553, line: 68, baseType: !554)
!553 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !553, line: 62, size: 192, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !554, file: !553, line: 65, baseType: !441, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !554, file: !553, line: 66, baseType: !441, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !554, file: !553, line: 67, baseType: !441, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !463, file: !175, line: 259, baseType: !560, size: 512, offset: 4032)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !345, line: 51, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !345, line: 40, size: 512, elements: !562)
!562 = !{!563, !570, !571, !573}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !561, file: !345, line: 43, baseType: !564, size: 192)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !345, line: 38, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !345, line: 32, size: 192, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !565, file: !345, line: 35, baseType: !441, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !565, file: !345, line: 36, baseType: !441, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !565, file: !345, line: 37, baseType: !441, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !561, file: !345, line: 44, baseType: !564, size: 192, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !561, file: !345, line: 47, baseType: !572, size: 32, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !345, line: 30, baseType: !344)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !561, file: !345, line: 50, baseType: !402, size: 64, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !463, file: !175, line: 262, baseType: !575, size: 64, offset: 4544)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !576, line: 26, baseType: !577)
!576 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!424, !580, !582, !585, !422}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !78, line: 150, baseType: !584)
!584 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !78, line: 151, baseType: !587)
!587 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !463, file: !175, line: 265, baseType: !422, size: 64, offset: 4608)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !463, file: !175, line: 266, baseType: !422, size: 64, offset: 4672)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !463, file: !175, line: 267, baseType: !422, size: 64, offset: 4736)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !463, file: !175, line: 270, baseType: !592, size: 64, offset: 4800)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !150, line: 52, baseType: !594)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !150, line: 51, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !463, file: !175, line: 273, baseType: !596, size: 64, offset: 4864)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !78, line: 217, baseType: !598)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !78, line: 217, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !463, file: !175, line: 276, baseType: !405, size: 32768, offset: 4928)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !463, file: !175, line: 277, baseType: !405, size: 32768, offset: 37696)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !463, file: !175, line: 278, baseType: !405, size: 32768, offset: 70464)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !463, file: !175, line: 281, baseType: !402, size: 64, offset: 103232)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !463, file: !175, line: 282, baseType: !402, size: 64, offset: 103296)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !463, file: !175, line: 285, baseType: !411, size: 448, offset: 103360)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !463, file: !175, line: 288, baseType: !424, size: 32, offset: 103808)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !463, file: !175, line: 291, baseType: !607, size: 64, offset: 103872)
!607 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !454)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !463, file: !175, line: 294, baseType: !426, size: 64, offset: 103936)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !463, file: !175, line: 297, baseType: !610, size: 256, offset: 104000)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !187, line: 40, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !187, line: 27, size: 256, elements: !612)
!612 = !{!613, !614, !615, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !187, line: 30, baseType: !419, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !611, file: !187, line: 33, baseType: !402, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !611, file: !187, line: 36, baseType: !616, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !611, file: !187, line: 39, baseType: !402, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !463, file: !175, line: 298, baseType: !610, size: 256, offset: 104256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !463, file: !175, line: 299, baseType: !621, size: 64, offset: 104512)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !463, file: !175, line: 302, baseType: !402, size: 64, offset: 104576)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !463, file: !175, line: 305, baseType: !402, size: 64, offset: 104640)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !463, file: !175, line: 308, baseType: !544, size: 64, offset: 104704)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !463, file: !175, line: 309, baseType: !544, size: 64, offset: 104768)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !175, line: 310, baseType: !544, size: 64, offset: 104832)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !463, file: !175, line: 313, baseType: !628, size: 32, offset: 104896)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !351, line: 47, baseType: !350)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !463, file: !175, line: 316, baseType: !424, size: 32, offset: 104928)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !463, file: !175, line: 319, baseType: !480, size: 64, offset: 104960)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !463, file: !175, line: 322, baseType: !544, size: 64, offset: 105024)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !463, file: !175, line: 325, baseType: !519, size: 256, offset: 105088)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !463, file: !175, line: 328, baseType: !422, size: 64, offset: 105344)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !463, file: !175, line: 329, baseType: !422, size: 64, offset: 105408)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !463, file: !175, line: 332, baseType: !636, size: 32, offset: 105472)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !175, line: 61, baseType: !367)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !463, file: !175, line: 335, baseType: !424, size: 32, offset: 105504)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !463, file: !175, line: 338, baseType: !586, size: 64, offset: 105536)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !463, file: !175, line: 341, baseType: !424, size: 32, offset: 105600)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !463, file: !175, line: 344, baseType: !402, size: 64, offset: 105664)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !463, file: !175, line: 347, baseType: !642, size: 64, offset: 105728)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !643, line: 7, baseType: !644)
!643 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !457, line: 160, baseType: !458)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !463, file: !175, line: 350, baseType: !646, size: 32, offset: 105792)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !351, line: 79, baseType: !381)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !463, file: !175, line: 353, baseType: !402, size: 64, offset: 105856)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !351, line: 129, baseType: !484)
!649 = !{i32 7, !"Dwarf Version", i32 5}
!650 = !{i32 2, !"Debug Info Version", i32 3}
!651 = !{i32 1, !"wchar_size", i32 4}
!652 = !{i32 7, !"PIC Level", i32 2}
!653 = !{i32 7, !"PIE Level", i32 2}
!654 = !{i32 7, !"uwtable", i32 2}
!655 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!656 = distinct !DISubprogram(name: "ClearPixelWand", scope: !399, file: !399, line: 109, type: !657, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !659)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !395}
!659 = !{!660}
!660 = !DILocalVariable(name: "wand", arg: 1, scope: !656, file: !399, line: 109, type: !395)
!661 = !DILocation(line: 0, scope: !656)
!662 = !DILocation(line: 113, column: 13, scope: !663)
!663 = distinct !DILexicalBlock(scope: !656, file: !399, line: 113, column: 7)
!664 = !{!665, !667, i64 4176}
!665 = !{!"_PixelWand", !666, i64 0, !667, i64 8, !669, i64 4104, !670, i64 4112, !666, i64 4168, !667, i64 4176, !666, i64 4184}
!666 = !{!"long", !667, i64 0}
!667 = !{!"omnipotent char", !668, i64 0}
!668 = !{!"Simple C/C++ TBAA"}
!669 = !{!"any pointer", !667, i64 0}
!670 = !{!"_MagickPixelPacket", !667, i64 0, !667, i64 4, !667, i64 8, !671, i64 16, !666, i64 24, !672, i64 32, !672, i64 36, !672, i64 40, !672, i64 44, !672, i64 48}
!671 = !{!"double", !667, i64 0}
!672 = !{!"float", !667, i64 0}
!673 = !DILocation(line: 113, column: 19, scope: !663)
!674 = !DILocation(line: 113, column: 7, scope: !656)
!675 = !DILocation(line: 114, column: 66, scope: !663)
!676 = !DILocation(line: 114, column: 12, scope: !663)
!677 = !DILocation(line: 114, column: 5, scope: !663)
!678 = !DILocation(line: 115, column: 30, scope: !656)
!679 = !{!665, !669, i64 4104}
!680 = !DILocation(line: 115, column: 3, scope: !656)
!681 = !DILocation(line: 116, column: 15, scope: !656)
!682 = !DILocation(line: 116, column: 25, scope: !656)
!683 = !{!665, !667, i64 4116}
!684 = !DILocation(line: 117, column: 15, scope: !656)
!685 = !DILocation(line: 117, column: 14, scope: !656)
!686 = !DILocation(line: 118, column: 1, scope: !656)
!687 = !DISubprogram(name: "LogMagickEvent", scope: !125, file: !125, line: 83, type: !688, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !693)
!688 = !DISubroutineType(types: !689)
!689 = !{!424, !690, !580, !580, !692, !580, null}
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !125, line: 58, baseType: !124)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!693 = !{}
!694 = !DISubprogram(name: "ClearMagickException", scope: !4, file: !4, line: 165, type: !695, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !693)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !410}
!697 = !DISubprogram(name: "IsEventLogging", scope: !125, file: !125, line: 80, type: !698, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !693)
!698 = !DISubroutineType(types: !699)
!699 = !{!424}
!700 = distinct !DISubprogram(name: "ClonePixelWand", scope: !399, file: !399, line: 142, type: !701, scopeLine: 143, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !703)
!701 = !DISubroutineType(types: !702)
!702 = !{!395, !459}
!703 = !{!704, !705, !706}
!704 = !DILocalVariable(name: "wand", arg: 1, scope: !700, file: !399, line: 142, type: !459)
!705 = !DILocalVariable(name: "clone_wand", scope: !700, file: !399, line: 145, type: !395)
!706 = !DILocalVariable(name: "exception", scope: !707, file: !399, line: 153, type: !411)
