; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/wand/pixel-iterator.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/wand/pixel-iterator.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._PixelIterator = type { i64, [4096 x i8], ptr, ptr, %struct._RectangleInfo, i32, i64, ptr, i32, i64 }
%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }

!416 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!417 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!418 = !DIEnumerator(name: "RunningTimerState", value: 2)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 31, baseType: !5, size: 32, elements: !421)
!420 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!422 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!423 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!424 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!425 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!426 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!427 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!428 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!429 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!430 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!431 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!432 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!433 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!434 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!435 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 67, baseType: !5, size: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!438 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!439 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!440 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!441 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!442 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!443 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!444 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!445 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!446 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!447 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 27, baseType: !5, size: 32, elements: !450)
!449 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!451 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!452 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!453 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!454 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!455 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!456 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!457 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!458 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!459 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!460 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!461 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!462 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!463 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!464 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!465 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!466 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!467 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!468 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!469 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 27, baseType: !5, size: 32, elements: !471)
!470 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantize.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3eab4066ac81fc10b9d90b7cb7db1009")
!471 = !{!472, !473, !474, !475}
!472 = !DIEnumerator(name: "UndefinedDitherMethod", value: 0)
!473 = !DIEnumerator(name: "NoDitherMethod", value: 1)
!474 = !DIEnumerator(name: "RiemersmaDitherMethod", value: 2)
!475 = !DIEnumerator(name: "FloydSteinbergDitherMethod", value: 3)
!476 = !{!477, !478, !505, !500, !541, !542, !545, !547, !515, !729, !534, !525, !502, !731, !567, !572}
!477 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIterator", file: !480, line: 29, baseType: !481)
!480 = !DIFile(filename: "apps/538.imagick_r/src/wand/pixel-iterator.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "45fe21c3b65c21ba717e5dd75920ad62")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelIterator", file: !482, line: 64, size: 33536, elements: !483)
!482 = !DIFile(filename: "apps/538.imagick_r/src/wand/pixel-iterator.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5f7e519c70361d4872d6600d6035110b")
!483 = !{!484, !487, !492, !514, !518, !531, !532, !533, !539, !540}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !481, file: !482, line: 67, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !486, line: 46, baseType: !477)
!486 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !481, file: !482, line: 70, baseType: !488, size: 32768, offset: 64)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 32768, elements: !490)
!489 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!490 = !{!491}
!491 = !DISubrange(count: 4096)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !481, file: !482, line: 73, baseType: !493, size: 64, offset: 32832)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !78, line: 219, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !4, line: 102, size: 448, elements: !496)
!496 = !{!497, !499, !501, !503, !504, !506, !508, !513}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !495, file: !4, line: 105, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !4, line: 100, baseType: !3)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !495, file: !4, line: 108, baseType: !500, size: 32, offset: 32)
!500 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !495, file: !4, line: 111, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !495, file: !4, line: 112, baseType: !502, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !495, file: !4, line: 115, baseType: !505, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !495, file: !4, line: 118, baseType: !507, size: 32, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !78, line: 215, baseType: !77)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !495, file: !4, line: 121, baseType: !509, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !511, line: 26, baseType: !512)
!511 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !511, line: 25, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !495, file: !4, line: 124, baseType: !485, size: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !481, file: !482, line: 76, baseType: !515, size: 64, offset: 32896)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !449, line: 50, baseType: !517)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !420, line: 160, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !481, file: !482, line: 79, baseType: !519, size: 256, offset: 32960)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !320, line: 130, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !320, line: 121, size: 256, elements: !521)
!521 = !{!522, !523, !524, !530}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !520, file: !320, line: 124, baseType: !485, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !520, file: !320, line: 125, baseType: !485, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !520, file: !320, line: 128, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !526, line: 77, baseType: !527)
!526 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !528, line: 193, baseType: !529)
!528 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!529 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !520, file: !320, line: 129, baseType: !525, size: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !481, file: !482, line: 82, baseType: !507, size: 32, offset: 33216)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !481, file: !482, line: 85, baseType: !525, size: 64, offset: 33280)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_wands", scope: !481, file: !482, line: 88, baseType: !534, size: 64, offset: 33344)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelWand", file: !537, line: 26, baseType: !538)
!537 = !DIFile(filename: "apps/538.imagick_r/src/wand/pixel-wand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3c7d71f46771b27e3f74acd989c109c4")
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelWand", file: !537, line: 25, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !481, file: !482, line: 91, baseType: !507, size: 32, offset: 33408)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !481, file: !482, line: 94, baseType: !485, size: 64, offset: 33472)
!541 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !78, line: 221, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !133, line: 150, size: 105920, elements: !550)
!550 = !{!551, !553, !555, !557, !558, !560, !561, !562, !563, !564, !565, !566, !577, !578, !579, !580, !581, !595, !597, !598, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !614, !616, !618, !620, !622, !624, !626, !627, !628, !629, !630, !631, !632, !640, !655, !669, !670, !671, !672, !676, !680, !681, !682, !683, !684, !685, !686, !687, !689, !690, !700, !701, !703, !704, !705, !706, !707, !708, !710, !711, !712, !713, !714, !715, !716, !718, !719, !720, !721, !722, !726, !728}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !549, file: !133, line: 153, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !78, line: 209, baseType: !271)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !549, file: !133, line: 156, baseType: !554, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !166, line: 61, baseType: !165)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !549, file: !133, line: 159, baseType: !556, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !108, line: 49, baseType: !107)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !549, file: !133, line: 162, baseType: !485, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !549, file: !133, line: 165, baseType: !559, size: 32, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !133, line: 86, baseType: !132)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !549, file: !133, line: 168, baseType: !507, size: 32, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !549, file: !133, line: 169, baseType: !507, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !549, file: !133, line: 172, baseType: !485, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !549, file: !133, line: 173, baseType: !485, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !549, file: !133, line: 174, baseType: !485, size: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !549, file: !133, line: 175, baseType: !485, size: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !549, file: !133, line: 178, baseType: !567, size: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !420, line: 148, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !420, line: 131, size: 64, elements: !570)
!570 = !{!571, !574, !575, !576}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !569, file: !420, line: 143, baseType: !572, size: 16)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !78, line: 93, baseType: !573)
!573 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !569, file: !420, line: 144, baseType: !572, size: 16, offset: 16)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !569, file: !420, line: 145, baseType: !572, size: 16, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !569, file: !420, line: 146, baseType: !572, size: 16, offset: 48)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !549, file: !133, line: 179, baseType: !568, size: 64, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !549, file: !133, line: 180, baseType: !568, size: 64, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !549, file: !133, line: 181, baseType: !568, size: 64, offset: 768)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !549, file: !133, line: 184, baseType: !541, size: 64, offset: 832)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !549, file: !133, line: 187, baseType: !582, size: 768, offset: 896)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !133, line: 128, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !133, line: 121, size: 768, elements: !584)
!584 = !{!585, !592, !593, !594}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !583, file: !133, line: 124, baseType: !586, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !133, line: 101, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !133, line: 95, size: 192, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !587, file: !133, line: 98, baseType: !541, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !587, file: !133, line: 99, baseType: !541, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !587, file: !133, line: 100, baseType: !541, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !583, file: !133, line: 125, baseType: !586, size: 192, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !583, file: !133, line: 126, baseType: !586, size: 192, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !583, file: !133, line: 127, baseType: !586, size: 192, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !549, file: !133, line: 190, baseType: !596, size: 32, offset: 1664)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !277, line: 49, baseType: !276)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !549, file: !133, line: 193, baseType: !505, size: 64, offset: 1728)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !549, file: !133, line: 196, baseType: !599, size: 32, offset: 1792)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !133, line: 93, baseType: !160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !549, file: !133, line: 199, baseType: !502, size: 64, offset: 1856)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !549, file: !133, line: 200, baseType: !502, size: 64, offset: 1920)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !549, file: !133, line: 201, baseType: !502, size: 64, offset: 1984)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !549, file: !133, line: 204, baseType: !525, size: 64, offset: 2048)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !549, file: !133, line: 207, baseType: !541, size: 64, offset: 2112)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !549, file: !133, line: 208, baseType: !541, size: 64, offset: 2176)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !549, file: !133, line: 211, baseType: !519, size: 256, offset: 2240)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !549, file: !133, line: 212, baseType: !519, size: 256, offset: 2496)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !549, file: !133, line: 213, baseType: !519, size: 256, offset: 2752)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !549, file: !133, line: 216, baseType: !541, size: 64, offset: 3008)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !549, file: !133, line: 217, baseType: !541, size: 64, offset: 3072)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !549, file: !133, line: 218, baseType: !541, size: 64, offset: 3136)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !549, file: !133, line: 221, baseType: !613, size: 32, offset: 3200)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !285, line: 66, baseType: !284)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !549, file: !133, line: 224, baseType: !615, size: 32, offset: 3232)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !133, line: 73, baseType: !144)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !549, file: !133, line: 227, baseType: !617, size: 32, offset: 3264)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !155, line: 35, baseType: !154)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !549, file: !133, line: 230, baseType: !619, size: 32, offset: 3296)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !320, line: 91, baseType: !319)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !549, file: !133, line: 233, baseType: !621, size: 32, offset: 3328)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !335, line: 99, baseType: !334)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !549, file: !133, line: 236, baseType: !623, size: 32, offset: 3360)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !406, line: 32, baseType: !405)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !549, file: !133, line: 239, baseType: !625, size: 64, offset: 3392)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !549, file: !133, line: 242, baseType: !485, size: 64, offset: 3456)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !549, file: !133, line: 243, baseType: !485, size: 64, offset: 3520)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !549, file: !133, line: 246, baseType: !525, size: 64, offset: 3584)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !549, file: !133, line: 249, baseType: !485, size: 64, offset: 3648)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !549, file: !133, line: 250, baseType: !485, size: 64, offset: 3712)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !549, file: !133, line: 253, baseType: !525, size: 64, offset: 3776)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !549, file: !133, line: 256, baseType: !633, size: 192, offset: 3840)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !634, line: 68, baseType: !635)
!634 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !634, line: 62, size: 192, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !635, file: !634, line: 65, baseType: !541, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !635, file: !634, line: 66, baseType: !541, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !635, file: !634, line: 67, baseType: !541, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !549, file: !133, line: 259, baseType: !641, size: 512, offset: 4032)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !414, line: 51, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !414, line: 40, size: 512, elements: !643)
!643 = !{!644, !651, !652, !654}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !642, file: !414, line: 43, baseType: !645, size: 192)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !414, line: 38, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !414, line: 32, size: 192, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !646, file: !414, line: 35, baseType: !541, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !646, file: !414, line: 36, baseType: !541, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !646, file: !414, line: 37, baseType: !541, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !642, file: !414, line: 44, baseType: !645, size: 192, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !642, file: !414, line: 47, baseType: !653, size: 32, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !414, line: 30, baseType: !413)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !642, file: !414, line: 50, baseType: !485, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !549, file: !133, line: 262, baseType: !656, size: 64, offset: 4544)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !657, line: 26, baseType: !658)
!657 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!507, !661, !663, !666, !505}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !78, line: 150, baseType: !665)
!665 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !78, line: 151, baseType: !668)
!668 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !549, file: !133, line: 265, baseType: !505, size: 64, offset: 4608)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !549, file: !133, line: 266, baseType: !505, size: 64, offset: 4672)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !549, file: !133, line: 267, baseType: !505, size: 64, offset: 4736)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !549, file: !133, line: 270, baseType: !673, size: 64, offset: 4800)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !108, line: 52, baseType: !675)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !108, line: 51, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !549, file: !133, line: 273, baseType: !677, size: 64, offset: 4864)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !78, line: 217, baseType: !679)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !78, line: 217, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !549, file: !133, line: 276, baseType: !488, size: 32768, offset: 4928)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !549, file: !133, line: 277, baseType: !488, size: 32768, offset: 37696)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !549, file: !133, line: 278, baseType: !488, size: 32768, offset: 70464)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !549, file: !133, line: 281, baseType: !485, size: 64, offset: 103232)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !549, file: !133, line: 282, baseType: !485, size: 64, offset: 103296)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !549, file: !133, line: 285, baseType: !494, size: 448, offset: 103360)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !549, file: !133, line: 288, baseType: !507, size: 32, offset: 103808)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !549, file: !133, line: 291, baseType: !688, size: 64, offset: 103872)
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !525)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !549, file: !133, line: 294, baseType: !509, size: 64, offset: 103936)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !549, file: !133, line: 297, baseType: !691, size: 256, offset: 104000)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !277, line: 40, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !277, line: 27, size: 256, elements: !693)
!693 = !{!694, !695, !696, !699}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !692, file: !277, line: 30, baseType: !502, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !692, file: !277, line: 33, baseType: !485, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !692, file: !277, line: 36, baseType: !697, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !692, file: !277, line: 39, baseType: !485, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !549, file: !133, line: 298, baseType: !691, size: 256, offset: 104256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !549, file: !133, line: 299, baseType: !702, size: 64, offset: 104512)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !549, file: !133, line: 302, baseType: !485, size: 64, offset: 104576)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !549, file: !133, line: 305, baseType: !485, size: 64, offset: 104640)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !549, file: !133, line: 308, baseType: !625, size: 64, offset: 104704)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !549, file: !133, line: 309, baseType: !625, size: 64, offset: 104768)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !549, file: !133, line: 310, baseType: !625, size: 64, offset: 104832)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !549, file: !133, line: 313, baseType: !709, size: 32, offset: 104896)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !420, line: 47, baseType: !419)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !549, file: !133, line: 316, baseType: !507, size: 32, offset: 104928)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !549, file: !133, line: 319, baseType: !568, size: 64, offset: 104960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !549, file: !133, line: 322, baseType: !625, size: 64, offset: 105024)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !549, file: !133, line: 325, baseType: !519, size: 256, offset: 105088)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !549, file: !133, line: 328, baseType: !505, size: 64, offset: 105344)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !549, file: !133, line: 329, baseType: !505, size: 64, offset: 105408)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !549, file: !133, line: 332, baseType: !717, size: 32, offset: 105472)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !133, line: 61, baseType: !202)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !549, file: !133, line: 335, baseType: !507, size: 32, offset: 105504)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !549, file: !133, line: 338, baseType: !667, size: 64, offset: 105536)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !549, file: !133, line: 341, baseType: !507, size: 32, offset: 105600)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !549, file: !133, line: 344, baseType: !485, size: 64, offset: 105664)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !549, file: !133, line: 347, baseType: !723, size: 64, offset: 105728)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !724, line: 7, baseType: !725)
!724 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !528, line: 160, baseType: !529)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !549, file: !133, line: 350, baseType: !727, size: 32, offset: 105792)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !420, line: 79, baseType: !436)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !549, file: !133, line: 353, baseType: !485, size: 64, offset: 105856)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !420, line: 129, baseType: !572)
!734 = !{i32 7, !"Dwarf Version", i32 5}
!735 = !{i32 2, !"Debug Info Version", i32 3}
!736 = !{i32 1, !"wchar_size", i32 4}
!737 = !{i32 7, !"PIC Level", i32 2}
!738 = !{i32 7, !"PIE Level", i32 2}
!739 = !{i32 7, !"uwtable", i32 2}
!740 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!741 = distinct !DISubprogram(name: "ClearPixelIterator", scope: !482, file: !482, line: 119, type: !742, scopeLine: 120, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !478}
!744 = !{!745}
!745 = !DILocalVariable(name: "iterator", arg: 1, scope: !741, file: !482, line: 119, type: !478)
!746 = !DILocation(line: 0, scope: !741)
!747 = !DILocation(line: 123, column: 17, scope: !748)
!748 = distinct !DILexicalBlock(scope: !741, file: !482, line: 123, column: 7)
!749 = !{!750, !752, i64 4176}
!750 = !{!"_PixelIterator", !751, i64 0, !752, i64 8, !754, i64 4104, !754, i64 4112, !755, i64 4120, !752, i64 4152, !751, i64 4160, !754, i64 4168, !752, i64 4176, !751, i64 4184}
!751 = !{!"long", !752, i64 0}
!752 = !{!"omnipotent char", !753, i64 0}
!753 = !{!"Simple C/C++ TBAA"}
!754 = !{!"any pointer", !752, i64 0}
!755 = !{!"_RectangleInfo", !751, i64 0, !751, i64 8, !751, i64 16, !751, i64 24}
!756 = !DILocation(line: 123, column: 23, scope: !748)
!757 = !DILocation(line: 123, column: 7, scope: !741)
!758 = !DILocation(line: 124, column: 70, scope: !748)
!759 = !DILocation(line: 124, column: 12, scope: !748)
!760 = !DILocation(line: 124, column: 5, scope: !748)
!761 = !DILocation(line: 125, column: 53, scope: !741)
!762 = !{!750, !754, i64 4168}
!763 = !DILocation(line: 126, column: 15, scope: !741)
!764 = !DILocation(line: 126, column: 22, scope: !741)
!765 = !{!750, !751, i64 4120}
!766 = !DILocation(line: 125, column: 25, scope: !741)
!767 = !DILocation(line: 125, column: 24, scope: !741)
!768 = !DILocation(line: 127, column: 34, scope: !741)
!769 = !{!750, !754, i64 4104}
!770 = !DILocation(line: 127, column: 3, scope: !741)
!771 = !DILocation(line: 128, column: 56, scope: !741)
!772 = !DILocation(line: 128, column: 25, scope: !741)
!773 = !DILocation(line: 128, column: 24, scope: !741)
!774 = !DILocation(line: 129, column: 13, scope: !741)
!775 = !DILocation(line: 129, column: 19, scope: !741)
!776 = !{!750, !752, i64 4152}
!777 = !DILocation(line: 130, column: 13, scope: !741)
!778 = !DILocation(line: 130, column: 14, scope: !741)
!779 = !{!750, !751, i64 4160}
!780 = !DILocation(line: 131, column: 19, scope: !741)
!781 = !DILocation(line: 131, column: 18, scope: !741)
!782 = !DILocation(line: 132, column: 1, scope: !741)
!783 = !DISubprogram(name: "LogMagickEvent", scope: !83, file: !83, line: 83, type: !784, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!784 = !DISubroutineType(types: !785)
!785 = !{!507, !786, !661, !661, !788, !661, null}
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !83, line: 58, baseType: !82)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!789 = !{}
!790 = !DISubprogram(name: "DestroyPixelWands", scope: !537, file: !537, line: 61, type: !791, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!791 = !DISubroutineType(types: !792)
!792 = !{!534, !534, !788}
!793 = !DISubprogram(name: "ClearMagickException", scope: !4, file: !4, line: 165, type: !794, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !493}
!796 = !DISubprogram(name: "NewPixelWands", scope: !537, file: !537, line: 63, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!797 = !DISubroutineType(types: !798)
!798 = !{!534, !788}
!799 = !DISubprogram(name: "IsEventLogging", scope: !83, file: !83, line: 80, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!800 = !DISubroutineType(types: !801)
!801 = !{!507}
!802 = distinct !DISubprogram(name: "ClonePixelIterator", scope: !482, file: !482, line: 156, type: !803, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{!478, !545}
!805 = !{!806, !807, !808}
!806 = !DILocalVariable(name: "iterator", arg: 1, scope: !802, file: !482, line: 156, type: !545)
!807 = !DILocalVariable(name: "clone_iterator", scope: !802, file: !482, line: 159, type: !478)
!808 = !DILocalVariable(name: "exception", scope: !809, file: !482, line: 167, type: !494)
!809 = distinct !DILexicalBlock(scope: !810, file: !482, line: 167, column: 5)
!810 = distinct !DILexicalBlock(scope: !802, file: !482, line: 166, column: 7)
!811 = !DILocation(line: 0, scope: !802)
!812 = !DILocation(line: 163, column: 17, scope: !813)
!813 = distinct !DILexicalBlock(scope: !802, file: !482, line: 163, column: 7)
!814 = !DILocation(line: 163, column: 23, scope: !813)
!815 = !DILocation(line: 163, column: 7, scope: !802)
!816 = !DILocation(line: 164, column: 70, scope: !813)
!817 = !DILocation(line: 164, column: 12, scope: !813)
!818 = !DILocation(line: 164, column: 5, scope: !813)
!819 = !DILocation(line: 165, column: 36, scope: !802)
!820 = !DILocation(line: 166, column: 22, scope: !810)
!821 = !DILocation(line: 166, column: 7, scope: !802)
!822 = !DILocation(line: 167, column: 5, scope: !809)
!823 = !DILocation(line: 169, column: 10, scope: !802)
!824 = !DILocation(line: 170, column: 22, scope: !802)
!825 = !DILocation(line: 170, column: 21, scope: !802)
!826 = !{!750, !751, i64 0}
!827 = !DILocation(line: 171, column: 45, scope: !802)
!828 = !DILocation(line: 172, column: 21, scope: !802)
!829 = !DILocation(line: 171, column: 10, scope: !802)
!830 = !DILocation(line: 173, column: 29, scope: !802)
!831 = !DILocation(line: 173, column: 19, scope: !802)
!832 = !DILocation(line: 173, column: 28, scope: !802)
!833 = !DILocation(line: 174, column: 56, scope: !802)
!834 = !DILocation(line: 174, column: 3, scope: !802)
!835 = !DILocation(line: 175, column: 49, scope: !802)
!836 = !{!750, !754, i64 4112}
!837 = !DILocation(line: 175, column: 24, scope: !802)
!838 = !DILocation(line: 175, column: 19, scope: !802)
!839 = !DILocation(line: 175, column: 23, scope: !802)
!840 = !DILocation(line: 176, column: 19, scope: !802)
!841 = !DILocation(line: 176, column: 36, scope: !802)
!842 = !{i64 0, i64 8, !843, i64 8, i64 8, !843, i64 16, i64 8, !843, i64 24, i64 8, !843}
!843 = !{!751, !751, i64 0}
!844 = !DILocation(line: 177, column: 36, scope: !802)
!845 = !DILocation(line: 177, column: 19, scope: !802)
!846 = !DILocation(line: 177, column: 25, scope: !802)
!847 = !DILocation(line: 178, column: 31, scope: !802)
!848 = !DILocation(line: 178, column: 19, scope: !802)
!849 = !DILocation(line: 178, column: 20, scope: !802)
!850 = !DILocation(line: 180, column: 15, scope: !802)
!851 = !DILocation(line: 180, column: 44, scope: !802)
!852 = !DILocation(line: 179, column: 31, scope: !802)
!853 = !DILocation(line: 179, column: 19, scope: !802)
!854 = !DILocation(line: 179, column: 30, scope: !802)
!855 = !DILocation(line: 181, column: 35, scope: !802)
!856 = !DILocation(line: 181, column: 19, scope: !802)
!857 = !DILocation(line: 181, column: 24, scope: !802)
!858 = !DILocation(line: 182, column: 29, scope: !859)
!859 = distinct !DILexicalBlock(scope: !802, file: !482, line: 182, column: 7)
!860 = !DILocation(line: 182, column: 7, scope: !802)
!861 = !DILocation(line: 183, column: 12, scope: !859)
!862 = !DILocation(line: 183, column: 5, scope: !859)
!863 = !DILocation(line: 185, column: 19, scope: !802)
!864 = !DILocation(line: 185, column: 28, scope: !802)
!865 = !{!750, !751, i64 4184}
!866 = !DILocation(line: 186, column: 3, scope: !802)
!867 = !DISubprogram(name: "AcquireMagickMemory", scope: !868, file: !868, line: 40, type: !869, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!868 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!869 = !DISubroutineType(types: !870)
!870 = !{!505, !788}
!871 = !DISubprogram(name: "GetExceptionInfo", scope: !4, file: !4, line: 166, type: !794, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!872 = !DISubprogram(name: "ThrowMagickException", scope: !4, file: !4, line: 156, type: !873, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!873 = !DISubroutineType(types: !874)
!874 = !{!507, !493, !661, !661, !788, !875, !661, !661, null}
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!876 = !DISubprogram(name: "CatchException", scope: !4, file: !4, line: 164, type: !794, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!877 = !DISubprogram(name: "DestroyExceptionInfo", scope: !4, file: !4, line: 148, type: !878, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!878 = !DISubroutineType(types: !879)
!879 = !{!493, !493}
!880 = !DISubprogram(name: "MagickWandTerminus", scope: !881, file: !881, line: 116, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!881 = !DIFile(filename: "apps/538.imagick_r/src/wand/MagickWand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ffc9981fe595b674b5932183b4455d96")
!882 = !DISubroutineType(types: !883)
!883 = !{null}
!884 = !DISubprogram(name: "ResetMagickMemory", scope: !868, file: !868, line: 52, type: !885, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!885 = !DISubroutineType(types: !886)
!886 = !{!505, !505, !500, !788}
!887 = !DISubprogram(name: "AcquireWandId", scope: !888, file: !888, line: 26, type: !889, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!888 = !DIFile(filename: "apps/538.imagick_r/src/wand/wand.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04fee0d7de953bb2b067eac76943bcb6")
!889 = !DISubroutineType(types: !890)
!890 = !{!485}
!891 = !DISubprogram(name: "FormatLocaleString", scope: !892, file: !892, line: 71, type: !893, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!892 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "156c27c5fb4b55284e5f6c924766571a")
!893 = !DISubroutineType(types: !894)
!894 = !{!525, !895, !788, !896, null}
!895 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !502)
!896 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !661)
!897 = !DISubprogram(name: "AcquireExceptionInfo", scope: !4, file: !4, line: 146, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!898 = !DISubroutineType(types: !899)
!899 = !{!493}
!900 = !DISubprogram(name: "InheritException", scope: !4, file: !4, line: 167, type: !901, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !493, !903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!905 = !DISubprogram(name: "CloneCacheView", scope: !449, file: !449, line: 56, type: !906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!906 = !DISubroutineType(types: !907)
!907 = !{!515, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!910 = !DISubprogram(name: "ClonePixelWands", scope: !537, file: !537, line: 59, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!911 = !DISubroutineType(types: !912)
!912 = !{!534, !542, !788}
!913 = distinct !DISubprogram(name: "DestroyPixelIterator", scope: !482, file: !482, line: 211, type: !914, scopeLine: 212, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !916)
!914 = !DISubroutineType(types: !915)
!915 = !{!478, !478}
!916 = !{!917}
!917 = !DILocalVariable(name: "iterator", arg: 1, scope: !913, file: !482, line: 211, type: !478)
!918 = !DILocation(line: 0, scope: !913)
!919 = !DILocation(line: 215, column: 17, scope: !920)
!920 = distinct !DILexicalBlock(scope: !913, file: !482, line: 215, column: 7)
!921 = !DILocation(line: 215, column: 23, scope: !920)
!922 = !DILocation(line: 215, column: 7, scope: !913)
!923 = !DILocation(line: 216, column: 70, scope: !920)
!924 = !DILocation(line: 216, column: 12, scope: !920)
!925 = !DILocation(line: 216, column: 5, scope: !920)
!926 = !DILocation(line: 217, column: 45, scope: !913)
!927 = !DILocation(line: 217, column: 18, scope: !913)
!928 = !DILocation(line: 217, column: 17, scope: !913)
!929 = !DILocation(line: 218, column: 53, scope: !913)
!930 = !DILocation(line: 219, column: 15, scope: !913)
!931 = !DILocation(line: 219, column: 22, scope: !913)
!932 = !DILocation(line: 218, column: 25, scope: !913)
!933 = !DILocation(line: 218, column: 24, scope: !913)
!934 = !DILocation(line: 220, column: 54, scope: !913)
!935 = !DILocation(line: 220, column: 23, scope: !913)
!936 = !DILocation(line: 220, column: 22, scope: !913)
!937 = !DILocation(line: 221, column: 13, scope: !913)
!938 = !DILocation(line: 221, column: 22, scope: !913)
!939 = !DILocation(line: 222, column: 30, scope: !913)
!940 = !DILocation(line: 222, column: 3, scope: !913)
!941 = !DILocation(line: 223, column: 30, scope: !913)
!942 = !DILocation(line: 224, column: 3, scope: !913)
!943 = !DISubprogram(name: "DestroyCacheView", scope: !449, file: !449, line: 57, type: !944, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!944 = !DISubroutineType(types: !945)
!945 = !{!515, !515}
!946 = !DISubprogram(name: "RelinquishWandId", scope: !888, file: !888, line: 30, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !788}
!949 = !DISubprogram(name: "RelinquishMagickMemory", scope: !868, file: !868, line: 51, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!950 = !DISubroutineType(types: !951)
!951 = !{!505, !505}
!952 = distinct !DISubprogram(name: "IsPixelIterator", scope: !482, file: !482, line: 250, type: !953, scopeLine: 251, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !955)
!953 = !DISubroutineType(types: !954)
!954 = !{!507, !545}
!955 = !{!956, !957}
!956 = !DILocalVariable(name: "iterator", arg: 1, scope: !952, file: !482, line: 250, type: !545)
!957 = !DILocalVariable(name: "length", scope: !952, file: !482, line: 253, type: !485)
!958 = !DILocation(line: 0, scope: !952)
!959 = !DILocation(line: 255, column: 16, scope: !960)
!960 = distinct !DILexicalBlock(scope: !952, file: !482, line: 255, column: 7)
!961 = !DILocation(line: 255, column: 7, scope: !952)
!962 = !DILocation(line: 257, column: 17, scope: !963)
!963 = distinct !DILexicalBlock(scope: !952, file: !482, line: 257, column: 7)
!964 = !DILocation(line: 257, column: 27, scope: !963)
!965 = !DILocation(line: 257, column: 7, scope: !952)
!966 = !DILocation(line: 260, column: 32, scope: !967)
!967 = distinct !DILexicalBlock(scope: !952, file: !482, line: 260, column: 7)
!968 = !DILocation(line: 260, column: 7, scope: !967)
!969 = !DILocation(line: 260, column: 61, scope: !967)
!970 = !DILocation(line: 263, column: 1, scope: !952)
!971 = !DISubprogram(name: "LocaleNCompare", scope: !972, file: !972, line: 67, type: !973, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!972 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!973 = !DISubroutineType(types: !974)
!974 = !{!500, !661, !661, !788}
!975 = distinct !DISubprogram(name: "NewPixelIterator", scope: !482, file: !482, line: 287, type: !976, scopeLine: 288, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1136)
!976 = !DISubroutineType(types: !977)
!977 = !{!478, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickWand", file: !881, line: 69, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickWand", file: !981, line: 50, size: 33280, elements: !982)
!981 = !DIFile(filename: "apps/538.imagick_r/src/wand/magick-wand-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "acd9e5d3507eb9a242a35f2a3efc4904")
!982 = !{!983, !984, !985, !986, !1118, !1131, !1132, !1133, !1134, !1135}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !980, file: !981, line: 53, baseType: !485, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !980, file: !981, line: 56, baseType: !488, size: 32768, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !980, file: !981, line: 59, baseType: !493, size: 64, offset: 32832)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !980, file: !981, line: 62, baseType: !987, size: 64, offset: 32896)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !78, line: 223, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !133, line: 356, size: 134336, elements: !990)
!990 = !{!991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1025, !1026, !1027, !1028, !1029, !1030, !1032, !1033, !1034, !1035, !1036, !1037, !1047, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1115, !1116, !1117}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !989, file: !133, line: 359, baseType: !556, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !989, file: !133, line: 362, baseType: !559, size: 32, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !989, file: !133, line: 365, baseType: !507, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !989, file: !133, line: 366, baseType: !507, size: 32, offset: 96)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !989, file: !133, line: 367, baseType: !507, size: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !989, file: !133, line: 368, baseType: !507, size: 32, offset: 160)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !989, file: !133, line: 371, baseType: !502, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !989, file: !133, line: 372, baseType: !502, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !989, file: !133, line: 373, baseType: !502, size: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !989, file: !133, line: 374, baseType: !502, size: 64, offset: 384)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !989, file: !133, line: 377, baseType: !485, size: 64, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !989, file: !133, line: 378, baseType: !485, size: 64, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !989, file: !133, line: 379, baseType: !485, size: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !989, file: !133, line: 382, baseType: !615, size: 32, offset: 640)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !989, file: !133, line: 385, baseType: !617, size: 32, offset: 672)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !989, file: !133, line: 388, baseType: !599, size: 32, offset: 704)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !989, file: !133, line: 391, baseType: !485, size: 64, offset: 768)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !989, file: !133, line: 394, baseType: !502, size: 64, offset: 832)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !989, file: !133, line: 395, baseType: !502, size: 64, offset: 896)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !989, file: !133, line: 396, baseType: !502, size: 64, offset: 960)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !989, file: !133, line: 397, baseType: !502, size: 64, offset: 1024)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !989, file: !133, line: 398, baseType: !502, size: 64, offset: 1088)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !989, file: !133, line: 401, baseType: !541, size: 64, offset: 1152)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !989, file: !133, line: 402, baseType: !541, size: 64, offset: 1216)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !989, file: !133, line: 405, baseType: !568, size: 64, offset: 1280)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !989, file: !133, line: 406, baseType: !568, size: 64, offset: 1344)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !989, file: !133, line: 407, baseType: !568, size: 64, offset: 1408)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !989, file: !133, line: 410, baseType: !507, size: 32, offset: 1472)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !989, file: !133, line: 411, baseType: !507, size: 32, offset: 1504)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !989, file: !133, line: 414, baseType: !485, size: 64, offset: 1536)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !989, file: !133, line: 417, baseType: !554, size: 32, offset: 1600)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !989, file: !133, line: 420, baseType: !717, size: 32, offset: 1632)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !989, file: !133, line: 423, baseType: !1024, size: 32, offset: 1664)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !217, line: 59, baseType: !216)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !989, file: !133, line: 426, baseType: !525, size: 64, offset: 1728)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !989, file: !133, line: 429, baseType: !507, size: 32, offset: 1792)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !989, file: !133, line: 430, baseType: !507, size: 32, offset: 1824)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !989, file: !133, line: 433, baseType: !502, size: 64, offset: 1856)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !989, file: !133, line: 434, baseType: !502, size: 64, offset: 1920)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !989, file: !133, line: 437, baseType: !1031, size: 32, offset: 1984)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !78, line: 202, baseType: !249)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !989, file: !133, line: 440, baseType: !547, size: 64, offset: 2048)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !989, file: !133, line: 443, baseType: !505, size: 64, offset: 2112)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !989, file: !133, line: 446, baseType: !656, size: 64, offset: 2176)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !989, file: !133, line: 449, baseType: !505, size: 64, offset: 2240)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !989, file: !133, line: 450, baseType: !505, size: 64, offset: 2304)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !989, file: !133, line: 453, baseType: !1038, size: 64, offset: 2368)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1039, line: 26, baseType: !1040)
!1039 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!485, !1043, !1045, !788}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !989, file: !133, line: 456, baseType: !1048, size: 64, offset: 2432)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1050, line: 7, baseType: !1051)
!1050 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1052, line: 49, size: 1728, elements: !1053)
!1052 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1069, !1071, !1072, !1073, !1075, !1076, !1078, !1082, !1085, !1087, !1090, !1093, !1094, !1095, !1096, !1097}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1051, file: !1052, line: 51, baseType: !500, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1051, file: !1052, line: 54, baseType: !502, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1051, file: !1052, line: 55, baseType: !502, size: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1051, file: !1052, line: 56, baseType: !502, size: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1051, file: !1052, line: 57, baseType: !502, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1051, file: !1052, line: 58, baseType: !502, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1051, file: !1052, line: 59, baseType: !502, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1051, file: !1052, line: 60, baseType: !502, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1051, file: !1052, line: 61, baseType: !502, size: 64, offset: 512)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1051, file: !1052, line: 64, baseType: !502, size: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1051, file: !1052, line: 65, baseType: !502, size: 64, offset: 640)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1051, file: !1052, line: 66, baseType: !502, size: 64, offset: 704)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1051, file: !1052, line: 68, baseType: !1067, size: 64, offset: 768)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1052, line: 36, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1051, file: !1052, line: 70, baseType: !1070, size: 64, offset: 832)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1051, file: !1052, line: 72, baseType: !500, size: 32, offset: 896)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1051, file: !1052, line: 73, baseType: !500, size: 32, offset: 928)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1051, file: !1052, line: 74, baseType: !1074, size: 64, offset: 960)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !528, line: 152, baseType: !529)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1051, file: !1052, line: 77, baseType: !573, size: 16, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1051, file: !1052, line: 78, baseType: !1077, size: 8, offset: 1040)
!1077 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1051, file: !1052, line: 79, baseType: !1079, size: 8, offset: 1048)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 8, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 1)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1051, file: !1052, line: 81, baseType: !1083, size: 64, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1052, line: 43, baseType: null)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1051, file: !1052, line: 89, baseType: !1086, size: 64, offset: 1152)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !528, line: 153, baseType: !529)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1051, file: !1052, line: 91, baseType: !1088, size: 64, offset: 1216)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1052, line: 37, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1051, file: !1052, line: 92, baseType: !1091, size: 64, offset: 1280)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1052, line: 38, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1051, file: !1052, line: 93, baseType: !1070, size: 64, offset: 1344)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1051, file: !1052, line: 94, baseType: !505, size: 64, offset: 1408)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1051, file: !1052, line: 95, baseType: !485, size: 64, offset: 1472)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1051, file: !1052, line: 96, baseType: !500, size: 32, offset: 1536)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1051, file: !1052, line: 98, baseType: !1098, size: 160, offset: 1568)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 160, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 20)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !989, file: !133, line: 459, baseType: !505, size: 64, offset: 2496)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !989, file: !133, line: 462, baseType: !485, size: 64, offset: 2560)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !989, file: !133, line: 465, baseType: !488, size: 32768, offset: 2624)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !989, file: !133, line: 466, baseType: !488, size: 32768, offset: 35392)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !989, file: !133, line: 467, baseType: !488, size: 32768, offset: 68160)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !989, file: !133, line: 468, baseType: !488, size: 32768, offset: 100928)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !989, file: !133, line: 471, baseType: !507, size: 32, offset: 133696)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !989, file: !133, line: 474, baseType: !502, size: 64, offset: 133760)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !989, file: !133, line: 477, baseType: !485, size: 64, offset: 133824)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !989, file: !133, line: 478, baseType: !485, size: 64, offset: 133888)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !989, file: !133, line: 481, baseType: !568, size: 64, offset: 133952)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !989, file: !133, line: 484, baseType: !485, size: 64, offset: 134016)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !989, file: !133, line: 487, baseType: !1114, size: 32, offset: 134080)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !449, line: 47, baseType: !448)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !989, file: !133, line: 490, baseType: !568, size: 64, offset: 134112)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !989, file: !133, line: 493, baseType: !505, size: 64, offset: 134208)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !989, file: !133, line: 496, baseType: !507, size: 32, offset: 134272)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_info", scope: !980, file: !981, line: 65, baseType: !1119, size: 64, offset: 32960)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantizeInfo", file: !470, line: 57, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantizeInfo", file: !470, line: 35, size: 384, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "number_colors", scope: !1121, file: !470, line: 38, baseType: !485, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "tree_depth", scope: !1121, file: !470, line: 41, baseType: !485, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1121, file: !470, line: 44, baseType: !507, size: 32, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1121, file: !470, line: 47, baseType: !554, size: 32, offset: 160)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "measure_error", scope: !1121, file: !470, line: 50, baseType: !507, size: 32, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1121, file: !470, line: 53, baseType: !485, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "dither_method", scope: !1121, file: !470, line: 56, baseType: !1130, size: 32, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "DitherMethod", file: !470, line: 33, baseType: !469)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !980, file: !981, line: 68, baseType: !547, size: 64, offset: 33024)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "insert_before", scope: !980, file: !981, line: 71, baseType: !507, size: 32, offset: 33088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "image_pending", scope: !980, file: !981, line: 72, baseType: !507, size: 32, offset: 33120)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !980, file: !981, line: 73, baseType: !507, size: 32, offset: 33152)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !980, file: !981, line: 76, baseType: !485, size: 64, offset: 33216)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1147}
!1137 = !DILocalVariable(name: "wand", arg: 1, scope: !975, file: !482, line: 287, type: !978)
!1138 = !DILocalVariable(name: "quantum", scope: !975, file: !482, line: 290, type: !661)
!1139 = !DILocalVariable(name: "exception", scope: !975, file: !482, line: 293, type: !493)
!1140 = !DILocalVariable(name: "image", scope: !975, file: !482, line: 296, type: !547)
!1141 = !DILocalVariable(name: "iterator", scope: !975, file: !482, line: 299, type: !478)
!1142 = !DILocalVariable(name: "depth", scope: !975, file: !482, line: 302, type: !485)
!1143 = !DILocalVariable(name: "view", scope: !975, file: !482, line: 305, type: !515)
!1144 = !DILocalVariable(name: "exception", scope: !1145, file: !482, line: 310, type: !494)
!1145 = distinct !DILexicalBlock(scope: !1146, file: !482, line: 310, column: 5)
!1146 = distinct !DILexicalBlock(scope: !975, file: !482, line: 309, column: 7)
!1147 = !DILocalVariable(name: "exception", scope: !1148, file: !482, line: 321, type: !494)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !482, line: 321, column: 5)
!1149 = distinct !DILexicalBlock(scope: !975, file: !482, line: 320, column: 7)
!1150 = !DILocation(line: 0, scope: !975)
!1151 = !DILocation(line: 301, column: 3, scope: !975)
!1152 = !DILocation(line: 307, column: 8, scope: !975)
!1153 = !DILocation(line: 308, column: 11, scope: !975)
!1154 = !DILocation(line: 309, column: 7, scope: !1146)
!1155 = !DILocation(line: 309, column: 13, scope: !1146)
!1156 = !DILocation(line: 309, column: 7, scope: !975)
!1157 = !DILocation(line: 310, column: 5, scope: !1145)
!1158 = !DILocation(line: 312, column: 9, scope: !975)
!1159 = !DILocation(line: 313, column: 13, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !975, file: !482, line: 313, column: 7)
!1161 = !DILocation(line: 313, column: 7, scope: !975)
!1162 = !DILocation(line: 315, column: 13, scope: !975)
!1163 = !DILocation(line: 316, column: 8, scope: !975)
!1164 = !DILocation(line: 317, column: 12, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !975, file: !482, line: 317, column: 7)
!1166 = !DILocation(line: 317, column: 7, scope: !975)
!1167 = !DILocation(line: 319, column: 30, scope: !975)
!1168 = !DILocation(line: 320, column: 16, scope: !1149)
!1169 = !DILocation(line: 320, column: 7, scope: !975)
!1170 = !DILocation(line: 321, column: 5, scope: !1148)
!1171 = !{!1172, !1172, i64 0}
!1172 = !{!"int", !752, i64 0}
!1173 = !DILocation(line: 323, column: 10, scope: !975)
!1174 = !DILocation(line: 324, column: 16, scope: !975)
!1175 = !DILocation(line: 324, column: 15, scope: !975)
!1176 = !DILocation(line: 325, column: 39, scope: !975)
!1177 = !DILocation(line: 326, column: 21, scope: !975)
!1178 = !DILocation(line: 325, column: 10, scope: !975)
!1179 = !DILocation(line: 327, column: 13, scope: !975)
!1180 = !DILocation(line: 327, column: 22, scope: !975)
!1181 = !DILocation(line: 328, column: 13, scope: !975)
!1182 = !DILocation(line: 328, column: 17, scope: !975)
!1183 = !DILocation(line: 329, column: 32, scope: !975)
!1184 = !DILocation(line: 329, column: 3, scope: !975)
!1185 = !DILocation(line: 330, column: 33, scope: !975)
!1186 = !{!1187, !751, i64 40}
