; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/policy.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/policy.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._PolicyInfo = type { ptr, i32, i32, ptr, ptr, ptr, i32, i32, i32, ptr, i64 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }

@.str = private unnamed_addr constant [85 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/policy.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"*\00", align 1
@policy_cache = internal unnamed_addr global ptr null, align 8, !dbg !0
@policy_semaphore = internal global ptr null, align 8, !dbg !360
@.str.4 = private unnamed_addr constant [40 x i8] c"Domain: %s; rights=%s; pattern=\22%s\22 ...\00", align 1
@stdout = external local_unnamed_addr global ptr, align 8
@.str.5 = private unnamed_addr constant [11 x i8] c"\0APath: %s\0A\00", align 1
@.str.6 = private unnamed_addr constant [14 x i8] c"  Policy: %s\0A\00", align 1
@.str.7 = private unnamed_addr constant [14 x i8] c"    name: %s\0A\00", align 1

!152 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!153 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!154 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!155 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!156 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!157 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!158 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!159 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!160 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!161 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!162 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!163 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!164 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!165 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!166 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!167 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!168 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!169 = !DIEnumerator(name: "MagickListOptions", value: 38)
!170 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!171 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!172 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!173 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!174 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!175 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!176 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!177 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!178 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!179 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!180 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!181 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!182 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!183 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!184 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!185 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!186 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!187 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!188 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!189 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!190 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!191 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!192 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!193 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!194 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!195 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!196 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!197 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!198 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!199 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!200 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!201 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !203, line: 46, baseType: !7, size: 32, elements: !204)
!203 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!205 = !DIEnumerator(name: "_ISupper", value: 256)
!206 = !DIEnumerator(name: "_ISlower", value: 512)
!207 = !DIEnumerator(name: "_ISalpha", value: 1024)
!208 = !DIEnumerator(name: "_ISdigit", value: 2048)
!209 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!210 = !DIEnumerator(name: "_ISspace", value: 8192)
!211 = !DIEnumerator(name: "_ISprint", value: 16384)
!212 = !DIEnumerator(name: "_ISgraph", value: 32768)
!213 = !DIEnumerator(name: "_ISblank", value: 1)
!214 = !DIEnumerator(name: "_IScntrl", value: 2)
!215 = !DIEnumerator(name: "_ISpunct", value: 4)
!216 = !DIEnumerator(name: "_ISalnum", value: 8)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !218, line: 25, baseType: !7, size: 32, elements: !219)
!218 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228}
!220 = !DIEnumerator(name: "UndefinedPath", value: 0)
!221 = !DIEnumerator(name: "MagickPath", value: 1)
!222 = !DIEnumerator(name: "RootPath", value: 2)
!223 = !DIEnumerator(name: "HeadPath", value: 3)
!224 = !DIEnumerator(name: "TailPath", value: 4)
!225 = !DIEnumerator(name: "BasePath", value: 5)
!226 = !DIEnumerator(name: "ExtensionPath", value: 6)
!227 = !DIEnumerator(name: "SubimagePath", value: 7)
!228 = !DIEnumerator(name: "CanonicalPath", value: 8)
!229 = !{!230, !231, !259, !260, !257, !261, !262, !238, !263, !265, !322, !252, !325, !128, !329, !296, !330, !344, !241, !243}
!230 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyInfo", file: !6, line: 49, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PolicyInfo", file: !235, line: 68, size: 576, elements: !236)
!235 = !DIFile(filename: "apps/538.imagick_r/src/magick/policy.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ee854e731034e0d699a9681fe1fe0d14")
!236 = !{!237, !240, !242, !244, !245, !246, !247, !249, !250, !251, !256}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !234, file: !235, line: 71, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !234, file: !235, line: 74, baseType: !241, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyDomain", file: !6, line: 37, baseType: !5)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rights", scope: !234, file: !235, line: 77, baseType: !243, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyRights", file: !6, line: 46, baseType: !16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !235, line: 80, baseType: !238, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !234, file: !235, line: 81, baseType: !238, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !234, file: !235, line: 82, baseType: !238, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !234, file: !235, line: 85, baseType: !248, size: 32, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !24, line: 215, baseType: !23)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !234, file: !235, line: 86, baseType: !248, size: 32, offset: 352)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !234, file: !235, line: 87, baseType: !248, size: 32, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !234, file: !235, line: 90, baseType: !252, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !254, line: 26, baseType: !255)
!254 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !254, line: 25, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !234, file: !235, line: 93, baseType: !257, size: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !258, line: 46, baseType: !230)
!258 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !268, line: 7, baseType: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !270, line: 49, size: 1728, elements: !271)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !287, !289, !290, !291, !295, !297, !299, !303, !306, !308, !311, !314, !315, !316, !317, !318}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !269, file: !270, line: 51, baseType: !128, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !269, file: !270, line: 54, baseType: !238, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !269, file: !270, line: 55, baseType: !238, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !269, file: !270, line: 56, baseType: !238, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !269, file: !270, line: 57, baseType: !238, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !269, file: !270, line: 58, baseType: !238, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !269, file: !270, line: 59, baseType: !238, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !269, file: !270, line: 60, baseType: !238, size: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !269, file: !270, line: 61, baseType: !238, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !269, file: !270, line: 64, baseType: !238, size: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !269, file: !270, line: 65, baseType: !238, size: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !269, file: !270, line: 66, baseType: !238, size: 64, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !269, file: !270, line: 68, baseType: !285, size: 64, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !270, line: 36, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !269, file: !270, line: 70, baseType: !288, size: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !269, file: !270, line: 72, baseType: !128, size: 32, offset: 896)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !269, file: !270, line: 73, baseType: !128, size: 32, offset: 928)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !269, file: !270, line: 74, baseType: !292, size: 64, offset: 960)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !293, line: 152, baseType: !294)
!293 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!294 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !269, file: !270, line: 77, baseType: !296, size: 16, offset: 1024)
!296 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !269, file: !270, line: 78, baseType: !298, size: 8, offset: 1040)
!298 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !269, file: !270, line: 79, baseType: !300, size: 8, offset: 1048)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 8, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 1)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !269, file: !270, line: 81, baseType: !304, size: 64, offset: 1088)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !270, line: 43, baseType: null)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !269, file: !270, line: 89, baseType: !307, size: 64, offset: 1152)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !293, line: 153, baseType: !294)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !269, file: !270, line: 91, baseType: !309, size: 64, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !270, line: 37, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !269, file: !270, line: 92, baseType: !312, size: 64, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !270, line: 38, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !269, file: !270, line: 93, baseType: !288, size: 64, offset: 1344)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !269, file: !270, line: 94, baseType: !259, size: 64, offset: 1408)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !269, file: !270, line: 95, baseType: !257, size: 64, offset: 1472)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !269, file: !270, line: 96, baseType: !128, size: 32, offset: 1536)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !269, file: !270, line: 98, baseType: !319, size: 160, offset: 1568)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 160, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 20)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !323, line: 77, baseType: !324)
!323 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !293, line: 193, baseType: !294)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !327, line: 34, baseType: !328)
!327 = !DIFile(filename: "apps/538.imagick_r/src/magick/hashmap.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "683c2bd26601474466c188c023adadf2")
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !327, line: 33, flags: DIFlagFwdDecl)
!329 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !333, line: 40, baseType: !334)
!333 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !333, line: 29, size: 32960, elements: !335)
!335 = !{!336, !340, !342, !343}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !334, file: !333, line: 32, baseType: !337, size: 32768)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 32768, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 4096)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !334, file: !333, line: 35, baseType: !341, size: 64, offset: 32768)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !334, file: !333, line: 38, baseType: !257, size: 64, offset: 32832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !334, file: !333, line: 39, baseType: !257, size: 64, offset: 32896)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!345 = !{!346, !0, !360}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "PolicyMap", scope: !2, file: !235, line: 114, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 256, elements: !301)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyMapInfo", file: !235, line: 108, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PolicyMapInfo", file: !235, line: 96, size: 256, elements: !352)
!352 = !{!353, !355, !357, !358, !359}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !351, file: !235, line: 99, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rights", scope: !351, file: !235, line: 102, baseType: !356, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !351, file: !235, line: 105, baseType: !263, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !351, file: !235, line: 106, baseType: !263, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !351, file: !235, line: 107, baseType: !263, size: 64, offset: 192)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "policy_semaphore", scope: !2, file: !235, line: 124, type: !252, isLocal: true, isDefinition: true)
!362 = !{i32 7, !"Dwarf Version", i32 5}
!363 = !{i32 2, !"Debug Info Version", i32 3}
!364 = !{i32 1, !"wchar_size", i32 4}
!365 = !{i32 7, !"PIC Level", i32 2}
!366 = !{i32 7, !"PIE Level", i32 2}
!367 = !{i32 7, !"uwtable", i32 2}
!368 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!369 = distinct !DISubprogram(name: "GetPolicyInfoList", scope: !235, file: !235, line: 331, type: !370, scopeLine: 333, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !386)
!370 = !DISubroutineType(types: !371)
!371 = !{!260, !263, !372, !373}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !24, line: 219, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !29, line: 102, size: 448, elements: !376)
!376 = !{!377, !379, !380, !381, !382, !383, !384, !385}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !375, file: !29, line: 105, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !29, line: 100, baseType: !28)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !375, file: !29, line: 108, baseType: !128, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !375, file: !29, line: 111, baseType: !238, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !375, file: !29, line: 112, baseType: !238, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !375, file: !29, line: 115, baseType: !259, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !375, file: !29, line: 118, baseType: !248, size: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !375, file: !29, line: 121, baseType: !252, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !375, file: !29, line: 124, baseType: !257, size: 64, offset: 384)
!386 = !{!387, !388, !389, !390, !391, !392}
!387 = !DILocalVariable(name: "pattern", arg: 1, scope: !369, file: !235, line: 331, type: !263)
!388 = !DILocalVariable(name: "number_policies", arg: 2, scope: !369, file: !235, line: 332, type: !372)
!389 = !DILocalVariable(name: "exception", arg: 3, scope: !369, file: !235, line: 332, type: !373)
!390 = !DILocalVariable(name: "policies", scope: !369, file: !235, line: 335, type: !260)
!391 = !DILocalVariable(name: "p", scope: !369, file: !235, line: 338, type: !231)
!392 = !DILocalVariable(name: "i", scope: !369, file: !235, line: 341, type: !322)
!393 = !DILocation(line: 0, scope: !369)
!394 = !DILocation(line: 347, column: 10, scope: !369)
!395 = !DILocation(line: 349, column: 19, scope: !369)
!396 = !{!397, !397, i64 0}
!397 = !{!"long", !398, i64 0}
!398 = !{!"omnipotent char", !399, i64 0}
!399 = !{!"Simple C/C++ TBAA"}
!400 = !DILocation(line: 350, column: 5, scope: !369)
!401 = !DILocation(line: 351, column: 9, scope: !402)
!402 = distinct !DILexicalBlock(scope: !369, file: !235, line: 351, column: 7)
!403 = !DILocation(line: 351, column: 7, scope: !369)
!404 = !DILocation(line: 354, column: 37, scope: !369)
!405 = !{!406, !406, i64 0}
!406 = !{!"any pointer", !398, i64 0}
!407 = !DILocation(line: 354, column: 5, scope: !369)
!408 = !DILocation(line: 354, column: 50, scope: !369)
!409 = !DILocation(line: 353, column: 34, scope: !369)
!410 = !DILocation(line: 355, column: 16, scope: !411)
!411 = distinct !DILexicalBlock(scope: !369, file: !235, line: 355, column: 7)
!412 = !DILocation(line: 355, column: 7, scope: !369)
!413 = !DILocation(line: 360, column: 21, scope: !369)
!414 = !DILocation(line: 360, column: 3, scope: !369)
!415 = !DILocation(line: 361, column: 27, scope: !369)
!416 = !DILocation(line: 361, column: 3, scope: !369)
!417 = !DILocation(line: 362, column: 51, scope: !369)
!418 = !DILocation(line: 362, column: 26, scope: !369)
!419 = !DILocation(line: 363, column: 15, scope: !420)
!420 = distinct !DILexicalBlock(scope: !421, file: !235, line: 363, column: 3)
!421 = distinct !DILexicalBlock(scope: !369, file: !235, line: 363, column: 3)
!422 = !DILocation(line: 363, column: 3, scope: !421)
!423 = !DILocation(line: 365, column: 13, scope: !424)
!424 = distinct !DILexicalBlock(scope: !425, file: !235, line: 365, column: 9)
!425 = distinct !DILexicalBlock(scope: !420, file: !235, line: 364, column: 3)
!426 = !{!427, !398, i64 44}
!427 = !{!"_PolicyInfo", !406, i64 0, !398, i64 8, !398, i64 12, !406, i64 16, !406, i64 24, !406, i64 32, !398, i64 40, !398, i64 44, !398, i64 48, !406, i64 56, !397, i64 64}
!428 = !DILocation(line: 365, column: 21, scope: !424)
!429 = !DILocation(line: 365, column: 37, scope: !424)
!430 = !DILocation(line: 366, column: 28, scope: !424)
!431 = !{!427, !406, i64 16}
!432 = !DILocation(line: 366, column: 10, scope: !424)
!433 = !DILocation(line: 366, column: 54, scope: !424)
!434 = !DILocation(line: 365, column: 9, scope: !425)
!435 = !DILocation(line: 367, column: 17, scope: !424)
!436 = !DILocation(line: 367, column: 7, scope: !424)
!437 = !DILocation(line: 367, column: 20, scope: !424)
!438 = !DILocation(line: 0, scope: !421)
!439 = !DILocation(line: 368, column: 53, scope: !425)
!440 = !DILocation(line: 368, column: 28, scope: !425)
!441 = distinct !{!441, !422, !442, !443, !444}
!442 = !DILocation(line: 369, column: 3, scope: !421)
!443 = !{!"llvm.loop.mustprogress"}
!444 = !{!"llvm.loop.unroll.disable"}
!445 = !DILocation(line: 370, column: 23, scope: !369)
!446 = !DILocation(line: 370, column: 3, scope: !369)
!447 = !DILocation(line: 371, column: 3, scope: !369)
!448 = !DILocation(line: 371, column: 14, scope: !369)
!449 = !DILocation(line: 372, column: 19, scope: !369)
!450 = !DILocation(line: 373, column: 3, scope: !369)
!451 = !DILocation(line: 374, column: 1, scope: !369)
