; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/prepress.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/prepress.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!326 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!328 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!329 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!330 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!331 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!332 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!333 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!334 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!335 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!336 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!337 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!338 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!339 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!340 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!341 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 47, baseType: !5, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!344 = !DIEnumerator(name: "UndefinedType", value: 0)
!345 = !DIEnumerator(name: "BilevelType", value: 1)
!346 = !DIEnumerator(name: "GrayscaleType", value: 2)
!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!348 = !DIEnumerator(name: "PaletteType", value: 4)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!350 = !DIEnumerator(name: "TrueColorType", value: 6)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!354 = !DIEnumerator(name: "OptimizeType", value: 10)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!372 = !DIEnumerator(name: "NoEvents", value: 0)
!373 = !DIEnumerator(name: "TraceEvent", value: 1)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!375 = !DIEnumerator(name: "BlobEvent", value: 4)
!376 = !DIEnumerator(name: "CacheEvent", value: 8)
!377 = !DIEnumerator(name: "CoderEvent", value: 16)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!380 = !DIEnumerator(name: "DrawEvent", value: 128)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!382 = !DIEnumerator(name: "ImageEvent", value: 512)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384)
!388 = !DIEnumerator(name: "UserEvent", value: 36864)
!389 = !DIEnumerator(name: "WandEvent", value: 65536)
!390 = !DIEnumerator(name: "X11Event", value: 131072)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!393 = !{!394, !395, !400, !411, !412, !413}
!394 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !396, line: 77, baseType: !397)
!396 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !398, line: 193, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!399 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !404)
!404 = !{!405, !408, !409, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !403, file: !326, line: 143, baseType: !406, size: 16)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !407)
!407 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !403, file: !326, line: 144, baseType: !406, size: 16, offset: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !403, file: !326, line: 145, baseType: !406, size: 16, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !403, file: !326, line: 146, baseType: !406, size: 16, offset: 48)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!412 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !406)
!416 = !{i32 7, !"Dwarf Version", i32 5}
!417 = !{i32 2, !"Debug Info Version", i32 3}
!418 = !{i32 1, !"wchar_size", i32 4}
!419 = !{i32 7, !"PIC Level", i32 2}
!420 = !{i32 7, !"PIE Level", i32 2}
!421 = !{i32 7, !"uwtable", i32 2}
!422 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!423 = distinct !DISubprogram(name: "GetImageTotalInkDensity", scope: !424, file: !424, line: 83, type: !425, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !632)
!424 = !DIFile(filename: "apps/538.imagick_r/src/magick/prepress.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "8dc3fd72e45188f1bdaaf3ef849d9463")
!425 = !DISubroutineType(types: !426)
!426 = !{!412, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !430)
!430 = !{!431, !433, !435, !437, !440, !442, !444, !445, !446, !447, !448, !449, !451, !452, !453, !454, !455, !469, !471, !472, !474, !477, !478, !479, !480, !481, !482, !490, !491, !492, !493, !494, !495, !497, !499, !501, !503, !505, !507, !509, !510, !511, !512, !513, !514, !515, !523, !538, !552, !553, !554, !555, !559, !563, !567, !568, !569, !570, !571, !589, !590, !592, !593, !603, !604, !606, !607, !608, !609, !610, !611, !613, !614, !615, !616, !617, !618, !619, !621, !622, !623, !624, !625, !629, !631}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !429, file: !73, line: 153, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !429, file: !73, line: 156, baseType: !434, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !429, file: !73, line: 159, baseType: !436, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !429, file: !73, line: 162, baseType: !438, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !439, line: 46, baseType: !394)
!439 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!440 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !429, file: !73, line: 165, baseType: !441, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !429, file: !73, line: 168, baseType: !443, size: 32, offset: 224)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !429, file: !73, line: 169, baseType: !443, size: 32, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !429, file: !73, line: 172, baseType: !438, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !429, file: !73, line: 173, baseType: !438, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !429, file: !73, line: 174, baseType: !438, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !429, file: !73, line: 175, baseType: !438, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !429, file: !73, line: 178, baseType: !450, size: 64, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !429, file: !73, line: 179, baseType: !402, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !429, file: !73, line: 180, baseType: !402, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !429, file: !73, line: 181, baseType: !402, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !429, file: !73, line: 184, baseType: !412, size: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !429, file: !73, line: 187, baseType: !456, size: 768, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !458)
!458 = !{!459, !466, !467, !468}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !457, file: !73, line: 124, baseType: !460, size: 192)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !461, file: !73, line: 98, baseType: !412, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !461, file: !73, line: 99, baseType: !412, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !461, file: !73, line: 100, baseType: !412, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !457, file: !73, line: 125, baseType: !460, size: 192, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !457, file: !73, line: 126, baseType: !460, size: 192, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !457, file: !73, line: 127, baseType: !460, size: 192, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !429, file: !73, line: 190, baseType: !470, size: 32, offset: 1664)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !429, file: !73, line: 193, baseType: !411, size: 64, offset: 1728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !429, file: !73, line: 196, baseType: !473, size: 32, offset: 1792)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !429, file: !73, line: 199, baseType: !475, size: 64, offset: 1856)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !429, file: !73, line: 200, baseType: !475, size: 64, offset: 1920)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !429, file: !73, line: 201, baseType: !475, size: 64, offset: 1984)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !429, file: !73, line: 204, baseType: !395, size: 64, offset: 2048)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !429, file: !73, line: 207, baseType: !412, size: 64, offset: 2112)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !429, file: !73, line: 208, baseType: !412, size: 64, offset: 2176)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !429, file: !73, line: 211, baseType: !483, size: 256, offset: 2240)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !485)
!485 = !{!486, !487, !488, !489}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !484, file: !153, line: 124, baseType: !438, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !484, file: !153, line: 125, baseType: !438, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !484, file: !153, line: 128, baseType: !395, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !484, file: !153, line: 129, baseType: !395, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !429, file: !73, line: 212, baseType: !483, size: 256, offset: 2496)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !429, file: !73, line: 213, baseType: !483, size: 256, offset: 2752)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !429, file: !73, line: 216, baseType: !412, size: 64, offset: 3008)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !429, file: !73, line: 217, baseType: !412, size: 64, offset: 3072)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !429, file: !73, line: 218, baseType: !412, size: 64, offset: 3136)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !429, file: !73, line: 221, baseType: !496, size: 32, offset: 3200)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !429, file: !73, line: 224, baseType: !498, size: 32, offset: 3232)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !429, file: !73, line: 227, baseType: !500, size: 32, offset: 3264)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !429, file: !73, line: 230, baseType: !502, size: 32, offset: 3296)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !429, file: !73, line: 233, baseType: !504, size: 32, offset: 3328)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !429, file: !73, line: 236, baseType: !506, size: 32, offset: 3360)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !429, file: !73, line: 239, baseType: !508, size: 64, offset: 3392)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !429, file: !73, line: 242, baseType: !438, size: 64, offset: 3456)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !429, file: !73, line: 243, baseType: !438, size: 64, offset: 3520)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !429, file: !73, line: 246, baseType: !395, size: 64, offset: 3584)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !429, file: !73, line: 249, baseType: !438, size: 64, offset: 3648)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !429, file: !73, line: 250, baseType: !438, size: 64, offset: 3712)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !429, file: !73, line: 253, baseType: !395, size: 64, offset: 3776)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !429, file: !73, line: 256, baseType: !516, size: 192, offset: 3840)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !517, line: 68, baseType: !518)
!517 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !517, line: 62, size: 192, elements: !519)
!519 = !{!520, !521, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !518, file: !517, line: 65, baseType: !412, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !518, file: !517, line: 66, baseType: !412, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !518, file: !517, line: 67, baseType: !412, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !429, file: !73, line: 259, baseType: !524, size: 512, offset: 4032)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !526)
!526 = !{!527, !534, !535, !537}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !525, file: !247, line: 43, baseType: !528, size: 192)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !530)
!530 = !{!531, !532, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !529, file: !247, line: 35, baseType: !412, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !529, file: !247, line: 36, baseType: !412, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !529, file: !247, line: 37, baseType: !412, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !525, file: !247, line: 44, baseType: !528, size: 192, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !525, file: !247, line: 47, baseType: !536, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !525, file: !247, line: 50, baseType: !438, size: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !429, file: !73, line: 262, baseType: !539, size: 64, offset: 4544)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !540, line: 26, baseType: !541)
!540 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!443, !544, !546, !549, !411}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !548)
!548 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !551)
!551 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !429, file: !73, line: 265, baseType: !411, size: 64, offset: 4608)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !429, file: !73, line: 266, baseType: !411, size: 64, offset: 4672)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !429, file: !73, line: 267, baseType: !411, size: 64, offset: 4736)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !429, file: !73, line: 270, baseType: !556, size: 64, offset: 4800)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !558)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !429, file: !73, line: 273, baseType: !560, size: 64, offset: 4864)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !562)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !429, file: !73, line: 276, baseType: !564, size: 32768, offset: 4928)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 32768, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 4096)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !429, file: !73, line: 277, baseType: !564, size: 32768, offset: 37696)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !429, file: !73, line: 278, baseType: !564, size: 32768, offset: 70464)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !429, file: !73, line: 281, baseType: !438, size: 64, offset: 103232)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !429, file: !73, line: 282, baseType: !438, size: 64, offset: 103296)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !429, file: !73, line: 285, baseType: !572, size: 448, offset: 103360)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !574)
!574 = !{!575, !577, !579, !580, !581, !582, !583, !588}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !573, file: !253, line: 105, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !573, file: !253, line: 108, baseType: !578, size: 32, offset: 32)
!578 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !573, file: !253, line: 111, baseType: !475, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !573, file: !253, line: 112, baseType: !475, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !573, file: !253, line: 115, baseType: !411, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !573, file: !253, line: 118, baseType: !443, size: 32, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !573, file: !253, line: 121, baseType: !584, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !586, line: 26, baseType: !587)
!586 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !586, line: 25, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !573, file: !253, line: 124, baseType: !438, size: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !429, file: !73, line: 288, baseType: !443, size: 32, offset: 103808)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !429, file: !73, line: 291, baseType: !591, size: 64, offset: 103872)
!591 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !395)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !429, file: !73, line: 294, baseType: !584, size: 64, offset: 103936)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !429, file: !73, line: 297, baseType: !594, size: 256, offset: 104000)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !596)
!596 = !{!597, !598, !599, !602}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !595, file: !89, line: 30, baseType: !475, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !595, file: !89, line: 33, baseType: !438, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !595, file: !89, line: 36, baseType: !600, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !595, file: !89, line: 39, baseType: !438, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !429, file: !73, line: 298, baseType: !594, size: 256, offset: 104256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !429, file: !73, line: 299, baseType: !605, size: 64, offset: 104512)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !429, file: !73, line: 302, baseType: !438, size: 64, offset: 104576)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !429, file: !73, line: 305, baseType: !438, size: 64, offset: 104640)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !429, file: !73, line: 308, baseType: !508, size: 64, offset: 104704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !429, file: !73, line: 309, baseType: !508, size: 64, offset: 104768)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !73, line: 310, baseType: !508, size: 64, offset: 104832)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !429, file: !73, line: 313, baseType: !612, size: 32, offset: 104896)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !429, file: !73, line: 316, baseType: !443, size: 32, offset: 104928)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !429, file: !73, line: 319, baseType: !402, size: 64, offset: 104960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !429, file: !73, line: 322, baseType: !508, size: 64, offset: 105024)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !429, file: !73, line: 325, baseType: !483, size: 256, offset: 105088)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !429, file: !73, line: 328, baseType: !411, size: 64, offset: 105344)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !429, file: !73, line: 329, baseType: !411, size: 64, offset: 105408)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !73, line: 332, baseType: !620, size: 32, offset: 105472)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !429, file: !73, line: 335, baseType: !443, size: 32, offset: 105504)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !429, file: !73, line: 338, baseType: !550, size: 64, offset: 105536)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !429, file: !73, line: 341, baseType: !443, size: 32, offset: 105600)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !429, file: !73, line: 344, baseType: !438, size: 64, offset: 105664)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !429, file: !73, line: 347, baseType: !626, size: 64, offset: 105728)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !627, line: 7, baseType: !628)
!627 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !398, line: 160, baseType: !399)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !429, file: !73, line: 350, baseType: !630, size: 32, offset: 105792)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !429, file: !73, line: 353, baseType: !438, size: 64, offset: 105856)
!632 = !{!633, !634, !639, !640, !642, !643, !644, !648, !649, !650}
!633 = !DILocalVariable(name: "image", arg: 1, scope: !423, file: !424, line: 83, type: !427)
!634 = !DILocalVariable(name: "image_view", scope: !423, file: !424, line: 86, type: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !637, line: 50, baseType: !638)
!637 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!639 = !DILocalVariable(name: "total_ink_density", scope: !423, file: !424, line: 89, type: !412)
!640 = !DILocalVariable(name: "exception", scope: !423, file: !424, line: 92, type: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!642 = !DILocalVariable(name: "status", scope: !423, file: !424, line: 95, type: !443)
!643 = !DILocalVariable(name: "y", scope: !423, file: !424, line: 98, type: !395)
!644 = !DILocalVariable(name: "density", scope: !645, file: !424, line: 121, type: !412)
!645 = distinct !DILexicalBlock(scope: !646, file: !424, line: 119, column: 3)
!646 = distinct !DILexicalBlock(scope: !647, file: !424, line: 118, column: 3)
!647 = distinct !DILexicalBlock(scope: !423, file: !424, line: 118, column: 3)
!648 = !DILocalVariable(name: "indexes", scope: !645, file: !424, line: 124, type: !413)
!649 = !DILocalVariable(name: "p", scope: !645, file: !424, line: 127, type: !400)
!650 = !DILocalVariable(name: "x", scope: !645, file: !424, line: 130, type: !395)
!651 = !DILocation(line: 0, scope: !423)
!652 = !DILocation(line: 101, column: 14, scope: !653)
!653 = distinct !DILexicalBlock(scope: !423, file: !424, line: 101, column: 7)
!654 = !{!655, !656, i64 12976}
!655 = !{!"_Image", !656, i64 0, !656, i64 4, !656, i64 8, !658, i64 16, !656, i64 24, !656, i64 28, !656, i64 32, !658, i64 40, !658, i64 48, !658, i64 56, !658, i64 64, !659, i64 72, !660, i64 80, !660, i64 88, !660, i64 96, !662, i64 104, !663, i64 112, !656, i64 208, !659, i64 216, !656, i64 224, !659, i64 232, !659, i64 240, !659, i64 248, !658, i64 256, !662, i64 264, !662, i64 272, !665, i64 280, !665, i64 312, !665, i64 344, !662, i64 376, !662, i64 384, !662, i64 392, !656, i64 400, !656, i64 404, !656, i64 408, !656, i64 412, !656, i64 416, !656, i64 420, !659, i64 424, !658, i64 432, !658, i64 440, !658, i64 448, !658, i64 456, !658, i64 464, !658, i64 472, !666, i64 480, !667, i64 504, !659, i64 568, !659, i64 576, !659, i64 584, !659, i64 592, !659, i64 600, !659, i64 608, !656, i64 616, !656, i64 4712, !656, i64 8808, !658, i64 12904, !658, i64 12912, !669, i64 12920, !656, i64 12976, !658, i64 12984, !659, i64 12992, !671, i64 13000, !671, i64 13032, !659, i64 13064, !658, i64 13072, !658, i64 13080, !659, i64 13088, !659, i64 13096, !659, i64 13104, !656, i64 13112, !656, i64 13116, !660, i64 13120, !659, i64 13128, !665, i64 13136, !659, i64 13168, !659, i64 13176, !656, i64 13184, !656, i64 13188, !672, i64 13192, !656, i64 13200, !658, i64 13208, !658, i64 13216, !656, i64 13224, !658, i64 13232}
!656 = !{!"omnipotent char", !657, i64 0}
!657 = !{!"Simple C/C++ TBAA"}
!658 = !{!"long", !656, i64 0}
!659 = !{!"any pointer", !656, i64 0}
!660 = !{!"_PixelPacket", !661, i64 0, !661, i64 2, !661, i64 4, !661, i64 6}
!661 = !{!"short", !656, i64 0}
!662 = !{!"double", !656, i64 0}
!663 = !{!"_ChromaticityInfo", !664, i64 0, !664, i64 24, !664, i64 48, !664, i64 72}
!664 = !{!"_PrimaryInfo", !662, i64 0, !662, i64 8, !662, i64 16}
!665 = !{!"_RectangleInfo", !658, i64 0, !658, i64 8, !658, i64 16, !658, i64 24}
!666 = !{!"_ErrorInfo", !662, i64 0, !662, i64 8, !662, i64 16}
