; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/profile.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/profile.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "format_bytes", scope: !2, file: !3, line: 1723, type: !685, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "SyncExifProfile", scope: !3, file: !3, line: 1686, type: !4, scopeLine: 1687, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !647)
!3 = !DIFile(filename: "apps/538.imagick_r/src/magick/profile.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fb24c617afe63046ef3ae64fe59efd91")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13, !593}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !7, line: 215, baseType: !8)
!7 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 211, baseType: !9, size: 32, elements: !10)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "MagickFalse", value: 0)
!12 = !DIEnumerator(name: "MagickTrue", value: 1)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !7, line: 221, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !16, line: 150, size: 105920, elements: !17)
!16 = !DIFile(filename: "apps/538.imagick_r/src/magick/image.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9408eec9abffe54016aa20ae735786b")
!17 = !{!18, !25, !64, !91, !95, !108, !109, !110, !111, !112, !113, !114, !126, !127, !128, !129, !131, !145, !155, !157, !164, !167, !168, !169, !175, !176, !177, !186, !187, !188, !189, !190, !191, !228, !240, !248, !264, !337, !347, !349, !350, !351, !352, !353, !354, !355, !363, !384, !398, !399, !400, !401, !405, !409, !413, !414, !415, !416, !417, !508, !509, !511, !512, !522, !523, !525, !526, !527, !528, !529, !530, !548, !549, !550, !551, !552, !553, !554, !570, !571, !572, !573, !574, !578, !592}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !15, file: !16, line: 153, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !7, line: 209, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 204, baseType: !9, size: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIEnumerator(name: "UndefinedClass", value: 0)
!23 = !DIEnumerator(name: "DirectClass", value: 1)
!24 = !DIEnumerator(name: "PseudoClass", value: 2)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !15, file: !16, line: 156, baseType: !26, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !27, line: 61, baseType: !28)
!27 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4f032944b177fc61244445fe3a234334")
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 25, baseType: !9, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!30 = !DIEnumerator(name: "UndefinedColorspace", value: 0)
!31 = !DIEnumerator(name: "RGBColorspace", value: 1)
!32 = !DIEnumerator(name: "GRAYColorspace", value: 2)
!33 = !DIEnumerator(name: "TransparentColorspace", value: 3)
!34 = !DIEnumerator(name: "OHTAColorspace", value: 4)
!35 = !DIEnumerator(name: "LabColorspace", value: 5)
!36 = !DIEnumerator(name: "XYZColorspace", value: 6)
!37 = !DIEnumerator(name: "YCbCrColorspace", value: 7)
!38 = !DIEnumerator(name: "YCCColorspace", value: 8)
!39 = !DIEnumerator(name: "YIQColorspace", value: 9)
!40 = !DIEnumerator(name: "YPbPrColorspace", value: 10)
!41 = !DIEnumerator(name: "YUVColorspace", value: 11)
!42 = !DIEnumerator(name: "CMYKColorspace", value: 12)
!43 = !DIEnumerator(name: "sRGBColorspace", value: 13)
!44 = !DIEnumerator(name: "HSBColorspace", value: 14)
!45 = !DIEnumerator(name: "HSLColorspace", value: 15)
!46 = !DIEnumerator(name: "HWBColorspace", value: 16)
!47 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17)
!48 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18)
!49 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19)
!50 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20)
!51 = !DIEnumerator(name: "LogColorspace", value: 21)
!52 = !DIEnumerator(name: "CMYColorspace", value: 22)
!53 = !DIEnumerator(name: "LuvColorspace", value: 23)
!54 = !DIEnumerator(name: "HCLColorspace", value: 24)
!55 = !DIEnumerator(name: "LCHColorspace", value: 25)
!56 = !DIEnumerator(name: "LMSColorspace", value: 26)
!57 = !DIEnumerator(name: "LCHabColorspace", value: 27)
!58 = !DIEnumerator(name: "LCHuvColorspace", value: 28)
!59 = !DIEnumerator(name: "scRGBColorspace", value: 29)
!60 = !DIEnumerator(name: "HSIColorspace", value: 30)
!61 = !DIEnumerator(name: "HSVColorspace", value: 31)
!62 = !DIEnumerator(name: "HCLpColorspace", value: 32)
!63 = !DIEnumerator(name: "YDbDrColorspace", value: 33)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !15, file: !16, line: 159, baseType: !65, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !66, line: 49, baseType: !67)
!66 = !DIFile(filename: "apps/538.imagick_r/src/magick/compress.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "359677d10ff2e6d05d86b0a6c5af7465")
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 25, baseType: !9, size: 32, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!69 = !DIEnumerator(name: "UndefinedCompression", value: 0)
!70 = !DIEnumerator(name: "NoCompression", value: 1)
!71 = !DIEnumerator(name: "BZipCompression", value: 2)
!72 = !DIEnumerator(name: "DXT1Compression", value: 3)
!73 = !DIEnumerator(name: "DXT3Compression", value: 4)
!74 = !DIEnumerator(name: "DXT5Compression", value: 5)
!75 = !DIEnumerator(name: "FaxCompression", value: 6)
!76 = !DIEnumerator(name: "Group4Compression", value: 7)
!77 = !DIEnumerator(name: "JPEGCompression", value: 8)
!78 = !DIEnumerator(name: "JPEG2000Compression", value: 9)
!79 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10)
!80 = !DIEnumerator(name: "LZWCompression", value: 11)
!81 = !DIEnumerator(name: "RLECompression", value: 12)
!82 = !DIEnumerator(name: "ZipCompression", value: 13)
!83 = !DIEnumerator(name: "ZipSCompression", value: 14)
!84 = !DIEnumerator(name: "PizCompression", value: 15)
!85 = !DIEnumerator(name: "Pxr24Compression", value: 16)
!86 = !DIEnumerator(name: "B44Compression", value: 17)
!87 = !DIEnumerator(name: "B44ACompression", value: 18)
!88 = !DIEnumerator(name: "LZMACompression", value: 19)
!89 = !DIEnumerator(name: "JBIG1Compression", value: 20)
!90 = !DIEnumerator(name: "JBIG2Compression", value: 21)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !15, file: !16, line: 162, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 46, baseType: !94)
!93 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!94 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !15, file: !16, line: 165, baseType: !96, size: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !16, line: 86, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 75, baseType: !9, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107}
!99 = !DIEnumerator(name: "UndefinedOrientation", value: 0)
!100 = !DIEnumerator(name: "TopLeftOrientation", value: 1)
!101 = !DIEnumerator(name: "TopRightOrientation", value: 2)
!102 = !DIEnumerator(name: "BottomRightOrientation", value: 3)
!103 = !DIEnumerator(name: "BottomLeftOrientation", value: 4)
!104 = !DIEnumerator(name: "LeftTopOrientation", value: 5)
!105 = !DIEnumerator(name: "RightTopOrientation", value: 6)
!106 = !DIEnumerator(name: "RightBottomOrientation", value: 7)
!107 = !DIEnumerator(name: "LeftBottomOrientation", value: 8)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !15, file: !16, line: 168, baseType: !6, size: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !15, file: !16, line: 169, baseType: !6, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !15, file: !16, line: 172, baseType: !92, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !15, file: !16, line: 173, baseType: !92, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !15, file: !16, line: 174, baseType: !92, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !15, file: !16, line: 175, baseType: !92, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !15, file: !16, line: 178, baseType: !115, size: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !117, line: 148, baseType: !118)
!117 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !117, line: 131, size: 64, elements: !119)
!119 = !{!120, !123, !124, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !118, file: !117, line: 143, baseType: !121, size: 16)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !7, line: 93, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !118, file: !117, line: 144, baseType: !121, size: 16, offset: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !118, file: !117, line: 145, baseType: !121, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !118, file: !117, line: 146, baseType: !121, size: 16, offset: 48)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !15, file: !16, line: 179, baseType: !116, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !15, file: !16, line: 180, baseType: !116, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !15, file: !16, line: 181, baseType: !116, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !15, file: !16, line: 184, baseType: !130, size: 64, offset: 832)
!130 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !15, file: !16, line: 187, baseType: !132, size: 768, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !16, line: 128, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !16, line: 121, size: 768, elements: !134)
!134 = !{!135, !142, !143, !144}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !133, file: !16, line: 124, baseType: !136, size: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !16, line: 101, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !16, line: 95, size: 192, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !137, file: !16, line: 98, baseType: !130, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !137, file: !16, line: 99, baseType: !130, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !137, file: !16, line: 100, baseType: !130, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !133, file: !16, line: 125, baseType: !136, size: 192, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !133, file: !16, line: 126, baseType: !136, size: 192, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !133, file: !16, line: 127, baseType: !136, size: 192, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !15, file: !16, line: 190, baseType: !146, size: 32, offset: 1664)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !147, line: 49, baseType: !148)
!147 = !DIFile(filename: "apps/538.imagick_r/src/magick/profile.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fb61c1ae348c42a2b68ac081d4b39ee3")
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 42, baseType: !9, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153, !154}
!150 = !DIEnumerator(name: "UndefinedIntent", value: 0)
!151 = !DIEnumerator(name: "SaturationIntent", value: 1)
!152 = !DIEnumerator(name: "PerceptualIntent", value: 2)
!153 = !DIEnumerator(name: "AbsoluteIntent", value: 3)
!154 = !DIEnumerator(name: "RelativeIntent", value: 4)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !15, file: !16, line: 193, baseType: !156, size: 64, offset: 1728)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !15, file: !16, line: 196, baseType: !158, size: 32, offset: 1792)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !16, line: 93, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 88, baseType: !9, size: 32, elements: !160)
!160 = !{!161, !162, !163}
!161 = !DIEnumerator(name: "UndefinedResolution", value: 0)
!162 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1)
!163 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !15, file: !16, line: 199, baseType: !165, size: 64, offset: 1856)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !15, file: !16, line: 200, baseType: !165, size: 64, offset: 1920)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !15, file: !16, line: 201, baseType: !165, size: 64, offset: 1984)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !15, file: !16, line: 204, baseType: !170, size: 64, offset: 2048)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !171, line: 77, baseType: !172)
!171 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !173, line: 193, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!174 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !15, file: !16, line: 207, baseType: !130, size: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !15, file: !16, line: 208, baseType: !130, size: 64, offset: 2176)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !15, file: !16, line: 211, baseType: !178, size: 256, offset: 2240)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !179, line: 130, baseType: !180)
!179 = !DIFile(filename: "apps/538.imagick_r/src/magick/geometry.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "889bed117eb2a2fce6e2622bd130bcd2")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !179, line: 121, size: 256, elements: !181)
!181 = !{!182, !183, !184, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !180, file: !179, line: 124, baseType: !92, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !180, file: !179, line: 125, baseType: !92, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !180, file: !179, line: 128, baseType: !170, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !180, file: !179, line: 129, baseType: !170, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !15, file: !16, line: 212, baseType: !178, size: 256, offset: 2496)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !15, file: !16, line: 213, baseType: !178, size: 256, offset: 2752)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !15, file: !16, line: 216, baseType: !130, size: 64, offset: 3008)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !15, file: !16, line: 217, baseType: !130, size: 64, offset: 3072)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !15, file: !16, line: 218, baseType: !130, size: 64, offset: 3136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !15, file: !16, line: 221, baseType: !192, size: 32, offset: 3200)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !193, line: 66, baseType: !194)
!193 = !DIFile(filename: "apps/538.imagick_r/src/magick/resample.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "722fed6aaf07c122ede72839e4dadc42")
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 32, baseType: !9, size: 32, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!196 = !DIEnumerator(name: "UndefinedFilter", value: 0)
!197 = !DIEnumerator(name: "PointFilter", value: 1)
!198 = !DIEnumerator(name: "BoxFilter", value: 2)
!199 = !DIEnumerator(name: "TriangleFilter", value: 3)
!200 = !DIEnumerator(name: "HermiteFilter", value: 4)
!201 = !DIEnumerator(name: "HanningFilter", value: 5)
!202 = !DIEnumerator(name: "HammingFilter", value: 6)
!203 = !DIEnumerator(name: "BlackmanFilter", value: 7)
!204 = !DIEnumerator(name: "GaussianFilter", value: 8)
!205 = !DIEnumerator(name: "QuadraticFilter", value: 9)
!206 = !DIEnumerator(name: "CubicFilter", value: 10)
!207 = !DIEnumerator(name: "CatromFilter", value: 11)
!208 = !DIEnumerator(name: "MitchellFilter", value: 12)
!209 = !DIEnumerator(name: "JincFilter", value: 13)
!210 = !DIEnumerator(name: "SincFilter", value: 14)
!211 = !DIEnumerator(name: "SincFastFilter", value: 15)
!212 = !DIEnumerator(name: "KaiserFilter", value: 16)
!213 = !DIEnumerator(name: "WelshFilter", value: 17)
!214 = !DIEnumerator(name: "ParzenFilter", value: 18)
!215 = !DIEnumerator(name: "BohmanFilter", value: 19)
!216 = !DIEnumerator(name: "BartlettFilter", value: 20)
!217 = !DIEnumerator(name: "LagrangeFilter", value: 21)
!218 = !DIEnumerator(name: "LanczosFilter", value: 22)
!219 = !DIEnumerator(name: "LanczosSharpFilter", value: 23)
!220 = !DIEnumerator(name: "Lanczos2Filter", value: 24)
!221 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25)
!222 = !DIEnumerator(name: "RobidouxFilter", value: 26)
!223 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27)
!224 = !DIEnumerator(name: "CosineFilter", value: 28)
!225 = !DIEnumerator(name: "SplineFilter", value: 29)
!226 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30)
!227 = !DIEnumerator(name: "SentinelFilter", value: 31)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !15, file: !16, line: 224, baseType: !229, size: 32, offset: 3232)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !16, line: 73, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 63, baseType: !9, size: 32, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239}
!232 = !DIEnumerator(name: "UndefinedInterlace", value: 0)
!233 = !DIEnumerator(name: "NoInterlace", value: 1)
!234 = !DIEnumerator(name: "LineInterlace", value: 2)
!235 = !DIEnumerator(name: "PlaneInterlace", value: 3)
!236 = !DIEnumerator(name: "PartitionInterlace", value: 4)
!237 = !DIEnumerator(name: "GIFInterlace", value: 5)
!238 = !DIEnumerator(name: "JPEGInterlace", value: 6)
!239 = !DIEnumerator(name: "PNGInterlace", value: 7)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !15, file: !16, line: 227, baseType: !241, size: 32, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !242, line: 35, baseType: !243)
!242 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1f6eaed79d9a4eaf712cd066f6ff022a")
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !242, line: 30, baseType: !9, size: 32, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIEnumerator(name: "UndefinedEndian", value: 0)
!246 = !DIEnumerator(name: "LSBEndian", value: 1)
!247 = !DIEnumerator(name: "MSBEndian", value: 2)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !15, file: !16, line: 230, baseType: !249, size: 32, offset: 3296)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !179, line: 91, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !179, line: 77, baseType: !9, size: 32, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!252 = !DIEnumerator(name: "UndefinedGravity", value: 0)
!253 = !DIEnumerator(name: "ForgetGravity", value: 0)
!254 = !DIEnumerator(name: "NorthWestGravity", value: 1)
!255 = !DIEnumerator(name: "NorthGravity", value: 2)
!256 = !DIEnumerator(name: "NorthEastGravity", value: 3)
!257 = !DIEnumerator(name: "WestGravity", value: 4)
!258 = !DIEnumerator(name: "CenterGravity", value: 5)
!259 = !DIEnumerator(name: "EastGravity", value: 6)
!260 = !DIEnumerator(name: "SouthWestGravity", value: 7)
!261 = !DIEnumerator(name: "SouthGravity", value: 8)
!262 = !DIEnumerator(name: "SouthEastGravity", value: 9)
!263 = !DIEnumerator(name: "StaticGravity", value: 10)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !15, file: !16, line: 233, baseType: !265, size: 32, offset: 3328)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !266, line: 99, baseType: !267)
!266 = !DIFile(filename: "apps/538.imagick_r/src/magick/composite.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "837959ddb1dc628f80f1f9b5cdda1fb4")
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !266, line: 25, baseType: !9, size: 32, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!269 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0)
!270 = !DIEnumerator(name: "NoCompositeOp", value: 1)
!271 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2)
!272 = !DIEnumerator(name: "AtopCompositeOp", value: 3)
!273 = !DIEnumerator(name: "BlendCompositeOp", value: 4)
!274 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5)
!275 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6)
!276 = !DIEnumerator(name: "ClearCompositeOp", value: 7)
!277 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8)
!278 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9)
!279 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10)
!280 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11)
!281 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12)
!282 = !DIEnumerator(name: "CopyCompositeOp", value: 13)
!283 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14)
!284 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15)
!285 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16)
!286 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17)
!287 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18)
!288 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19)
!289 = !DIEnumerator(name: "DarkenCompositeOp", value: 20)
!290 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21)
!291 = !DIEnumerator(name: "DstCompositeOp", value: 22)
!292 = !DIEnumerator(name: "DstInCompositeOp", value: 23)
!293 = !DIEnumerator(name: "DstOutCompositeOp", value: 24)
!294 = !DIEnumerator(name: "DstOverCompositeOp", value: 25)
!295 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26)
!296 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27)
!297 = !DIEnumerator(name: "DissolveCompositeOp", value: 28)
!298 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29)
!299 = !DIEnumerator(name: "HardLightCompositeOp", value: 30)
!300 = !DIEnumerator(name: "HueCompositeOp", value: 31)
!301 = !DIEnumerator(name: "InCompositeOp", value: 32)
!302 = !DIEnumerator(name: "LightenCompositeOp", value: 33)
!303 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34)
!304 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35)
!305 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36)
!306 = !DIEnumerator(name: "ModulateCompositeOp", value: 37)
!307 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38)
!308 = !DIEnumerator(name: "OutCompositeOp", value: 39)
!309 = !DIEnumerator(name: "OverCompositeOp", value: 40)
!310 = !DIEnumerator(name: "OverlayCompositeOp", value: 41)
!311 = !DIEnumerator(name: "PlusCompositeOp", value: 42)
!312 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43)
!313 = !DIEnumerator(name: "SaturateCompositeOp", value: 44)
!314 = !DIEnumerator(name: "ScreenCompositeOp", value: 45)
!315 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46)
!316 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47)
!317 = !DIEnumerator(name: "SrcCompositeOp", value: 48)
!318 = !DIEnumerator(name: "SrcInCompositeOp", value: 49)
!319 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50)
!320 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51)
!321 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52)
!322 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53)
!323 = !DIEnumerator(name: "XorCompositeOp", value: 54)
!324 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55)
!325 = !DIEnumerator(name: "DistortCompositeOp", value: 56)
!326 = !DIEnumerator(name: "BlurCompositeOp", value: 57)
!327 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58)
!328 = !DIEnumerator(name: "VividLightCompositeOp", value: 59)
!329 = !DIEnumerator(name: "PinLightCompositeOp", value: 60)
!330 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61)
!331 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62)
!332 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63)
!333 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64)
!334 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65)
!335 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66)
!336 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !15, file: !16, line: 236, baseType: !338, size: 32, offset: 3360)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !339, line: 32, baseType: !340)
!339 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !339, line: 25, baseType: !9, size: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346}
!342 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!343 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!344 = !DIEnumerator(name: "NoneDispose", value: 1)
!345 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!346 = !DIEnumerator(name: "PreviousDispose", value: 3)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !15, file: !16, line: 239, baseType: !348, size: 64, offset: 3392)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !15, file: !16, line: 242, baseType: !92, size: 64, offset: 3456)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !15, file: !16, line: 243, baseType: !92, size: 64, offset: 3520)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !15, file: !16, line: 246, baseType: !170, size: 64, offset: 3584)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !15, file: !16, line: 249, baseType: !92, size: 64, offset: 3648)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !15, file: !16, line: 250, baseType: !92, size: 64, offset: 3712)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !15, file: !16, line: 253, baseType: !170, size: 64, offset: 3776)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !15, file: !16, line: 256, baseType: !356, size: 192, offset: 3840)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !357, line: 68, baseType: !358)
!357 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !357, line: 62, size: 192, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !358, file: !357, line: 65, baseType: !130, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !358, file: !357, line: 66, baseType: !130, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !358, file: !357, line: 67, baseType: !130, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !15, file: !16, line: 259, baseType: !364, size: 512, offset: 4032)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !365, line: 51, baseType: !366)
!365 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !365, line: 40, size: 512, elements: !367)
!367 = !{!368, !375, !376, !383}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !366, file: !365, line: 43, baseType: !369, size: 192)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !365, line: 38, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !365, line: 32, size: 192, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !370, file: !365, line: 35, baseType: !130, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !370, file: !365, line: 36, baseType: !130, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !370, file: !365, line: 37, baseType: !130, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !366, file: !365, line: 44, baseType: !369, size: 192, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !366, file: !365, line: 47, baseType: !377, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !365, line: 30, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 25, baseType: !9, size: 32, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!381 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!382 = !DIEnumerator(name: "RunningTimerState", value: 2)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !366, file: !365, line: 50, baseType: !92, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !15, file: !16, line: 262, baseType: !385, size: 64, offset: 4544)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !386, line: 26, baseType: !387)
!386 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!6, !390, !392, !395, !156}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !7, line: 150, baseType: !394)
!394 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !7, line: 151, baseType: !397)
!397 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !15, file: !16, line: 265, baseType: !156, size: 64, offset: 4608)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !15, file: !16, line: 266, baseType: !156, size: 64, offset: 4672)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !15, file: !16, line: 267, baseType: !156, size: 64, offset: 4736)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !15, file: !16, line: 270, baseType: !402, size: 64, offset: 4800)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !66, line: 52, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !66, line: 51, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !15, file: !16, line: 273, baseType: !406, size: 64, offset: 4864)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !7, line: 217, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !7, line: 217, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !15, file: !16, line: 276, baseType: !410, size: 32768, offset: 4928)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 32768, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 4096)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !15, file: !16, line: 277, baseType: !410, size: 32768, offset: 37696)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !15, file: !16, line: 278, baseType: !410, size: 32768, offset: 70464)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !15, file: !16, line: 281, baseType: !92, size: 64, offset: 103232)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !15, file: !16, line: 282, baseType: !92, size: 64, offset: 103296)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !15, file: !16, line: 285, baseType: !418, size: 448, offset: 103360)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !7, line: 219, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !420, line: 102, size: 448, elements: !421)
!420 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cd97c70c025a9cff45f4138c27a79124")
!421 = !{!422, !496, !498, !499, !500, !501, !502, !507}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !419, file: !420, line: 105, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !420, line: 100, baseType: !424)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 28, baseType: !9, size: 32, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!426 = !DIEnumerator(name: "UndefinedException", value: 0)
!427 = !DIEnumerator(name: "WarningException", value: 300)
!428 = !DIEnumerator(name: "ResourceLimitWarning", value: 300)
!429 = !DIEnumerator(name: "TypeWarning", value: 305)
!430 = !DIEnumerator(name: "OptionWarning", value: 310)
!431 = !DIEnumerator(name: "DelegateWarning", value: 315)
!432 = !DIEnumerator(name: "MissingDelegateWarning", value: 320)
!433 = !DIEnumerator(name: "CorruptImageWarning", value: 325)
!434 = !DIEnumerator(name: "FileOpenWarning", value: 330)
!435 = !DIEnumerator(name: "BlobWarning", value: 335)
!436 = !DIEnumerator(name: "StreamWarning", value: 340)
!437 = !DIEnumerator(name: "CacheWarning", value: 345)
!438 = !DIEnumerator(name: "CoderWarning", value: 350)
!439 = !DIEnumerator(name: "FilterWarning", value: 352)
!440 = !DIEnumerator(name: "ModuleWarning", value: 355)
!441 = !DIEnumerator(name: "DrawWarning", value: 360)
!442 = !DIEnumerator(name: "ImageWarning", value: 365)
!443 = !DIEnumerator(name: "WandWarning", value: 370)
!444 = !DIEnumerator(name: "RandomWarning", value: 375)
!445 = !DIEnumerator(name: "XServerWarning", value: 380)
!446 = !DIEnumerator(name: "MonitorWarning", value: 385)
!447 = !DIEnumerator(name: "RegistryWarning", value: 390)
!448 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!449 = !DIEnumerator(name: "PolicyWarning", value: 399)
!450 = !DIEnumerator(name: "ErrorException", value: 400)
!451 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!452 = !DIEnumerator(name: "TypeError", value: 405)
!453 = !DIEnumerator(name: "OptionError", value: 410)
!454 = !DIEnumerator(name: "DelegateError", value: 415)
!455 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!456 = !DIEnumerator(name: "CorruptImageError", value: 425)
!457 = !DIEnumerator(name: "FileOpenError", value: 430)
!458 = !DIEnumerator(name: "BlobError", value: 435)
!459 = !DIEnumerator(name: "StreamError", value: 440)
!460 = !DIEnumerator(name: "CacheError", value: 445)
!461 = !DIEnumerator(name: "CoderError", value: 450)
!462 = !DIEnumerator(name: "FilterError", value: 452)
!463 = !DIEnumerator(name: "ModuleError", value: 455)
!464 = !DIEnumerator(name: "DrawError", value: 460)
!465 = !DIEnumerator(name: "ImageError", value: 465)
!466 = !DIEnumerator(name: "WandError", value: 470)
!467 = !DIEnumerator(name: "RandomError", value: 475)
!468 = !DIEnumerator(name: "XServerError", value: 480)
!469 = !DIEnumerator(name: "MonitorError", value: 485)
!470 = !DIEnumerator(name: "RegistryError", value: 490)
!471 = !DIEnumerator(name: "ConfigureError", value: 495)
!472 = !DIEnumerator(name: "PolicyError", value: 499)
!473 = !DIEnumerator(name: "FatalErrorException", value: 700)
!474 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!475 = !DIEnumerator(name: "TypeFatalError", value: 705)
!476 = !DIEnumerator(name: "OptionFatalError", value: 710)
!477 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!478 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!479 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!480 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!481 = !DIEnumerator(name: "BlobFatalError", value: 735)
!482 = !DIEnumerator(name: "StreamFatalError", value: 740)
!483 = !DIEnumerator(name: "CacheFatalError", value: 745)
!484 = !DIEnumerator(name: "CoderFatalError", value: 750)
!485 = !DIEnumerator(name: "FilterFatalError", value: 752)
!486 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!487 = !DIEnumerator(name: "DrawFatalError", value: 760)
!488 = !DIEnumerator(name: "ImageFatalError", value: 765)
!489 = !DIEnumerator(name: "WandFatalError", value: 770)
!490 = !DIEnumerator(name: "RandomFatalError", value: 775)
!491 = !DIEnumerator(name: "XServerFatalError", value: 780)
!492 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!493 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!494 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!495 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !419, file: !420, line: 108, baseType: !497, size: 32, offset: 32)
!497 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !419, file: !420, line: 111, baseType: !165, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !419, file: !420, line: 112, baseType: !165, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !419, file: !420, line: 115, baseType: !156, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !419, file: !420, line: 118, baseType: !6, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !419, file: !420, line: 121, baseType: !503, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !505, line: 26, baseType: !506)
!505 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !505, line: 25, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !419, file: !420, line: 124, baseType: !92, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !15, file: !16, line: 288, baseType: !6, size: 32, offset: 103808)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !15, file: !16, line: 291, baseType: !510, size: 64, offset: 103872)
!510 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !15, file: !16, line: 294, baseType: !503, size: 64, offset: 103936)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !15, file: !16, line: 297, baseType: !513, size: 256, offset: 104000)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !147, line: 40, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !147, line: 27, size: 256, elements: !515)
!515 = !{!516, !517, !518, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !514, file: !147, line: 30, baseType: !165, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !514, file: !147, line: 33, baseType: !92, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !514, file: !147, line: 36, baseType: !519, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !514, file: !147, line: 39, baseType: !92, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !15, file: !16, line: 298, baseType: !513, size: 256, offset: 104256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !15, file: !16, line: 299, baseType: !524, size: 64, offset: 104512)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !15, file: !16, line: 302, baseType: !92, size: 64, offset: 104576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !15, file: !16, line: 305, baseType: !92, size: 64, offset: 104640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !15, file: !16, line: 308, baseType: !348, size: 64, offset: 104704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !15, file: !16, line: 309, baseType: !348, size: 64, offset: 104768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !16, line: 310, baseType: !348, size: 64, offset: 104832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !15, file: !16, line: 313, baseType: !531, size: 32, offset: 104896)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !117, line: 47, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 31, baseType: !9, size: 32, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!534 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!535 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!536 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!537 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!538 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!539 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!540 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!541 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!542 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!543 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!544 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!545 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!546 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!547 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !15, file: !16, line: 316, baseType: !6, size: 32, offset: 104928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !15, file: !16, line: 319, baseType: !116, size: 64, offset: 104960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !15, file: !16, line: 322, baseType: !348, size: 64, offset: 105024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !15, file: !16, line: 325, baseType: !178, size: 256, offset: 105088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !15, file: !16, line: 328, baseType: !156, size: 64, offset: 105344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !15, file: !16, line: 329, baseType: !156, size: 64, offset: 105408)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !16, line: 332, baseType: !555, size: 32, offset: 105472)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !16, line: 61, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 47, baseType: !9, size: 32, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!558 = !DIEnumerator(name: "UndefinedType", value: 0)
!559 = !DIEnumerator(name: "BilevelType", value: 1)
!560 = !DIEnumerator(name: "GrayscaleType", value: 2)
!561 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!562 = !DIEnumerator(name: "PaletteType", value: 4)
!563 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!564 = !DIEnumerator(name: "TrueColorType", value: 6)
!565 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!566 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!567 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!568 = !DIEnumerator(name: "OptimizeType", value: 10)
!569 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !15, file: !16, line: 335, baseType: !6, size: 32, offset: 105504)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !15, file: !16, line: 338, baseType: !396, size: 64, offset: 105536)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !15, file: !16, line: 341, baseType: !6, size: 32, offset: 105600)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !15, file: !16, line: 344, baseType: !92, size: 64, offset: 105664)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !15, file: !16, line: 347, baseType: !575, size: 64, offset: 105728)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !576, line: 7, baseType: !577)
!576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !173, line: 160, baseType: !174)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !15, file: !16, line: 350, baseType: !579, size: 32, offset: 105792)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !117, line: 79, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 67, baseType: !9, size: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!582 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!583 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!584 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!585 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!586 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!587 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!588 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!589 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!590 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!591 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !15, file: !16, line: 353, baseType: !92, size: 64, offset: 105856)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !595, line: 40, baseType: !596)
!595 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !595, line: 29, size: 32960, elements: !597)
!597 = !{!598, !599, !600, !601}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !596, file: !595, line: 32, baseType: !410, size: 32768)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !596, file: !595, line: 35, baseType: !519, size: 64, offset: 32768)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !596, file: !595, line: 38, baseType: !92, size: 64, offset: 32832)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !596, file: !595, line: 39, baseType: !92, size: 64, offset: 32896)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !604, retainedTypes: !630, globals: !646, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/profile.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r", checksumkind: CSK_MD5, checksum: "fb24c617afe63046ef3ae64fe59efd91")
!604 = !{!8, !20, !28, !67, !97, !148, !159, !194, !230, !243, !250, !267, !340, !378, !424, !532, !556, !580, !605}
!605 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !606, line: 34, baseType: !9, size: 32, elements: !607)
!606 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!608 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!609 = !DIEnumerator(name: "NoEvents", value: 0)
!610 = !DIEnumerator(name: "TraceEvent", value: 1)
!611 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!612 = !DIEnumerator(name: "BlobEvent", value: 4)
!613 = !DIEnumerator(name: "CacheEvent", value: 8)
!614 = !DIEnumerator(name: "CoderEvent", value: 16)
!615 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!616 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!617 = !DIEnumerator(name: "DrawEvent", value: 128)
!618 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!619 = !DIEnumerator(name: "ImageEvent", value: 512)
!620 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!621 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!622 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!623 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!624 = !DIEnumerator(name: "TransformEvent", value: 16384)
!625 = !DIEnumerator(name: "UserEvent", value: 36864)
!626 = !DIEnumerator(name: "WandEvent", value: 65536)
!627 = !DIEnumerator(name: "X11Event", value: 131072)
!628 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!629 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!630 = !{!94, !156, !631, !635, !519, !593, !638, !165, !640, !642, !390, !170, !92, !122, !520, !130, !158, !9, !497, !643}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !633, line: 26, baseType: !634)
!633 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !633, line: 25, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!156, !156}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!497, !640, !640}
!646 = !{!0}
!647 = !{!648, !649, !650, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !674, !675, !676, !677, !678, !679, !682}
!648 = !DILocalVariable(name: "image", arg: 1, scope: !2, file: !3, line: 1686, type: !13)
!649 = !DILocalVariable(name: "profile", arg: 2, scope: !2, file: !3, line: 1686, type: !593)
!650 = !DILocalVariable(name: "directory_stack", scope: !2, file: !3, line: 1704, type: !651)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 2048, elements: !657)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectoryInfo", scope: !2, file: !3, line: 1701, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DirectoryInfo", scope: !2, file: !3, line: 1694, size: 128, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !653, file: !3, line: 1697, baseType: !519, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !653, file: !3, line: 1700, baseType: !92, size: 64, offset: 64)
!657 = !{!658}
!658 = !DISubrange(count: 16)
!659 = !DILocalVariable(name: "endian", scope: !2, file: !3, line: 1707, type: !241)
!660 = !DILocalVariable(name: "entry", scope: !2, file: !3, line: 1710, type: !92)
!661 = !DILocalVariable(name: "length", scope: !2, file: !3, line: 1711, type: !92)
!662 = !DILocalVariable(name: "number_entries", scope: !2, file: !3, line: 1712, type: !92)
!663 = !DILocalVariable(name: "exif_resources", scope: !2, file: !3, line: 1715, type: !631)
!664 = !DILocalVariable(name: "id", scope: !2, file: !3, line: 1718, type: !170)
!665 = !DILocalVariable(name: "level", scope: !2, file: !3, line: 1719, type: !170)
!666 = !DILocalVariable(name: "offset", scope: !2, file: !3, line: 1720, type: !170)
!667 = !DILocalVariable(name: "directory", scope: !2, file: !3, line: 1726, type: !519)
!668 = !DILocalVariable(name: "exif", scope: !2, file: !3, line: 1727, type: !519)
!669 = !DILocalVariable(name: "p", scope: !670, file: !3, line: 1795, type: !519)
!670 = distinct !DILexicalBlock(scope: !671, file: !3, line: 1793, column: 5)
!671 = distinct !DILexicalBlock(scope: !672, file: !3, line: 1792, column: 5)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 1792, column: 5)
!673 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1781, column: 3)
!674 = !DILocalVariable(name: "q", scope: !670, file: !3, line: 1796, type: !519)
!675 = !DILocalVariable(name: "number_bytes", scope: !670, file: !3, line: 1799, type: !92)
!676 = !DILocalVariable(name: "components", scope: !670, file: !3, line: 1802, type: !170)
!677 = !DILocalVariable(name: "format", scope: !670, file: !3, line: 1803, type: !170)
!678 = !DILocalVariable(name: "tag_value", scope: !670, file: !3, line: 1804, type: !170)
!679 = !DILocalVariable(name: "offset", scope: !680, file: !3, line: 1823, type: !170)
!680 = distinct !DILexicalBlock(scope: !681, file: !3, line: 1821, column: 9)
!681 = distinct !DILexicalBlock(scope: !670, file: !3, line: 1818, column: 11)
!682 = !DILocalVariable(name: "offset", scope: !683, file: !3, line: 1876, type: !170)
!683 = distinct !DILexicalBlock(scope: !684, file: !3, line: 1874, column: 9)
!684 = distinct !DILexicalBlock(scope: !670, file: !3, line: 1873, column: 11)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 416, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 13)
!688 = !{i32 7, !"Dwarf Version", i32 5}
!689 = !{i32 2, !"Debug Info Version", i32 3}
!690 = !{i32 1, !"wchar_size", i32 4}
!691 = !{i32 7, !"PIC Level", i32 2}
!692 = !{i32 7, !"PIE Level", i32 2}
!693 = !{i32 7, !"uwtable", i32 2}
!694 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!695 = distinct !DISubprogram(name: "CloneImageProfiles", scope: !3, file: !3, line: 137, type: !696, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !700)
!696 = !DISubroutineType(types: !697)
!697 = !{!6, !13, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!700 = !{!701, !702}
!701 = !DILocalVariable(name: "image", arg: 1, scope: !695, file: !3, line: 137, type: !13)
!702 = !DILocalVariable(name: "clone_image", arg: 2, scope: !695, file: !3, line: 138, type: !698)
!703 = !DILocation(line: 0, scope: !695)
!704 = !DILocation(line: 142, column: 14, scope: !705)
!705 = distinct !DILexicalBlock(scope: !695, file: !3, line: 142, column: 7)
!706 = !{!707, !708, i64 12976}
