; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/property.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/property.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._TagInfo = type { i64, ptr }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EXIFTag", scope: !2, file: !3, line: 823, type: !1127, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "GetEXIFProperty", scope: !3, file: !3, line: 727, type: !4, scopeLine: 729, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !594, retainedNodes: !1004)
!3 = !DIFile(filename: "apps/538.imagick_r/src/magick/property.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c4d5c6b80accd955e9107d1bed794ccc")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13, !391}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !7, line: 215, baseType: !8)
!7 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 211, baseType: !9, size: 32, elements: !10)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "MagickFalse", value: 0)
!12 = !DIEnumerator(name: "MagickTrue", value: 1)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !7, line: 221, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !17, line: 150, size: 105920, elements: !18)
!17 = !DIFile(filename: "apps/538.imagick_r/src/magick/image.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9408eec9abffe54016aa20ae735786b")
!18 = !{!19, !26, !65, !92, !96, !109, !110, !111, !112, !113, !114, !115, !127, !128, !129, !130, !132, !146, !156, !158, !165, !168, !169, !170, !176, !177, !178, !187, !188, !189, !190, !191, !192, !229, !241, !249, !265, !338, !348, !350, !351, !352, !353, !354, !355, !356, !364, !385, !399, !400, !401, !402, !406, !410, !414, !415, !416, !417, !418, !509, !510, !512, !513, !523, !524, !526, !527, !528, !529, !530, !531, !549, !550, !551, !552, !553, !554, !555, !571, !572, !573, !574, !575, !579, !593}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !16, file: !17, line: 153, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !7, line: 209, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 204, baseType: !9, size: 32, elements: !22)
!22 = !{!23, !24, !25}
!23 = !DIEnumerator(name: "UndefinedClass", value: 0)
!24 = !DIEnumerator(name: "DirectClass", value: 1)
!25 = !DIEnumerator(name: "PseudoClass", value: 2)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !16, file: !17, line: 156, baseType: !27, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !28, line: 61, baseType: !29)
!28 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4f032944b177fc61244445fe3a234334")
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 25, baseType: !9, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!31 = !DIEnumerator(name: "UndefinedColorspace", value: 0)
!32 = !DIEnumerator(name: "RGBColorspace", value: 1)
!33 = !DIEnumerator(name: "GRAYColorspace", value: 2)
!34 = !DIEnumerator(name: "TransparentColorspace", value: 3)
!35 = !DIEnumerator(name: "OHTAColorspace", value: 4)
!36 = !DIEnumerator(name: "LabColorspace", value: 5)
!37 = !DIEnumerator(name: "XYZColorspace", value: 6)
!38 = !DIEnumerator(name: "YCbCrColorspace", value: 7)
!39 = !DIEnumerator(name: "YCCColorspace", value: 8)
!40 = !DIEnumerator(name: "YIQColorspace", value: 9)
!41 = !DIEnumerator(name: "YPbPrColorspace", value: 10)
!42 = !DIEnumerator(name: "YUVColorspace", value: 11)
!43 = !DIEnumerator(name: "CMYKColorspace", value: 12)
!44 = !DIEnumerator(name: "sRGBColorspace", value: 13)
!45 = !DIEnumerator(name: "HSBColorspace", value: 14)
!46 = !DIEnumerator(name: "HSLColorspace", value: 15)
!47 = !DIEnumerator(name: "HWBColorspace", value: 16)
!48 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17)
!49 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18)
!50 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19)
!51 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20)
!52 = !DIEnumerator(name: "LogColorspace", value: 21)
!53 = !DIEnumerator(name: "CMYColorspace", value: 22)
!54 = !DIEnumerator(name: "LuvColorspace", value: 23)
!55 = !DIEnumerator(name: "HCLColorspace", value: 24)
!56 = !DIEnumerator(name: "LCHColorspace", value: 25)
!57 = !DIEnumerator(name: "LMSColorspace", value: 26)
!58 = !DIEnumerator(name: "LCHabColorspace", value: 27)
!59 = !DIEnumerator(name: "LCHuvColorspace", value: 28)
!60 = !DIEnumerator(name: "scRGBColorspace", value: 29)
!61 = !DIEnumerator(name: "HSIColorspace", value: 30)
!62 = !DIEnumerator(name: "HSVColorspace", value: 31)
!63 = !DIEnumerator(name: "HCLpColorspace", value: 32)
!64 = !DIEnumerator(name: "YDbDrColorspace", value: 33)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !16, file: !17, line: 159, baseType: !66, size: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !67, line: 49, baseType: !68)
!67 = !DIFile(filename: "apps/538.imagick_r/src/magick/compress.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "359677d10ff2e6d05d86b0a6c5af7465")
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 25, baseType: !9, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!70 = !DIEnumerator(name: "UndefinedCompression", value: 0)
!71 = !DIEnumerator(name: "NoCompression", value: 1)
!72 = !DIEnumerator(name: "BZipCompression", value: 2)
!73 = !DIEnumerator(name: "DXT1Compression", value: 3)
!74 = !DIEnumerator(name: "DXT3Compression", value: 4)
!75 = !DIEnumerator(name: "DXT5Compression", value: 5)
!76 = !DIEnumerator(name: "FaxCompression", value: 6)
!77 = !DIEnumerator(name: "Group4Compression", value: 7)
!78 = !DIEnumerator(name: "JPEGCompression", value: 8)
!79 = !DIEnumerator(name: "JPEG2000Compression", value: 9)
!80 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10)
!81 = !DIEnumerator(name: "LZWCompression", value: 11)
!82 = !DIEnumerator(name: "RLECompression", value: 12)
!83 = !DIEnumerator(name: "ZipCompression", value: 13)
!84 = !DIEnumerator(name: "ZipSCompression", value: 14)
!85 = !DIEnumerator(name: "PizCompression", value: 15)
!86 = !DIEnumerator(name: "Pxr24Compression", value: 16)
!87 = !DIEnumerator(name: "B44Compression", value: 17)
!88 = !DIEnumerator(name: "B44ACompression", value: 18)
!89 = !DIEnumerator(name: "LZMACompression", value: 19)
!90 = !DIEnumerator(name: "JBIG1Compression", value: 20)
!91 = !DIEnumerator(name: "JBIG2Compression", value: 21)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !16, file: !17, line: 162, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!95 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !16, file: !17, line: 165, baseType: !97, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !17, line: 86, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 75, baseType: !9, size: 32, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108}
!100 = !DIEnumerator(name: "UndefinedOrientation", value: 0)
!101 = !DIEnumerator(name: "TopLeftOrientation", value: 1)
!102 = !DIEnumerator(name: "TopRightOrientation", value: 2)
!103 = !DIEnumerator(name: "BottomRightOrientation", value: 3)
!104 = !DIEnumerator(name: "BottomLeftOrientation", value: 4)
!105 = !DIEnumerator(name: "LeftTopOrientation", value: 5)
!106 = !DIEnumerator(name: "RightTopOrientation", value: 6)
!107 = !DIEnumerator(name: "RightBottomOrientation", value: 7)
!108 = !DIEnumerator(name: "LeftBottomOrientation", value: 8)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !16, file: !17, line: 168, baseType: !6, size: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !16, file: !17, line: 169, baseType: !6, size: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !16, file: !17, line: 172, baseType: !93, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !16, file: !17, line: 173, baseType: !93, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !16, file: !17, line: 174, baseType: !93, size: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !16, file: !17, line: 175, baseType: !93, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !16, file: !17, line: 178, baseType: !116, size: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !118, line: 148, baseType: !119)
!118 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !118, line: 131, size: 64, elements: !120)
!120 = !{!121, !124, !125, !126}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !119, file: !118, line: 143, baseType: !122, size: 16)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !7, line: 93, baseType: !123)
!123 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !119, file: !118, line: 144, baseType: !122, size: 16, offset: 16)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !119, file: !118, line: 145, baseType: !122, size: 16, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !119, file: !118, line: 146, baseType: !122, size: 16, offset: 48)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !16, file: !17, line: 179, baseType: !117, size: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !16, file: !17, line: 180, baseType: !117, size: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !16, file: !17, line: 181, baseType: !117, size: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !16, file: !17, line: 184, baseType: !131, size: 64, offset: 832)
!131 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !16, file: !17, line: 187, baseType: !133, size: 768, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !17, line: 128, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !17, line: 121, size: 768, elements: !135)
!135 = !{!136, !143, !144, !145}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !134, file: !17, line: 124, baseType: !137, size: 192)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !17, line: 101, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !17, line: 95, size: 192, elements: !139)
!139 = !{!140, !141, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !138, file: !17, line: 98, baseType: !131, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !138, file: !17, line: 99, baseType: !131, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !138, file: !17, line: 100, baseType: !131, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !134, file: !17, line: 125, baseType: !137, size: 192, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !134, file: !17, line: 126, baseType: !137, size: 192, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !134, file: !17, line: 127, baseType: !137, size: 192, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !16, file: !17, line: 190, baseType: !147, size: 32, offset: 1664)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !148, line: 49, baseType: !149)
!148 = !DIFile(filename: "apps/538.imagick_r/src/magick/profile.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fb61c1ae348c42a2b68ac081d4b39ee3")
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 42, baseType: !9, size: 32, elements: !150)
!150 = !{!151, !152, !153, !154, !155}
!151 = !DIEnumerator(name: "UndefinedIntent", value: 0)
!152 = !DIEnumerator(name: "SaturationIntent", value: 1)
!153 = !DIEnumerator(name: "PerceptualIntent", value: 2)
!154 = !DIEnumerator(name: "AbsoluteIntent", value: 3)
!155 = !DIEnumerator(name: "RelativeIntent", value: 4)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !16, file: !17, line: 193, baseType: !157, size: 64, offset: 1728)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !16, file: !17, line: 196, baseType: !159, size: 32, offset: 1792)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !17, line: 93, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 88, baseType: !9, size: 32, elements: !161)
!161 = !{!162, !163, !164}
!162 = !DIEnumerator(name: "UndefinedResolution", value: 0)
!163 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1)
!164 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !16, file: !17, line: 199, baseType: !166, size: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !16, file: !17, line: 200, baseType: !166, size: 64, offset: 1920)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !16, file: !17, line: 201, baseType: !166, size: 64, offset: 1984)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !16, file: !17, line: 204, baseType: !171, size: 64, offset: 2048)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !172, line: 77, baseType: !173)
!172 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !174, line: 193, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!175 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !16, file: !17, line: 207, baseType: !131, size: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !16, file: !17, line: 208, baseType: !131, size: 64, offset: 2176)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !16, file: !17, line: 211, baseType: !179, size: 256, offset: 2240)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !180, line: 130, baseType: !181)
!180 = !DIFile(filename: "apps/538.imagick_r/src/magick/geometry.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "889bed117eb2a2fce6e2622bd130bcd2")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !180, line: 121, size: 256, elements: !182)
!182 = !{!183, !184, !185, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !181, file: !180, line: 124, baseType: !93, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !181, file: !180, line: 125, baseType: !93, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !181, file: !180, line: 128, baseType: !171, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !181, file: !180, line: 129, baseType: !171, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !16, file: !17, line: 212, baseType: !179, size: 256, offset: 2496)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !16, file: !17, line: 213, baseType: !179, size: 256, offset: 2752)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !16, file: !17, line: 216, baseType: !131, size: 64, offset: 3008)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !16, file: !17, line: 217, baseType: !131, size: 64, offset: 3072)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !16, file: !17, line: 218, baseType: !131, size: 64, offset: 3136)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !16, file: !17, line: 221, baseType: !193, size: 32, offset: 3200)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !194, line: 66, baseType: !195)
!194 = !DIFile(filename: "apps/538.imagick_r/src/magick/resample.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "722fed6aaf07c122ede72839e4dadc42")
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !194, line: 32, baseType: !9, size: 32, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!197 = !DIEnumerator(name: "UndefinedFilter", value: 0)
!198 = !DIEnumerator(name: "PointFilter", value: 1)
!199 = !DIEnumerator(name: "BoxFilter", value: 2)
!200 = !DIEnumerator(name: "TriangleFilter", value: 3)
!201 = !DIEnumerator(name: "HermiteFilter", value: 4)
!202 = !DIEnumerator(name: "HanningFilter", value: 5)
!203 = !DIEnumerator(name: "HammingFilter", value: 6)
!204 = !DIEnumerator(name: "BlackmanFilter", value: 7)
!205 = !DIEnumerator(name: "GaussianFilter", value: 8)
!206 = !DIEnumerator(name: "QuadraticFilter", value: 9)
!207 = !DIEnumerator(name: "CubicFilter", value: 10)
!208 = !DIEnumerator(name: "CatromFilter", value: 11)
!209 = !DIEnumerator(name: "MitchellFilter", value: 12)
!210 = !DIEnumerator(name: "JincFilter", value: 13)
!211 = !DIEnumerator(name: "SincFilter", value: 14)
!212 = !DIEnumerator(name: "SincFastFilter", value: 15)
!213 = !DIEnumerator(name: "KaiserFilter", value: 16)
!214 = !DIEnumerator(name: "WelshFilter", value: 17)
!215 = !DIEnumerator(name: "ParzenFilter", value: 18)
!216 = !DIEnumerator(name: "BohmanFilter", value: 19)
!217 = !DIEnumerator(name: "BartlettFilter", value: 20)
!218 = !DIEnumerator(name: "LagrangeFilter", value: 21)
!219 = !DIEnumerator(name: "LanczosFilter", value: 22)
!220 = !DIEnumerator(name: "LanczosSharpFilter", value: 23)
!221 = !DIEnumerator(name: "Lanczos2Filter", value: 24)
!222 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25)
!223 = !DIEnumerator(name: "RobidouxFilter", value: 26)
!224 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27)
!225 = !DIEnumerator(name: "CosineFilter", value: 28)
!226 = !DIEnumerator(name: "SplineFilter", value: 29)
!227 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30)
!228 = !DIEnumerator(name: "SentinelFilter", value: 31)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !16, file: !17, line: 224, baseType: !230, size: 32, offset: 3232)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !17, line: 73, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 63, baseType: !9, size: 32, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240}
!233 = !DIEnumerator(name: "UndefinedInterlace", value: 0)
!234 = !DIEnumerator(name: "NoInterlace", value: 1)
!235 = !DIEnumerator(name: "LineInterlace", value: 2)
!236 = !DIEnumerator(name: "PlaneInterlace", value: 3)
!237 = !DIEnumerator(name: "PartitionInterlace", value: 4)
!238 = !DIEnumerator(name: "GIFInterlace", value: 5)
!239 = !DIEnumerator(name: "JPEGInterlace", value: 6)
!240 = !DIEnumerator(name: "PNGInterlace", value: 7)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !16, file: !17, line: 227, baseType: !242, size: 32, offset: 3264)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !243, line: 35, baseType: !244)
!243 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1f6eaed79d9a4eaf712cd066f6ff022a")
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !243, line: 30, baseType: !9, size: 32, elements: !245)
!245 = !{!246, !247, !248}
!246 = !DIEnumerator(name: "UndefinedEndian", value: 0)
!247 = !DIEnumerator(name: "LSBEndian", value: 1)
!248 = !DIEnumerator(name: "MSBEndian", value: 2)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !16, file: !17, line: 230, baseType: !250, size: 32, offset: 3296)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !180, line: 91, baseType: !251)
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !180, line: 77, baseType: !9, size: 32, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!253 = !DIEnumerator(name: "UndefinedGravity", value: 0)
!254 = !DIEnumerator(name: "ForgetGravity", value: 0)
!255 = !DIEnumerator(name: "NorthWestGravity", value: 1)
!256 = !DIEnumerator(name: "NorthGravity", value: 2)
!257 = !DIEnumerator(name: "NorthEastGravity", value: 3)
!258 = !DIEnumerator(name: "WestGravity", value: 4)
!259 = !DIEnumerator(name: "CenterGravity", value: 5)
!260 = !DIEnumerator(name: "EastGravity", value: 6)
!261 = !DIEnumerator(name: "SouthWestGravity", value: 7)
!262 = !DIEnumerator(name: "SouthGravity", value: 8)
!263 = !DIEnumerator(name: "SouthEastGravity", value: 9)
!264 = !DIEnumerator(name: "StaticGravity", value: 10)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !16, file: !17, line: 233, baseType: !266, size: 32, offset: 3328)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !267, line: 99, baseType: !268)
!267 = !DIFile(filename: "apps/538.imagick_r/src/magick/composite.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "837959ddb1dc628f80f1f9b5cdda1fb4")
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !267, line: 25, baseType: !9, size: 32, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!270 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0)
!271 = !DIEnumerator(name: "NoCompositeOp", value: 1)
!272 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2)
!273 = !DIEnumerator(name: "AtopCompositeOp", value: 3)
!274 = !DIEnumerator(name: "BlendCompositeOp", value: 4)
!275 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5)
!276 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6)
!277 = !DIEnumerator(name: "ClearCompositeOp", value: 7)
!278 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8)
!279 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9)
!280 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10)
!281 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11)
!282 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12)
!283 = !DIEnumerator(name: "CopyCompositeOp", value: 13)
!284 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14)
!285 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15)
!286 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16)
!287 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17)
!288 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18)
!289 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19)
!290 = !DIEnumerator(name: "DarkenCompositeOp", value: 20)
!291 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21)
!292 = !DIEnumerator(name: "DstCompositeOp", value: 22)
!293 = !DIEnumerator(name: "DstInCompositeOp", value: 23)
!294 = !DIEnumerator(name: "DstOutCompositeOp", value: 24)
!295 = !DIEnumerator(name: "DstOverCompositeOp", value: 25)
!296 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26)
!297 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27)
!298 = !DIEnumerator(name: "DissolveCompositeOp", value: 28)
!299 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29)
!300 = !DIEnumerator(name: "HardLightCompositeOp", value: 30)
!301 = !DIEnumerator(name: "HueCompositeOp", value: 31)
!302 = !DIEnumerator(name: "InCompositeOp", value: 32)
!303 = !DIEnumerator(name: "LightenCompositeOp", value: 33)
!304 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34)
!305 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35)
!306 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36)
!307 = !DIEnumerator(name: "ModulateCompositeOp", value: 37)
!308 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38)
!309 = !DIEnumerator(name: "OutCompositeOp", value: 39)
!310 = !DIEnumerator(name: "OverCompositeOp", value: 40)
!311 = !DIEnumerator(name: "OverlayCompositeOp", value: 41)
!312 = !DIEnumerator(name: "PlusCompositeOp", value: 42)
!313 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43)
!314 = !DIEnumerator(name: "SaturateCompositeOp", value: 44)
!315 = !DIEnumerator(name: "ScreenCompositeOp", value: 45)
!316 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46)
!317 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47)
!318 = !DIEnumerator(name: "SrcCompositeOp", value: 48)
!319 = !DIEnumerator(name: "SrcInCompositeOp", value: 49)
!320 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50)
!321 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51)
!322 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52)
!323 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53)
!324 = !DIEnumerator(name: "XorCompositeOp", value: 54)
!325 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55)
!326 = !DIEnumerator(name: "DistortCompositeOp", value: 56)
!327 = !DIEnumerator(name: "BlurCompositeOp", value: 57)
!328 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58)
!329 = !DIEnumerator(name: "VividLightCompositeOp", value: 59)
!330 = !DIEnumerator(name: "PinLightCompositeOp", value: 60)
!331 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61)
!332 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62)
!333 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63)
!334 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64)
!335 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65)
!336 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66)
!337 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !16, file: !17, line: 236, baseType: !339, size: 32, offset: 3360)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !340, line: 32, baseType: !341)
!340 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !340, line: 25, baseType: !9, size: 32, elements: !342)
!342 = !{!343, !344, !345, !346, !347}
!343 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!344 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!345 = !DIEnumerator(name: "NoneDispose", value: 1)
!346 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!347 = !DIEnumerator(name: "PreviousDispose", value: 3)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !16, file: !17, line: 239, baseType: !349, size: 64, offset: 3392)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !16, file: !17, line: 242, baseType: !93, size: 64, offset: 3456)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !16, file: !17, line: 243, baseType: !93, size: 64, offset: 3520)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !16, file: !17, line: 246, baseType: !171, size: 64, offset: 3584)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !16, file: !17, line: 249, baseType: !93, size: 64, offset: 3648)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !16, file: !17, line: 250, baseType: !93, size: 64, offset: 3712)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !16, file: !17, line: 253, baseType: !171, size: 64, offset: 3776)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !16, file: !17, line: 256, baseType: !357, size: 192, offset: 3840)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !358, line: 68, baseType: !359)
!358 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !358, line: 62, size: 192, elements: !360)
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !359, file: !358, line: 65, baseType: !131, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !359, file: !358, line: 66, baseType: !131, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !359, file: !358, line: 67, baseType: !131, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !16, file: !17, line: 259, baseType: !365, size: 512, offset: 4032)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !366, line: 51, baseType: !367)
!366 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !366, line: 40, size: 512, elements: !368)
!368 = !{!369, !376, !377, !384}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !367, file: !366, line: 43, baseType: !370, size: 192)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !366, line: 38, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !366, line: 32, size: 192, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !371, file: !366, line: 35, baseType: !131, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !371, file: !366, line: 36, baseType: !131, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !371, file: !366, line: 37, baseType: !131, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !367, file: !366, line: 44, baseType: !370, size: 192, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !366, line: 47, baseType: !378, size: 32, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !366, line: 30, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 25, baseType: !9, size: 32, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!382 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!383 = !DIEnumerator(name: "RunningTimerState", value: 2)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !367, file: !366, line: 50, baseType: !93, size: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !16, file: !17, line: 262, baseType: !386, size: 64, offset: 4544)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !387, line: 26, baseType: !388)
!387 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!6, !391, !393, !396, !157}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !7, line: 150, baseType: !395)
!395 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !7, line: 151, baseType: !398)
!398 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !16, file: !17, line: 265, baseType: !157, size: 64, offset: 4608)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !16, file: !17, line: 266, baseType: !157, size: 64, offset: 4672)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !16, file: !17, line: 267, baseType: !157, size: 64, offset: 4736)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !16, file: !17, line: 270, baseType: !403, size: 64, offset: 4800)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !67, line: 52, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !67, line: 51, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !16, file: !17, line: 273, baseType: !407, size: 64, offset: 4864)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !7, line: 217, baseType: !409)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !7, line: 217, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !16, file: !17, line: 276, baseType: !411, size: 32768, offset: 4928)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 32768, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 4096)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !16, file: !17, line: 277, baseType: !411, size: 32768, offset: 37696)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !16, file: !17, line: 278, baseType: !411, size: 32768, offset: 70464)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !16, file: !17, line: 281, baseType: !93, size: 64, offset: 103232)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !16, file: !17, line: 282, baseType: !93, size: 64, offset: 103296)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !16, file: !17, line: 285, baseType: !419, size: 448, offset: 103360)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !7, line: 219, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !421, line: 102, size: 448, elements: !422)
!421 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cd97c70c025a9cff45f4138c27a79124")
!422 = !{!423, !497, !499, !500, !501, !502, !503, !508}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !420, file: !421, line: 105, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !421, line: 100, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !421, line: 28, baseType: !9, size: 32, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!427 = !DIEnumerator(name: "UndefinedException", value: 0)
!428 = !DIEnumerator(name: "WarningException", value: 300)
!429 = !DIEnumerator(name: "ResourceLimitWarning", value: 300)
!430 = !DIEnumerator(name: "TypeWarning", value: 305)
!431 = !DIEnumerator(name: "OptionWarning", value: 310)
!432 = !DIEnumerator(name: "DelegateWarning", value: 315)
!433 = !DIEnumerator(name: "MissingDelegateWarning", value: 320)
!434 = !DIEnumerator(name: "CorruptImageWarning", value: 325)
!435 = !DIEnumerator(name: "FileOpenWarning", value: 330)
!436 = !DIEnumerator(name: "BlobWarning", value: 335)
!437 = !DIEnumerator(name: "StreamWarning", value: 340)
!438 = !DIEnumerator(name: "CacheWarning", value: 345)
!439 = !DIEnumerator(name: "CoderWarning", value: 350)
!440 = !DIEnumerator(name: "FilterWarning", value: 352)
!441 = !DIEnumerator(name: "ModuleWarning", value: 355)
!442 = !DIEnumerator(name: "DrawWarning", value: 360)
!443 = !DIEnumerator(name: "ImageWarning", value: 365)
!444 = !DIEnumerator(name: "WandWarning", value: 370)
!445 = !DIEnumerator(name: "RandomWarning", value: 375)
!446 = !DIEnumerator(name: "XServerWarning", value: 380)
!447 = !DIEnumerator(name: "MonitorWarning", value: 385)
!448 = !DIEnumerator(name: "RegistryWarning", value: 390)
!449 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!450 = !DIEnumerator(name: "PolicyWarning", value: 399)
!451 = !DIEnumerator(name: "ErrorException", value: 400)
!452 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!453 = !DIEnumerator(name: "TypeError", value: 405)
!454 = !DIEnumerator(name: "OptionError", value: 410)
!455 = !DIEnumerator(name: "DelegateError", value: 415)
!456 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!457 = !DIEnumerator(name: "CorruptImageError", value: 425)
!458 = !DIEnumerator(name: "FileOpenError", value: 430)
!459 = !DIEnumerator(name: "BlobError", value: 435)
!460 = !DIEnumerator(name: "StreamError", value: 440)
!461 = !DIEnumerator(name: "CacheError", value: 445)
!462 = !DIEnumerator(name: "CoderError", value: 450)
!463 = !DIEnumerator(name: "FilterError", value: 452)
!464 = !DIEnumerator(name: "ModuleError", value: 455)
!465 = !DIEnumerator(name: "DrawError", value: 460)
!466 = !DIEnumerator(name: "ImageError", value: 465)
!467 = !DIEnumerator(name: "WandError", value: 470)
!468 = !DIEnumerator(name: "RandomError", value: 475)
!469 = !DIEnumerator(name: "XServerError", value: 480)
!470 = !DIEnumerator(name: "MonitorError", value: 485)
!471 = !DIEnumerator(name: "RegistryError", value: 490)
!472 = !DIEnumerator(name: "ConfigureError", value: 495)
!473 = !DIEnumerator(name: "PolicyError", value: 499)
!474 = !DIEnumerator(name: "FatalErrorException", value: 700)
!475 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!476 = !DIEnumerator(name: "TypeFatalError", value: 705)
!477 = !DIEnumerator(name: "OptionFatalError", value: 710)
!478 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!479 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!480 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!481 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!482 = !DIEnumerator(name: "BlobFatalError", value: 735)
!483 = !DIEnumerator(name: "StreamFatalError", value: 740)
!484 = !DIEnumerator(name: "CacheFatalError", value: 745)
!485 = !DIEnumerator(name: "CoderFatalError", value: 750)
!486 = !DIEnumerator(name: "FilterFatalError", value: 752)
!487 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!488 = !DIEnumerator(name: "DrawFatalError", value: 760)
!489 = !DIEnumerator(name: "ImageFatalError", value: 765)
!490 = !DIEnumerator(name: "WandFatalError", value: 770)
!491 = !DIEnumerator(name: "RandomFatalError", value: 775)
!492 = !DIEnumerator(name: "XServerFatalError", value: 780)
!493 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!494 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!495 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!496 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !420, file: !421, line: 108, baseType: !498, size: 32, offset: 32)
!498 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !420, file: !421, line: 111, baseType: !166, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !420, file: !421, line: 112, baseType: !166, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !420, file: !421, line: 115, baseType: !157, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !420, file: !421, line: 118, baseType: !6, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !420, file: !421, line: 121, baseType: !504, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !506, line: 26, baseType: !507)
!506 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !506, line: 25, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !420, file: !421, line: 124, baseType: !93, size: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !16, file: !17, line: 288, baseType: !6, size: 32, offset: 103808)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !16, file: !17, line: 291, baseType: !511, size: 64, offset: 103872)
!511 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !171)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !16, file: !17, line: 294, baseType: !504, size: 64, offset: 103936)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !16, file: !17, line: 297, baseType: !514, size: 256, offset: 104000)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !148, line: 40, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !148, line: 27, size: 256, elements: !516)
!516 = !{!517, !518, !519, !522}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !515, file: !148, line: 30, baseType: !166, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !515, file: !148, line: 33, baseType: !93, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !515, file: !148, line: 36, baseType: !520, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !515, file: !148, line: 39, baseType: !93, size: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !16, file: !17, line: 298, baseType: !514, size: 256, offset: 104256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !16, file: !17, line: 299, baseType: !525, size: 64, offset: 104512)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !16, file: !17, line: 302, baseType: !93, size: 64, offset: 104576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !16, file: !17, line: 305, baseType: !93, size: 64, offset: 104640)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !16, file: !17, line: 308, baseType: !349, size: 64, offset: 104704)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !16, file: !17, line: 309, baseType: !349, size: 64, offset: 104768)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !16, file: !17, line: 310, baseType: !349, size: 64, offset: 104832)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !16, file: !17, line: 313, baseType: !532, size: 32, offset: 104896)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !118, line: 47, baseType: !533)
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 31, baseType: !9, size: 32, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!535 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!536 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!537 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!538 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!539 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!540 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!541 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!542 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!543 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!544 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!545 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!546 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!547 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!548 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !16, file: !17, line: 316, baseType: !6, size: 32, offset: 104928)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !16, file: !17, line: 319, baseType: !117, size: 64, offset: 104960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !16, file: !17, line: 322, baseType: !349, size: 64, offset: 105024)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !16, file: !17, line: 325, baseType: !179, size: 256, offset: 105088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !16, file: !17, line: 328, baseType: !157, size: 64, offset: 105344)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !16, file: !17, line: 329, baseType: !157, size: 64, offset: 105408)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !16, file: !17, line: 332, baseType: !556, size: 32, offset: 105472)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !17, line: 61, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 47, baseType: !9, size: 32, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!559 = !DIEnumerator(name: "UndefinedType", value: 0)
!560 = !DIEnumerator(name: "BilevelType", value: 1)
!561 = !DIEnumerator(name: "GrayscaleType", value: 2)
!562 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!563 = !DIEnumerator(name: "PaletteType", value: 4)
!564 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!565 = !DIEnumerator(name: "TrueColorType", value: 6)
!566 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!567 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!568 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!569 = !DIEnumerator(name: "OptimizeType", value: 10)
!570 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !16, file: !17, line: 335, baseType: !6, size: 32, offset: 105504)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !16, file: !17, line: 338, baseType: !397, size: 64, offset: 105536)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !16, file: !17, line: 341, baseType: !6, size: 32, offset: 105600)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !16, file: !17, line: 344, baseType: !93, size: 64, offset: 105664)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !16, file: !17, line: 347, baseType: !576, size: 64, offset: 105728)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !577, line: 7, baseType: !578)
!577 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !174, line: 160, baseType: !175)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !16, file: !17, line: 350, baseType: !580, size: 32, offset: 105792)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !118, line: 79, baseType: !581)
!581 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 67, baseType: !9, size: 32, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!583 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!584 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!585 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!586 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!587 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!588 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!589 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!590 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!591 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!592 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !16, file: !17, line: 353, baseType: !93, size: 64, offset: 105856)
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !596, retainedTypes: !836, globals: !998, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/property.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r", checksumkind: CSK_MD5, checksum: "c4d5c6b80accd955e9107d1bed794ccc")
!596 = !{!8, !21, !29, !68, !98, !149, !160, !195, !231, !244, !251, !268, !341, !379, !425, !533, !557, !581, !597, !622, !644, !652, !685, !706, !718, !793, !808}
!597 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !598, line: 34, baseType: !9, size: 32, elements: !599)
!598 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!600 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!601 = !DIEnumerator(name: "NoEvents", value: 0)
!602 = !DIEnumerator(name: "TraceEvent", value: 1)
!603 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!604 = !DIEnumerator(name: "BlobEvent", value: 4)
!605 = !DIEnumerator(name: "CacheEvent", value: 8)
!606 = !DIEnumerator(name: "CoderEvent", value: 16)
!607 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!608 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!609 = !DIEnumerator(name: "DrawEvent", value: 128)
!610 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!611 = !DIEnumerator(name: "ImageEvent", value: 512)
!612 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!613 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!614 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!615 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!616 = !DIEnumerator(name: "TransformEvent", value: 16384)
!617 = !DIEnumerator(name: "UserEvent", value: 36864)
!618 = !DIEnumerator(name: "WandEvent", value: 65536)
!619 = !DIEnumerator(name: "X11Event", value: 131072)
!620 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!621 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 177, baseType: !9, size: 32, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!624 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!625 = !DIEnumerator(name: "RedChannel", value: 1)
!626 = !DIEnumerator(name: "GrayChannel", value: 1)
!627 = !DIEnumerator(name: "CyanChannel", value: 1)
!628 = !DIEnumerator(name: "GreenChannel", value: 2)
!629 = !DIEnumerator(name: "MagentaChannel", value: 2)
!630 = !DIEnumerator(name: "BlueChannel", value: 4)
!631 = !DIEnumerator(name: "YellowChannel", value: 4)
!632 = !DIEnumerator(name: "AlphaChannel", value: 8)
!633 = !DIEnumerator(name: "OpacityChannel", value: 8)
!634 = !DIEnumerator(name: "MatteChannel", value: 8)
!635 = !DIEnumerator(name: "BlackChannel", value: 32)
!636 = !DIEnumerator(name: "IndexChannel", value: 32)
!637 = !DIEnumerator(name: "CompositeChannels", value: 47)
!638 = !DIEnumerator(name: "AllChannels", value: 134217727)
!639 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!640 = !DIEnumerator(name: "RGBChannels", value: 128)
!641 = !DIEnumerator(name: "GrayChannels", value: 128)
!642 = !DIEnumerator(name: "SyncChannels", value: 256)
!643 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !358, line: 28, baseType: !9, size: 32, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651}
!646 = !DIEnumerator(name: "UndefinedCompliance", value: 0)
!647 = !DIEnumerator(name: "NoCompliance", value: 0)
!648 = !DIEnumerator(name: "SVGCompliance", value: 1)
!649 = !DIEnumerator(name: "X11Compliance", value: 2)
!650 = !DIEnumerator(name: "XPMCompliance", value: 4)
!651 = !DIEnumerator(name: "AllCompliance", value: 2147483647)
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !653, line: 27, baseType: !9, size: 32, elements: !654)
!653 = !DIFile(filename: "apps/538.imagick_r/src/magick/effect.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "85233add4591bd6d6001c51d4fa6a546")
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!655 = !DIEnumerator(name: "UndefinedPreview", value: 0)
!656 = !DIEnumerator(name: "RotatePreview", value: 1)
!657 = !DIEnumerator(name: "ShearPreview", value: 2)
!658 = !DIEnumerator(name: "RollPreview", value: 3)
!659 = !DIEnumerator(name: "HuePreview", value: 4)
!660 = !DIEnumerator(name: "SaturationPreview", value: 5)
!661 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!662 = !DIEnumerator(name: "GammaPreview", value: 7)
!663 = !DIEnumerator(name: "SpiffPreview", value: 8)
!664 = !DIEnumerator(name: "DullPreview", value: 9)
!665 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!666 = !DIEnumerator(name: "QuantizePreview", value: 11)
!667 = !DIEnumerator(name: "DespecklePreview", value: 12)
!668 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!669 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!670 = !DIEnumerator(name: "SharpenPreview", value: 15)
!671 = !DIEnumerator(name: "BlurPreview", value: 16)
!672 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!673 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!674 = !DIEnumerator(name: "SpreadPreview", value: 19)
!675 = !DIEnumerator(name: "SolarizePreview", value: 20)
!676 = !DIEnumerator(name: "ShadePreview", value: 21)
!677 = !DIEnumerator(name: "RaisePreview", value: 22)
!678 = !DIEnumerator(name: "SegmentPreview", value: 23)
!679 = !DIEnumerator(name: "SwirlPreview", value: 24)
!680 = !DIEnumerator(name: "ImplodePreview", value: 25)
!681 = !DIEnumerator(name: "WavePreview", value: 26)
!682 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!683 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!684 = !DIEnumerator(name: "JPEGPreview", value: 29)
!685 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !686, line: 27, baseType: !9, size: 32, elements: !687)
!686 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!688 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!689 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!690 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!691 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!692 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!693 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!694 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!695 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!696 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!697 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!698 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!699 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!700 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!701 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!702 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!703 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!704 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!705 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !707, line: 25, baseType: !9, size: 32, elements: !708)
!707 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717}
!709 = !DIEnumerator(name: "UndefinedPath", value: 0)
!710 = !DIEnumerator(name: "MagickPath", value: 1)
!711 = !DIEnumerator(name: "RootPath", value: 2)
!712 = !DIEnumerator(name: "HeadPath", value: 3)
!713 = !DIEnumerator(name: "TailPath", value: 4)
!714 = !DIEnumerator(name: "BasePath", value: 5)
!715 = !DIEnumerator(name: "ExtensionPath", value: 6)
!716 = !DIEnumerator(name: "SubimagePath", value: 7)
!717 = !DIEnumerator(name: "CanonicalPath", value: 8)
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !719, line: 25, baseType: !498, size: 32, elements: !720)
!719 = !DIFile(filename: "apps/538.imagick_r/src/magick/option.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "07bebb19d66188c5f61071b3cbeac6e1")
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!721 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!722 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!723 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!724 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!725 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!726 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!727 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!728 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!729 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!730 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!731 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!732 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!733 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!734 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!735 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!736 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!737 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!738 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!739 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!740 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!741 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!742 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!743 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!744 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!745 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!746 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!747 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!748 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!749 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!750 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!751 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!752 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!753 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!754 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!755 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!756 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!757 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!758 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!759 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!760 = !DIEnumerator(name: "MagickListOptions", value: 38)
!761 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!762 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!763 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!764 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!765 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!766 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!767 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!768 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!769 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!770 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!771 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!772 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!773 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!774 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!775 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!776 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!777 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!778 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!779 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!780 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!781 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!782 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!783 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!784 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!785 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!786 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!787 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!788 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!789 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!790 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!791 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!792 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!793 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !794, line: 46, baseType: !9, size: 32, elements: !795)
!794 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807}
!796 = !DIEnumerator(name: "_ISupper", value: 256)
!797 = !DIEnumerator(name: "_ISlower", value: 512)
!798 = !DIEnumerator(name: "_ISalpha", value: 1024)
!799 = !DIEnumerator(name: "_ISdigit", value: 2048)
!800 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!801 = !DIEnumerator(name: "_ISspace", value: 8192)
!802 = !DIEnumerator(name: "_ISprint", value: 16384)
!803 = !DIEnumerator(name: "_ISgraph", value: 32768)
!804 = !DIEnumerator(name: "_ISblank", value: 1)
!805 = !DIEnumerator(name: "_IScntrl", value: 2)
!806 = !DIEnumerator(name: "_ISpunct", value: 4)
!807 = !DIEnumerator(name: "_ISalnum", value: 8)
!808 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !180, line: 25, baseType: !9, size: 32, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!810 = !DIEnumerator(name: "NoValue", value: 0)
!811 = !DIEnumerator(name: "XValue", value: 1)
!812 = !DIEnumerator(name: "XiValue", value: 1)
!813 = !DIEnumerator(name: "YValue", value: 2)
!814 = !DIEnumerator(name: "PsiValue", value: 2)
!815 = !DIEnumerator(name: "WidthValue", value: 4)
!816 = !DIEnumerator(name: "RhoValue", value: 4)
!817 = !DIEnumerator(name: "HeightValue", value: 8)
!818 = !DIEnumerator(name: "SigmaValue", value: 8)
!819 = !DIEnumerator(name: "ChiValue", value: 16)
!820 = !DIEnumerator(name: "XiNegative", value: 32)
!821 = !DIEnumerator(name: "XNegative", value: 32)
!822 = !DIEnumerator(name: "PsiNegative", value: 64)
!823 = !DIEnumerator(name: "YNegative", value: 64)
!824 = !DIEnumerator(name: "ChiNegative", value: 128)
!825 = !DIEnumerator(name: "PercentValue", value: 4096)
!826 = !DIEnumerator(name: "AspectValue", value: 8192)
!827 = !DIEnumerator(name: "NormalizeValue", value: 8192)
!828 = !DIEnumerator(name: "LessValue", value: 16384)
!829 = !DIEnumerator(name: "GreaterValue", value: 32768)
!830 = !DIEnumerator(name: "MinimumValue", value: 65536)
!831 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536)
!832 = !DIEnumerator(name: "AreaValue", value: 131072)
!833 = !DIEnumerator(name: "DecimalValue", value: 262144)
!834 = !DIEnumerator(name: "SeparatorValue", value: 524288)
!835 = !DIEnumerator(name: "AllValues", value: 2147483647)
!836 = !{!95, !166, !157, !837, !841, !391, !844, !131, !845, !122, !171, !847, !977, !93, !498, !521, !123, !27, !266, !66, !339, !978, !250, !580, !147, !532, !979, !159, !167, !520, !988, !991, !992, !993, !175, !994, !394, !397, !907}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !839, line: 26, baseType: !840)
!839 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !839, line: 25, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!157, !157}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !7, line: 78, baseType: !846)
!846 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !7, line: 223, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !17, line: 356, size: 134336, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !885, !886, !887, !888, !889, !890, !892, !893, !894, !895, !896, !897, !906, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !974, !975, !976}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !849, file: !17, line: 359, baseType: !66, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !849, file: !17, line: 362, baseType: !97, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !849, file: !17, line: 365, baseType: !6, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !849, file: !17, line: 366, baseType: !6, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !849, file: !17, line: 367, baseType: !6, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !849, file: !17, line: 368, baseType: !6, size: 32, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !849, file: !17, line: 371, baseType: !166, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !849, file: !17, line: 372, baseType: !166, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !849, file: !17, line: 373, baseType: !166, size: 64, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !849, file: !17, line: 374, baseType: !166, size: 64, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !849, file: !17, line: 377, baseType: !93, size: 64, offset: 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !849, file: !17, line: 378, baseType: !93, size: 64, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !849, file: !17, line: 379, baseType: !93, size: 64, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !849, file: !17, line: 382, baseType: !230, size: 32, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !849, file: !17, line: 385, baseType: !242, size: 32, offset: 672)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !849, file: !17, line: 388, baseType: !159, size: 32, offset: 704)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !849, file: !17, line: 391, baseType: !93, size: 64, offset: 768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !849, file: !17, line: 394, baseType: !166, size: 64, offset: 832)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !849, file: !17, line: 395, baseType: !166, size: 64, offset: 896)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !849, file: !17, line: 396, baseType: !166, size: 64, offset: 960)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !849, file: !17, line: 397, baseType: !166, size: 64, offset: 1024)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !849, file: !17, line: 398, baseType: !166, size: 64, offset: 1088)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !849, file: !17, line: 401, baseType: !131, size: 64, offset: 1152)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !849, file: !17, line: 402, baseType: !131, size: 64, offset: 1216)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !849, file: !17, line: 405, baseType: !117, size: 64, offset: 1280)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !849, file: !17, line: 406, baseType: !117, size: 64, offset: 1344)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !849, file: !17, line: 407, baseType: !117, size: 64, offset: 1408)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !849, file: !17, line: 410, baseType: !6, size: 32, offset: 1472)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !849, file: !17, line: 411, baseType: !6, size: 32, offset: 1504)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !849, file: !17, line: 414, baseType: !93, size: 64, offset: 1536)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !849, file: !17, line: 417, baseType: !27, size: 32, offset: 1600)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !849, file: !17, line: 420, baseType: !556, size: 32, offset: 1632)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !849, file: !17, line: 423, baseType: !884, size: 32, offset: 1664)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !653, line: 59, baseType: !652)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !849, file: !17, line: 426, baseType: !171, size: 64, offset: 1728)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !849, file: !17, line: 429, baseType: !6, size: 32, offset: 1792)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !849, file: !17, line: 430, baseType: !6, size: 32, offset: 1824)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !849, file: !17, line: 433, baseType: !166, size: 64, offset: 1856)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !849, file: !17, line: 434, baseType: !166, size: 64, offset: 1920)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !849, file: !17, line: 437, baseType: !891, size: 32, offset: 1984)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !7, line: 202, baseType: !622)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !849, file: !17, line: 440, baseType: !844, size: 64, offset: 2048)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !849, file: !17, line: 443, baseType: !157, size: 64, offset: 2112)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !849, file: !17, line: 446, baseType: !386, size: 64, offset: 2176)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !849, file: !17, line: 449, baseType: !157, size: 64, offset: 2240)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !849, file: !17, line: 450, baseType: !157, size: 64, offset: 2304)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !849, file: !17, line: 453, baseType: !898, size: 64, offset: 2368)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !899, line: 26, baseType: !900)
!899 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!93, !13, !903, !905}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !849, file: !17, line: 456, baseType: !907, size: 64, offset: 2432)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !909, line: 7, baseType: !910)
!909 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !911, line: 49, size: 1728, elements: !912)
!911 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !928, !930, !931, !932, !934, !935, !937, !941, !944, !946, !949, !952, !953, !954, !955, !956}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !910, file: !911, line: 51, baseType: !498, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !910, file: !911, line: 54, baseType: !166, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !910, file: !911, line: 55, baseType: !166, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !910, file: !911, line: 56, baseType: !166, size: 64, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !910, file: !911, line: 57, baseType: !166, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !910, file: !911, line: 58, baseType: !166, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !910, file: !911, line: 59, baseType: !166, size: 64, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !910, file: !911, line: 60, baseType: !166, size: 64, offset: 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !910, file: !911, line: 61, baseType: !166, size: 64, offset: 512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !910, file: !911, line: 64, baseType: !166, size: 64, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !910, file: !911, line: 65, baseType: !166, size: 64, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !910, file: !911, line: 66, baseType: !166, size: 64, offset: 704)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !910, file: !911, line: 68, baseType: !926, size: 64, offset: 768)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !911, line: 36, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !910, file: !911, line: 70, baseType: !929, size: 64, offset: 832)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !910, file: !911, line: 72, baseType: !498, size: 32, offset: 896)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !910, file: !911, line: 73, baseType: !498, size: 32, offset: 928)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !910, file: !911, line: 74, baseType: !933, size: 64, offset: 960)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !174, line: 152, baseType: !175)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !910, file: !911, line: 77, baseType: !123, size: 16, offset: 1024)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !910, file: !911, line: 78, baseType: !936, size: 8, offset: 1040)
!936 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !910, file: !911, line: 79, baseType: !938, size: 8, offset: 1048)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 8, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 1)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !910, file: !911, line: 81, baseType: !942, size: 64, offset: 1088)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !911, line: 43, baseType: null)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !910, file: !911, line: 89, baseType: !945, size: 64, offset: 1152)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !174, line: 153, baseType: !175)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !910, file: !911, line: 91, baseType: !947, size: 64, offset: 1216)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !911, line: 37, flags: DIFlagFwdDecl)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !910, file: !911, line: 92, baseType: !950, size: 64, offset: 1280)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !911, line: 38, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !910, file: !911, line: 93, baseType: !929, size: 64, offset: 1344)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !910, file: !911, line: 94, baseType: !157, size: 64, offset: 1408)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !910, file: !911, line: 95, baseType: !93, size: 64, offset: 1472)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !910, file: !911, line: 96, baseType: !498, size: 32, offset: 1536)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !910, file: !911, line: 98, baseType: !957, size: 160, offset: 1568)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 160, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 20)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !849, file: !17, line: 459, baseType: !157, size: 64, offset: 2496)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !849, file: !17, line: 462, baseType: !93, size: 64, offset: 2560)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !849, file: !17, line: 465, baseType: !411, size: 32768, offset: 2624)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !849, file: !17, line: 466, baseType: !411, size: 32768, offset: 35392)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !849, file: !17, line: 467, baseType: !411, size: 32768, offset: 68160)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !849, file: !17, line: 468, baseType: !411, size: 32768, offset: 100928)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !849, file: !17, line: 471, baseType: !6, size: 32, offset: 133696)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !849, file: !17, line: 474, baseType: !166, size: 64, offset: 133760)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !849, file: !17, line: 477, baseType: !93, size: 64, offset: 133824)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !849, file: !17, line: 478, baseType: !93, size: 64, offset: 133888)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !849, file: !17, line: 481, baseType: !117, size: 64, offset: 133952)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !849, file: !17, line: 484, baseType: !93, size: 64, offset: 134016)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !849, file: !17, line: 487, baseType: !973, size: 32, offset: 134080)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !686, line: 47, baseType: !685)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !849, file: !17, line: 490, baseType: !117, size: 64, offset: 134112)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !849, file: !17, line: 493, baseType: !157, size: 64, offset: 134208)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !849, file: !17, line: 496, baseType: !6, size: 32, offset: 134272)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !981, line: 40, baseType: !982)
!981 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !981, line: 29, size: 32960, elements: !983)
!983 = !{!984, !985, !986, !987}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !982, file: !981, line: 32, baseType: !411, size: 32768)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !982, file: !981, line: 35, baseType: !520, size: 64, offset: 32768)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !982, file: !981, line: 38, baseType: !93, size: 64, offset: 32832)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !982, file: !981, line: 39, baseType: !93, size: 64, offset: 32896)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!498, !903, !903}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLTreeInfo", file: !996, line: 29, baseType: !997)
!996 = !DIFile(filename: "apps/538.imagick_r/src/magick/xml-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e544995a74b1ca30ba5edadca4a5927")
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XMLTreeInfo", file: !996, line: 28, flags: DIFlagFwdDecl)
!998 = !{!0, !999}
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "tag_bytes", scope: !2, file: !3, line: 1135, type: !1001, isLocal: true, isDefinition: true)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 416, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 13)
!1004 = !{!1005, !1006, !1007, !1010, !1013, !1014, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1041, !1042, !1047, !1048, !1049, !1050, !1051, !1054, !1057, !1058, !1062, !1063, !1064, !1067, !1068, !1069, !1072, !1073, !1074, !1077, !1078, !1079, !1082, !1083, !1084, !1087, !1088, !1089, !1092, !1093, !1094, !1097, !1098, !1099, !1102, !1103, !1104, !1107, !1108, !1109, !1113, !1116, !1117, !1120, !1121, !1124}
!1005 = !DILocalVariable(name: "image", arg: 1, scope: !2, file: !3, line: 727, type: !13)
!1006 = !DILocalVariable(name: "property", arg: 2, scope: !2, file: !3, line: 728, type: !391)
!1007 = !DILocalVariable(name: "profile", scope: !2, file: !3, line: 1099, type: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1010 = !DILocalVariable(name: "directory", scope: !2, file: !3, line: 1102, type: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!1013 = !DILocalVariable(name: "exif", scope: !2, file: !3, line: 1103, type: !1011)
!1014 = !DILocalVariable(name: "directory_stack", scope: !2, file: !3, line: 1106, type: !1015)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 3072, elements: !1022)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectoryInfo", scope: !2, file: !3, line: 811, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DirectoryInfo", scope: !2, file: !3, line: 801, size: 192, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !1017, file: !3, line: 804, baseType: !1011, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !1017, file: !3, line: 807, baseType: !93, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1017, file: !3, line: 810, baseType: !171, size: 64, offset: 128)
!1022 = !{!1023}
!1023 = !DISubrange(count: 16)
!1024 = !DILocalVariable(name: "endian", scope: !2, file: !3, line: 1109, type: !242)
!1025 = !DILocalVariable(name: "status", scope: !2, file: !3, line: 1112, type: !6)
!1026 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 1115, type: !171)
!1027 = !DILocalVariable(name: "entry", scope: !2, file: !3, line: 1118, type: !93)
!1028 = !DILocalVariable(name: "length", scope: !2, file: !3, line: 1119, type: !93)
!1029 = !DILocalVariable(name: "number_entries", scope: !2, file: !3, line: 1120, type: !93)
!1030 = !DILocalVariable(name: "tag", scope: !2, file: !3, line: 1121, type: !93)
!1031 = !DILocalVariable(name: "exif_resources", scope: !2, file: !3, line: 1124, type: !837)
!1032 = !DILocalVariable(name: "all", scope: !2, file: !3, line: 1127, type: !171)
!1033 = !DILocalVariable(name: "id", scope: !2, file: !3, line: 1128, type: !171)
!1034 = !DILocalVariable(name: "level", scope: !2, file: !3, line: 1129, type: !171)
!1035 = !DILocalVariable(name: "offset", scope: !2, file: !3, line: 1130, type: !171)
!1036 = !DILocalVariable(name: "tag_offset", scope: !2, file: !3, line: 1131, type: !171)
!1037 = !DILocalVariable(name: "tag_value", scope: !2, file: !3, line: 1132, type: !171)
!1038 = !DILocalVariable(name: "c", scope: !1039, file: !3, line: 1170, type: !498)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 1168, column: 5)
!1040 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1150, column: 3)
!1041 = !DILocalVariable(name: "n", scope: !1039, file: !3, line: 1173, type: !93)
!1042 = !DILocalVariable(name: "p", scope: !1043, file: !3, line: 1293, type: !520)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 1291, column: 5)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 1290, column: 5)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 1290, column: 5)
!1046 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1275, column: 3)
!1047 = !DILocalVariable(name: "q", scope: !1043, file: !3, line: 1294, type: !520)
!1048 = !DILocalVariable(name: "format", scope: !1043, file: !3, line: 1297, type: !93)
!1049 = !DILocalVariable(name: "number_bytes", scope: !1043, file: !3, line: 1300, type: !171)
!1050 = !DILocalVariable(name: "components", scope: !1043, file: !3, line: 1301, type: !171)
!1051 = !DILocalVariable(name: "offset", scope: !1052, file: !3, line: 1320, type: !171)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 1318, column: 9)
!1053 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 1315, column: 11)
!1054 = !DILocalVariable(name: "buffer", scope: !1055, file: !3, line: 1335, type: !411)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 1333, column: 9)
!1056 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 1332, column: 11)
!1057 = !DILocalVariable(name: "value", scope: !1055, file: !3, line: 1336, type: !166)
!1058 = !DILocalVariable(name: "component", scope: !1059, file: !3, line: 1345, type: !171)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 1345, column: 15)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1344, column: 13)
!1061 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 1341, column: 11)
!1062 = !DILocalVariable(name: "length", scope: !1059, file: !3, line: 1345, type: !93)
!1063 = !DILocalVariable(name: "p1", scope: !1059, file: !3, line: 1345, type: !520)
!1064 = !DILocalVariable(name: "component", scope: !1065, file: !3, line: 1350, type: !171)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 1350, column: 15)
!1066 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1349, column: 13)
!1067 = !DILocalVariable(name: "length", scope: !1065, file: !3, line: 1350, type: !93)
!1068 = !DILocalVariable(name: "p1", scope: !1065, file: !3, line: 1350, type: !520)
!1069 = !DILocalVariable(name: "component", scope: !1070, file: !3, line: 1355, type: !171)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 1355, column: 15)
!1071 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1354, column: 13)
!1072 = !DILocalVariable(name: "length", scope: !1070, file: !3, line: 1355, type: !93)
!1073 = !DILocalVariable(name: "p1", scope: !1070, file: !3, line: 1355, type: !520)
!1074 = !DILocalVariable(name: "component", scope: !1075, file: !3, line: 1360, type: !171)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 1360, column: 15)
!1076 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1359, column: 13)
!1077 = !DILocalVariable(name: "length", scope: !1075, file: !3, line: 1360, type: !93)
!1078 = !DILocalVariable(name: "p1", scope: !1075, file: !3, line: 1360, type: !520)
!1079 = !DILocalVariable(name: "component", scope: !1080, file: !3, line: 1365, type: !171)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 1365, column: 15)
!1081 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1364, column: 13)
!1082 = !DILocalVariable(name: "length", scope: !1080, file: !3, line: 1365, type: !93)
!1083 = !DILocalVariable(name: "p1", scope: !1080, file: !3, line: 1365, type: !520)
!1084 = !DILocalVariable(name: "component", scope: !1085, file: !3, line: 1371, type: !171)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 1371, column: 15)
!1086 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1370, column: 13)
!1087 = !DILocalVariable(name: "length", scope: !1085, file: !3, line: 1371, type: !93)
!1088 = !DILocalVariable(name: "p1", scope: !1085, file: !3, line: 1371, type: !520)
!1089 = !DILocalVariable(name: "component", scope: !1090, file: !3, line: 1377, type: !171)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 1377, column: 15)
!1091 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1376, column: 13)
!1092 = !DILocalVariable(name: "length", scope: !1090, file: !3, line: 1377, type: !93)
!1093 = !DILocalVariable(name: "p1", scope: !1090, file: !3, line: 1377, type: !520)
!1094 = !DILocalVariable(name: "component", scope: !1095, file: !3, line: 1384, type: !171)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 1384, column: 15)
!1096 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1383, column: 13)
!1097 = !DILocalVariable(name: "length", scope: !1095, file: !3, line: 1384, type: !93)
!1098 = !DILocalVariable(name: "p1", scope: !1095, file: !3, line: 1384, type: !520)
!1099 = !DILocalVariable(name: "component", scope: !1100, file: !3, line: 1391, type: !171)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 1391, column: 15)
!1101 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1390, column: 13)
!1102 = !DILocalVariable(name: "length", scope: !1100, file: !3, line: 1391, type: !93)
!1103 = !DILocalVariable(name: "p1", scope: !1100, file: !3, line: 1391, type: !520)
!1104 = !DILocalVariable(name: "component", scope: !1105, file: !3, line: 1396, type: !171)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 1396, column: 15)
!1106 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1395, column: 13)
!1107 = !DILocalVariable(name: "length", scope: !1105, file: !3, line: 1396, type: !93)
!1108 = !DILocalVariable(name: "p1", scope: !1105, file: !3, line: 1396, type: !520)
!1109 = !DILocalVariable(name: "i", scope: !1110, file: !3, line: 1409, type: !171)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 1407, column: 17)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 1406, column: 19)
!1112 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1401, column: 13)
!1113 = !DILocalVariable(name: "key", scope: !1114, file: !3, line: 1425, type: !166)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !3, line: 1423, column: 13)
!1115 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 1422, column: 15)
!1116 = !DILocalVariable(name: "p", scope: !1114, file: !3, line: 1428, type: !391)
!1117 = !DILocalVariable(name: "description", scope: !1118, file: !3, line: 1438, type: !391)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 1436, column: 17)
