; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/quantum-export.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/quantum-export.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 44, baseType: !5, size: 32, elements: !369)
!369 = !{!370, !371, !372, !373}
!370 = !DIEnumerator(name: "UndefinedQuantumFormat", value: 0)
!371 = !DIEnumerator(name: "FloatingPointQuantumFormat", value: 1)
!372 = !DIEnumerator(name: "SignedQuantumFormat", value: 2)
!373 = !DIEnumerator(name: "UnsignedQuantumFormat", value: 3)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 37, baseType: !5, size: 32, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIEnumerator(name: "UndefinedQuantumAlpha", value: 0)
!377 = !DIEnumerator(name: "AssociatedQuantumAlpha", value: 1)
!378 = !DIEnumerator(name: "DisassociatedQuantumAlpha", value: 2)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 52, baseType: !5, size: 32, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!381 = !DIEnumerator(name: "UndefinedQuantum", value: 0)
!382 = !DIEnumerator(name: "AlphaQuantum", value: 1)
!383 = !DIEnumerator(name: "BlackQuantum", value: 2)
!384 = !DIEnumerator(name: "BlueQuantum", value: 3)
!385 = !DIEnumerator(name: "CMYKAQuantum", value: 4)
!386 = !DIEnumerator(name: "CMYKQuantum", value: 5)
!387 = !DIEnumerator(name: "CyanQuantum", value: 6)
!388 = !DIEnumerator(name: "GrayAlphaQuantum", value: 7)
!389 = !DIEnumerator(name: "GrayQuantum", value: 8)
!390 = !DIEnumerator(name: "GreenQuantum", value: 9)
!391 = !DIEnumerator(name: "IndexAlphaQuantum", value: 10)
!392 = !DIEnumerator(name: "IndexQuantum", value: 11)
!393 = !DIEnumerator(name: "MagentaQuantum", value: 12)
!394 = !DIEnumerator(name: "OpacityQuantum", value: 13)
!395 = !DIEnumerator(name: "RedQuantum", value: 14)
!396 = !DIEnumerator(name: "RGBAQuantum", value: 15)
!397 = !DIEnumerator(name: "BGRAQuantum", value: 16)
!398 = !DIEnumerator(name: "RGBOQuantum", value: 17)
!399 = !DIEnumerator(name: "RGBQuantum", value: 18)
!400 = !DIEnumerator(name: "YellowQuantum", value: 19)
!401 = !DIEnumerator(name: "GrayPadQuantum", value: 20)
!402 = !DIEnumerator(name: "RGBPadQuantum", value: 21)
!403 = !DIEnumerator(name: "CbYCrYQuantum", value: 22)
!404 = !DIEnumerator(name: "CbYCrQuantum", value: 23)
!405 = !DIEnumerator(name: "CbYCrAQuantum", value: 24)
!406 = !DIEnumerator(name: "CMYKOQuantum", value: 25)
!407 = !DIEnumerator(name: "BGRQuantum", value: 26)
!408 = !DIEnumerator(name: "BGROQuantum", value: 27)
!409 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !410, line: 34, baseType: !5, size: 32, elements: !411)
!410 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!412 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!413 = !DIEnumerator(name: "NoEvents", value: 0)
!414 = !DIEnumerator(name: "TraceEvent", value: 1)
!415 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!416 = !DIEnumerator(name: "BlobEvent", value: 4)
!417 = !DIEnumerator(name: "CacheEvent", value: 8)
!418 = !DIEnumerator(name: "CoderEvent", value: 16)
!419 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!420 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!421 = !DIEnumerator(name: "DrawEvent", value: 128)
!422 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!423 = !DIEnumerator(name: "ImageEvent", value: 512)
!424 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!425 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!426 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!427 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!428 = !DIEnumerator(name: "TransformEvent", value: 16384)
!429 = !DIEnumerator(name: "UserEvent", value: 36864)
!430 = !DIEnumerator(name: "WandEvent", value: 65536)
!431 = !DIEnumerator(name: "X11Event", value: 131072)
!432 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!433 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!434 = !{!435, !436, !438, !439, !443, !453, !458, !448, !459, !501, !502, !437, !503, !449, !5, !504, !505, !506, !465, !508, !509}
!435 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !441, line: 50, baseType: !442)
!441 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !446)
!446 = !{!447, !450, !451, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !445, file: !326, line: 143, baseType: !448, size: 16)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !449)
!449 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !445, file: !326, line: 144, baseType: !448, size: 16, offset: 16)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !445, file: !326, line: 145, baseType: !448, size: 16, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !445, file: !326, line: 146, baseType: !448, size: 16, offset: 48)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !454, line: 77, baseType: !455)
!454 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !456, line: 193, baseType: !457)
!456 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!457 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!458 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumInfo", file: !147, line: 85, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumInfo", file: !462, line: 42, size: 1216, elements: !463)
!462 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!463 = !{!464, !467, !468, !470, !471, !472, !473, !474, !476, !477, !479, !480, !482, !483, !485, !495, !500}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !461, file: !462, line: 45, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !466, line: 46, baseType: !435)
!466 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!467 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !461, file: !462, line: 46, baseType: !465, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !461, file: !462, line: 49, baseType: !469, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumFormatType", file: !147, line: 50, baseType: !368)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !461, file: !462, line: 52, baseType: !458, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !461, file: !462, line: 53, baseType: !458, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !461, file: !462, line: 54, baseType: !458, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !461, file: !462, line: 57, baseType: !465, size: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "min_is_white", scope: !461, file: !462, line: 60, baseType: !475, size: 32, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !461, file: !462, line: 61, baseType: !475, size: 32, offset: 480)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_type", scope: !461, file: !462, line: 64, baseType: !478, size: 32, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAlphaType", file: !147, line: 42, baseType: !374)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !461, file: !462, line: 67, baseType: !465, size: 64, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !461, file: !462, line: 70, baseType: !481, size: 64, offset: 640)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !461, file: !462, line: 73, baseType: !465, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !461, file: !462, line: 76, baseType: !484, size: 32, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !461, file: !462, line: 79, baseType: !486, size: 256, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumState", file: !462, line: 40, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumState", file: !462, line: 27, size: 256, elements: !488)
!488 = !{!489, !490, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_scale", scope: !487, file: !462, line: 30, baseType: !458, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !487, file: !462, line: 33, baseType: !5, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !487, file: !462, line: 36, baseType: !465, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !487, file: !462, line: 39, baseType: !493, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !461, file: !462, line: 82, baseType: !496, size: 64, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !498, line: 26, baseType: !499)
!498 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !498, line: 25, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !461, file: !462, line: 85, baseType: !465, size: 64, offset: 1152)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !502)
!502 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!503 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !507)
!507 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAny", file: !4, line: 170, baseType: !506)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !448)
!512 = !{i32 7, !"Dwarf Version", i32 5}
!513 = !{i32 2, !"Debug Info Version", i32 3}
!514 = !{i32 1, !"wchar_size", i32 4}
!515 = !{i32 7, !"PIC Level", i32 2}
!516 = !{i32 7, !"PIE Level", i32 2}
!517 = !{i32 7, !"uwtable", i32 2}
!518 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!519 = distinct !DISubprogram(name: "ExportQuantumPixels", scope: !520, file: !520, line: 3165, type: !521, scopeLine: 3169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !723)
!520 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-export.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5fce83171145f691418a1e7a3684ccf5")
!521 = !DISubroutineType(types: !522)
!522 = !{!465, !523, !715, !717, !719, !721, !722}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !527)
!527 = !{!528, !530, !532, !534, !535, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !562, !564, !565, !567, !570, !571, !572, !573, !574, !575, !583, !584, !585, !586, !587, !588, !590, !592, !593, !595, !597, !599, !601, !602, !603, !604, !605, !606, !607, !615, !630, !642, !643, !644, !645, !649, !653, !657, !658, !659, !660, !661, !674, !675, !677, !678, !686, !687, !689, !690, !691, !692, !693, !694, !696, !697, !698, !699, !700, !701, !702, !704, !705, !706, !707, !708, !712, !714}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !526, file: !73, line: 153, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !526, file: !73, line: 156, baseType: !531, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !526, file: !73, line: 159, baseType: !533, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !526, file: !73, line: 162, baseType: !465, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !526, file: !73, line: 165, baseType: !536, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !526, file: !73, line: 168, baseType: !475, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !526, file: !73, line: 169, baseType: !475, size: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !526, file: !73, line: 172, baseType: !465, size: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !526, file: !73, line: 173, baseType: !465, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !526, file: !73, line: 174, baseType: !465, size: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !526, file: !73, line: 175, baseType: !465, size: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !526, file: !73, line: 178, baseType: !443, size: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !526, file: !73, line: 179, baseType: !444, size: 64, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !526, file: !73, line: 180, baseType: !444, size: 64, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !526, file: !73, line: 181, baseType: !444, size: 64, offset: 768)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !526, file: !73, line: 184, baseType: !458, size: 64, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !526, file: !73, line: 187, baseType: !549, size: 768, offset: 896)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !551)
!551 = !{!552, !559, !560, !561}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !550, file: !73, line: 124, baseType: !553, size: 192)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !554, file: !73, line: 98, baseType: !458, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !554, file: !73, line: 99, baseType: !458, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !554, file: !73, line: 100, baseType: !458, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !550, file: !73, line: 125, baseType: !553, size: 192, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !550, file: !73, line: 126, baseType: !553, size: 192, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !550, file: !73, line: 127, baseType: !553, size: 192, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !526, file: !73, line: 190, baseType: !563, size: 32, offset: 1664)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !526, file: !73, line: 193, baseType: !438, size: 64, offset: 1728)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !526, file: !73, line: 196, baseType: !566, size: 32, offset: 1792)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !526, file: !73, line: 199, baseType: !568, size: 64, offset: 1856)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !526, file: !73, line: 200, baseType: !568, size: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !526, file: !73, line: 201, baseType: !568, size: 64, offset: 1984)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !526, file: !73, line: 204, baseType: !453, size: 64, offset: 2048)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !526, file: !73, line: 207, baseType: !458, size: 64, offset: 2112)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !526, file: !73, line: 208, baseType: !458, size: 64, offset: 2176)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !526, file: !73, line: 211, baseType: !576, size: 256, offset: 2240)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !577, file: !153, line: 124, baseType: !465, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !577, file: !153, line: 125, baseType: !465, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !577, file: !153, line: 128, baseType: !453, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !577, file: !153, line: 129, baseType: !453, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !526, file: !73, line: 212, baseType: !576, size: 256, offset: 2496)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !526, file: !73, line: 213, baseType: !576, size: 256, offset: 2752)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !526, file: !73, line: 216, baseType: !458, size: 64, offset: 3008)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !526, file: !73, line: 217, baseType: !458, size: 64, offset: 3072)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !526, file: !73, line: 218, baseType: !458, size: 64, offset: 3136)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !526, file: !73, line: 221, baseType: !589, size: 32, offset: 3200)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !526, file: !73, line: 224, baseType: !591, size: 32, offset: 3232)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !526, file: !73, line: 227, baseType: !484, size: 32, offset: 3264)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !526, file: !73, line: 230, baseType: !594, size: 32, offset: 3296)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !526, file: !73, line: 233, baseType: !596, size: 32, offset: 3328)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !526, file: !73, line: 236, baseType: !598, size: 32, offset: 3360)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !526, file: !73, line: 239, baseType: !600, size: 64, offset: 3392)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !526, file: !73, line: 242, baseType: !465, size: 64, offset: 3456)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !526, file: !73, line: 243, baseType: !465, size: 64, offset: 3520)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !526, file: !73, line: 246, baseType: !453, size: 64, offset: 3584)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !526, file: !73, line: 249, baseType: !465, size: 64, offset: 3648)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !526, file: !73, line: 250, baseType: !465, size: 64, offset: 3712)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !526, file: !73, line: 253, baseType: !453, size: 64, offset: 3776)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !526, file: !73, line: 256, baseType: !608, size: 192, offset: 3840)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !609, line: 68, baseType: !610)
!609 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !609, line: 62, size: 192, elements: !611)
!611 = !{!612, !613, !614}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !610, file: !609, line: 65, baseType: !458, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !610, file: !609, line: 66, baseType: !458, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !610, file: !609, line: 67, baseType: !458, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !526, file: !73, line: 259, baseType: !616, size: 512, offset: 4032)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !618)
!618 = !{!619, !626, !627, !629}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !617, file: !247, line: 43, baseType: !620, size: 192)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !621, file: !247, line: 35, baseType: !458, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !621, file: !247, line: 36, baseType: !458, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !621, file: !247, line: 37, baseType: !458, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !617, file: !247, line: 44, baseType: !620, size: 192, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !617, file: !247, line: 47, baseType: !628, size: 32, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !617, file: !247, line: 50, baseType: !465, size: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !526, file: !73, line: 262, baseType: !631, size: 64, offset: 4544)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !632, line: 26, baseType: !633)
!632 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!475, !636, !638, !641, !438}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !640)
!640 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !526, file: !73, line: 265, baseType: !438, size: 64, offset: 4608)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !526, file: !73, line: 266, baseType: !438, size: 64, offset: 4672)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !526, file: !73, line: 267, baseType: !438, size: 64, offset: 4736)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !526, file: !73, line: 270, baseType: !646, size: 64, offset: 4800)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !648)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !526, file: !73, line: 273, baseType: !650, size: 64, offset: 4864)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !526, file: !73, line: 276, baseType: !654, size: 32768, offset: 4928)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 32768, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 4096)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !526, file: !73, line: 277, baseType: !654, size: 32768, offset: 37696)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !526, file: !73, line: 278, baseType: !654, size: 32768, offset: 70464)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !526, file: !73, line: 281, baseType: !465, size: 64, offset: 103232)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !526, file: !73, line: 282, baseType: !465, size: 64, offset: 103296)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !526, file: !73, line: 285, baseType: !662, size: 448, offset: 103360)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !664)
!664 = !{!665, !667, !668, !669, !670, !671, !672, !673}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !663, file: !253, line: 105, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !663, file: !253, line: 108, baseType: !503, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !663, file: !253, line: 111, baseType: !568, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !663, file: !253, line: 112, baseType: !568, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !663, file: !253, line: 115, baseType: !438, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !663, file: !253, line: 118, baseType: !475, size: 32, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !663, file: !253, line: 121, baseType: !496, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !663, file: !253, line: 124, baseType: !465, size: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !526, file: !73, line: 288, baseType: !475, size: 32, offset: 103808)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !526, file: !73, line: 291, baseType: !676, size: 64, offset: 103872)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !453)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !526, file: !73, line: 294, baseType: !496, size: 64, offset: 103936)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !526, file: !73, line: 297, baseType: !679, size: 256, offset: 104000)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !89, line: 30, baseType: !568, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !680, file: !89, line: 33, baseType: !465, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !680, file: !89, line: 36, baseType: !436, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !680, file: !89, line: 39, baseType: !465, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !526, file: !73, line: 298, baseType: !679, size: 256, offset: 104256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !526, file: !73, line: 299, baseType: !688, size: 64, offset: 104512)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !526, file: !73, line: 302, baseType: !465, size: 64, offset: 104576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !526, file: !73, line: 305, baseType: !465, size: 64, offset: 104640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !526, file: !73, line: 308, baseType: !600, size: 64, offset: 104704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !526, file: !73, line: 309, baseType: !600, size: 64, offset: 104768)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !73, line: 310, baseType: !600, size: 64, offset: 104832)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !526, file: !73, line: 313, baseType: !695, size: 32, offset: 104896)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !526, file: !73, line: 316, baseType: !475, size: 32, offset: 104928)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !526, file: !73, line: 319, baseType: !444, size: 64, offset: 104960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !526, file: !73, line: 322, baseType: !600, size: 64, offset: 105024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !526, file: !73, line: 325, baseType: !576, size: 256, offset: 105088)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !526, file: !73, line: 328, baseType: !438, size: 64, offset: 105344)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !526, file: !73, line: 329, baseType: !438, size: 64, offset: 105408)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !526, file: !73, line: 332, baseType: !703, size: 32, offset: 105472)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !526, file: !73, line: 335, baseType: !475, size: 32, offset: 105504)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !526, file: !73, line: 338, baseType: !506, size: 64, offset: 105536)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !526, file: !73, line: 341, baseType: !475, size: 32, offset: 105600)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !526, file: !73, line: 344, baseType: !465, size: 64, offset: 105664)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !526, file: !73, line: 347, baseType: !709, size: 64, offset: 105728)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !710, line: 7, baseType: !711)
!710 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !456, line: 160, baseType: !457)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !526, file: !73, line: 350, baseType: !713, size: 32, offset: 105792)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !526, file: !73, line: 353, baseType: !465, size: 64, offset: 105856)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumType", file: !147, line: 82, baseType: !379)
!721 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !436)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !734, !738, !739, !740, !741, !745, !748, !751, !752, !755, !756}
!724 = !DILocalVariable(name: "image", arg: 1, scope: !519, file: !520, line: 3165, type: !523)
!725 = !DILocalVariable(name: "image_view", arg: 2, scope: !519, file: !520, line: 3166, type: !715)
!726 = !DILocalVariable(name: "quantum_info", arg: 3, scope: !519, file: !520, line: 3166, type: !717)
!727 = !DILocalVariable(name: "quantum_type", arg: 4, scope: !519, file: !520, line: 3167, type: !719)
!728 = !DILocalVariable(name: "pixels", arg: 5, scope: !519, file: !520, line: 3167, type: !721)
!729 = !DILocalVariable(name: "exception", arg: 6, scope: !519, file: !520, line: 3168, type: !722)
!730 = !DILocalVariable(name: "alpha", scope: !519, file: !520, line: 3171, type: !501)
!731 = !DILocalVariable(name: "number_pixels", scope: !519, file: !520, line: 3174, type: !506)
!732 = !DILocalVariable(name: "indexes", scope: !519, file: !520, line: 3177, type: !733)
!733 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !509)
!734 = !DILocalVariable(name: "p", scope: !519, file: !520, line: 3180, type: !735)
!735 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!738 = !DILocalVariable(name: "x", scope: !519, file: !520, line: 3183, type: !453)
!739 = !DILocalVariable(name: "q", scope: !519, file: !520, line: 3186, type: !721)
!740 = !DILocalVariable(name: "extent", scope: !519, file: !520, line: 3189, type: !465)
!741 = !DILocalVariable(name: "q", scope: !742, file: !520, line: 3214, type: !744)
!742 = distinct !DILexicalBlock(scope: !743, file: !520, line: 3212, column: 5)
!743 = distinct !DILexicalBlock(scope: !519, file: !520, line: 3211, column: 7)
!744 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !443)
!745 = !DILocalVariable(name: "q", scope: !746, file: !520, line: 3235, type: !744)
!746 = distinct !DILexicalBlock(scope: !747, file: !520, line: 3233, column: 5)
!747 = distinct !DILexicalBlock(scope: !519, file: !520, line: 3231, column: 7)
!748 = !DILocalVariable(name: "quantum", scope: !749, file: !520, line: 3249, type: !448)
!749 = distinct !DILexicalBlock(scope: !750, file: !520, line: 3247, column: 5)
!750 = distinct !DILexicalBlock(scope: !519, file: !520, line: 3246, column: 7)
!751 = !DILocalVariable(name: "q", scope: !749, file: !520, line: 3252, type: !744)
!752 = !DILocalVariable(name: "quantum", scope: !753, file: !520, line: 3376, type: !448)
!753 = distinct !DILexicalBlock(scope: !754, file: !520, line: 3374, column: 5)
!754 = distinct !DILexicalBlock(scope: !519, file: !520, line: 3373, column: 7)
!755 = !DILocalVariable(name: "q", scope: !753, file: !520, line: 3379, type: !744)
!756 = !DILocalVariable(name: "q", scope: !757, file: !520, line: 3396, type: !744)
!757 = distinct !DILexicalBlock(scope: !758, file: !520, line: 3394, column: 5)
!758 = distinct !DILexicalBlock(scope: !519, file: !520, line: 3392, column: 7)
!759 = !DILocation(line: 0, scope: !519)
!760 = !DILocation(line: 3193, column: 14, scope: !761)
!761 = distinct !DILexicalBlock(scope: !519, file: !520, line: 3193, column: 7)
!762 = !{!763, !764, i64 12976}
