; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/common/quant.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/quant.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_quant_function_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, [6 x ptr], [5 x ptr] }
%struct.x264_run_level_t = type { i32, [16 x i16], [16 x i8] }

@x264_decimate_table4 = dso_local local_unnamed_addr constant <{ i8, i8, i8, i8, i8, i8, [10 x i8] }> <{ i8 3, i8 2, i8 2, i8 1, i8 1, i8 1, [10 x i8] zeroinitializer }>, align 16, !dbg !0
@x264_decimate_table8 = dso_local local_unnamed_addr constant <{ [24 x i8], [40 x i8] }> <{ [24 x i8] c"\03\03\03\03\02\02\02\02\02\02\02\02\01\01\01\01\01\01\01\01\01\01\01\01", [40 x i8] zeroinitializer }>, align 16, !dbg !57

; Function Attrs: argmemonly mustprogress nofree norecurse nosync nounwind willreturn uwtable
define dso_local void @x264_quant_init(ptr nocapture noundef readnone %h, i32 noundef %cpu, ptr noundef %pf) local_unnamed_addr #0 !dbg !74 {
entry:
  call void @llvm.dbg.value(metadata ptr %h, metadata !1368, metadata !DIExpression()), !dbg !1371
  call void @llvm.dbg.value(metadata i32 %cpu, metadata !1369, metadata !DIExpression()), !dbg !1371

!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 26, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !25, line: 42, baseType: !7)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !19, file: !18, line: 89, baseType: !27, size: 32)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !31)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 25, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !25, line: 40, baseType: !30)
!30 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!31 = !{!32}
!32 = !DISubrange(count: 2)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !19, file: !18, line: 89, baseType: !34, size: 32)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !38)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 24, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !25, line: 38, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 4)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !18, line: 90, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !18, line: 90, size: 64, elements: !43)
!43 = !{!44, !48, !50, !52}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !42, file: !18, line: 90, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 27, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !25, line: 45, baseType: !47)
!47 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !42, file: !18, line: 90, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !31)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !42, file: !18, line: 90, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !38)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !42, file: !18, line: 90, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 8)
!56 = !{!0, !57}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "x264_decimate_table8", scope: !2, file: !59, line: 166, type: !60, isLocal: false, isDefinition: true)
!59 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/quant.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b18eb31ba13b78284f51bf7313166417")
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, elements: !62)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!62 = !{!63}
!63 = !DISubrange(count: 64)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 16)
!67 = !{i32 7, !"Dwarf Version", i32 5}
!68 = !{i32 2, !"Debug Info Version", i32 3}
!69 = !{i32 1, !"wchar_size", i32 4}
!70 = !{i32 7, !"PIC Level", i32 2}
!71 = !{i32 7, !"PIE Level", i32 2}
!72 = !{i32 7, !"uwtable", i32 2}
!73 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!74 = distinct !DISubprogram(name: "x264_quant_init", scope: !59, file: !59, line: 266, type: !75, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1367)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !88, !1366}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !18, line: 381, size: 266752, elements: !81)
!81 = !{!82, !248, !252, !253, !254, !255, !256, !257, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !393, !395, !422, !424, !425, !426, !430, !434, !435, !436, !440, !444, !445, !446, !451, !454, !455, !532, !549, !710, !711, !712, !713, !717, !718, !719, !720, !721, !722, !723, !738, !931, !935, !996, !999, !1001, !1002, !1003, !1006, !1011, !1020, !1021, !1029, !1031, !1036, !1112, !1198, !1242, !1264, !1313, !1342}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !80, file: !18, line: 384, baseType: !83, size: 5632)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !79, line: 376, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !79, line: 176, size: 5632, elements: !85)
!85 = !{!86, !87, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !130, !132, !133, !134, !135, !137, !138, !153, !154, !155, !156, !157, !186, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !84, file: !79, line: 179, baseType: !7, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !84, file: !79, line: 180, baseType: !88, size: 32, offset: 32)
!88 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !84, file: !79, line: 181, baseType: !88, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !84, file: !79, line: 182, baseType: !88, size: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !84, file: !79, line: 183, baseType: !88, size: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !84, file: !79, line: 186, baseType: !88, size: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !84, file: !79, line: 187, baseType: !88, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !84, file: !79, line: 188, baseType: !88, size: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !84, file: !79, line: 189, baseType: !88, size: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !84, file: !79, line: 190, baseType: !88, size: 32, offset: 288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !84, file: !79, line: 198, baseType: !88, size: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !84, file: !79, line: 215, baseType: !99, size: 288, offset: 352)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !79, line: 200, size: 288, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !99, file: !79, line: 203, baseType: !88, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !99, file: !79, line: 204, baseType: !88, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !99, file: !79, line: 206, baseType: !88, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !99, file: !79, line: 209, baseType: !88, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !99, file: !79, line: 210, baseType: !88, size: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !99, file: !79, line: 211, baseType: !88, size: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !99, file: !79, line: 212, baseType: !88, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !99, file: !79, line: 213, baseType: !88, size: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !99, file: !79, line: 214, baseType: !88, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !84, file: !79, line: 218, baseType: !88, size: 32, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !84, file: !79, line: 219, baseType: !88, size: 32, offset: 672)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !84, file: !79, line: 220, baseType: !88, size: 32, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !84, file: !79, line: 221, baseType: !88, size: 32, offset: 736)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !84, file: !79, line: 222, baseType: !88, size: 32, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !84, file: !79, line: 224, baseType: !88, size: 32, offset: 800)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !84, file: !79, line: 225, baseType: !88, size: 32, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !84, file: !79, line: 226, baseType: !88, size: 32, offset: 864)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !84, file: !79, line: 227, baseType: !88, size: 32, offset: 896)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !84, file: !79, line: 229, baseType: !88, size: 32, offset: 928)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !84, file: !79, line: 230, baseType: !88, size: 32, offset: 960)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !84, file: !79, line: 231, baseType: !88, size: 32, offset: 992)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !84, file: !79, line: 233, baseType: !88, size: 32, offset: 1024)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !84, file: !79, line: 234, baseType: !88, size: 32, offset: 1056)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !84, file: !79, line: 236, baseType: !88, size: 32, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !84, file: !79, line: 237, baseType: !88, size: 32, offset: 1120)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !84, file: !79, line: 239, baseType: !88, size: 32, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !84, file: !79, line: 240, baseType: !128, size: 64, offset: 1216)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !84, file: !79, line: 241, baseType: !131, size: 128, offset: 1280)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !65)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !84, file: !79, line: 242, baseType: !131, size: 128, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !84, file: !79, line: 243, baseType: !131, size: 128, offset: 1536)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !84, file: !79, line: 244, baseType: !131, size: 128, offset: 1664)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !84, file: !79, line: 245, baseType: !136, size: 512, offset: 1792)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !62)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !84, file: !79, line: 246, baseType: !136, size: 512, offset: 2304)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !84, file: !79, line: 249, baseType: !139, size: 64, offset: 2816)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142, !88, !143, !145}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !147)
!147 = !{!148, !150, !151, !152}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !146, file: !149, line: 166, baseType: !7, size: 32)
!149 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/quant.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !146, file: !149, line: 166, baseType: !7, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !146, file: !149, line: 166, baseType: !142, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !146, file: !149, line: 166, baseType: !142, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !84, file: !79, line: 250, baseType: !142, size: 64, offset: 2880)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !84, file: !79, line: 251, baseType: !88, size: 32, offset: 2944)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !84, file: !79, line: 252, baseType: !88, size: 32, offset: 2976)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !84, file: !79, line: 253, baseType: !128, size: 64, offset: 3008)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !84, file: !79, line: 287, baseType: !158, size: 800, offset: 3072)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !79, line: 256, size: 800, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !180, !181, !182, !184, !185}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !158, file: !79, line: 258, baseType: !7, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !158, file: !79, line: 259, baseType: !7, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !158, file: !79, line: 261, baseType: !88, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !158, file: !79, line: 262, baseType: !88, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !158, file: !79, line: 263, baseType: !88, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !158, file: !79, line: 264, baseType: !88, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !158, file: !79, line: 265, baseType: !88, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !158, file: !79, line: 267, baseType: !88, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !158, file: !79, line: 268, baseType: !88, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !158, file: !79, line: 269, baseType: !88, size: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !158, file: !79, line: 270, baseType: !88, size: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !158, file: !79, line: 271, baseType: !88, size: 32, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !158, file: !79, line: 272, baseType: !88, size: 32, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !158, file: !79, line: 273, baseType: !88, size: 32, offset: 416)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !158, file: !79, line: 274, baseType: !88, size: 32, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !158, file: !79, line: 275, baseType: !88, size: 32, offset: 480)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !158, file: !79, line: 276, baseType: !88, size: 32, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !158, file: !79, line: 277, baseType: !88, size: 32, offset: 544)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !158, file: !79, line: 278, baseType: !179, size: 32, offset: 576)
!179 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !158, file: !79, line: 279, baseType: !179, size: 32, offset: 608)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !158, file: !79, line: 280, baseType: !88, size: 32, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !158, file: !79, line: 283, baseType: !183, size: 64, offset: 672)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 64, elements: !31)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !158, file: !79, line: 285, baseType: !88, size: 32, offset: 736)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !158, file: !79, line: 286, baseType: !88, size: 32, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !84, file: !79, line: 327, baseType: !187, size: 1152, offset: 3904)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !79, line: 290, size: 1152, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !226, !227}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !187, file: !79, line: 292, baseType: !88, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !187, file: !79, line: 294, baseType: !88, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !187, file: !79, line: 295, baseType: !88, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !187, file: !79, line: 296, baseType: !88, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !187, file: !79, line: 297, baseType: !88, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !187, file: !79, line: 299, baseType: !88, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !187, file: !79, line: 300, baseType: !179, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !187, file: !79, line: 301, baseType: !179, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !187, file: !79, line: 302, baseType: !179, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !187, file: !79, line: 303, baseType: !88, size: 32, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !187, file: !79, line: 304, baseType: !88, size: 32, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !187, file: !79, line: 305, baseType: !179, size: 32, offset: 352)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !187, file: !79, line: 306, baseType: !179, size: 32, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !187, file: !79, line: 307, baseType: !179, size: 32, offset: 416)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !187, file: !79, line: 309, baseType: !88, size: 32, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !187, file: !79, line: 310, baseType: !179, size: 32, offset: 480)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !187, file: !79, line: 311, baseType: !88, size: 32, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !187, file: !79, line: 312, baseType: !88, size: 32, offset: 544)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !187, file: !79, line: 315, baseType: !88, size: 32, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !187, file: !79, line: 316, baseType: !128, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !187, file: !79, line: 317, baseType: !88, size: 32, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !187, file: !79, line: 318, baseType: !128, size: 64, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !187, file: !79, line: 321, baseType: !179, size: 32, offset: 832)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !187, file: !79, line: 322, baseType: !179, size: 32, offset: 864)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !187, file: !79, line: 323, baseType: !179, size: 32, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !187, file: !79, line: 324, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !79, line: 174, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 167, size: 256, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !217, file: !79, line: 169, baseType: !88, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !217, file: !79, line: 169, baseType: !88, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !217, file: !79, line: 170, baseType: !88, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !217, file: !79, line: 171, baseType: !88, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !217, file: !79, line: 172, baseType: !179, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !217, file: !79, line: 173, baseType: !225, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !187, file: !79, line: 325, baseType: !88, size: 32, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !187, file: !79, line: 326, baseType: !128, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !84, file: !79, line: 330, baseType: !88, size: 32, offset: 5056)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !84, file: !79, line: 331, baseType: !88, size: 32, offset: 5088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !84, file: !79, line: 332, baseType: !88, size: 32, offset: 5120)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !84, file: !79, line: 334, baseType: !88, size: 32, offset: 5152)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !84, file: !79, line: 335, baseType: !88, size: 32, offset: 5184)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !84, file: !79, line: 336, baseType: !22, size: 32, offset: 5216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !84, file: !79, line: 337, baseType: !22, size: 32, offset: 5248)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !84, file: !79, line: 338, baseType: !22, size: 32, offset: 5280)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !84, file: !79, line: 339, baseType: !22, size: 32, offset: 5312)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !84, file: !79, line: 340, baseType: !88, size: 32, offset: 5344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !84, file: !79, line: 344, baseType: !88, size: 32, offset: 5376)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !84, file: !79, line: 356, baseType: !88, size: 32, offset: 5408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !84, file: !79, line: 364, baseType: !88, size: 32, offset: 5440)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !84, file: !79, line: 367, baseType: !88, size: 32, offset: 5472)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !84, file: !79, line: 368, baseType: !88, size: 32, offset: 5504)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !84, file: !79, line: 369, baseType: !88, size: 32, offset: 5536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !84, file: !79, line: 375, baseType: !245, size: 64, offset: 5568)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !142}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !80, file: !18, line: 386, baseType: !249, size: 8256, offset: 5632)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 8256, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 129)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !80, file: !18, line: 387, baseType: !88, size: 32, offset: 13888)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !80, file: !18, line: 388, baseType: !88, size: 32, offset: 13920)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !80, file: !18, line: 389, baseType: !88, size: 32, offset: 13952)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !80, file: !18, line: 390, baseType: !88, size: 32, offset: 13984)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !80, file: !18, line: 391, baseType: !88, size: 32, offset: 14016)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !80, file: !18, line: 402, baseType: !258, size: 576, offset: 14080)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !18, line: 394, size: 576, elements: !259)
!259 = !{!260, !261, !262, !272, !273, !274}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !258, file: !18, line: 396, baseType: !88, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !258, file: !18, line: 397, baseType: !88, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !258, file: !18, line: 398, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !79, line: 604, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 593, size: 192, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !265, file: !79, line: 595, baseType: !88, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !265, file: !79, line: 596, baseType: !88, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !265, file: !79, line: 599, baseType: !88, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !265, file: !79, line: 603, baseType: !271, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !258, file: !18, line: 399, baseType: !88, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !258, file: !18, line: 400, baseType: !271, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !258, file: !18, line: 401, baseType: !275, size: 320, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !276, line: 56, baseType: !277)
!276 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !276, line: 47, size: 320, elements: !278)
!278 = !{!279, !280, !281, !282, !286, !287}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !277, file: !276, line: 49, baseType: !271, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !277, file: !276, line: 50, baseType: !271, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !277, file: !276, line: 51, baseType: !271, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !277, file: !276, line: 53, baseType: !283, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !284, line: 87, baseType: !285)
!284 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!285 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !277, file: !276, line: 54, baseType: !88, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !277, file: !276, line: 55, baseType: !88, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !80, file: !18, line: 404, baseType: !271, size: 64, offset: 14656)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !80, file: !18, line: 405, baseType: !88, size: 32, offset: 14720)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !80, file: !18, line: 410, baseType: !88, size: 32, offset: 14752)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !80, file: !18, line: 411, baseType: !88, size: 32, offset: 14784)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !80, file: !18, line: 413, baseType: !88, size: 32, offset: 14816)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !80, file: !18, line: 415, baseType: !88, size: 32, offset: 14848)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !80, file: !18, line: 416, baseType: !88, size: 32, offset: 14880)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !80, file: !18, line: 418, baseType: !88, size: 32, offset: 14912)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !80, file: !18, line: 419, baseType: !88, size: 32, offset: 14944)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !80, file: !18, line: 420, baseType: !88, size: 32, offset: 14976)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !80, file: !18, line: 421, baseType: !88, size: 32, offset: 15008)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !80, file: !18, line: 422, baseType: !88, size: 32, offset: 15040)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !80, file: !18, line: 424, baseType: !88, size: 32, offset: 15072)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !80, file: !18, line: 425, baseType: !88, size: 32, offset: 15104)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !80, file: !18, line: 427, baseType: !88, size: 32, offset: 15136)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !80, file: !18, line: 430, baseType: !304, size: 10400, offset: 15168)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 10400, elements: !391)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !306, line: 154, baseType: !307)
!306 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 52, size: 10400, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !326, !327, !328, !329, !330, !331, !332, !333, !334, !341, !342, !390}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !307, file: !306, line: 54, baseType: !88, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !307, file: !306, line: 56, baseType: !88, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !307, file: !306, line: 57, baseType: !88, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !307, file: !306, line: 59, baseType: !88, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !307, file: !306, line: 60, baseType: !88, size: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !307, file: !306, line: 61, baseType: !88, size: 32, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !307, file: !306, line: 63, baseType: !88, size: 32, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !307, file: !306, line: 65, baseType: !88, size: 32, offset: 224)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !307, file: !306, line: 67, baseType: !88, size: 32, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !307, file: !306, line: 69, baseType: !88, size: 32, offset: 288)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !307, file: !306, line: 70, baseType: !88, size: 32, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !307, file: !306, line: 71, baseType: !88, size: 32, offset: 352)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !307, file: !306, line: 72, baseType: !88, size: 32, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !307, file: !306, line: 73, baseType: !323, size: 8192, offset: 416)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8192, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !307, file: !306, line: 75, baseType: !88, size: 32, offset: 8608)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !307, file: !306, line: 76, baseType: !88, size: 32, offset: 8640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !307, file: !306, line: 77, baseType: !88, size: 32, offset: 8672)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !307, file: !306, line: 78, baseType: !88, size: 32, offset: 8704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !307, file: !306, line: 79, baseType: !88, size: 32, offset: 8736)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !307, file: !306, line: 80, baseType: !88, size: 32, offset: 8768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !307, file: !306, line: 81, baseType: !88, size: 32, offset: 8800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !307, file: !306, line: 83, baseType: !88, size: 32, offset: 8832)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !307, file: !306, line: 90, baseType: !335, size: 128, offset: 8864)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !306, line: 84, size: 128, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !335, file: !306, line: 86, baseType: !88, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !335, file: !306, line: 87, baseType: !88, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !335, file: !306, line: 88, baseType: !88, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !335, file: !306, line: 89, baseType: !88, size: 32, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !307, file: !306, line: 92, baseType: !88, size: 32, offset: 8992)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !307, file: !306, line: 150, baseType: !343, size: 1344, offset: 9024)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !306, line: 93, size: 1344, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !343, file: !306, line: 95, baseType: !88, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !343, file: !306, line: 96, baseType: !88, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !343, file: !306, line: 97, baseType: !88, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !343, file: !306, line: 99, baseType: !88, size: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !343, file: !306, line: 100, baseType: !88, size: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !343, file: !306, line: 102, baseType: !88, size: 32, offset: 160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !343, file: !306, line: 103, baseType: !88, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !343, file: !306, line: 104, baseType: !88, size: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !343, file: !306, line: 105, baseType: !88, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !343, file: !306, line: 106, baseType: !88, size: 32, offset: 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !343, file: !306, line: 107, baseType: !88, size: 32, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !343, file: !306, line: 108, baseType: !88, size: 32, offset: 352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !343, file: !306, line: 110, baseType: !88, size: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !343, file: !306, line: 111, baseType: !88, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !343, file: !306, line: 112, baseType: !88, size: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !343, file: !306, line: 114, baseType: !88, size: 32, offset: 480)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !343, file: !306, line: 115, baseType: !22, size: 32, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !343, file: !306, line: 116, baseType: !22, size: 32, offset: 544)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !343, file: !306, line: 117, baseType: !88, size: 32, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !343, file: !306, line: 119, baseType: !88, size: 32, offset: 608)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !343, file: !306, line: 120, baseType: !88, size: 32, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !343, file: !306, line: 137, baseType: !367, size: 384, offset: 672)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !343, file: !306, line: 122, size: 384, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !367, file: !306, line: 124, baseType: !88, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !367, file: !306, line: 125, baseType: !88, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !367, file: !306, line: 126, baseType: !88, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !367, file: !306, line: 127, baseType: !88, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !367, file: !306, line: 128, baseType: !88, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !367, file: !306, line: 129, baseType: !88, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !367, file: !306, line: 130, baseType: !88, size: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !367, file: !306, line: 131, baseType: !88, size: 32, offset: 224)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !367, file: !306, line: 133, baseType: !88, size: 32, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !367, file: !306, line: 134, baseType: !88, size: 32, offset: 288)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !367, file: !306, line: 135, baseType: !88, size: 32, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !367, file: !306, line: 136, baseType: !88, size: 32, offset: 352)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !343, file: !306, line: 139, baseType: !88, size: 32, offset: 1056)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !343, file: !306, line: 140, baseType: !88, size: 32, offset: 1088)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !343, file: !306, line: 141, baseType: !88, size: 32, offset: 1120)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !343, file: !306, line: 142, baseType: !88, size: 32, offset: 1152)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !343, file: !306, line: 143, baseType: !88, size: 32, offset: 1184)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !343, file: !306, line: 144, baseType: !88, size: 32, offset: 1216)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !343, file: !306, line: 145, baseType: !88, size: 32, offset: 1248)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !343, file: !306, line: 146, baseType: !88, size: 32, offset: 1280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !343, file: !306, line: 147, baseType: !88, size: 32, offset: 1312)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !307, file: !306, line: 152, baseType: !88, size: 32, offset: 10368)
!391 = !{!392}
!392 = !DISubrange(count: 1)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !80, file: !18, line: 431, baseType: !394, size: 64, offset: 25600)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !80, file: !18, line: 432, baseType: !396, size: 960, offset: 25664)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 960, elements: !391)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !306, line: 186, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 156, size: 960, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !398, file: !306, line: 158, baseType: !88, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !398, file: !306, line: 159, baseType: !88, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !398, file: !306, line: 161, baseType: !88, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !398, file: !306, line: 163, baseType: !88, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !398, file: !306, line: 164, baseType: !88, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !398, file: !306, line: 166, baseType: !88, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !398, file: !306, line: 167, baseType: !88, size: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !398, file: !306, line: 169, baseType: !88, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !398, file: !306, line: 170, baseType: !88, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !398, file: !306, line: 172, baseType: !88, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !398, file: !306, line: 173, baseType: !88, size: 32, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !398, file: !306, line: 175, baseType: !88, size: 32, offset: 352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !398, file: !306, line: 177, baseType: !88, size: 32, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !398, file: !306, line: 178, baseType: !88, size: 32, offset: 416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !398, file: !306, line: 179, baseType: !88, size: 32, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !398, file: !306, line: 181, baseType: !88, size: 32, offset: 480)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !398, file: !306, line: 183, baseType: !88, size: 32, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !398, file: !306, line: 184, baseType: !418, size: 384, offset: 576)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 384, elements: !420)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!420 = !{!421}
!421 = !DISubrange(count: 6)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !80, file: !18, line: 433, baseType: !423, size: 64, offset: 26624)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !80, file: !18, line: 434, baseType: !88, size: 32, offset: 26688)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !80, file: !18, line: 437, baseType: !88, size: 32, offset: 26720)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !80, file: !18, line: 440, baseType: !427, size: 256, offset: 26752)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 256, elements: !38)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 512, elements: !65)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !80, file: !18, line: 441, baseType: !431, size: 128, offset: 27008)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 128, elements: !31)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2048, elements: !62)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !80, file: !18, line: 443, baseType: !427, size: 256, offset: 27136)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !80, file: !18, line: 444, baseType: !431, size: 128, offset: 27392)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !80, file: !18, line: 446, baseType: !437, size: 256, offset: 27520)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 256, elements: !38)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, elements: !65)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !80, file: !18, line: 447, baseType: !441, size: 128, offset: 27776)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 128, elements: !31)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1024, elements: !62)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !80, file: !18, line: 448, baseType: !437, size: 256, offset: 27904)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !80, file: !18, line: 449, baseType: !441, size: 128, offset: 28160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !80, file: !18, line: 454, baseType: !447, size: 5888, offset: 28288)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 5888, elements: !449)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!449 = !{!450}
!450 = !DISubrange(count: 92)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !80, file: !18, line: 455, baseType: !452, size: 23552, offset: 34176)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 23552, elements: !453)
!453 = !{!450, !39}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !80, file: !18, line: 457, baseType: !419, size: 64, offset: 57728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !80, file: !18, line: 460, baseType: !456, size: 53376, offset: 57856)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !18, line: 364, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 302, size: 53376, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !487, !516, !517, !518, !524, !525, !526, !527, !528, !529, !530, !531}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !457, file: !18, line: 304, baseType: !394, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !457, file: !18, line: 305, baseType: !423, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !457, file: !18, line: 307, baseType: !88, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !457, file: !18, line: 308, baseType: !88, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !457, file: !18, line: 309, baseType: !88, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !457, file: !18, line: 311, baseType: !88, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !457, file: !18, line: 313, baseType: !88, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !457, file: !18, line: 315, baseType: !88, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !457, file: !18, line: 316, baseType: !88, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !457, file: !18, line: 317, baseType: !88, size: 32, offset: 352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !457, file: !18, line: 319, baseType: !88, size: 32, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !457, file: !18, line: 321, baseType: !88, size: 32, offset: 416)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !457, file: !18, line: 322, baseType: !88, size: 32, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !457, file: !18, line: 324, baseType: !183, size: 64, offset: 480)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !457, file: !18, line: 325, baseType: !88, size: 32, offset: 544)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !457, file: !18, line: 327, baseType: !88, size: 32, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !457, file: !18, line: 329, baseType: !88, size: 32, offset: 608)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !457, file: !18, line: 330, baseType: !88, size: 32, offset: 640)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !457, file: !18, line: 331, baseType: !88, size: 32, offset: 672)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !457, file: !18, line: 333, baseType: !88, size: 32, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !457, file: !18, line: 334, baseType: !88, size: 32, offset: 736)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !457, file: !18, line: 339, baseType: !481, size: 2048, offset: 768)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 2048, elements: !486)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !457, file: !18, line: 335, size: 64, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !482, file: !18, line: 337, baseType: !88, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !482, file: !18, line: 338, baseType: !88, size: 32, offset: 32)
!486 = !{!32, !66}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !457, file: !18, line: 342, baseType: !488, size: 49152, align: 128, offset: 2816)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 49152, align: 128, elements: !513)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !490, line: 36, baseType: !491, align: 128)
!490 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !490, line: 26, size: 512, elements: !492)
!492 = !{!493, !499, !500, !503, !504, !505}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !491, file: !490, line: 30, baseType: !494, size: 128, align: 128)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 128, elements: !54)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !496, line: 25, baseType: !497)
!496 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !25, line: 39, baseType: !498)
!498 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !491, file: !490, line: 31, baseType: !494, size: 128, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !491, file: !490, line: 32, baseType: !501, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !496, line: 26, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !25, line: 41, baseType: !88)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !491, file: !490, line: 33, baseType: !501, size: 32, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !491, file: !490, line: 34, baseType: !501, size: 32, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !491, file: !490, line: 35, baseType: !506, size: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !490, line: 25, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !271, !88, !271, !88, !511, !88}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!513 = !{!514, !515}
!514 = !DISubrange(count: 32)
!515 = !DISubrange(count: 3)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !457, file: !18, line: 344, baseType: !88, size: 32, offset: 51968)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !457, file: !18, line: 345, baseType: !88, size: 32, offset: 52000)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !457, file: !18, line: 350, baseType: !519, size: 1024, offset: 52032)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 1024, elements: !65)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !457, file: !18, line: 346, size: 64, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !520, file: !18, line: 348, baseType: !88, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !520, file: !18, line: 349, baseType: !88, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !457, file: !18, line: 352, baseType: !88, size: 32, offset: 53056)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !457, file: !18, line: 354, baseType: !88, size: 32, offset: 53088)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !457, file: !18, line: 355, baseType: !88, size: 32, offset: 53120)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !457, file: !18, line: 356, baseType: !88, size: 32, offset: 53152)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !457, file: !18, line: 357, baseType: !88, size: 32, offset: 53184)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !457, file: !18, line: 360, baseType: !88, size: 32, offset: 53216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !457, file: !18, line: 361, baseType: !88, size: 32, offset: 53248)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !457, file: !18, line: 362, baseType: !88, size: 32, offset: 53280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !80, file: !18, line: 463, baseType: !533, size: 4096, offset: 111232)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !534, line: 46, baseType: !535)
!534 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !534, line: 27, size: 4096, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !535, file: !534, line: 30, baseType: !88, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !535, file: !534, line: 31, baseType: !88, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !535, file: !534, line: 34, baseType: !88, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !535, file: !534, line: 35, baseType: !88, size: 32, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !535, file: !534, line: 37, baseType: !271, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !535, file: !534, line: 38, baseType: !271, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !535, file: !534, line: 39, baseType: !271, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !535, file: !534, line: 42, baseType: !88, size: 32, align: 128, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !535, file: !534, line: 45, baseType: !546, size: 3680, offset: 416)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 3680, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 460)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !80, file: !18, line: 494, baseType: !550, size: 2112, offset: 115328)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !18, line: 465, size: 2112, elements: !551)
!551 = !{!552, !690, !692, !693, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !706, !707, !708, !709}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !550, file: !18, line: 468, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !556, line: 146, baseType: !557)
!556 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !556, line: 31, size: 125056, elements: !558)
!558 = !{!559, !560, !561, !562, !565, !566, !567, !568, !569, !570, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !589, !590, !591, !592, !593, !594, !596, !598, !599, !600, !601, !602, !605, !607, !608, !610, !615, !616, !620, !621, !625, !629, !632, !634, !635, !637, !638, !640, !641, !642, !645, !647, !648, !649, !651, !652, !653, !654, !655, !656, !657, !658, !660, !661, !662, !671, !675, !677, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !557, file: !556, line: 34, baseType: !88, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !557, file: !556, line: 35, baseType: !88, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !557, file: !556, line: 36, baseType: !88, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !557, file: !556, line: 37, baseType: !563, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !496, line: 27, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !25, line: 44, baseType: !285)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !557, file: !556, line: 38, baseType: !563, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !557, file: !556, line: 39, baseType: !88, size: 32, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !557, file: !556, line: 40, baseType: !88, size: 32, offset: 288)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !557, file: !556, line: 41, baseType: !88, size: 32, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !557, file: !556, line: 42, baseType: !88, size: 32, offset: 352)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !557, file: !556, line: 43, baseType: !571, size: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !557, file: !556, line: 45, baseType: !88, size: 32, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !557, file: !556, line: 46, baseType: !88, size: 32, offset: 480)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !557, file: !556, line: 47, baseType: !88, size: 32, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !557, file: !556, line: 48, baseType: !88, size: 32, offset: 544)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !557, file: !556, line: 49, baseType: !88, size: 32, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !557, file: !556, line: 50, baseType: !88, size: 32, offset: 608)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !557, file: !556, line: 51, baseType: !88, size: 32, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !557, file: !556, line: 52, baseType: !35, size: 8, offset: 672)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !557, file: !556, line: 53, baseType: !35, size: 8, offset: 680)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !557, file: !556, line: 54, baseType: !35, size: 8, offset: 688)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !557, file: !556, line: 55, baseType: !179, size: 32, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !557, file: !556, line: 56, baseType: !179, size: 32, offset: 736)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !557, file: !556, line: 57, baseType: !88, size: 32, offset: 768)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !557, file: !556, line: 60, baseType: !88, size: 32, offset: 800)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !557, file: !556, line: 61, baseType: !587, size: 96, offset: 832)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 96, elements: !588)
!588 = !{!515}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !557, file: !556, line: 62, baseType: !587, size: 96, offset: 928)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !557, file: !556, line: 63, baseType: !587, size: 96, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !557, file: !556, line: 64, baseType: !88, size: 32, offset: 1120)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !557, file: !556, line: 65, baseType: !88, size: 32, offset: 1152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !557, file: !556, line: 66, baseType: !88, size: 32, offset: 1184)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !557, file: !556, line: 67, baseType: !595, size: 192, offset: 1216)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 192, elements: !588)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !557, file: !556, line: 68, baseType: !597, size: 256, offset: 1408)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 256, elements: !38)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !557, file: !556, line: 69, baseType: !597, size: 256, offset: 1664)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !557, file: !556, line: 70, baseType: !448, size: 64, offset: 1920)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !557, file: !556, line: 74, baseType: !597, size: 256, offset: 1984)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !557, file: !556, line: 75, baseType: !597, size: 256, offset: 2240)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !557, file: !556, line: 77, baseType: !603, size: 24576, align: 128, offset: 2560)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 24576, align: 128, elements: !604)
!604 = !{!66, !515}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !557, file: !556, line: 78, baseType: !606, size: 1024, offset: 27136)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 1024, elements: !65)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !557, file: !556, line: 79, baseType: !88, size: 32, offset: 28160)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !557, file: !556, line: 80, baseType: !609, size: 64, offset: 28224)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !557, file: !556, line: 83, baseType: !611, size: 64, offset: 28288)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !496, line: 24, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !25, line: 37, baseType: !614)
!614 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !557, file: !556, line: 84, baseType: !271, size: 64, offset: 28352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !557, file: !556, line: 85, baseType: !617, size: 128, offset: 28416)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 128, elements: !31)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 32, elements: !31)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !557, file: !556, line: 86, baseType: !618, size: 64, offset: 28544)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !557, file: !556, line: 87, baseType: !622, size: 2176, offset: 28608)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 2176, elements: !623)
!623 = !{!32, !624}
!624 = !DISubrange(count: 17)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !557, file: !556, line: 92, baseType: !626, size: 20736, offset: 30784)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 20736, elements: !627)
!627 = !{!628, !628}
!628 = !DISubrange(count: 18)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !557, file: !556, line: 96, baseType: !630, size: 2176, offset: 51520)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 2176, elements: !623)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !557, file: !556, line: 97, baseType: !633, size: 128, offset: 53696)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 128, elements: !31)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !557, file: !556, line: 98, baseType: !183, size: 64, offset: 53824)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !557, file: !556, line: 99, baseType: !636, size: 1024, offset: 53888)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 1024, elements: !486)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !557, file: !556, line: 100, baseType: !619, size: 32, offset: 54912)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !557, file: !556, line: 105, baseType: !639, size: 10368, offset: 54944)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 10368, elements: !627)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !557, file: !556, line: 106, baseType: !639, size: 10368, offset: 65312)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !557, file: !556, line: 107, baseType: !88, size: 32, offset: 75680)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !557, file: !556, line: 108, baseType: !643, size: 576, offset: 75712)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 576, elements: !644)
!644 = !{!628}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !557, file: !556, line: 109, baseType: !646, size: 20736, offset: 76288)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 20736, elements: !627)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !557, file: !556, line: 110, baseType: !631, size: 64, offset: 97024)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !557, file: !556, line: 111, baseType: !631, size: 64, offset: 97088)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !557, file: !556, line: 112, baseType: !650, size: 64, offset: 97152)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !557, file: !556, line: 113, baseType: !650, size: 64, offset: 97216)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !557, file: !556, line: 114, baseType: !650, size: 64, offset: 97280)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !557, file: !556, line: 115, baseType: !88, size: 32, offset: 97344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !557, file: !556, line: 116, baseType: !448, size: 64, offset: 97408)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !557, file: !556, line: 117, baseType: !448, size: 64, offset: 97472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !557, file: !556, line: 118, baseType: !448, size: 64, offset: 97536)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !557, file: !556, line: 119, baseType: !88, size: 32, offset: 97600)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !557, file: !556, line: 120, baseType: !659, size: 576, offset: 97632)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 576, elements: !644)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !557, file: !556, line: 121, baseType: !22, size: 32, offset: 98208)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !557, file: !556, line: 122, baseType: !45, size: 64, offset: 98240)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !557, file: !556, line: 125, baseType: !663, size: 256, offset: 98304)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !79, line: 503, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 496, size: 256, elements: !665)
!665 = !{!666, !668, !669, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !664, file: !79, line: 498, baseType: !667, size: 64)
!667 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !664, file: !79, line: 499, baseType: !667, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !664, file: !79, line: 500, baseType: !667, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !664, file: !79, line: 502, baseType: !667, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !557, file: !556, line: 128, baseType: !672, size: 2008, offset: 98560)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2008, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 251)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !557, file: !556, line: 129, baseType: !676, size: 8032, offset: 100576)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8032, elements: !673)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !557, file: !556, line: 130, baseType: !678, size: 16064, offset: 108608)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 16064, elements: !673)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !557, file: !556, line: 131, baseType: !88, size: 32, offset: 124672)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !557, file: !556, line: 132, baseType: !88, size: 32, offset: 124704)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !557, file: !556, line: 135, baseType: !88, size: 32, offset: 124736)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !557, file: !556, line: 136, baseType: !88, size: 32, offset: 124768)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !557, file: !556, line: 137, baseType: !88, size: 32, offset: 124800)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !557, file: !556, line: 138, baseType: !88, size: 32, offset: 124832)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !557, file: !556, line: 139, baseType: !88, size: 32, offset: 124864)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !557, file: !556, line: 142, baseType: !179, size: 32, offset: 124896)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !557, file: !556, line: 143, baseType: !88, size: 32, offset: 124928)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !557, file: !556, line: 144, baseType: !88, size: 32, offset: 124960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !557, file: !556, line: 145, baseType: !88, size: 32, offset: 124992)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !550, file: !18, line: 470, baseType: !691, size: 128, offset: 64)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 128, elements: !31)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !550, file: !18, line: 473, baseType: !553, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !550, file: !18, line: 476, baseType: !694, size: 1152, offset: 256)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 1152, elements: !644)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !550, file: !18, line: 478, baseType: !88, size: 32, offset: 1408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !550, file: !18, line: 480, baseType: !88, size: 32, offset: 1440)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !550, file: !18, line: 482, baseType: !88, size: 32, offset: 1472)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !550, file: !18, line: 483, baseType: !88, size: 32, offset: 1504)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !550, file: !18, line: 484, baseType: !88, size: 32, offset: 1536)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !550, file: !18, line: 485, baseType: !88, size: 32, offset: 1568)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !550, file: !18, line: 486, baseType: !88, size: 32, offset: 1600)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !550, file: !18, line: 487, baseType: !563, size: 64, offset: 1664)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !550, file: !18, line: 488, baseType: !563, size: 64, offset: 1728)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !550, file: !18, line: 489, baseType: !705, size: 128, offset: 1792)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 128, elements: !31)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !550, file: !18, line: 490, baseType: !563, size: 64, offset: 1920)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !550, file: !18, line: 491, baseType: !563, size: 64, offset: 1984)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !550, file: !18, line: 492, baseType: !88, size: 32, offset: 2048)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !550, file: !18, line: 493, baseType: !88, size: 32, offset: 2080)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !80, file: !18, line: 497, baseType: !554, size: 64, offset: 117440)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !80, file: !18, line: 500, baseType: !554, size: 64, offset: 117504)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !80, file: !18, line: 503, baseType: !88, size: 32, offset: 117568)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !80, file: !18, line: 504, baseType: !714, size: 1216, offset: 117632)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 1216, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 19)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !80, file: !18, line: 505, baseType: !88, size: 32, offset: 118848)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !80, file: !18, line: 506, baseType: !714, size: 1216, offset: 118912)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !80, file: !18, line: 507, baseType: !183, size: 64, offset: 120128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !80, file: !18, line: 510, baseType: !88, size: 32, offset: 120192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !80, file: !18, line: 511, baseType: !88, size: 32, offset: 120224)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !80, file: !18, line: 512, baseType: !563, size: 64, offset: 120256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !80, file: !18, line: 522, baseType: !724, size: 10624, offset: 120320)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !18, line: 515, size: 10624, elements: !725)
!725 = !{!726, !728, !731, !734}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !724, file: !18, line: 517, baseType: !727, size: 256, align: 128)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 256, elements: !65)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !724, file: !18, line: 518, baseType: !729, size: 128, align: 128, offset: 256)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 128, elements: !730)
!730 = !{!32, !39}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !724, file: !18, line: 520, baseType: !732, size: 4096, align: 128, offset: 384)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 4096, elements: !733)
!733 = !{!39, !63}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !724, file: !18, line: 521, baseType: !735, size: 6144, align: 128, offset: 4480)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 6144, elements: !736)
!736 = !{!737, !66}
!737 = !DISubrange(count: 24)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !80, file: !18, line: 732, baseType: !739, size: 82688, offset: 130944)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !18, line: 525, size: 82688, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !768, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !786, !789, !793, !794, !795, !800, !801, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !869, !900, !901, !902, !903, !904, !905, !906, !907, !908, !911, !912, !913, !916, !919, !921, !924, !926, !927}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !739, file: !18, line: 527, baseType: !88, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !739, file: !18, line: 530, baseType: !88, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !739, file: !18, line: 531, baseType: !88, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !739, file: !18, line: 532, baseType: !88, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !739, file: !18, line: 535, baseType: !88, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !739, file: !18, line: 536, baseType: !88, size: 32, offset: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !739, file: !18, line: 537, baseType: !88, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !739, file: !18, line: 538, baseType: !88, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !739, file: !18, line: 539, baseType: !88, size: 32, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !739, file: !18, line: 542, baseType: !88, size: 32, offset: 288)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !739, file: !18, line: 543, baseType: !88, size: 32, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !739, file: !18, line: 544, baseType: !88, size: 32, offset: 352)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !739, file: !18, line: 545, baseType: !88, size: 32, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !739, file: !18, line: 546, baseType: !88, size: 32, offset: 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !739, file: !18, line: 547, baseType: !88, size: 32, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !739, file: !18, line: 548, baseType: !88, size: 32, offset: 480)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !739, file: !18, line: 549, baseType: !88, size: 32, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !739, file: !18, line: 551, baseType: !88, size: 32, offset: 544)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !739, file: !18, line: 554, baseType: !183, size: 64, offset: 576)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !739, file: !18, line: 555, baseType: !183, size: 64, offset: 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !739, file: !18, line: 558, baseType: !183, size: 64, offset: 704)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !739, file: !18, line: 559, baseType: !183, size: 64, offset: 768)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !739, file: !18, line: 561, baseType: !183, size: 64, offset: 832)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !739, file: !18, line: 562, baseType: !183, size: 64, offset: 896)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !739, file: !18, line: 565, baseType: !7, size: 32, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !739, file: !18, line: 566, baseType: !767, size: 128, offset: 992)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !38)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !739, file: !18, line: 567, baseType: !769, size: 512, offset: 1120)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !65)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !739, file: !18, line: 568, baseType: !7, size: 32, offset: 1632)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !739, file: !18, line: 569, baseType: !7, size: 32, offset: 1664)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !739, file: !18, line: 570, baseType: !88, size: 32, offset: 1696)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !739, file: !18, line: 571, baseType: !88, size: 32, offset: 1728)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !739, file: !18, line: 572, baseType: !88, size: 32, offset: 1760)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !739, file: !18, line: 573, baseType: !88, size: 32, offset: 1792)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !739, file: !18, line: 574, baseType: !88, size: 32, offset: 1824)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !739, file: !18, line: 575, baseType: !88, size: 32, offset: 1856)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !739, file: !18, line: 576, baseType: !88, size: 32, offset: 1888)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !739, file: !18, line: 577, baseType: !88, size: 32, offset: 1920)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !739, file: !18, line: 578, baseType: !88, size: 32, offset: 1952)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !739, file: !18, line: 585, baseType: !611, size: 64, offset: 1984)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !739, file: !18, line: 586, baseType: !271, size: 64, offset: 2048)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !739, file: !18, line: 587, baseType: !611, size: 64, offset: 2112)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !739, file: !18, line: 588, baseType: !785, size: 64, offset: 2176)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !739, file: !18, line: 589, baseType: !787, size: 64, offset: 2240)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 64, elements: !54)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !739, file: !18, line: 591, baseType: !790, size: 64, offset: 2304)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, elements: !792)
!792 = !{!737}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !739, file: !18, line: 592, baseType: !611, size: 64, offset: 2368)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !739, file: !18, line: 593, baseType: !617, size: 128, offset: 2432)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !739, file: !18, line: 594, baseType: !796, size: 128, offset: 2560)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 128, elements: !31)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !799)
!799 = !{!55, !32}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !739, file: !18, line: 595, baseType: !633, size: 128, offset: 2688)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !739, file: !18, line: 596, baseType: !802, size: 4096, offset: 2816)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 4096, elements: !803)
!803 = !{!32, !514}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !739, file: !18, line: 597, baseType: !611, size: 64, offset: 6912)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !739, file: !18, line: 598, baseType: !611, size: 64, offset: 6976)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !739, file: !18, line: 599, baseType: !448, size: 64, offset: 7040)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !739, file: !18, line: 603, baseType: !606, size: 1024, offset: 7104)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !739, file: !18, line: 606, baseType: !88, size: 32, offset: 8128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !739, file: !18, line: 607, baseType: !88, size: 32, offset: 8160)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !739, file: !18, line: 608, baseType: !34, size: 32, align: 32, offset: 8192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !739, file: !18, line: 609, baseType: !88, size: 32, offset: 8224)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !739, file: !18, line: 611, baseType: !88, size: 32, offset: 8256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !739, file: !18, line: 612, baseType: !88, size: 32, offset: 8288)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !739, file: !18, line: 614, baseType: !88, size: 32, offset: 8320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !739, file: !18, line: 615, baseType: !88, size: 32, offset: 8352)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !739, file: !18, line: 621, baseType: !88, size: 32, offset: 8384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !739, file: !18, line: 624, baseType: !88, size: 32, offset: 8416)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !739, file: !18, line: 626, baseType: !88, size: 32, offset: 8448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !739, file: !18, line: 627, baseType: !88, size: 32, offset: 8480)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !739, file: !18, line: 671, baseType: !821, size: 60672, offset: 8576)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !739, file: !18, line: 629, size: 60672, elements: !822)
!822 = !{!823, !827, !831, !833, !834, !837, !841, !843, !844, !845, !846, !847, !850, !854, !857, !858, !859, !860, !861, !864, !866, !868}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !821, file: !18, line: 634, baseType: !824, size: 3072, align: 128)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 3072, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 384)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !821, file: !18, line: 635, baseType: !828, size: 6912, align: 128, offset: 3072)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 6912, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 864)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !821, file: !18, line: 638, baseType: !832, size: 2048, align: 128, offset: 9984)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !324)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !821, file: !18, line: 639, baseType: !832, size: 2048, align: 128, offset: 12032)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !821, file: !18, line: 640, baseType: !835, size: 3072, align: 128, offset: 14080)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 3072, elements: !836)
!836 = !{!515, !63}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !821, file: !18, line: 641, baseType: !838, size: 3840, align: 128, offset: 17152)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 3840, elements: !839)
!839 = !{!840, !66}
!840 = !DISubrange(count: 15)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !821, file: !18, line: 642, baseType: !842, size: 128, offset: 20992)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !38)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !821, file: !18, line: 643, baseType: !842, size: 128, offset: 21120)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !821, file: !18, line: 644, baseType: !88, size: 32, offset: 21248)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !821, file: !18, line: 645, baseType: !88, size: 32, offset: 21280)
