; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/quantum.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/quantum.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._QuantumInfo = type { i64, i64, i32, double, double, double, i64, i32, i32, i32, i64, ptr, i64, i32, %struct._QuantumState, ptr, i64 }
%struct._QuantumState = type { double, i32, i64, ptr }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mask", scope: !2, file: !3, line: 572, type: !999, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ResetQuantumState", scope: !3, file: !3, line: 570, type: !4, scopeLine: 571, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !75, retainedNodes: !997)
!3 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2992c7f8f08cf858917506a7de0f08b2")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumInfo", file: !8, line: 85, baseType: !9)
!8 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1f6eaed79d9a4eaf712cd066f6ff022a")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumInfo", file: !10, line: 42, size: 1216, elements: !11)
!10 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!11 = !{!12, !16, !17, !26, !28, !29, !30, !31, !38, !39, !46, !47, !51, !52, !59, !69, !74}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !9, file: !10, line: 45, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 46, baseType: !15)
!14 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!15 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !9, file: !10, line: 46, baseType: !13, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !9, file: !10, line: 49, baseType: !18, size: 32, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumFormatType", file: !8, line: 50, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 44, baseType: !20, size: 32, elements: !21)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "UndefinedQuantumFormat", value: 0)
!23 = !DIEnumerator(name: "FloatingPointQuantumFormat", value: 1)
!24 = !DIEnumerator(name: "SignedQuantumFormat", value: 2)
!25 = !DIEnumerator(name: "UnsignedQuantumFormat", value: 3)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !9, file: !10, line: 52, baseType: !27, size: 64, offset: 192)
!27 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !9, file: !10, line: 53, baseType: !27, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !9, file: !10, line: 54, baseType: !27, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !9, file: !10, line: 57, baseType: !13, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "min_is_white", scope: !9, file: !10, line: 60, baseType: !32, size: 32, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !33, line: 215, baseType: !34)
!33 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 211, baseType: !20, size: 32, elements: !35)
!35 = !{!36, !37}
!36 = !DIEnumerator(name: "MagickFalse", value: 0)
!37 = !DIEnumerator(name: "MagickTrue", value: 1)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !9, file: !10, line: 61, baseType: !32, size: 32, offset: 480)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_type", scope: !9, file: !10, line: 64, baseType: !40, size: 32, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAlphaType", file: !8, line: 42, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 37, baseType: !20, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "UndefinedQuantumAlpha", value: 0)
!44 = !DIEnumerator(name: "AssociatedQuantumAlpha", value: 1)
!45 = !DIEnumerator(name: "DisassociatedQuantumAlpha", value: 2)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !9, file: !10, line: 67, baseType: !13, size: 64, offset: 576)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !9, file: !10, line: 70, baseType: !48, size: 64, offset: 640)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !9, file: !10, line: 73, baseType: !13, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !9, file: !10, line: 76, baseType: !53, size: 32, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !8, line: 35, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 30, baseType: !20, size: 32, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "UndefinedEndian", value: 0)
!57 = !DIEnumerator(name: "LSBEndian", value: 1)
!58 = !DIEnumerator(name: "MSBEndian", value: 2)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !9, file: !10, line: 79, baseType: !60, size: 256, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumState", file: !10, line: 40, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumState", file: !10, line: 27, size: 256, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_scale", scope: !61, file: !10, line: 30, baseType: !27, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !61, file: !10, line: 33, baseType: !20, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !61, file: !10, line: 36, baseType: !13, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !61, file: !10, line: 39, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !9, file: !10, line: 82, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !72, line: 26, baseType: !73)
!72 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !72, line: 25, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !9, file: !10, line: 85, baseType: !13, size: 64, offset: 1152)
!75 = distinct !DICompileUnit(language: DW_LANG_C99, file: !76, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !650, globals: !996, splitDebugInlining: false, nameTableKind: None)
!76 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/quantum.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r", checksumkind: CSK_MD5, checksum: "2992c7f8f08cf858917506a7de0f08b2")
!77 = !{!19, !34, !41, !54, !78, !103, !115, !125, !130, !167, !181, !214, !236, !241, !249, !284, !299, !370, !378, !384, !457, !474, !486, !507, !537, !613, !638}
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 25, baseType: !20, size: 32, elements: !80)
!79 = !DIFile(filename: "apps/538.imagick_r/src/magick/compress.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "359677d10ff2e6d05d86b0a6c5af7465")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!81 = !DIEnumerator(name: "UndefinedCompression", value: 0)
!82 = !DIEnumerator(name: "NoCompression", value: 1)
!83 = !DIEnumerator(name: "BZipCompression", value: 2)
!84 = !DIEnumerator(name: "DXT1Compression", value: 3)
!85 = !DIEnumerator(name: "DXT3Compression", value: 4)
!86 = !DIEnumerator(name: "DXT5Compression", value: 5)
!87 = !DIEnumerator(name: "FaxCompression", value: 6)
!88 = !DIEnumerator(name: "Group4Compression", value: 7)
!89 = !DIEnumerator(name: "JPEGCompression", value: 8)
!90 = !DIEnumerator(name: "JPEG2000Compression", value: 9)
!91 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10)
!92 = !DIEnumerator(name: "LZWCompression", value: 11)
!93 = !DIEnumerator(name: "RLECompression", value: 12)
!94 = !DIEnumerator(name: "ZipCompression", value: 13)
!95 = !DIEnumerator(name: "ZipSCompression", value: 14)
!96 = !DIEnumerator(name: "PizCompression", value: 15)
!97 = !DIEnumerator(name: "Pxr24Compression", value: 16)
!98 = !DIEnumerator(name: "B44Compression", value: 17)
!99 = !DIEnumerator(name: "B44ACompression", value: 18)
!100 = !DIEnumerator(name: "LZMACompression", value: 19)
!101 = !DIEnumerator(name: "JBIG1Compression", value: 20)
!102 = !DIEnumerator(name: "JBIG2Compression", value: 21)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 75, baseType: !20, size: 32, elements: !105)
!104 = !DIFile(filename: "apps/538.imagick_r/src/magick/image.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9408eec9abffe54016aa20ae735786b")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIEnumerator(name: "UndefinedOrientation", value: 0)
!107 = !DIEnumerator(name: "TopLeftOrientation", value: 1)
!108 = !DIEnumerator(name: "TopRightOrientation", value: 2)
!109 = !DIEnumerator(name: "BottomRightOrientation", value: 3)
!110 = !DIEnumerator(name: "BottomLeftOrientation", value: 4)
!111 = !DIEnumerator(name: "LeftTopOrientation", value: 5)
!112 = !DIEnumerator(name: "RightTopOrientation", value: 6)
!113 = !DIEnumerator(name: "RightBottomOrientation", value: 7)
!114 = !DIEnumerator(name: "LeftBottomOrientation", value: 8)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 63, baseType: !20, size: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "UndefinedInterlace", value: 0)
!118 = !DIEnumerator(name: "NoInterlace", value: 1)
!119 = !DIEnumerator(name: "LineInterlace", value: 2)
!120 = !DIEnumerator(name: "PlaneInterlace", value: 3)
!121 = !DIEnumerator(name: "PartitionInterlace", value: 4)
!122 = !DIEnumerator(name: "GIFInterlace", value: 5)
!123 = !DIEnumerator(name: "JPEGInterlace", value: 6)
!124 = !DIEnumerator(name: "PNGInterlace", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 88, baseType: !20, size: 32, elements: !126)
!126 = !{!127, !128, !129}
!127 = !DIEnumerator(name: "UndefinedResolution", value: 0)
!128 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1)
!129 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 25, baseType: !20, size: 32, elements: !132)
!131 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4f032944b177fc61244445fe3a234334")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!133 = !DIEnumerator(name: "UndefinedColorspace", value: 0)
!134 = !DIEnumerator(name: "RGBColorspace", value: 1)
!135 = !DIEnumerator(name: "GRAYColorspace", value: 2)
!136 = !DIEnumerator(name: "TransparentColorspace", value: 3)
!137 = !DIEnumerator(name: "OHTAColorspace", value: 4)
!138 = !DIEnumerator(name: "LabColorspace", value: 5)
!139 = !DIEnumerator(name: "XYZColorspace", value: 6)
!140 = !DIEnumerator(name: "YCbCrColorspace", value: 7)
!141 = !DIEnumerator(name: "YCCColorspace", value: 8)
!142 = !DIEnumerator(name: "YIQColorspace", value: 9)
!143 = !DIEnumerator(name: "YPbPrColorspace", value: 10)
!144 = !DIEnumerator(name: "YUVColorspace", value: 11)
!145 = !DIEnumerator(name: "CMYKColorspace", value: 12)
!146 = !DIEnumerator(name: "sRGBColorspace", value: 13)
!147 = !DIEnumerator(name: "HSBColorspace", value: 14)
!148 = !DIEnumerator(name: "HSLColorspace", value: 15)
!149 = !DIEnumerator(name: "HWBColorspace", value: 16)
!150 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17)
!151 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18)
!152 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19)
!153 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20)
!154 = !DIEnumerator(name: "LogColorspace", value: 21)
!155 = !DIEnumerator(name: "CMYColorspace", value: 22)
!156 = !DIEnumerator(name: "LuvColorspace", value: 23)
!157 = !DIEnumerator(name: "HCLColorspace", value: 24)
!158 = !DIEnumerator(name: "LCHColorspace", value: 25)
!159 = !DIEnumerator(name: "LMSColorspace", value: 26)
!160 = !DIEnumerator(name: "LCHabColorspace", value: 27)
!161 = !DIEnumerator(name: "LCHuvColorspace", value: 28)
!162 = !DIEnumerator(name: "scRGBColorspace", value: 29)
!163 = !DIEnumerator(name: "HSIColorspace", value: 30)
!164 = !DIEnumerator(name: "HSVColorspace", value: 31)
!165 = !DIEnumerator(name: "HCLpColorspace", value: 32)
!166 = !DIEnumerator(name: "YDbDrColorspace", value: 33)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 47, baseType: !20, size: 32, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!169 = !DIEnumerator(name: "UndefinedType", value: 0)
!170 = !DIEnumerator(name: "BilevelType", value: 1)
!171 = !DIEnumerator(name: "GrayscaleType", value: 2)
!172 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!173 = !DIEnumerator(name: "PaletteType", value: 4)
!174 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!175 = !DIEnumerator(name: "TrueColorType", value: 6)
!176 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!177 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!178 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!179 = !DIEnumerator(name: "OptimizeType", value: 10)
!180 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !182, line: 27, baseType: !20, size: 32, elements: !183)
!182 = !DIFile(filename: "apps/538.imagick_r/src/magick/effect.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "85233add4591bd6d6001c51d4fa6a546")
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!184 = !DIEnumerator(name: "UndefinedPreview", value: 0)
!185 = !DIEnumerator(name: "RotatePreview", value: 1)
!186 = !DIEnumerator(name: "ShearPreview", value: 2)
!187 = !DIEnumerator(name: "RollPreview", value: 3)
!188 = !DIEnumerator(name: "HuePreview", value: 4)
!189 = !DIEnumerator(name: "SaturationPreview", value: 5)
!190 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!191 = !DIEnumerator(name: "GammaPreview", value: 7)
!192 = !DIEnumerator(name: "SpiffPreview", value: 8)
!193 = !DIEnumerator(name: "DullPreview", value: 9)
!194 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!195 = !DIEnumerator(name: "QuantizePreview", value: 11)
!196 = !DIEnumerator(name: "DespecklePreview", value: 12)
!197 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!198 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!199 = !DIEnumerator(name: "SharpenPreview", value: 15)
!200 = !DIEnumerator(name: "BlurPreview", value: 16)
!201 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!202 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!203 = !DIEnumerator(name: "SpreadPreview", value: 19)
!204 = !DIEnumerator(name: "SolarizePreview", value: 20)
!205 = !DIEnumerator(name: "ShadePreview", value: 21)
!206 = !DIEnumerator(name: "RaisePreview", value: 22)
!207 = !DIEnumerator(name: "SegmentPreview", value: 23)
!208 = !DIEnumerator(name: "SwirlPreview", value: 24)
!209 = !DIEnumerator(name: "ImplodePreview", value: 25)
!210 = !DIEnumerator(name: "WavePreview", value: 26)
!211 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!212 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!213 = !DIEnumerator(name: "JPEGPreview", value: 29)
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 177, baseType: !20, size: 32, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!216 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!217 = !DIEnumerator(name: "RedChannel", value: 1)
!218 = !DIEnumerator(name: "GrayChannel", value: 1)
!219 = !DIEnumerator(name: "CyanChannel", value: 1)
!220 = !DIEnumerator(name: "GreenChannel", value: 2)
!221 = !DIEnumerator(name: "MagentaChannel", value: 2)
!222 = !DIEnumerator(name: "BlueChannel", value: 4)
!223 = !DIEnumerator(name: "YellowChannel", value: 4)
!224 = !DIEnumerator(name: "AlphaChannel", value: 8)
!225 = !DIEnumerator(name: "OpacityChannel", value: 8)
!226 = !DIEnumerator(name: "MatteChannel", value: 8)
!227 = !DIEnumerator(name: "BlackChannel", value: 32)
!228 = !DIEnumerator(name: "IndexChannel", value: 32)
!229 = !DIEnumerator(name: "CompositeChannels", value: 47)
!230 = !DIEnumerator(name: "AllChannels", value: 134217727)
!231 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!232 = !DIEnumerator(name: "RGBChannels", value: 128)
!233 = !DIEnumerator(name: "GrayChannels", value: 128)
!234 = !DIEnumerator(name: "SyncChannels", value: 256)
!235 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 204, baseType: !20, size: 32, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIEnumerator(name: "UndefinedClass", value: 0)
!239 = !DIEnumerator(name: "DirectClass", value: 1)
!240 = !DIEnumerator(name: "PseudoClass", value: 2)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !242, line: 42, baseType: !20, size: 32, elements: !243)
!242 = !DIFile(filename: "apps/538.imagick_r/src/magick/profile.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fb61c1ae348c42a2b68ac081d4b39ee3")
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIEnumerator(name: "UndefinedIntent", value: 0)
!245 = !DIEnumerator(name: "SaturationIntent", value: 1)
!246 = !DIEnumerator(name: "PerceptualIntent", value: 2)
!247 = !DIEnumerator(name: "AbsoluteIntent", value: 3)
!248 = !DIEnumerator(name: "RelativeIntent", value: 4)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !250, line: 32, baseType: !20, size: 32, elements: !251)
!250 = !DIFile(filename: "apps/538.imagick_r/src/magick/resample.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "722fed6aaf07c122ede72839e4dadc42")
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!252 = !DIEnumerator(name: "UndefinedFilter", value: 0)
!253 = !DIEnumerator(name: "PointFilter", value: 1)
!254 = !DIEnumerator(name: "BoxFilter", value: 2)
!255 = !DIEnumerator(name: "TriangleFilter", value: 3)
!256 = !DIEnumerator(name: "HermiteFilter", value: 4)
!257 = !DIEnumerator(name: "HanningFilter", value: 5)
!258 = !DIEnumerator(name: "HammingFilter", value: 6)
!259 = !DIEnumerator(name: "BlackmanFilter", value: 7)
!260 = !DIEnumerator(name: "GaussianFilter", value: 8)
!261 = !DIEnumerator(name: "QuadraticFilter", value: 9)
!262 = !DIEnumerator(name: "CubicFilter", value: 10)
!263 = !DIEnumerator(name: "CatromFilter", value: 11)
!264 = !DIEnumerator(name: "MitchellFilter", value: 12)
!265 = !DIEnumerator(name: "JincFilter", value: 13)
!266 = !DIEnumerator(name: "SincFilter", value: 14)
!267 = !DIEnumerator(name: "SincFastFilter", value: 15)
!268 = !DIEnumerator(name: "KaiserFilter", value: 16)
!269 = !DIEnumerator(name: "WelshFilter", value: 17)
!270 = !DIEnumerator(name: "ParzenFilter", value: 18)
!271 = !DIEnumerator(name: "BohmanFilter", value: 19)
!272 = !DIEnumerator(name: "BartlettFilter", value: 20)
!273 = !DIEnumerator(name: "LagrangeFilter", value: 21)
!274 = !DIEnumerator(name: "LanczosFilter", value: 22)
!275 = !DIEnumerator(name: "LanczosSharpFilter", value: 23)
!276 = !DIEnumerator(name: "Lanczos2Filter", value: 24)
!277 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25)
!278 = !DIEnumerator(name: "RobidouxFilter", value: 26)
!279 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27)
!280 = !DIEnumerator(name: "CosineFilter", value: 28)
!281 = !DIEnumerator(name: "SplineFilter", value: 29)
!282 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30)
!283 = !DIEnumerator(name: "SentinelFilter", value: 31)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 77, baseType: !20, size: 32, elements: !286)
!285 = !DIFile(filename: "apps/538.imagick_r/src/magick/geometry.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "889bed117eb2a2fce6e2622bd130bcd2")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!287 = !DIEnumerator(name: "UndefinedGravity", value: 0)
!288 = !DIEnumerator(name: "ForgetGravity", value: 0)
!289 = !DIEnumerator(name: "NorthWestGravity", value: 1)
!290 = !DIEnumerator(name: "NorthGravity", value: 2)
!291 = !DIEnumerator(name: "NorthEastGravity", value: 3)
!292 = !DIEnumerator(name: "WestGravity", value: 4)
!293 = !DIEnumerator(name: "CenterGravity", value: 5)
!294 = !DIEnumerator(name: "EastGravity", value: 6)
!295 = !DIEnumerator(name: "SouthWestGravity", value: 7)
!296 = !DIEnumerator(name: "SouthGravity", value: 8)
!297 = !DIEnumerator(name: "SouthEastGravity", value: 9)
!298 = !DIEnumerator(name: "StaticGravity", value: 10)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 25, baseType: !20, size: 32, elements: !301)
!300 = !DIFile(filename: "apps/538.imagick_r/src/magick/composite.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "837959ddb1dc628f80f1f9b5cdda1fb4")
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!302 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0)
!303 = !DIEnumerator(name: "NoCompositeOp", value: 1)
!304 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2)
!305 = !DIEnumerator(name: "AtopCompositeOp", value: 3)
!306 = !DIEnumerator(name: "BlendCompositeOp", value: 4)
!307 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5)
!308 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6)
!309 = !DIEnumerator(name: "ClearCompositeOp", value: 7)
!310 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8)
!311 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9)
!312 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10)
!313 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11)
!314 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12)
!315 = !DIEnumerator(name: "CopyCompositeOp", value: 13)
!316 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14)
!317 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15)
!318 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16)
!319 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17)
!320 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18)
!321 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19)
!322 = !DIEnumerator(name: "DarkenCompositeOp", value: 20)
!323 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21)
!324 = !DIEnumerator(name: "DstCompositeOp", value: 22)
!325 = !DIEnumerator(name: "DstInCompositeOp", value: 23)
!326 = !DIEnumerator(name: "DstOutCompositeOp", value: 24)
!327 = !DIEnumerator(name: "DstOverCompositeOp", value: 25)
!328 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26)
!329 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27)
!330 = !DIEnumerator(name: "DissolveCompositeOp", value: 28)
!331 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29)
!332 = !DIEnumerator(name: "HardLightCompositeOp", value: 30)
!333 = !DIEnumerator(name: "HueCompositeOp", value: 31)
!334 = !DIEnumerator(name: "InCompositeOp", value: 32)
!335 = !DIEnumerator(name: "LightenCompositeOp", value: 33)
!336 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34)
!337 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35)
!338 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36)
!339 = !DIEnumerator(name: "ModulateCompositeOp", value: 37)
!340 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38)
!341 = !DIEnumerator(name: "OutCompositeOp", value: 39)
!342 = !DIEnumerator(name: "OverCompositeOp", value: 40)
!343 = !DIEnumerator(name: "OverlayCompositeOp", value: 41)
!344 = !DIEnumerator(name: "PlusCompositeOp", value: 42)
!345 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43)
!346 = !DIEnumerator(name: "SaturateCompositeOp", value: 44)
!347 = !DIEnumerator(name: "ScreenCompositeOp", value: 45)
!348 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46)
!349 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47)
!350 = !DIEnumerator(name: "SrcCompositeOp", value: 48)
!351 = !DIEnumerator(name: "SrcInCompositeOp", value: 49)
!352 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50)
!353 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51)
!354 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52)
!355 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53)
!356 = !DIEnumerator(name: "XorCompositeOp", value: 54)
!357 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55)
!358 = !DIEnumerator(name: "DistortCompositeOp", value: 56)
!359 = !DIEnumerator(name: "BlurCompositeOp", value: 57)
!360 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58)
!361 = !DIEnumerator(name: "VividLightCompositeOp", value: 59)
!362 = !DIEnumerator(name: "PinLightCompositeOp", value: 60)
!363 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61)
!364 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62)
!365 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63)
!366 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64)
!367 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65)
!368 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66)
!369 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 25, baseType: !20, size: 32, elements: !372)
!371 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!372 = !{!373, !374, !375, !376, !377}
!373 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!374 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!375 = !DIEnumerator(name: "NoneDispose", value: 1)
!376 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!377 = !DIEnumerator(name: "PreviousDispose", value: 3)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !379, line: 25, baseType: !20, size: 32, elements: !380)
!379 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!380 = !{!381, !382, !383}
!381 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!382 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!383 = !DIEnumerator(name: "RunningTimerState", value: 2)
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !385, line: 28, baseType: !20, size: 32, elements: !386)
!385 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cd97c70c025a9cff45f4138c27a79124")
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!387 = !DIEnumerator(name: "UndefinedException", value: 0)
!388 = !DIEnumerator(name: "WarningException", value: 300)
!389 = !DIEnumerator(name: "ResourceLimitWarning", value: 300)
!390 = !DIEnumerator(name: "TypeWarning", value: 305)
!391 = !DIEnumerator(name: "OptionWarning", value: 310)
!392 = !DIEnumerator(name: "DelegateWarning", value: 315)
!393 = !DIEnumerator(name: "MissingDelegateWarning", value: 320)
!394 = !DIEnumerator(name: "CorruptImageWarning", value: 325)
!395 = !DIEnumerator(name: "FileOpenWarning", value: 330)
!396 = !DIEnumerator(name: "BlobWarning", value: 335)
!397 = !DIEnumerator(name: "StreamWarning", value: 340)
!398 = !DIEnumerator(name: "CacheWarning", value: 345)
!399 = !DIEnumerator(name: "CoderWarning", value: 350)
!400 = !DIEnumerator(name: "FilterWarning", value: 352)
!401 = !DIEnumerator(name: "ModuleWarning", value: 355)
!402 = !DIEnumerator(name: "DrawWarning", value: 360)
!403 = !DIEnumerator(name: "ImageWarning", value: 365)
!404 = !DIEnumerator(name: "WandWarning", value: 370)
!405 = !DIEnumerator(name: "RandomWarning", value: 375)
!406 = !DIEnumerator(name: "XServerWarning", value: 380)
!407 = !DIEnumerator(name: "MonitorWarning", value: 385)
!408 = !DIEnumerator(name: "RegistryWarning", value: 390)
!409 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!410 = !DIEnumerator(name: "PolicyWarning", value: 399)
!411 = !DIEnumerator(name: "ErrorException", value: 400)
!412 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!413 = !DIEnumerator(name: "TypeError", value: 405)
!414 = !DIEnumerator(name: "OptionError", value: 410)
!415 = !DIEnumerator(name: "DelegateError", value: 415)
!416 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!417 = !DIEnumerator(name: "CorruptImageError", value: 425)
!418 = !DIEnumerator(name: "FileOpenError", value: 430)
!419 = !DIEnumerator(name: "BlobError", value: 435)
!420 = !DIEnumerator(name: "StreamError", value: 440)
!421 = !DIEnumerator(name: "CacheError", value: 445)
!422 = !DIEnumerator(name: "CoderError", value: 450)
!423 = !DIEnumerator(name: "FilterError", value: 452)
!424 = !DIEnumerator(name: "ModuleError", value: 455)
!425 = !DIEnumerator(name: "DrawError", value: 460)
!426 = !DIEnumerator(name: "ImageError", value: 465)
!427 = !DIEnumerator(name: "WandError", value: 470)
!428 = !DIEnumerator(name: "RandomError", value: 475)
!429 = !DIEnumerator(name: "XServerError", value: 480)
!430 = !DIEnumerator(name: "MonitorError", value: 485)
!431 = !DIEnumerator(name: "RegistryError", value: 490)
!432 = !DIEnumerator(name: "ConfigureError", value: 495)
!433 = !DIEnumerator(name: "PolicyError", value: 499)
!434 = !DIEnumerator(name: "FatalErrorException", value: 700)
!435 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!436 = !DIEnumerator(name: "TypeFatalError", value: 705)
!437 = !DIEnumerator(name: "OptionFatalError", value: 710)
!438 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!439 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!440 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!441 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!442 = !DIEnumerator(name: "BlobFatalError", value: 735)
!443 = !DIEnumerator(name: "StreamFatalError", value: 740)
!444 = !DIEnumerator(name: "CacheFatalError", value: 745)
!445 = !DIEnumerator(name: "CoderFatalError", value: 750)
!446 = !DIEnumerator(name: "FilterFatalError", value: 752)
!447 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!448 = !DIEnumerator(name: "DrawFatalError", value: 760)
!449 = !DIEnumerator(name: "ImageFatalError", value: 765)
!450 = !DIEnumerator(name: "WandFatalError", value: 770)
!451 = !DIEnumerator(name: "RandomFatalError", value: 775)
!452 = !DIEnumerator(name: "XServerFatalError", value: 780)
!453 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!454 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!455 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!456 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !458, line: 31, baseType: !20, size: 32, elements: !459)
!458 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!460 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!461 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!462 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!463 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!464 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!465 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!466 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!467 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!468 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!469 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!470 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!471 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!472 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!473 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!474 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !458, line: 67, baseType: !20, size: 32, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!476 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!477 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!478 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!479 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!480 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!481 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!482 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!483 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!484 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!485 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!486 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !487, line: 27, baseType: !20, size: 32, elements: !488)
!487 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!489 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!490 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!491 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!492 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!493 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!494 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!495 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!496 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!497 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!498 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!499 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!500 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!501 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!502 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!503 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!504 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!505 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!506 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 52, baseType: !20, size: 32, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!509 = !DIEnumerator(name: "UndefinedQuantum", value: 0)
!510 = !DIEnumerator(name: "AlphaQuantum", value: 1)
!511 = !DIEnumerator(name: "BlackQuantum", value: 2)
!512 = !DIEnumerator(name: "BlueQuantum", value: 3)
!513 = !DIEnumerator(name: "CMYKAQuantum", value: 4)
!514 = !DIEnumerator(name: "CMYKQuantum", value: 5)
!515 = !DIEnumerator(name: "CyanQuantum", value: 6)
!516 = !DIEnumerator(name: "GrayAlphaQuantum", value: 7)
!517 = !DIEnumerator(name: "GrayQuantum", value: 8)
!518 = !DIEnumerator(name: "GreenQuantum", value: 9)
!519 = !DIEnumerator(name: "IndexAlphaQuantum", value: 10)
!520 = !DIEnumerator(name: "IndexQuantum", value: 11)
!521 = !DIEnumerator(name: "MagentaQuantum", value: 12)
!522 = !DIEnumerator(name: "OpacityQuantum", value: 13)
!523 = !DIEnumerator(name: "RedQuantum", value: 14)
!524 = !DIEnumerator(name: "RGBAQuantum", value: 15)
!525 = !DIEnumerator(name: "BGRAQuantum", value: 16)
!526 = !DIEnumerator(name: "RGBOQuantum", value: 17)
!527 = !DIEnumerator(name: "RGBQuantum", value: 18)
!528 = !DIEnumerator(name: "YellowQuantum", value: 19)
!529 = !DIEnumerator(name: "GrayPadQuantum", value: 20)
!530 = !DIEnumerator(name: "RGBPadQuantum", value: 21)
!531 = !DIEnumerator(name: "CbYCrYQuantum", value: 22)
!532 = !DIEnumerator(name: "CbYCrQuantum", value: 23)
!533 = !DIEnumerator(name: "CbYCrAQuantum", value: 24)
!534 = !DIEnumerator(name: "CMYKOQuantum", value: 25)
!535 = !DIEnumerator(name: "BGRQuantum", value: 26)
!536 = !DIEnumerator(name: "BGROQuantum", value: 27)
!537 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !538, line: 25, baseType: !539, size: 32, elements: !540)
!538 = !DIFile(filename: "apps/538.imagick_r/src/magick/option.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "07bebb19d66188c5f61071b3cbeac6e1")
!539 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!541 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!542 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!543 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!544 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!545 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!546 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!547 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!548 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!549 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!550 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!551 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!552 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!553 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!554 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!555 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!556 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!557 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!558 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!559 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!560 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!561 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!562 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!563 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!564 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!565 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!566 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!567 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!568 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!569 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!570 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!571 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!572 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!573 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!574 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!575 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!576 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!577 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!578 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!579 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!580 = !DIEnumerator(name: "MagickListOptions", value: 38)
!581 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!582 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!583 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!584 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!585 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!586 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!587 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!588 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!589 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!590 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!591 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!592 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!593 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!594 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!595 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!596 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!597 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!598 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!599 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!600 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!601 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!602 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!603 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!604 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!605 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!606 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!607 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!608 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!609 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!610 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!611 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!612 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !614, line: 34, baseType: !20, size: 32, elements: !615)
!614 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!616 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!617 = !DIEnumerator(name: "NoEvents", value: 0)
!618 = !DIEnumerator(name: "TraceEvent", value: 1)
!619 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!620 = !DIEnumerator(name: "BlobEvent", value: 4)
!621 = !DIEnumerator(name: "CacheEvent", value: 8)
!622 = !DIEnumerator(name: "CoderEvent", value: 16)
!623 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!624 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!625 = !DIEnumerator(name: "DrawEvent", value: 128)
!626 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!627 = !DIEnumerator(name: "ImageEvent", value: 512)
!628 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!629 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!630 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!631 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!632 = !DIEnumerator(name: "TransformEvent", value: 16384)
!633 = !DIEnumerator(name: "UserEvent", value: 36864)
!634 = !DIEnumerator(name: "WandEvent", value: 65536)
!635 = !DIEnumerator(name: "X11Event", value: 131072)
!636 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!637 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 25, baseType: !20, size: 32, elements: !640)
!639 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649}
!641 = !DIEnumerator(name: "UndefinedResource", value: 0)
!642 = !DIEnumerator(name: "AreaResource", value: 1)
!643 = !DIEnumerator(name: "DiskResource", value: 2)
!644 = !DIEnumerator(name: "FileResource", value: 3)
!645 = !DIEnumerator(name: "MapResource", value: 4)
!646 = !DIEnumerator(name: "MemoryResource", value: 5)
!647 = !DIEnumerator(name: "ThreadResource", value: 6)
!648 = !DIEnumerator(name: "TimeResource", value: 7)
!649 = !DIEnumerator(name: "ThrottleResource", value: 8)
!650 = !{!6, !651, !15, !539, !652, !48, !70, !13, !678, !861, !707, !18, !993, !994, !712, !49}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !33, line: 221, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !104, line: 150, size: 105920, elements: !656)
!656 = !{!657, !659, !661, !663, !664, !666, !667, !668, !669, !670, !671, !672, !683, !684, !685, !686, !687, !701, !703, !704, !706, !709, !710, !711, !717, !718, !719, !727, !728, !729, !730, !731, !732, !734, !736, !737, !739, !741, !743, !745, !746, !747, !748, !749, !750, !751, !759, !774, !788, !789, !790, !791, !795, !799, !803, !804, !805, !806, !807, !820, !821, !823, !824, !832, !833, !835, !836, !837, !838, !839, !840, !842, !843, !844, !845, !846, !847, !848, !850, !851, !852, !853, !854, !858, !860}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !655, file: !104, line: 153, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !33, line: 209, baseType: !236)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !655, file: !104, line: 156, baseType: !660, size: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !131, line: 61, baseType: !130)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !655, file: !104, line: 159, baseType: !662, size: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !79, line: 49, baseType: !78)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !655, file: !104, line: 162, baseType: !13, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !655, file: !104, line: 165, baseType: !665, size: 32, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !104, line: 86, baseType: !103)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !655, file: !104, line: 168, baseType: !32, size: 32, offset: 224)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !655, file: !104, line: 169, baseType: !32, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !655, file: !104, line: 172, baseType: !13, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !655, file: !104, line: 173, baseType: !13, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !655, file: !104, line: 174, baseType: !13, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !655, file: !104, line: 175, baseType: !13, size: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !655, file: !104, line: 178, baseType: !673, size: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !458, line: 148, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !458, line: 131, size: 64, elements: !676)
!676 = !{!677, !680, !681, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !675, file: !458, line: 143, baseType: !678, size: 16)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !33, line: 93, baseType: !679)
!679 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !675, file: !458, line: 144, baseType: !678, size: 16, offset: 16)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !675, file: !458, line: 145, baseType: !678, size: 16, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !675, file: !458, line: 146, baseType: !678, size: 16, offset: 48)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !655, file: !104, line: 179, baseType: !674, size: 64, offset: 640)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !655, file: !104, line: 180, baseType: !674, size: 64, offset: 704)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !655, file: !104, line: 181, baseType: !674, size: 64, offset: 768)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !655, file: !104, line: 184, baseType: !27, size: 64, offset: 832)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !655, file: !104, line: 187, baseType: !688, size: 768, offset: 896)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !104, line: 128, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !104, line: 121, size: 768, elements: !690)
!690 = !{!691, !698, !699, !700}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !689, file: !104, line: 124, baseType: !692, size: 192)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !104, line: 101, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !104, line: 95, size: 192, elements: !694)
!694 = !{!695, !696, !697}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !693, file: !104, line: 98, baseType: !27, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !693, file: !104, line: 99, baseType: !27, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !693, file: !104, line: 100, baseType: !27, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !689, file: !104, line: 125, baseType: !692, size: 192, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !689, file: !104, line: 126, baseType: !692, size: 192, offset: 384)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !689, file: !104, line: 127, baseType: !692, size: 192, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !655, file: !104, line: 190, baseType: !702, size: 32, offset: 1664)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !242, line: 49, baseType: !241)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !655, file: !104, line: 193, baseType: !651, size: 64, offset: 1728)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !655, file: !104, line: 196, baseType: !705, size: 32, offset: 1792)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !104, line: 93, baseType: !125)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !655, file: !104, line: 199, baseType: !707, size: 64, offset: 1856)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !655, file: !104, line: 200, baseType: !707, size: 64, offset: 1920)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !655, file: !104, line: 201, baseType: !707, size: 64, offset: 1984)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !655, file: !104, line: 204, baseType: !712, size: 64, offset: 2048)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !713, line: 77, baseType: !714)
!713 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !715, line: 193, baseType: !716)
!715 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!716 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !655, file: !104, line: 207, baseType: !27, size: 64, offset: 2112)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !655, file: !104, line: 208, baseType: !27, size: 64, offset: 2176)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !655, file: !104, line: 211, baseType: !720, size: 256, offset: 2240)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !285, line: 130, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !285, line: 121, size: 256, elements: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !721, file: !285, line: 124, baseType: !13, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !721, file: !285, line: 125, baseType: !13, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !721, file: !285, line: 128, baseType: !712, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !721, file: !285, line: 129, baseType: !712, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !655, file: !104, line: 212, baseType: !720, size: 256, offset: 2496)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !655, file: !104, line: 213, baseType: !720, size: 256, offset: 2752)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !655, file: !104, line: 216, baseType: !27, size: 64, offset: 3008)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !655, file: !104, line: 217, baseType: !27, size: 64, offset: 3072)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !655, file: !104, line: 218, baseType: !27, size: 64, offset: 3136)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !655, file: !104, line: 221, baseType: !733, size: 32, offset: 3200)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !250, line: 66, baseType: !249)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !655, file: !104, line: 224, baseType: !735, size: 32, offset: 3232)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !104, line: 73, baseType: !115)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !655, file: !104, line: 227, baseType: !53, size: 32, offset: 3264)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !655, file: !104, line: 230, baseType: !738, size: 32, offset: 3296)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !285, line: 91, baseType: !284)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !655, file: !104, line: 233, baseType: !740, size: 32, offset: 3328)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !300, line: 99, baseType: !299)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !655, file: !104, line: 236, baseType: !742, size: 32, offset: 3360)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !371, line: 32, baseType: !370)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !655, file: !104, line: 239, baseType: !744, size: 64, offset: 3392)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !655, file: !104, line: 242, baseType: !13, size: 64, offset: 3456)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !655, file: !104, line: 243, baseType: !13, size: 64, offset: 3520)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !655, file: !104, line: 246, baseType: !712, size: 64, offset: 3584)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !655, file: !104, line: 249, baseType: !13, size: 64, offset: 3648)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !655, file: !104, line: 250, baseType: !13, size: 64, offset: 3712)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !655, file: !104, line: 253, baseType: !712, size: 64, offset: 3776)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !655, file: !104, line: 256, baseType: !752, size: 192, offset: 3840)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !753, line: 68, baseType: !754)
!753 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !753, line: 62, size: 192, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !754, file: !753, line: 65, baseType: !27, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !754, file: !753, line: 66, baseType: !27, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !754, file: !753, line: 67, baseType: !27, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !655, file: !104, line: 259, baseType: !760, size: 512, offset: 4032)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !379, line: 51, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !379, line: 40, size: 512, elements: !762)
!762 = !{!763, !770, !771, !773}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !761, file: !379, line: 43, baseType: !764, size: 192)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !379, line: 38, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !379, line: 32, size: 192, elements: !766)
!766 = !{!767, !768, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !765, file: !379, line: 35, baseType: !27, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !765, file: !379, line: 36, baseType: !27, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !765, file: !379, line: 37, baseType: !27, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !761, file: !379, line: 44, baseType: !764, size: 192, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !761, file: !379, line: 47, baseType: !772, size: 32, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !379, line: 30, baseType: !378)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !761, file: !379, line: 50, baseType: !13, size: 64, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !655, file: !104, line: 262, baseType: !775, size: 64, offset: 4544)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !776, line: 26, baseType: !777)
!776 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!32, !780, !782, !785, !651}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !33, line: 150, baseType: !784)
!784 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !33, line: 151, baseType: !787)
!787 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !655, file: !104, line: 265, baseType: !651, size: 64, offset: 4608)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !655, file: !104, line: 266, baseType: !651, size: 64, offset: 4672)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !655, file: !104, line: 267, baseType: !651, size: 64, offset: 4736)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !655, file: !104, line: 270, baseType: !792, size: 64, offset: 4800)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !79, line: 52, baseType: !794)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !79, line: 51, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !655, file: !104, line: 273, baseType: !796, size: 64, offset: 4864)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !33, line: 217, baseType: !798)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !33, line: 217, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !655, file: !104, line: 276, baseType: !800, size: 32768, offset: 4928)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 32768, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 4096)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !655, file: !104, line: 277, baseType: !800, size: 32768, offset: 37696)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !655, file: !104, line: 278, baseType: !800, size: 32768, offset: 70464)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !655, file: !104, line: 281, baseType: !13, size: 64, offset: 103232)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !655, file: !104, line: 282, baseType: !13, size: 64, offset: 103296)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !655, file: !104, line: 285, baseType: !808, size: 448, offset: 103360)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !33, line: 219, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !385, line: 102, size: 448, elements: !810)
!810 = !{!811, !813, !814, !815, !816, !817, !818, !819}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !809, file: !385, line: 105, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !385, line: 100, baseType: !384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !809, file: !385, line: 108, baseType: !539, size: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !809, file: !385, line: 111, baseType: !707, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !809, file: !385, line: 112, baseType: !707, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !809, file: !385, line: 115, baseType: !651, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !809, file: !385, line: 118, baseType: !32, size: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !809, file: !385, line: 121, baseType: !70, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !809, file: !385, line: 124, baseType: !13, size: 64, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !655, file: !104, line: 288, baseType: !32, size: 32, offset: 103808)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !655, file: !104, line: 291, baseType: !822, size: 64, offset: 103872)
!822 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !712)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !655, file: !104, line: 294, baseType: !70, size: 64, offset: 103936)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !655, file: !104, line: 297, baseType: !825, size: 256, offset: 104000)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !242, line: 40, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !242, line: 27, size: 256, elements: !827)
!827 = !{!828, !829, !830, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !826, file: !242, line: 30, baseType: !707, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !826, file: !242, line: 33, baseType: !13, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !826, file: !242, line: 36, baseType: !49, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !826, file: !242, line: 39, baseType: !13, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !655, file: !104, line: 298, baseType: !825, size: 256, offset: 104256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !655, file: !104, line: 299, baseType: !834, size: 64, offset: 104512)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !655, file: !104, line: 302, baseType: !13, size: 64, offset: 104576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !655, file: !104, line: 305, baseType: !13, size: 64, offset: 104640)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !655, file: !104, line: 308, baseType: !744, size: 64, offset: 104704)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !655, file: !104, line: 309, baseType: !744, size: 64, offset: 104768)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !104, line: 310, baseType: !744, size: 64, offset: 104832)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !655, file: !104, line: 313, baseType: !841, size: 32, offset: 104896)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !458, line: 47, baseType: !457)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !655, file: !104, line: 316, baseType: !32, size: 32, offset: 104928)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !655, file: !104, line: 319, baseType: !674, size: 64, offset: 104960)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !655, file: !104, line: 322, baseType: !744, size: 64, offset: 105024)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !655, file: !104, line: 325, baseType: !720, size: 256, offset: 105088)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !655, file: !104, line: 328, baseType: !651, size: 64, offset: 105344)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !655, file: !104, line: 329, baseType: !651, size: 64, offset: 105408)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !655, file: !104, line: 332, baseType: !849, size: 32, offset: 105472)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !104, line: 61, baseType: !167)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !655, file: !104, line: 335, baseType: !32, size: 32, offset: 105504)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !655, file: !104, line: 338, baseType: !786, size: 64, offset: 105536)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !655, file: !104, line: 341, baseType: !32, size: 32, offset: 105600)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !655, file: !104, line: 344, baseType: !13, size: 64, offset: 105664)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !655, file: !104, line: 347, baseType: !855, size: 64, offset: 105728)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !856, line: 7, baseType: !857)
!856 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !715, line: 160, baseType: !716)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !655, file: !104, line: 350, baseType: !859, size: 32, offset: 105792)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !458, line: 79, baseType: !474)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !655, file: !104, line: 353, baseType: !13, size: 64, offset: 105856)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !33, line: 223, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !104, line: 356, size: 134336, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !900, !901, !902, !903, !904, !905, !907, !909, !910, !911, !912, !913, !922, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !990, !991, !992}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !864, file: !104, line: 359, baseType: !662, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !864, file: !104, line: 362, baseType: !665, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !864, file: !104, line: 365, baseType: !32, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !864, file: !104, line: 366, baseType: !32, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !864, file: !104, line: 367, baseType: !32, size: 32, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !864, file: !104, line: 368, baseType: !32, size: 32, offset: 160)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !864, file: !104, line: 371, baseType: !707, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !864, file: !104, line: 372, baseType: !707, size: 64, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !864, file: !104, line: 373, baseType: !707, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !864, file: !104, line: 374, baseType: !707, size: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !864, file: !104, line: 377, baseType: !13, size: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !864, file: !104, line: 378, baseType: !13, size: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !864, file: !104, line: 379, baseType: !13, size: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !864, file: !104, line: 382, baseType: !735, size: 32, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !864, file: !104, line: 385, baseType: !53, size: 32, offset: 672)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !864, file: !104, line: 388, baseType: !705, size: 32, offset: 704)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !864, file: !104, line: 391, baseType: !13, size: 64, offset: 768)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !864, file: !104, line: 394, baseType: !707, size: 64, offset: 832)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !864, file: !104, line: 395, baseType: !707, size: 64, offset: 896)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !864, file: !104, line: 396, baseType: !707, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !864, file: !104, line: 397, baseType: !707, size: 64, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !864, file: !104, line: 398, baseType: !707, size: 64, offset: 1088)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !864, file: !104, line: 401, baseType: !27, size: 64, offset: 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !864, file: !104, line: 402, baseType: !27, size: 64, offset: 1216)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !864, file: !104, line: 405, baseType: !674, size: 64, offset: 1280)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !864, file: !104, line: 406, baseType: !674, size: 64, offset: 1344)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !864, file: !104, line: 407, baseType: !674, size: 64, offset: 1408)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !864, file: !104, line: 410, baseType: !32, size: 32, offset: 1472)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !864, file: !104, line: 411, baseType: !32, size: 32, offset: 1504)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !864, file: !104, line: 414, baseType: !13, size: 64, offset: 1536)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !864, file: !104, line: 417, baseType: !660, size: 32, offset: 1600)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !864, file: !104, line: 420, baseType: !849, size: 32, offset: 1632)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !864, file: !104, line: 423, baseType: !899, size: 32, offset: 1664)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !182, line: 59, baseType: !181)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !864, file: !104, line: 426, baseType: !712, size: 64, offset: 1728)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !864, file: !104, line: 429, baseType: !32, size: 32, offset: 1792)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !864, file: !104, line: 430, baseType: !32, size: 32, offset: 1824)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !864, file: !104, line: 433, baseType: !707, size: 64, offset: 1856)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !864, file: !104, line: 434, baseType: !707, size: 64, offset: 1920)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !864, file: !104, line: 437, baseType: !906, size: 32, offset: 1984)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !33, line: 202, baseType: !214)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !864, file: !104, line: 440, baseType: !908, size: 64, offset: 2048)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !864, file: !104, line: 443, baseType: !651, size: 64, offset: 2112)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !864, file: !104, line: 446, baseType: !775, size: 64, offset: 2176)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !864, file: !104, line: 449, baseType: !651, size: 64, offset: 2240)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !864, file: !104, line: 450, baseType: !651, size: 64, offset: 2304)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !864, file: !104, line: 453, baseType: !914, size: 64, offset: 2368)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !915, line: 26, baseType: !916)
!915 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!13, !652, !919, !921}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !864, file: !104, line: 456, baseType: !923, size: 64, offset: 2432)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !925, line: 7, baseType: !926)
!925 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !927, line: 49, size: 1728, elements: !928)
!927 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !944, !946, !947, !948, !950, !951, !953, !957, !960, !962, !965, !968, !969, !970, !971, !972}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !926, file: !927, line: 51, baseType: !539, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !926, file: !927, line: 54, baseType: !707, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !926, file: !927, line: 55, baseType: !707, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !926, file: !927, line: 56, baseType: !707, size: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !926, file: !927, line: 57, baseType: !707, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !926, file: !927, line: 58, baseType: !707, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !926, file: !927, line: 59, baseType: !707, size: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !926, file: !927, line: 60, baseType: !707, size: 64, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !926, file: !927, line: 61, baseType: !707, size: 64, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !926, file: !927, line: 64, baseType: !707, size: 64, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !926, file: !927, line: 65, baseType: !707, size: 64, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !926, file: !927, line: 66, baseType: !707, size: 64, offset: 704)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !926, file: !927, line: 68, baseType: !942, size: 64, offset: 768)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !927, line: 36, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !926, file: !927, line: 70, baseType: !945, size: 64, offset: 832)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !926, file: !927, line: 72, baseType: !539, size: 32, offset: 896)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !926, file: !927, line: 73, baseType: !539, size: 32, offset: 928)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !926, file: !927, line: 74, baseType: !949, size: 64, offset: 960)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !715, line: 152, baseType: !716)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !926, file: !927, line: 77, baseType: !679, size: 16, offset: 1024)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !926, file: !927, line: 78, baseType: !952, size: 8, offset: 1040)
!952 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !926, file: !927, line: 79, baseType: !954, size: 8, offset: 1048)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 8, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 1)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !926, file: !927, line: 81, baseType: !958, size: 64, offset: 1088)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !927, line: 43, baseType: null)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !926, file: !927, line: 89, baseType: !961, size: 64, offset: 1152)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !715, line: 153, baseType: !716)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !926, file: !927, line: 91, baseType: !963, size: 64, offset: 1216)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !927, line: 37, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !926, file: !927, line: 92, baseType: !966, size: 64, offset: 1280)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !927, line: 38, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !926, file: !927, line: 93, baseType: !945, size: 64, offset: 1344)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !926, file: !927, line: 94, baseType: !651, size: 64, offset: 1408)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !926, file: !927, line: 95, baseType: !13, size: 64, offset: 1472)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !926, file: !927, line: 96, baseType: !539, size: 32, offset: 1536)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !926, file: !927, line: 98, baseType: !973, size: 160, offset: 1568)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 160, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 20)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !864, file: !104, line: 459, baseType: !651, size: 64, offset: 2496)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !864, file: !104, line: 462, baseType: !13, size: 64, offset: 2560)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !864, file: !104, line: 465, baseType: !800, size: 32768, offset: 2624)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !864, file: !104, line: 466, baseType: !800, size: 32768, offset: 35392)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !864, file: !104, line: 467, baseType: !800, size: 32768, offset: 68160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !864, file: !104, line: 468, baseType: !800, size: 32768, offset: 100928)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !864, file: !104, line: 471, baseType: !32, size: 32, offset: 133696)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !864, file: !104, line: 474, baseType: !707, size: 64, offset: 133760)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !864, file: !104, line: 477, baseType: !13, size: 64, offset: 133824)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !864, file: !104, line: 478, baseType: !13, size: 64, offset: 133888)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !864, file: !104, line: 481, baseType: !674, size: 64, offset: 133952)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !864, file: !104, line: 484, baseType: !13, size: 64, offset: 134016)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !864, file: !104, line: 487, baseType: !989, size: 32, offset: 134080)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !487, line: 47, baseType: !486)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !864, file: !104, line: 490, baseType: !674, size: 64, offset: 134112)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !864, file: !104, line: 493, baseType: !651, size: 64, offset: 134208)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !864, file: !104, line: 496, baseType: !32, size: 32, offset: 134272)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !33, line: 78, baseType: !995)
!995 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!996 = !{!0}
!997 = !{!998}
!998 = !DILocalVariable(name: "quantum_info", arg: 1, scope: !2, file: !3, line: 570, type: !6)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 1024, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 32)
!1002 = !{i32 7, !"Dwarf Version", i32 5}
!1003 = !{i32 2, !"Debug Info Version", i32 3}
!1004 = !{i32 1, !"wchar_size", i32 4}
!1005 = !{i32 7, !"PIC Level", i32 2}
!1006 = !{i32 7, !"PIE Level", i32 2}
!1007 = !{i32 7, !"uwtable", i32 2}
!1008 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1009 = distinct !DISubprogram(name: "AcquireQuantumInfo", scope: !3, file: !3, line: 114, type: !1010, scopeLine: 116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !75, retainedNodes: !1012)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!6, !861, !908}
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1020}
!1013 = !DILocalVariable(name: "image_info", arg: 1, scope: !1009, file: !3, line: 114, type: !861)
!1014 = !DILocalVariable(name: "image", arg: 2, scope: !1009, file: !3, line: 115, type: !908)
!1015 = !DILocalVariable(name: "status", scope: !1009, file: !3, line: 118, type: !32)
!1016 = !DILocalVariable(name: "quantum_info", scope: !1009, file: !3, line: 121, type: !6)
!1017 = !DILocalVariable(name: "message", scope: !1018, file: !3, line: 125, type: !707)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 125, column: 5)
!1019 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 124, column: 7)
!1020 = !DILocalVariable(name: "exception", scope: !1018, file: !3, line: 125, type: !808)
!1021 = !DILocation(line: 0, scope: !1009)
!1022 = !DILocation(line: 123, column: 32, scope: !1009)
!1023 = !DILocation(line: 124, column: 20, scope: !1019)
!1024 = !DILocation(line: 124, column: 7, scope: !1009)
!1025 = !DILocation(line: 125, column: 5, scope: !1018)
!1026 = !{!1027, !1027, i64 0}
!1027 = !{!"int", !1028, i64 0}
!1028 = !{!"omnipotent char", !1029, i64 0}
!1029 = !{!"Simple C/C++ TBAA"}
!1030 = !DILocation(line: 0, scope: !1018)
!1031 = !DILocation(line: 126, column: 17, scope: !1009)
!1032 = !DILocation(line: 126, column: 26, scope: !1009)
!1033 = !{!1034, !1035, i64 144}
!1034 = !{!"_QuantumInfo", !1035, i64 0, !1035, i64 8, !1028, i64 16, !1036, i64 24, !1036, i64 32, !1036, i64 40, !1035, i64 48, !1028, i64 56, !1028, i64 60, !1028, i64 64, !1035, i64 72, !1037, i64 80, !1035, i64 88, !1028, i64 96, !1038, i64 104, !1037, i64 136, !1035, i64 144}
!1035 = !{!"long", !1028, i64 0}
!1036 = !{!"double", !1028, i64 0}
!1037 = !{!"any pointer", !1028, i64 0}
!1038 = !{!"_QuantumState", !1036, i64 0, !1027, i64 8, !1035, i64 16, !1037, i64 24}
!1039 = !DILocation(line: 127, column: 3, scope: !1009)
!1040 = !DILocation(line: 128, column: 13, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 128, column: 7)
!1042 = !DILocation(line: 128, column: 7, scope: !1009)
!1043 = !DILocation(line: 130, column: 52, scope: !1009)
!1044 = !{!1045, !1035, i64 56}
