; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/quantize.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/quantize.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._QuantizeInfo = type { i64, i64, i32, i32, i32, i64, i32 }
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i64, i64, i64, i32, i32, i32, i64, ptr, ptr, ptr, ptr, ptr, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, ptr, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, ptr, i32 }
%struct._PixelPacket = type { i16, i16, i16, i16 }

!488 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!489 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!490 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!491 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!492 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!493 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!494 = !DIEnumerator(name: "MagickListOptions", value: 38)
!495 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!496 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!497 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!498 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!499 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!500 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!501 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!502 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!503 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!504 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!505 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!506 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!507 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!508 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!509 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!510 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!511 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!512 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!513 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!514 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!515 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!516 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!517 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!518 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!519 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!520 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!521 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!522 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!523 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!524 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!525 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!526 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !528, line: 34, baseType: !5, size: 32, elements: !529)
!528 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551}
!530 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!531 = !DIEnumerator(name: "NoEvents", value: 0)
!532 = !DIEnumerator(name: "TraceEvent", value: 1)
!533 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!534 = !DIEnumerator(name: "BlobEvent", value: 4)
!535 = !DIEnumerator(name: "CacheEvent", value: 8)
!536 = !DIEnumerator(name: "CoderEvent", value: 16)
!537 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!538 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!539 = !DIEnumerator(name: "DrawEvent", value: 128)
!540 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!541 = !DIEnumerator(name: "ImageEvent", value: 512)
!542 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!543 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!544 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!545 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!546 = !DIEnumerator(name: "TransformEvent", value: 16384)
!547 = !DIEnumerator(name: "UserEvent", value: 36864)
!548 = !DIEnumerator(name: "WandEvent", value: 65536)
!549 = !DIEnumerator(name: "X11Event", value: 131072)
!550 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!551 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !553, line: 25, baseType: !5, size: 32, elements: !554)
!553 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563}
!555 = !DIEnumerator(name: "UndefinedResource", value: 0)
!556 = !DIEnumerator(name: "AreaResource", value: 1)
!557 = !DIEnumerator(name: "DiskResource", value: 2)
!558 = !DIEnumerator(name: "FileResource", value: 3)
!559 = !DIEnumerator(name: "MapResource", value: 4)
!560 = !DIEnumerator(name: "MemoryResource", value: 5)
!561 = !DIEnumerator(name: "ThreadResource", value: 6)
!562 = !DIEnumerator(name: "TimeResource", value: 7)
!563 = !DIEnumerator(name: "ThrottleResource", value: 8)
!564 = !{!565, !582, !572, !453, !583, !758, !581, !860, !640, !930, !932, !935, !617, !624, !669, !937, !934, !753, !570, !938, !652, !761, !944, !988, !993, !980, !814, !764, !1005, !1006, !1007, !625, !5}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantizeInfo", file: !47, line: 57, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantizeInfo", file: !47, line: 35, size: 384, elements: !568)
!568 = !{!569, !573, !574, !576, !578, !579, !580}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "number_colors", scope: !567, file: !47, line: 38, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !571, line: 46, baseType: !572)
!571 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!572 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tree_depth", scope: !567, file: !47, line: 41, baseType: !570, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !567, file: !47, line: 44, baseType: !575, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !567, file: !47, line: 47, baseType: !577, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !10, line: 61, baseType: !9)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "measure_error", scope: !567, file: !47, line: 50, baseType: !575, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !567, file: !47, line: 53, baseType: !570, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dither_method", scope: !567, file: !47, line: 56, baseType: !581, size: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "DitherMethod", file: !47, line: 33, baseType: !46)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !79, line: 356, size: 134336, elements: !586)
!586 = !{!587, !589, !591, !592, !593, !594, !595, !598, !599, !600, !601, !602, !603, !604, !606, !608, !610, !611, !612, !613, !614, !615, !616, !618, !619, !629, !630, !631, !632, !633, !634, !635, !637, !639, !645, !646, !647, !648, !649, !651, !844, !845, !846, !847, !848, !859, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !927, !928, !929}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !585, file: !79, line: 359, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !54, line: 49, baseType: !53)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !585, file: !79, line: 362, baseType: !590, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !79, line: 86, baseType: !78)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !585, file: !79, line: 365, baseType: !575, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !585, file: !79, line: 366, baseType: !575, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !585, file: !79, line: 367, baseType: !575, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !585, file: !79, line: 368, baseType: !575, size: 32, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !585, file: !79, line: 371, baseType: !596, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !585, file: !79, line: 372, baseType: !596, size: 64, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !585, file: !79, line: 373, baseType: !596, size: 64, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !585, file: !79, line: 374, baseType: !596, size: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !585, file: !79, line: 377, baseType: !570, size: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !585, file: !79, line: 378, baseType: !570, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !585, file: !79, line: 379, baseType: !570, size: 64, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !585, file: !79, line: 382, baseType: !605, size: 32, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !79, line: 73, baseType: !90)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !585, file: !79, line: 385, baseType: !607, size: 32, offset: 672)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !101, line: 35, baseType: !100)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !585, file: !79, line: 388, baseType: !609, size: 32, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !79, line: 93, baseType: !106)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !585, file: !79, line: 391, baseType: !570, size: 64, offset: 768)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !585, file: !79, line: 394, baseType: !596, size: 64, offset: 832)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !585, file: !79, line: 395, baseType: !596, size: 64, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !585, file: !79, line: 396, baseType: !596, size: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !585, file: !79, line: 397, baseType: !596, size: 64, offset: 1024)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !585, file: !79, line: 398, baseType: !596, size: 64, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !585, file: !79, line: 401, baseType: !617, size: 64, offset: 1152)
!617 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !585, file: !79, line: 402, baseType: !617, size: 64, offset: 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !585, file: !79, line: 405, baseType: !620, size: 64, offset: 1280)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !402, line: 148, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !402, line: 131, size: 64, elements: !622)
!622 = !{!623, !626, !627, !628}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !621, file: !402, line: 143, baseType: !624, size: 16)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !625)
!625 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !621, file: !402, line: 144, baseType: !624, size: 16, offset: 16)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !621, file: !402, line: 145, baseType: !624, size: 16, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !621, file: !402, line: 146, baseType: !624, size: 16, offset: 48)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !585, file: !79, line: 406, baseType: !620, size: 64, offset: 1344)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !585, file: !79, line: 407, baseType: !620, size: 64, offset: 1408)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !585, file: !79, line: 410, baseType: !575, size: 32, offset: 1472)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !585, file: !79, line: 411, baseType: !575, size: 32, offset: 1504)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !585, file: !79, line: 414, baseType: !570, size: 64, offset: 1536)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !585, file: !79, line: 417, baseType: !577, size: 32, offset: 1600)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !585, file: !79, line: 420, baseType: !636, size: 32, offset: 1632)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !79, line: 61, baseType: !111)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !585, file: !79, line: 423, baseType: !638, size: 32, offset: 1664)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !126, line: 59, baseType: !125)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !585, file: !79, line: 426, baseType: !640, size: 64, offset: 1728)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !641, line: 77, baseType: !642)
!641 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !643, line: 193, baseType: !644)
!643 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!644 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !585, file: !79, line: 429, baseType: !575, size: 32, offset: 1792)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !585, file: !79, line: 430, baseType: !575, size: 32, offset: 1824)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !585, file: !79, line: 433, baseType: !596, size: 64, offset: 1856)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !585, file: !79, line: 434, baseType: !596, size: 64, offset: 1920)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !585, file: !79, line: 437, baseType: !650, size: 32, offset: 1984)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !158)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !585, file: !79, line: 440, baseType: !652, size: 64, offset: 2048)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !79, line: 150, size: 105920, elements: !655)
!655 = !{!656, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !670, !671, !672, !673, !674, !688, !690, !691, !692, !693, !694, !695, !696, !697, !698, !706, !707, !708, !709, !710, !711, !713, !714, !715, !717, !719, !721, !723, !724, !725, !726, !727, !728, !729, !737, !752, !766, !767, !768, !769, !773, !777, !781, !782, !783, !784, !785, !802, !803, !805, !806, !816, !817, !819, !820, !821, !822, !823, !824, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !841, !843}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !654, file: !79, line: 153, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !180)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !654, file: !79, line: 156, baseType: !577, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !654, file: !79, line: 159, baseType: !588, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !654, file: !79, line: 162, baseType: !570, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !654, file: !79, line: 165, baseType: !590, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !654, file: !79, line: 168, baseType: !575, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !654, file: !79, line: 169, baseType: !575, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !654, file: !79, line: 172, baseType: !570, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !654, file: !79, line: 173, baseType: !570, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !654, file: !79, line: 174, baseType: !570, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !654, file: !79, line: 175, baseType: !570, size: 64, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !654, file: !79, line: 178, baseType: !669, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !654, file: !79, line: 179, baseType: !620, size: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !654, file: !79, line: 180, baseType: !620, size: 64, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !654, file: !79, line: 181, baseType: !620, size: 64, offset: 768)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !654, file: !79, line: 184, baseType: !617, size: 64, offset: 832)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !654, file: !79, line: 187, baseType: !675, size: 768, offset: 896)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !79, line: 128, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !79, line: 121, size: 768, elements: !677)
!677 = !{!678, !685, !686, !687}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !676, file: !79, line: 124, baseType: !679, size: 192)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !79, line: 101, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !79, line: 95, size: 192, elements: !681)
!681 = !{!682, !683, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !680, file: !79, line: 98, baseType: !617, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !680, file: !79, line: 99, baseType: !617, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !680, file: !79, line: 100, baseType: !617, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !676, file: !79, line: 125, baseType: !679, size: 192, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !676, file: !79, line: 126, baseType: !679, size: 192, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !676, file: !79, line: 127, baseType: !679, size: 192, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !654, file: !79, line: 190, baseType: !689, size: 32, offset: 1664)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !186, line: 49, baseType: !185)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !654, file: !79, line: 193, baseType: !582, size: 64, offset: 1728)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !654, file: !79, line: 196, baseType: !609, size: 32, offset: 1792)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !654, file: !79, line: 199, baseType: !596, size: 64, offset: 1856)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !654, file: !79, line: 200, baseType: !596, size: 64, offset: 1920)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !654, file: !79, line: 201, baseType: !596, size: 64, offset: 1984)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !654, file: !79, line: 204, baseType: !640, size: 64, offset: 2048)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !654, file: !79, line: 207, baseType: !617, size: 64, offset: 2112)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !654, file: !79, line: 208, baseType: !617, size: 64, offset: 2176)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !654, file: !79, line: 211, baseType: !699, size: 256, offset: 2240)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !229, line: 130, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !229, line: 121, size: 256, elements: !701)
!701 = !{!702, !703, !704, !705}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !700, file: !229, line: 124, baseType: !570, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !700, file: !229, line: 125, baseType: !570, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !700, file: !229, line: 128, baseType: !640, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !700, file: !229, line: 129, baseType: !640, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !654, file: !79, line: 212, baseType: !699, size: 256, offset: 2496)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !654, file: !79, line: 213, baseType: !699, size: 256, offset: 2752)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !654, file: !79, line: 216, baseType: !617, size: 64, offset: 3008)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !654, file: !79, line: 217, baseType: !617, size: 64, offset: 3072)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !654, file: !79, line: 218, baseType: !617, size: 64, offset: 3136)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !654, file: !79, line: 221, baseType: !712, size: 32, offset: 3200)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !194, line: 66, baseType: !193)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !654, file: !79, line: 224, baseType: !605, size: 32, offset: 3232)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !654, file: !79, line: 227, baseType: !607, size: 32, offset: 3264)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !654, file: !79, line: 230, baseType: !716, size: 32, offset: 3296)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !229, line: 91, baseType: !228)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !654, file: !79, line: 233, baseType: !718, size: 32, offset: 3328)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !244, line: 99, baseType: !243)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !654, file: !79, line: 236, baseType: !720, size: 32, offset: 3360)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !315, line: 32, baseType: !314)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !654, file: !79, line: 239, baseType: !722, size: 64, offset: 3392)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !654, file: !79, line: 242, baseType: !570, size: 64, offset: 3456)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !654, file: !79, line: 243, baseType: !570, size: 64, offset: 3520)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !654, file: !79, line: 246, baseType: !640, size: 64, offset: 3584)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !654, file: !79, line: 249, baseType: !570, size: 64, offset: 3648)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !654, file: !79, line: 250, baseType: !570, size: 64, offset: 3712)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !654, file: !79, line: 253, baseType: !640, size: 64, offset: 3776)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !654, file: !79, line: 256, baseType: !730, size: 192, offset: 3840)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !731, line: 68, baseType: !732)
!731 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !731, line: 62, size: 192, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !732, file: !731, line: 65, baseType: !617, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !732, file: !731, line: 66, baseType: !617, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !732, file: !731, line: 67, baseType: !617, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !654, file: !79, line: 259, baseType: !738, size: 512, offset: 4032)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !323, line: 51, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !323, line: 40, size: 512, elements: !740)
!740 = !{!741, !748, !749, !751}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !739, file: !323, line: 43, baseType: !742, size: 192)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !323, line: 38, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !323, line: 32, size: 192, elements: !744)
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !743, file: !323, line: 35, baseType: !617, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !743, file: !323, line: 36, baseType: !617, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !743, file: !323, line: 37, baseType: !617, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !739, file: !323, line: 44, baseType: !742, size: 192, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !739, file: !323, line: 47, baseType: !750, size: 32, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !323, line: 30, baseType: !322)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !739, file: !323, line: 50, baseType: !570, size: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !654, file: !79, line: 262, baseType: !753, size: 64, offset: 4544)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !754, line: 26, baseType: !755)
!754 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!575, !758, !760, !763, !582}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !762)
!762 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !765)
!765 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !654, file: !79, line: 265, baseType: !582, size: 64, offset: 4608)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !654, file: !79, line: 266, baseType: !582, size: 64, offset: 4672)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !654, file: !79, line: 267, baseType: !582, size: 64, offset: 4736)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !654, file: !79, line: 270, baseType: !770, size: 64, offset: 4800)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !54, line: 52, baseType: !772)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !54, line: 51, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !654, file: !79, line: 273, baseType: !774, size: 64, offset: 4864)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !776)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !654, file: !79, line: 276, baseType: !778, size: 32768, offset: 4928)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 32768, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 4096)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !654, file: !79, line: 277, baseType: !778, size: 32768, offset: 37696)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !654, file: !79, line: 278, baseType: !778, size: 32768, offset: 70464)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !654, file: !79, line: 281, baseType: !570, size: 64, offset: 103232)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !654, file: !79, line: 282, baseType: !570, size: 64, offset: 103296)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !654, file: !79, line: 285, baseType: !786, size: 448, offset: 103360)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !329, line: 102, size: 448, elements: !788)
!788 = !{!789, !791, !792, !793, !794, !795, !796, !801}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !787, file: !329, line: 105, baseType: !790, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !329, line: 100, baseType: !328)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !787, file: !329, line: 108, baseType: !453, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !787, file: !329, line: 111, baseType: !596, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !787, file: !329, line: 112, baseType: !596, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !787, file: !329, line: 115, baseType: !582, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !787, file: !329, line: 118, baseType: !575, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !787, file: !329, line: 121, baseType: !797, size: 64, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !799, line: 26, baseType: !800)
!799 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !799, line: 25, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !787, file: !329, line: 124, baseType: !570, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !654, file: !79, line: 288, baseType: !575, size: 32, offset: 103808)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !654, file: !79, line: 291, baseType: !804, size: 64, offset: 103872)
!804 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !640)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !654, file: !79, line: 294, baseType: !797, size: 64, offset: 103936)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !654, file: !79, line: 297, baseType: !807, size: 256, offset: 104000)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !186, line: 40, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !186, line: 27, size: 256, elements: !809)
!809 = !{!810, !811, !812, !815}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !808, file: !186, line: 30, baseType: !596, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !808, file: !186, line: 33, baseType: !570, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !808, file: !186, line: 36, baseType: !813, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !808, file: !186, line: 39, baseType: !570, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !654, file: !79, line: 298, baseType: !807, size: 256, offset: 104256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !654, file: !79, line: 299, baseType: !818, size: 64, offset: 104512)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !654, file: !79, line: 302, baseType: !570, size: 64, offset: 104576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !654, file: !79, line: 305, baseType: !570, size: 64, offset: 104640)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !654, file: !79, line: 308, baseType: !722, size: 64, offset: 104704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !654, file: !79, line: 309, baseType: !722, size: 64, offset: 104768)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !79, line: 310, baseType: !722, size: 64, offset: 104832)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !654, file: !79, line: 313, baseType: !825, size: 32, offset: 104896)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !402, line: 47, baseType: !401)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !654, file: !79, line: 316, baseType: !575, size: 32, offset: 104928)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !654, file: !79, line: 319, baseType: !620, size: 64, offset: 104960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !654, file: !79, line: 322, baseType: !722, size: 64, offset: 105024)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !654, file: !79, line: 325, baseType: !699, size: 256, offset: 105088)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !654, file: !79, line: 328, baseType: !582, size: 64, offset: 105344)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !654, file: !79, line: 329, baseType: !582, size: 64, offset: 105408)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !654, file: !79, line: 332, baseType: !636, size: 32, offset: 105472)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !654, file: !79, line: 335, baseType: !575, size: 32, offset: 105504)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !654, file: !79, line: 338, baseType: !764, size: 64, offset: 105536)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !654, file: !79, line: 341, baseType: !575, size: 32, offset: 105600)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !654, file: !79, line: 344, baseType: !570, size: 64, offset: 105664)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !654, file: !79, line: 347, baseType: !838, size: 64, offset: 105728)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !839, line: 7, baseType: !840)
!839 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !643, line: 160, baseType: !644)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !654, file: !79, line: 350, baseType: !842, size: 32, offset: 105792)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !402, line: 79, baseType: !418)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !654, file: !79, line: 353, baseType: !570, size: 64, offset: 105856)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !585, file: !79, line: 443, baseType: !582, size: 64, offset: 2112)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !585, file: !79, line: 446, baseType: !753, size: 64, offset: 2176)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !585, file: !79, line: 449, baseType: !582, size: 64, offset: 2240)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !585, file: !79, line: 450, baseType: !582, size: 64, offset: 2304)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !585, file: !79, line: 453, baseType: !849, size: 64, offset: 2368)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !850, line: 26, baseType: !851)
!850 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!570, !854, !856, !858}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !585, file: !79, line: 456, baseType: !860, size: 64, offset: 2432)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !862, line: 7, baseType: !863)
!862 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !864, line: 49, size: 1728, elements: !865)
!864 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !881, !883, !884, !885, !887, !888, !890, !894, !897, !899, !902, !905, !906, !907, !908, !909}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !863, file: !864, line: 51, baseType: !453, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !863, file: !864, line: 54, baseType: !596, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !863, file: !864, line: 55, baseType: !596, size: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !863, file: !864, line: 56, baseType: !596, size: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !863, file: !864, line: 57, baseType: !596, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !863, file: !864, line: 58, baseType: !596, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !863, file: !864, line: 59, baseType: !596, size: 64, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !863, file: !864, line: 60, baseType: !596, size: 64, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !863, file: !864, line: 61, baseType: !596, size: 64, offset: 512)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !863, file: !864, line: 64, baseType: !596, size: 64, offset: 576)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !863, file: !864, line: 65, baseType: !596, size: 64, offset: 640)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !863, file: !864, line: 66, baseType: !596, size: 64, offset: 704)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !863, file: !864, line: 68, baseType: !879, size: 64, offset: 768)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !864, line: 36, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !863, file: !864, line: 70, baseType: !882, size: 64, offset: 832)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !863, file: !864, line: 72, baseType: !453, size: 32, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !863, file: !864, line: 73, baseType: !453, size: 32, offset: 928)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !863, file: !864, line: 74, baseType: !886, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !643, line: 152, baseType: !644)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !863, file: !864, line: 77, baseType: !625, size: 16, offset: 1024)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !863, file: !864, line: 78, baseType: !889, size: 8, offset: 1040)
!889 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !863, file: !864, line: 79, baseType: !891, size: 8, offset: 1048)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 8, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 1)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !863, file: !864, line: 81, baseType: !895, size: 64, offset: 1088)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !864, line: 43, baseType: null)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !863, file: !864, line: 89, baseType: !898, size: 64, offset: 1152)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !643, line: 153, baseType: !644)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !863, file: !864, line: 91, baseType: !900, size: 64, offset: 1216)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !864, line: 37, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !863, file: !864, line: 92, baseType: !903, size: 64, offset: 1280)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !864, line: 38, flags: DIFlagFwdDecl)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !863, file: !864, line: 93, baseType: !882, size: 64, offset: 1344)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !863, file: !864, line: 94, baseType: !582, size: 64, offset: 1408)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !863, file: !864, line: 95, baseType: !570, size: 64, offset: 1472)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !863, file: !864, line: 96, baseType: !453, size: 32, offset: 1536)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !863, file: !864, line: 98, baseType: !910, size: 160, offset: 1568)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 160, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 20)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !585, file: !79, line: 459, baseType: !582, size: 64, offset: 2496)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !585, file: !79, line: 462, baseType: !570, size: 64, offset: 2560)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !585, file: !79, line: 465, baseType: !778, size: 32768, offset: 2624)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !585, file: !79, line: 466, baseType: !778, size: 32768, offset: 35392)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !585, file: !79, line: 467, baseType: !778, size: 32768, offset: 68160)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !585, file: !79, line: 468, baseType: !778, size: 32768, offset: 100928)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !585, file: !79, line: 471, baseType: !575, size: 32, offset: 133696)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !585, file: !79, line: 474, baseType: !596, size: 64, offset: 133760)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !585, file: !79, line: 477, baseType: !570, size: 64, offset: 133824)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !585, file: !79, line: 478, baseType: !570, size: 64, offset: 133888)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !585, file: !79, line: 481, baseType: !620, size: 64, offset: 133952)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !585, file: !79, line: 484, baseType: !570, size: 64, offset: 134016)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !585, file: !79, line: 487, baseType: !926, size: 32, offset: 134080)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !431, line: 47, baseType: !430)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !585, file: !79, line: 490, baseType: !620, size: 64, offset: 134112)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !585, file: !79, line: 493, baseType: !582, size: 64, offset: 134208)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !585, file: !79, line: 496, baseType: !575, size: 32, offset: 134272)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !402, line: 129, baseType: !624)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !936)
!936 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "CubeInfo", file: !940, line: 321, baseType: !941)
!940 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantize.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0145e3822a3cc6356993eb9536319140")
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CubeInfo", file: !940, line: 257, size: 4032, elements: !942)
!942 = !{!943, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !987, !992, !994, !996, !998, !999, !1000, !1001, !1002, !1003, !1004}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !941, file: !940, line: 260, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInfo", file: !940, line: 246, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NodeInfo", file: !940, line: 227, size: 1536, elements: !947)
!947 = !{!948, !950, !954, !955, !963, !964, !965, !966}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !946, file: !940, line: 230, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !946, file: !940, line: 231, baseType: !951, size: 1024, offset: 64)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 1024, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 16)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "number_unique", scope: !946, file: !940, line: 234, baseType: !764, size: 64, offset: 1088)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "total_color", scope: !946, file: !940, line: 237, baseType: !956, size: 128, offset: 1152)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "RealPixelPacket", file: !940, line: 225, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RealPixelPacket", file: !940, line: 218, size: 128, elements: !958)
!958 = !{!959, !960, !961, !962}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !957, file: !940, line: 221, baseType: !935, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !957, file: !940, line: 222, baseType: !935, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !957, file: !940, line: 223, baseType: !935, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !957, file: !940, line: 224, baseType: !935, size: 32, offset: 96)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_error", scope: !946, file: !940, line: 240, baseType: !935, size: 32, offset: 1280)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "color_number", scope: !946, file: !940, line: 243, baseType: !570, size: 64, offset: 1344)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !946, file: !940, line: 244, baseType: !570, size: 64, offset: 1408)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !946, file: !940, line: 245, baseType: !570, size: 64, offset: 1472)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !941, file: !940, line: 263, baseType: !570, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_colors", scope: !941, file: !940, line: 264, baseType: !570, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_index", scope: !941, file: !940, line: 267, baseType: !640, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_pixels", scope: !941, file: !940, line: 270, baseType: !764, size: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !941, file: !940, line: 273, baseType: !956, size: 128, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !941, file: !940, line: 276, baseType: !935, size: 32, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "pruning_threshold", scope: !941, file: !940, line: 277, baseType: !935, size: 32, offset: 480)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next_threshold", scope: !941, file: !940, line: 278, baseType: !935, size: 32, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !941, file: !940, line: 281, baseType: !570, size: 64, offset: 576)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "free_nodes", scope: !941, file: !940, line: 282, baseType: !570, size: 64, offset: 640)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "color_number", scope: !941, file: !940, line: 283, baseType: !570, size: 64, offset: 704)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "next_node", scope: !941, file: !940, line: 286, baseType: !944, size: 64, offset: 768)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "node_queue", scope: !941, file: !940, line: 289, baseType: !980, size: 64, offset: 832)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nodes", file: !940, line: 255, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Nodes", file: !940, line: 248, size: 128, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !982, file: !940, line: 251, baseType: !944, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !982, file: !940, line: 254, baseType: !986, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "memory_info", scope: !941, file: !940, line: 292, baseType: !988, size: 64, offset: 896)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryInfo", file: !990, line: 26, baseType: !991)
!990 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MemoryInfo", file: !990, line: 25, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !941, file: !940, line: 295, baseType: !993, size: 64, offset: 960)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !941, file: !940, line: 298, baseType: !995, size: 2048, offset: 1024)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 2048, elements: !952)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !941, file: !940, line: 301, baseType: !997, size: 512, offset: 3072)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 512, elements: !952)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_info", scope: !941, file: !940, line: 304, baseType: !565, size: 64, offset: 3584)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "associate_alpha", scope: !941, file: !940, line: 307, baseType: !575, size: 32, offset: 3648)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !941, file: !940, line: 310, baseType: !640, size: 64, offset: 3712)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !941, file: !940, line: 311, baseType: !640, size: 64, offset: 3776)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !941, file: !940, line: 314, baseType: !570, size: 64, offset: 3840)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !941, file: !940, line: 317, baseType: !761, size: 64, offset: 3904)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !941, file: !940, line: 320, baseType: !764, size: 64, offset: 3968)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!1008 = !{i32 7, !"Dwarf Version", i32 5}
!1009 = !{i32 2, !"Debug Info Version", i32 3}
!1010 = !{i32 1, !"wchar_size", i32 4}
!1011 = !{i32 7, !"PIC Level", i32 2}
!1012 = !{i32 7, !"PIE Level", i32 2}
!1013 = !{i32 7, !"uwtable", i32 2}
!1014 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1015 = distinct !DISubprogram(name: "AcquireQuantizeInfo", scope: !940, file: !940, line: 370, type: !1016, scopeLine: 371, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1020)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!565, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!1020 = !{!1021, !1022, !1023, !1026, !1027}
!1021 = !DILocalVariable(name: "image_info", arg: 1, scope: !1015, file: !940, line: 370, type: !1018)
!1022 = !DILocalVariable(name: "quantize_info", scope: !1015, file: !940, line: 373, type: !565)
!1023 = !DILocalVariable(name: "message", scope: !1024, file: !940, line: 377, type: !596)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !940, line: 377, column: 5)
!1025 = distinct !DILexicalBlock(scope: !1015, file: !940, line: 376, column: 7)
!1026 = !DILocalVariable(name: "exception", scope: !1024, file: !940, line: 377, type: !786)
!1027 = !DILocalVariable(name: "option", scope: !1028, file: !940, line: 382, type: !758)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !940, line: 380, column: 5)
!1029 = distinct !DILexicalBlock(scope: !1015, file: !940, line: 379, column: 7)
!1030 = !DILocation(line: 0, scope: !1015)
!1031 = !DILocation(line: 375, column: 34, scope: !1015)
!1032 = !DILocation(line: 376, column: 21, scope: !1025)
!1033 = !DILocation(line: 376, column: 7, scope: !1015)
!1034 = !DILocation(line: 377, column: 5, scope: !1024)
!1035 = !{!1036, !1036, i64 0}
!1036 = !{!"int", !1037, i64 0}
!1037 = !{!"omnipotent char", !1038, i64 0}
!1038 = !{!"Simple C/C++ TBAA"}
!1039 = !DILocation(line: 0, scope: !1024)
!1040 = !DILocalVariable(name: "quantize_info", arg: 1, scope: !1041, file: !940, line: 2235, type: !565)
!1041 = distinct !DISubprogram(name: "GetQuantizeInfo", scope: !940, file: !940, line: 2235, type: !1042, scopeLine: 2236, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1044)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{null, !565}
!1044 = !{!1040}
!1045 = !DILocation(line: 0, scope: !1041, inlinedAt: !1046)
!1046 = distinct !DILocation(line: 378, column: 3, scope: !1015)
!1047 = !DILocation(line: 2237, column: 10, scope: !1041, inlinedAt: !1046)
!1048 = !DILocation(line: 2239, column: 10, scope: !1041, inlinedAt: !1046)
!1049 = !DILocation(line: 2240, column: 31, scope: !1041, inlinedAt: !1046)
!1050 = !{!1051, !1052, i64 0}
!1051 = !{!"_QuantizeInfo", !1052, i64 0, !1052, i64 8, !1037, i64 16, !1037, i64 20, !1037, i64 24, !1052, i64 32, !1037, i64 40}
!1052 = !{!"long", !1037, i64 0}
!1053 = !DILocation(line: 2241, column: 18, scope: !1041, inlinedAt: !1046)
!1054 = !DILocation(line: 2241, column: 24, scope: !1041, inlinedAt: !1046)
!1055 = !{!1051, !1037, i64 16}
!1056 = !DILocation(line: 2242, column: 18, scope: !1041, inlinedAt: !1046)
!1057 = !DILocation(line: 2242, column: 31, scope: !1041, inlinedAt: !1046)
!1058 = !{!1051, !1037, i64 40}
!1059 = !DILocation(line: 2243, column: 18, scope: !1041, inlinedAt: !1046)
!1060 = !DILocation(line: 2243, column: 28, scope: !1041, inlinedAt: !1046)
!1061 = !{!1051, !1037, i64 20}
