; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/quantum-import.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/quantum-import.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!371 = !DIEnumerator(name: "FloatingPointQuantumFormat", value: 1)
!372 = !DIEnumerator(name: "SignedQuantumFormat", value: 2)
!373 = !DIEnumerator(name: "UnsignedQuantumFormat", value: 3)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 37, baseType: !5, size: 32, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIEnumerator(name: "UndefinedQuantumAlpha", value: 0)
!377 = !DIEnumerator(name: "AssociatedQuantumAlpha", value: 1)
!378 = !DIEnumerator(name: "DisassociatedQuantumAlpha", value: 2)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 52, baseType: !5, size: 32, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!381 = !DIEnumerator(name: "UndefinedQuantum", value: 0)
!382 = !DIEnumerator(name: "AlphaQuantum", value: 1)
!383 = !DIEnumerator(name: "BlackQuantum", value: 2)
!384 = !DIEnumerator(name: "BlueQuantum", value: 3)
!385 = !DIEnumerator(name: "CMYKAQuantum", value: 4)
!386 = !DIEnumerator(name: "CMYKQuantum", value: 5)
!387 = !DIEnumerator(name: "CyanQuantum", value: 6)
!388 = !DIEnumerator(name: "GrayAlphaQuantum", value: 7)
!389 = !DIEnumerator(name: "GrayQuantum", value: 8)
!390 = !DIEnumerator(name: "GreenQuantum", value: 9)
!391 = !DIEnumerator(name: "IndexAlphaQuantum", value: 10)
!392 = !DIEnumerator(name: "IndexQuantum", value: 11)
!393 = !DIEnumerator(name: "MagentaQuantum", value: 12)
!394 = !DIEnumerator(name: "OpacityQuantum", value: 13)
!395 = !DIEnumerator(name: "RedQuantum", value: 14)
!396 = !DIEnumerator(name: "RGBAQuantum", value: 15)
!397 = !DIEnumerator(name: "BGRAQuantum", value: 16)
!398 = !DIEnumerator(name: "RGBOQuantum", value: 17)
!399 = !DIEnumerator(name: "RGBQuantum", value: 18)
!400 = !DIEnumerator(name: "YellowQuantum", value: 19)
!401 = !DIEnumerator(name: "GrayPadQuantum", value: 20)
!402 = !DIEnumerator(name: "RGBPadQuantum", value: 21)
!403 = !DIEnumerator(name: "CbYCrYQuantum", value: 22)
!404 = !DIEnumerator(name: "CbYCrQuantum", value: 23)
!405 = !DIEnumerator(name: "CbYCrAQuantum", value: 24)
!406 = !DIEnumerator(name: "CMYKOQuantum", value: 25)
!407 = !DIEnumerator(name: "BGRQuantum", value: 26)
!408 = !DIEnumerator(name: "BGROQuantum", value: 27)
!409 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !410, line: 34, baseType: !5, size: 32, elements: !411)
!410 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!412 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!413 = !DIEnumerator(name: "NoEvents", value: 0)
!414 = !DIEnumerator(name: "TraceEvent", value: 1)
!415 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!416 = !DIEnumerator(name: "BlobEvent", value: 4)
!417 = !DIEnumerator(name: "CacheEvent", value: 8)
!418 = !DIEnumerator(name: "CoderEvent", value: 16)
!419 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!420 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!421 = !DIEnumerator(name: "DrawEvent", value: 128)
!422 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!423 = !DIEnumerator(name: "ImageEvent", value: 512)
!424 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!425 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!426 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!427 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!428 = !DIEnumerator(name: "TransformEvent", value: 16384)
!429 = !DIEnumerator(name: "UserEvent", value: 36864)
!430 = !DIEnumerator(name: "WandEvent", value: 65536)
!431 = !DIEnumerator(name: "X11Event", value: 131072)
!432 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!433 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!434 = !{!435, !436, !439, !440, !444, !488, !493, !456, !495, !5, !494, !497, !498, !500, !501, !450, !502, !503, !438, !504}
!435 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!438 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !442, line: 50, baseType: !443)
!442 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumInfo", file: !147, line: 85, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumInfo", file: !447, line: 42, size: 1216, elements: !448)
!447 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!448 = !{!449, !452, !453, !455, !457, !458, !459, !460, !462, !463, !465, !466, !469, !470, !472, !482, !487}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !446, file: !447, line: 45, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !451, line: 46, baseType: !435)
!451 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!452 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !446, file: !447, line: 46, baseType: !450, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !446, file: !447, line: 49, baseType: !454, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumFormatType", file: !147, line: 50, baseType: !368)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !446, file: !447, line: 52, baseType: !456, size: 64, offset: 192)
!456 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !446, file: !447, line: 53, baseType: !456, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !446, file: !447, line: 54, baseType: !456, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !446, file: !447, line: 57, baseType: !450, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "min_is_white", scope: !446, file: !447, line: 60, baseType: !461, size: 32, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !446, file: !447, line: 61, baseType: !461, size: 32, offset: 480)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_type", scope: !446, file: !447, line: 64, baseType: !464, size: 32, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAlphaType", file: !147, line: 42, baseType: !374)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !446, file: !447, line: 67, baseType: !450, size: 64, offset: 576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !446, file: !447, line: 70, baseType: !467, size: 64, offset: 640)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !446, file: !447, line: 73, baseType: !450, size: 64, offset: 704)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !446, file: !447, line: 76, baseType: !471, size: 32, offset: 768)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !446, file: !447, line: 79, baseType: !473, size: 256, offset: 832)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumState", file: !447, line: 40, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumState", file: !447, line: 27, size: 256, elements: !475)
!475 = !{!476, !477, !478, !479}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_scale", scope: !474, file: !447, line: 30, baseType: !456, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !474, file: !447, line: 33, baseType: !5, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !474, file: !447, line: 36, baseType: !450, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !474, file: !447, line: 39, baseType: !480, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !446, file: !447, line: 82, baseType: !483, size: 64, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !485, line: 26, baseType: !486)
!485 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !485, line: 25, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !446, file: !447, line: 85, baseType: !450, size: 64, offset: 1152)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !489, line: 77, baseType: !490)
!489 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !491, line: 193, baseType: !492)
!491 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!492 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !494)
!494 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !496)
!496 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !499)
!499 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAny", file: !4, line: 170, baseType: !498)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !493)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!506 = !{i32 7, !"Dwarf Version", i32 5}
!507 = !{i32 2, !"Debug Info Version", i32 3}
!508 = !{i32 1, !"wchar_size", i32 4}
!509 = !{i32 7, !"PIC Level", i32 2}
!510 = !{i32 7, !"PIE Level", i32 2}
!511 = !{i32 7, !"uwtable", i32 2}
!512 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!513 = distinct !DISubprogram(name: "ImportQuantumPixels", scope: !514, file: !514, line: 3367, type: !515, scopeLine: 3370, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !723)
!514 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-import.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "63fc2670d14d5d2a12802d07bf1ec1b7")
!515 = !DISubroutineType(types: !516)
!516 = !{!450, !517, !440, !717, !719, !721, !722}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !520)
!520 = !{!521, !523, !525, !527, !528, !530, !531, !532, !533, !534, !535, !536, !545, !546, !547, !548, !549, !563, !565, !566, !568, !571, !572, !573, !574, !575, !576, !584, !585, !586, !587, !588, !589, !591, !593, !594, !596, !598, !600, !602, !603, !604, !605, !606, !607, !608, !616, !631, !643, !644, !645, !646, !650, !654, !658, !659, !660, !661, !662, !676, !677, !679, !680, !688, !689, !691, !692, !693, !694, !695, !696, !698, !699, !700, !701, !702, !703, !704, !706, !707, !708, !709, !710, !714, !716}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !519, file: !73, line: 153, baseType: !522, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !519, file: !73, line: 156, baseType: !524, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !519, file: !73, line: 159, baseType: !526, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !519, file: !73, line: 162, baseType: !450, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !519, file: !73, line: 165, baseType: !529, size: 32, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !519, file: !73, line: 168, baseType: !461, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !519, file: !73, line: 169, baseType: !461, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !519, file: !73, line: 172, baseType: !450, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !519, file: !73, line: 173, baseType: !450, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !519, file: !73, line: 174, baseType: !450, size: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !519, file: !73, line: 175, baseType: !450, size: 64, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !519, file: !73, line: 178, baseType: !537, size: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !540)
!540 = !{!541, !542, !543, !544}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !539, file: !326, line: 143, baseType: !493, size: 16)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !539, file: !326, line: 144, baseType: !493, size: 16, offset: 16)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !539, file: !326, line: 145, baseType: !493, size: 16, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !539, file: !326, line: 146, baseType: !493, size: 16, offset: 48)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !519, file: !73, line: 179, baseType: !538, size: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !519, file: !73, line: 180, baseType: !538, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !519, file: !73, line: 181, baseType: !538, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !519, file: !73, line: 184, baseType: !456, size: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !519, file: !73, line: 187, baseType: !550, size: 768, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !552)
!552 = !{!553, !560, !561, !562}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !551, file: !73, line: 124, baseType: !554, size: 192)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !555, file: !73, line: 98, baseType: !456, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !555, file: !73, line: 99, baseType: !456, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !555, file: !73, line: 100, baseType: !456, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !551, file: !73, line: 125, baseType: !554, size: 192, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !551, file: !73, line: 126, baseType: !554, size: 192, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !551, file: !73, line: 127, baseType: !554, size: 192, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !519, file: !73, line: 190, baseType: !564, size: 32, offset: 1664)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !519, file: !73, line: 193, baseType: !439, size: 64, offset: 1728)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !519, file: !73, line: 196, baseType: !567, size: 32, offset: 1792)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !519, file: !73, line: 199, baseType: !569, size: 64, offset: 1856)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !519, file: !73, line: 200, baseType: !569, size: 64, offset: 1920)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !519, file: !73, line: 201, baseType: !569, size: 64, offset: 1984)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !519, file: !73, line: 204, baseType: !488, size: 64, offset: 2048)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !519, file: !73, line: 207, baseType: !456, size: 64, offset: 2112)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !519, file: !73, line: 208, baseType: !456, size: 64, offset: 2176)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !519, file: !73, line: 211, baseType: !577, size: 256, offset: 2240)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !579)
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !578, file: !153, line: 124, baseType: !450, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !578, file: !153, line: 125, baseType: !450, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !578, file: !153, line: 128, baseType: !488, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !578, file: !153, line: 129, baseType: !488, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !519, file: !73, line: 212, baseType: !577, size: 256, offset: 2496)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !519, file: !73, line: 213, baseType: !577, size: 256, offset: 2752)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !519, file: !73, line: 216, baseType: !456, size: 64, offset: 3008)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !519, file: !73, line: 217, baseType: !456, size: 64, offset: 3072)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !519, file: !73, line: 218, baseType: !456, size: 64, offset: 3136)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !519, file: !73, line: 221, baseType: !590, size: 32, offset: 3200)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !519, file: !73, line: 224, baseType: !592, size: 32, offset: 3232)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !519, file: !73, line: 227, baseType: !471, size: 32, offset: 3264)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !519, file: !73, line: 230, baseType: !595, size: 32, offset: 3296)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !519, file: !73, line: 233, baseType: !597, size: 32, offset: 3328)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !519, file: !73, line: 236, baseType: !599, size: 32, offset: 3360)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !519, file: !73, line: 239, baseType: !601, size: 64, offset: 3392)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !519, file: !73, line: 242, baseType: !450, size: 64, offset: 3456)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !519, file: !73, line: 243, baseType: !450, size: 64, offset: 3520)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !519, file: !73, line: 246, baseType: !488, size: 64, offset: 3584)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !519, file: !73, line: 249, baseType: !450, size: 64, offset: 3648)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !519, file: !73, line: 250, baseType: !450, size: 64, offset: 3712)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !519, file: !73, line: 253, baseType: !488, size: 64, offset: 3776)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !519, file: !73, line: 256, baseType: !609, size: 192, offset: 3840)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !610, line: 68, baseType: !611)
!610 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !610, line: 62, size: 192, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !611, file: !610, line: 65, baseType: !456, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !611, file: !610, line: 66, baseType: !456, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !611, file: !610, line: 67, baseType: !456, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !519, file: !73, line: 259, baseType: !617, size: 512, offset: 4032)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !619)
!619 = !{!620, !627, !628, !630}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !618, file: !247, line: 43, baseType: !621, size: 192)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !623)
!623 = !{!624, !625, !626}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !622, file: !247, line: 35, baseType: !456, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !622, file: !247, line: 36, baseType: !456, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !622, file: !247, line: 37, baseType: !456, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !618, file: !247, line: 44, baseType: !621, size: 192, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !618, file: !247, line: 47, baseType: !629, size: 32, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !618, file: !247, line: 50, baseType: !450, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !519, file: !73, line: 262, baseType: !632, size: 64, offset: 4544)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !633, line: 26, baseType: !634)
!633 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!461, !637, !639, !642, !439}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !641)
!641 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !519, file: !73, line: 265, baseType: !439, size: 64, offset: 4608)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !519, file: !73, line: 266, baseType: !439, size: 64, offset: 4672)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !519, file: !73, line: 267, baseType: !439, size: 64, offset: 4736)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !519, file: !73, line: 270, baseType: !647, size: 64, offset: 4800)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !649)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !519, file: !73, line: 273, baseType: !651, size: 64, offset: 4864)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !653)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !519, file: !73, line: 276, baseType: !655, size: 32768, offset: 4928)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 32768, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 4096)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !519, file: !73, line: 277, baseType: !655, size: 32768, offset: 37696)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !519, file: !73, line: 278, baseType: !655, size: 32768, offset: 70464)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !519, file: !73, line: 281, baseType: !450, size: 64, offset: 103232)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !519, file: !73, line: 282, baseType: !450, size: 64, offset: 103296)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !519, file: !73, line: 285, baseType: !663, size: 448, offset: 103360)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !665)
!665 = !{!666, !668, !670, !671, !672, !673, !674, !675}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !664, file: !253, line: 105, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !664, file: !253, line: 108, baseType: !669, size: 32, offset: 32)
!669 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !664, file: !253, line: 111, baseType: !569, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !664, file: !253, line: 112, baseType: !569, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !664, file: !253, line: 115, baseType: !439, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !664, file: !253, line: 118, baseType: !461, size: 32, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !664, file: !253, line: 121, baseType: !483, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !664, file: !253, line: 124, baseType: !450, size: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !519, file: !73, line: 288, baseType: !461, size: 32, offset: 103808)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !519, file: !73, line: 291, baseType: !678, size: 64, offset: 103872)
!678 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !488)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !519, file: !73, line: 294, baseType: !483, size: 64, offset: 103936)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !519, file: !73, line: 297, baseType: !681, size: 256, offset: 104000)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !682, file: !89, line: 30, baseType: !569, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !682, file: !89, line: 33, baseType: !450, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !682, file: !89, line: 36, baseType: !468, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !682, file: !89, line: 39, baseType: !450, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !519, file: !73, line: 298, baseType: !681, size: 256, offset: 104256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !519, file: !73, line: 299, baseType: !690, size: 64, offset: 104512)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !519, file: !73, line: 302, baseType: !450, size: 64, offset: 104576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !519, file: !73, line: 305, baseType: !450, size: 64, offset: 104640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !519, file: !73, line: 308, baseType: !601, size: 64, offset: 104704)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !519, file: !73, line: 309, baseType: !601, size: 64, offset: 104768)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !73, line: 310, baseType: !601, size: 64, offset: 104832)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !519, file: !73, line: 313, baseType: !697, size: 32, offset: 104896)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !519, file: !73, line: 316, baseType: !461, size: 32, offset: 104928)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !519, file: !73, line: 319, baseType: !538, size: 64, offset: 104960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !519, file: !73, line: 322, baseType: !601, size: 64, offset: 105024)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !519, file: !73, line: 325, baseType: !577, size: 256, offset: 105088)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !519, file: !73, line: 328, baseType: !439, size: 64, offset: 105344)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !519, file: !73, line: 329, baseType: !439, size: 64, offset: 105408)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !519, file: !73, line: 332, baseType: !705, size: 32, offset: 105472)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !519, file: !73, line: 335, baseType: !461, size: 32, offset: 105504)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !519, file: !73, line: 338, baseType: !498, size: 64, offset: 105536)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !519, file: !73, line: 341, baseType: !461, size: 32, offset: 105600)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !519, file: !73, line: 344, baseType: !450, size: 64, offset: 105664)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !519, file: !73, line: 347, baseType: !711, size: 64, offset: 105728)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !712, line: 7, baseType: !713)
!712 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !491, line: 160, baseType: !492)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !519, file: !73, line: 350, baseType: !715, size: 32, offset: 105792)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !519, file: !73, line: 353, baseType: !450, size: 64, offset: 105856)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumType", file: !147, line: 82, baseType: !379)
!721 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !436)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !734, !735, !737, !738, !741, !742, !745, !748}
!724 = !DILocalVariable(name: "image", arg: 1, scope: !513, file: !514, line: 3367, type: !517)
!725 = !DILocalVariable(name: "image_view", arg: 2, scope: !513, file: !514, line: 3367, type: !440)
!726 = !DILocalVariable(name: "quantum_info", arg: 3, scope: !513, file: !514, line: 3368, type: !717)
!727 = !DILocalVariable(name: "quantum_type", arg: 4, scope: !513, file: !514, line: 3368, type: !719)
!728 = !DILocalVariable(name: "pixels", arg: 5, scope: !513, file: !514, line: 3369, type: !721)
!729 = !DILocalVariable(name: "exception", arg: 6, scope: !513, file: !514, line: 3369, type: !722)
!730 = !DILocalVariable(name: "number_pixels", scope: !513, file: !514, line: 3372, type: !498)
!731 = !DILocalVariable(name: "p", scope: !513, file: !514, line: 3375, type: !721)
!732 = !DILocalVariable(name: "indexes", scope: !513, file: !514, line: 3378, type: !733)
!733 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !502)
!734 = !DILocalVariable(name: "x", scope: !513, file: !514, line: 3381, type: !488)
!735 = !DILocalVariable(name: "q", scope: !513, file: !514, line: 3384, type: !736)
!736 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !537)
!737 = !DILocalVariable(name: "extent", scope: !513, file: !514, line: 3387, type: !450)
!738 = !DILocalVariable(name: "quantum", scope: !739, file: !514, line: 3515, type: !493)
!739 = distinct !DILexicalBlock(scope: !740, file: !514, line: 3513, column: 5)
!740 = distinct !DILexicalBlock(scope: !513, file: !514, line: 3512, column: 7)
!741 = !DILocalVariable(name: "q", scope: !739, file: !514, line: 3518, type: !736)
!742 = !DILocalVariable(name: "q", scope: !743, file: !514, line: 3534, type: !736)
!743 = distinct !DILexicalBlock(scope: !744, file: !514, line: 3532, column: 5)
!744 = distinct !DILexicalBlock(scope: !513, file: !514, line: 3531, column: 7)
!745 = !DILocalVariable(name: "alpha", scope: !746, file: !514, line: 3548, type: !495)
!746 = distinct !DILexicalBlock(scope: !747, file: !514, line: 3546, column: 5)
!747 = distinct !DILexicalBlock(scope: !513, file: !514, line: 3545, column: 7)
!748 = !DILocalVariable(name: "q", scope: !746, file: !514, line: 3551, type: !736)
!749 = !DILocation(line: 0, scope: !513)
!750 = !DILocation(line: 3391, column: 14, scope: !751)
!751 = distinct !DILexicalBlock(scope: !513, file: !514, line: 3391, column: 7)
!752 = !{!753, !754, i64 12976}
