; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/encoder/ratecontrol.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/encoder/ratecontrol.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_level_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, float, float, float, i32, float, i32, i32, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }

!23 = !DIEnumerator(name: "P_SKIP", value: 6)
!24 = !DIEnumerator(name: "B_DIRECT", value: 7)
!25 = !DIEnumerator(name: "B_L0_L0", value: 8)
!26 = !DIEnumerator(name: "B_L0_L1", value: 9)
!27 = !DIEnumerator(name: "B_L0_BI", value: 10)
!28 = !DIEnumerator(name: "B_L1_L0", value: 11)
!29 = !DIEnumerator(name: "B_L1_L1", value: 12)
!30 = !DIEnumerator(name: "B_L1_BI", value: 13)
!31 = !DIEnumerator(name: "B_BI_L0", value: 14)
!32 = !DIEnumerator(name: "B_BI_L1", value: 15)
!33 = !DIEnumerator(name: "B_BI_BI", value: 16)
!34 = !DIEnumerator(name: "B_8x8", value: 17)
!35 = !DIEnumerator(name: "B_SKIP", value: 18)
!36 = !DIEnumerator(name: "X264_MBTYPE_MAX", value: 19)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 30, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9056d80edbb4dc2514d271d596c298e")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!40 = !DIEnumerator(name: "PIXEL_16x16", value: 0)
!41 = !DIEnumerator(name: "PIXEL_16x8", value: 1)
!42 = !DIEnumerator(name: "PIXEL_8x16", value: 2)
!43 = !DIEnumerator(name: "PIXEL_8x8", value: 3)
!44 = !DIEnumerator(name: "PIXEL_8x4", value: 4)
!45 = !DIEnumerator(name: "PIXEL_4x8", value: 5)
!46 = !DIEnumerator(name: "PIXEL_4x4", value: 6)
!47 = !DIEnumerator(name: "PIXEL_4x2", value: 7)
!48 = !DIEnumerator(name: "PIXEL_2x4", value: 8)
!49 = !DIEnumerator(name: "PIXEL_2x2", value: 9)
!50 = !{!51, !52, !53, !58, !59, !60, !63}
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !54, line: 25, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !56, line: 39, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!57 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!58 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !61, line: 26, baseType: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !56, line: 42, baseType: !7)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 27, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !56, line: 44, baseType: !65)
!65 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!66 = !{!0}
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 40, elements: !70)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!70 = !{!71}
!71 = !DISubrange(count: 5)
!72 = !{i32 7, !"Dwarf Version", i32 5}
!73 = !{i32 2, !"Debug Info Version", i32 3}
!74 = !{i32 1, !"wchar_size", i32 4}
!75 = !{i32 7, !"PIC Level", i32 2}
!76 = !{i32 7, !"PIE Level", i32 2}
!77 = !{i32 7, !"uwtable", i32 2}
!78 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!79 = distinct !DISubprogram(name: "x264_adaptive_quant_frame", scope: !80, file: !80, line: 236, type: !81, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1541)
!80 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/ratecontrol.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3bb55dbdd06cfac0d584117dca42ff36")
!81 = !DISubroutineType(types: !82)
!82 = !{null, !83, !569}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !6, line: 381, size: 266752, elements: !87)
!87 = !{!88, !260, !264, !265, !266, !267, !268, !269, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !404, !406, !434, !436, !437, !438, !444, !448, !449, !450, !457, !461, !462, !463, !468, !471, !472, !547, !564, !724, !725, !726, !727, !731, !732, !733, !734, !735, !736, !737, !752, !946, !1116, !1173, !1176, !1178, !1180, !1181, !1184, !1189, !1198, !1199, !1207, !1209, !1214, !1289, !1373, !1417, !1439, !1488, !1517}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !86, file: !6, line: 384, baseType: !89, size: 5632)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !85, line: 376, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !85, line: 176, size: 5632, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !135, !142, !143, !144, !145, !149, !150, !164, !165, !166, !167, !168, !198, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !90, file: !85, line: 179, baseType: !7, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !90, file: !85, line: 180, baseType: !51, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !90, file: !85, line: 181, baseType: !51, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !90, file: !85, line: 182, baseType: !51, size: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !90, file: !85, line: 183, baseType: !51, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !90, file: !85, line: 186, baseType: !51, size: 32, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !90, file: !85, line: 187, baseType: !51, size: 32, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !90, file: !85, line: 188, baseType: !51, size: 32, offset: 224)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !90, file: !85, line: 189, baseType: !51, size: 32, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !90, file: !85, line: 190, baseType: !51, size: 32, offset: 288)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !90, file: !85, line: 198, baseType: !51, size: 32, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !90, file: !85, line: 215, baseType: !104, size: 288, offset: 352)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !85, line: 200, size: 288, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !104, file: !85, line: 203, baseType: !51, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !104, file: !85, line: 204, baseType: !51, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !104, file: !85, line: 206, baseType: !51, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !104, file: !85, line: 209, baseType: !51, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !104, file: !85, line: 210, baseType: !51, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !104, file: !85, line: 211, baseType: !51, size: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !104, file: !85, line: 212, baseType: !51, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !104, file: !85, line: 213, baseType: !51, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !104, file: !85, line: 214, baseType: !51, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !90, file: !85, line: 218, baseType: !51, size: 32, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !90, file: !85, line: 219, baseType: !51, size: 32, offset: 672)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !90, file: !85, line: 220, baseType: !51, size: 32, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !90, file: !85, line: 221, baseType: !51, size: 32, offset: 736)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !90, file: !85, line: 222, baseType: !51, size: 32, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !90, file: !85, line: 224, baseType: !51, size: 32, offset: 800)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !90, file: !85, line: 225, baseType: !51, size: 32, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !90, file: !85, line: 226, baseType: !51, size: 32, offset: 864)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !90, file: !85, line: 227, baseType: !51, size: 32, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !90, file: !85, line: 229, baseType: !51, size: 32, offset: 928)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !90, file: !85, line: 230, baseType: !51, size: 32, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !90, file: !85, line: 231, baseType: !51, size: 32, offset: 992)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !90, file: !85, line: 233, baseType: !51, size: 32, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !90, file: !85, line: 234, baseType: !51, size: 32, offset: 1056)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !90, file: !85, line: 236, baseType: !51, size: 32, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !90, file: !85, line: 237, baseType: !51, size: 32, offset: 1120)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !90, file: !85, line: 239, baseType: !51, size: 32, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !90, file: !85, line: 240, baseType: !133, size: 64, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !90, file: !85, line: 241, baseType: !136, size: 128, offset: 1280)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !140)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !61, line: 24, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !56, line: 38, baseType: !139)
!139 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!140 = !{!141}
!141 = !DISubrange(count: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !90, file: !85, line: 242, baseType: !136, size: 128, offset: 1408)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !90, file: !85, line: 243, baseType: !136, size: 128, offset: 1536)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !90, file: !85, line: 244, baseType: !136, size: 128, offset: 1664)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !90, file: !85, line: 245, baseType: !146, size: 512, offset: 1792)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 512, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !90, file: !85, line: 246, baseType: !146, size: 512, offset: 2304)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !90, file: !85, line: 249, baseType: !151, size: 64, offset: 2816)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !59, !51, !154, !156}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !158)
!158 = !{!159, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !157, file: !160, baseType: !7, size: 32)
!160 = !DIFile(filename: "apps/525.x264_r/src/x264_src/encoder/ratecontrol.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !157, file: !160, baseType: !7, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !157, file: !160, baseType: !59, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !157, file: !160, baseType: !59, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !90, file: !85, line: 250, baseType: !59, size: 64, offset: 2880)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !90, file: !85, line: 251, baseType: !51, size: 32, offset: 2944)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !90, file: !85, line: 252, baseType: !51, size: 32, offset: 2976)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !90, file: !85, line: 253, baseType: !133, size: 64, offset: 3008)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !90, file: !85, line: 287, baseType: !169, size: 800, offset: 3072)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !85, line: 256, size: 800, elements: !170)
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !196, !197}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !169, file: !85, line: 258, baseType: !7, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !169, file: !85, line: 259, baseType: !7, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !169, file: !85, line: 261, baseType: !51, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !169, file: !85, line: 262, baseType: !51, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !169, file: !85, line: 263, baseType: !51, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !169, file: !85, line: 264, baseType: !51, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !169, file: !85, line: 265, baseType: !51, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !169, file: !85, line: 267, baseType: !51, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !169, file: !85, line: 268, baseType: !51, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !169, file: !85, line: 269, baseType: !51, size: 32, offset: 288)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !169, file: !85, line: 270, baseType: !51, size: 32, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !169, file: !85, line: 271, baseType: !51, size: 32, offset: 352)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !169, file: !85, line: 272, baseType: !51, size: 32, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !169, file: !85, line: 273, baseType: !51, size: 32, offset: 416)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !169, file: !85, line: 274, baseType: !51, size: 32, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !169, file: !85, line: 275, baseType: !51, size: 32, offset: 480)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !169, file: !85, line: 276, baseType: !51, size: 32, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !169, file: !85, line: 277, baseType: !51, size: 32, offset: 544)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !169, file: !85, line: 278, baseType: !52, size: 32, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !169, file: !85, line: 279, baseType: !52, size: 32, offset: 608)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !169, file: !85, line: 280, baseType: !51, size: 32, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !169, file: !85, line: 283, baseType: !193, size: 64, offset: 672)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 2)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !169, file: !85, line: 285, baseType: !51, size: 32, offset: 736)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !169, file: !85, line: 286, baseType: !51, size: 32, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !90, file: !85, line: 327, baseType: !199, size: 1152, offset: 3904)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !85, line: 290, size: 1152, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !238, !239}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !199, file: !85, line: 292, baseType: !51, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !199, file: !85, line: 294, baseType: !51, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !199, file: !85, line: 295, baseType: !51, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !199, file: !85, line: 296, baseType: !51, size: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !199, file: !85, line: 297, baseType: !51, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !199, file: !85, line: 299, baseType: !51, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !199, file: !85, line: 300, baseType: !52, size: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !199, file: !85, line: 301, baseType: !52, size: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !199, file: !85, line: 302, baseType: !52, size: 32, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !199, file: !85, line: 303, baseType: !51, size: 32, offset: 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !199, file: !85, line: 304, baseType: !51, size: 32, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !199, file: !85, line: 305, baseType: !52, size: 32, offset: 352)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !199, file: !85, line: 306, baseType: !52, size: 32, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !199, file: !85, line: 307, baseType: !52, size: 32, offset: 416)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !199, file: !85, line: 309, baseType: !51, size: 32, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !199, file: !85, line: 310, baseType: !52, size: 32, offset: 480)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !199, file: !85, line: 311, baseType: !51, size: 32, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !199, file: !85, line: 312, baseType: !51, size: 32, offset: 544)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !199, file: !85, line: 315, baseType: !51, size: 32, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !199, file: !85, line: 316, baseType: !133, size: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !199, file: !85, line: 317, baseType: !51, size: 32, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !199, file: !85, line: 318, baseType: !133, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !199, file: !85, line: 321, baseType: !52, size: 32, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !199, file: !85, line: 322, baseType: !52, size: 32, offset: 864)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !199, file: !85, line: 323, baseType: !52, size: 32, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !199, file: !85, line: 324, baseType: !227, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !85, line: 174, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 167, size: 256, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !229, file: !85, line: 169, baseType: !51, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !229, file: !85, line: 169, baseType: !51, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !229, file: !85, line: 170, baseType: !51, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !229, file: !85, line: 171, baseType: !51, size: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !229, file: !85, line: 172, baseType: !52, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !229, file: !85, line: 173, baseType: !237, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !199, file: !85, line: 325, baseType: !51, size: 32, offset: 1024)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !199, file: !85, line: 326, baseType: !133, size: 64, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !90, file: !85, line: 330, baseType: !51, size: 32, offset: 5056)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !90, file: !85, line: 331, baseType: !51, size: 32, offset: 5088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !90, file: !85, line: 332, baseType: !51, size: 32, offset: 5120)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !90, file: !85, line: 334, baseType: !51, size: 32, offset: 5152)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !90, file: !85, line: 335, baseType: !51, size: 32, offset: 5184)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !90, file: !85, line: 336, baseType: !60, size: 32, offset: 5216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !90, file: !85, line: 337, baseType: !60, size: 32, offset: 5248)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !90, file: !85, line: 338, baseType: !60, size: 32, offset: 5280)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !90, file: !85, line: 339, baseType: !60, size: 32, offset: 5312)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !90, file: !85, line: 340, baseType: !51, size: 32, offset: 5344)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !90, file: !85, line: 344, baseType: !51, size: 32, offset: 5376)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !90, file: !85, line: 356, baseType: !51, size: 32, offset: 5408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !90, file: !85, line: 364, baseType: !51, size: 32, offset: 5440)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !90, file: !85, line: 367, baseType: !51, size: 32, offset: 5472)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !90, file: !85, line: 368, baseType: !51, size: 32, offset: 5504)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !90, file: !85, line: 369, baseType: !51, size: 32, offset: 5536)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !90, file: !85, line: 375, baseType: !257, size: 64, offset: 5568)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !59}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !86, file: !6, line: 386, baseType: !261, size: 8256, offset: 5632)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 8256, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 129)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !86, file: !6, line: 387, baseType: !51, size: 32, offset: 13888)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !86, file: !6, line: 388, baseType: !51, size: 32, offset: 13920)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !86, file: !6, line: 389, baseType: !51, size: 32, offset: 13952)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !86, file: !6, line: 390, baseType: !51, size: 32, offset: 13984)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !86, file: !6, line: 391, baseType: !51, size: 32, offset: 14016)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !86, file: !6, line: 402, baseType: !270, size: 576, offset: 14080)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !86, file: !6, line: 394, size: 576, elements: !271)
!271 = !{!272, !273, !274, !284, !285, !286}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !270, file: !6, line: 396, baseType: !51, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !270, file: !6, line: 397, baseType: !51, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !270, file: !6, line: 398, baseType: !275, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !85, line: 604, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 593, size: 192, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !277, file: !85, line: 595, baseType: !51, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !277, file: !85, line: 596, baseType: !51, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !277, file: !85, line: 599, baseType: !51, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !277, file: !85, line: 603, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !270, file: !6, line: 399, baseType: !51, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !270, file: !6, line: 400, baseType: !283, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !270, file: !6, line: 401, baseType: !287, size: 320, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !288, line: 56, baseType: !289)
!288 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !288, line: 47, size: 320, elements: !290)
!290 = !{!291, !292, !293, !294, !297, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !289, file: !288, line: 49, baseType: !283, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !289, file: !288, line: 50, baseType: !283, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !289, file: !288, line: 51, baseType: !283, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !289, file: !288, line: 53, baseType: !295, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !296, line: 87, baseType: !65)
!296 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !289, file: !288, line: 54, baseType: !51, size: 32, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !289, file: !288, line: 55, baseType: !51, size: 32, offset: 288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !86, file: !6, line: 404, baseType: !283, size: 64, offset: 14656)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !86, file: !6, line: 405, baseType: !51, size: 32, offset: 14720)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !86, file: !6, line: 410, baseType: !51, size: 32, offset: 14752)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !86, file: !6, line: 411, baseType: !51, size: 32, offset: 14784)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !86, file: !6, line: 413, baseType: !51, size: 32, offset: 14816)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !86, file: !6, line: 415, baseType: !51, size: 32, offset: 14848)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !86, file: !6, line: 416, baseType: !51, size: 32, offset: 14880)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !86, file: !6, line: 418, baseType: !51, size: 32, offset: 14912)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !86, file: !6, line: 419, baseType: !51, size: 32, offset: 14944)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !86, file: !6, line: 420, baseType: !51, size: 32, offset: 14976)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !86, file: !6, line: 421, baseType: !51, size: 32, offset: 15008)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !86, file: !6, line: 422, baseType: !51, size: 32, offset: 15040)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !86, file: !6, line: 424, baseType: !51, size: 32, offset: 15072)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !86, file: !6, line: 425, baseType: !51, size: 32, offset: 15104)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !86, file: !6, line: 427, baseType: !51, size: 32, offset: 15136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !86, file: !6, line: 430, baseType: !315, size: 10400, offset: 15168)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 10400, elements: !402)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !317, line: 154, baseType: !318)
!317 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 52, size: 10400, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !337, !338, !339, !340, !341, !342, !343, !344, !345, !352, !353, !401}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !318, file: !317, line: 54, baseType: !51, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !318, file: !317, line: 56, baseType: !51, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !318, file: !317, line: 57, baseType: !51, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !318, file: !317, line: 59, baseType: !51, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !318, file: !317, line: 60, baseType: !51, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !318, file: !317, line: 61, baseType: !51, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !318, file: !317, line: 63, baseType: !51, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !318, file: !317, line: 65, baseType: !51, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !318, file: !317, line: 67, baseType: !51, size: 32, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !318, file: !317, line: 69, baseType: !51, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !318, file: !317, line: 70, baseType: !51, size: 32, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !318, file: !317, line: 71, baseType: !51, size: 32, offset: 352)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !318, file: !317, line: 72, baseType: !51, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !318, file: !317, line: 73, baseType: !334, size: 8192, offset: 416)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8192, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !318, file: !317, line: 75, baseType: !51, size: 32, offset: 8608)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !318, file: !317, line: 76, baseType: !51, size: 32, offset: 8640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !318, file: !317, line: 77, baseType: !51, size: 32, offset: 8672)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !318, file: !317, line: 78, baseType: !51, size: 32, offset: 8704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !318, file: !317, line: 79, baseType: !51, size: 32, offset: 8736)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !318, file: !317, line: 80, baseType: !51, size: 32, offset: 8768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !318, file: !317, line: 81, baseType: !51, size: 32, offset: 8800)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !318, file: !317, line: 83, baseType: !51, size: 32, offset: 8832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !318, file: !317, line: 90, baseType: !346, size: 128, offset: 8864)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !317, line: 84, size: 128, elements: !347)
!347 = !{!348, !349, !350, !351}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !346, file: !317, line: 86, baseType: !51, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !346, file: !317, line: 87, baseType: !51, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !346, file: !317, line: 88, baseType: !51, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !346, file: !317, line: 89, baseType: !51, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !318, file: !317, line: 92, baseType: !51, size: 32, offset: 8992)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !318, file: !317, line: 150, baseType: !354, size: 1344, offset: 9024)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !317, line: 93, size: 1344, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !354, file: !317, line: 95, baseType: !51, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !354, file: !317, line: 96, baseType: !51, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !354, file: !317, line: 97, baseType: !51, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !354, file: !317, line: 99, baseType: !51, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !354, file: !317, line: 100, baseType: !51, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !354, file: !317, line: 102, baseType: !51, size: 32, offset: 160)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !354, file: !317, line: 103, baseType: !51, size: 32, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !354, file: !317, line: 104, baseType: !51, size: 32, offset: 224)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !354, file: !317, line: 105, baseType: !51, size: 32, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !354, file: !317, line: 106, baseType: !51, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !354, file: !317, line: 107, baseType: !51, size: 32, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !354, file: !317, line: 108, baseType: !51, size: 32, offset: 352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !354, file: !317, line: 110, baseType: !51, size: 32, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !354, file: !317, line: 111, baseType: !51, size: 32, offset: 416)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !354, file: !317, line: 112, baseType: !51, size: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !354, file: !317, line: 114, baseType: !51, size: 32, offset: 480)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !354, file: !317, line: 115, baseType: !60, size: 32, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !354, file: !317, line: 116, baseType: !60, size: 32, offset: 544)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !354, file: !317, line: 117, baseType: !51, size: 32, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !354, file: !317, line: 119, baseType: !51, size: 32, offset: 608)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !354, file: !317, line: 120, baseType: !51, size: 32, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !354, file: !317, line: 137, baseType: !378, size: 384, offset: 672)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !354, file: !317, line: 122, size: 384, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !378, file: !317, line: 124, baseType: !51, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !378, file: !317, line: 125, baseType: !51, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !378, file: !317, line: 126, baseType: !51, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !378, file: !317, line: 127, baseType: !51, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !378, file: !317, line: 128, baseType: !51, size: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !378, file: !317, line: 129, baseType: !51, size: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !378, file: !317, line: 130, baseType: !51, size: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !378, file: !317, line: 131, baseType: !51, size: 32, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !378, file: !317, line: 133, baseType: !51, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !378, file: !317, line: 134, baseType: !51, size: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !378, file: !317, line: 135, baseType: !51, size: 32, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !378, file: !317, line: 136, baseType: !51, size: 32, offset: 352)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !354, file: !317, line: 139, baseType: !51, size: 32, offset: 1056)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !354, file: !317, line: 140, baseType: !51, size: 32, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !354, file: !317, line: 141, baseType: !51, size: 32, offset: 1120)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !354, file: !317, line: 142, baseType: !51, size: 32, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !354, file: !317, line: 143, baseType: !51, size: 32, offset: 1184)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !354, file: !317, line: 144, baseType: !51, size: 32, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !354, file: !317, line: 145, baseType: !51, size: 32, offset: 1248)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !354, file: !317, line: 146, baseType: !51, size: 32, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !354, file: !317, line: 147, baseType: !51, size: 32, offset: 1312)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !318, file: !317, line: 152, baseType: !51, size: 32, offset: 10368)
!402 = !{!403}
!403 = !DISubrange(count: 1)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !86, file: !6, line: 431, baseType: !405, size: 64, offset: 25600)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !86, file: !6, line: 432, baseType: !407, size: 960, offset: 25664)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 960, elements: !402)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !317, line: 186, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 156, size: 960, elements: !410)
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !409, file: !317, line: 158, baseType: !51, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !409, file: !317, line: 159, baseType: !51, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !409, file: !317, line: 161, baseType: !51, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !409, file: !317, line: 163, baseType: !51, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !409, file: !317, line: 164, baseType: !51, size: 32, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !409, file: !317, line: 166, baseType: !51, size: 32, offset: 160)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !409, file: !317, line: 167, baseType: !51, size: 32, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !409, file: !317, line: 169, baseType: !51, size: 32, offset: 224)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !409, file: !317, line: 170, baseType: !51, size: 32, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !409, file: !317, line: 172, baseType: !51, size: 32, offset: 288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !409, file: !317, line: 173, baseType: !51, size: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !409, file: !317, line: 175, baseType: !51, size: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !409, file: !317, line: 177, baseType: !51, size: 32, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !409, file: !317, line: 178, baseType: !51, size: 32, offset: 416)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !409, file: !317, line: 179, baseType: !51, size: 32, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !409, file: !317, line: 181, baseType: !51, size: 32, offset: 480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !409, file: !317, line: 183, baseType: !51, size: 32, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !409, file: !317, line: 184, baseType: !429, size: 384, offset: 576)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 384, elements: !432)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!432 = !{!433}
!433 = !DISubrange(count: 6)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !86, file: !6, line: 433, baseType: !435, size: 64, offset: 26624)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !86, file: !6, line: 434, baseType: !51, size: 32, offset: 26688)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !86, file: !6, line: 437, baseType: !51, size: 32, offset: 26720)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !86, file: !6, line: 440, baseType: !439, size: 256, offset: 26752)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 256, elements: !442)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 512, elements: !140)
!442 = !{!443}
!443 = !DISubrange(count: 4)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !86, file: !6, line: 441, baseType: !445, size: 128, offset: 27008)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 128, elements: !194)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2048, elements: !147)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !86, file: !6, line: 443, baseType: !439, size: 256, offset: 27136)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !86, file: !6, line: 444, baseType: !445, size: 128, offset: 27392)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !86, file: !6, line: 446, baseType: !451, size: 256, offset: 27520)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 256, elements: !442)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 256, elements: !140)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !61, line: 25, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !56, line: 40, baseType: !456)
!456 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !86, file: !6, line: 447, baseType: !458, size: 128, offset: 27776)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 128, elements: !194)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 1024, elements: !147)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !86, file: !6, line: 448, baseType: !451, size: 256, offset: 27904)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !86, file: !6, line: 449, baseType: !458, size: 128, offset: 28160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !86, file: !6, line: 454, baseType: !464, size: 5888, offset: 28288)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 5888, elements: !466)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!466 = !{!467}
!467 = !DISubrange(count: 92)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !86, file: !6, line: 455, baseType: !469, size: 23552, offset: 34176)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 23552, elements: !470)
!470 = !{!467, !443}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !86, file: !6, line: 457, baseType: !430, size: 64, offset: 57728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !86, file: !6, line: 460, baseType: !473, size: 53376, offset: 57856)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !6, line: 364, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 302, size: 53376, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !504, !531, !532, !533, !539, !540, !541, !542, !543, !544, !545, !546}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !474, file: !6, line: 304, baseType: !405, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !474, file: !6, line: 305, baseType: !435, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !474, file: !6, line: 307, baseType: !51, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !474, file: !6, line: 308, baseType: !51, size: 32, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !474, file: !6, line: 309, baseType: !51, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !474, file: !6, line: 311, baseType: !51, size: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !474, file: !6, line: 313, baseType: !51, size: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !474, file: !6, line: 315, baseType: !51, size: 32, offset: 288)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !474, file: !6, line: 316, baseType: !51, size: 32, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !474, file: !6, line: 317, baseType: !51, size: 32, offset: 352)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !474, file: !6, line: 319, baseType: !51, size: 32, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !474, file: !6, line: 321, baseType: !51, size: 32, offset: 416)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !474, file: !6, line: 322, baseType: !51, size: 32, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !474, file: !6, line: 324, baseType: !193, size: 64, offset: 480)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !474, file: !6, line: 325, baseType: !51, size: 32, offset: 544)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !474, file: !6, line: 327, baseType: !51, size: 32, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !474, file: !6, line: 329, baseType: !51, size: 32, offset: 608)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !474, file: !6, line: 330, baseType: !51, size: 32, offset: 640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !474, file: !6, line: 331, baseType: !51, size: 32, offset: 672)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !474, file: !6, line: 333, baseType: !51, size: 32, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !474, file: !6, line: 334, baseType: !51, size: 32, offset: 736)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !474, file: !6, line: 339, baseType: !498, size: 2048, offset: 768)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 2048, elements: !503)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !6, line: 335, size: 64, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !499, file: !6, line: 337, baseType: !51, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !499, file: !6, line: 338, baseType: !51, size: 32, offset: 32)
!503 = !{!195, !141}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !474, file: !6, line: 342, baseType: !505, size: 49152, align: 128, offset: 2816)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 49152, align: 128, elements: !528)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !507, line: 36, baseType: !508, align: 128)
!507 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !507, line: 26, size: 512, elements: !509)
!509 = !{!510, !514, !515, !518, !519, !520}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !508, file: !507, line: 30, baseType: !511, size: 128, align: 128)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 8)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !508, file: !507, line: 31, baseType: !511, size: 128, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !508, file: !507, line: 32, baseType: !516, size: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !54, line: 26, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !56, line: 41, baseType: !51)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !508, file: !507, line: 33, baseType: !516, size: 32, offset: 288)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !508, file: !507, line: 34, baseType: !516, size: 32, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !508, file: !507, line: 35, baseType: !521, size: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !507, line: 25, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !283, !51, !283, !51, !526, !51}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!528 = !{!529, !530}
!529 = !DISubrange(count: 32)
!530 = !DISubrange(count: 3)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !474, file: !6, line: 344, baseType: !51, size: 32, offset: 51968)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !474, file: !6, line: 345, baseType: !51, size: 32, offset: 52000)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !474, file: !6, line: 350, baseType: !534, size: 1024, offset: 52032)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 1024, elements: !140)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !6, line: 346, size: 64, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !535, file: !6, line: 348, baseType: !51, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !535, file: !6, line: 349, baseType: !51, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !474, file: !6, line: 352, baseType: !51, size: 32, offset: 53056)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !474, file: !6, line: 354, baseType: !51, size: 32, offset: 53088)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !474, file: !6, line: 355, baseType: !51, size: 32, offset: 53120)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !474, file: !6, line: 356, baseType: !51, size: 32, offset: 53152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !474, file: !6, line: 357, baseType: !51, size: 32, offset: 53184)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !474, file: !6, line: 360, baseType: !51, size: 32, offset: 53216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !474, file: !6, line: 361, baseType: !51, size: 32, offset: 53248)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !474, file: !6, line: 362, baseType: !51, size: 32, offset: 53280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !86, file: !6, line: 463, baseType: !548, size: 4096, offset: 111232)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !549, line: 46, baseType: !550)
!549 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 27, size: 4096, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !550, file: !549, line: 30, baseType: !51, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !550, file: !549, line: 31, baseType: !51, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !550, file: !549, line: 34, baseType: !51, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !550, file: !549, line: 35, baseType: !51, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !550, file: !549, line: 37, baseType: !283, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !550, file: !549, line: 38, baseType: !283, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !550, file: !549, line: 39, baseType: !283, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !550, file: !549, line: 42, baseType: !51, size: 32, align: 128, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !550, file: !549, line: 45, baseType: !561, size: 3680, offset: 416)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 3680, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 460)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !86, file: !6, line: 494, baseType: !565, size: 2112, offset: 115328)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !86, file: !6, line: 465, size: 2112, elements: !566)
!566 = !{!567, !704, !706, !707, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !720, !721, !722, !723}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !565, file: !6, line: 468, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !571, line: 146, baseType: !572)
!571 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !571, line: 31, size: 125056, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !602, !603, !604, !605, !606, !607, !609, !611, !612, !613, !614, !615, !618, !620, !621, !623, !627, !628, !632, !633, !637, !641, !644, !646, !647, !649, !650, !652, !653, !654, !657, !659, !660, !661, !663, !664, !665, !666, !667, !668, !669, !670, !672, !673, !677, !685, !689, !691, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !572, file: !571, line: 34, baseType: !51, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !572, file: !571, line: 35, baseType: !51, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !572, file: !571, line: 36, baseType: !51, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !572, file: !571, line: 37, baseType: !63, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !572, file: !571, line: 38, baseType: !63, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !572, file: !571, line: 39, baseType: !51, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !572, file: !571, line: 40, baseType: !51, size: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !572, file: !571, line: 41, baseType: !51, size: 32, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !572, file: !571, line: 42, baseType: !51, size: 32, offset: 352)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !572, file: !571, line: 43, baseType: !584, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !572, file: !571, line: 45, baseType: !51, size: 32, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !572, file: !571, line: 46, baseType: !51, size: 32, offset: 480)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !572, file: !571, line: 47, baseType: !51, size: 32, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !572, file: !571, line: 48, baseType: !51, size: 32, offset: 544)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !572, file: !571, line: 49, baseType: !51, size: 32, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !572, file: !571, line: 50, baseType: !51, size: 32, offset: 608)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !572, file: !571, line: 51, baseType: !51, size: 32, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !572, file: !571, line: 52, baseType: !137, size: 8, offset: 672)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !572, file: !571, line: 53, baseType: !137, size: 8, offset: 680)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !572, file: !571, line: 54, baseType: !137, size: 8, offset: 688)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !572, file: !571, line: 55, baseType: !52, size: 32, offset: 704)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !572, file: !571, line: 56, baseType: !52, size: 32, offset: 736)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !572, file: !571, line: 57, baseType: !51, size: 32, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !572, file: !571, line: 60, baseType: !51, size: 32, offset: 800)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !572, file: !571, line: 61, baseType: !600, size: 96, offset: 832)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 96, elements: !601)
!601 = !{!530}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !572, file: !571, line: 62, baseType: !600, size: 96, offset: 928)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !572, file: !571, line: 63, baseType: !600, size: 96, offset: 1024)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !572, file: !571, line: 64, baseType: !51, size: 32, offset: 1120)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !572, file: !571, line: 65, baseType: !51, size: 32, offset: 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !572, file: !571, line: 66, baseType: !51, size: 32, offset: 1184)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !572, file: !571, line: 67, baseType: !608, size: 192, offset: 1216)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 192, elements: !601)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !572, file: !571, line: 68, baseType: !610, size: 256, offset: 1408)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 256, elements: !442)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !572, file: !571, line: 69, baseType: !610, size: 256, offset: 1664)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !572, file: !571, line: 70, baseType: !465, size: 64, offset: 1920)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !572, file: !571, line: 74, baseType: !610, size: 256, offset: 1984)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !572, file: !571, line: 75, baseType: !610, size: 256, offset: 2240)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !572, file: !571, line: 77, baseType: !616, size: 24576, align: 128, offset: 2560)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 24576, align: 128, elements: !617)
!617 = !{!141, !530}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !572, file: !571, line: 78, baseType: !619, size: 1024, offset: 27136)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 1024, elements: !140)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !572, file: !571, line: 79, baseType: !51, size: 32, offset: 28160)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !572, file: !571, line: 80, baseType: !622, size: 64, offset: 28224)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !572, file: !571, line: 83, baseType: !624, size: 64, offset: 28288)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !54, line: 24, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !56, line: 37, baseType: !69)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !572, file: !571, line: 84, baseType: !283, size: 64, offset: 28352)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !572, file: !571, line: 85, baseType: !629, size: 128, offset: 28416)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 128, elements: !194)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !194)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !572, file: !571, line: 86, baseType: !630, size: 64, offset: 28544)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !572, file: !571, line: 87, baseType: !634, size: 2176, offset: 28608)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 2176, elements: !635)
!635 = !{!195, !636}
!636 = !DISubrange(count: 17)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !572, file: !571, line: 92, baseType: !638, size: 20736, offset: 30784)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 20736, elements: !639)
!639 = !{!640, !640}
!640 = !DISubrange(count: 18)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !572, file: !571, line: 96, baseType: !642, size: 2176, offset: 51520)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 2176, elements: !635)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !572, file: !571, line: 97, baseType: !645, size: 128, offset: 53696)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 128, elements: !194)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !572, file: !571, line: 98, baseType: !193, size: 64, offset: 53824)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !572, file: !571, line: 99, baseType: !648, size: 1024, offset: 53888)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1024, elements: !503)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !572, file: !571, line: 100, baseType: !631, size: 32, offset: 54912)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !572, file: !571, line: 105, baseType: !651, size: 10368, offset: 54944)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 10368, elements: !639)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !572, file: !571, line: 106, baseType: !651, size: 10368, offset: 65312)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !572, file: !571, line: 107, baseType: !51, size: 32, offset: 75680)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !572, file: !571, line: 108, baseType: !655, size: 576, offset: 75712)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 576, elements: !656)
!656 = !{!640}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !572, file: !571, line: 109, baseType: !658, size: 20736, offset: 76288)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 20736, elements: !639)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !572, file: !571, line: 110, baseType: !643, size: 64, offset: 97024)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !572, file: !571, line: 111, baseType: !643, size: 64, offset: 97088)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !572, file: !571, line: 112, baseType: !662, size: 64, offset: 97152)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !572, file: !571, line: 113, baseType: !662, size: 64, offset: 97216)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !572, file: !571, line: 114, baseType: !662, size: 64, offset: 97280)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !572, file: !571, line: 115, baseType: !51, size: 32, offset: 97344)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !572, file: !571, line: 116, baseType: !465, size: 64, offset: 97408)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !572, file: !571, line: 117, baseType: !465, size: 64, offset: 97472)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !572, file: !571, line: 118, baseType: !465, size: 64, offset: 97536)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !572, file: !571, line: 119, baseType: !51, size: 32, offset: 97600)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !572, file: !571, line: 120, baseType: !671, size: 576, offset: 97632)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 576, elements: !656)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !572, file: !571, line: 121, baseType: !60, size: 32, offset: 98208)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !572, file: !571, line: 122, baseType: !674, size: 64, offset: 98240)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !61, line: 27, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !56, line: 45, baseType: !676)
!676 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !572, file: !571, line: 125, baseType: !678, size: 256, offset: 98304)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !85, line: 503, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 496, size: 256, elements: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !679, file: !85, line: 498, baseType: !58, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !679, file: !85, line: 499, baseType: !58, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !679, file: !85, line: 500, baseType: !58, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !679, file: !85, line: 502, baseType: !58, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !572, file: !571, line: 128, baseType: !686, size: 2008, offset: 98560)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 2008, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 251)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !572, file: !571, line: 129, baseType: !690, size: 8032, offset: 100576)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8032, elements: !687)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !572, file: !571, line: 130, baseType: !692, size: 16064, offset: 108608)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 16064, elements: !687)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !572, file: !571, line: 131, baseType: !51, size: 32, offset: 124672)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !572, file: !571, line: 132, baseType: !51, size: 32, offset: 124704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !572, file: !571, line: 135, baseType: !51, size: 32, offset: 124736)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !572, file: !571, line: 136, baseType: !51, size: 32, offset: 124768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !572, file: !571, line: 137, baseType: !51, size: 32, offset: 124800)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !572, file: !571, line: 138, baseType: !51, size: 32, offset: 124832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !572, file: !571, line: 139, baseType: !51, size: 32, offset: 124864)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !572, file: !571, line: 142, baseType: !52, size: 32, offset: 124896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !572, file: !571, line: 143, baseType: !51, size: 32, offset: 124928)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !572, file: !571, line: 144, baseType: !51, size: 32, offset: 124960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !572, file: !571, line: 145, baseType: !51, size: 32, offset: 124992)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !565, file: !6, line: 470, baseType: !705, size: 128, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 128, elements: !194)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !565, file: !6, line: 473, baseType: !568, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !565, file: !6, line: 476, baseType: !708, size: 1152, offset: 256)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 1152, elements: !656)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !565, file: !6, line: 478, baseType: !51, size: 32, offset: 1408)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !565, file: !6, line: 480, baseType: !51, size: 32, offset: 1440)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !565, file: !6, line: 482, baseType: !51, size: 32, offset: 1472)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !565, file: !6, line: 483, baseType: !51, size: 32, offset: 1504)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !565, file: !6, line: 484, baseType: !51, size: 32, offset: 1536)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !565, file: !6, line: 485, baseType: !51, size: 32, offset: 1568)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !565, file: !6, line: 486, baseType: !51, size: 32, offset: 1600)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !565, file: !6, line: 487, baseType: !63, size: 64, offset: 1664)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !565, file: !6, line: 488, baseType: !63, size: 64, offset: 1728)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !565, file: !6, line: 489, baseType: !719, size: 128, offset: 1792)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !194)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !565, file: !6, line: 490, baseType: !63, size: 64, offset: 1920)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !565, file: !6, line: 491, baseType: !63, size: 64, offset: 1984)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !565, file: !6, line: 492, baseType: !51, size: 32, offset: 2048)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !565, file: !6, line: 493, baseType: !51, size: 32, offset: 2080)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !86, file: !6, line: 497, baseType: !569, size: 64, offset: 117440)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !86, file: !6, line: 500, baseType: !569, size: 64, offset: 117504)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !86, file: !6, line: 503, baseType: !51, size: 32, offset: 117568)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !86, file: !6, line: 504, baseType: !728, size: 1216, offset: 117632)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 1216, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 19)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !86, file: !6, line: 505, baseType: !51, size: 32, offset: 118848)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !86, file: !6, line: 506, baseType: !728, size: 1216, offset: 118912)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !86, file: !6, line: 507, baseType: !193, size: 64, offset: 120128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !86, file: !6, line: 510, baseType: !51, size: 32, offset: 120192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !86, file: !6, line: 511, baseType: !51, size: 32, offset: 120224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !86, file: !6, line: 512, baseType: !63, size: 64, offset: 120256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !86, file: !6, line: 522, baseType: !738, size: 10624, offset: 120320)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !86, file: !6, line: 515, size: 10624, elements: !739)
!739 = !{!740, !742, !745, !748}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !738, file: !6, line: 517, baseType: !741, size: 256, align: 128)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 256, elements: !140)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !738, file: !6, line: 518, baseType: !743, size: 128, align: 128, offset: 256)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !744)
!744 = !{!195, !443}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !738, file: !6, line: 520, baseType: !746, size: 4096, align: 128, offset: 384)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 4096, elements: !747)
!747 = !{!443, !148}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !738, file: !6, line: 521, baseType: !749, size: 6144, align: 128, offset: 4480)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 6144, elements: !750)
!750 = !{!751, !141}
!751 = !DISubrange(count: 24)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !86, file: !6, line: 732, baseType: !753, size: 82688, offset: 130944)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !86, file: !6, line: 525, size: 82688, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !782, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !800, !803, !807, !808, !809, !814, !815, !818, !819, !820, !821, !822, !823, !824, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !884, !915, !916, !917, !918, !919, !920, !921, !922, !923, !926, !927, !928, !931, !934, !936, !939, !941, !942}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !753, file: !6, line: 527, baseType: !51, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !753, file: !6, line: 530, baseType: !51, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !753, file: !6, line: 531, baseType: !51, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !753, file: !6, line: 532, baseType: !51, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !753, file: !6, line: 535, baseType: !51, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !753, file: !6, line: 536, baseType: !51, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !753, file: !6, line: 537, baseType: !51, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !753, file: !6, line: 538, baseType: !51, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !753, file: !6, line: 539, baseType: !51, size: 32, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !753, file: !6, line: 542, baseType: !51, size: 32, offset: 288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !753, file: !6, line: 543, baseType: !51, size: 32, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !753, file: !6, line: 544, baseType: !51, size: 32, offset: 352)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !753, file: !6, line: 545, baseType: !51, size: 32, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !753, file: !6, line: 546, baseType: !51, size: 32, offset: 416)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !753, file: !6, line: 547, baseType: !51, size: 32, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !753, file: !6, line: 548, baseType: !51, size: 32, offset: 480)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !753, file: !6, line: 549, baseType: !51, size: 32, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !753, file: !6, line: 551, baseType: !51, size: 32, offset: 544)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !753, file: !6, line: 554, baseType: !193, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !753, file: !6, line: 555, baseType: !193, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !753, file: !6, line: 558, baseType: !193, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !753, file: !6, line: 559, baseType: !193, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !753, file: !6, line: 561, baseType: !193, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !753, file: !6, line: 562, baseType: !193, size: 64, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !753, file: !6, line: 565, baseType: !7, size: 32, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !753, file: !6, line: 566, baseType: !781, size: 128, offset: 992)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !442)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !753, file: !6, line: 567, baseType: !783, size: 512, offset: 1120)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !140)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !753, file: !6, line: 568, baseType: !7, size: 32, offset: 1632)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !753, file: !6, line: 569, baseType: !7, size: 32, offset: 1664)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !753, file: !6, line: 570, baseType: !51, size: 32, offset: 1696)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !753, file: !6, line: 571, baseType: !51, size: 32, offset: 1728)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !753, file: !6, line: 572, baseType: !51, size: 32, offset: 1760)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !753, file: !6, line: 573, baseType: !51, size: 32, offset: 1792)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !753, file: !6, line: 574, baseType: !51, size: 32, offset: 1824)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !753, file: !6, line: 575, baseType: !51, size: 32, offset: 1856)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !753, file: !6, line: 576, baseType: !51, size: 32, offset: 1888)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !753, file: !6, line: 577, baseType: !51, size: 32, offset: 1920)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !753, file: !6, line: 578, baseType: !51, size: 32, offset: 1952)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !753, file: !6, line: 585, baseType: !624, size: 64, offset: 1984)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !753, file: !6, line: 586, baseType: !283, size: 64, offset: 2048)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !753, file: !6, line: 587, baseType: !624, size: 64, offset: 2112)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !753, file: !6, line: 588, baseType: !799, size: 64, offset: 2176)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !753, file: !6, line: 589, baseType: !801, size: 64, offset: 2240)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 64, elements: !512)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !753, file: !6, line: 591, baseType: !804, size: 64, offset: 2304)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, elements: !806)
!806 = !{!751}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !753, file: !6, line: 592, baseType: !624, size: 64, offset: 2368)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !753, file: !6, line: 593, baseType: !629, size: 128, offset: 2432)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !753, file: !6, line: 594, baseType: !810, size: 128, offset: 2560)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 128, elements: !194)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !813)
!813 = !{!513, !195}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !753, file: !6, line: 595, baseType: !645, size: 128, offset: 2688)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !753, file: !6, line: 596, baseType: !816, size: 4096, offset: 2816)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 4096, elements: !817)
!817 = !{!195, !529}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !753, file: !6, line: 597, baseType: !624, size: 64, offset: 6912)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !753, file: !6, line: 598, baseType: !624, size: 64, offset: 6976)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !753, file: !6, line: 599, baseType: !465, size: 64, offset: 7040)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !753, file: !6, line: 603, baseType: !619, size: 1024, offset: 7104)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !753, file: !6, line: 606, baseType: !51, size: 32, offset: 8128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !753, file: !6, line: 607, baseType: !51, size: 32, offset: 8160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !753, file: !6, line: 608, baseType: !825, size: 32, align: 32, offset: 8192)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 32, elements: !442)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !753, file: !6, line: 609, baseType: !51, size: 32, offset: 8224)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !753, file: !6, line: 611, baseType: !51, size: 32, offset: 8256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !753, file: !6, line: 612, baseType: !51, size: 32, offset: 8288)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !753, file: !6, line: 614, baseType: !51, size: 32, offset: 8320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !753, file: !6, line: 615, baseType: !51, size: 32, offset: 8352)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !753, file: !6, line: 621, baseType: !51, size: 32, offset: 8384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !753, file: !6, line: 624, baseType: !51, size: 32, offset: 8416)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !753, file: !6, line: 626, baseType: !51, size: 32, offset: 8448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !753, file: !6, line: 627, baseType: !51, size: 32, offset: 8480)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !753, file: !6, line: 671, baseType: !836, size: 60672, offset: 8576)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !753, file: !6, line: 629, size: 60672, elements: !837)
!837 = !{!838, !842, !846, !848, !849, !852, !856, !858, !859, !860, !861, !862, !865, !869, !872, !873, !874, !875, !876, !879, !881, !883}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !836, file: !6, line: 634, baseType: !839, size: 3072, align: 128)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 3072, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !836, file: !6, line: 635, baseType: !843, size: 6912, align: 128, offset: 3072)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 6912, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 864)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !836, file: !6, line: 638, baseType: !847, size: 2048, align: 128, offset: 9984)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 2048, elements: !335)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !836, file: !6, line: 639, baseType: !847, size: 2048, align: 128, offset: 12032)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !836, file: !6, line: 640, baseType: !850, size: 3072, align: 128, offset: 14080)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 3072, elements: !851)
!851 = !{!530, !148}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !836, file: !6, line: 641, baseType: !853, size: 3840, align: 128, offset: 17152)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 3840, elements: !854)
!854 = !{!855, !141}
!855 = !DISubrange(count: 15)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !836, file: !6, line: 642, baseType: !857, size: 128, offset: 20992)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !442)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !836, file: !6, line: 643, baseType: !857, size: 128, offset: 21120)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !836, file: !6, line: 644, baseType: !51, size: 32, offset: 21248)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !836, file: !6, line: 645, baseType: !51, size: 32, offset: 21280)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !836, file: !6, line: 648, baseType: !746, size: 4096, align: 128, offset: 21376)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !836, file: !6, line: 649, baseType: !863, size: 4096, align: 128, offset: 25472)
