; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/registry.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/registry.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }

!403 = !DIFile(filename: "apps/538.imagick_r/src/magick/effect.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "85233add4591bd6d6001c51d4fa6a546")
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!405 = !DIEnumerator(name: "UndefinedPreview", value: 0)
!406 = !DIEnumerator(name: "RotatePreview", value: 1)
!407 = !DIEnumerator(name: "ShearPreview", value: 2)
!408 = !DIEnumerator(name: "RollPreview", value: 3)
!409 = !DIEnumerator(name: "HuePreview", value: 4)
!410 = !DIEnumerator(name: "SaturationPreview", value: 5)
!411 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!412 = !DIEnumerator(name: "GammaPreview", value: 7)
!413 = !DIEnumerator(name: "SpiffPreview", value: 8)
!414 = !DIEnumerator(name: "DullPreview", value: 9)
!415 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!416 = !DIEnumerator(name: "QuantizePreview", value: 11)
!417 = !DIEnumerator(name: "DespecklePreview", value: 12)
!418 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!419 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!420 = !DIEnumerator(name: "SharpenPreview", value: 15)
!421 = !DIEnumerator(name: "BlurPreview", value: 16)
!422 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!423 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!424 = !DIEnumerator(name: "SpreadPreview", value: 19)
!425 = !DIEnumerator(name: "SolarizePreview", value: 20)
!426 = !DIEnumerator(name: "ShadePreview", value: 21)
!427 = !DIEnumerator(name: "RaisePreview", value: 22)
!428 = !DIEnumerator(name: "SegmentPreview", value: 23)
!429 = !DIEnumerator(name: "SwirlPreview", value: 24)
!430 = !DIEnumerator(name: "ImplodePreview", value: 25)
!431 = !DIEnumerator(name: "WavePreview", value: 26)
!432 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!433 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!434 = !DIEnumerator(name: "JPEGPreview", value: 29)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 177, baseType: !7, size: 32, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!437 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!438 = !DIEnumerator(name: "RedChannel", value: 1)
!439 = !DIEnumerator(name: "GrayChannel", value: 1)
!440 = !DIEnumerator(name: "CyanChannel", value: 1)
!441 = !DIEnumerator(name: "GreenChannel", value: 2)
!442 = !DIEnumerator(name: "MagentaChannel", value: 2)
!443 = !DIEnumerator(name: "BlueChannel", value: 4)
!444 = !DIEnumerator(name: "YellowChannel", value: 4)
!445 = !DIEnumerator(name: "AlphaChannel", value: 8)
!446 = !DIEnumerator(name: "OpacityChannel", value: 8)
!447 = !DIEnumerator(name: "MatteChannel", value: 8)
!448 = !DIEnumerator(name: "BlackChannel", value: 32)
!449 = !DIEnumerator(name: "IndexChannel", value: 32)
!450 = !DIEnumerator(name: "CompositeChannels", value: 47)
!451 = !DIEnumerator(name: "AllChannels", value: 134217727)
!452 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!453 = !DIEnumerator(name: "RGBChannels", value: 128)
!454 = !DIEnumerator(name: "GrayChannels", value: 128)
!455 = !DIEnumerator(name: "SyncChannels", value: 256)
!456 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !458, line: 27, baseType: !7, size: 32, elements: !459)
!458 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!460 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!461 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!462 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!463 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!464 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!465 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!466 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!467 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!468 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!469 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!470 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!471 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!472 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!473 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!474 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!475 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!476 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!477 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!478 = !{!479, !480, !481, !492, !710, !548, !662, !768, !622, !766, !842, !656, !844}
!479 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegistryInfo", file: !483, line: 67, baseType: !484)
!483 = !DIFile(filename: "apps/538.imagick_r/src/magick/registry.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "675fa5d2c15dbc0481f843749fe2dfa6")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RegistryInfo", file: !483, line: 57, size: 192, elements: !485)
!485 = !{!486, !488, !489}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !484, file: !483, line: 60, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegistryType", file: !12, line: 31, baseType: !11)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !484, file: !483, line: 63, baseType: !480, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !484, file: !483, line: 66, baseType: !490, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !491, line: 46, baseType: !479)
!491 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !184, line: 150, size: 105920, elements: !495)
!495 = !{!496, !498, !500, !502, !503, !505, !507, !508, !509, !510, !511, !512, !523, !524, !525, !526, !528, !542, !544, !545, !547, !550, !551, !552, !558, !559, !560, !568, !569, !570, !571, !572, !573, !575, !577, !579, !581, !583, !585, !587, !588, !589, !590, !591, !592, !593, !601, !616, !630, !631, !632, !633, !637, !641, !645, !646, !647, !648, !649, !667, !668, !670, !671, !681, !682, !684, !685, !686, !687, !688, !689, !691, !692, !693, !694, !695, !696, !697, !699, !700, !701, !702, !703, !707, !709}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !494, file: !184, line: 153, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !116)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !494, file: !184, line: 156, baseType: !499, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !122, line: 61, baseType: !121)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !494, file: !184, line: 159, baseType: !501, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !159, line: 49, baseType: !158)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !494, file: !184, line: 162, baseType: !490, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !494, file: !184, line: 165, baseType: !504, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !184, line: 86, baseType: !183)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !494, file: !184, line: 168, baseType: !506, size: 32, offset: 224)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !494, file: !184, line: 169, baseType: !506, size: 32, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !494, file: !184, line: 172, baseType: !490, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !494, file: !184, line: 173, baseType: !490, size: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !494, file: !184, line: 174, baseType: !490, size: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !494, file: !184, line: 175, baseType: !490, size: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !494, file: !184, line: 178, baseType: !513, size: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !360, line: 148, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !360, line: 131, size: 64, elements: !516)
!516 = !{!517, !520, !521, !522}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !515, file: !360, line: 143, baseType: !518, size: 16)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !519)
!519 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !515, file: !360, line: 144, baseType: !518, size: 16, offset: 16)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !515, file: !360, line: 145, baseType: !518, size: 16, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !515, file: !360, line: 146, baseType: !518, size: 16, offset: 48)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !494, file: !184, line: 179, baseType: !514, size: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !494, file: !184, line: 180, baseType: !514, size: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !494, file: !184, line: 181, baseType: !514, size: 64, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !494, file: !184, line: 184, baseType: !527, size: 64, offset: 832)
!527 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !494, file: !184, line: 187, baseType: !529, size: 768, offset: 896)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !184, line: 128, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !184, line: 121, size: 768, elements: !531)
!531 = !{!532, !539, !540, !541}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !530, file: !184, line: 124, baseType: !533, size: 192)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !184, line: 101, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !184, line: 95, size: 192, elements: !535)
!535 = !{!536, !537, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !534, file: !184, line: 98, baseType: !527, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !534, file: !184, line: 99, baseType: !527, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !534, file: !184, line: 100, baseType: !527, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !530, file: !184, line: 125, baseType: !533, size: 192, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !530, file: !184, line: 126, baseType: !533, size: 192, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !530, file: !184, line: 127, baseType: !533, size: 192, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !494, file: !184, line: 190, baseType: !543, size: 32, offset: 1664)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !196, line: 49, baseType: !195)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !494, file: !184, line: 193, baseType: !480, size: 64, offset: 1728)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !494, file: !184, line: 196, baseType: !546, size: 32, offset: 1792)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !184, line: 93, baseType: !203)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !494, file: !184, line: 199, baseType: !548, size: 64, offset: 1856)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !494, file: !184, line: 200, baseType: !548, size: 64, offset: 1920)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !494, file: !184, line: 201, baseType: !548, size: 64, offset: 1984)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !494, file: !184, line: 204, baseType: !553, size: 64, offset: 2048)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !554, line: 77, baseType: !555)
!554 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !556, line: 193, baseType: !557)
!556 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!557 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !494, file: !184, line: 207, baseType: !527, size: 64, offset: 2112)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !494, file: !184, line: 208, baseType: !527, size: 64, offset: 2176)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !494, file: !184, line: 211, baseType: !561, size: 256, offset: 2240)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !260, line: 130, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !260, line: 121, size: 256, elements: !563)
!563 = !{!564, !565, !566, !567}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !562, file: !260, line: 124, baseType: !490, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !562, file: !260, line: 125, baseType: !490, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !562, file: !260, line: 128, baseType: !553, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !562, file: !260, line: 129, baseType: !553, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !494, file: !184, line: 212, baseType: !561, size: 256, offset: 2496)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !494, file: !184, line: 213, baseType: !561, size: 256, offset: 2752)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !494, file: !184, line: 216, baseType: !527, size: 64, offset: 3008)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !494, file: !184, line: 217, baseType: !527, size: 64, offset: 3072)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !494, file: !184, line: 218, baseType: !527, size: 64, offset: 3136)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !494, file: !184, line: 221, baseType: !574, size: 32, offset: 3200)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !209, line: 66, baseType: !208)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !494, file: !184, line: 224, baseType: !576, size: 32, offset: 3232)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !184, line: 73, baseType: !243)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !494, file: !184, line: 227, baseType: !578, size: 32, offset: 3264)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !254, line: 35, baseType: !253)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !494, file: !184, line: 230, baseType: !580, size: 32, offset: 3296)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !260, line: 91, baseType: !259)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !494, file: !184, line: 233, baseType: !582, size: 32, offset: 3328)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !275, line: 99, baseType: !274)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !494, file: !184, line: 236, baseType: !584, size: 32, offset: 3360)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !346, line: 32, baseType: !345)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !494, file: !184, line: 239, baseType: !586, size: 64, offset: 3392)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !494, file: !184, line: 242, baseType: !490, size: 64, offset: 3456)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !494, file: !184, line: 243, baseType: !490, size: 64, offset: 3520)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !494, file: !184, line: 246, baseType: !553, size: 64, offset: 3584)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !494, file: !184, line: 249, baseType: !490, size: 64, offset: 3648)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !494, file: !184, line: 250, baseType: !490, size: 64, offset: 3712)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !494, file: !184, line: 253, baseType: !553, size: 64, offset: 3776)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !494, file: !184, line: 256, baseType: !594, size: 192, offset: 3840)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !595, line: 68, baseType: !596)
!595 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !595, line: 62, size: 192, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !596, file: !595, line: 65, baseType: !527, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !596, file: !595, line: 66, baseType: !527, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !596, file: !595, line: 67, baseType: !527, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !494, file: !184, line: 259, baseType: !602, size: 512, offset: 4032)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !354, line: 51, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !354, line: 40, size: 512, elements: !604)
!604 = !{!605, !612, !613, !615}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !603, file: !354, line: 43, baseType: !606, size: 192)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !354, line: 38, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !354, line: 32, size: 192, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !607, file: !354, line: 35, baseType: !527, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !607, file: !354, line: 36, baseType: !527, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !607, file: !354, line: 37, baseType: !527, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !603, file: !354, line: 44, baseType: !606, size: 192, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !603, file: !354, line: 47, baseType: !614, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !354, line: 30, baseType: !353)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !603, file: !354, line: 50, baseType: !490, size: 64, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !494, file: !184, line: 262, baseType: !617, size: 64, offset: 4544)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !618, line: 26, baseType: !619)
!618 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!506, !622, !624, !627, !480}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !626)
!626 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !629)
!629 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !494, file: !184, line: 265, baseType: !480, size: 64, offset: 4608)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !494, file: !184, line: 266, baseType: !480, size: 64, offset: 4672)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !494, file: !184, line: 267, baseType: !480, size: 64, offset: 4736)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !494, file: !184, line: 270, baseType: !634, size: 64, offset: 4800)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !159, line: 52, baseType: !636)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !159, line: 51, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !494, file: !184, line: 273, baseType: !638, size: 64, offset: 4864)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !640)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !494, file: !184, line: 276, baseType: !642, size: 32768, offset: 4928)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 32768, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 4096)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !494, file: !184, line: 277, baseType: !642, size: 32768, offset: 37696)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !494, file: !184, line: 278, baseType: !642, size: 32768, offset: 70464)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !494, file: !184, line: 281, baseType: !490, size: 64, offset: 103232)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !494, file: !184, line: 282, baseType: !490, size: 64, offset: 103296)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !494, file: !184, line: 285, baseType: !650, size: 448, offset: 103360)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !19, line: 102, size: 448, elements: !652)
!652 = !{!653, !655, !657, !658, !659, !660, !661, !666}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !651, file: !19, line: 105, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !19, line: 100, baseType: !18)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !651, file: !19, line: 108, baseType: !656, size: 32, offset: 32)
!656 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !651, file: !19, line: 111, baseType: !548, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !651, file: !19, line: 112, baseType: !548, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !651, file: !19, line: 115, baseType: !480, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !651, file: !19, line: 118, baseType: !506, size: 32, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !651, file: !19, line: 121, baseType: !662, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !664, line: 26, baseType: !665)
!664 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !664, line: 25, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !651, file: !19, line: 124, baseType: !490, size: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !494, file: !184, line: 288, baseType: !506, size: 32, offset: 103808)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !494, file: !184, line: 291, baseType: !669, size: 64, offset: 103872)
!669 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !553)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !494, file: !184, line: 294, baseType: !662, size: 64, offset: 103936)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !494, file: !184, line: 297, baseType: !672, size: 256, offset: 104000)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !196, line: 40, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !196, line: 27, size: 256, elements: !674)
!674 = !{!675, !676, !677, !680}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !673, file: !196, line: 30, baseType: !548, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !673, file: !196, line: 33, baseType: !490, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !673, file: !196, line: 36, baseType: !678, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !673, file: !196, line: 39, baseType: !490, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !494, file: !184, line: 298, baseType: !672, size: 256, offset: 104256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !494, file: !184, line: 299, baseType: !683, size: 64, offset: 104512)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !494, file: !184, line: 302, baseType: !490, size: 64, offset: 104576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !494, file: !184, line: 305, baseType: !490, size: 64, offset: 104640)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !494, file: !184, line: 308, baseType: !586, size: 64, offset: 104704)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !494, file: !184, line: 309, baseType: !586, size: 64, offset: 104768)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !184, line: 310, baseType: !586, size: 64, offset: 104832)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !494, file: !184, line: 313, baseType: !690, size: 32, offset: 104896)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !360, line: 47, baseType: !359)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !494, file: !184, line: 316, baseType: !506, size: 32, offset: 104928)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !494, file: !184, line: 319, baseType: !514, size: 64, offset: 104960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !494, file: !184, line: 322, baseType: !586, size: 64, offset: 105024)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !494, file: !184, line: 325, baseType: !561, size: 256, offset: 105088)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !494, file: !184, line: 328, baseType: !480, size: 64, offset: 105344)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !494, file: !184, line: 329, baseType: !480, size: 64, offset: 105408)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !494, file: !184, line: 332, baseType: !698, size: 32, offset: 105472)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !184, line: 61, baseType: !376)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !494, file: !184, line: 335, baseType: !506, size: 32, offset: 105504)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !494, file: !184, line: 338, baseType: !628, size: 64, offset: 105536)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !494, file: !184, line: 341, baseType: !506, size: 32, offset: 105600)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !494, file: !184, line: 344, baseType: !490, size: 64, offset: 105664)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !494, file: !184, line: 347, baseType: !704, size: 64, offset: 105728)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !705, line: 7, baseType: !706)
!705 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !556, line: 160, baseType: !557)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !494, file: !184, line: 350, baseType: !708, size: 32, offset: 105792)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !360, line: 79, baseType: !390)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !494, file: !184, line: 353, baseType: !490, size: 64, offset: 105856)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !6, line: 223, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !184, line: 356, size: 134336, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !748, !749, !750, !751, !752, !753, !755, !756, !757, !758, !759, !760, !771, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !839, !840, !841}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !712, file: !184, line: 359, baseType: !501, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !712, file: !184, line: 362, baseType: !504, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !712, file: !184, line: 365, baseType: !506, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !712, file: !184, line: 366, baseType: !506, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !712, file: !184, line: 367, baseType: !506, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !712, file: !184, line: 368, baseType: !506, size: 32, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !712, file: !184, line: 371, baseType: !548, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !712, file: !184, line: 372, baseType: !548, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !712, file: !184, line: 373, baseType: !548, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !712, file: !184, line: 374, baseType: !548, size: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !712, file: !184, line: 377, baseType: !490, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !712, file: !184, line: 378, baseType: !490, size: 64, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !712, file: !184, line: 379, baseType: !490, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !712, file: !184, line: 382, baseType: !576, size: 32, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !712, file: !184, line: 385, baseType: !578, size: 32, offset: 672)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !712, file: !184, line: 388, baseType: !546, size: 32, offset: 704)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !712, file: !184, line: 391, baseType: !490, size: 64, offset: 768)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !712, file: !184, line: 394, baseType: !548, size: 64, offset: 832)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !712, file: !184, line: 395, baseType: !548, size: 64, offset: 896)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !712, file: !184, line: 396, baseType: !548, size: 64, offset: 960)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !712, file: !184, line: 397, baseType: !548, size: 64, offset: 1024)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !712, file: !184, line: 398, baseType: !548, size: 64, offset: 1088)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !712, file: !184, line: 401, baseType: !527, size: 64, offset: 1152)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !712, file: !184, line: 402, baseType: !527, size: 64, offset: 1216)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !712, file: !184, line: 405, baseType: !514, size: 64, offset: 1280)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !712, file: !184, line: 406, baseType: !514, size: 64, offset: 1344)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !712, file: !184, line: 407, baseType: !514, size: 64, offset: 1408)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !712, file: !184, line: 410, baseType: !506, size: 32, offset: 1472)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !712, file: !184, line: 411, baseType: !506, size: 32, offset: 1504)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !712, file: !184, line: 414, baseType: !490, size: 64, offset: 1536)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !712, file: !184, line: 417, baseType: !499, size: 32, offset: 1600)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !712, file: !184, line: 420, baseType: !698, size: 32, offset: 1632)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !712, file: !184, line: 423, baseType: !747, size: 32, offset: 1664)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !403, line: 59, baseType: !402)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !712, file: !184, line: 426, baseType: !553, size: 64, offset: 1728)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !712, file: !184, line: 429, baseType: !506, size: 32, offset: 1792)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !712, file: !184, line: 430, baseType: !506, size: 32, offset: 1824)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !712, file: !184, line: 433, baseType: !548, size: 64, offset: 1856)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !712, file: !184, line: 434, baseType: !548, size: 64, offset: 1920)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !712, file: !184, line: 437, baseType: !754, size: 32, offset: 1984)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !435)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !712, file: !184, line: 440, baseType: !492, size: 64, offset: 2048)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !712, file: !184, line: 443, baseType: !480, size: 64, offset: 2112)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !712, file: !184, line: 446, baseType: !617, size: 64, offset: 2176)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !712, file: !184, line: 449, baseType: !480, size: 64, offset: 2240)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !712, file: !184, line: 450, baseType: !480, size: 64, offset: 2304)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !712, file: !184, line: 453, baseType: !761, size: 64, offset: 2368)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !762, line: 26, baseType: !763)
!762 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!490, !766, !768, !770}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !712, file: !184, line: 456, baseType: !772, size: 64, offset: 2432)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !774, line: 7, baseType: !775)
!774 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !776, line: 49, size: 1728, elements: !777)
!776 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !793, !795, !796, !797, !799, !800, !802, !806, !809, !811, !814, !817, !818, !819, !820, !821}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !775, file: !776, line: 51, baseType: !656, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !775, file: !776, line: 54, baseType: !548, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !775, file: !776, line: 55, baseType: !548, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !775, file: !776, line: 56, baseType: !548, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !775, file: !776, line: 57, baseType: !548, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !775, file: !776, line: 58, baseType: !548, size: 64, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !775, file: !776, line: 59, baseType: !548, size: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !775, file: !776, line: 60, baseType: !548, size: 64, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !775, file: !776, line: 61, baseType: !548, size: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !775, file: !776, line: 64, baseType: !548, size: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !775, file: !776, line: 65, baseType: !548, size: 64, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !775, file: !776, line: 66, baseType: !548, size: 64, offset: 704)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !775, file: !776, line: 68, baseType: !791, size: 64, offset: 768)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !776, line: 36, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !775, file: !776, line: 70, baseType: !794, size: 64, offset: 832)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !775, file: !776, line: 72, baseType: !656, size: 32, offset: 896)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !775, file: !776, line: 73, baseType: !656, size: 32, offset: 928)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !775, file: !776, line: 74, baseType: !798, size: 64, offset: 960)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !556, line: 152, baseType: !557)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !775, file: !776, line: 77, baseType: !519, size: 16, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !775, file: !776, line: 78, baseType: !801, size: 8, offset: 1040)
!801 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !775, file: !776, line: 79, baseType: !803, size: 8, offset: 1048)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 8, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 1)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !775, file: !776, line: 81, baseType: !807, size: 64, offset: 1088)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !776, line: 43, baseType: null)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !775, file: !776, line: 89, baseType: !810, size: 64, offset: 1152)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !556, line: 153, baseType: !557)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !775, file: !776, line: 91, baseType: !812, size: 64, offset: 1216)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !776, line: 37, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !775, file: !776, line: 92, baseType: !815, size: 64, offset: 1280)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !776, line: 38, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !775, file: !776, line: 93, baseType: !794, size: 64, offset: 1344)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !775, file: !776, line: 94, baseType: !480, size: 64, offset: 1408)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !775, file: !776, line: 95, baseType: !490, size: 64, offset: 1472)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !775, file: !776, line: 96, baseType: !656, size: 32, offset: 1536)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !775, file: !776, line: 98, baseType: !822, size: 160, offset: 1568)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 160, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 20)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !712, file: !184, line: 459, baseType: !480, size: 64, offset: 2496)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !712, file: !184, line: 462, baseType: !490, size: 64, offset: 2560)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !712, file: !184, line: 465, baseType: !642, size: 32768, offset: 2624)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !712, file: !184, line: 466, baseType: !642, size: 32768, offset: 35392)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !712, file: !184, line: 467, baseType: !642, size: 32768, offset: 68160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !712, file: !184, line: 468, baseType: !642, size: 32768, offset: 100928)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !712, file: !184, line: 471, baseType: !506, size: 32, offset: 133696)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !712, file: !184, line: 474, baseType: !548, size: 64, offset: 133760)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !712, file: !184, line: 477, baseType: !490, size: 64, offset: 133824)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !712, file: !184, line: 478, baseType: !490, size: 64, offset: 133888)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !712, file: !184, line: 481, baseType: !514, size: 64, offset: 133952)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !712, file: !184, line: 484, baseType: !490, size: 64, offset: 134016)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !712, file: !184, line: 487, baseType: !838, size: 32, offset: 134080)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !458, line: 47, baseType: !457)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !712, file: !184, line: 490, baseType: !514, size: 64, offset: 134112)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !712, file: !184, line: 493, baseType: !480, size: 64, offset: 134208)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !712, file: !184, line: 496, baseType: !506, size: 32, offset: 134272)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !711)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !846, line: 26, baseType: !847)
!846 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !846, line: 25, flags: DIFlagFwdDecl)
!848 = !{!0, !849}
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "registry_semaphore", scope: !2, file: !483, line: 76, type: !662, isLocal: true, isDefinition: true)
!851 = !{i32 7, !"Dwarf Version", i32 5}
!852 = !{i32 2, !"Debug Info Version", i32 3}
!853 = !{i32 1, !"wchar_size", i32 4}
!854 = !{i32 7, !"PIC Level", i32 2}
!855 = !{i32 7, !"PIE Level", i32 2}
!856 = !{i32 7, !"uwtable", i32 2}
!857 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!858 = distinct !DISubprogram(name: "DefineImageRegistry", scope: !483, file: !483, line: 105, type: !859, scopeLine: 107, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !863)
!859 = !DISubroutineType(types: !860)
!860 = !{!506, !861, !622, !862}
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!863 = !{!864, !865, !866, !867, !868, !869}
!864 = !DILocalVariable(name: "type", arg: 1, scope: !858, file: !483, line: 105, type: !861)
!865 = !DILocalVariable(name: "option", arg: 2, scope: !858, file: !483, line: 106, type: !622)
!866 = !DILocalVariable(name: "exception", arg: 3, scope: !858, file: !483, line: 106, type: !862)
!867 = !DILocalVariable(name: "key", scope: !858, file: !483, line: 109, type: !642)
!868 = !DILocalVariable(name: "value", scope: !858, file: !483, line: 110, type: !642)
!869 = !DILocalVariable(name: "p", scope: !858, file: !483, line: 113, type: !548)
!870 = !DILocation(line: 0, scope: !858)
!871 = !DILocation(line: 108, column: 3, scope: !858)
!872 = !DILocation(line: 109, column: 5, scope: !858)
!873 = !DILocation(line: 110, column: 5, scope: !858)
!874 = !DILocation(line: 116, column: 10, scope: !858)
!875 = !DILocation(line: 117, column: 8, scope: !876)
!876 = distinct !DILexicalBlock(scope: !858, file: !483, line: 117, column: 3)
!877 = !DILocation(line: 0, scope: !876)
!878 = !DILocation(line: 117, column: 15, scope: !879)
!879 = distinct !DILexicalBlock(scope: !876, file: !483, line: 117, column: 3)
!880 = !{!881, !881, i64 0}
!881 = !{!"omnipotent char", !882, i64 0}
!882 = !{!"Simple C/C++ TBAA"}
!883 = !DILocation(line: 117, column: 3, scope: !876)
!884 = !DILocation(line: 117, column: 28, scope: !879)
!885 = !DILocation(line: 117, column: 3, scope: !879)
!886 = distinct !{!886, !883, !887, !888, !889}
!887 = !DILocation(line: 119, column: 7, scope: !876)
!888 = !{!"llvm.loop.mustprogress"}
!889 = !{!"llvm.loop.unroll.disable"}
!890 = !DILocation(line: 120, column: 9, scope: !858)
!891 = !DILocation(line: 121, column: 10, scope: !892)
!892 = distinct !DILexicalBlock(scope: !858, file: !483, line: 121, column: 7)
!893 = !DILocation(line: 121, column: 7, scope: !858)
!894 = !DILocation(line: 122, column: 36, scope: !892)
!895 = !DILocation(line: 122, column: 12, scope: !892)
!896 = !DILocation(line: 122, column: 5, scope: !892)
!897 = !DILocation(line: 123, column: 5, scope: !858)
!898 = !DILocation(line: 124, column: 10, scope: !858)
!899 = !DILocation(line: 125, column: 1, scope: !858)
