; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/resample.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/resample.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }

!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!418 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!419 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!420 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!421 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!422 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!423 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!424 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!425 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!426 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!427 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!428 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!429 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!430 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!431 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!432 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!433 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!434 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!435 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!436 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!437 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!438 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!439 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!440 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!441 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!442 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!443 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!444 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!445 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!446 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!447 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!448 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!449 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!450 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!451 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!452 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!453 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!454 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!455 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!456 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!457 = !DIEnumerator(name: "MagickListOptions", value: 38)
!458 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!459 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!460 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!461 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!462 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!463 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!464 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!465 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!466 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!467 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!468 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!469 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!470 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!471 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!472 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!473 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!474 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!475 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!476 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!477 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!478 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!479 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!480 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!481 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!482 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!483 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!484 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!485 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!486 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!487 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!488 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!489 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!490 = !{!491, !492, !557, !416, !502, !566, !539, !762, !525, !763, !765, !530, !743, !513, !767, !771}
!491 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResampleFilter", file: !102, line: 76, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ResampleFilter", file: !495, line: 91, size: 67072, elements: !496)
!495 = !DIFile(filename: "apps/538.imagick_r/src/magick/resample.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0925f091e7fc2ff137e3e9e645f8a517")
!496 = !{!497, !501, !722, !724, !725, !726, !727, !729, !730, !731, !732, !733, !749, !750, !751, !752, !753, !754, !755, !756, !760, !761}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !494, file: !495, line: 94, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !369, line: 50, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !494, file: !495, line: 97, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !505)
!505 = !{!506, !508, !510, !512, !515, !517, !519, !520, !521, !522, !523, !524, !535, !536, !537, !538, !540, !554, !556, !558, !560, !563, !564, !565, !571, !572, !573, !581, !582, !583, !584, !585, !586, !588, !590, !592, !594, !596, !598, !600, !601, !602, !603, !604, !605, !606, !614, !629, !643, !644, !645, !646, !650, !654, !658, !659, !660, !661, !662, !679, !680, !682, !683, !693, !694, !696, !697, !698, !699, !700, !701, !703, !704, !705, !706, !707, !708, !709, !711, !712, !713, !714, !715, !719, !721}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !504, file: !73, line: 153, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !504, file: !73, line: 156, baseType: !509, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !504, file: !73, line: 159, baseType: !511, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !504, file: !73, line: 162, baseType: !513, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !514, line: 46, baseType: !491)
!514 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!515 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !504, file: !73, line: 165, baseType: !516, size: 32, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !504, file: !73, line: 168, baseType: !518, size: 32, offset: 224)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !504, file: !73, line: 169, baseType: !518, size: 32, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !504, file: !73, line: 172, baseType: !513, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !504, file: !73, line: 173, baseType: !513, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !504, file: !73, line: 174, baseType: !513, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !504, file: !73, line: 175, baseType: !513, size: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !504, file: !73, line: 178, baseType: !525, size: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !528)
!528 = !{!529, !532, !533, !534}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !527, file: !326, line: 143, baseType: !530, size: 16)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !531)
!531 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !527, file: !326, line: 144, baseType: !530, size: 16, offset: 16)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !527, file: !326, line: 145, baseType: !530, size: 16, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !527, file: !326, line: 146, baseType: !530, size: 16, offset: 48)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !504, file: !73, line: 179, baseType: !526, size: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !504, file: !73, line: 180, baseType: !526, size: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !504, file: !73, line: 181, baseType: !526, size: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !504, file: !73, line: 184, baseType: !539, size: 64, offset: 832)
!539 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !504, file: !73, line: 187, baseType: !541, size: 768, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !543)
!543 = !{!544, !551, !552, !553}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !542, file: !73, line: 124, baseType: !545, size: 192)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !546, file: !73, line: 98, baseType: !539, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !546, file: !73, line: 99, baseType: !539, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !546, file: !73, line: 100, baseType: !539, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !542, file: !73, line: 125, baseType: !545, size: 192, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !542, file: !73, line: 126, baseType: !545, size: 192, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !542, file: !73, line: 127, baseType: !545, size: 192, offset: 576)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !504, file: !73, line: 190, baseType: !555, size: 32, offset: 1664)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !504, file: !73, line: 193, baseType: !557, size: 64, offset: 1728)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !504, file: !73, line: 196, baseType: !559, size: 32, offset: 1792)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !504, file: !73, line: 199, baseType: !561, size: 64, offset: 1856)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !504, file: !73, line: 200, baseType: !561, size: 64, offset: 1920)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !504, file: !73, line: 201, baseType: !561, size: 64, offset: 1984)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !504, file: !73, line: 204, baseType: !566, size: 64, offset: 2048)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !567, line: 77, baseType: !568)
!567 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !569, line: 193, baseType: !570)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!570 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !504, file: !73, line: 207, baseType: !539, size: 64, offset: 2112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !504, file: !73, line: 208, baseType: !539, size: 64, offset: 2176)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !504, file: !73, line: 211, baseType: !574, size: 256, offset: 2240)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !576)
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !575, file: !153, line: 124, baseType: !513, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !575, file: !153, line: 125, baseType: !513, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !575, file: !153, line: 128, baseType: !566, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !575, file: !153, line: 129, baseType: !566, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !504, file: !73, line: 212, baseType: !574, size: 256, offset: 2496)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !504, file: !73, line: 213, baseType: !574, size: 256, offset: 2752)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !504, file: !73, line: 216, baseType: !539, size: 64, offset: 3008)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !504, file: !73, line: 217, baseType: !539, size: 64, offset: 3072)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !504, file: !73, line: 218, baseType: !539, size: 64, offset: 3136)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !504, file: !73, line: 221, baseType: !587, size: 32, offset: 3200)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !504, file: !73, line: 224, baseType: !589, size: 32, offset: 3232)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !504, file: !73, line: 227, baseType: !591, size: 32, offset: 3264)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !504, file: !73, line: 230, baseType: !593, size: 32, offset: 3296)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !504, file: !73, line: 233, baseType: !595, size: 32, offset: 3328)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !504, file: !73, line: 236, baseType: !597, size: 32, offset: 3360)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !504, file: !73, line: 239, baseType: !599, size: 64, offset: 3392)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !504, file: !73, line: 242, baseType: !513, size: 64, offset: 3456)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !504, file: !73, line: 243, baseType: !513, size: 64, offset: 3520)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !504, file: !73, line: 246, baseType: !566, size: 64, offset: 3584)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !504, file: !73, line: 249, baseType: !513, size: 64, offset: 3648)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !504, file: !73, line: 250, baseType: !513, size: 64, offset: 3712)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !504, file: !73, line: 253, baseType: !566, size: 64, offset: 3776)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !504, file: !73, line: 256, baseType: !607, size: 192, offset: 3840)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !608, line: 68, baseType: !609)
!608 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !608, line: 62, size: 192, elements: !610)
!610 = !{!611, !612, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !609, file: !608, line: 65, baseType: !539, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !609, file: !608, line: 66, baseType: !539, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !609, file: !608, line: 67, baseType: !539, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !504, file: !73, line: 259, baseType: !615, size: 512, offset: 4032)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !617)
!617 = !{!618, !625, !626, !628}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !616, file: !247, line: 43, baseType: !619, size: 192)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !621)
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !620, file: !247, line: 35, baseType: !539, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !620, file: !247, line: 36, baseType: !539, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !620, file: !247, line: 37, baseType: !539, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !616, file: !247, line: 44, baseType: !619, size: 192, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !616, file: !247, line: 47, baseType: !627, size: 32, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !616, file: !247, line: 50, baseType: !513, size: 64, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !504, file: !73, line: 262, baseType: !630, size: 64, offset: 4544)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !631, line: 26, baseType: !632)
!631 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!518, !635, !637, !640, !557}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !639)
!639 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !642)
!642 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !504, file: !73, line: 265, baseType: !557, size: 64, offset: 4608)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !504, file: !73, line: 266, baseType: !557, size: 64, offset: 4672)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !504, file: !73, line: 267, baseType: !557, size: 64, offset: 4736)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !504, file: !73, line: 270, baseType: !647, size: 64, offset: 4800)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !649)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !504, file: !73, line: 273, baseType: !651, size: 64, offset: 4864)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !653)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !504, file: !73, line: 276, baseType: !655, size: 32768, offset: 4928)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 32768, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 4096)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !504, file: !73, line: 277, baseType: !655, size: 32768, offset: 37696)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !504, file: !73, line: 278, baseType: !655, size: 32768, offset: 70464)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !504, file: !73, line: 281, baseType: !513, size: 64, offset: 103232)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !504, file: !73, line: 282, baseType: !513, size: 64, offset: 103296)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !504, file: !73, line: 285, baseType: !663, size: 448, offset: 103360)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !665)
!665 = !{!666, !668, !669, !670, !671, !672, !673, !678}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !664, file: !253, line: 105, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !664, file: !253, line: 108, baseType: !416, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !664, file: !253, line: 111, baseType: !561, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !664, file: !253, line: 112, baseType: !561, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !664, file: !253, line: 115, baseType: !557, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !664, file: !253, line: 118, baseType: !518, size: 32, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !664, file: !253, line: 121, baseType: !674, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !676, line: 26, baseType: !677)
!676 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !676, line: 25, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !664, file: !253, line: 124, baseType: !513, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !504, file: !73, line: 288, baseType: !518, size: 32, offset: 103808)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !504, file: !73, line: 291, baseType: !681, size: 64, offset: 103872)
!681 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !566)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !504, file: !73, line: 294, baseType: !674, size: 64, offset: 103936)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !504, file: !73, line: 297, baseType: !684, size: 256, offset: 104000)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !686)
!686 = !{!687, !688, !689, !692}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !89, line: 30, baseType: !561, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !685, file: !89, line: 33, baseType: !513, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !685, file: !89, line: 36, baseType: !690, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !685, file: !89, line: 39, baseType: !513, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !504, file: !73, line: 298, baseType: !684, size: 256, offset: 104256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !504, file: !73, line: 299, baseType: !695, size: 64, offset: 104512)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !504, file: !73, line: 302, baseType: !513, size: 64, offset: 104576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !504, file: !73, line: 305, baseType: !513, size: 64, offset: 104640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !504, file: !73, line: 308, baseType: !599, size: 64, offset: 104704)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !504, file: !73, line: 309, baseType: !599, size: 64, offset: 104768)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !73, line: 310, baseType: !599, size: 64, offset: 104832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !504, file: !73, line: 313, baseType: !702, size: 32, offset: 104896)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !504, file: !73, line: 316, baseType: !518, size: 32, offset: 104928)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !504, file: !73, line: 319, baseType: !526, size: 64, offset: 104960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !504, file: !73, line: 322, baseType: !599, size: 64, offset: 105024)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !504, file: !73, line: 325, baseType: !574, size: 256, offset: 105088)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !504, file: !73, line: 328, baseType: !557, size: 64, offset: 105344)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !504, file: !73, line: 329, baseType: !557, size: 64, offset: 105408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !504, file: !73, line: 332, baseType: !710, size: 32, offset: 105472)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !504, file: !73, line: 335, baseType: !518, size: 32, offset: 105504)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !504, file: !73, line: 338, baseType: !641, size: 64, offset: 105536)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !504, file: !73, line: 341, baseType: !518, size: 32, offset: 105600)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !504, file: !73, line: 344, baseType: !513, size: 64, offset: 105664)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !504, file: !73, line: 347, baseType: !716, size: 64, offset: 105728)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !717, line: 7, baseType: !718)
!717 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !569, line: 160, baseType: !570)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !504, file: !73, line: 350, baseType: !720, size: 32, offset: 105792)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !504, file: !73, line: 353, baseType: !513, size: 64, offset: 105856)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !494, file: !495, line: 100, baseType: !723, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !494, file: !495, line: 103, baseType: !518, size: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "image_area", scope: !494, file: !495, line: 107, baseType: !566, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !494, file: !495, line: 110, baseType: !702, size: 32, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel", scope: !494, file: !495, line: 113, baseType: !728, size: 32, offset: 352)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !369, line: 47, baseType: !368)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !494, file: !495, line: 116, baseType: !587, size: 32, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "limit_reached", scope: !494, file: !495, line: 120, baseType: !518, size: 32, offset: 416)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "do_interpolate", scope: !494, file: !495, line: 121, baseType: !518, size: 32, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "average_defined", scope: !494, file: !495, line: 122, baseType: !518, size: 32, offset: 480)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "average_pixel", scope: !494, file: !495, line: 125, baseType: !734, size: 448, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !745, !746, !747, !748}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !735, file: !326, line: 107, baseType: !507, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !735, file: !326, line: 110, baseType: !509, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !735, file: !326, line: 113, baseType: !518, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !735, file: !326, line: 116, baseType: !539, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !735, file: !326, line: 119, baseType: !513, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !735, file: !326, line: 122, baseType: !743, size: 32, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !744)
!744 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !735, file: !326, line: 123, baseType: !743, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !735, file: !326, line: 124, baseType: !743, size: 32, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !735, file: !326, line: 125, baseType: !743, size: 32, offset: 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !735, file: !326, line: 126, baseType: !743, size: 32, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !494, file: !495, line: 129, baseType: !539, size: 64, offset: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !494, file: !495, line: 129, baseType: !539, size: 64, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !494, file: !495, line: 129, baseType: !539, size: 64, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Vlimit", scope: !494, file: !495, line: 130, baseType: !539, size: 64, offset: 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Ulimit", scope: !494, file: !495, line: 130, baseType: !539, size: 64, offset: 1216)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Uwidth", scope: !494, file: !495, line: 130, baseType: !539, size: 64, offset: 1280)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "slope", scope: !494, file: !495, line: 130, baseType: !539, size: 64, offset: 1344)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "filter_lut", scope: !494, file: !495, line: 135, baseType: !757, size: 65536, offset: 1408)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 65536, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 1024)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "support", scope: !494, file: !495, line: 147, baseType: !539, size: 64, offset: 66944)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !494, file: !495, line: 150, baseType: !513, size: 64, offset: 67008)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !530)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResizeFilter", file: !769, line: 26, baseType: !770)
!769 = !DIFile(filename: "apps/538.imagick_r/src/magick/resize.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3d8d663b1b2fd0b2a79f67f76b4db66b")
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ResizeFilter", file: !769, line: 25, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!773 = !{i32 7, !"Dwarf Version", i32 5}
!774 = !{i32 2, !"Debug Info Version", i32 3}
!775 = !{i32 1, !"wchar_size", i32 4}
!776 = !{i32 7, !"PIC Level", i32 2}
!777 = !{i32 7, !"PIE Level", i32 2}
!778 = !{i32 7, !"uwtable", i32 2}
!779 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!780 = distinct !DISubprogram(name: "AcquireResampleFilter", scope: !495, file: !495, line: 206, type: !781, scopeLine: 208, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !785)
!781 = !DISubroutineType(types: !782)
!782 = !{!492, !783, !723}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!785 = !{!786, !787, !788, !789, !792}
!786 = !DILocalVariable(name: "image", arg: 1, scope: !780, file: !495, line: 206, type: !783)
!787 = !DILocalVariable(name: "exception", arg: 2, scope: !780, file: !495, line: 207, type: !723)
!788 = !DILocalVariable(name: "resample_filter", scope: !780, file: !495, line: 210, type: !492)
!789 = !DILocalVariable(name: "message", scope: !790, file: !495, line: 222, type: !561)
!790 = distinct !DILexicalBlock(scope: !791, file: !495, line: 222, column: 5)
!791 = distinct !DILexicalBlock(scope: !780, file: !495, line: 221, column: 7)
!792 = !DILocalVariable(name: "exception", scope: !790, file: !495, line: 222, type: !663)
!793 = !DILocation(line: 0, scope: !780)
!794 = !DILocation(line: 214, column: 14, scope: !795)
!795 = distinct !DILexicalBlock(scope: !780, file: !495, line: 214, column: 7)
!796 = !{!797, !798, i64 12976}
