; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/resize.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/resize.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i32, i32 }
%struct.anon.0 = type { ptr, double, double, double, double, i32 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mapping", scope: !2, file: !3, line: 765, type: !928, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "AcquireResizeFilter", scope: !3, file: !3, line: 728, type: !4, scopeLine: 731, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !644, retainedNodes: !893)
!3 = !DIFile(filename: "apps/538.imagick_r/src/magick/resize.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "37b1b6791e8c15b40533e81b15218703")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !58, !641, !18, !642, !643}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResizeFilter", file: !8, line: 26, baseType: !9)
!8 = !DIFile(filename: "apps/538.imagick_r/src/magick/resize.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3d8d663b1b2fd0b2a79f67f76b4db66b")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ResizeFilter", file: !3, line: 87, size: 640, elements: !10)
!10 = !{!11, !21, !22, !23, !24, !25, !26, !30, !53, !54}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !9, file: !3, line: 90, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !16, line: 78, baseType: !17)
!16 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!17 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !9, file: !3, line: 91, baseType: !12, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "support", scope: !9, file: !3, line: 92, baseType: !15, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "window_support", scope: !9, file: !3, line: 93, baseType: !15, size: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !9, file: !3, line: 94, baseType: !15, size: 32, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !9, file: !3, line: 95, baseType: !15, size: 32, offset: 224)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "coefficient", scope: !9, file: !3, line: 96, baseType: !27, size: 224, offset: 256)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 224, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 7)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "filterWeightingType", scope: !9, file: !3, line: 99, baseType: !31, size: 32, offset: 480)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResizeWeightingFunctionType", file: !32, line: 44, baseType: !33)
!32 = !DIFile(filename: "apps/538.imagick_r/src/magick/resize-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ee028ba2160e82968d2b02ff146f9934")
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 25, baseType: !34, size: 32, elements: !35)
!34 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!36 = !DIEnumerator(name: "BoxWeightingFunction", value: 0)
!37 = !DIEnumerator(name: "TriangleWeightingFunction", value: 1)
!38 = !DIEnumerator(name: "CubicBCWeightingFunction", value: 2)
!39 = !DIEnumerator(name: "HanningWeightingFunction", value: 3)
!40 = !DIEnumerator(name: "HammingWeightingFunction", value: 4)
!41 = !DIEnumerator(name: "BlackmanWeightingFunction", value: 5)
!42 = !DIEnumerator(name: "GaussianWeightingFunction", value: 6)
!43 = !DIEnumerator(name: "QuadraticWeightingFunction", value: 7)
!44 = !DIEnumerator(name: "JincWeightingFunction", value: 8)
!45 = !DIEnumerator(name: "SincWeightingFunction", value: 9)
!46 = !DIEnumerator(name: "SincFastWeightingFunction", value: 10)
!47 = !DIEnumerator(name: "KaiserWeightingFunction", value: 11)
!48 = !DIEnumerator(name: "WelshWeightingFunction", value: 12)
!49 = !DIEnumerator(name: "BohmanWeightingFunction", value: 13)
!50 = !DIEnumerator(name: "LagrangeWeightingFunction", value: 14)
!51 = !DIEnumerator(name: "CosineWeightingFunction", value: 15)
!52 = !DIEnumerator(name: "LastWeightingFunction", value: 16)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "windowWeightingType", scope: !9, file: !3, line: 100, baseType: !31, size: 32, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !9, file: !3, line: 103, baseType: !55, size: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!57 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !16, line: 221, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !62, line: 150, size: 105920, elements: !63)
!62 = !DIFile(filename: "apps/538.imagick_r/src/magick/image.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9408eec9abffe54016aa20ae735786b")
!63 = !{!64, !71, !110, !137, !138, !151, !157, !158, !159, !160, !161, !162, !174, !175, !176, !177, !179, !193, !203, !205, !212, !215, !216, !217, !223, !224, !225, !234, !235, !236, !237, !238, !239, !276, !288, !296, !312, !385, !395, !397, !398, !399, !400, !401, !402, !403, !411, !432, !446, !447, !448, !449, !453, !457, !461, !462, !463, !464, !465, !556, !557, !559, !560, !570, !571, !573, !574, !575, !576, !577, !578, !596, !597, !598, !599, !600, !601, !602, !618, !619, !620, !621, !622, !626, !640}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !61, file: !62, line: 153, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !16, line: 209, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 204, baseType: !34, size: 32, elements: !67)
!67 = !{!68, !69, !70}
!68 = !DIEnumerator(name: "UndefinedClass", value: 0)
!69 = !DIEnumerator(name: "DirectClass", value: 1)
!70 = !DIEnumerator(name: "PseudoClass", value: 2)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !61, file: !62, line: 156, baseType: !72, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !73, line: 61, baseType: !74)
!73 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4f032944b177fc61244445fe3a234334")
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 25, baseType: !34, size: 32, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!76 = !DIEnumerator(name: "UndefinedColorspace", value: 0)
!77 = !DIEnumerator(name: "RGBColorspace", value: 1)
!78 = !DIEnumerator(name: "GRAYColorspace", value: 2)
!79 = !DIEnumerator(name: "TransparentColorspace", value: 3)
!80 = !DIEnumerator(name: "OHTAColorspace", value: 4)
!81 = !DIEnumerator(name: "LabColorspace", value: 5)
!82 = !DIEnumerator(name: "XYZColorspace", value: 6)
!83 = !DIEnumerator(name: "YCbCrColorspace", value: 7)
!84 = !DIEnumerator(name: "YCCColorspace", value: 8)
!85 = !DIEnumerator(name: "YIQColorspace", value: 9)
!86 = !DIEnumerator(name: "YPbPrColorspace", value: 10)
!87 = !DIEnumerator(name: "YUVColorspace", value: 11)
!88 = !DIEnumerator(name: "CMYKColorspace", value: 12)
!89 = !DIEnumerator(name: "sRGBColorspace", value: 13)
!90 = !DIEnumerator(name: "HSBColorspace", value: 14)
!91 = !DIEnumerator(name: "HSLColorspace", value: 15)
!92 = !DIEnumerator(name: "HWBColorspace", value: 16)
!93 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17)
!94 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18)
!95 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19)
!96 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20)
!97 = !DIEnumerator(name: "LogColorspace", value: 21)
!98 = !DIEnumerator(name: "CMYColorspace", value: 22)
!99 = !DIEnumerator(name: "LuvColorspace", value: 23)
!100 = !DIEnumerator(name: "HCLColorspace", value: 24)
!101 = !DIEnumerator(name: "LCHColorspace", value: 25)
!102 = !DIEnumerator(name: "LMSColorspace", value: 26)
!103 = !DIEnumerator(name: "LCHabColorspace", value: 27)
!104 = !DIEnumerator(name: "LCHuvColorspace", value: 28)
!105 = !DIEnumerator(name: "scRGBColorspace", value: 29)
!106 = !DIEnumerator(name: "HSIColorspace", value: 30)
!107 = !DIEnumerator(name: "HSVColorspace", value: 31)
!108 = !DIEnumerator(name: "HCLpColorspace", value: 32)
!109 = !DIEnumerator(name: "YDbDrColorspace", value: 33)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !61, file: !62, line: 159, baseType: !111, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !112, line: 49, baseType: !113)
!112 = !DIFile(filename: "apps/538.imagick_r/src/magick/compress.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "359677d10ff2e6d05d86b0a6c5af7465")
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 25, baseType: !34, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!115 = !DIEnumerator(name: "UndefinedCompression", value: 0)
!116 = !DIEnumerator(name: "NoCompression", value: 1)
!117 = !DIEnumerator(name: "BZipCompression", value: 2)
!118 = !DIEnumerator(name: "DXT1Compression", value: 3)
!119 = !DIEnumerator(name: "DXT3Compression", value: 4)
!120 = !DIEnumerator(name: "DXT5Compression", value: 5)
!121 = !DIEnumerator(name: "FaxCompression", value: 6)
!122 = !DIEnumerator(name: "Group4Compression", value: 7)
!123 = !DIEnumerator(name: "JPEGCompression", value: 8)
!124 = !DIEnumerator(name: "JPEG2000Compression", value: 9)
!125 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10)
!126 = !DIEnumerator(name: "LZWCompression", value: 11)
!127 = !DIEnumerator(name: "RLECompression", value: 12)
!128 = !DIEnumerator(name: "ZipCompression", value: 13)
!129 = !DIEnumerator(name: "ZipSCompression", value: 14)
!130 = !DIEnumerator(name: "PizCompression", value: 15)
!131 = !DIEnumerator(name: "Pxr24Compression", value: 16)
!132 = !DIEnumerator(name: "B44Compression", value: 17)
!133 = !DIEnumerator(name: "B44ACompression", value: 18)
!134 = !DIEnumerator(name: "LZMACompression", value: 19)
!135 = !DIEnumerator(name: "JBIG1Compression", value: 20)
!136 = !DIEnumerator(name: "JBIG2Compression", value: 21)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !61, file: !62, line: 162, baseType: !55, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !61, file: !62, line: 165, baseType: !139, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !62, line: 86, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 75, baseType: !34, size: 32, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150}
!142 = !DIEnumerator(name: "UndefinedOrientation", value: 0)
!143 = !DIEnumerator(name: "TopLeftOrientation", value: 1)
!144 = !DIEnumerator(name: "TopRightOrientation", value: 2)
!145 = !DIEnumerator(name: "BottomRightOrientation", value: 3)
!146 = !DIEnumerator(name: "BottomLeftOrientation", value: 4)
!147 = !DIEnumerator(name: "LeftTopOrientation", value: 5)
!148 = !DIEnumerator(name: "RightTopOrientation", value: 6)
!149 = !DIEnumerator(name: "RightBottomOrientation", value: 7)
!150 = !DIEnumerator(name: "LeftBottomOrientation", value: 8)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !61, file: !62, line: 168, baseType: !152, size: 32, offset: 224)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !16, line: 215, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 211, baseType: !34, size: 32, elements: !154)
!154 = !{!155, !156}
!155 = !DIEnumerator(name: "MagickFalse", value: 0)
!156 = !DIEnumerator(name: "MagickTrue", value: 1)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !61, file: !62, line: 169, baseType: !152, size: 32, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !61, file: !62, line: 172, baseType: !55, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !61, file: !62, line: 173, baseType: !55, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !61, file: !62, line: 174, baseType: !55, size: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !61, file: !62, line: 175, baseType: !55, size: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !61, file: !62, line: 178, baseType: !163, size: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !165, line: 148, baseType: !166)
!165 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !165, line: 131, size: 64, elements: !167)
!167 = !{!168, !171, !172, !173}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !166, file: !165, line: 143, baseType: !169, size: 16)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !16, line: 93, baseType: !170)
!170 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !166, file: !165, line: 144, baseType: !169, size: 16, offset: 16)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !166, file: !165, line: 145, baseType: !169, size: 16, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !166, file: !165, line: 146, baseType: !169, size: 16, offset: 48)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !61, file: !62, line: 179, baseType: !164, size: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !61, file: !62, line: 180, baseType: !164, size: 64, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !61, file: !62, line: 181, baseType: !164, size: 64, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !61, file: !62, line: 184, baseType: !178, size: 64, offset: 832)
!178 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !61, file: !62, line: 187, baseType: !180, size: 768, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !62, line: 128, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !62, line: 121, size: 768, elements: !182)
!182 = !{!183, !190, !191, !192}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !181, file: !62, line: 124, baseType: !184, size: 192)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !62, line: 101, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !62, line: 95, size: 192, elements: !186)
!186 = !{!187, !188, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !185, file: !62, line: 98, baseType: !178, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !185, file: !62, line: 99, baseType: !178, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !185, file: !62, line: 100, baseType: !178, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !181, file: !62, line: 125, baseType: !184, size: 192, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !181, file: !62, line: 126, baseType: !184, size: 192, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !181, file: !62, line: 127, baseType: !184, size: 192, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !61, file: !62, line: 190, baseType: !194, size: 32, offset: 1664)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !195, line: 49, baseType: !196)
!195 = !DIFile(filename: "apps/538.imagick_r/src/magick/profile.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fb61c1ae348c42a2b68ac081d4b39ee3")
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !195, line: 42, baseType: !34, size: 32, elements: !197)
!197 = !{!198, !199, !200, !201, !202}
!198 = !DIEnumerator(name: "UndefinedIntent", value: 0)
!199 = !DIEnumerator(name: "SaturationIntent", value: 1)
!200 = !DIEnumerator(name: "PerceptualIntent", value: 2)
!201 = !DIEnumerator(name: "AbsoluteIntent", value: 3)
!202 = !DIEnumerator(name: "RelativeIntent", value: 4)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !61, file: !62, line: 193, baseType: !204, size: 64, offset: 1728)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !61, file: !62, line: 196, baseType: !206, size: 32, offset: 1792)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !62, line: 93, baseType: !207)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 88, baseType: !34, size: 32, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIEnumerator(name: "UndefinedResolution", value: 0)
!210 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1)
!211 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !61, file: !62, line: 199, baseType: !213, size: 64, offset: 1856)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !61, file: !62, line: 200, baseType: !213, size: 64, offset: 1920)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !61, file: !62, line: 201, baseType: !213, size: 64, offset: 1984)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !61, file: !62, line: 204, baseType: !218, size: 64, offset: 2048)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !219, line: 77, baseType: !220)
!219 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !221, line: 193, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!222 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !61, file: !62, line: 207, baseType: !178, size: 64, offset: 2112)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !61, file: !62, line: 208, baseType: !178, size: 64, offset: 2176)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !61, file: !62, line: 211, baseType: !226, size: 256, offset: 2240)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !227, line: 130, baseType: !228)
!227 = !DIFile(filename: "apps/538.imagick_r/src/magick/geometry.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "889bed117eb2a2fce6e2622bd130bcd2")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !227, line: 121, size: 256, elements: !229)
!229 = !{!230, !231, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !228, file: !227, line: 124, baseType: !55, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !228, file: !227, line: 125, baseType: !55, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !228, file: !227, line: 128, baseType: !218, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !228, file: !227, line: 129, baseType: !218, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !61, file: !62, line: 212, baseType: !226, size: 256, offset: 2496)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !61, file: !62, line: 213, baseType: !226, size: 256, offset: 2752)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !61, file: !62, line: 216, baseType: !178, size: 64, offset: 3008)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !61, file: !62, line: 217, baseType: !178, size: 64, offset: 3072)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !61, file: !62, line: 218, baseType: !178, size: 64, offset: 3136)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !61, file: !62, line: 221, baseType: !240, size: 32, offset: 3200)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !241, line: 66, baseType: !242)
!241 = !DIFile(filename: "apps/538.imagick_r/src/magick/resample.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "722fed6aaf07c122ede72839e4dadc42")
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !241, line: 32, baseType: !34, size: 32, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!244 = !DIEnumerator(name: "UndefinedFilter", value: 0)
!245 = !DIEnumerator(name: "PointFilter", value: 1)
!246 = !DIEnumerator(name: "BoxFilter", value: 2)
!247 = !DIEnumerator(name: "TriangleFilter", value: 3)
!248 = !DIEnumerator(name: "HermiteFilter", value: 4)
!249 = !DIEnumerator(name: "HanningFilter", value: 5)
!250 = !DIEnumerator(name: "HammingFilter", value: 6)
!251 = !DIEnumerator(name: "BlackmanFilter", value: 7)
!252 = !DIEnumerator(name: "GaussianFilter", value: 8)
!253 = !DIEnumerator(name: "QuadraticFilter", value: 9)
!254 = !DIEnumerator(name: "CubicFilter", value: 10)
!255 = !DIEnumerator(name: "CatromFilter", value: 11)
!256 = !DIEnumerator(name: "MitchellFilter", value: 12)
!257 = !DIEnumerator(name: "JincFilter", value: 13)
!258 = !DIEnumerator(name: "SincFilter", value: 14)
!259 = !DIEnumerator(name: "SincFastFilter", value: 15)
!260 = !DIEnumerator(name: "KaiserFilter", value: 16)
!261 = !DIEnumerator(name: "WelshFilter", value: 17)
!262 = !DIEnumerator(name: "ParzenFilter", value: 18)
!263 = !DIEnumerator(name: "BohmanFilter", value: 19)
!264 = !DIEnumerator(name: "BartlettFilter", value: 20)
!265 = !DIEnumerator(name: "LagrangeFilter", value: 21)
!266 = !DIEnumerator(name: "LanczosFilter", value: 22)
!267 = !DIEnumerator(name: "LanczosSharpFilter", value: 23)
!268 = !DIEnumerator(name: "Lanczos2Filter", value: 24)
!269 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25)
!270 = !DIEnumerator(name: "RobidouxFilter", value: 26)
!271 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27)
!272 = !DIEnumerator(name: "CosineFilter", value: 28)
!273 = !DIEnumerator(name: "SplineFilter", value: 29)
!274 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30)
!275 = !DIEnumerator(name: "SentinelFilter", value: 31)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !61, file: !62, line: 224, baseType: !277, size: 32, offset: 3232)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !62, line: 73, baseType: !278)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 63, baseType: !34, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287}
!280 = !DIEnumerator(name: "UndefinedInterlace", value: 0)
!281 = !DIEnumerator(name: "NoInterlace", value: 1)
!282 = !DIEnumerator(name: "LineInterlace", value: 2)
!283 = !DIEnumerator(name: "PlaneInterlace", value: 3)
!284 = !DIEnumerator(name: "PartitionInterlace", value: 4)
!285 = !DIEnumerator(name: "GIFInterlace", value: 5)
!286 = !DIEnumerator(name: "JPEGInterlace", value: 6)
!287 = !DIEnumerator(name: "PNGInterlace", value: 7)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !61, file: !62, line: 227, baseType: !289, size: 32, offset: 3264)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !290, line: 35, baseType: !291)
!290 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1f6eaed79d9a4eaf712cd066f6ff022a")
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !290, line: 30, baseType: !34, size: 32, elements: !292)
!292 = !{!293, !294, !295}
!293 = !DIEnumerator(name: "UndefinedEndian", value: 0)
!294 = !DIEnumerator(name: "LSBEndian", value: 1)
!295 = !DIEnumerator(name: "MSBEndian", value: 2)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !61, file: !62, line: 230, baseType: !297, size: 32, offset: 3296)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !227, line: 91, baseType: !298)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 77, baseType: !34, size: 32, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!300 = !DIEnumerator(name: "UndefinedGravity", value: 0)
!301 = !DIEnumerator(name: "ForgetGravity", value: 0)
!302 = !DIEnumerator(name: "NorthWestGravity", value: 1)
!303 = !DIEnumerator(name: "NorthGravity", value: 2)
!304 = !DIEnumerator(name: "NorthEastGravity", value: 3)
!305 = !DIEnumerator(name: "WestGravity", value: 4)
!306 = !DIEnumerator(name: "CenterGravity", value: 5)
!307 = !DIEnumerator(name: "EastGravity", value: 6)
!308 = !DIEnumerator(name: "SouthWestGravity", value: 7)
!309 = !DIEnumerator(name: "SouthGravity", value: 8)
!310 = !DIEnumerator(name: "SouthEastGravity", value: 9)
!311 = !DIEnumerator(name: "StaticGravity", value: 10)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !61, file: !62, line: 233, baseType: !313, size: 32, offset: 3328)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !314, line: 99, baseType: !315)
!314 = !DIFile(filename: "apps/538.imagick_r/src/magick/composite.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "837959ddb1dc628f80f1f9b5cdda1fb4")
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 25, baseType: !34, size: 32, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!317 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0)
!318 = !DIEnumerator(name: "NoCompositeOp", value: 1)
!319 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2)
!320 = !DIEnumerator(name: "AtopCompositeOp", value: 3)
!321 = !DIEnumerator(name: "BlendCompositeOp", value: 4)
!322 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5)
!323 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6)
!324 = !DIEnumerator(name: "ClearCompositeOp", value: 7)
!325 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8)
!326 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9)
!327 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10)
!328 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11)
!329 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12)
!330 = !DIEnumerator(name: "CopyCompositeOp", value: 13)
!331 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14)
!332 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15)
!333 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16)
!334 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17)
!335 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18)
!336 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19)
!337 = !DIEnumerator(name: "DarkenCompositeOp", value: 20)
!338 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21)
!339 = !DIEnumerator(name: "DstCompositeOp", value: 22)
!340 = !DIEnumerator(name: "DstInCompositeOp", value: 23)
!341 = !DIEnumerator(name: "DstOutCompositeOp", value: 24)
!342 = !DIEnumerator(name: "DstOverCompositeOp", value: 25)
!343 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26)
!344 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27)
!345 = !DIEnumerator(name: "DissolveCompositeOp", value: 28)
!346 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29)
!347 = !DIEnumerator(name: "HardLightCompositeOp", value: 30)
!348 = !DIEnumerator(name: "HueCompositeOp", value: 31)
!349 = !DIEnumerator(name: "InCompositeOp", value: 32)
!350 = !DIEnumerator(name: "LightenCompositeOp", value: 33)
!351 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34)
!352 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35)
!353 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36)
!354 = !DIEnumerator(name: "ModulateCompositeOp", value: 37)
!355 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38)
!356 = !DIEnumerator(name: "OutCompositeOp", value: 39)
!357 = !DIEnumerator(name: "OverCompositeOp", value: 40)
!358 = !DIEnumerator(name: "OverlayCompositeOp", value: 41)
!359 = !DIEnumerator(name: "PlusCompositeOp", value: 42)
!360 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43)
!361 = !DIEnumerator(name: "SaturateCompositeOp", value: 44)
!362 = !DIEnumerator(name: "ScreenCompositeOp", value: 45)
!363 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46)
!364 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47)
!365 = !DIEnumerator(name: "SrcCompositeOp", value: 48)
!366 = !DIEnumerator(name: "SrcInCompositeOp", value: 49)
!367 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50)
!368 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51)
!369 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52)
!370 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53)
!371 = !DIEnumerator(name: "XorCompositeOp", value: 54)
!372 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55)
!373 = !DIEnumerator(name: "DistortCompositeOp", value: 56)
!374 = !DIEnumerator(name: "BlurCompositeOp", value: 57)
!375 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58)
!376 = !DIEnumerator(name: "VividLightCompositeOp", value: 59)
!377 = !DIEnumerator(name: "PinLightCompositeOp", value: 60)
!378 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61)
!379 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62)
!380 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63)
!381 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64)
!382 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65)
!383 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66)
!384 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !61, file: !62, line: 236, baseType: !386, size: 32, offset: 3360)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !387, line: 32, baseType: !388)
!387 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!388 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !387, line: 25, baseType: !34, size: 32, elements: !389)
!389 = !{!390, !391, !392, !393, !394}
!390 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!391 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!392 = !DIEnumerator(name: "NoneDispose", value: 1)
!393 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!394 = !DIEnumerator(name: "PreviousDispose", value: 3)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !61, file: !62, line: 239, baseType: !396, size: 64, offset: 3392)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !61, file: !62, line: 242, baseType: !55, size: 64, offset: 3456)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !61, file: !62, line: 243, baseType: !55, size: 64, offset: 3520)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !61, file: !62, line: 246, baseType: !218, size: 64, offset: 3584)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !61, file: !62, line: 249, baseType: !55, size: 64, offset: 3648)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !61, file: !62, line: 250, baseType: !55, size: 64, offset: 3712)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !61, file: !62, line: 253, baseType: !218, size: 64, offset: 3776)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !61, file: !62, line: 256, baseType: !404, size: 192, offset: 3840)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !405, line: 68, baseType: !406)
!405 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !405, line: 62, size: 192, elements: !407)
!407 = !{!408, !409, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !406, file: !405, line: 65, baseType: !178, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !406, file: !405, line: 66, baseType: !178, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !406, file: !405, line: 67, baseType: !178, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !61, file: !62, line: 259, baseType: !412, size: 512, offset: 4032)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !413, line: 51, baseType: !414)
!413 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !413, line: 40, size: 512, elements: !415)
!415 = !{!416, !423, !424, !431}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !414, file: !413, line: 43, baseType: !417, size: 192)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !413, line: 38, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !413, line: 32, size: 192, elements: !419)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !418, file: !413, line: 35, baseType: !178, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !418, file: !413, line: 36, baseType: !178, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !418, file: !413, line: 37, baseType: !178, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !414, file: !413, line: 44, baseType: !417, size: 192, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !414, file: !413, line: 47, baseType: !425, size: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !413, line: 30, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 25, baseType: !34, size: 32, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!429 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!430 = !DIEnumerator(name: "RunningTimerState", value: 2)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !414, file: !413, line: 50, baseType: !55, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !61, file: !62, line: 262, baseType: !433, size: 64, offset: 4544)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !434, line: 26, baseType: !435)
!434 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!152, !438, !440, !443, !204}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !16, line: 150, baseType: !442)
!442 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !16, line: 151, baseType: !445)
!445 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !61, file: !62, line: 265, baseType: !204, size: 64, offset: 4608)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !61, file: !62, line: 266, baseType: !204, size: 64, offset: 4672)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !61, file: !62, line: 267, baseType: !204, size: 64, offset: 4736)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !61, file: !62, line: 270, baseType: !450, size: 64, offset: 4800)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !112, line: 52, baseType: !452)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !112, line: 51, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !61, file: !62, line: 273, baseType: !454, size: 64, offset: 4864)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !16, line: 217, baseType: !456)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !16, line: 217, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !61, file: !62, line: 276, baseType: !458, size: 32768, offset: 4928)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 32768, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 4096)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !61, file: !62, line: 277, baseType: !458, size: 32768, offset: 37696)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !61, file: !62, line: 278, baseType: !458, size: 32768, offset: 70464)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !61, file: !62, line: 281, baseType: !55, size: 64, offset: 103232)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !61, file: !62, line: 282, baseType: !55, size: 64, offset: 103296)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !61, file: !62, line: 285, baseType: !466, size: 448, offset: 103360)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !16, line: 219, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !468, line: 102, size: 448, elements: !469)
!468 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cd97c70c025a9cff45f4138c27a79124")
!469 = !{!470, !544, !546, !547, !548, !549, !550, !555}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !467, file: !468, line: 105, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !468, line: 100, baseType: !472)
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !468, line: 28, baseType: !34, size: 32, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!474 = !DIEnumerator(name: "UndefinedException", value: 0)
!475 = !DIEnumerator(name: "WarningException", value: 300)
!476 = !DIEnumerator(name: "ResourceLimitWarning", value: 300)
!477 = !DIEnumerator(name: "TypeWarning", value: 305)
!478 = !DIEnumerator(name: "OptionWarning", value: 310)
!479 = !DIEnumerator(name: "DelegateWarning", value: 315)
!480 = !DIEnumerator(name: "MissingDelegateWarning", value: 320)
!481 = !DIEnumerator(name: "CorruptImageWarning", value: 325)
!482 = !DIEnumerator(name: "FileOpenWarning", value: 330)
!483 = !DIEnumerator(name: "BlobWarning", value: 335)
!484 = !DIEnumerator(name: "StreamWarning", value: 340)
!485 = !DIEnumerator(name: "CacheWarning", value: 345)
!486 = !DIEnumerator(name: "CoderWarning", value: 350)
!487 = !DIEnumerator(name: "FilterWarning", value: 352)
!488 = !DIEnumerator(name: "ModuleWarning", value: 355)
!489 = !DIEnumerator(name: "DrawWarning", value: 360)
!490 = !DIEnumerator(name: "ImageWarning", value: 365)
!491 = !DIEnumerator(name: "WandWarning", value: 370)
!492 = !DIEnumerator(name: "RandomWarning", value: 375)
!493 = !DIEnumerator(name: "XServerWarning", value: 380)
!494 = !DIEnumerator(name: "MonitorWarning", value: 385)
!495 = !DIEnumerator(name: "RegistryWarning", value: 390)
!496 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!497 = !DIEnumerator(name: "PolicyWarning", value: 399)
!498 = !DIEnumerator(name: "ErrorException", value: 400)
!499 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!500 = !DIEnumerator(name: "TypeError", value: 405)
!501 = !DIEnumerator(name: "OptionError", value: 410)
!502 = !DIEnumerator(name: "DelegateError", value: 415)
!503 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!504 = !DIEnumerator(name: "CorruptImageError", value: 425)
!505 = !DIEnumerator(name: "FileOpenError", value: 430)
!506 = !DIEnumerator(name: "BlobError", value: 435)
!507 = !DIEnumerator(name: "StreamError", value: 440)
!508 = !DIEnumerator(name: "CacheError", value: 445)
!509 = !DIEnumerator(name: "CoderError", value: 450)
!510 = !DIEnumerator(name: "FilterError", value: 452)
!511 = !DIEnumerator(name: "ModuleError", value: 455)
!512 = !DIEnumerator(name: "DrawError", value: 460)
!513 = !DIEnumerator(name: "ImageError", value: 465)
!514 = !DIEnumerator(name: "WandError", value: 470)
!515 = !DIEnumerator(name: "RandomError", value: 475)
!516 = !DIEnumerator(name: "XServerError", value: 480)
!517 = !DIEnumerator(name: "MonitorError", value: 485)
!518 = !DIEnumerator(name: "RegistryError", value: 490)
!519 = !DIEnumerator(name: "ConfigureError", value: 495)
!520 = !DIEnumerator(name: "PolicyError", value: 499)
!521 = !DIEnumerator(name: "FatalErrorException", value: 700)
!522 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!523 = !DIEnumerator(name: "TypeFatalError", value: 705)
!524 = !DIEnumerator(name: "OptionFatalError", value: 710)
!525 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!526 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!527 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!528 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!529 = !DIEnumerator(name: "BlobFatalError", value: 735)
!530 = !DIEnumerator(name: "StreamFatalError", value: 740)
!531 = !DIEnumerator(name: "CacheFatalError", value: 745)
!532 = !DIEnumerator(name: "CoderFatalError", value: 750)
!533 = !DIEnumerator(name: "FilterFatalError", value: 752)
!534 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!535 = !DIEnumerator(name: "DrawFatalError", value: 760)
!536 = !DIEnumerator(name: "ImageFatalError", value: 765)
!537 = !DIEnumerator(name: "WandFatalError", value: 770)
!538 = !DIEnumerator(name: "RandomFatalError", value: 775)
!539 = !DIEnumerator(name: "XServerFatalError", value: 780)
!540 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!541 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!542 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!543 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !467, file: !468, line: 108, baseType: !545, size: 32, offset: 32)
!545 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !467, file: !468, line: 111, baseType: !213, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !467, file: !468, line: 112, baseType: !213, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !467, file: !468, line: 115, baseType: !204, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !467, file: !468, line: 118, baseType: !152, size: 32, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !467, file: !468, line: 121, baseType: !551, size: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !553, line: 26, baseType: !554)
!553 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !553, line: 25, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !467, file: !468, line: 124, baseType: !55, size: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !61, file: !62, line: 288, baseType: !152, size: 32, offset: 103808)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !61, file: !62, line: 291, baseType: !558, size: 64, offset: 103872)
!558 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !218)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !61, file: !62, line: 294, baseType: !551, size: 64, offset: 103936)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !61, file: !62, line: 297, baseType: !561, size: 256, offset: 104000)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !195, line: 40, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !195, line: 27, size: 256, elements: !563)
!563 = !{!564, !565, !566, !569}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !195, line: 30, baseType: !213, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !562, file: !195, line: 33, baseType: !55, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !562, file: !195, line: 36, baseType: !567, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !562, file: !195, line: 39, baseType: !55, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !61, file: !62, line: 298, baseType: !561, size: 256, offset: 104256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !61, file: !62, line: 299, baseType: !572, size: 64, offset: 104512)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !61, file: !62, line: 302, baseType: !55, size: 64, offset: 104576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !61, file: !62, line: 305, baseType: !55, size: 64, offset: 104640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !61, file: !62, line: 308, baseType: !396, size: 64, offset: 104704)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !61, file: !62, line: 309, baseType: !396, size: 64, offset: 104768)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !62, line: 310, baseType: !396, size: 64, offset: 104832)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !61, file: !62, line: 313, baseType: !579, size: 32, offset: 104896)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !165, line: 47, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !165, line: 31, baseType: !34, size: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!582 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!583 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!584 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!585 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!586 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!587 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!588 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!589 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!590 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!591 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!592 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!593 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!594 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!595 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !61, file: !62, line: 316, baseType: !152, size: 32, offset: 104928)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !61, file: !62, line: 319, baseType: !164, size: 64, offset: 104960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !61, file: !62, line: 322, baseType: !396, size: 64, offset: 105024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !61, file: !62, line: 325, baseType: !226, size: 256, offset: 105088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !61, file: !62, line: 328, baseType: !204, size: 64, offset: 105344)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !61, file: !62, line: 329, baseType: !204, size: 64, offset: 105408)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !61, file: !62, line: 332, baseType: !603, size: 32, offset: 105472)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !62, line: 61, baseType: !604)
!604 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 47, baseType: !34, size: 32, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!606 = !DIEnumerator(name: "UndefinedType", value: 0)
!607 = !DIEnumerator(name: "BilevelType", value: 1)
!608 = !DIEnumerator(name: "GrayscaleType", value: 2)
!609 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!610 = !DIEnumerator(name: "PaletteType", value: 4)
!611 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!612 = !DIEnumerator(name: "TrueColorType", value: 6)
!613 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!614 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!615 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!616 = !DIEnumerator(name: "OptimizeType", value: 10)
!617 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !61, file: !62, line: 335, baseType: !152, size: 32, offset: 105504)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !61, file: !62, line: 338, baseType: !444, size: 64, offset: 105536)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !61, file: !62, line: 341, baseType: !152, size: 32, offset: 105600)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !61, file: !62, line: 344, baseType: !55, size: 64, offset: 105664)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !61, file: !62, line: 347, baseType: !623, size: 64, offset: 105728)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !624, line: 7, baseType: !625)
!624 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !221, line: 160, baseType: !222)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !61, file: !62, line: 350, baseType: !627, size: 32, offset: 105792)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !165, line: 79, baseType: !628)
!628 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !165, line: 67, baseType: !34, size: 32, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!630 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!631 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!632 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!633 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!634 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!635 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!636 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!637 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!638 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!639 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !61, file: !62, line: 353, baseType: !55, size: 64, offset: 105856)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !646, retainedTypes: !802, globals: !834, splitDebugInlining: false, nameTableKind: None)
!645 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/resize.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r", checksumkind: CSK_MD5, checksum: "37b1b6791e8c15b40533e81b15218703")
!646 = !{!33, !66, !74, !113, !140, !153, !196, !207, !242, !278, !291, !298, !315, !388, !426, !472, !580, !604, !628, !647, !672, !747, !775, !790}
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !648, line: 34, baseType: !34, size: 32, elements: !649)
!648 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!650 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!651 = !DIEnumerator(name: "NoEvents", value: 0)
!652 = !DIEnumerator(name: "TraceEvent", value: 1)
!653 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!654 = !DIEnumerator(name: "BlobEvent", value: 4)
!655 = !DIEnumerator(name: "CacheEvent", value: 8)
!656 = !DIEnumerator(name: "CoderEvent", value: 16)
!657 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!658 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!659 = !DIEnumerator(name: "DrawEvent", value: 128)
!660 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!661 = !DIEnumerator(name: "ImageEvent", value: 512)
!662 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!663 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!664 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!665 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!666 = !DIEnumerator(name: "TransformEvent", value: 16384)
!667 = !DIEnumerator(name: "UserEvent", value: 36864)
!668 = !DIEnumerator(name: "WandEvent", value: 65536)
!669 = !DIEnumerator(name: "X11Event", value: 131072)
!670 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!671 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 25, baseType: !545, size: 32, elements: !674)
!673 = !DIFile(filename: "apps/538.imagick_r/src/magick/option.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "07bebb19d66188c5f61071b3cbeac6e1")
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!675 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!676 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!677 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!678 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!679 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!680 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!681 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!682 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!683 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!684 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!685 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!686 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!687 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!688 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!689 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!690 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!691 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!692 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!693 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!694 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!695 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!696 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!697 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!698 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!699 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!700 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!701 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!702 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!703 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!704 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!705 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!706 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!707 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!708 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!709 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!710 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!711 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!712 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!713 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!714 = !DIEnumerator(name: "MagickListOptions", value: 38)
!715 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!716 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!717 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!718 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!719 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!720 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!721 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!722 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!723 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!724 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!725 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!726 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!727 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!728 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!729 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!730 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!731 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!732 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!733 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!734 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!735 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!736 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!737 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!738 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!739 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!740 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!741 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!742 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!743 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!744 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!745 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!746 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!747 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 25, baseType: !34, size: 32, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!749 = !DIEnumerator(name: "NoValue", value: 0)
!750 = !DIEnumerator(name: "XValue", value: 1)
!751 = !DIEnumerator(name: "XiValue", value: 1)
!752 = !DIEnumerator(name: "YValue", value: 2)
!753 = !DIEnumerator(name: "PsiValue", value: 2)
!754 = !DIEnumerator(name: "WidthValue", value: 4)
!755 = !DIEnumerator(name: "RhoValue", value: 4)
!756 = !DIEnumerator(name: "HeightValue", value: 8)
!757 = !DIEnumerator(name: "SigmaValue", value: 8)
!758 = !DIEnumerator(name: "ChiValue", value: 16)
!759 = !DIEnumerator(name: "XiNegative", value: 32)
!760 = !DIEnumerator(name: "XNegative", value: 32)
!761 = !DIEnumerator(name: "PsiNegative", value: 64)
!762 = !DIEnumerator(name: "YNegative", value: 64)
!763 = !DIEnumerator(name: "ChiNegative", value: 128)
!764 = !DIEnumerator(name: "PercentValue", value: 4096)
!765 = !DIEnumerator(name: "AspectValue", value: 8192)
!766 = !DIEnumerator(name: "NormalizeValue", value: 8192)
!767 = !DIEnumerator(name: "LessValue", value: 16384)
!768 = !DIEnumerator(name: "GreaterValue", value: 32768)
!769 = !DIEnumerator(name: "MinimumValue", value: 65536)
!770 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536)
!771 = !DIEnumerator(name: "AreaValue", value: 131072)
!772 = !DIEnumerator(name: "DecimalValue", value: 262144)
!773 = !DIEnumerator(name: "SeparatorValue", value: 524288)
!774 = !DIEnumerator(name: "AllValues", value: 2147483647)
!775 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 30, baseType: !34, size: 32, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!777 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!778 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!779 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!780 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!781 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!782 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!783 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!784 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!785 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!786 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!787 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!788 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!789 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !791, line: 25, baseType: !34, size: 32, elements: !792)
!791 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!792 = !{!793, !794, !795, !796, !797, !798, !799, !800, !801}
!793 = !DIEnumerator(name: "UndefinedResource", value: 0)
!794 = !DIEnumerator(name: "AreaResource", value: 1)
!795 = !DIEnumerator(name: "DiskResource", value: 2)
!796 = !DIEnumerator(name: "FileResource", value: 3)
!797 = !DIEnumerator(name: "MapResource", value: 4)
!798 = !DIEnumerator(name: "MemoryResource", value: 5)
!799 = !DIEnumerator(name: "ThreadResource", value: 6)
!800 = !DIEnumerator(name: "TimeResource", value: 7)
!801 = !DIEnumerator(name: "ThrottleResource", value: 8)
!802 = !{!57, !6, !204, !545, !438, !240, !15, !803, !218, !222, !178, !804, !805, !163, !433, !806, !808, !55, !444, !213, !811, !812, !810, !813, !169, !441, !827, !828}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !165, line: 129, baseType: !169)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !165, line: 127, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !165, line: 104, size: 448, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !815, file: !165, line: 107, baseType: !65, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !815, file: !165, line: 110, baseType: !72, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !815, file: !165, line: 113, baseType: !152, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !815, file: !165, line: 116, baseType: !178, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !815, file: !165, line: 119, baseType: !55, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !815, file: !165, line: 122, baseType: !15, size: 32, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !815, file: !165, line: 123, baseType: !15, size: 32, offset: 288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !815, file: !165, line: 124, baseType: !15, size: 32, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !815, file: !165, line: 125, baseType: !15, size: 32, offset: 352)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !815, file: !165, line: 126, baseType: !15, size: 32, offset: 384)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContributionInfo", file: !3, line: 2394, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ContributionInfo", file: !3, line: 2387, size: 128, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !830, file: !3, line: 2390, baseType: !15, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !830, file: !3, line: 2393, baseType: !218, size: 64, offset: 64)
!834 = !{!0, !835, !849, !854, !868, !870, !881, !883, !891}
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "filters", scope: !2, file: !3, line: 821, type: !837, isLocal: true, isDefinition: true)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 11904, elements: !847)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !3, line: 810, size: 384, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !839, file: !3, line: 813, baseType: !12, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "support", scope: !839, file: !3, line: 816, baseType: !178, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !839, file: !3, line: 817, baseType: !178, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !839, file: !3, line: 819, baseType: !178, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !839, file: !3, line: 819, baseType: !178, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "weightingFunctionType", scope: !839, file: !3, line: 820, baseType: !31, size: 32, offset: 320)
!847 = !{!848}
!848 = !DISubrange(count: 31)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "jinc_zeros", scope: !2, file: !3, line: 876, type: !851, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 1024, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 16)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "Pone", scope: !856, file: !3, line: 1337, type: !864, isLocal: true, isDefinition: true)
!856 = distinct !DISubprogram(name: "J1", scope: !3, file: !3, line: 1327, type: !857, scopeLine: 1328, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !644, retainedNodes: !859)
!857 = !DISubroutineType(types: !858)
!858 = !{!15, !15}
!859 = !{!860, !861, !862, !863}
!860 = !DILocalVariable(name: "x", arg: 1, scope: !856, file: !3, line: 1327, type: !15)
!861 = !DILocalVariable(name: "p", scope: !856, file: !3, line: 1330, type: !15)
!862 = !DILocalVariable(name: "q", scope: !856, file: !3, line: 1331, type: !15)
!863 = !DILocalVariable(name: "i", scope: !856, file: !3, line: 1334, type: !218)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 576, elements: !866)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!866 = !{!867}
!867 = !DISubrange(count: 9)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "Qone", scope: !856, file: !3, line: 1349, type: !864, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "Pone", scope: !872, file: !3, line: 1383, type: !878, isLocal: true, isDefinition: true)
!872 = distinct !DISubprogram(name: "P1", scope: !3, file: !3, line: 1373, type: !857, scopeLine: 1374, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !644, retainedNodes: !873)
!873 = !{!874, !875, !876, !877}
!874 = !DILocalVariable(name: "x", arg: 1, scope: !872, file: !3, line: 1373, type: !15)
!875 = !DILocalVariable(name: "p", scope: !872, file: !3, line: 1376, type: !15)
!876 = !DILocalVariable(name: "q", scope: !872, file: !3, line: 1377, type: !15)
!877 = !DILocalVariable(name: "i", scope: !872, file: !3, line: 1380, type: !218)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 384, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 6)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "Qone", scope: !872, file: !3, line: 1392, type: !878, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "Pone", scope: !885, file: !3, line: 1423, type: !878, isLocal: true, isDefinition: true)
!885 = distinct !DISubprogram(name: "Q1", scope: !3, file: !3, line: 1413, type: !857, scopeLine: 1414, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !644, retainedNodes: !886)
!886 = !{!887, !888, !889, !890}
!887 = !DILocalVariable(name: "x", arg: 1, scope: !885, file: !3, line: 1413, type: !15)
!888 = !DILocalVariable(name: "p", scope: !885, file: !3, line: 1416, type: !15)
!889 = !DILocalVariable(name: "q", scope: !885, file: !3, line: 1417, type: !15)
!890 = !DILocalVariable(name: "i", scope: !885, file: !3, line: 1420, type: !218)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "Qone", scope: !885, file: !3, line: 1432, type: !878, isLocal: true, isDefinition: true)
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !909, !910, !913, !917, !920, !924, !927}
!894 = !DILocalVariable(name: "image", arg: 1, scope: !2, file: !3, line: 728, type: !58)
!895 = !DILocalVariable(name: "filter", arg: 2, scope: !2, file: !3, line: 729, type: !641)
!896 = !DILocalVariable(name: "blur", arg: 3, scope: !2, file: !3, line: 729, type: !18)
!897 = !DILocalVariable(name: "cylindrical", arg: 4, scope: !2, file: !3, line: 730, type: !642)
!898 = !DILocalVariable(name: "exception", arg: 5, scope: !2, file: !3, line: 730, type: !643)
!899 = !DILocalVariable(name: "artifact", scope: !2, file: !3, line: 733, type: !438)
!900 = !DILocalVariable(name: "filter_type", scope: !2, file: !3, line: 736, type: !240)
!901 = !DILocalVariable(name: "window_type", scope: !2, file: !3, line: 737, type: !240)
!902 = !DILocalVariable(name: "B", scope: !2, file: !3, line: 740, type: !15)
!903 = !DILocalVariable(name: "C", scope: !2, file: !3, line: 741, type: !15)
!904 = !DILocalVariable(name: "value", scope: !2, file: !3, line: 742, type: !15)
!905 = !DILocalVariable(name: "resize_filter", scope: !2, file: !3, line: 745, type: !6)
!906 = !DILocalVariable(name: "message", scope: !907, file: !3, line: 909, type: !213)
!907 = distinct !DILexicalBlock(scope: !908, file: !3, line: 909, column: 5)
!908 = distinct !DILexicalBlock(scope: !2, file: !3, line: 908, column: 7)
!909 = !DILocalVariable(name: "exception", scope: !907, file: !3, line: 909, type: !466)
!910 = !DILocalVariable(name: "option", scope: !911, file: !3, line: 927, type: !218)
!911 = distinct !DILexicalBlock(scope: !912, file: !3, line: 925, column: 5)
!912 = distinct !DILexicalBlock(scope: !2, file: !3, line: 924, column: 7)
!913 = !DILocalVariable(name: "option", scope: !914, file: !3, line: 951, type: !218)
!914 = distinct !DILexicalBlock(scope: !915, file: !3, line: 949, column: 9)
!915 = distinct !DILexicalBlock(scope: !916, file: !3, line: 948, column: 11)
!916 = distinct !DILexicalBlock(scope: !912, file: !3, line: 945, column: 5)
!917 = !DILocalVariable(name: "lobes", scope: !918, file: !3, line: 1050, type: !218)
!918 = distinct !DILexicalBlock(scope: !919, file: !3, line: 1048, column: 5)
!919 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1047, column: 7)
!920 = !DILocalVariable(name: "twoB", scope: !921, file: !3, line: 1133, type: !865)
!921 = distinct !DILexicalBlock(scope: !922, file: !3, line: 1132, column: 7)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 1105, column: 5)
!923 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1103, column: 7)
!924 = !DILocalVariable(name: "support", scope: !925, file: !3, line: 1155, type: !178)
!925 = distinct !DILexicalBlock(scope: !926, file: !3, line: 1153, column: 7)
!926 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1152, column: 9)
!927 = !DILocalVariable(name: "x", scope: !925, file: !3, line: 1156, type: !178)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 1984, elements: !847)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !3, line: 760, size: 64, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !930, file: !3, line: 763, baseType: !240, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !930, file: !3, line: 764, baseType: !240, size: 32, offset: 32)
!934 = !{i32 7, !"Dwarf Version", i32 5}
!935 = !{i32 2, !"Debug Info Version", i32 3}
!936 = !{i32 1, !"wchar_size", i32 4}
!937 = !{i32 7, !"PIC Level", i32 2}
!938 = !{i32 7, !"PIE Level", i32 2}
!939 = !{i32 7, !"uwtable", i32 2}
!940 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!941 = !DILocation(line: 0, scope: !2)
!942 = !DILocation(line: 901, column: 14, scope: !943)
!943 = distinct !DILexicalBlock(scope: !2, file: !3, line: 901, column: 7)
!944 = !{!945, !946, i64 12976}
!945 = !{!"_Image", !946, i64 0, !946, i64 4, !946, i64 8, !948, i64 16, !946, i64 24, !946, i64 28, !946, i64 32, !948, i64 40, !948, i64 48, !948, i64 56, !948, i64 64, !949, i64 72, !950, i64 80, !950, i64 88, !950, i64 96, !952, i64 104, !953, i64 112, !946, i64 208, !949, i64 216, !946, i64 224, !949, i64 232, !949, i64 240, !949, i64 248, !948, i64 256, !952, i64 264, !952, i64 272, !955, i64 280, !955, i64 312, !955, i64 344, !952, i64 376, !952, i64 384, !952, i64 392, !946, i64 400, !946, i64 404, !946, i64 408, !946, i64 412, !946, i64 416, !946, i64 420, !949, i64 424, !948, i64 432, !948, i64 440, !948, i64 448, !948, i64 456, !948, i64 464, !948, i64 472, !956, i64 480, !957, i64 504, !949, i64 568, !949, i64 576, !949, i64 584, !949, i64 592, !949, i64 600, !949, i64 608, !946, i64 616, !946, i64 4712, !946, i64 8808, !948, i64 12904, !948, i64 12912, !959, i64 12920, !946, i64 12976, !948, i64 12984, !949, i64 12992, !961, i64 13000, !961, i64 13032, !949, i64 13064, !948, i64 13072, !948, i64 13080, !949, i64 13088, !949, i64 13096, !949, i64 13104, !946, i64 13112, !946, i64 13116, !950, i64 13120, !949, i64 13128, !955, i64 13136, !949, i64 13168, !949, i64 13176, !946, i64 13184, !946, i64 13188, !962, i64 13192, !946, i64 13200, !948, i64 13208, !948, i64 13216, !946, i64 13224, !948, i64 13232}
!946 = !{!"omnipotent char", !947, i64 0}
!947 = !{!"Simple C/C++ TBAA"}
!948 = !{!"long", !946, i64 0}
!949 = !{!"any pointer", !946, i64 0}
!950 = !{!"_PixelPacket", !951, i64 0, !951, i64 2, !951, i64 4, !951, i64 6}
!951 = !{!"short", !946, i64 0}
!952 = !{!"double", !946, i64 0}
!953 = !{!"_ChromaticityInfo", !954, i64 0, !954, i64 24, !954, i64 48, !954, i64 72}
!954 = !{!"_PrimaryInfo", !952, i64 0, !952, i64 8, !952, i64 16}
!955 = !{!"_RectangleInfo", !948, i64 0, !948, i64 8, !948, i64 16, !948, i64 24}
!956 = !{!"_ErrorInfo", !952, i64 0, !952, i64 8, !952, i64 16}
!957 = !{!"_TimerInfo", !958, i64 0, !958, i64 24, !946, i64 48, !948, i64 56}
!958 = !{!"_Timer", !952, i64 0, !952, i64 8, !952, i64 16}
!959 = !{!"_ExceptionInfo", !946, i64 0, !960, i64 4, !949, i64 8, !949, i64 16, !949, i64 24, !946, i64 32, !949, i64 40, !948, i64 48}
!960 = !{!"int", !946, i64 0}
!961 = !{!"_ProfileInfo", !949, i64 0, !948, i64 8, !949, i64 16, !948, i64 24}
!962 = !{!"long long", !946, i64 0}
!963 = !DILocation(line: 901, column: 20, scope: !943)
!964 = !DILocation(line: 901, column: 7, scope: !2)
!965 = !DILocation(line: 902, column: 68, scope: !943)
!966 = !DILocation(line: 902, column: 12, scope: !943)
!967 = !DILocation(line: 902, column: 5, scope: !943)
!968 = !DILocation(line: 906, column: 34, scope: !2)
!969 = !DILocation(line: 908, column: 21, scope: !908)
!970 = !DILocation(line: 908, column: 7, scope: !2)
!971 = !DILocation(line: 909, column: 5, scope: !907)
!972 = !{!960, !960, i64 0}
!973 = !DILocation(line: 0, scope: !907)
!974 = !DILocation(line: 910, column: 10, scope: !2)
!975 = !DILocation(line: 914, column: 15, scope: !2)
!976 = !DILocation(line: 914, column: 31, scope: !2)
!977 = !{!978, !946, i64 0}
!978 = !{!"", !946, i64 0, !946, i64 4}
!979 = !DILocation(line: 915, column: 31, scope: !2)
!980 = !{!978, !946, i64 4}
!981 = !DILocation(line: 916, column: 18, scope: !2)
!982 = !DILocation(line: 916, column: 23, scope: !2)
!983 = !{!984, !985, i64 28}
!984 = !{!"_ResizeFilter", !949, i64 0, !949, i64 8, !985, i64 16, !985, i64 20, !985, i64 24, !985, i64 28, !946, i64 32, !946, i64 60, !946, i64 64, !948, i64 72}
!985 = !{!"float", !946, i64 0}
!986 = !DILocation(line: 918, column: 19, scope: !987)
!987 = distinct !DILexicalBlock(scope: !2, file: !3, line: 918, column: 7)
!988 = !DILocation(line: 918, column: 34, scope: !987)
!989 = !DILocation(line: 923, column: 12, scope: !2)
!990 = !DILocation(line: 924, column: 16, scope: !912)
!991 = !DILocation(line: 924, column: 7, scope: !2)
!992 = !DILocation(line: 929, column: 14, scope: !911)
!993 = !DILocation(line: 0, scope: !911)
!994 = !DILocation(line: 930, column: 38, scope: !995)
!995 = distinct !DILexicalBlock(scope: !911, file: !3, line: 930, column: 11)
!996 = !DILocation(line: 936, column: 16, scope: !911)
!997 = !DILocation(line: 937, column: 20, scope: !998)
!998 = distinct !DILexicalBlock(scope: !911, file: !3, line: 937, column: 11)
!999 = !DILocation(line: 937, column: 11, scope: !911)
!1000 = !DILocation(line: 939, column: 18, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !998, file: !3, line: 938, column: 9)
!1002 = !DILocation(line: 940, column: 42, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 940, column: 15)
!1004 = !DILocation(line: 947, column: 16, scope: !916)
!1005 = !DILocation(line: 948, column: 20, scope: !915)
!1006 = !DILocation(line: 948, column: 11, scope: !916)
!1007 = !DILocation(line: 953, column: 18, scope: !914)
!1008 = !DILocation(line: 0, scope: !914)
!1009 = !DILocation(line: 954, column: 42, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !914, file: !3, line: 954, column: 15)
!1011 = !DILocation(line: 956, column: 27, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 955, column: 13)
!1013 = !DILocation(line: 958, column: 27, scope: !1012)
!1014 = !DILocation(line: 959, column: 13, scope: !1012)
!1015 = !DILocation(line: 964, column: 25, scope: !2)
!1016 = !DILocation(line: 964, column: 46, scope: !2)
!1017 = !{!1018, !949, i64 0}
!1018 = !{!"", !949, i64 0, !952, i64 8, !952, i64 16, !952, i64 24, !952, i64 32, !946, i64 40}
!1019 = !DILocation(line: 964, column: 24, scope: !2)
!1020 = !{!984, !949, i64 0}
!1021 = !DILocation(line: 965, column: 47, scope: !2)
!1022 = !{!1018, !952, i64 8}
!1023 = !DILocation(line: 965, column: 26, scope: !2)
!1024 = !DILocation(line: 965, column: 18, scope: !2)
!1025 = !DILocation(line: 965, column: 25, scope: !2)
!1026 = !{!984, !985, i64 16}
!1027 = !DILocation(line: 966, column: 59, scope: !2)
!1028 = !{!1018, !946, i64 40}
!1029 = !DILocation(line: 966, column: 18, scope: !2)
!1030 = !DILocation(line: 966, column: 37, scope: !2)
!1031 = !{!984, !946, i64 60}
!1032 = !DILocation(line: 967, column: 25, scope: !2)
!1033 = !DILocation(line: 967, column: 46, scope: !2)
!1034 = !DILocation(line: 967, column: 18, scope: !2)
!1035 = !DILocation(line: 967, column: 24, scope: !2)
!1036 = !{!984, !949, i64 8}
!1037 = !DILocation(line: 968, column: 59, scope: !2)
!1038 = !DILocation(line: 968, column: 18, scope: !2)
!1039 = !DILocation(line: 968, column: 37, scope: !2)
!1040 = !{!984, !946, i64 64}
!1041 = !DILocation(line: 969, column: 45, scope: !2)
!1042 = !{!1018, !952, i64 16}
!1043 = !DILocation(line: 969, column: 24, scope: !2)
!1044 = !DILocation(line: 969, column: 18, scope: !2)
!1045 = !DILocation(line: 969, column: 23, scope: !2)
!1046 = !{!984, !985, i64 24}
!1047 = !DILocation(line: 970, column: 18, scope: !2)
!1048 = !DILocation(line: 970, column: 27, scope: !2)
!1049 = !{!984, !948, i64 72}
!1050 = !DILocation(line: 973, column: 7, scope: !2)
!1051 = !DILocation(line: 974, column: 5, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !2, file: !3, line: 973, column: 7)
!1053 = !DILocation(line: 978, column: 31, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 975, column: 5)
!1055 = !DILocation(line: 994, column: 3, scope: !2)
!1056 = !DILocation(line: 985, column: 30, scope: !1054)
!1057 = !DILocation(line: 986, column: 30, scope: !1054)
!1058 = !DILocation(line: 987, column: 29, scope: !1054)
!1059 = !DILocation(line: 989, column: 9, scope: !1054)
!1060 = !DILocation(line: 997, column: 27, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !2, file: !3, line: 995, column: 3)
!1062 = !DILocation(line: 998, column: 7, scope: !1061)
!1063 = !DILocation(line: 1000, column: 27, scope: !1061)
!1064 = !DILocation(line: 1001, column: 7, scope: !1061)
!1065 = !DILocation(line: 1012, column: 23, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1012, column: 7)
!1067 = !DILocation(line: 1012, column: 30, scope: !1066)
!1068 = !DILocation(line: 1012, column: 43, scope: !1066)
!1069 = !DILocation(line: 1015, column: 14, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 1013, column: 45)
!1071 = !DILocation(line: 1016, column: 18, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 1016, column: 9)
!1073 = !DILocation(line: 1016, column: 9, scope: !1070)
!1074 = !DILocalVariable(name: "string", arg: 1, scope: !1075, file: !1076, line: 42, type: !1079)
!1075 = distinct !DISubprogram(name: "StringToDouble", scope: !1076, file: !1076, line: 42, type: !1077, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !644, retainedNodes: !1081)
!1076 = !DIFile(filename: "apps/538.imagick_r/src/magick/string-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "af275f9a9b26a4e8bc1a481724207dee")
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!178, !1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !438)
!1080 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !803)
!1081 = !{!1074, !1082}
!1082 = !DILocalVariable(name: "sentinal", arg: 2, scope: !1075, file: !1076, line: 43, type: !1080)
!1083 = !DILocation(line: 0, scope: !1075, inlinedAt: !1084)
!1084 = distinct !DILocation(line: 1017, column: 13, scope: !1072)
!1085 = !DILocation(line: 45, column: 10, scope: !1075, inlinedAt: !1084)
!1086 = !DILocation(line: 1017, column: 13, scope: !1072)
!1087 = !DILocation(line: 1017, column: 7, scope: !1072)
!1088 = !DILocation(line: 0, scope: !1070)
!1089 = !DILocation(line: 1019, column: 20, scope: !1070)
!1090 = !DILocation(line: 1019, column: 34, scope: !1070)
!1091 = !{!985, !985, i64 0}
!1092 = !DILocation(line: 1020, column: 61, scope: !1070)
!1093 = !DILocation(line: 1020, column: 60, scope: !1070)
!1094 = !DILocation(line: 1020, column: 66, scope: !1070)
!1095 = !DILocalVariable(name: "x", arg: 1, scope: !1096, file: !1097, line: 78, type: !865)
!1096 = distinct !DISubprogram(name: "PerceptibleReciprocal", scope: !1097, file: !1097, line: 78, type: !1098, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !644, retainedNodes: !1100)
!1097 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d0543784df06457407bc99b9890f8aaf")
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!178, !865}
!1100 = !{!1095, !1101}
!1101 = !DILocalVariable(name: "sign", scope: !1096, file: !1097, line: 81, type: !178)
!1102 = !DILocation(line: 0, scope: !1096, inlinedAt: !1103)
!1103 = distinct !DILocation(line: 1020, column: 35, scope: !1070)
!1104 = !DILocation(line: 86, column: 10, scope: !1096, inlinedAt: !1103)
!1105 = !DILocation(line: 86, column: 8, scope: !1096, inlinedAt: !1103)
!1106 = !DILocation(line: 87, column: 12, scope: !1107, inlinedAt: !1103)
!1107 = distinct !DILexicalBlock(scope: !1096, file: !1097, line: 87, column: 7)
!1108 = !DILocation(line: 87, column: 16, scope: !1107, inlinedAt: !1103)
!1109 = !DILocation(line: 87, column: 7, scope: !1096, inlinedAt: !1103)
!1110 = !DILocation(line: 88, column: 15, scope: !1107, inlinedAt: !1103)
!1111 = !DILocation(line: 88, column: 5, scope: !1107, inlinedAt: !1103)
!1112 = !DILocation(line: 89, column: 14, scope: !1096, inlinedAt: !1103)
!1113 = !DILocation(line: 89, column: 3, scope: !1096, inlinedAt: !1103)
!1114 = !DILocation(line: 1020, column: 35, scope: !1070)
!1115 = !DILocation(line: 1020, column: 5, scope: !1070)
!1116 = !DILocation(line: 1020, column: 34, scope: !1070)
!1117 = !DILocation(line: 1021, column: 66, scope: !1070)
!1118 = !DILocation(line: 1021, column: 72, scope: !1070)
!1119 = !DILocation(line: 0, scope: !1096, inlinedAt: !1120)
!1120 = distinct !DILocation(line: 1021, column: 35, scope: !1070)
!1121 = !DILocation(line: 86, column: 10, scope: !1096, inlinedAt: !1120)
!1122 = !DILocation(line: 86, column: 8, scope: !1096, inlinedAt: !1120)
!1123 = !DILocation(line: 87, column: 12, scope: !1107, inlinedAt: !1120)
!1124 = !DILocation(line: 87, column: 16, scope: !1107, inlinedAt: !1120)
!1125 = !DILocation(line: 87, column: 7, scope: !1096, inlinedAt: !1120)
!1126 = !DILocation(line: 88, column: 15, scope: !1107, inlinedAt: !1120)
!1127 = !DILocation(line: 88, column: 5, scope: !1107, inlinedAt: !1120)
!1128 = !DILocation(line: 89, column: 14, scope: !1096, inlinedAt: !1120)
!1129 = !DILocation(line: 89, column: 3, scope: !1096, inlinedAt: !1120)
!1130 = !DILocation(line: 1021, column: 35, scope: !1070)
!1131 = !DILocation(line: 1021, column: 5, scope: !1070)
!1132 = !DILocation(line: 1021, column: 34, scope: !1070)
!1133 = !DILocation(line: 1023, column: 16, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 1023, column: 10)
!1135 = !DILocation(line: 1023, column: 10, scope: !1070)
!1136 = !DILocation(line: 1024, column: 30, scope: !1134)
!1137 = !DILocation(line: 1024, column: 7, scope: !1134)
!1138 = !DILocation(line: 1028, column: 23, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1028, column: 7)
!1140 = !DILocation(line: 1028, column: 30, scope: !1139)
!1141 = !DILocation(line: 1028, column: 41, scope: !1139)
!1142 = !DILocation(line: 1029, column: 23, scope: !1139)
!1143 = !DILocation(line: 1029, column: 30, scope: !1139)
!1144 = !DILocation(line: 1028, column: 7, scope: !2)
!1145 = !DILocation(line: 1031, column: 14, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1139, file: !3, line: 1029, column: 43)
!1147 = !DILocation(line: 1032, column: 18, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 1032, column: 9)
!1149 = !DILocation(line: 1032, column: 9, scope: !1146)
!1150 = !DILocation(line: 0, scope: !1075, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 1033, column: 13, scope: !1148)
!1152 = !DILocation(line: 45, column: 10, scope: !1075, inlinedAt: !1151)
!1153 = !DILocation(line: 1033, column: 13, scope: !1148)
!1154 = !DILocation(line: 1033, column: 7, scope: !1148)
!1155 = !DILocation(line: 0, scope: !1146)
!1156 = !DILocation(line: 1034, column: 14, scope: !1146)
!1157 = !DILocation(line: 1035, column: 18, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 1035, column: 9)
!1159 = !DILocation(line: 1035, column: 9, scope: !1146)
!1160 = !DILocation(line: 0, scope: !1075, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 1036, column: 13, scope: !1158)
!1162 = !DILocation(line: 45, column: 10, scope: !1075, inlinedAt: !1161)
!1163 = !DILocation(line: 1036, column: 13, scope: !1158)
!1164 = !DILocation(line: 1036, column: 7, scope: !1158)
!1165 = !DILocation(line: 1037, column: 14, scope: !1146)
!1166 = !DILocation(line: 1038, column: 18, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 1038, column: 9)
!1168 = !DILocation(line: 1038, column: 9, scope: !1146)
!1169 = !DILocation(line: 0, scope: !1075, inlinedAt: !1170)
!1170 = distinct !DILocation(line: 1039, column: 31, scope: !1167)
!1171 = !DILocation(line: 45, column: 10, scope: !1075, inlinedAt: !1170)
!1172 = !DILocation(line: 1039, column: 70, scope: !1167)
!1173 = !DILocation(line: 1039, column: 13, scope: !1167)
!1174 = !DILocation(line: 1039, column: 7, scope: !1167)
!1175 = !DILocation(line: 1041, column: 20, scope: !1146)
!1176 = !DILocation(line: 1041, column: 34, scope: !1146)
!1177 = !DILocalVariable(name: "x", arg: 1, scope: !1178, file: !3, line: 1302, type: !15)
!1178 = distinct !DISubprogram(name: "I0", scope: !3, file: !3, line: 1302, type: !857, scopeLine: 1303, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !644, retainedNodes: !1179)
!1179 = !{!1177, !1180, !1181, !1182, !1183}
!1180 = !DILocalVariable(name: "sum", scope: !1178, file: !3, line: 1305, type: !15)
!1181 = !DILocalVariable(name: "t", scope: !1178, file: !3, line: 1306, type: !15)
!1182 = !DILocalVariable(name: "y", scope: !1178, file: !3, line: 1307, type: !15)
!1183 = !DILocalVariable(name: "i", scope: !1178, file: !3, line: 1310, type: !218)
!1184 = !DILocation(line: 0, scope: !1178, inlinedAt: !1185)
!1185 = distinct !DILocation(line: 1042, column: 57, scope: !1146)
!1186 = !DILocation(line: 1316, column: 6, scope: !1178, inlinedAt: !1185)
!1187 = !DILocation(line: 1316, column: 5, scope: !1178, inlinedAt: !1185)
!1188 = !DILocation(line: 1318, column: 13, scope: !1189, inlinedAt: !1185)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 1318, column: 3)
!1190 = distinct !DILexicalBlock(scope: !1178, file: !3, line: 1318, column: 3)
!1191 = !DILocation(line: 1318, column: 15, scope: !1189, inlinedAt: !1185)
!1192 = !DILocation(line: 1318, column: 3, scope: !1190, inlinedAt: !1185)
!1193 = !DILocation(line: 1320, column: 8, scope: !1194, inlinedAt: !1185)
!1194 = distinct !DILexicalBlock(scope: !1189, file: !3, line: 1319, column: 3)
!1195 = !DILocation(line: 1321, column: 11, scope: !1194, inlinedAt: !1185)
!1196 = !DILocation(line: 1321, column: 29, scope: !1194, inlinedAt: !1185)
!1197 = !DILocation(line: 1321, column: 9, scope: !1194, inlinedAt: !1185)
!1198 = !DILocation(line: 1321, column: 6, scope: !1194, inlinedAt: !1185)
!1199 = !DILocation(line: 1318, column: 33, scope: !1189, inlinedAt: !1185)
!1200 = distinct !{!1200, !1192, !1201, !1202, !1203}
!1201 = !DILocation(line: 1322, column: 3, scope: !1190, inlinedAt: !1185)
!1202 = !{!"llvm.loop.mustprogress"}
!1203 = !{!"llvm.loop.unroll.disable"}
!1204 = !DILocation(line: 1042, column: 57, scope: !1146)
!1205 = !DILocation(line: 0, scope: !1096, inlinedAt: !1206)
!1206 = distinct !DILocation(line: 1042, column: 35, scope: !1146)
!1207 = !DILocation(line: 86, column: 10, scope: !1096, inlinedAt: !1206)
!1208 = !DILocation(line: 86, column: 8, scope: !1096, inlinedAt: !1206)
!1209 = !DILocation(line: 87, column: 12, scope: !1107, inlinedAt: !1206)
!1210 = !DILocation(line: 87, column: 16, scope: !1107, inlinedAt: !1206)
!1211 = !DILocation(line: 87, column: 7, scope: !1096, inlinedAt: !1206)
!1212 = !DILocation(line: 88, column: 15, scope: !1107, inlinedAt: !1206)
!1213 = !DILocation(line: 88, column: 5, scope: !1107, inlinedAt: !1206)
