; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r/llvm-ir/544.nab_r_bc/src/reslib.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/reslib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.atom_t = type { ptr, ptr, i32, i32, [8 x i32], ptr, double, double, double, double, ptr, i32, double, double, i32, i32, ptr, [3 x double], double }
%struct.chiral_t = type { [4 x i32], double }
%struct.reslib_t = type { ptr, ptr, i32, i32, ptr }
%struct.residue_t = type { ptr, i32, i32, i32, ptr, ptr, i32, i32, i32, ptr, ptr, i32, ptr, i32, ptr, i32, ptr, ptr }
%struct.strand_t = type { ptr, i32, i32, ptr, ptr, i32, i32, ptr }
%struct.molecule_t = type { [4 x [3 x double]], i32, ptr, i32, i32, i32, ptr }

@stderr = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [34 x i8] c"getreslibkind: unknown reslib %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"UNDEF\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"dna\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"rna\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"aa\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c"DNA\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"RNA\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "e_msg", scope: !2, file: !225, line: 46, type: !267, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !234, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/reslib.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r", checksumkind: CSK_MD5, checksum: "6864938ec9772f963babcd4caaf1fcf9")
!4 = !{!5, !6, !192, !219, !174, !181, !220, !46, !161, !221, !223, !97}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !8, line: 82, baseType: !9)
!8 = !DIFile(filename: "apps/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e6947e1b068a9350a45ab4ee56d7a2de")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !8, line: 63, size: 1024, elements: !10)
!10 = !{!11, !13, !16, !17, !18, !22, !23, !24, !25, !26, !162, !172, !173, !179, !180, !189, !190, !191}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !9, file: !8, line: 64, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !9, file: !8, line: 65, baseType: !14, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !8, line: 6, baseType: !15)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !9, file: !8, line: 66, baseType: !14, size: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !9, file: !8, line: 67, baseType: !14, size: 32, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !9, file: !8, line: 68, baseType: !19, size: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !8, line: 17, baseType: !21)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !9, file: !8, line: 69, baseType: !19, size: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !9, file: !8, line: 70, baseType: !14, size: 32, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !9, file: !8, line: 71, baseType: !14, size: 32, offset: 352)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !9, file: !8, line: 72, baseType: !14, size: 32, offset: 384)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !9, file: !8, line: 73, baseType: !27, size: 64, offset: 448)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !8, line: 84, size: 384, elements: !29)
!29 = !{!30, !31, !32, !33, !157, !158, !159, !160}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !28, file: !8, line: 85, baseType: !19, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !28, file: !8, line: 86, baseType: !14, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !28, file: !8, line: 87, baseType: !14, size: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !28, file: !8, line: 88, baseType: !34, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !8, line: 118, size: 1088, elements: !36)
!36 = !{!37, !44, !45, !48, !49, !50, !51}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !35, file: !8, line: 119, baseType: !38, size: 768)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !8, line: 13, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 768, elements: !41)
!40 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!41 = !{!42, !43}
!42 = !DISubrange(count: 4)
!43 = !DISubrange(count: 3)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !35, file: !8, line: 120, baseType: !14, size: 32, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !35, file: !8, line: 121, baseType: !46, size: 64, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !8, line: 93, baseType: !28)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !35, file: !8, line: 122, baseType: !14, size: 32, offset: 896)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !35, file: !8, line: 123, baseType: !14, size: 32, offset: 928)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !35, file: !8, line: 124, baseType: !14, size: 32, offset: 960)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !35, file: !8, line: 125, baseType: !52, size: 64, offset: 1024)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !8, line: 115, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !8, line: 95, size: 5760, elements: !55)
!55 = !{!56, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !116, !117, !118, !119, !120, !121, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !54, file: !8, line: 96, baseType: !57, size: 648)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 648, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 81)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !54, file: !8, line: 97, baseType: !14, size: 32, offset: 672)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !54, file: !8, line: 97, baseType: !14, size: 32, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !54, file: !8, line: 97, baseType: !14, size: 32, offset: 736)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !54, file: !8, line: 98, baseType: !14, size: 32, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !54, file: !8, line: 98, baseType: !14, size: 32, offset: 800)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !54, file: !8, line: 98, baseType: !14, size: 32, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !54, file: !8, line: 98, baseType: !14, size: 32, offset: 864)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !54, file: !8, line: 98, baseType: !14, size: 32, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !54, file: !8, line: 98, baseType: !14, size: 32, offset: 928)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !54, file: !8, line: 99, baseType: !14, size: 32, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !54, file: !8, line: 99, baseType: !14, size: 32, offset: 992)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !54, file: !8, line: 99, baseType: !14, size: 32, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !54, file: !8, line: 99, baseType: !14, size: 32, offset: 1056)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !54, file: !8, line: 99, baseType: !14, size: 32, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !54, file: !8, line: 99, baseType: !14, size: 32, offset: 1120)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !54, file: !8, line: 100, baseType: !14, size: 32, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !54, file: !8, line: 100, baseType: !14, size: 32, offset: 1184)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !54, file: !8, line: 100, baseType: !14, size: 32, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !54, file: !8, line: 100, baseType: !14, size: 32, offset: 1248)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !54, file: !8, line: 100, baseType: !14, size: 32, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !54, file: !8, line: 100, baseType: !14, size: 32, offset: 1312)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !54, file: !8, line: 101, baseType: !14, size: 32, offset: 1344)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !54, file: !8, line: 101, baseType: !14, size: 32, offset: 1376)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !54, file: !8, line: 101, baseType: !14, size: 32, offset: 1408)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !54, file: !8, line: 101, baseType: !14, size: 32, offset: 1440)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !54, file: !8, line: 101, baseType: !14, size: 32, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !54, file: !8, line: 101, baseType: !14, size: 32, offset: 1504)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !54, file: !8, line: 101, baseType: !14, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !54, file: !8, line: 101, baseType: !14, size: 32, offset: 1568)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !54, file: !8, line: 102, baseType: !14, size: 32, offset: 1600)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !54, file: !8, line: 102, baseType: !14, size: 32, offset: 1632)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !54, file: !8, line: 102, baseType: !14, size: 32, offset: 1664)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !54, file: !8, line: 103, baseType: !19, size: 64, offset: 1728)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !54, file: !8, line: 103, baseType: !19, size: 64, offset: 1792)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !54, file: !8, line: 103, baseType: !19, size: 64, offset: 1856)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !54, file: !8, line: 103, baseType: !19, size: 64, offset: 1920)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !54, file: !8, line: 104, baseType: !97, size: 64, offset: 1984)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !54, file: !8, line: 104, baseType: !97, size: 64, offset: 2048)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !54, file: !8, line: 104, baseType: !97, size: 64, offset: 2112)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !54, file: !8, line: 104, baseType: !97, size: 64, offset: 2176)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !54, file: !8, line: 104, baseType: !97, size: 64, offset: 2240)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !54, file: !8, line: 104, baseType: !97, size: 64, offset: 2304)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !54, file: !8, line: 104, baseType: !97, size: 64, offset: 2368)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !54, file: !8, line: 104, baseType: !97, size: 64, offset: 2432)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !54, file: !8, line: 104, baseType: !97, size: 64, offset: 2496)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !54, file: !8, line: 105, baseType: !97, size: 64, offset: 2560)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !54, file: !8, line: 105, baseType: !97, size: 64, offset: 2624)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !54, file: !8, line: 105, baseType: !97, size: 64, offset: 2688)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !54, file: !8, line: 105, baseType: !97, size: 64, offset: 2752)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !54, file: !8, line: 105, baseType: !97, size: 64, offset: 2816)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !54, file: !8, line: 105, baseType: !97, size: 64, offset: 2880)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !54, file: !8, line: 105, baseType: !97, size: 64, offset: 2944)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !54, file: !8, line: 106, baseType: !114, size: 192, offset: 3008)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !115)
!115 = !{!43}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !54, file: !8, line: 106, baseType: !40, size: 64, offset: 3200)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !54, file: !8, line: 106, baseType: !40, size: 64, offset: 3264)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !54, file: !8, line: 106, baseType: !40, size: 64, offset: 3328)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !54, file: !8, line: 106, baseType: !40, size: 64, offset: 3392)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !54, file: !8, line: 106, baseType: !40, size: 64, offset: 3456)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !54, file: !8, line: 107, baseType: !122, size: 64, offset: 3520)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !54, file: !8, line: 107, baseType: !122, size: 64, offset: 3584)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !54, file: !8, line: 107, baseType: !122, size: 64, offset: 3648)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !54, file: !8, line: 107, baseType: !122, size: 64, offset: 3712)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !54, file: !8, line: 107, baseType: !122, size: 64, offset: 3776)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !54, file: !8, line: 107, baseType: !122, size: 64, offset: 3840)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !54, file: !8, line: 108, baseType: !122, size: 64, offset: 3904)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !54, file: !8, line: 108, baseType: !122, size: 64, offset: 3968)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !54, file: !8, line: 108, baseType: !122, size: 64, offset: 4032)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !54, file: !8, line: 108, baseType: !122, size: 64, offset: 4096)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !54, file: !8, line: 108, baseType: !122, size: 64, offset: 4160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !54, file: !8, line: 108, baseType: !122, size: 64, offset: 4224)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !54, file: !8, line: 109, baseType: !122, size: 64, offset: 4288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !54, file: !8, line: 109, baseType: !122, size: 64, offset: 4352)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !54, file: !8, line: 109, baseType: !122, size: 64, offset: 4416)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !54, file: !8, line: 109, baseType: !122, size: 64, offset: 4480)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !54, file: !8, line: 109, baseType: !122, size: 64, offset: 4544)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !54, file: !8, line: 110, baseType: !122, size: 64, offset: 4608)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !54, file: !8, line: 110, baseType: !122, size: 64, offset: 4672)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !54, file: !8, line: 110, baseType: !122, size: 64, offset: 4736)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !54, file: !8, line: 110, baseType: !122, size: 64, offset: 4800)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !54, file: !8, line: 110, baseType: !122, size: 64, offset: 4864)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !54, file: !8, line: 111, baseType: !122, size: 64, offset: 4928)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !54, file: !8, line: 111, baseType: !122, size: 64, offset: 4992)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !54, file: !8, line: 111, baseType: !122, size: 64, offset: 5056)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !54, file: !8, line: 111, baseType: !122, size: 64, offset: 5120)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !54, file: !8, line: 111, baseType: !122, size: 64, offset: 5184)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !54, file: !8, line: 111, baseType: !122, size: 64, offset: 5248)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !54, file: !8, line: 112, baseType: !122, size: 64, offset: 5312)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !54, file: !8, line: 112, baseType: !122, size: 64, offset: 5376)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !54, file: !8, line: 112, baseType: !122, size: 64, offset: 5440)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !54, file: !8, line: 112, baseType: !122, size: 64, offset: 5504)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !54, file: !8, line: 113, baseType: !122, size: 64, offset: 5568)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !54, file: !8, line: 113, baseType: !122, size: 64, offset: 5632)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !54, file: !8, line: 114, baseType: !97, size: 64, offset: 5696)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !28, file: !8, line: 89, baseType: !27, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !28, file: !8, line: 90, baseType: !14, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !28, file: !8, line: 91, baseType: !14, size: 32, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !28, file: !8, line: 92, baseType: !161, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !9, file: !8, line: 74, baseType: !163, size: 64, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !8, line: 52, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !8, line: 47, size: 192, elements: !166)
!166 = !{!167, !169, !170, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !165, file: !8, line: 48, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !165, file: !8, line: 49, baseType: !14, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !165, file: !8, line: 50, baseType: !14, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !165, file: !8, line: 51, baseType: !14, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !9, file: !8, line: 75, baseType: !14, size: 32, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !9, file: !8, line: 76, baseType: !174, size: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !8, line: 54, baseType: !176)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 64, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 2)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !9, file: !8, line: 77, baseType: !14, size: 32, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !9, file: !8, line: 78, baseType: !181, size: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !8, line: 61, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !8, line: 58, size: 192, elements: !184)
!184 = !{!185, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !183, file: !8, line: 59, baseType: !186, size: 128)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !187)
!187 = !{!42}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !183, file: !8, line: 60, baseType: !40, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !9, file: !8, line: 79, baseType: !14, size: 32, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !9, file: !8, line: 80, baseType: !122, size: 64, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !9, file: !8, line: 81, baseType: !192, size: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !8, line: 45, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !8, line: 25, size: 1408, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !218}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !194, file: !8, line: 26, baseType: !19, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !194, file: !8, line: 27, baseType: !19, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !194, file: !8, line: 28, baseType: !14, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !194, file: !8, line: 29, baseType: !14, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !194, file: !8, line: 30, baseType: !201, size: 256, offset: 192)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !194, file: !8, line: 31, baseType: !12, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !194, file: !8, line: 32, baseType: !40, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !194, file: !8, line: 33, baseType: !40, size: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !194, file: !8, line: 34, baseType: !40, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !194, file: !8, line: 35, baseType: !40, size: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !194, file: !8, line: 36, baseType: !19, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !194, file: !8, line: 37, baseType: !14, size: 32, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !194, file: !8, line: 38, baseType: !40, size: 64, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !194, file: !8, line: 39, baseType: !40, size: 64, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !194, file: !8, line: 40, baseType: !14, size: 32, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !194, file: !8, line: 41, baseType: !14, size: 32, offset: 1056)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !194, file: !8, line: 42, baseType: !19, size: 64, offset: 1088)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !194, file: !8, line: 43, baseType: !217, size: 192, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !8, line: 12, baseType: !114)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !194, file: !8, line: 44, baseType: !40, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !8, line: 126, baseType: !35)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESLIB_T", file: !225, line: 26, baseType: !226)
!225 = !DIFile(filename: "apps/544.nab_r/src/reslib.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "6864938ec9772f963babcd4caaf1fcf9")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reslib_t", file: !225, line: 20, size: 256, elements: !227)
!227 = !{!228, !230, !231, !232, !233}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rl_next", scope: !226, file: !225, line: 21, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "rl_name", scope: !226, file: !225, line: 22, baseType: !220, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "rl_r_kind", scope: !226, file: !225, line: 23, baseType: !15, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "rl_r_atomkind", scope: !226, file: !225, line: 24, baseType: !15, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "rl_rlist", scope: !226, file: !225, line: 25, baseType: !6, size: 64, offset: 192)
!234 = !{!0, !235, !237, !245, !250, !252, !255, !257, !260, !262}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "reslibs", scope: !2, file: !225, line: 44, type: !223, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "init", scope: !239, file: !225, line: 474, type: !15, isLocal: true, isDefinition: true)
!239 = distinct !DISubprogram(name: "initatoms", scope: !225, file: !225, line: 472, type: !240, scopeLine: 473, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{null}
!242 = !{!243, !244}
!243 = !DILocalVariable(name: "i", scope: !239, file: !225, line: 475, type: !15)
!244 = !DILocalVariable(name: "ap", scope: !239, file: !225, line: 476, type: !192)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "atoms", scope: !2, file: !225, line: 34, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 1408000, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 1000)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "n_atoms", scope: !2, file: !225, line: 33, type: !15, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "lr_name", scope: !2, file: !225, line: 32, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 64, elements: !202)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "n_bonds", scope: !2, file: !225, line: 37, type: !15, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "bonds", scope: !2, file: !225, line: 38, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 64000, elements: !248)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "n_chi", scope: !2, file: !225, line: 41, type: !15, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "chi", scope: !2, file: !225, line: 42, type: !264, isLocal: true, isDefinition: true)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 96000, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 500)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 256)
!270 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!271 = !{i32 7, !"Dwarf Version", i32 5}
!272 = !{i32 2, !"Debug Info Version", i32 3}
!273 = !{i32 1, !"wchar_size", i32 4}
!274 = !{i32 7, !"PIC Level", i32 2}
!275 = !{i32 7, !"PIE Level", i32 2}
!276 = !{i32 7, !"uwtable", i32 2}
!277 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!278 = distinct !DISubprogram(name: "getreslibkind", scope: !225, file: !225, line: 78, type: !279, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !281)
!279 = !DISubroutineType(types: !280)
!280 = !{!220, !220}
!281 = !{!282, !283, !284}
!282 = !DILocalVariable(name: "reslib", arg: 1, scope: !278, file: !225, line: 78, type: !220)
!283 = !DILocalVariable(name: "nhp", scope: !278, file: !225, line: 80, type: !220)
!284 = !DILocalVariable(name: "rlp", scope: !278, file: !225, line: 81, type: !223)
!285 = !DILocation(line: 0, scope: !278)
!286 = !DILocation(line: 80, column: 8, scope: !278)
!287 = !DILocalVariable(name: "reslib", arg: 1, scope: !288, file: !225, line: 422, type: !220)
!288 = distinct !DISubprogram(name: "known_reslib", scope: !225, file: !225, line: 422, type: !289, scopeLine: 423, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !291)
!289 = !DISubroutineType(types: !290)
!290 = !{!223, !220}
!291 = !{!287, !292}
!292 = !DILocalVariable(name: "rlp", scope: !288, file: !225, line: 424, type: !223)
!293 = !DILocation(line: 0, scope: !288, inlinedAt: !294)
!294 = distinct !DILocation(line: 83, column: 14, scope: !295)
!295 = distinct !DILexicalBlock(scope: !278, file: !225, line: 83, column: 6)
!296 = !DILocation(line: 426, column: 7, scope: !297, inlinedAt: !294)
!297 = distinct !DILexicalBlock(scope: !288, file: !225, line: 426, column: 2)
!298 = !DILocation(line: 0, scope: !297, inlinedAt: !294)
!299 = !{!300, !300, i64 0}
!300 = !{!"any pointer", !301, i64 0}
!301 = !{!"omnipotent char", !302, i64 0}
!302 = !{!"Simple C/C++ TBAA"}
!303 = !DILocation(line: 426, column: 2, scope: !297, inlinedAt: !294)
!304 = !DILocation(line: 427, column: 20, scope: !305, inlinedAt: !294)
!305 = distinct !DILexicalBlock(scope: !306, file: !225, line: 427, column: 7)
!306 = distinct !DILexicalBlock(scope: !307, file: !225, line: 426, column: 47)
!307 = distinct !DILexicalBlock(scope: !297, file: !225, line: 426, column: 2)
!308 = !{!309, !300, i64 8}
!309 = !{!"reslib_t", !300, i64 0, !300, i64 8, !310, i64 16, !310, i64 20, !300, i64 24}
!310 = !{!"int", !301, i64 0}
!311 = !DILocation(line: 427, column: 7, scope: !305, inlinedAt: !294)
!312 = !DILocation(line: 427, column: 38, scope: !305, inlinedAt: !294)
!313 = !DILocation(line: 427, column: 7, scope: !306, inlinedAt: !294)
!314 = distinct !{!314, !303, !315, !316, !317}
!315 = !DILocation(line: 430, column: 2, scope: !297, inlinedAt: !294)
!316 = !{!"llvm.loop.mustprogress"}
!317 = !{!"llvm.loop.unroll.disable"}
!318 = !DILocation(line: 84, column: 15, scope: !319)
!319 = distinct !DILexicalBlock(scope: !320, file: !225, line: 84, column: 7)
!320 = distinct !DILexicalBlock(scope: !295, file: !225, line: 83, column: 48)
!321 = !DILocation(line: 84, column: 39, scope: !319)
!322 = !DILocation(line: 84, column: 7, scope: !320)
!323 = !DILocation(line: 85, column: 13, scope: !324)
!324 = distinct !DILexicalBlock(scope: !319, file: !225, line: 84, column: 48)
!325 = !DILocation(line: 85, column: 4, scope: !324)
!326 = !DILocation(line: 87, column: 4, scope: !324)
!327 = !DILocation(line: 0, scope: !295)
!328 = !DILocation(line: 90, column: 11, scope: !329)
!329 = distinct !DILexicalBlock(scope: !278, file: !225, line: 90, column: 6)
!330 = !{!309, !310, i64 16}
!331 = !DILocation(line: 90, column: 6, scope: !278)
!332 = !DILocation(line: 0, scope: !329)
!333 = !DILocation(line: 101, column: 1, scope: !278)
!334 = distinct !DISubprogram(name: "read_reslib", scope: !225, file: !225, line: 434, type: !289, scopeLine: 435, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !335)
!335 = !{!336, !337, !397, !398, !399, !400, !401}
!336 = !DILocalVariable(name: "reslib", arg: 1, scope: !334, file: !225, line: 434, type: !220)
!337 = !DILocalVariable(name: "pfp", scope: !334, file: !225, line: 436, type: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !340, line: 7, baseType: !341)
!340 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !342, line: 49, size: 1728, elements: !343)
!342 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !359, !361, !362, !363, !367, !369, !371, !375, !378, !380, !383, !386, !387, !388, !392, !393}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !341, file: !342, line: 51, baseType: !15, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !341, file: !342, line: 54, baseType: !220, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !341, file: !342, line: 55, baseType: !220, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !341, file: !342, line: 56, baseType: !220, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !341, file: !342, line: 57, baseType: !220, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !341, file: !342, line: 58, baseType: !220, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !341, file: !342, line: 59, baseType: !220, size: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !341, file: !342, line: 60, baseType: !220, size: 64, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !341, file: !342, line: 61, baseType: !220, size: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !341, file: !342, line: 64, baseType: !220, size: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !341, file: !342, line: 65, baseType: !220, size: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !341, file: !342, line: 66, baseType: !220, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !341, file: !342, line: 68, baseType: !357, size: 64, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !342, line: 36, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !341, file: !342, line: 70, baseType: !360, size: 64, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !341, file: !342, line: 72, baseType: !15, size: 32, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !341, file: !342, line: 73, baseType: !15, size: 32, offset: 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !341, file: !342, line: 74, baseType: !364, size: 64, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !365, line: 152, baseType: !366)
!365 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!366 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !341, file: !342, line: 77, baseType: !368, size: 16, offset: 1024)
!368 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !341, file: !342, line: 78, baseType: !370, size: 8, offset: 1040)
!370 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !341, file: !342, line: 79, baseType: !372, size: 8, offset: 1048)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 1)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !341, file: !342, line: 81, baseType: !376, size: 64, offset: 1088)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !342, line: 43, baseType: null)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !341, file: !342, line: 89, baseType: !379, size: 64, offset: 1152)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !365, line: 153, baseType: !366)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !341, file: !342, line: 91, baseType: !381, size: 64, offset: 1216)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !342, line: 37, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !341, file: !342, line: 92, baseType: !384, size: 64, offset: 1280)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !342, line: 38, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !341, file: !342, line: 93, baseType: !360, size: 64, offset: 1344)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !341, file: !342, line: 94, baseType: !5, size: 64, offset: 1408)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !341, file: !342, line: 95, baseType: !389, size: 64, offset: 1472)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !390, line: 46, baseType: !391)
!390 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!391 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !341, file: !342, line: 96, baseType: !15, size: 32, offset: 1536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !341, file: !342, line: 98, baseType: !394, size: 160, offset: 1568)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 20)
!397 = !DILocalVariable(name: "bfp", scope: !334, file: !225, line: 437, type: !338)
!398 = !DILocalVariable(name: "qfp", scope: !334, file: !225, line: 438, type: !338)
!399 = !DILocalVariable(name: "cfp", scope: !334, file: !225, line: 439, type: !338)
!400 = !DILocalVariable(name: "rlp", scope: !334, file: !225, line: 440, type: !223)
!401 = !DILocalVariable(name: "offname", scope: !334, file: !225, line: 441, type: !267)
!402 = !DILocation(line: 0, scope: !334)
!403 = !DILocation(line: 441, column: 2, scope: !334)
!404 = !DILocation(line: 441, column: 7, scope: !334)
!405 = !DILocalVariable(name: "reslib", arg: 1, scope: !406, file: !225, line: 492, type: !220)
!406 = distinct !DISubprogram(name: "read_reslib_header", scope: !225, file: !225, line: 492, type: !407, scopeLine: 494, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!407 = !DISubroutineType(types: !408)
!408 = !{!223, !220, !409, !409, !409, !409, !220}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!410 = !{!405, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !425, !426, !430, !431, !432}
!411 = !DILocalVariable(name: "pfp", arg: 2, scope: !406, file: !225, line: 493, type: !409)
!412 = !DILocalVariable(name: "bfp", arg: 3, scope: !406, file: !225, line: 493, type: !409)
!413 = !DILocalVariable(name: "qfp", arg: 4, scope: !406, file: !225, line: 493, type: !409)
!414 = !DILocalVariable(name: "cfp", arg: 5, scope: !406, file: !225, line: 493, type: !409)
!415 = !DILocalVariable(name: "offname", arg: 6, scope: !406, file: !225, line: 493, type: !220)
!416 = !DILocalVariable(name: "rfp", scope: !406, file: !225, line: 495, type: !338)
!417 = !DILocalVariable(name: "rlp", scope: !406, file: !225, line: 496, type: !223)
!418 = !DILocalVariable(name: "nw", scope: !406, file: !225, line: 497, type: !15)
!419 = !DILocalVariable(name: "nsize", scope: !406, file: !225, line: 497, type: !15)
!420 = !DILocalVariable(name: "np", scope: !406, file: !225, line: 498, type: !220)
!421 = !DILocalVariable(name: "line", scope: !406, file: !225, line: 499, type: !422)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1024, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 128)
!425 = !DILocalVariable(name: "keyword", scope: !406, file: !225, line: 499, type: !394)
!426 = !DILocalVariable(name: "value", scope: !406, file: !225, line: 499, type: !427)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 800, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 100)
!430 = !DILocalVariable(name: "newname", scope: !406, file: !225, line: 499, type: !427)
!431 = !DILocalVariable(name: "fname", scope: !406, file: !225, line: 500, type: !267)
!432 = !DILabel(scope: !406, name: "clean_up", file: !225, line: 621)
!433 = !DILocation(line: 0, scope: !406, inlinedAt: !434)
!434 = distinct !DILocation(line: 443, column: 14, scope: !435)
!435 = distinct !DILexicalBlock(scope: !334, file: !225, line: 443, column: 6)
!436 = !DILocation(line: 499, column: 2, scope: !406, inlinedAt: !434)
!437 = !DILocation(line: 499, column: 7, scope: !406, inlinedAt: !434)
!438 = !DILocation(line: 499, column: 20, scope: !406, inlinedAt: !434)
!439 = !DILocation(line: 499, column: 35, scope: !406, inlinedAt: !434)
!440 = !DILocation(line: 499, column: 49, scope: !406, inlinedAt: !434)
!441 = !DILocation(line: 500, column: 2, scope: !406, inlinedAt: !434)
!442 = !DILocation(line: 500, column: 7, scope: !406, inlinedAt: !434)
!443 = !DILocation(line: 502, column: 6, scope: !444, inlinedAt: !434)
!444 = distinct !DILexicalBlock(scope: !406, file: !225, line: 502, column: 6)
!445 = !DILocation(line: 502, column: 31, scope: !444, inlinedAt: !434)
!446 = !DILocation(line: 502, column: 6, scope: !406, inlinedAt: !434)
!447 = !DILocation(line: 503, column: 3, scope: !448, inlinedAt: !434)
!448 = distinct !DILexicalBlock(scope: !444, file: !225, line: 502, column: 40)
!449 = !DILocalVariable(name: "sname", arg: 1, scope: !450, file: !225, line: 637, type: !220)
!450 = distinct !DISubprogram(name: "mk_fname", scope: !225, file: !225, line: 637, type: !451, scopeLine: 638, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !453)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !220, !220}
!453 = !{!449, !454}
!454 = !DILocalVariable(name: "fname", arg: 2, scope: !450, file: !225, line: 637, type: !220)
!455 = !DILocation(line: 0, scope: !450, inlinedAt: !456)
!456 = distinct !DILocation(line: 504, column: 3, scope: !448, inlinedAt: !434)
!457 = !DILocation(line: 640, column: 6, scope: !458, inlinedAt: !456)
!458 = distinct !DILexicalBlock(scope: !450, file: !225, line: 640, column: 6)
!459 = !{!301, !301, i64 0}
!460 = !DILocation(line: 640, column: 13, scope: !458, inlinedAt: !456)
!461 = !DILocation(line: 640, column: 20, scope: !458, inlinedAt: !456)
!462 = !DILocation(line: 642, column: 3, scope: !458, inlinedAt: !456)
!463 = !DILocation(line: 644, column: 3, scope: !458, inlinedAt: !456)
!464 = !DILocation(line: 505, column: 15, scope: !465, inlinedAt: !434)
!465 = distinct !DILexicalBlock(scope: !448, file: !225, line: 505, column: 7)
!466 = !DILocation(line: 505, column: 37, scope: !465, inlinedAt: !434)
!467 = !DILocation(line: 505, column: 7, scope: !448, inlinedAt: !434)
!468 = !DILocation(line: 506, column: 4, scope: !469, inlinedAt: !434)
!469 = distinct !DILexicalBlock(scope: !465, file: !225, line: 505, column: 46)
!470 = !DILocation(line: 507, column: 4, scope: !469, inlinedAt: !434)
!471 = !DILocation(line: 0, scope: !450, inlinedAt: !472)
!472 = distinct !DILocation(line: 510, column: 3, scope: !473, inlinedAt: !434)
!473 = distinct !DILexicalBlock(scope: !444, file: !225, line: 509, column: 7)
!474 = !DILocation(line: 640, column: 6, scope: !458, inlinedAt: !472)
!475 = !DILocation(line: 640, column: 13, scope: !458, inlinedAt: !472)
!476 = !DILocation(line: 640, column: 20, scope: !458, inlinedAt: !472)
!477 = !DILocation(line: 641, column: 4, scope: !458, inlinedAt: !472)
!478 = !DILocation(line: 640, column: 6, scope: !450, inlinedAt: !472)
!479 = !DILocation(line: 642, column: 3, scope: !458, inlinedAt: !472)
!480 = !DILocation(line: 644, column: 3, scope: !458, inlinedAt: !472)
!481 = !DILocation(line: 511, column: 15, scope: !482, inlinedAt: !434)
!482 = distinct !DILexicalBlock(scope: !473, file: !225, line: 511, column: 7)
!483 = !DILocation(line: 511, column: 37, scope: !482, inlinedAt: !434)
!484 = !DILocation(line: 511, column: 7, scope: !473, inlinedAt: !434)
!485 = !DILocation(line: 512, column: 4, scope: !486, inlinedAt: !434)
!486 = distinct !DILexicalBlock(scope: !482, file: !225, line: 511, column: 46)
!487 = !DILocation(line: 513, column: 4, scope: !486, inlinedAt: !434)
!488 = !DILocation(line: 0, scope: !444, inlinedAt: !434)
!489 = !DILocation(line: 517, column: 28, scope: !490, inlinedAt: !434)
!490 = distinct !DILexicalBlock(scope: !406, file: !225, line: 517, column: 6)
!491 = !DILocation(line: 517, column: 59, scope: !490, inlinedAt: !434)
!492 = !DILocation(line: 517, column: 6, scope: !406, inlinedAt: !434)
!493 = !DILocation(line: 518, column: 3, scope: !494, inlinedAt: !434)
!494 = distinct !DILexicalBlock(scope: !490, file: !225, line: 517, column: 68)
!495 = !DILocation(line: 519, column: 3, scope: !494, inlinedAt: !434)
!496 = !DILocation(line: 520, column: 3, scope: !494, inlinedAt: !434)
!497 = !DILocation(line: 523, column: 10, scope: !406, inlinedAt: !434)
!498 = !DILocation(line: 524, column: 31, scope: !499, inlinedAt: !434)
!499 = distinct !DILexicalBlock(scope: !406, file: !225, line: 524, column: 6)
!500 = !DILocation(line: 524, column: 23, scope: !499, inlinedAt: !434)
!501 = !DILocation(line: 524, column: 58, scope: !499, inlinedAt: !434)
!502 = !DILocation(line: 524, column: 6, scope: !406, inlinedAt: !434)
!503 = !DILocation(line: 525, column: 3, scope: !504, inlinedAt: !434)
!504 = distinct !DILexicalBlock(scope: !499, file: !225, line: 524, column: 67)
!505 = !DILocation(line: 526, column: 3, scope: !504, inlinedAt: !434)
!506 = !DILocation(line: 527, column: 3, scope: !504, inlinedAt: !434)
!507 = !DILocation(line: 529, column: 2, scope: !406, inlinedAt: !434)
!508 = !DILocation(line: 530, column: 17, scope: !406, inlinedAt: !434)
!509 = !DILocation(line: 530, column: 15, scope: !406, inlinedAt: !434)
!510 = !{!309, !300, i64 0}
!511 = !DILocation(line: 531, column: 10, scope: !406, inlinedAt: !434)
!512 = !DILocation(line: 532, column: 7, scope: !406, inlinedAt: !434)
!513 = !DILocation(line: 532, column: 15, scope: !406, inlinedAt: !434)
!514 = !DILocation(line: 533, column: 7, scope: !406, inlinedAt: !434)
!515 = !DILocation(line: 534, column: 7, scope: !406, inlinedAt: !434)
!516 = !DILocation(line: 534, column: 21, scope: !406, inlinedAt: !434)
!517 = !DILocation(line: 541, column: 11, scope: !406, inlinedAt: !434)
!518 = !DILocation(line: 543, column: 7, scope: !519, inlinedAt: !434)
!519 = distinct !DILexicalBlock(scope: !406, file: !225, line: 543, column: 7)
!520 = !DILocation(line: 543, column: 32, scope: !519, inlinedAt: !434)
!521 = !DILocation(line: 543, column: 7, scope: !406, inlinedAt: !434)
!522 = !DILocation(line: 544, column: 10, scope: !523, inlinedAt: !434)
!523 = distinct !DILexicalBlock(scope: !519, file: !225, line: 543, column: 41)
!524 = !DILocation(line: 544, column: 3, scope: !523, inlinedAt: !434)
!525 = !DILocation(line: 621, column: 1, scope: !406, inlinedAt: !434)
!526 = !DILocation(line: 622, column: 2, scope: !406, inlinedAt: !434)
!527 = !DILocation(line: 635, column: 1, scope: !406, inlinedAt: !434)
!528 = !DILocation(line: 443, column: 6, scope: !334)
!529 = !DILocation(line: 537, column: 7, scope: !406, inlinedAt: !434)
!530 = !DILocation(line: 538, column: 7, scope: !406, inlinedAt: !434)
!531 = !DILocation(line: 539, column: 7, scope: !406, inlinedAt: !434)
!532 = !DILocation(line: 540, column: 7, scope: !406, inlinedAt: !434)
!533 = !DILocation(line: 545, column: 8, scope: !534, inlinedAt: !434)
!534 = distinct !DILexicalBlock(scope: !535, file: !225, line: 545, column: 8)
!535 = distinct !DILexicalBlock(scope: !523, file: !225, line: 544, column: 46)
!536 = !DILocation(line: 545, column: 14, scope: !534, inlinedAt: !434)
!537 = !DILocation(line: 545, column: 8, scope: !535, inlinedAt: !434)
!538 = !DILocation(line: 547, column: 15, scope: !539, inlinedAt: !434)
!539 = distinct !DILexicalBlock(scope: !535, file: !225, line: 547, column: 8)
!540 = !DILocation(line: 547, column: 8, scope: !535, inlinedAt: !434)
!541 = !DILocation(line: 554, column: 14, scope: !542, inlinedAt: !434)
!542 = distinct !DILexicalBlock(scope: !543, file: !225, line: 554, column: 14)
!543 = distinct !DILexicalBlock(scope: !539, file: !225, line: 551, column: 14)
!544 = !DILocation(line: 554, column: 40, scope: !542, inlinedAt: !434)
!545 = !DILocation(line: 554, column: 14, scope: !543, inlinedAt: !434)
!546 = !DILocation(line: 555, column: 9, scope: !547, inlinedAt: !434)
!547 = distinct !DILexicalBlock(scope: !548, file: !225, line: 555, column: 9)
!548 = distinct !DILexicalBlock(scope: !542, file: !225, line: 554, column: 46)
!549 = !DILocation(line: 555, column: 9, scope: !548, inlinedAt: !434)
!550 = !DILocation(line: 556, column: 21, scope: !547, inlinedAt: !434)
!551 = !DILocation(line: 556, column: 6, scope: !547, inlinedAt: !434)
!552 = !DILocation(line: 558, column: 21, scope: !553, inlinedAt: !434)
!553 = distinct !DILexicalBlock(scope: !547, file: !225, line: 557, column: 14)
!554 = !DILocation(line: 558, column: 6, scope: !553, inlinedAt: !434)
!555 = !DILocation(line: 559, column: 14, scope: !556, inlinedAt: !434)
!556 = distinct !DILexicalBlock(scope: !553, file: !225, line: 559, column: 14)
!557 = !DILocation(line: 559, column: 36, scope: !556, inlinedAt: !434)
!558 = !DILocation(line: 559, column: 14, scope: !553, inlinedAt: !434)
!559 = !DILocation(line: 560, column: 21, scope: !556, inlinedAt: !434)
!560 = !DILocation(line: 565, column: 14, scope: !561, inlinedAt: !434)
!561 = distinct !DILexicalBlock(scope: !542, file: !225, line: 565, column: 14)
!562 = !DILocation(line: 565, column: 44, scope: !561, inlinedAt: !434)
!563 = !DILocation(line: 565, column: 14, scope: !542, inlinedAt: !434)
!564 = !DILocation(line: 566, column: 9, scope: !565, inlinedAt: !434)
!565 = distinct !DILexicalBlock(scope: !566, file: !225, line: 566, column: 9)
!566 = distinct !DILexicalBlock(scope: !561, file: !225, line: 565, column: 50)
!567 = !DILocation(line: 566, column: 35, scope: !565, inlinedAt: !434)
!568 = !DILocation(line: 566, column: 9, scope: !566, inlinedAt: !434)
!569 = !DILocation(line: 567, column: 25, scope: !565, inlinedAt: !434)
!570 = !{!309, !310, i64 20}
!571 = !DILocation(line: 567, column: 6, scope: !565, inlinedAt: !434)
!572 = !DILocation(line: 568, column: 14, scope: !573, inlinedAt: !434)
!573 = distinct !DILexicalBlock(scope: !565, file: !225, line: 568, column: 14)
!574 = !DILocation(line: 568, column: 14, scope: !565, inlinedAt: !434)
!575 = !DILocation(line: 569, column: 25, scope: !573, inlinedAt: !434)
!576 = !DILocation(line: 574, column: 14, scope: !577, inlinedAt: !434)
!577 = distinct !DILexicalBlock(scope: !561, file: !225, line: 574, column: 14)
!578 = !DILocation(line: 574, column: 14, scope: !561, inlinedAt: !434)
!579 = !DILocation(line: 0, scope: !450, inlinedAt: !580)
!580 = distinct !DILocation(line: 575, column: 5, scope: !581, inlinedAt: !434)
!581 = distinct !DILexicalBlock(scope: !577, file: !225, line: 574, column: 45)
!582 = !DILocation(line: 640, column: 6, scope: !458, inlinedAt: !580)
!583 = !DILocation(line: 640, column: 13, scope: !458, inlinedAt: !580)
!584 = !DILocation(line: 640, column: 20, scope: !458, inlinedAt: !580)
!585 = !DILocation(line: 642, column: 3, scope: !458, inlinedAt: !580)
!586 = !DILocation(line: 644, column: 3, scope: !458, inlinedAt: !580)
!587 = !DILocation(line: 0, scope: !450, inlinedAt: !588)
!588 = distinct !DILocation(line: 577, column: 5, scope: !589, inlinedAt: !434)
!589 = distinct !DILexicalBlock(scope: !590, file: !225, line: 576, column: 45)
!590 = distinct !DILexicalBlock(scope: !577, file: !225, line: 576, column: 14)
!591 = !DILocation(line: 640, column: 6, scope: !458, inlinedAt: !588)
!592 = !DILocation(line: 640, column: 13, scope: !458, inlinedAt: !588)
!593 = !DILocation(line: 640, column: 20, scope: !458, inlinedAt: !588)
!594 = !DILocation(line: 642, column: 3, scope: !458, inlinedAt: !588)
!595 = !DILocation(line: 644, column: 3, scope: !458, inlinedAt: !588)
!596 = !DILocation(line: 578, column: 18, scope: !597, inlinedAt: !434)
!597 = distinct !DILexicalBlock(scope: !589, file: !225, line: 578, column: 9)
!598 = !DILocation(line: 578, column: 40, scope: !597, inlinedAt: !434)
!599 = !DILocation(line: 578, column: 9, scope: !589, inlinedAt: !434)
!600 = !DILocation(line: 0, scope: !450, inlinedAt: !601)
!601 = distinct !DILocation(line: 586, column: 5, scope: !602, inlinedAt: !434)
!602 = distinct !DILexicalBlock(scope: !603, file: !225, line: 585, column: 45)
!603 = distinct !DILexicalBlock(scope: !590, file: !225, line: 585, column: 14)
!604 = !DILocation(line: 640, column: 6, scope: !458, inlinedAt: !601)
!605 = !DILocation(line: 640, column: 13, scope: !458, inlinedAt: !601)
!606 = !DILocation(line: 640, column: 20, scope: !458, inlinedAt: !601)
!607 = !DILocation(line: 642, column: 3, scope: !458, inlinedAt: !601)
!608 = !DILocation(line: 644, column: 3, scope: !458, inlinedAt: !601)
!609 = !DILocation(line: 587, column: 18, scope: !610, inlinedAt: !434)
!610 = distinct !DILexicalBlock(scope: !602, file: !225, line: 587, column: 9)
!611 = !DILocation(line: 587, column: 40, scope: !610, inlinedAt: !434)
!612 = !DILocation(line: 587, column: 9, scope: !602, inlinedAt: !434)
!613 = !DILocation(line: 594, column: 14, scope: !614, inlinedAt: !434)
!614 = distinct !DILexicalBlock(scope: !603, file: !225, line: 594, column: 14)
!615 = !DILocation(line: 594, column: 38, scope: !614, inlinedAt: !434)
!616 = !DILocation(line: 594, column: 14, scope: !603, inlinedAt: !434)
!617 = !DILocation(line: 0, scope: !450, inlinedAt: !618)
!618 = distinct !DILocation(line: 595, column: 5, scope: !619, inlinedAt: !434)
!619 = distinct !DILexicalBlock(scope: !614, file: !225, line: 594, column: 44)
!620 = !DILocation(line: 640, column: 6, scope: !458, inlinedAt: !618)
!621 = !DILocation(line: 640, column: 13, scope: !458, inlinedAt: !618)
!622 = !DILocation(line: 640, column: 20, scope: !458, inlinedAt: !618)
!623 = !DILocation(line: 642, column: 3, scope: !458, inlinedAt: !618)
!624 = !DILocation(line: 644, column: 3, scope: !458, inlinedAt: !618)
!625 = !DILocation(line: 596, column: 18, scope: !626, inlinedAt: !434)
!626 = distinct !DILexicalBlock(scope: !619, file: !225, line: 596, column: 9)
!627 = !DILocation(line: 596, column: 40, scope: !626, inlinedAt: !434)
!628 = !DILocation(line: 596, column: 9, scope: !619, inlinedAt: !434)
!629 = !DILocation(line: 603, column: 14, scope: !630, inlinedAt: !434)
!630 = distinct !DILexicalBlock(scope: !614, file: !225, line: 603, column: 14)
!631 = !DILocation(line: 603, column: 14, scope: !614, inlinedAt: !434)
!632 = !DILocation(line: 0, scope: !450, inlinedAt: !633)
!633 = distinct !DILocation(line: 604, column: 5, scope: !634, inlinedAt: !434)
!634 = distinct !DILexicalBlock(scope: !630, file: !225, line: 603, column: 45)
!635 = !DILocation(line: 640, column: 6, scope: !458, inlinedAt: !633)
!636 = !DILocation(line: 640, column: 13, scope: !458, inlinedAt: !633)
!637 = !DILocation(line: 640, column: 20, scope: !458, inlinedAt: !633)
!638 = !DILocation(line: 642, column: 3, scope: !458, inlinedAt: !633)
!639 = !DILocation(line: 644, column: 3, scope: !458, inlinedAt: !633)
!640 = !DILocation(line: 605, column: 18, scope: !641, inlinedAt: !434)
!641 = distinct !DILexicalBlock(scope: !634, file: !225, line: 605, column: 9)
!642 = !DILocation(line: 605, column: 40, scope: !641, inlinedAt: !434)
!643 = !DILocation(line: 605, column: 9, scope: !634, inlinedAt: !434)
!644 = distinct !{!644, !524, !645, !316, !317}
!645 = !DILocation(line: 616, column: 3, scope: !523, inlinedAt: !434)
!646 = !DILocation(line: 0, scope: !450, inlinedAt: !647)
!647 = distinct !DILocation(line: 618, column: 3, scope: !648, inlinedAt: !434)
!648 = distinct !DILexicalBlock(scope: !519, file: !225, line: 617, column: 7)
!649 = !DILocation(line: 640, column: 6, scope: !458, inlinedAt: !647)
!650 = !DILocation(line: 640, column: 13, scope: !458, inlinedAt: !647)
!651 = !DILocation(line: 640, column: 20, scope: !458, inlinedAt: !647)
!652 = !DILocation(line: 642, column: 3, scope: !458, inlinedAt: !647)
!653 = !DILocation(line: 644, column: 3, scope: !458, inlinedAt: !647)
!654 = !DILocation(line: 0, scope: !590, inlinedAt: !434)
!655 = !DILocation(line: 624, column: 7, scope: !656, inlinedAt: !434)
!656 = distinct !DILexicalBlock(scope: !657, file: !225, line: 624, column: 7)
!657 = distinct !DILexicalBlock(scope: !658, file: !225, line: 623, column: 19)
!658 = distinct !DILexicalBlock(scope: !406, file: !225, line: 623, column: 6)
!659 = !DILocation(line: 624, column: 7, scope: !657, inlinedAt: !434)
!660 = !DILocation(line: 624, column: 14, scope: !656, inlinedAt: !434)
!661 = !DILocation(line: 625, column: 7, scope: !662, inlinedAt: !434)
!662 = distinct !DILexicalBlock(scope: !657, file: !225, line: 625, column: 7)
!663 = !DILocation(line: 625, column: 7, scope: !657, inlinedAt: !434)
!664 = !DILocation(line: 625, column: 14, scope: !662, inlinedAt: !434)
!665 = !DILocation(line: 626, column: 7, scope: !666, inlinedAt: !434)
!666 = distinct !DILexicalBlock(scope: !657, file: !225, line: 626, column: 7)
!667 = !DILocation(line: 626, column: 7, scope: !657, inlinedAt: !434)
!668 = !DILocation(line: 626, column: 14, scope: !666, inlinedAt: !434)
!669 = !DILocation(line: 627, column: 7, scope: !670, inlinedAt: !434)
!670 = distinct !DILexicalBlock(scope: !657, file: !225, line: 627, column: 7)
!671 = !DILocation(line: 627, column: 7, scope: !657, inlinedAt: !434)
!672 = !DILocation(line: 627, column: 14, scope: !670, inlinedAt: !434)
!673 = !DILocation(line: 628, column: 11, scope: !657, inlinedAt: !434)
!674 = !DILocation(line: 629, column: 11, scope: !657, inlinedAt: !434)
!675 = !DILocation(line: 630, column: 3, scope: !657, inlinedAt: !434)
!676 = !DILocation(line: 631, column: 3, scope: !657, inlinedAt: !434)
!677 = !DILocation(line: 632, column: 2, scope: !657, inlinedAt: !434)
!678 = !DILocation(line: 478, column: 7, scope: !679, inlinedAt: !680)
!679 = distinct !DILexicalBlock(scope: !239, file: !225, line: 478, column: 6)
!680 = distinct !DILocation(line: 449, column: 2, scope: !334)
!681 = !DILocation(line: 478, column: 6, scope: !239, inlinedAt: !680)
!682 = !DILocation(line: 480, column: 7, scope: !239, inlinedAt: !680)
!683 = !DILocation(line: 0, scope: !239, inlinedAt: !680)
!684 = !DILocation(line: 481, column: 2, scope: !685, inlinedAt: !680)
!685 = distinct !DILexicalBlock(scope: !239, file: !225, line: 481, column: 2)
!686 = !DILocation(line: 482, column: 3, scope: !687, inlinedAt: !680)
!687 = distinct !DILexicalBlock(scope: !688, file: !225, line: 481, column: 51)
!688 = distinct !DILexicalBlock(scope: !685, file: !225, line: 481, column: 2)
!689 = !DILocation(line: 483, column: 30, scope: !687, inlinedAt: !680)
!690 = !DILocation(line: 483, column: 18, scope: !687, inlinedAt: !680)
!691 = !{!692, !300, i64 0}
!692 = !{!"atom_t", !300, i64 0, !300, i64 8, !310, i64 16, !310, i64 20, !301, i64 24, !300, i64 56, !693, i64 64, !693, i64 72, !693, i64 80, !693, i64 88, !300, i64 96, !310, i64 104, !693, i64 112, !693, i64 120, !310, i64 128, !310, i64 132, !300, i64 136, !301, i64 144, !693, i64 168}
!693 = !{!"double", !301, i64 0}
!694 = !DILocation(line: 484, column: 22, scope: !695, inlinedAt: !680)
!695 = distinct !DILexicalBlock(scope: !687, file: !225, line: 484, column: 7)
!696 = !DILocation(line: 484, column: 7, scope: !687, inlinedAt: !680)
!697 = !DILocation(line: 485, column: 13, scope: !698, inlinedAt: !680)
!698 = distinct !DILexicalBlock(scope: !695, file: !225, line: 484, column: 31)
!699 = !DILocation(line: 485, column: 4, scope: !698, inlinedAt: !680)
!700 = !DILocation(line: 487, column: 4, scope: !698, inlinedAt: !680)
!701 = !DILocation(line: 481, column: 41, scope: !688, inlinedAt: !680)
!702 = !DILocation(line: 481, column: 47, scope: !688, inlinedAt: !680)
!703 = !DILocation(line: 481, column: 28, scope: !688, inlinedAt: !680)
!704 = distinct !{!704, !684, !705, !316, !317}
!705 = !DILocation(line: 489, column: 2, scope: !685, inlinedAt: !680)
!706 = !DILocation(line: 450, column: 7, scope: !707)
!707 = distinct !DILexicalBlock(scope: !334, file: !225, line: 450, column: 7)
!708 = !DILocation(line: 450, column: 7, scope: !334)
!709 = !DILocalVariable(name: "offname", arg: 1, scope: !710, file: !225, line: 647, type: !220)
!710 = distinct !DISubprogram(name: "off2reslib", scope: !225, file: !225, line: 647, type: !711, scopeLine: 648, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !220, !223}
!713 = !{!709, !714, !715, !716, !717, !718, !719, !720, !746, !747, !749, !750, !751, !752, !753, !754, !755, !757, !758, !759, !760, !763, !764, !765}
!714 = !DILocalVariable(name: "rlp", arg: 2, scope: !710, file: !225, line: 647, type: !223)
!715 = !DILocalVariable(name: "ap", scope: !710, file: !225, line: 649, type: !192)
!716 = !DILocalVariable(name: "n_names", scope: !710, file: !225, line: 650, type: !15)
!717 = !DILocalVariable(name: "n_resnames", scope: !710, file: !225, line: 650, type: !15)
!718 = !DILocalVariable(name: "i", scope: !710, file: !225, line: 650, type: !15)
!719 = !DILocalVariable(name: "ires", scope: !710, file: !225, line: 650, type: !15)
!720 = !DILocalVariable(name: "db", scope: !710, file: !225, line: 651, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATABASE", file: !722, line: 84, baseType: !723)
!722 = !DIFile(filename: "apps/544.nab_r/src/database.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d8cc1ae4cf951fbe7cfd9585ec1cbb55")
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATABASEt", file: !722, line: 82, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !722, line: 65, size: 33024, elements: !726)
!726 = !{!727, !728, !729, !731, !732, !733, !737, !739, !740, !741, !743, !744, !745}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "iAccessMode", scope: !725, file: !722, line: 66, baseType: !15, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fDataBase", scope: !725, file: !722, line: 67, baseType: !338, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sFileName", scope: !725, file: !722, line: 68, baseType: !730, size: 2048, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !722, line: 48, baseType: !267)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "iOpenMode", scope: !725, file: !722, line: 69, baseType: !15, size: 32, offset: 2176)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "iPrefix", scope: !725, file: !722, line: 70, baseType: !15, size: 32, offset: 2208)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "saPrefixStack", scope: !725, file: !722, line: 71, baseType: !734, size: 20480, offset: 2240)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 20480, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 10)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bCompactFileAtClose", scope: !725, file: !722, line: 72, baseType: !738, size: 8, offset: 22720)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !722, line: 47, baseType: !21)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dEntries", scope: !725, file: !722, line: 73, baseType: !5, size: 64, offset: 22784)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "iCurrentLine", scope: !725, file: !722, line: 74, baseType: !15, size: 32, offset: 22848)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "sLookAhead", scope: !725, file: !722, line: 75, baseType: !742, size: 8000, offset: 22880)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8000, elements: !248)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "iLastSequentialOperation", scope: !725, file: !722, line: 76, baseType: !15, size: 32, offset: 30880)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sLoopPrefix", scope: !725, file: !722, line: 79, baseType: !730, size: 2048, offset: 30912)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dlEntryLoop", scope: !725, file: !722, line: 80, baseType: !15, size: 32, offset: 32960)
!746 = !DILocalVariable(name: "bresult", scope: !710, file: !225, line: 652, type: !738)
!747 = !DILocalVariable(name: "typex", scope: !710, file: !225, line: 653, type: !748)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 3200, elements: !428)
!749 = !DILocalVariable(name: "resx", scope: !710, file: !225, line: 653, type: !748)
!750 = !DILocalVariable(name: "flags", scope: !710, file: !225, line: 653, type: !748)
!751 = !DILocalVariable(name: "seq", scope: !710, file: !225, line: 654, type: !748)
!752 = !DILocalVariable(name: "elmnt", scope: !710, file: !225, line: 654, type: !748)
!753 = !DILocalVariable(name: "atom1x", scope: !710, file: !225, line: 655, type: !748)
!754 = !DILocalVariable(name: "atom2x", scope: !710, file: !225, line: 655, type: !748)
!755 = !DILocalVariable(name: "chg", scope: !710, file: !225, line: 656, type: !756)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 6400, elements: !428)
!757 = !DILocalVariable(name: "x", scope: !710, file: !225, line: 656, type: !756)
!758 = !DILocalVariable(name: "y", scope: !710, file: !225, line: 656, type: !756)
!759 = !DILocalVariable(name: "z", scope: !710, file: !225, line: 656, type: !756)
!760 = !DILocalVariable(name: "a_name", scope: !710, file: !225, line: 657, type: !761)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8000, elements: !762)
!762 = !{!429, !736}
!763 = !DILocalVariable(name: "type", scope: !710, file: !225, line: 657, type: !761)
!764 = !DILocalVariable(name: "res_name", scope: !710, file: !225, line: 657, type: !761)
!765 = !DILocalVariable(name: "prefix", scope: !710, file: !225, line: 658, type: !766)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2040, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 255)
!769 = !DILocation(line: 0, scope: !710, inlinedAt: !770)
!770 = distinct !DILocation(line: 451, column: 3, scope: !771)
!771 = distinct !DILexicalBlock(scope: !707, file: !225, line: 450, column: 17)
!772 = !DILocation(line: 650, column: 2, scope: !710, inlinedAt: !770)
!773 = !DILocation(line: 653, column: 2, scope: !710, inlinedAt: !770)
!774 = !DILocation(line: 653, column: 6, scope: !710, inlinedAt: !770)
!775 = !DILocation(line: 653, column: 20, scope: !710, inlinedAt: !770)
!776 = !DILocation(line: 653, column: 33, scope: !710, inlinedAt: !770)
!777 = !DILocation(line: 654, column: 3, scope: !710, inlinedAt: !770)
!778 = !DILocation(line: 654, column: 15, scope: !710, inlinedAt: !770)
!779 = !DILocation(line: 655, column: 2, scope: !710, inlinedAt: !770)
!780 = !DILocation(line: 655, column: 6, scope: !710, inlinedAt: !770)
!781 = !DILocation(line: 655, column: 21, scope: !710, inlinedAt: !770)
!782 = !DILocation(line: 656, column: 2, scope: !710, inlinedAt: !770)
!783 = !DILocation(line: 656, column: 9, scope: !710, inlinedAt: !770)
!784 = !DILocation(line: 656, column: 21, scope: !710, inlinedAt: !770)
!785 = !DILocation(line: 656, column: 31, scope: !710, inlinedAt: !770)
!786 = !DILocation(line: 656, column: 41, scope: !710, inlinedAt: !770)
!787 = !DILocation(line: 657, column: 2, scope: !710, inlinedAt: !770)
!788 = !DILocation(line: 657, column: 7, scope: !710, inlinedAt: !770)
!789 = !DILocation(line: 657, column: 28, scope: !710, inlinedAt: !770)
!790 = !DILocation(line: 657, column: 47, scope: !710, inlinedAt: !770)
!791 = !DILocation(line: 658, column: 2, scope: !710, inlinedAt: !770)
!792 = !DILocation(line: 658, column: 7, scope: !710, inlinedAt: !770)
!793 = !DILocation(line: 660, column: 10, scope: !710, inlinedAt: !770)
!794 = !{!310, !310, i64 0}
!795 = !DILocation(line: 661, column: 7, scope: !710, inlinedAt: !770)
!796 = !DILocation(line: 665, column: 12, scope: !710, inlinedAt: !770)
!797 = !DILocation(line: 667, column: 23, scope: !798, inlinedAt: !770)
