; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/resource.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/resource.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@resource_semaphore = internal global ptr null, align 8, !dbg !0
@resource_info.0 = internal unnamed_addr global i64 0, align 8, !dbg !352
@resource_info.1 = internal unnamed_addr global i64 0, align 8, !dbg !353
@resource_info.2 = internal unnamed_addr global i64 0, align 8, !dbg !354
@resource_info.3 = internal unnamed_addr global i64 0, align 8, !dbg !355
@resource_info.4 = internal unnamed_addr global i64 0, align 8, !dbg !356
@resource_info.7 = internal unnamed_addr global i64 0, align 8, !dbg !357
@resource_info.8 = internal unnamed_addr global i64 -1, align 8, !dbg !358
@resource_info.9 = internal unnamed_addr global i64 -1, align 8, !dbg !359
@resource_info.10 = internal unnamed_addr global i64 -1, align 8, !dbg !360
@resource_info.11 = internal unnamed_addr global i64 -1, align 8, !dbg !361
@resource_info.12 = internal unnamed_addr global i64 -1, align 8, !dbg !362

!178 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!179 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!180 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!181 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!182 = !DIEnumerator(name: "BlobFatalError", value: 735)
!183 = !DIEnumerator(name: "StreamFatalError", value: 740)
!184 = !DIEnumerator(name: "CacheFatalError", value: 745)
!185 = !DIEnumerator(name: "CoderFatalError", value: 750)
!186 = !DIEnumerator(name: "FilterFatalError", value: 752)
!187 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!188 = !DIEnumerator(name: "DrawFatalError", value: 760)
!189 = !DIEnumerator(name: "ImageFatalError", value: 765)
!190 = !DIEnumerator(name: "WandFatalError", value: 770)
!191 = !DIEnumerator(name: "RandomFatalError", value: 775)
!192 = !DIEnumerator(name: "XServerFatalError", value: 780)
!193 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!194 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!195 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!196 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 25, baseType: !7, size: 32, elements: !199)
!198 = !DIFile(filename: "apps/538.imagick_r/src/magick/registry.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fee9ec3439d50d35877b8d14c6edadfb")
!199 = !{!200, !201, !202, !203}
!200 = !DIEnumerator(name: "UndefinedRegistryType", value: 0)
!201 = !DIEnumerator(name: "ImageRegistryType", value: 1)
!202 = !DIEnumerator(name: "ImageInfoRegistryType", value: 2)
!203 = !DIEnumerator(name: "StringRegistryType", value: 3)
!204 = !{!205, !209, !210, !212, !214, !215, !220, !224, !227, !228, !229, !50, !233, !236, !238}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !207, line: 26, baseType: !208)
!207 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !207, line: 25, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !211)
!211 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !213)
!213 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!214 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !216, line: 77, baseType: !217)
!216 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !218, line: 193, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!219 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !222, line: 26, baseType: !223)
!222 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !222, line: 25, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !231, line: 31, baseType: !232)
!231 = !DIFile(filename: "apps/538.imagick_r/src/magick/random_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "95f31caf92e8a7cab5b1bf8cc3698f31")
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !231, line: 30, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!209, !209}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !241, line: 7, baseType: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !243, line: 49, size: 1728, elements: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !260, !262, !263, !264, !266, !268, !270, !274, !277, !279, !282, !285, !286, !287, !290, !291}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !242, file: !243, line: 51, baseType: !50, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !242, file: !243, line: 54, baseType: !228, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !242, file: !243, line: 55, baseType: !228, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !242, file: !243, line: 56, baseType: !228, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !242, file: !243, line: 57, baseType: !228, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !242, file: !243, line: 58, baseType: !228, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !242, file: !243, line: 59, baseType: !228, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !242, file: !243, line: 60, baseType: !228, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !242, file: !243, line: 61, baseType: !228, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !242, file: !243, line: 64, baseType: !228, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !242, file: !243, line: 65, baseType: !228, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !242, file: !243, line: 66, baseType: !228, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !242, file: !243, line: 68, baseType: !258, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !243, line: 36, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !242, file: !243, line: 70, baseType: !261, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !242, file: !243, line: 72, baseType: !50, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !242, file: !243, line: 73, baseType: !50, size: 32, offset: 928)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !242, file: !243, line: 74, baseType: !265, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !218, line: 152, baseType: !219)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !242, file: !243, line: 77, baseType: !267, size: 16, offset: 1024)
!267 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !242, file: !243, line: 78, baseType: !269, size: 8, offset: 1040)
!269 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !242, file: !243, line: 79, baseType: !271, size: 8, offset: 1048)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 8, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 1)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !242, file: !243, line: 81, baseType: !275, size: 64, offset: 1088)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !243, line: 43, baseType: null)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !242, file: !243, line: 89, baseType: !278, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !218, line: 153, baseType: !219)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !242, file: !243, line: 91, baseType: !280, size: 64, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !243, line: 37, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !242, file: !243, line: 92, baseType: !283, size: 64, offset: 1280)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !243, line: 38, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !242, file: !243, line: 93, baseType: !261, size: 64, offset: 1344)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !242, file: !243, line: 94, baseType: !209, size: 64, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !242, file: !243, line: 95, baseType: !288, size: 64, offset: 1472)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !289, line: 46, baseType: !214)
!289 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !242, file: !243, line: 96, baseType: !50, size: 32, offset: 1536)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !242, file: !243, line: 98, baseType: !292, size: 160, offset: 1568)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 160, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 20)
!295 = !{!296, !0, !327, !348, !350}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "portable_filename", scope: !298, file: !299, line: 469, type: !324, isLocal: true, isDefinition: true)
!298 = distinct !DISubprogram(name: "AcquireUniqueFileResource", scope: !299, file: !299, line: 449, type: !300, scopeLine: 450, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!299 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2a5ec17e2d02be1a700a555061de74ad")
!300 = !DISubroutineType(types: !301)
!301 = !{!50, !228}
!302 = !{!303, !304, !305, !306, !307, !308, !323}
!303 = !DILocalVariable(name: "path", arg: 1, scope: !298, file: !299, line: 449, type: !228)
!304 = !DILocalVariable(name: "c", scope: !298, file: !299, line: 459, type: !50)
!305 = !DILocalVariable(name: "file", scope: !298, file: !299, line: 460, type: !50)
!306 = !DILocalVariable(name: "p", scope: !298, file: !299, line: 463, type: !228)
!307 = !DILocalVariable(name: "i", scope: !298, file: !299, line: 466, type: !215)
!308 = !DILocalVariable(name: "key", scope: !298, file: !299, line: 473, type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !311, line: 40, baseType: !312)
!311 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !311, line: 29, size: 32960, elements: !313)
!313 = !{!314, !318, !321, !322}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !312, file: !311, line: 32, baseType: !315, size: 32768)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 32768, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 4096)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !312, file: !311, line: 35, baseType: !319, size: 64, offset: 32768)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !312, file: !311, line: 38, baseType: !288, size: 64, offset: 32832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !312, file: !311, line: 39, baseType: !288, size: 64, offset: 32896)
!323 = !DILocalVariable(name: "datum", scope: !298, file: !299, line: 476, type: !319)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 520, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 65)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "resource_info", scope: !2, file: !299, line: 100, type: !329, isLocal: true, isDefinition: true)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResourceInfo", file: !299, line: 91, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ResourceInfo", file: !299, line: 70, size: 1024, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !330, file: !299, line: 73, baseType: !210, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !330, file: !299, line: 74, baseType: !210, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !330, file: !299, line: 75, baseType: !210, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "disk", scope: !330, file: !299, line: 76, baseType: !210, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !330, file: !299, line: 77, baseType: !210, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !330, file: !299, line: 78, baseType: !210, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "throttle", scope: !330, file: !299, line: 79, baseType: !210, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !330, file: !299, line: 80, baseType: !210, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "area_limit", scope: !330, file: !299, line: 83, baseType: !212, size: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "memory_limit", scope: !330, file: !299, line: 84, baseType: !212, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "map_limit", scope: !330, file: !299, line: 85, baseType: !212, size: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "disk_limit", scope: !330, file: !299, line: 86, baseType: !212, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "file_limit", scope: !330, file: !299, line: 87, baseType: !212, size: 64, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "thread_limit", scope: !330, file: !299, line: 88, baseType: !212, size: 64, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "throttle_limit", scope: !330, file: !299, line: 89, baseType: !212, size: 64, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "time_limit", scope: !330, file: !299, line: 90, baseType: !212, size: 64, offset: 960)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "temporary_resources", scope: !2, file: !299, line: 135, type: !220, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "random_info", scope: !2, file: !299, line: 97, type: !229, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!353 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!354 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 128, 64))
!355 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 192, 64))
!356 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 256, 64))
!357 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 448, 64))
!358 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 512, 64))
!359 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 576, 64))
!360 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 640, 64))
!361 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 704, 64))
!362 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 768, 64))
!363 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 832, 64))
!364 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 896, 64))
!365 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 960, 64))
!366 = !{i32 7, !"Dwarf Version", i32 5}
!367 = !{i32 2, !"Debug Info Version", i32 3}
!368 = !{i32 1, !"wchar_size", i32 4}
!369 = !{i32 7, !"PIC Level", i32 2}
!370 = !{i32 7, !"PIE Level", i32 2}
!371 = !{i32 7, !"uwtable", i32 2}
!372 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!373 = distinct !DISubprogram(name: "AcquireMagickResource", scope: !299, file: !299, line: 164, type: !374, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !380)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !377, !379}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResourceType", file: !12, line: 36, baseType: !11)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!380 = !{!381, !382, !383, !384, !385, !386, !387}
!381 = !DILocalVariable(name: "type", arg: 1, scope: !373, file: !299, line: 164, type: !377)
!382 = !DILocalVariable(name: "size", arg: 2, scope: !373, file: !299, line: 165, type: !379)
!383 = !DILocalVariable(name: "resource_current", scope: !373, file: !299, line: 168, type: !315)
!384 = !DILocalVariable(name: "resource_limit", scope: !373, file: !299, line: 169, type: !315)
!385 = !DILocalVariable(name: "resource_request", scope: !373, file: !299, line: 170, type: !315)
!386 = !DILocalVariable(name: "status", scope: !373, file: !299, line: 173, type: !376)
!387 = !DILocalVariable(name: "limit", scope: !373, file: !299, line: 176, type: !212)
!388 = !DILocation(line: 0, scope: !373)
!389 = !DILocation(line: 167, column: 3, scope: !373)
!390 = !DILocation(line: 168, column: 5, scope: !373)
!391 = !DILocation(line: 169, column: 5, scope: !373)
!392 = !DILocation(line: 170, column: 5, scope: !373)
!393 = !DILocation(line: 179, column: 10, scope: !373)
!394 = !DILocation(line: 180, column: 7, scope: !395)
!395 = distinct !DILexicalBlock(scope: !373, file: !299, line: 180, column: 7)
!396 = !{!397, !397, i64 0}
!397 = !{!"any pointer", !398, i64 0}
!398 = !{!"omnipotent char", !399, i64 0}
!399 = !{!"Simple C/C++ TBAA"}
!400 = !DILocation(line: 180, column: 26, scope: !395)
!401 = !DILocation(line: 180, column: 7, scope: !373)
!402 = !DILocation(line: 181, column: 5, scope: !395)
!403 = !DILocation(line: 182, column: 21, scope: !373)
!404 = !DILocation(line: 182, column: 3, scope: !373)
!405 = !DILocation(line: 183, column: 3, scope: !373)
!406 = !DILocation(line: 187, column: 25, scope: !407)
!407 = distinct !DILexicalBlock(scope: !408, file: !299, line: 186, column: 5)
!408 = distinct !DILexicalBlock(scope: !373, file: !299, line: 184, column: 3)
!409 = !{!410, !411, i64 0}
!410 = !{!"_ResourceInfo", !411, i64 0, !411, i64 8, !411, i64 16, !411, i64 24, !411, i64 32, !411, i64 40, !411, i64 48, !411, i64 56, !411, i64 64, !411, i64 72, !411, i64 80, !411, i64 88, !411, i64 96, !411, i64 104, !411, i64 112, !411, i64 120}
!411 = !{!"long long", !398, i64 0}
!412 = !DILocation(line: 188, column: 27, scope: !407)
!413 = !{!410, !411, i64 64}
!414 = !DILocation(line: 189, column: 40, scope: !407)
!415 = !DILocation(line: 189, column: 67, scope: !407)
!416 = !DILocation(line: 190, column: 15, scope: !407)
!417 = !DILocation(line: 191, column: 14, scope: !407)
!418 = !DILocation(line: 195, column: 7, scope: !407)
!419 = !DILocation(line: 199, column: 27, scope: !420)
!420 = distinct !DILexicalBlock(scope: !408, file: !299, line: 198, column: 5)
!421 = !{!410, !411, i64 8}
!422 = !DILocation(line: 200, column: 27, scope: !420)
!423 = !{!410, !411, i64 72}
!424 = !DILocation(line: 201, column: 42, scope: !420)
!425 = !DILocation(line: 201, column: 69, scope: !420)
!426 = !DILocation(line: 202, column: 48, scope: !420)
!427 = !DILocation(line: 204, column: 14, scope: !420)
!428 = !DILocation(line: 208, column: 7, scope: !420)
!429 = !DILocation(line: 212, column: 24, scope: !430)
!430 = distinct !DILexicalBlock(scope: !408, file: !299, line: 211, column: 5)
!431 = !{!410, !411, i64 16}
!432 = !DILocation(line: 213, column: 27, scope: !430)
!433 = !{!410, !411, i64 80}
!434 = !DILocation(line: 214, column: 39, scope: !430)
!435 = !DILocation(line: 214, column: 66, scope: !430)
!436 = !DILocation(line: 215, column: 45, scope: !430)
!437 = !DILocation(line: 217, column: 14, scope: !430)
!438 = !DILocation(line: 221, column: 7, scope: !430)
!439 = !DILocation(line: 225, column: 25, scope: !440)
!440 = distinct !DILexicalBlock(scope: !408, file: !299, line: 224, column: 5)
!441 = !{!410, !411, i64 24}
!442 = !DILocation(line: 226, column: 27, scope: !440)
!443 = !{!410, !411, i64 88}
!444 = !DILocation(line: 227, column: 40, scope: !440)
!445 = !DILocation(line: 227, column: 67, scope: !440)
!446 = !DILocation(line: 228, column: 46, scope: !440)
!447 = !DILocation(line: 230, column: 14, scope: !440)
!448 = !DILocation(line: 234, column: 7, scope: !440)
!449 = !DILocation(line: 238, column: 25, scope: !450)
!450 = distinct !DILexicalBlock(scope: !408, file: !299, line: 237, column: 5)
!451 = !{!410, !411, i64 32}
!452 = !DILocation(line: 239, column: 27, scope: !450)
!453 = !{!410, !411, i64 96}
!454 = !DILocation(line: 240, column: 40, scope: !450)
!455 = !DILocation(line: 240, column: 67, scope: !450)
!456 = !DILocation(line: 241, column: 46, scope: !450)
!457 = !DILocation(line: 243, column: 14, scope: !450)
!458 = !DILocation(line: 247, column: 7, scope: !450)
!459 = !DILocation(line: 251, column: 27, scope: !460)
!460 = distinct !DILexicalBlock(scope: !408, file: !299, line: 250, column: 5)
!461 = !{!410, !411, i64 104}
!462 = !DILocation(line: 252, column: 42, scope: !460)
!463 = !DILocation(line: 252, column: 69, scope: !460)
!464 = !DILocation(line: 253, column: 48, scope: !460)
!465 = !DILocation(line: 255, column: 14, scope: !460)
!466 = !DILocation(line: 259, column: 7, scope: !460)
!467 = !DILocation(line: 263, column: 27, scope: !468)
!468 = distinct !DILexicalBlock(scope: !408, file: !299, line: 262, column: 5)
!469 = !{!410, !411, i64 112}
!470 = !DILocation(line: 264, column: 44, scope: !468)
!471 = !DILocation(line: 264, column: 71, scope: !468)
!472 = !DILocation(line: 265, column: 50, scope: !468)
!473 = !DILocation(line: 267, column: 14, scope: !468)
!474 = !DILocation(line: 271, column: 7, scope: !468)
!475 = !DILocation(line: 275, column: 25, scope: !476)
!476 = distinct !DILexicalBlock(scope: !408, file: !299, line: 274, column: 5)
!477 = !{!410, !411, i64 56}
!478 = !DILocation(line: 276, column: 27, scope: !476)
!479 = !{!410, !411, i64 120}
!480 = !DILocation(line: 277, column: 40, scope: !476)
!481 = !DILocation(line: 277, column: 67, scope: !476)
!482 = !DILocation(line: 278, column: 46, scope: !476)
!483 = !DILocation(line: 280, column: 14, scope: !476)
!484 = !DILocation(line: 284, column: 7, scope: !476)
!485 = !DILocation(line: 0, scope: !408)
!486 = !{!411, !411, i64 0}
!487 = !DILocation(line: 289, column: 23, scope: !373)
!488 = !DILocation(line: 289, column: 3, scope: !373)
!489 = !DILocation(line: 291, column: 51, scope: !373)
!490 = !DILocation(line: 291, column: 5, scope: !373)
!491 = !DILocation(line: 290, column: 10, scope: !373)
!492 = !DILocation(line: 294, column: 1, scope: !373)
!493 = !DILocation(line: 293, column: 3, scope: !373)
!494 = !DISubprogram(name: "FormatMagickSize", scope: !311, file: !311, line: 83, type: !495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !498)
!495 = !DISubroutineType(types: !496)
!496 = !{!215, !379, !497, !228}
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!498 = !{}
!499 = !DISubprogram(name: "ActivateSemaphoreInfo", scope: !207, file: !207, line: 35, type: !500, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !498)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!503 = !DISubprogram(name: "LockSemaphoreInfo", scope: !207, file: !207, line: 37, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !498)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !205}
!506 = !DISubprogram(name: "UnlockSemaphoreInfo", scope: !207, file: !207, line: 39, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !498)
!507 = !DISubprogram(name: "LogMagickEvent", scope: !24, file: !24, line: 83, type: !508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !498)
!508 = !DISubroutineType(types: !509)
!509 = !{!376, !510, !224, !224, !512, !224, null}
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !24, line: 58, baseType: !23)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!513 = !DISubprogram(name: "CommandOptionToMnemonic", scope: !49, file: !49, line: 157, type: !514, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !498)
!514 = !DISubroutineType(types: !515)
!515 = !{!224, !516, !518}
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "CommandOption", file: !49, line: 99, baseType: !48)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!519 = distinct !DISubprogram(name: "AsynchronousResourceComponentTerminus", scope: !299, file: !299, line: 316, type: !520, scopeLine: 317, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{null}
!522 = !{!523}
!523 = !DILocalVariable(name: "path", scope: !519, file: !299, line: 319, type: !224)
!524 = !DILocation(line: 321, column: 7, scope: !525)
!525 = distinct !DILexicalBlock(scope: !519, file: !299, line: 321, column: 7)
!526 = !DILocation(line: 321, column: 27, scope: !525)
!527 = !DILocation(line: 321, column: 7, scope: !519)
!528 = !DILocation(line: 326, column: 3, scope: !519)
!529 = !DILocation(line: 327, column: 45, scope: !519)
!530 = !DILocation(line: 327, column: 23, scope: !519)
!531 = !DILocation(line: 0, scope: !519)
!532 = !DILocation(line: 328, column: 15, scope: !519)
!533 = !DILocation(line: 328, column: 3, scope: !519)
!534 = !DILocation(line: 330, column: 12, scope: !535)
!535 = distinct !DILexicalBlock(scope: !519, file: !299, line: 329, column: 3)
!536 = !DILocation(line: 331, column: 47, scope: !535)
!537 = !DILocation(line: 331, column: 25, scope: !535)
!538 = distinct !{!538, !533, !539, !540, !541}
!539 = !DILocation(line: 332, column: 3, scope: !519)
!540 = !{!"llvm.loop.mustprogress"}
!541 = !{!"llvm.loop.unroll.disable"}
!542 = !DILocation(line: 333, column: 1, scope: !519)
!543 = !DISubprogram(name: "ResetSplayTreeIterator", scope: !222, file: !222, line: 55, type: !544, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !498)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !220}
!546 = !DISubprogram(name: "GetNextKeyInSplayTree", scope: !222, file: !222, line: 34, type: !547, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !498)
!547 = !DISubroutineType(types: !548)
!548 = !{!236, !220}
!549 = !DISubprogram(name: "ShredFile", scope: !550, file: !550, line: 30, type: !551, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !498)
!550 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f0938b0b9be15949da14cdcfd7e813d9")
!551 = !DISubroutineType(types: !552)
!552 = !{!376, !224}
!553 = distinct !DISubprogram(name: "GetPathTemplate", scope: !299, file: !299, line: 367, type: !554, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !556)
!554 = !DISubroutineType(types: !555)
!555 = !{!376, !228}
!556 = !{!557, !558, !559, !560, !574, !575}
!557 = !DILocalVariable(name: "path", arg: 1, scope: !553, file: !299, line: 367, type: !228)
!558 = !DILocalVariable(name: "directory", scope: !553, file: !299, line: 370, type: !228)
!559 = !DILocalVariable(name: "value", scope: !553, file: !299, line: 371, type: !228)
!560 = !DILocalVariable(name: "exception", scope: !553, file: !299, line: 374, type: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !125, line: 102, size: 448, elements: !564)
!564 = !{!565, !567, !568, !569, !570, !571, !572, !573}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !563, file: !125, line: 105, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !125, line: 100, baseType: !124)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !563, file: !125, line: 108, baseType: !50, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !563, file: !125, line: 111, baseType: !228, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !563, file: !125, line: 112, baseType: !228, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !563, file: !125, line: 115, baseType: !209, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !563, file: !125, line: 118, baseType: !376, size: 32, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !563, file: !125, line: 121, baseType: !205, size: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !563, file: !125, line: 124, baseType: !288, size: 64, offset: 384)
!574 = !DILocalVariable(name: "status", scope: !553, file: !299, line: 377, type: !376)
!575 = !DILocalVariable(name: "attributes", scope: !553, file: !299, line: 380, type: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !577, line: 46, size: 1152, elements: !578)
!577 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "f8d5b541c4f89219f8e8ff8c3e2940d9")
!578 = !{!579, !581, !583, !585, !587, !589, !591, !592, !593, !594, !596, !598, !606, !607, !608}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !576, file: !577, line: 48, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !218, line: 145, baseType: !214)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !576, file: !577, line: 53, baseType: !582, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !218, line: 148, baseType: !214)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !576, file: !577, line: 61, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !218, line: 151, baseType: !214)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !576, file: !577, line: 62, baseType: !586, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !218, line: 150, baseType: !7)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !576, file: !577, line: 64, baseType: !588, size: 32, offset: 224)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !218, line: 146, baseType: !7)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !576, file: !577, line: 65, baseType: !590, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !218, line: 147, baseType: !7)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !576, file: !577, line: 67, baseType: !50, size: 32, offset: 288)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !576, file: !577, line: 69, baseType: !580, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !576, file: !577, line: 74, baseType: !265, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !576, file: !577, line: 78, baseType: !595, size: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !218, line: 174, baseType: !219)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !576, file: !577, line: 80, baseType: !597, size: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !218, line: 179, baseType: !219)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !576, file: !577, line: 91, baseType: !599, size: 128, offset: 576)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !600, line: 10, size: 128, elements: !601)
!600 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!601 = !{!602, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !599, file: !600, line: 12, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !218, line: 160, baseType: !219)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !599, file: !600, line: 16, baseType: !605, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !218, line: 196, baseType: !219)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !576, file: !577, line: 92, baseType: !599, size: 128, offset: 704)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !576, file: !577, line: 93, baseType: !599, size: 128, offset: 832)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !576, file: !577, line: 106, baseType: !609, size: 192, offset: 960)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 192, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 3)
!612 = !DILocation(line: 0, scope: !553)
!613 = !DILocation(line: 369, column: 3, scope: !553)
!614 = !DILocation(line: 379, column: 3, scope: !553)
!615 = !DILocation(line: 380, column: 5, scope: !553)
!616 = !DILocation(line: 383, column: 14, scope: !553)
!617 = !DILocation(line: 383, column: 5, scope: !553)
!618 = !DILocation(line: 382, column: 10, scope: !553)
!619 = !DILocation(line: 384, column: 13, scope: !553)
!620 = !DILocation(line: 385, column: 22, scope: !553)
!621 = !DILocation(line: 385, column: 12, scope: !553)
!622 = !DILocation(line: 387, column: 13, scope: !553)
!623 = !DILocation(line: 388, column: 17, scope: !624)
!624 = distinct !DILexicalBlock(scope: !553, file: !299, line: 388, column: 7)
!625 = !DILocation(line: 388, column: 7, scope: !553)
!626 = !DILocation(line: 389, column: 15, scope: !624)
!627 = !DILocation(line: 389, column: 14, scope: !624)
!628 = !DILocation(line: 390, column: 17, scope: !629)
!629 = distinct !DILexicalBlock(scope: !553, file: !299, line: 390, column: 7)
!630 = !DILocation(line: 390, column: 7, scope: !553)
!631 = !DILocation(line: 391, column: 15, scope: !629)
!632 = !DILocation(line: 391, column: 14, scope: !629)
!633 = !DILocation(line: 403, column: 17, scope: !634)
!634 = distinct !DILexicalBlock(scope: !553, file: !299, line: 403, column: 7)
!635 = !DILocation(line: 403, column: 7, scope: !553)
!636 = !DILocation(line: 404, column: 15, scope: !634)
!637 = !DILocation(line: 404, column: 14, scope: !634)
!638 = !DILocation(line: 406, column: 17, scope: !639)
!639 = distinct !DILexicalBlock(scope: !553, file: !299, line: 406, column: 7)
!640 = !DILocation(line: 406, column: 7, scope: !553)
!641 = !DILocation(line: 407, column: 15, scope: !639)
!642 = !DILocation(line: 407, column: 14, scope: !639)
!643 = !DILocation(line: 408, column: 17, scope: !644)
!644 = distinct !DILexicalBlock(scope: !553, file: !299, line: 408, column: 7)
!645 = !DILocation(line: 408, column: 7, scope: !553)
!646 = !DILocation(line: 410, column: 9, scope: !553)
!647 = !DILocation(line: 411, column: 13, scope: !648)
!648 = distinct !DILexicalBlock(scope: !553, file: !299, line: 411, column: 7)
!649 = !DILocation(line: 411, column: 7, scope: !553)
!650 = !DILocation(line: 412, column: 12, scope: !648)
!651 = !DILocation(line: 413, column: 14, scope: !652)
!652 = distinct !DILexicalBlock(scope: !553, file: !299, line: 413, column: 7)
!653 = !DILocation(line: 412, column: 5, scope: !648)
!654 = !DILocation(line: 413, column: 7, scope: !652)
!655 = !DILocation(line: 413, column: 25, scope: !652)
!656 = !DILocation(line: 413, column: 7, scope: !553)
!657 = !DILocation(line: 418, column: 10, scope: !553)
!658 = !DILocation(line: 419, column: 15, scope: !659)
!659 = distinct !DILexicalBlock(scope: !553, file: !299, line: 419, column: 7)
!660 = !DILocation(line: 419, column: 31, scope: !659)
!661 = !DILocation(line: 419, column: 35, scope: !659)
!662 = !{!663, !665, i64 24}
!663 = !{!"stat", !664, i64 0, !664, i64 8, !664, i64 16, !665, i64 24, !665, i64 28, !665, i64 32, !665, i64 36, !664, i64 40, !664, i64 48, !664, i64 56, !664, i64 64, !666, i64 72, !666, i64 88, !666, i64 104, !398, i64 120}
!664 = !{!"long", !398, i64 0}
!665 = !{!"int", !398, i64 0}
!666 = !{!"timespec", !664, i64 0, !664, i64 8}
!667 = !DILocation(line: 419, column: 7, scope: !553)
!668 = !DILocation(line: 421, column: 31, scope: !669)
!669 = distinct !DILexicalBlock(scope: !659, file: !299, line: 420, column: 5)
!670 = !DILocation(line: 422, column: 7, scope: !669)
!671 = !DILocation(line: 424, column: 7, scope: !672)
!672 = distinct !DILexicalBlock(scope: !553, file: !299, line: 424, column: 7)
!673 = !DILocation(line: 424, column: 17, scope: !672)
