; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/segment.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/segment.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExtentPacket = type { float, i64, i64, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }

!330 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!331 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!332 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!333 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!334 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!335 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!336 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!337 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!338 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!339 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!340 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!341 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 47, baseType: !5, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!344 = !DIEnumerator(name: "UndefinedType", value: 0)
!345 = !DIEnumerator(name: "BilevelType", value: 1)
!346 = !DIEnumerator(name: "GrayscaleType", value: 2)
!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!348 = !DIEnumerator(name: "PaletteType", value: 4)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!350 = !DIEnumerator(name: "TrueColorType", value: 6)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!354 = !DIEnumerator(name: "OptimizeType", value: 10)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!372 = !DIEnumerator(name: "NoEvents", value: 0)
!373 = !DIEnumerator(name: "TraceEvent", value: 1)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!375 = !DIEnumerator(name: "BlobEvent", value: 4)
!376 = !DIEnumerator(name: "CacheEvent", value: 8)
!377 = !DIEnumerator(name: "CoderEvent", value: 16)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!380 = !DIEnumerator(name: "DrawEvent", value: 128)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!382 = !DIEnumerator(name: "ImageEvent", value: 512)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384)
!388 = !DIEnumerator(name: "UserEvent", value: 36864)
!389 = !DIEnumerator(name: "WandEvent", value: 65536)
!390 = !DIEnumerator(name: "X11Event", value: 131072)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!393 = !{!394, !395, !401, !403, !404, !396, !425, !416, !436, !438, !439, !552, !431, !642, !450, !655, !666, !589, !643, !402, !667, !467, !462, !668, !669}
!394 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !397, line: 77, baseType: !398)
!397 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !399, line: 193, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!400 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cluster", file: !406, line: 147, baseType: !407)
!406 = !DIFile(filename: "apps/538.imagick_r/src/magick/segment.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0e7ef0a744cc8f63f8f9fd6fefb412f3")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Cluster", file: !406, line: 134, size: 960, elements: !408)
!408 = !{!409, !411, !421, !422, !423, !424}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !407, file: !406, line: 137, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !407, file: !406, line: 140, baseType: !412, size: 256, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtentPacket", file: !406, line: 132, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExtentPacket", file: !406, line: 123, size: 256, elements: !414)
!414 = !{!415, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !413, file: !406, line: 126, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !417)
!417 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !413, file: !406, line: 129, baseType: !396, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !413, file: !406, line: 130, baseType: !396, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !413, file: !406, line: 131, baseType: !396, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !407, file: !406, line: 141, baseType: !412, size: 256, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !407, file: !406, line: 142, baseType: !412, size: 256, offset: 576)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !407, file: !406, line: 145, baseType: !396, size: 64, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !407, file: !406, line: 146, baseType: !396, size: 64, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !429)
!429 = !{!430, !433, !434, !435}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !428, file: !326, line: 143, baseType: !431, size: 16)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !432)
!432 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !428, file: !326, line: 144, baseType: !431, size: 16, offset: 16)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !428, file: !326, line: 145, baseType: !431, size: 16, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !428, file: !326, line: 146, baseType: !431, size: 16, offset: 48)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !437)
!437 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!438 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !442)
!442 = !{!443, !445, !447, !449, !452, !454, !456, !457, !458, !459, !460, !461, !463, !464, !465, !466, !468, !482, !484, !485, !487, !490, !491, !492, !493, !494, !495, !503, !504, !505, !506, !507, !508, !510, !512, !514, !516, !518, !520, !522, !523, !524, !525, !526, !527, !528, !536, !551, !563, !564, !565, !566, !570, !574, !578, !579, !580, !581, !582, !600, !601, !603, !604, !613, !614, !616, !617, !618, !619, !620, !621, !623, !624, !625, !626, !627, !628, !629, !631, !632, !633, !634, !635, !639, !641}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !441, file: !77, line: 153, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !441, file: !77, line: 156, baseType: !446, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !441, file: !77, line: 159, baseType: !448, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !441, file: !77, line: 162, baseType: !450, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !451, line: 46, baseType: !394)
!451 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!452 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !441, file: !77, line: 165, baseType: !453, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !441, file: !77, line: 168, baseType: !455, size: 32, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !441, file: !77, line: 169, baseType: !455, size: 32, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !441, file: !77, line: 172, baseType: !450, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !441, file: !77, line: 173, baseType: !450, size: 64, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !441, file: !77, line: 174, baseType: !450, size: 64, offset: 448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !441, file: !77, line: 175, baseType: !450, size: 64, offset: 512)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !441, file: !77, line: 178, baseType: !462, size: 64, offset: 576)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !441, file: !77, line: 179, baseType: !427, size: 64, offset: 640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !441, file: !77, line: 180, baseType: !427, size: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !441, file: !77, line: 181, baseType: !427, size: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !441, file: !77, line: 184, baseType: !467, size: 64, offset: 832)
!467 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !441, file: !77, line: 187, baseType: !469, size: 768, offset: 896)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !471)
!471 = !{!472, !479, !480, !481}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !470, file: !77, line: 124, baseType: !473, size: 192)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !474, file: !77, line: 98, baseType: !467, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !474, file: !77, line: 99, baseType: !467, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !474, file: !77, line: 100, baseType: !467, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !470, file: !77, line: 125, baseType: !473, size: 192, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !470, file: !77, line: 126, baseType: !473, size: 192, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !470, file: !77, line: 127, baseType: !473, size: 192, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !441, file: !77, line: 190, baseType: !483, size: 32, offset: 1664)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !441, file: !77, line: 193, baseType: !403, size: 64, offset: 1728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !441, file: !77, line: 196, baseType: !486, size: 32, offset: 1792)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !441, file: !77, line: 199, baseType: !488, size: 64, offset: 1856)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !441, file: !77, line: 200, baseType: !488, size: 64, offset: 1920)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !441, file: !77, line: 201, baseType: !488, size: 64, offset: 1984)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !441, file: !77, line: 204, baseType: !396, size: 64, offset: 2048)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !441, file: !77, line: 207, baseType: !467, size: 64, offset: 2112)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !441, file: !77, line: 208, baseType: !467, size: 64, offset: 2176)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !441, file: !77, line: 211, baseType: !496, size: 256, offset: 2240)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !498)
!498 = !{!499, !500, !501, !502}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !497, file: !153, line: 124, baseType: !450, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !497, file: !153, line: 125, baseType: !450, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !497, file: !153, line: 128, baseType: !396, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !497, file: !153, line: 129, baseType: !396, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !441, file: !77, line: 212, baseType: !496, size: 256, offset: 2496)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !441, file: !77, line: 213, baseType: !496, size: 256, offset: 2752)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !441, file: !77, line: 216, baseType: !467, size: 64, offset: 3008)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !441, file: !77, line: 217, baseType: !467, size: 64, offset: 3072)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !441, file: !77, line: 218, baseType: !467, size: 64, offset: 3136)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !441, file: !77, line: 221, baseType: !509, size: 32, offset: 3200)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !441, file: !77, line: 224, baseType: !511, size: 32, offset: 3232)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !441, file: !77, line: 227, baseType: !513, size: 32, offset: 3264)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !441, file: !77, line: 230, baseType: !515, size: 32, offset: 3296)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !441, file: !77, line: 233, baseType: !517, size: 32, offset: 3328)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !441, file: !77, line: 236, baseType: !519, size: 32, offset: 3360)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !441, file: !77, line: 239, baseType: !521, size: 64, offset: 3392)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !441, file: !77, line: 242, baseType: !450, size: 64, offset: 3456)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !441, file: !77, line: 243, baseType: !450, size: 64, offset: 3520)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !441, file: !77, line: 246, baseType: !396, size: 64, offset: 3584)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !441, file: !77, line: 249, baseType: !450, size: 64, offset: 3648)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !441, file: !77, line: 250, baseType: !450, size: 64, offset: 3712)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !441, file: !77, line: 253, baseType: !396, size: 64, offset: 3776)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !441, file: !77, line: 256, baseType: !529, size: 192, offset: 3840)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !530, line: 68, baseType: !531)
!530 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !530, line: 62, size: 192, elements: !532)
!532 = !{!533, !534, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !531, file: !530, line: 65, baseType: !467, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !531, file: !530, line: 66, baseType: !467, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !531, file: !530, line: 67, baseType: !467, size: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !441, file: !77, line: 259, baseType: !537, size: 512, offset: 4032)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !539)
!539 = !{!540, !547, !548, !550}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !538, file: !247, line: 43, baseType: !541, size: 192)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !542, file: !247, line: 35, baseType: !467, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !542, file: !247, line: 36, baseType: !467, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !542, file: !247, line: 37, baseType: !467, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !538, file: !247, line: 44, baseType: !541, size: 192, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !538, file: !247, line: 47, baseType: !549, size: 32, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !538, file: !247, line: 50, baseType: !450, size: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !441, file: !77, line: 262, baseType: !552, size: 64, offset: 4544)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !553, line: 26, baseType: !554)
!553 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!455, !557, !559, !560, !403}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !562)
!562 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !441, file: !77, line: 265, baseType: !403, size: 64, offset: 4608)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !441, file: !77, line: 266, baseType: !403, size: 64, offset: 4672)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !441, file: !77, line: 267, baseType: !403, size: 64, offset: 4736)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !441, file: !77, line: 270, baseType: !567, size: 64, offset: 4800)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !569)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !441, file: !77, line: 273, baseType: !571, size: 64, offset: 4864)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !573)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !441, file: !77, line: 276, baseType: !575, size: 32768, offset: 4928)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 32768, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 4096)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !441, file: !77, line: 277, baseType: !575, size: 32768, offset: 37696)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !441, file: !77, line: 278, baseType: !575, size: 32768, offset: 70464)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !441, file: !77, line: 281, baseType: !450, size: 64, offset: 103232)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !441, file: !77, line: 282, baseType: !450, size: 64, offset: 103296)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !441, file: !77, line: 285, baseType: !583, size: 448, offset: 103360)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !585)
!585 = !{!586, !588, !590, !591, !592, !593, !594, !599}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !584, file: !253, line: 105, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !584, file: !253, line: 108, baseType: !589, size: 32, offset: 32)
!589 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !584, file: !253, line: 111, baseType: !488, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !584, file: !253, line: 112, baseType: !488, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !584, file: !253, line: 115, baseType: !403, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !584, file: !253, line: 118, baseType: !455, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !584, file: !253, line: 121, baseType: !595, size: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !597, line: 26, baseType: !598)
!597 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !597, line: 25, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !584, file: !253, line: 124, baseType: !450, size: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !441, file: !77, line: 288, baseType: !455, size: 32, offset: 103808)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !441, file: !77, line: 291, baseType: !602, size: 64, offset: 103872)
!602 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !396)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !441, file: !77, line: 294, baseType: !595, size: 64, offset: 103936)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !441, file: !77, line: 297, baseType: !605, size: 256, offset: 104000)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !607)
!607 = !{!608, !609, !610, !612}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !606, file: !89, line: 30, baseType: !488, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !606, file: !89, line: 33, baseType: !450, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !606, file: !89, line: 36, baseType: !611, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !606, file: !89, line: 39, baseType: !450, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !441, file: !77, line: 298, baseType: !605, size: 256, offset: 104256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !441, file: !77, line: 299, baseType: !615, size: 64, offset: 104512)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !441, file: !77, line: 302, baseType: !450, size: 64, offset: 104576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !441, file: !77, line: 305, baseType: !450, size: 64, offset: 104640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !441, file: !77, line: 308, baseType: !521, size: 64, offset: 104704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !441, file: !77, line: 309, baseType: !521, size: 64, offset: 104768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !441, file: !77, line: 310, baseType: !521, size: 64, offset: 104832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !441, file: !77, line: 313, baseType: !622, size: 32, offset: 104896)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !441, file: !77, line: 316, baseType: !455, size: 32, offset: 104928)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !441, file: !77, line: 319, baseType: !427, size: 64, offset: 104960)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !441, file: !77, line: 322, baseType: !521, size: 64, offset: 105024)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !441, file: !77, line: 325, baseType: !496, size: 256, offset: 105088)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !441, file: !77, line: 328, baseType: !403, size: 64, offset: 105344)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !441, file: !77, line: 329, baseType: !403, size: 64, offset: 105408)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !77, line: 332, baseType: !630, size: 32, offset: 105472)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !441, file: !77, line: 335, baseType: !455, size: 32, offset: 105504)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !441, file: !77, line: 338, baseType: !561, size: 64, offset: 105536)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !441, file: !77, line: 341, baseType: !455, size: 32, offset: 105600)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !441, file: !77, line: 344, baseType: !450, size: 64, offset: 105664)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !441, file: !77, line: 347, baseType: !636, size: 64, offset: 105728)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !637, line: 7, baseType: !638)
!637 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !399, line: 160, baseType: !400)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !441, file: !77, line: 350, baseType: !640, size: 32, offset: 105792)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !441, file: !77, line: 353, baseType: !450, size: 64, offset: 105856)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "IntervalTree", file: !406, line: 165, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IntervalTree", file: !406, line: 149, size: 384, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !654}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tau", scope: !645, file: !406, line: 152, baseType: !416, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !645, file: !406, line: 155, baseType: !396, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !645, file: !406, line: 156, baseType: !396, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "mean_stability", scope: !645, file: !406, line: 159, baseType: !416, size: 32, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "stability", scope: !645, file: !406, line: 160, baseType: !416, size: 32, offset: 224)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !645, file: !406, line: 163, baseType: !653, size: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !645, file: !406, line: 164, baseType: !653, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZeroCrossing", file: !406, line: 175, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ZeroCrossing", file: !406, line: 167, size: 12320, elements: !658)
!658 = !{!659, !660, !664}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tau", scope: !657, file: !406, line: 170, baseType: !416, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "histogram", scope: !657, file: !406, line: 171, baseType: !661, size: 8192, offset: 32)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 8192, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "crossings", scope: !657, file: !406, line: 174, baseType: !665, size: 4096, offset: 8224)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 4096, elements: !662)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !431)
!670 = !{!671, !674, !676, !678, !680}
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!672 = distinct !DIGlobalVariable(name: "Red", scope: !0, file: !406, line: 183, type: !673, isLocal: true, isDefinition: true)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!675 = distinct !DIGlobalVariable(name: "Green", scope: !0, file: !406, line: 182, type: !673, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!677 = distinct !DIGlobalVariable(name: "Blue", scope: !0, file: !406, line: 181, type: !673, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!679 = distinct !DIGlobalVariable(name: "SafeMargin", scope: !0, file: !406, line: 184, type: !673, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression(DW_OP_constu, 600, DW_OP_stack_value))
!681 = distinct !DIGlobalVariable(name: "TreeLength", scope: !0, file: !406, line: 185, type: !673, isLocal: true, isDefinition: true)
!682 = !{i32 7, !"Dwarf Version", i32 5}
!683 = !{i32 2, !"Debug Info Version", i32 3}
!684 = !{i32 1, !"wchar_size", i32 4}
!685 = !{i32 7, !"PIC Level", i32 2}
!686 = !{i32 7, !"PIE Level", i32 2}
!687 = !{i32 7, !"uwtable", i32 2}
!688 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!689 = distinct !DISubprogram(name: "GetImageDynamicThreshold", scope: !406, file: !406, line: 951, type: !690, scopeLine: 954, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !710)
!690 = !DISubroutineType(types: !691)
!691 = !{!455, !692, !694, !694, !695, !709}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !697, file: !326, line: 107, baseType: !444, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !697, file: !326, line: 110, baseType: !446, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !697, file: !326, line: 113, baseType: !455, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !697, file: !326, line: 116, baseType: !467, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !697, file: !326, line: 119, baseType: !450, size: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !697, file: !326, line: 122, baseType: !416, size: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !697, file: !326, line: 123, baseType: !416, size: 32, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !697, file: !326, line: 124, baseType: !416, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !697, file: !326, line: 125, baseType: !416, size: 32, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !697, file: !326, line: 126, baseType: !416, size: 32, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !734, !735, !737}
!711 = !DILocalVariable(name: "image", arg: 1, scope: !689, file: !406, line: 951, type: !692)
!712 = !DILocalVariable(name: "cluster_threshold", arg: 2, scope: !689, file: !406, line: 952, type: !694)
!713 = !DILocalVariable(name: "smooth_threshold", arg: 3, scope: !689, file: !406, line: 952, type: !694)
!714 = !DILocalVariable(name: "pixel", arg: 4, scope: !689, file: !406, line: 953, type: !695)
!715 = !DILocalVariable(name: "exception", arg: 5, scope: !689, file: !406, line: 953, type: !709)
!716 = !DILocalVariable(name: "background", scope: !689, file: !406, line: 956, type: !404)
!717 = !DILocalVariable(name: "cluster", scope: !689, file: !406, line: 957, type: !404)
!718 = !DILocalVariable(name: "object", scope: !689, file: !406, line: 958, type: !404)
!719 = !DILocalVariable(name: "head", scope: !689, file: !406, line: 959, type: !404)
!720 = !DILocalVariable(name: "last_cluster", scope: !689, file: !406, line: 960, type: !404)
!721 = !DILocalVariable(name: "next_cluster", scope: !689, file: !406, line: 961, type: !404)
!722 = !DILocalVariable(name: "blue", scope: !689, file: !406, line: 964, type: !412)
!723 = !DILocalVariable(name: "green", scope: !689, file: !406, line: 965, type: !412)
!724 = !DILocalVariable(name: "red", scope: !689, file: !406, line: 966, type: !412)
!725 = !DILocalVariable(name: "proceed", scope: !689, file: !406, line: 969, type: !455)
!726 = !DILocalVariable(name: "threshold", scope: !689, file: !406, line: 972, type: !416)
!727 = !DILocalVariable(name: "p", scope: !689, file: !406, line: 975, type: !425)
!728 = !DILocalVariable(name: "i", scope: !689, file: !406, line: 978, type: !396)
!729 = !DILocalVariable(name: "x", scope: !689, file: !406, line: 979, type: !396)
!730 = !DILocalVariable(name: "extrema", scope: !689, file: !406, line: 982, type: !731)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 192, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 3)
!734 = !DILocalVariable(name: "count", scope: !689, file: !406, line: 985, type: !396)
!735 = !DILocalVariable(name: "histogram", scope: !689, file: !406, line: 986, type: !736)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 192, elements: !732)
!737 = !DILocalVariable(name: "y", scope: !689, file: !406, line: 987, type: !396)
!738 = !DILocation(line: 0, scope: !689)
!739 = !DILocation(line: 963, column: 3, scope: !689)
!740 = !DILocation(line: 964, column: 5, scope: !689)
!741 = !DILocation(line: 965, column: 5, scope: !689)
!742 = !DILocation(line: 966, column: 5, scope: !689)
!743 = !DILocation(line: 981, column: 3, scope: !689)
!744 = !DILocation(line: 982, column: 6, scope: !689)
!745 = !DILocation(line: 984, column: 3, scope: !689)
!746 = !DILocation(line: 986, column: 6, scope: !689)
!747 = !DILocation(line: 994, column: 14, scope: !748)
!748 = distinct !DILexicalBlock(scope: !689, file: !406, line: 994, column: 7)
!749 = !{!750, !751, i64 12976}
!750 = !{!"_Image", !751, i64 0, !751, i64 4, !751, i64 8, !753, i64 16, !751, i64 24, !751, i64 28, !751, i64 32, !753, i64 40, !753, i64 48, !753, i64 56, !753, i64 64, !754, i64 72, !755, i64 80, !755, i64 88, !755, i64 96, !757, i64 104, !758, i64 112, !751, i64 208, !754, i64 216, !751, i64 224, !754, i64 232, !754, i64 240, !754, i64 248, !753, i64 256, !757, i64 264, !757, i64 272, !760, i64 280, !760, i64 312, !760, i64 344, !757, i64 376, !757, i64 384, !757, i64 392, !751, i64 400, !751, i64 404, !751, i64 408, !751, i64 412, !751, i64 416, !751, i64 420, !754, i64 424, !753, i64 432, !753, i64 440, !753, i64 448, !753, i64 456, !753, i64 464, !753, i64 472, !761, i64 480, !762, i64 504, !754, i64 568, !754, i64 576, !754, i64 584, !754, i64 592, !754, i64 600, !754, i64 608, !751, i64 616, !751, i64 4712, !751, i64 8808, !753, i64 12904, !753, i64 12912, !764, i64 12920, !751, i64 12976, !753, i64 12984, !754, i64 12992, !766, i64 13000, !766, i64 13032, !754, i64 13064, !753, i64 13072, !753, i64 13080, !754, i64 13088, !754, i64 13096, !754, i64 13104, !751, i64 13112, !751, i64 13116, !755, i64 13120, !754, i64 13128, !760, i64 13136, !754, i64 13168, !754, i64 13176, !751, i64 13184, !751, i64 13188, !767, i64 13192, !751, i64 13200, !753, i64 13208, !753, i64 13216, !751, i64 13224, !753, i64 13232}
!751 = !{!"omnipotent char", !752, i64 0}
!752 = !{!"Simple C/C++ TBAA"}
!753 = !{!"long", !751, i64 0}
!754 = !{!"any pointer", !751, i64 0}
!755 = !{!"_PixelPacket", !756, i64 0, !756, i64 2, !756, i64 4, !756, i64 6}
!756 = !{!"short", !751, i64 0}
!757 = !{!"double", !751, i64 0}
!758 = !{!"_ChromaticityInfo", !759, i64 0, !759, i64 24, !759, i64 48, !759, i64 72}
!759 = !{!"_PrimaryInfo", !757, i64 0, !757, i64 8, !757, i64 16}
!760 = !{!"_RectangleInfo", !753, i64 0, !753, i64 8, !753, i64 16, !753, i64 24}
!761 = !{!"_ErrorInfo", !757, i64 0, !757, i64 8, !757, i64 16}
!762 = !{!"_TimerInfo", !763, i64 0, !763, i64 24, !751, i64 48, !753, i64 56}
!763 = !{!"_Timer", !757, i64 0, !757, i64 8, !757, i64 16}
!764 = !{!"_ExceptionInfo", !751, i64 0, !765, i64 4, !754, i64 8, !754, i64 16, !754, i64 24, !751, i64 32, !754, i64 40, !753, i64 48}
!765 = !{!"int", !751, i64 0}
!766 = !{!"_ProfileInfo", !754, i64 0, !753, i64 8, !754, i64 16, !753, i64 24}
!767 = !{!"long long", !751, i64 0}
!768 = !DILocation(line: 994, column: 20, scope: !748)
!769 = !DILocation(line: 994, column: 7, scope: !689)
!770 = !DILocation(line: 995, column: 68, scope: !748)
!771 = !DILocation(line: 995, column: 12, scope: !748)
!772 = !DILocation(line: 995, column: 5, scope: !748)
!773 = !DILocation(line: 996, column: 3, scope: !689)
!774 = !DILocation(line: 997, column: 3, scope: !775)
!775 = distinct !DILexicalBlock(scope: !689, file: !406, line: 997, column: 3)
!776 = !DILocation(line: 999, column: 30, scope: !777)
!777 = distinct !DILexicalBlock(scope: !778, file: !406, line: 998, column: 3)
!778 = distinct !DILexicalBlock(scope: !775, file: !406, line: 997, column: 3)
!779 = !DILocation(line: 999, column: 5, scope: !777)
!780 = !DILocation(line: 999, column: 17, scope: !777)
!781 = !{!754, !754, i64 0}
!782 = !DILocation(line: 1000, column: 26, scope: !777)
!783 = !DILocation(line: 1000, column: 5, scope: !777)
!784 = !DILocation(line: 1000, column: 15, scope: !777)
!785 = !DILocation(line: 1001, column: 23, scope: !786)
!786 = distinct !DILexicalBlock(scope: !777, file: !406, line: 1001, column: 9)
!787 = !DILocation(line: 1001, column: 44, scope: !786)
!788 = !DILocation(line: 1003, column: 22, scope: !789)
!789 = distinct !DILexicalBlock(scope: !790, file: !406, line: 1003, column: 9)
!790 = distinct !DILexicalBlock(scope: !791, file: !406, line: 1003, column: 9)
!791 = distinct !DILexicalBlock(scope: !786, file: !406, line: 1002, column: 7)
!792 = !DILocation(line: 1003, column: 9, scope: !790)
!793 = !DILocation(line: 0, scope: !790)
!794 = !DILocation(line: 1005, column: 55, scope: !795)
!795 = distinct !DILexicalBlock(scope: !789, file: !406, line: 1004, column: 9)
!796 = !DILocation(line: 1005, column: 32, scope: !795)
!797 = !DILocation(line: 1005, column: 21, scope: !795)
!798 = !DILocation(line: 1006, column: 59, scope: !795)
!799 = !DILocation(line: 1006, column: 36, scope: !795)
!800 = !DILocation(line: 1006, column: 23, scope: !795)
!801 = distinct !{!801, !792, !802, !803, !804}
!802 = !DILocation(line: 1007, column: 9, scope: !790)
!803 = !{!"llvm.loop.mustprogress"}
!804 = !{!"llvm.loop.unroll.disable"}
!805 = !DILocation(line: 1009, column: 69, scope: !791)
!806 = !DILocation(line: 1008, column: 16, scope: !791)
!807 = !DILocation(line: 1010, column: 9, scope: !791)
!808 = !DILocation(line: 997, column: 32, scope: !778)
!809 = !DILocation(line: 997, column: 15, scope: !778)
!810 = distinct !{!810, !774, !811, !803, !804}
!811 = !DILocation(line: 1012, column: 3, scope: !775)
!812 = !DILocation(line: 1016, column: 3, scope: !689)
!813 = !DILocation(line: 1017, column: 21, scope: !689)
!814 = !DILocation(line: 1018, column: 23, scope: !689)
!815 = !DILocation(line: 1018, column: 58, scope: !689)
!816 = !DILocation(line: 1018, column: 6, scope: !689)
!817 = !DILocation(line: 1017, column: 10, scope: !689)
!818 = !DILocation(line: 1019, column: 21, scope: !689)
!819 = !DILocation(line: 1020, column: 58, scope: !689)
!820 = !DILocation(line: 1019, column: 10, scope: !689)
!821 = !DILocation(line: 1022, column: 6, scope: !689)
!822 = !DILocation(line: 1021, column: 21, scope: !689)
!823 = !DILocation(line: 1022, column: 58, scope: !689)
!824 = !DILocation(line: 1021, column: 10, scope: !689)
!825 = !DILocation(line: 1028, column: 10, scope: !689)
!826 = !DILocation(line: 1029, column: 10, scope: !689)
!827 = !DILocation(line: 1030, column: 10, scope: !689)
!828 = !DILocalVariable(name: "extrema", arg: 1, scope: !829, file: !406, line: 838, type: !832)
!829 = distinct !DISubprogram(name: "DefineRegion", scope: !406, file: !406, line: 838, type: !830, scopeLine: 839, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !835)
!830 = !DISubroutineType(types: !831)
!831 = !{!396, !832, !834}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!835 = !{!828, !836}
!836 = !DILocalVariable(name: "extents", arg: 2, scope: !829, file: !406, line: 838, type: !834)
!837 = !DILocation(line: 0, scope: !829, inlinedAt: !838)
!838 = distinct !DILocation(line: 1031, column: 10, scope: !689)
!839 = !DILocation(line: 843, column: 16, scope: !829, inlinedAt: !838)
!840 = !{!841, !753, i64 16}
!841 = !{!"_ExtentPacket", !842, i64 0, !753, i64 8, !753, i64 16, !753, i64 24}
!842 = !{!"float", !751, i64 0}
!843 = !DILocation(line: 844, column: 18, scope: !829, inlinedAt: !838)
!844 = !{!841, !842, i64 0}
!845 = !DILocation(line: 845, column: 17, scope: !829, inlinedAt: !838)
!846 = !{!841, !753, i64 24}
!847 = !{!841, !753, i64 8}
!848 = !DILocation(line: 849, column: 26, scope: !849, inlinedAt: !838)
!849 = distinct !DILexicalBlock(scope: !850, file: !406, line: 849, column: 3)
!850 = distinct !DILexicalBlock(scope: !829, file: !406, line: 849, column: 3)
!851 = !DILocation(line: 849, column: 3, scope: !850, inlinedAt: !838)
!852 = !DILocation(line: 850, column: 9, scope: !853, inlinedAt: !838)
!853 = distinct !DILexicalBlock(scope: !849, file: !406, line: 850, column: 9)
!854 = !{!756, !756, i64 0}
!855 = !DILocation(line: 850, column: 33, scope: !853, inlinedAt: !838)
!856 = !DILocation(line: 850, column: 9, scope: !849, inlinedAt: !838)
!857 = !DILocation(line: 849, column: 48, scope: !849, inlinedAt: !838)
!858 = distinct !{!858, !851, !859, !803, !804}
!859 = !DILocation(line: 851, column: 7, scope: !850, inlinedAt: !838)
!860 = !DILocation(line: 854, column: 16, scope: !829, inlinedAt: !838)
!861 = !DILocation(line: 858, column: 26, scope: !862, inlinedAt: !838)
!862 = distinct !DILexicalBlock(scope: !863, file: !406, line: 858, column: 3)
!863 = distinct !DILexicalBlock(scope: !829, file: !406, line: 858, column: 3)
!864 = !DILocation(line: 858, column: 3, scope: !863, inlinedAt: !838)
!865 = !DILocation(line: 858, column: 48, scope: !862, inlinedAt: !838)
!866 = distinct !{!866, !864, !867, !803, !804}
!867 = !DILocation(line: 860, column: 7, scope: !863, inlinedAt: !838)
!868 = !DILocation(line: 859, column: 9, scope: !869, inlinedAt: !838)
!869 = distinct !DILexicalBlock(scope: !862, file: !406, line: 859, column: 9)
!870 = !DILocation(line: 859, column: 33, scope: !869, inlinedAt: !838)
!871 = !DILocation(line: 859, column: 9, scope: !862, inlinedAt: !838)
!872 = !DILocation(line: 861, column: 32, scope: !829, inlinedAt: !838)
!873 = !DILocation(line: 858, column: 20, scope: !862, inlinedAt: !838)
!874 = !DILocation(line: 861, column: 17, scope: !829, inlinedAt: !838)
!875 = !DILocation(line: 1033, column: 16, scope: !876)
!876 = distinct !DILexicalBlock(scope: !689, file: !406, line: 1032, column: 3)
!877 = !DILocation(line: 1034, column: 25, scope: !876)
!878 = !DILocation(line: 0, scope: !829, inlinedAt: !879)
!879 = distinct !DILocation(line: 1034, column: 12, scope: !876)
!880 = !DILocation(line: 843, column: 16, scope: !829, inlinedAt: !879)
!881 = !DILocation(line: 844, column: 18, scope: !829, inlinedAt: !879)
!882 = !DILocation(line: 845, column: 17, scope: !829, inlinedAt: !879)
!883 = !DILocation(line: 849, column: 3, scope: !850, inlinedAt: !879)
!884 = !DILocation(line: 850, column: 9, scope: !853, inlinedAt: !879)
!885 = !DILocation(line: 850, column: 33, scope: !853, inlinedAt: !879)
!886 = !DILocation(line: 850, column: 9, scope: !849, inlinedAt: !879)
!887 = !DILocation(line: 849, column: 48, scope: !849, inlinedAt: !879)
!888 = !DILocation(line: 849, column: 26, scope: !849, inlinedAt: !879)
!889 = distinct !{!889, !883, !890, !803, !804}
!890 = !DILocation(line: 851, column: 7, scope: !850, inlinedAt: !879)
!891 = !DILocation(line: 854, column: 16, scope: !829, inlinedAt: !879)
!892 = !DILocation(line: 858, column: 26, scope: !862, inlinedAt: !879)
!893 = !DILocation(line: 858, column: 3, scope: !863, inlinedAt: !879)
!894 = !DILocation(line: 858, column: 48, scope: !862, inlinedAt: !879)
!895 = distinct !{!895, !893, !896, !803, !804}
!896 = !DILocation(line: 860, column: 7, scope: !863, inlinedAt: !879)
!897 = !DILocation(line: 859, column: 9, scope: !869, inlinedAt: !879)
!898 = !DILocation(line: 859, column: 33, scope: !869, inlinedAt: !879)
!899 = !DILocation(line: 859, column: 9, scope: !862, inlinedAt: !879)
!900 = !DILocation(line: 1031, column: 23, scope: !689)
!901 = !DILocation(line: 861, column: 32, scope: !829, inlinedAt: !879)
!902 = !DILocation(line: 858, column: 20, scope: !862, inlinedAt: !879)
!903 = !DILocation(line: 861, column: 17, scope: !829, inlinedAt: !879)
!904 = !DILocation(line: 0, scope: !829, inlinedAt: !905)
!905 = distinct !DILocation(line: 1037, column: 14, scope: !906)
!906 = distinct !DILexicalBlock(scope: !876, file: !406, line: 1035, column: 5)
!907 = !DILocation(line: 844, column: 18, scope: !829, inlinedAt: !905)
!908 = !DILocation(line: 843, column: 16, scope: !829, inlinedAt: !905)
!909 = !DILocation(line: 845, column: 17, scope: !829, inlinedAt: !905)
!910 = !DILocation(line: 1037, column: 7, scope: !906)
!911 = !DILocation(line: 849, column: 3, scope: !850, inlinedAt: !905)
!912 = !DILocation(line: 850, column: 9, scope: !853, inlinedAt: !905)
!913 = !DILocation(line: 850, column: 33, scope: !853, inlinedAt: !905)
!914 = !DILocation(line: 850, column: 9, scope: !849, inlinedAt: !905)
!915 = !DILocation(line: 849, column: 48, scope: !849, inlinedAt: !905)
!916 = !DILocation(line: 849, column: 26, scope: !849, inlinedAt: !905)
!917 = distinct !{!917, !911, !918, !803, !804}
!918 = !DILocation(line: 851, column: 7, scope: !850, inlinedAt: !905)
!919 = !DILocation(line: 854, column: 16, scope: !829, inlinedAt: !905)
!920 = !DILocation(line: 858, column: 26, scope: !862, inlinedAt: !905)
!921 = !DILocation(line: 858, column: 3, scope: !863, inlinedAt: !905)
!922 = !DILocation(line: 858, column: 48, scope: !862, inlinedAt: !905)
!923 = distinct !{!923, !921, !924, !803, !804}
!924 = !DILocation(line: 860, column: 7, scope: !863, inlinedAt: !905)
!925 = !DILocation(line: 859, column: 9, scope: !869, inlinedAt: !905)
!926 = !DILocation(line: 859, column: 33, scope: !869, inlinedAt: !905)
!927 = !DILocation(line: 859, column: 9, scope: !862, inlinedAt: !905)
!928 = !DILocation(line: 861, column: 32, scope: !829, inlinedAt: !905)
!929 = !DILocation(line: 858, column: 20, scope: !862, inlinedAt: !905)
!930 = !DILocation(line: 861, column: 17, scope: !829, inlinedAt: !905)
!931 = !DILocation(line: 1042, column: 18, scope: !932)
!932 = distinct !DILexicalBlock(scope: !933, file: !406, line: 1042, column: 13)
!933 = distinct !DILexicalBlock(scope: !906, file: !406, line: 1038, column: 7)
!934 = !DILocation(line: 0, scope: !932)
!935 = !DILocation(line: 1042, column: 13, scope: !933)
!936 = !DILocation(line: 1044, column: 26, scope: !937)
!937 = distinct !DILexicalBlock(scope: !932, file: !406, line: 1043, column: 11)
!938 = !{!939, !754, i64 0}
!939 = !{!"_Cluster", !754, i64 0, !841, i64 8, !841, i64 40, !841, i64 72, !753, i64 104, !753, i64 112}
!940 = !DILocation(line: 1047, column: 11, scope: !937)
!941 = !DILocation(line: 1053, column: 21, scope: !942)
!942 = distinct !DILexicalBlock(scope: !933, file: !406, line: 1053, column: 13)
!943 = !DILocation(line: 1053, column: 13, scope: !933)
!944 = !DILocation(line: 1057, column: 22, scope: !945)
!945 = distinct !DILexicalBlock(scope: !942, file: !406, line: 1054, column: 11)
!946 = !DILocation(line: 1055, column: 20, scope: !945)
!947 = !DILocation(line: 1058, column: 13, scope: !945)
!948 = !DILocation(line: 1063, column: 18, scope: !933)
!949 = !DILocation(line: 1063, column: 23, scope: !933)
!950 = !{!939, !753, i64 104}
!951 = !DILocation(line: 1064, column: 18, scope: !933)
!952 = !DILocation(line: 1064, column: 22, scope: !933)
!953 = !{i64 0, i64 4, !954, i64 8, i64 8, !955, i64 16, i64 8, !955, i64 24, i64 8, !955}
!954 = !{!842, !842, i64 0}
!955 = !{!753, !753, i64 0}
!956 = !DILocation(line: 1065, column: 18, scope: !933)
!957 = !DILocation(line: 1065, column: 24, scope: !933)
!958 = !DILocation(line: 1066, column: 18, scope: !933)
!959 = !DILocation(line: 1066, column: 23, scope: !933)
!960 = !DILocation(line: 1067, column: 22, scope: !933)
!961 = !DILocation(line: 1037, column: 27, scope: !906)
!962 = distinct !{!962, !910, !963, !803, !804}
!963 = !DILocation(line: 1068, column: 7, scope: !906)
!964 = !DILocation(line: 1071, column: 12, scope: !965)
!965 = distinct !DILexicalBlock(scope: !689, file: !406, line: 1071, column: 7)
!966 = !DILocation(line: 1071, column: 7, scope: !689)
!967 = !DILocation(line: 1076, column: 27, scope: !968)
!968 = distinct !DILexicalBlock(scope: !965, file: !406, line: 1072, column: 5)
!969 = !DILocation(line: 1077, column: 19, scope: !970)
!970 = distinct !DILexicalBlock(scope: !968, file: !406, line: 1077, column: 11)
!971 = !DILocation(line: 1077, column: 11, scope: !968)
!972 = !DILocation(line: 1080, column: 71, scope: !973)
!973 = distinct !DILexicalBlock(scope: !970, file: !406, line: 1078, column: 9)
!974 = !DILocation(line: 1079, column: 18, scope: !973)
!975 = !DILocation(line: 1081, column: 11, scope: !973)
!976 = !DILocation(line: 1086, column: 16, scope: !968)
!977 = !DILocation(line: 1086, column: 21, scope: !968)
!978 = !DILocation(line: 1087, column: 16, scope: !968)
!979 = !DILocation(line: 1087, column: 20, scope: !968)
!980 = !DILocation(line: 1088, column: 16, scope: !968)
!981 = !DILocation(line: 1088, column: 22, scope: !968)
!982 = !DILocation(line: 1089, column: 16, scope: !968)
!983 = !DILocation(line: 1089, column: 21, scope: !968)
!984 = !DILocation(line: 1090, column: 20, scope: !968)
!985 = !DILocation(line: 1092, column: 5, scope: !968)
!986 = !DILocation(line: 1099, column: 41, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !406, line: 1098, column: 3)
!988 = distinct !DILexicalBlock(scope: !989, file: !406, line: 1097, column: 3)
!989 = distinct !DILexicalBlock(scope: !689, file: !406, line: 1097, column: 3)
!990 = !DILocation(line: 1097, column: 34, scope: !988)
!991 = !{!750, !753, i64 48}
!992 = !DILocation(line: 1097, column: 15, scope: !988)
!993 = !DILocation(line: 1097, column: 3, scope: !989)
!994 = !{!750, !753, i64 40}
!995 = !DILocation(line: 1099, column: 7, scope: !987)
!996 = !DILocation(line: 1100, column: 11, scope: !997)
!997 = distinct !DILexicalBlock(scope: !987, file: !406, line: 1100, column: 9)
!998 = !DILocation(line: 1100, column: 9, scope: !987)
!999 = !DILocation(line: 1102, column: 17, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !406, line: 1102, column: 5)
!1001 = distinct !DILexicalBlock(scope: !987, file: !406, line: 1102, column: 5)
!1002 = !DILocation(line: 1102, column: 5, scope: !1001)
!1003 = !{!755, !756, i64 4}
!1004 = !DILocation(line: 1104, column: 7, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !406, line: 1104, column: 7)
!1006 = distinct !DILexicalBlock(scope: !1000, file: !406, line: 1103, column: 5)
!1007 = !DILocalVariable(name: "quantum", arg: 1, scope: !1008, file: !147, line: 114, type: !1011)
!1008 = distinct !DISubprogram(name: "ScaleQuantumToChar", scope: !147, file: !147, line: 114, type: !1009, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1012)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!438, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!1012 = !{!1007}
!1013 = !DILocation(line: 0, scope: !1008, inlinedAt: !1014)
!1014 = distinct !DILocation(line: 1105, column: 24, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !406, line: 1105, column: 13)
!1016 = distinct !DILexicalBlock(scope: !1005, file: !406, line: 1104, column: 7)
!1017 = !DILocation(line: 1106, column: 28, scope: !1015)
!1018 = !{!939, !753, i64 24}
!1019 = !DILocation(line: 1106, column: 32, scope: !1015)
!1020 = !DILocation(line: 1105, column: 59, scope: !1015)
!1021 = !DILocation(line: 1106, column: 46, scope: !1015)
!1022 = !DILocation(line: 0, scope: !1008, inlinedAt: !1023)
!1023 = distinct !DILocation(line: 1107, column: 24, scope: !1015)
!1024 = !DILocation(line: 1108, column: 28, scope: !1015)
!1025 = !{!939, !753, i64 32}
!1026 = !DILocation(line: 1108, column: 33, scope: !1015)
!1027 = !DILocation(line: 1107, column: 59, scope: !1015)
!1028 = !DILocation(line: 1108, column: 47, scope: !1015)
!1029 = !DILocation(line: 1109, column: 43, scope: !1015)
!1030 = !{!755, !756, i64 2}
!1031 = !DILocation(line: 0, scope: !1008, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 1109, column: 24, scope: !1015)
!1033 = !DILocation(line: 117, column: 29, scope: !1008, inlinedAt: !1032)
!1034 = !DILocation(line: 117, column: 36, scope: !1008, inlinedAt: !1032)
!1035 = !DILocation(line: 117, column: 61, scope: !1008, inlinedAt: !1032)
!1036 = !DILocation(line: 117, column: 43, scope: !1008, inlinedAt: !1032)
!1037 = !DILocation(line: 117, column: 68, scope: !1008, inlinedAt: !1032)
!1038 = !DILocation(line: 1109, column: 14, scope: !1015)
!1039 = !DILocation(line: 1110, column: 30, scope: !1015)
!1040 = !{!939, !753, i64 56}
!1041 = !DILocation(line: 1110, column: 34, scope: !1015)
!1042 = !DILocation(line: 1109, column: 61, scope: !1015)
!1043 = !DILocation(line: 1110, column: 48, scope: !1015)
!1044 = !DILocation(line: 0, scope: !1008, inlinedAt: !1045)
!1045 = distinct !DILocation(line: 1111, column: 24, scope: !1015)
!1046 = !DILocation(line: 1112, column: 30, scope: !1015)
!1047 = !{!939, !753, i64 64}
!1048 = !DILocation(line: 1112, column: 35, scope: !1015)
!1049 = !DILocation(line: 1111, column: 61, scope: !1015)
!1050 = !DILocation(line: 1112, column: 49, scope: !1015)
!1051 = !DILocation(line: 1113, column: 43, scope: !1015)
!1052 = !{!755, !756, i64 0}
!1053 = !DILocation(line: 0, scope: !1008, inlinedAt: !1054)
!1054 = distinct !DILocation(line: 1113, column: 24, scope: !1015)
!1055 = !DILocation(line: 117, column: 29, scope: !1008, inlinedAt: !1054)
!1056 = !DILocation(line: 117, column: 36, scope: !1008, inlinedAt: !1054)
!1057 = !DILocation(line: 117, column: 61, scope: !1008, inlinedAt: !1054)
!1058 = !DILocation(line: 117, column: 43, scope: !1008, inlinedAt: !1054)
!1059 = !DILocation(line: 117, column: 68, scope: !1008, inlinedAt: !1054)
!1060 = !DILocation(line: 1113, column: 14, scope: !1015)
!1061 = !DILocation(line: 1114, column: 29, scope: !1015)
!1062 = !{!939, !753, i64 88}
!1063 = !DILocation(line: 1114, column: 33, scope: !1015)
!1064 = !DILocation(line: 1113, column: 60, scope: !1015)
!1065 = !DILocation(line: 1114, column: 47, scope: !1015)
!1066 = !DILocation(line: 0, scope: !1008, inlinedAt: !1067)
!1067 = distinct !DILocation(line: 1115, column: 24, scope: !1015)
!1068 = !DILocation(line: 1116, column: 29, scope: !1015)
!1069 = !{!939, !753, i64 96}
!1070 = !DILocation(line: 1116, column: 34, scope: !1015)
!1071 = !DILocation(line: 1115, column: 60, scope: !1015)
!1072 = !DILocation(line: 1105, column: 13, scope: !1016)
!1073 = !DILocation(line: 117, column: 10, scope: !1008, inlinedAt: !1014)
!1074 = !DILocation(line: 1106, column: 24, scope: !1015)
!1075 = !DILocation(line: 117, column: 10, scope: !1008, inlinedAt: !1032)
!1076 = !DILocation(line: 1110, column: 24, scope: !1015)
!1077 = !DILocation(line: 117, column: 10, scope: !1008, inlinedAt: !1054)
!1078 = !DILocation(line: 1114, column: 24, scope: !1015)
!1079 = !DILocation(line: 0, scope: !1008, inlinedAt: !1080)
!1080 = distinct !DILocation(line: 1123, column: 15, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1015, file: !406, line: 1117, column: 11)
!1082 = !DILocation(line: 1122, column: 34, scope: !1081)
!1083 = !DILocation(line: 1122, column: 32, scope: !1081)
!1084 = !{!939, !842, i64 8}
!1085 = !DILocation(line: 0, scope: !1008, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 1125, column: 15, scope: !1081)
!1087 = !DILocation(line: 1124, column: 36, scope: !1081)
!1088 = !DILocation(line: 1124, column: 34, scope: !1081)
!1089 = !{!939, !842, i64 40}
!1090 = !DILocation(line: 0, scope: !1008, inlinedAt: !1091)
!1091 = distinct !DILocation(line: 1127, column: 15, scope: !1081)
!1092 = !DILocation(line: 1126, column: 35, scope: !1081)
!1093 = !DILocation(line: 1126, column: 33, scope: !1081)
!1094 = !{!939, !842, i64 72}
!1095 = !DILocation(line: 1128, column: 22, scope: !1081)
!1096 = !DILocation(line: 1128, column: 27, scope: !1081)
!1097 = !DILocation(line: 1129, column: 13, scope: !1081)
!1098 = !DILocation(line: 1104, column: 72, scope: !1016)
!1099 = !DILocation(line: 1104, column: 34, scope: !1016)
!1100 = distinct !{!1100, !1004, !1101, !803, !804}
!1101 = !DILocation(line: 1130, column: 11, scope: !1005)
!1102 = !DILocation(line: 1131, column: 8, scope: !1006)
!1103 = !DILocation(line: 1102, column: 46, scope: !1000)
!1104 = distinct !{!1104, !1002, !1105, !803, !804}
!1105 = !DILocation(line: 1132, column: 5, scope: !1001)
!1106 = !DILocation(line: 1134, column: 16, scope: !987)
!1107 = !DILocalVariable(name: "image", arg: 1, scope: !1108, file: !1109, line: 27, type: !692)
!1108 = distinct !DISubprogram(name: "SetImageProgress", scope: !1109, file: !1109, line: 27, type: !1110, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1112)
!1109 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a84e9021f92665a913f9cbc20a804774")
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!455, !692, !557, !559, !560}
!1112 = !{!1107, !1113, !1114, !1115, !1116}
!1113 = !DILocalVariable(name: "tag", arg: 2, scope: !1108, file: !1109, line: 28, type: !557)
!1114 = !DILocalVariable(name: "offset", arg: 3, scope: !1108, file: !1109, line: 28, type: !559)
!1115 = !DILocalVariable(name: "extent", arg: 4, scope: !1108, file: !1109, line: 28, type: !560)
!1116 = !DILocalVariable(name: "message", scope: !1108, file: !1109, line: 31, type: !575)
!1117 = !DILocation(line: 0, scope: !1108, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 1133, column: 13, scope: !987)
!1119 = !DILocation(line: 30, column: 3, scope: !1108, inlinedAt: !1118)
!1120 = !DILocation(line: 31, column: 5, scope: !1108, inlinedAt: !1118)
!1121 = !DILocation(line: 33, column: 14, scope: !1122, inlinedAt: !1118)
!1122 = distinct !DILexicalBlock(scope: !1108, file: !1109, line: 33, column: 7)
!1123 = !{!750, !754, i64 568}
!1124 = !DILocation(line: 33, column: 31, scope: !1122, inlinedAt: !1118)
!1125 = !DILocation(line: 33, column: 7, scope: !1108, inlinedAt: !1118)
!1126 = !DILocation(line: 37, column: 1, scope: !1108, inlinedAt: !1118)
!1127 = !DILocation(line: 1135, column: 9, scope: !987)
!1128 = !DILocation(line: 1134, column: 8, scope: !987)
!1129 = !DILocation(line: 35, column: 10, scope: !1108, inlinedAt: !1118)
!1130 = !DILocation(line: 36, column: 17, scope: !1108, inlinedAt: !1118)
!1131 = !DILocation(line: 36, column: 63, scope: !1108, inlinedAt: !1118)
!1132 = !{!750, !754, i64 576}
!1133 = !DILocation(line: 36, column: 10, scope: !1108, inlinedAt: !1118)
!1134 = !DILocation(line: 1135, column: 17, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !987, file: !406, line: 1135, column: 9)
!1136 = !DILocation(line: 1097, column: 41, scope: !988)
!1137 = distinct !{!1137, !993, !1138, !803, !804}
!1138 = !DILocation(line: 1137, column: 3, scope: !989)
!1139 = !DILocation(line: 1144, column: 30, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !406, line: 1144, column: 3)
!1141 = distinct !DILexicalBlock(scope: !689, file: !406, line: 1144, column: 3)
!1142 = !DILocation(line: 1144, column: 3, scope: !1141)
!1143 = !DILocation(line: 1146, column: 27, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1140, file: !406, line: 1145, column: 3)
!1145 = !DILocation(line: 1147, column: 19, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1144, file: !406, line: 1147, column: 9)
!1147 = !DILocation(line: 1147, column: 25, scope: !1146)
!1148 = !DILocation(line: 1147, column: 30, scope: !1146)
!1149 = !DILocation(line: 1148, column: 10, scope: !1146)
!1150 = !DILocation(line: 1148, column: 29, scope: !1146)
!1151 = !DILocation(line: 1148, column: 34, scope: !1146)
!1152 = !DILocation(line: 1148, column: 52, scope: !1146)
!1153 = !DILocation(line: 1148, column: 25, scope: !1146)
!1154 = !DILocation(line: 1147, column: 9, scope: !1144)
!1155 = !DILocation(line: 1153, column: 18, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1146, file: !406, line: 1149, column: 7)
!1157 = !DILocation(line: 1153, column: 20, scope: !1156)
!1158 = !{!939, !753, i64 112}
!1159 = !DILocation(line: 1154, column: 30, scope: !1156)
!1160 = !DILocation(line: 1154, column: 18, scope: !1156)
!1161 = !DILocation(line: 1154, column: 28, scope: !1156)
!1162 = !DILocation(line: 1155, column: 18, scope: !1156)
!1163 = !DILocation(line: 1155, column: 30, scope: !1156)
!1164 = !DILocation(line: 1156, column: 18, scope: !1156)
!1165 = !DILocation(line: 1156, column: 29, scope: !1156)
!1166 = !DILocation(line: 1157, column: 14, scope: !1156)
!1167 = !DILocation(line: 1159, column: 9, scope: !1156)
!1168 = !DILocation(line: 1164, column: 17, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1144, file: !406, line: 1164, column: 9)
!1170 = !DILocation(line: 1164, column: 9, scope: !1144)
!1171 = !DILocation(line: 1167, column: 25, scope: !1169)
!1172 = !DILocation(line: 1168, column: 25, scope: !1144)
!1173 = !DILocation(line: 1169, column: 3, scope: !1144)
!1174 = distinct !{!1174, !1142, !1175, !803, !804}
!1175 = !DILocation(line: 1169, column: 3, scope: !1141)
!1176 = !DILocation(line: 1172, column: 13, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !689, file: !406, line: 1172, column: 7)
!1178 = !DILocation(line: 1172, column: 7, scope: !689)
!1179 = !DILocation(line: 1174, column: 20, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1177, file: !406, line: 1173, column: 5)
!1181 = !DILocation(line: 1175, column: 37, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !406, line: 1175, column: 7)
!1183 = distinct !DILexicalBlock(scope: !1180, file: !406, line: 1175, column: 7)
!1184 = !DILocation(line: 1175, column: 42, scope: !1182)
!1185 = !DILocation(line: 1175, column: 7, scope: !1183)
!1186 = !DILocation(line: 1182, column: 7, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1180, file: !406, line: 1182, column: 7)
!1188 = !DILocation(line: 1177, column: 22, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !406, line: 1177, column: 13)
!1190 = distinct !DILexicalBlock(scope: !1182, file: !406, line: 1176, column: 7)
!1191 = !DILocation(line: 1177, column: 38, scope: !1189)
!1192 = !DILocation(line: 1177, column: 28, scope: !1189)
!1193 = !DILocation(line: 1177, column: 13, scope: !1190)
!1194 = distinct !{!1194, !1185, !1195, !803, !804}
!1195 = !DILocation(line: 1180, column: 7, scope: !1183)
!1196 = !DILocation(line: 1184, column: 22, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !406, line: 1184, column: 13)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !406, line: 1183, column: 7)
!1199 = distinct !DILexicalBlock(scope: !1187, file: !406, line: 1182, column: 7)
!1200 = !DILocation(line: 1184, column: 42, scope: !1197)
!1201 = !DILocation(line: 1184, column: 28, scope: !1197)
!1202 = !DILocation(line: 1184, column: 13, scope: !1198)
!1203 = !DILocation(line: 1182, column: 41, scope: !1199)
!1204 = !DILocation(line: 1182, column: 46, scope: !1199)
!1205 = distinct !{!1205, !1186, !1206, !803, !804}
!1206 = !DILocation(line: 1187, column: 7, scope: !1187)
!1207 = !DILocation(line: 1189, column: 18, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !689, file: !406, line: 1189, column: 7)
!1209 = !DILocation(line: 1189, column: 7, scope: !689)
!1210 = !DILocation(line: 1191, column: 30, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1208, file: !406, line: 1190, column: 5)
!1212 = !DILocation(line: 1191, column: 34, scope: !1211)
!1213 = !DILocation(line: 1191, column: 49, scope: !1211)
!1214 = !DILocation(line: 1191, column: 53, scope: !1211)
!1215 = !DILocation(line: 1191, column: 40, scope: !1211)
!1216 = !DILocation(line: 1191, column: 17, scope: !1211)
!1217 = !DILocation(line: 1193, column: 10, scope: !1211)
!1218 = !DILocation(line: 1193, column: 19, scope: !1211)
!1219 = !DILocation(line: 1192, column: 54, scope: !1211)
!1220 = !DILocalVariable(name: "value", arg: 1, scope: !1221, file: !1222, line: 363, type: !1225)
!1221 = distinct !DISubprogram(name: "ScaleCharToQuantum", scope: !1222, file: !1222, line: 363, type: !1223, scopeLine: 364, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1226)
!1222 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!431, !1225}
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!1226 = !{!1220}
!1227 = !DILocation(line: 0, scope: !1221, inlinedAt: !1228)
!1228 = distinct !DILocation(line: 1192, column: 35, scope: !1211)
!1229 = !DILocation(line: 366, column: 26, scope: !1221, inlinedAt: !1228)
!1230 = !DILocation(line: 366, column: 25, scope: !1221, inlinedAt: !1228)
!1231 = !DILocation(line: 1192, column: 18, scope: !1211)
!1232 = !DILocation(line: 1192, column: 14, scope: !1211)
!1233 = !DILocation(line: 1192, column: 17, scope: !1211)
!1234 = !{!1235, !842, i64 32}
!1235 = !{!"_MagickPixelPacket", !751, i64 0, !751, i64 4, !751, i64 8, !757, i64 16, !753, i64 24, !842, i64 32, !842, i64 36, !842, i64 40, !842, i64 44, !842, i64 48}
!1236 = !DILocation(line: 1194, column: 30, scope: !1211)
!1237 = !DILocation(line: 1194, column: 36, scope: !1211)
!1238 = !DILocation(line: 1194, column: 51, scope: !1211)
!1239 = !DILocation(line: 1194, column: 57, scope: !1211)
!1240 = !DILocation(line: 1194, column: 42, scope: !1211)
!1241 = !DILocation(line: 1194, column: 17, scope: !1211)
!1242 = !DILocation(line: 1196, column: 10, scope: !1211)
!1243 = !DILocation(line: 1196, column: 19, scope: !1211)
!1244 = !DILocation(line: 1195, column: 56, scope: !1211)
!1245 = !DILocation(line: 0, scope: !1221, inlinedAt: !1246)
!1246 = distinct !DILocation(line: 1195, column: 37, scope: !1211)
!1247 = !DILocation(line: 366, column: 26, scope: !1221, inlinedAt: !1246)
!1248 = !DILocation(line: 366, column: 25, scope: !1221, inlinedAt: !1246)
!1249 = !DILocation(line: 1195, column: 20, scope: !1211)
!1250 = !DILocation(line: 1195, column: 14, scope: !1211)
!1251 = !DILocation(line: 1195, column: 19, scope: !1211)
!1252 = !{!1235, !842, i64 36}
!1253 = !DILocation(line: 1197, column: 30, scope: !1211)
!1254 = !DILocation(line: 1197, column: 35, scope: !1211)
!1255 = !DILocation(line: 1197, column: 50, scope: !1211)
!1256 = !DILocation(line: 1197, column: 55, scope: !1211)
!1257 = !DILocation(line: 1197, column: 41, scope: !1211)
!1258 = !DILocation(line: 1197, column: 17, scope: !1211)
!1259 = !DILocation(line: 1199, column: 10, scope: !1211)
!1260 = !DILocation(line: 1199, column: 19, scope: !1211)
!1261 = !DILocation(line: 1198, column: 55, scope: !1211)
!1262 = !DILocation(line: 0, scope: !1221, inlinedAt: !1263)
!1263 = distinct !DILocation(line: 1198, column: 36, scope: !1211)
!1264 = !DILocation(line: 366, column: 26, scope: !1221, inlinedAt: !1263)
!1265 = !DILocation(line: 366, column: 25, scope: !1221, inlinedAt: !1263)
!1266 = !DILocation(line: 1198, column: 19, scope: !1211)
!1267 = !DILocation(line: 1198, column: 14, scope: !1211)
!1268 = !DILocation(line: 1198, column: 18, scope: !1211)
!1269 = !{!1235, !842, i64 40}
!1270 = !DILocation(line: 1200, column: 5, scope: !1211)
!1271 = !DILocation(line: 1204, column: 30, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1273, file: !406, line: 1204, column: 3)
!1273 = distinct !DILexicalBlock(scope: !689, file: !406, line: 1204, column: 3)
!1274 = !DILocation(line: 1204, column: 3, scope: !1273)
!1275 = !DILocation(line: 1206, column: 27, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1272, file: !406, line: 1205, column: 3)
!1277 = !DILocation(line: 1207, column: 25, scope: !1276)
!1278 = distinct !{!1278, !1274, !1279, !803, !804}
!1279 = !DILocation(line: 1208, column: 3, scope: !1273)
!1280 = !DILocation(line: 1209, column: 3, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !689, file: !406, line: 1209, column: 3)
!1282 = !DILocation(line: 1211, column: 49, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1284, file: !406, line: 1210, column: 3)
!1284 = distinct !DILexicalBlock(scope: !1281, file: !406, line: 1209, column: 3)
!1285 = !DILocation(line: 1211, column: 26, scope: !1283)
!1286 = !DILocation(line: 1211, column: 15, scope: !1283)
!1287 = !DILocation(line: 1212, column: 53, scope: !1283)
!1288 = !DILocation(line: 1212, column: 30, scope: !1283)
!1289 = !DILocation(line: 1212, column: 17, scope: !1283)
!1290 = !DILocation(line: 1209, column: 32, scope: !1284)
!1291 = !DILocation(line: 1209, column: 15, scope: !1284)
!1292 = distinct !{!1292, !1280, !1293, !803, !804}
!1293 = !DILocation(line: 1213, column: 3, scope: !1281)
!1294 = !DILocation(line: 1215, column: 1, scope: !689)
!1295 = !DISubprogram(name: "LogMagickEvent", scope: !369, file: !369, line: 83, type: !1296, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1301)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!455, !1298, !557, !557, !1300, !557, null}
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !369, line: 58, baseType: !368)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!1301 = !{}
!1302 = !DISubprogram(name: "GetMagickPixelPacket", scope: !326, file: !326, line: 185, type: !1303, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1301)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{null, !692, !695}
!1305 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1306, file: !1306, line: 42, type: !1307, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1301)
!1306 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!403, !1300, !1300}
!1309 = !DISubprogram(name: "RelinquishMagickMemory", scope: !1306, file: !1306, line: 51, type: !1310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1301)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!403, !403}
!1312 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1313, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1301)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!455, !709, !557, !557, !1300, !1315, !557, !557, null}
!1315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!1316 = distinct !DISubprogram(name: "InitializeHistogram", scope: !406, file: !406, line: 1243, type: !1317, scopeLine: 1245, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1320)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{null, !692, !1319, !709}
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!1320 = !{!1321, !1322, !1323, !1324, !1325, !1326, !1327}
!1321 = !DILocalVariable(name: "image", arg: 1, scope: !1316, file: !406, line: 1243, type: !692)
!1322 = !DILocalVariable(name: "histogram", arg: 2, scope: !1316, file: !406, line: 1243, type: !1319)
!1323 = !DILocalVariable(name: "exception", arg: 3, scope: !1316, file: !406, line: 1244, type: !709)
!1324 = !DILocalVariable(name: "p", scope: !1316, file: !406, line: 1247, type: !425)
!1325 = !DILocalVariable(name: "i", scope: !1316, file: !406, line: 1250, type: !396)
!1326 = !DILocalVariable(name: "x", scope: !1316, file: !406, line: 1251, type: !396)
!1327 = !DILocalVariable(name: "y", scope: !1316, file: !406, line: 1254, type: !396)
!1328 = !DILocation(line: 0, scope: !1316)
!1329 = !DILocation(line: 1259, column: 3, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1316, file: !406, line: 1259, column: 3)
!1331 = !DILocation(line: 1267, column: 41, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1333, file: !406, line: 1266, column: 3)
!1333 = distinct !DILexicalBlock(scope: !1334, file: !406, line: 1265, column: 3)
!1334 = distinct !DILexicalBlock(scope: !1316, file: !406, line: 1265, column: 3)
!1335 = !DILocation(line: 1265, column: 34, scope: !1333)
!1336 = !DILocation(line: 1265, column: 15, scope: !1333)
!1337 = !DILocation(line: 1265, column: 3, scope: !1334)
!1338 = !DILocation(line: 1261, column: 5, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !1340, file: !406, line: 1260, column: 3)
!1340 = distinct !DILexicalBlock(scope: !1330, file: !406, line: 1259, column: 3)
!1341 = !DILocation(line: 1261, column: 22, scope: !1339)
!1342 = !DILocation(line: 1262, column: 5, scope: !1339)
!1343 = !DILocation(line: 1262, column: 24, scope: !1339)
!1344 = !DILocation(line: 1263, column: 5, scope: !1339)
!1345 = !DILocation(line: 1263, column: 23, scope: !1339)
!1346 = !DILocation(line: 1259, column: 24, scope: !1340)
!1347 = !DILocation(line: 1259, column: 15, scope: !1340)
!1348 = distinct !{!1348, !1329, !1349, !803, !804}
!1349 = !DILocation(line: 1264, column: 3, scope: !1330)
!1350 = !DILocation(line: 1267, column: 7, scope: !1332)
!1351 = !DILocation(line: 1268, column: 11, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !1332, file: !406, line: 1268, column: 9)
!1353 = !DILocation(line: 1268, column: 9, scope: !1332)
!1354 = !DILocation(line: 1270, column: 36, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1356, file: !406, line: 1270, column: 5)
!1356 = distinct !DILexicalBlock(scope: !1332, file: !406, line: 1270, column: 5)
!1357 = !DILocation(line: 1270, column: 17, scope: !1355)
!1358 = !DILocation(line: 1270, column: 5, scope: !1356)
!1359 = !DILocation(line: 1272, column: 51, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !1355, file: !406, line: 1271, column: 5)
!1361 = !DILocation(line: 0, scope: !1008, inlinedAt: !1362)
!1362 = distinct !DILocation(line: 1272, column: 32, scope: !1360)
!1363 = !DILocation(line: 117, column: 29, scope: !1008, inlinedAt: !1362)
!1364 = !DILocation(line: 117, column: 36, scope: !1008, inlinedAt: !1362)
!1365 = !DILocation(line: 117, column: 61, scope: !1008, inlinedAt: !1362)
!1366 = !DILocation(line: 117, column: 43, scope: !1008, inlinedAt: !1362)
!1367 = !DILocation(line: 117, column: 68, scope: !1008, inlinedAt: !1362)
!1368 = !DILocation(line: 1272, column: 22, scope: !1360)
!1369 = !DILocation(line: 1272, column: 7, scope: !1360)
!1370 = !DILocation(line: 1272, column: 67, scope: !1360)
!1371 = !DILocation(line: 1273, column: 53, scope: !1360)
!1372 = !DILocation(line: 0, scope: !1008, inlinedAt: !1373)
!1373 = distinct !DILocation(line: 1273, column: 34, scope: !1360)
!1374 = !DILocation(line: 117, column: 29, scope: !1008, inlinedAt: !1373)
!1375 = !DILocation(line: 117, column: 36, scope: !1008, inlinedAt: !1373)
!1376 = !DILocation(line: 117, column: 61, scope: !1008, inlinedAt: !1373)
!1377 = !DILocation(line: 117, column: 43, scope: !1008, inlinedAt: !1373)
!1378 = !DILocation(line: 117, column: 68, scope: !1008, inlinedAt: !1373)
!1379 = !DILocation(line: 1273, column: 24, scope: !1360)
!1380 = !DILocation(line: 1273, column: 7, scope: !1360)
!1381 = !DILocation(line: 1273, column: 71, scope: !1360)
!1382 = !DILocation(line: 1274, column: 52, scope: !1360)
!1383 = !DILocation(line: 0, scope: !1008, inlinedAt: !1384)
!1384 = distinct !DILocation(line: 1274, column: 33, scope: !1360)
!1385 = !DILocation(line: 117, column: 29, scope: !1008, inlinedAt: !1384)
!1386 = !DILocation(line: 117, column: 36, scope: !1008, inlinedAt: !1384)
!1387 = !DILocation(line: 117, column: 61, scope: !1008, inlinedAt: !1384)
!1388 = !DILocation(line: 117, column: 43, scope: !1008, inlinedAt: !1384)
!1389 = !DILocation(line: 117, column: 68, scope: !1008, inlinedAt: !1384)
!1390 = !DILocation(line: 1274, column: 23, scope: !1360)
!1391 = !DILocation(line: 1274, column: 7, scope: !1360)
!1392 = !DILocation(line: 1274, column: 69, scope: !1360)
!1393 = !DILocation(line: 1275, column: 8, scope: !1360)
!1394 = !DILocation(line: 1270, column: 46, scope: !1355)
!1395 = distinct !{!1395, !1358, !1396, !803, !804}
!1396 = !DILocation(line: 1276, column: 5, scope: !1356)
!1397 = !DILocation(line: 1265, column: 41, scope: !1333)
!1398 = distinct !{!1398, !1337, !1399, !803, !804}
!1399 = !DILocation(line: 1277, column: 3, scope: !1334)
!1400 = !DILocation(line: 1278, column: 1, scope: !1316)
!1401 = distinct !DISubprogram(name: "OptimalTau", scope: !406, file: !406, line: 1512, type: !1402, scopeLine: 1515, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1406)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!416, !1404, !694, !694, !694, !694, !401}
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!1406 = !{!1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1434}
!1407 = !DILocalVariable(name: "histogram", arg: 1, scope: !1401, file: !406, line: 1512, type: !1404)
!1408 = !DILocalVariable(name: "max_tau", arg: 2, scope: !1401, file: !406, line: 1512, type: !694)
!1409 = !DILocalVariable(name: "min_tau", arg: 3, scope: !1401, file: !406, line: 1513, type: !694)
!1410 = !DILocalVariable(name: "delta_tau", arg: 4, scope: !1401, file: !406, line: 1513, type: !694)
!1411 = !DILocalVariable(name: "smooth_threshold", arg: 5, scope: !1401, file: !406, line: 1513, type: !694)
!1412 = !DILocalVariable(name: "extrema", arg: 6, scope: !1401, file: !406, line: 1514, type: !401)
!1413 = !DILocalVariable(name: "list", scope: !1401, file: !406, line: 1517, type: !642)
!1414 = !DILocalVariable(name: "node", scope: !1401, file: !406, line: 1518, type: !643)
!1415 = !DILocalVariable(name: "root", scope: !1401, file: !406, line: 1519, type: !643)
!1416 = !DILocalVariable(name: "peak", scope: !1401, file: !406, line: 1522, type: !455)
!1417 = !DILocalVariable(name: "average_tau", scope: !1401, file: !406, line: 1525, type: !416)
!1418 = !DILocalVariable(name: "derivative", scope: !1401, file: !406, line: 1526, type: !666)
!1419 = !DILocalVariable(name: "second_derivative", scope: !1401, file: !406, line: 1527, type: !666)
!1420 = !DILocalVariable(name: "tau", scope: !1401, file: !406, line: 1528, type: !416)
!1421 = !DILocalVariable(name: "value", scope: !1401, file: !406, line: 1529, type: !416)
!1422 = !DILocalVariable(name: "i", scope: !1401, file: !406, line: 1532, type: !396)
!1423 = !DILocalVariable(name: "x", scope: !1401, file: !406, line: 1533, type: !396)
!1424 = !DILocalVariable(name: "count", scope: !1401, file: !406, line: 1536, type: !450)
!1425 = !DILocalVariable(name: "number_crossings", scope: !1401, file: !406, line: 1537, type: !450)
!1426 = !DILocalVariable(name: "index", scope: !1401, file: !406, line: 1540, type: !396)
!1427 = !DILocalVariable(name: "j", scope: !1401, file: !406, line: 1541, type: !396)
!1428 = !DILocalVariable(name: "k", scope: !1401, file: !406, line: 1542, type: !396)
!1429 = !DILocalVariable(name: "number_nodes", scope: !1401, file: !406, line: 1543, type: !396)
!1430 = !DILocalVariable(name: "zero_crossing", scope: !1401, file: !406, line: 1546, type: !655)
!1431 = !DILocalVariable(name: "message", scope: !1432, file: !406, line: 1573, type: !488)
!1432 = distinct !DILexicalBlock(scope: !1433, file: !406, line: 1573, column: 5)
!1433 = distinct !DILexicalBlock(scope: !1401, file: !406, line: 1571, column: 7)
!1434 = !DILocalVariable(name: "exception", scope: !1432, file: !406, line: 1573, type: !583)
!1435 = !DILocation(line: 0, scope: !1401)
!1436 = !DILocation(line: 1539, column: 3, scope: !1401)
!1437 = !DILocation(line: 1551, column: 26, scope: !1401)
!1438 = !DILocation(line: 1553, column: 12, scope: !1439)
!1439 = distinct !DILexicalBlock(scope: !1401, file: !406, line: 1553, column: 7)
!1440 = !DILocation(line: 1553, column: 7, scope: !1401)
!1441 = !DILocation(line: 1558, column: 27, scope: !1401)
!1442 = !DILocation(line: 1558, column: 36, scope: !1401)
!1443 = !DILocation(line: 1558, column: 9, scope: !1401)
!1444 = !DILocation(line: 1558, column: 47, scope: !1401)
!1445 = !DILocation(line: 1559, column: 34, scope: !1401)
!1446 = !DILocation(line: 1561, column: 21, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1401, file: !406, line: 1561, column: 7)
!1448 = !DILocation(line: 1561, column: 7, scope: !1401)
!1449 = !DILocation(line: 1563, column: 15, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !1451, file: !406, line: 1563, column: 3)
!1451 = distinct !DILexicalBlock(scope: !1401, file: !406, line: 1563, column: 3)
!1452 = !DILocation(line: 1563, column: 3, scope: !1451)
!1453 = !DILocation(line: 1564, column: 5, scope: !1450)
!1454 = !DILocation(line: 1564, column: 25, scope: !1450)
!1455 = !{!1456, !842, i64 0}
!1456 = !{!"_ZeroCrossing", !842, i64 0, !751, i64 4, !751, i64 1028}
!1457 = !DILocation(line: 1563, column: 35, scope: !1450)
!1458 = distinct !{!1458, !1452, !1459, !803, !804}
!1459 = !DILocation(line: 1564, column: 31, scope: !1451)
!1460 = !DILocation(line: 1568, column: 33, scope: !1401)
!1461 = !DILocation(line: 1569, column: 40, scope: !1401)
!1462 = !DILocation(line: 1571, column: 19, scope: !1433)
!1463 = !DILocation(line: 1571, column: 47, scope: !1433)
!1464 = !DILocation(line: 1576, column: 25, scope: !1465)
!1465 = distinct !DILexicalBlock(scope: !1466, file: !406, line: 1576, column: 3)
!1466 = distinct !DILexicalBlock(scope: !1401, file: !406, line: 1576, column: 3)
!1467 = !DILocation(line: 1576, column: 3, scope: !1466)
!1468 = !DILocation(line: 1573, column: 5, scope: !1432)
!1469 = !{!765, !765, i64 0}
!1470 = !DILocation(line: 0, scope: !1432)
!1471 = !DILocation(line: 1578, column: 5, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !1465, file: !406, line: 1577, column: 3)
!1473 = !DILocation(line: 1578, column: 25, scope: !1472)
!1474 = !DILocation(line: 1579, column: 47, scope: !1472)
!1475 = !DILocalVariable(name: "histogram", arg: 1, scope: !1476, file: !406, line: 1720, type: !1404)
!1476 = distinct !DISubprogram(name: "ScaleSpace", scope: !406, file: !406, line: 1720, type: !1477, scopeLine: 1722, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1480)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{null, !1404, !1479, !666}
!1479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!1480 = !{!1475, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1492}
!1481 = !DILocalVariable(name: "tau", arg: 2, scope: !1476, file: !406, line: 1720, type: !1479)
!1482 = !DILocalVariable(name: "scale_histogram", arg: 3, scope: !1476, file: !406, line: 1721, type: !666)
!1483 = !DILocalVariable(name: "alpha", scope: !1476, file: !406, line: 1724, type: !467)
!1484 = !DILocalVariable(name: "beta", scope: !1476, file: !406, line: 1725, type: !467)
!1485 = !DILocalVariable(name: "gamma", scope: !1476, file: !406, line: 1726, type: !667)
!1486 = !DILocalVariable(name: "sum", scope: !1476, file: !406, line: 1727, type: !467)
!1487 = !DILocalVariable(name: "u", scope: !1476, file: !406, line: 1730, type: !396)
!1488 = !DILocalVariable(name: "x", scope: !1476, file: !406, line: 1731, type: !396)
!1489 = !DILocalVariable(name: "message", scope: !1490, file: !406, line: 1735, type: !488)
!1490 = distinct !DILexicalBlock(scope: !1491, file: !406, line: 1735, column: 5)
!1491 = distinct !DILexicalBlock(scope: !1476, file: !406, line: 1734, column: 7)
!1492 = !DILocalVariable(name: "exception", scope: !1490, file: !406, line: 1735, type: !583)
!1493 = !DILocation(line: 0, scope: !1476, inlinedAt: !1494)
!1494 = distinct !DILocation(line: 1579, column: 5, scope: !1472)
!1495 = !DILocation(line: 1733, column: 20, scope: !1476, inlinedAt: !1494)
!1496 = !DILocation(line: 1734, column: 13, scope: !1491, inlinedAt: !1494)
!1497 = !DILocation(line: 1734, column: 7, scope: !1476, inlinedAt: !1494)
!1498 = !DILocation(line: 1735, column: 5, scope: !1490, inlinedAt: !1494)
!1499 = !DILocation(line: 0, scope: !1490, inlinedAt: !1494)
!1500 = !DILocation(line: 1737, column: 18, scope: !1476, inlinedAt: !1494)
!1501 = !DILocation(line: 1737, column: 22, scope: !1476, inlinedAt: !1494)
!1502 = !DILocation(line: 1739, column: 13, scope: !1503, inlinedAt: !1494)
!1503 = distinct !DILexicalBlock(scope: !1504, file: !406, line: 1738, column: 3)
!1504 = distinct !DILexicalBlock(scope: !1476, file: !406, line: 1738, column: 3)
!1505 = !{!757, !757, i64 0}
!1506 = !DILocation(line: 1737, column: 13, scope: !1476, inlinedAt: !1494)
!1507 = !DILocation(line: 1740, column: 3, scope: !1508, inlinedAt: !1494)
!1508 = distinct !DILexicalBlock(scope: !1476, file: !406, line: 1740, column: 3)
!1509 = !DILocation(line: 1742, column: 32, scope: !1510, inlinedAt: !1494)
!1510 = distinct !DILexicalBlock(scope: !1511, file: !406, line: 1741, column: 3)
!1511 = distinct !DILexicalBlock(scope: !1508, file: !406, line: 1740, column: 3)
!1512 = !DILocation(line: 1742, column: 31, scope: !1510, inlinedAt: !1494)
!1513 = !DILocation(line: 1742, column: 33, scope: !1510, inlinedAt: !1494)
!1514 = !DILocation(line: 1742, column: 14, scope: !1510, inlinedAt: !1494)
!1515 = !DILocation(line: 1742, column: 5, scope: !1510, inlinedAt: !1494)
!1516 = !DILocation(line: 1742, column: 13, scope: !1510, inlinedAt: !1494)
!1517 = !DILocation(line: 1743, column: 18, scope: !1518, inlinedAt: !1494)
!1518 = distinct !DILexicalBlock(scope: !1510, file: !406, line: 1743, column: 9)
!1519 = !DILocation(line: 1743, column: 9, scope: !1510, inlinedAt: !1494)
!1520 = distinct !{!1520, !1507, !1521, !803, !804}
!1521 = !DILocation(line: 1745, column: 3, scope: !1508, inlinedAt: !1494)
!1522 = !DILocation(line: 1736, column: 17, scope: !1476, inlinedAt: !1494)
!1523 = !DILocation(line: 1736, column: 12, scope: !1476, inlinedAt: !1494)
!1524 = !DILocation(line: 1746, column: 3, scope: !1525, inlinedAt: !1494)
!1525 = distinct !DILexicalBlock(scope: !1476, file: !406, line: 1746, column: 3)
!1526 = !DILocation(line: 1749, column: 5, scope: !1527, inlinedAt: !1494)
!1527 = distinct !DILexicalBlock(scope: !1528, file: !406, line: 1749, column: 5)
!1528 = distinct !DILexicalBlock(scope: !1529, file: !406, line: 1747, column: 3)
!1529 = distinct !DILexicalBlock(scope: !1525, file: !406, line: 1746, column: 3)
!1530 = !DILocation(line: 1750, column: 21, scope: !1531, inlinedAt: !1494)
!1531 = distinct !DILexicalBlock(scope: !1527, file: !406, line: 1749, column: 5)
!1532 = !DILocation(line: 1750, column: 12, scope: !1531, inlinedAt: !1494)
!1533 = !DILocation(line: 1750, column: 61, scope: !1531, inlinedAt: !1494)
!1534 = !DILocalVariable(name: "x", arg: 1, scope: !1535, file: !406, line: 700, type: !1405)
!1535 = distinct !DISubprogram(name: "MagickAbsoluteValue", scope: !406, file: !406, line: 700, type: !1536, scopeLine: 701, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1538)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!396, !1405}
!1538 = !{!1534}
!1539 = !DILocation(line: 0, scope: !1535, inlinedAt: !1540)
!1540 = distinct !DILocation(line: 1750, column: 40, scope: !1531, inlinedAt: !1494)
!1541 = !DILocation(line: 702, column: 7, scope: !1535, inlinedAt: !1540)
!1542 = !DILocation(line: 1750, column: 34, scope: !1531, inlinedAt: !1494)
!1543 = !DILocation(line: 1750, column: 10, scope: !1531, inlinedAt: !1494)
!1544 = !DILocation(line: 1749, column: 26, scope: !1531, inlinedAt: !1494)
!1545 = !DILocation(line: 1749, column: 17, scope: !1531, inlinedAt: !1494)
!1546 = distinct !{!1546, !1526, !1547, !803, !804}
!1547 = !DILocation(line: 1750, column: 64, scope: !1527, inlinedAt: !1494)
!1548 = !DILocation(line: 1751, column: 47, scope: !1528, inlinedAt: !1494)
!1549 = !DILocation(line: 1751, column: 24, scope: !1528, inlinedAt: !1494)
!1550 = !DILocation(line: 1751, column: 5, scope: !1528, inlinedAt: !1494)
