; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/common/set.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/common/set.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, float, float, float, i32, float, i32, i32, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }

!18 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ded33432ae52d5d9fe6b2433f07446f2")
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 288, elements: !26)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !22, line: 25, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !24, line: 40, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !{!27, !28}
!27 = !DISubrange(count: 6)
!28 = !DISubrange(count: 3)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "quant8_scan", scope: !2, file: !18, line: 45, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !36)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 24, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !24, line: 38, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!37}
!37 = !DISubrange(count: 16)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "dequant8_scale", scope: !2, file: !18, line: 49, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 288, elements: !41)
!41 = !{!27, !27}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "quant8_scale", scope: !2, file: !18, line: 58, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 576, elements: !41)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "x264_cqm_jvt4i", scope: !2, file: !6, line: 189, type: !31, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "x264_cqm_jvt4p", scope: !2, file: !6, line: 196, type: !31, isLocal: true, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "x264_cqm_jvt8i", scope: !2, file: !6, line: 203, type: !51, isLocal: true, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 64)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "x264_cqm_jvt8p", scope: !2, file: !6, line: 214, type: !51, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 144, elements: !26)
!57 = !{i32 7, !"Dwarf Version", i32 5}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 4}
!60 = !{i32 7, !"PIC Level", i32 2}
!61 = !{i32 7, !"PIE Level", i32 2}
!62 = !{i32 7, !"uwtable", i32 2}
!63 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!64 = distinct !DISubprogram(name: "x264_cqm_init", scope: !18, file: !18, line: 68, type: !65, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1366)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !68}
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !72, line: 381, size: 266752, elements: !73)
!72 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!73 = !{!74, !242, !246, !247, !248, !249, !250, !251, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !386, !388, !414, !416, !417, !418, !424, !428, !429, !430, !434, !438, !439, !440, !445, !448, !449, !527, !544, !708, !709, !710, !711, !715, !716, !717, !718, !719, !720, !721, !736, !930, !934, !995, !998, !1000, !1002, !1003, !1006, !1011, !1020, !1021, !1029, !1031, !1036, !1112, !1198, !1242, !1264, !1313, !1342}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !71, file: !72, line: 384, baseType: !75, size: 5632)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !70, line: 376, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !70, line: 176, size: 5632, elements: !77)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !121, !123, !124, !125, !126, !128, !129, !143, !144, !145, !146, !147, !178, !220, !221, !222, !223, !224, !225, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !76, file: !70, line: 179, baseType: !7, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !76, file: !70, line: 180, baseType: !67, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !76, file: !70, line: 181, baseType: !67, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !76, file: !70, line: 182, baseType: !67, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !76, file: !70, line: 183, baseType: !67, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !76, file: !70, line: 186, baseType: !67, size: 32, offset: 160)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !76, file: !70, line: 187, baseType: !67, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !76, file: !70, line: 188, baseType: !67, size: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !76, file: !70, line: 189, baseType: !67, size: 32, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !76, file: !70, line: 190, baseType: !67, size: 32, offset: 288)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !76, file: !70, line: 198, baseType: !67, size: 32, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !76, file: !70, line: 215, baseType: !90, size: 288, offset: 352)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !70, line: 200, size: 288, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !90, file: !70, line: 203, baseType: !67, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !90, file: !70, line: 204, baseType: !67, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !90, file: !70, line: 206, baseType: !67, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !90, file: !70, line: 209, baseType: !67, size: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !90, file: !70, line: 210, baseType: !67, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !90, file: !70, line: 211, baseType: !67, size: 32, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !90, file: !70, line: 212, baseType: !67, size: 32, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !90, file: !70, line: 213, baseType: !67, size: 32, offset: 224)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !90, file: !70, line: 214, baseType: !67, size: 32, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !76, file: !70, line: 218, baseType: !67, size: 32, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !76, file: !70, line: 219, baseType: !67, size: 32, offset: 672)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !76, file: !70, line: 220, baseType: !67, size: 32, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !76, file: !70, line: 221, baseType: !67, size: 32, offset: 736)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !76, file: !70, line: 222, baseType: !67, size: 32, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !76, file: !70, line: 224, baseType: !67, size: 32, offset: 800)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !76, file: !70, line: 225, baseType: !67, size: 32, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !76, file: !70, line: 226, baseType: !67, size: 32, offset: 864)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !76, file: !70, line: 227, baseType: !67, size: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !76, file: !70, line: 229, baseType: !67, size: 32, offset: 928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !76, file: !70, line: 230, baseType: !67, size: 32, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !76, file: !70, line: 231, baseType: !67, size: 32, offset: 992)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !76, file: !70, line: 233, baseType: !67, size: 32, offset: 1024)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !76, file: !70, line: 234, baseType: !67, size: 32, offset: 1056)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !76, file: !70, line: 236, baseType: !67, size: 32, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !76, file: !70, line: 237, baseType: !67, size: 32, offset: 1120)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !76, file: !70, line: 239, baseType: !67, size: 32, offset: 1152)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !76, file: !70, line: 240, baseType: !119, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !76, file: !70, line: 241, baseType: !122, size: 128, offset: 1280)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !36)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !76, file: !70, line: 242, baseType: !122, size: 128, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !76, file: !70, line: 243, baseType: !122, size: 128, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !76, file: !70, line: 244, baseType: !122, size: 128, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !76, file: !70, line: 245, baseType: !127, size: 512, offset: 1792)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !52)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !76, file: !70, line: 246, baseType: !127, size: 512, offset: 2304)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !76, file: !70, line: 249, baseType: !130, size: 64, offset: 2816)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !67, !133, !135}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !137)
!137 = !{!138, !140, !141, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !136, file: !139, baseType: !7, size: 32)
!139 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/set.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !136, file: !139, baseType: !7, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !136, file: !139, baseType: !14, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !136, file: !139, baseType: !14, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !76, file: !70, line: 250, baseType: !14, size: 64, offset: 2880)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !76, file: !70, line: 251, baseType: !67, size: 32, offset: 2944)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !76, file: !70, line: 252, baseType: !67, size: 32, offset: 2976)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !76, file: !70, line: 253, baseType: !119, size: 64, offset: 3008)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !76, file: !70, line: 287, baseType: !148, size: 800, offset: 3072)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !70, line: 256, size: 800, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !170, !171, !172, !176, !177}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !148, file: !70, line: 258, baseType: !7, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !148, file: !70, line: 259, baseType: !7, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !148, file: !70, line: 261, baseType: !67, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !148, file: !70, line: 262, baseType: !67, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !148, file: !70, line: 263, baseType: !67, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !148, file: !70, line: 264, baseType: !67, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !148, file: !70, line: 265, baseType: !67, size: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !148, file: !70, line: 267, baseType: !67, size: 32, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !148, file: !70, line: 268, baseType: !67, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !148, file: !70, line: 269, baseType: !67, size: 32, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !148, file: !70, line: 270, baseType: !67, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !148, file: !70, line: 271, baseType: !67, size: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !148, file: !70, line: 272, baseType: !67, size: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !148, file: !70, line: 273, baseType: !67, size: 32, offset: 416)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !148, file: !70, line: 274, baseType: !67, size: 32, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !148, file: !70, line: 275, baseType: !67, size: 32, offset: 480)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !148, file: !70, line: 276, baseType: !67, size: 32, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !148, file: !70, line: 277, baseType: !67, size: 32, offset: 544)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !148, file: !70, line: 278, baseType: !169, size: 32, offset: 576)
!169 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !148, file: !70, line: 279, baseType: !169, size: 32, offset: 608)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !148, file: !70, line: 280, baseType: !67, size: 32, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !148, file: !70, line: 283, baseType: !173, size: 64, offset: 672)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 2)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !148, file: !70, line: 285, baseType: !67, size: 32, offset: 736)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !148, file: !70, line: 286, baseType: !67, size: 32, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !76, file: !70, line: 327, baseType: !179, size: 1152, offset: 3904)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !70, line: 290, size: 1152, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !218, !219}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !179, file: !70, line: 292, baseType: !67, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !179, file: !70, line: 294, baseType: !67, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !179, file: !70, line: 295, baseType: !67, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !179, file: !70, line: 296, baseType: !67, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !179, file: !70, line: 297, baseType: !67, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !179, file: !70, line: 299, baseType: !67, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !179, file: !70, line: 300, baseType: !169, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !179, file: !70, line: 301, baseType: !169, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !179, file: !70, line: 302, baseType: !169, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !179, file: !70, line: 303, baseType: !67, size: 32, offset: 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !179, file: !70, line: 304, baseType: !67, size: 32, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !179, file: !70, line: 305, baseType: !169, size: 32, offset: 352)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !179, file: !70, line: 306, baseType: !169, size: 32, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !179, file: !70, line: 307, baseType: !169, size: 32, offset: 416)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !179, file: !70, line: 309, baseType: !67, size: 32, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !179, file: !70, line: 310, baseType: !169, size: 32, offset: 480)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !179, file: !70, line: 311, baseType: !67, size: 32, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !179, file: !70, line: 312, baseType: !67, size: 32, offset: 544)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !179, file: !70, line: 315, baseType: !67, size: 32, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !179, file: !70, line: 316, baseType: !119, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !179, file: !70, line: 317, baseType: !67, size: 32, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !179, file: !70, line: 318, baseType: !119, size: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !179, file: !70, line: 321, baseType: !169, size: 32, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !179, file: !70, line: 322, baseType: !169, size: 32, offset: 864)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !179, file: !70, line: 323, baseType: !169, size: 32, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !179, file: !70, line: 324, baseType: !207, size: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !70, line: 174, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 167, size: 256, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !209, file: !70, line: 169, baseType: !67, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !209, file: !70, line: 169, baseType: !67, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !209, file: !70, line: 170, baseType: !67, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !209, file: !70, line: 171, baseType: !67, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !209, file: !70, line: 172, baseType: !169, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !209, file: !70, line: 173, baseType: !217, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !179, file: !70, line: 325, baseType: !67, size: 32, offset: 1024)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !179, file: !70, line: 326, baseType: !119, size: 64, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !76, file: !70, line: 330, baseType: !67, size: 32, offset: 5056)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !76, file: !70, line: 331, baseType: !67, size: 32, offset: 5088)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !76, file: !70, line: 332, baseType: !67, size: 32, offset: 5120)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !76, file: !70, line: 334, baseType: !67, size: 32, offset: 5152)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !76, file: !70, line: 335, baseType: !67, size: 32, offset: 5184)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !76, file: !70, line: 336, baseType: !226, size: 32, offset: 5216)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 26, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 42, baseType: !7)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !76, file: !70, line: 337, baseType: !226, size: 32, offset: 5248)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !76, file: !70, line: 338, baseType: !226, size: 32, offset: 5280)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !76, file: !70, line: 339, baseType: !226, size: 32, offset: 5312)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !76, file: !70, line: 340, baseType: !67, size: 32, offset: 5344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !76, file: !70, line: 344, baseType: !67, size: 32, offset: 5376)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !76, file: !70, line: 356, baseType: !67, size: 32, offset: 5408)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !76, file: !70, line: 364, baseType: !67, size: 32, offset: 5440)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !76, file: !70, line: 367, baseType: !67, size: 32, offset: 5472)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !76, file: !70, line: 368, baseType: !67, size: 32, offset: 5504)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !76, file: !70, line: 369, baseType: !67, size: 32, offset: 5536)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !76, file: !70, line: 375, baseType: !239, size: 64, offset: 5568)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !14}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !71, file: !72, line: 386, baseType: !243, size: 8256, offset: 5632)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8256, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 129)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !71, file: !72, line: 387, baseType: !67, size: 32, offset: 13888)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !71, file: !72, line: 388, baseType: !67, size: 32, offset: 13920)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !71, file: !72, line: 389, baseType: !67, size: 32, offset: 13952)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !71, file: !72, line: 390, baseType: !67, size: 32, offset: 13984)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !71, file: !72, line: 391, baseType: !67, size: 32, offset: 14016)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !71, file: !72, line: 402, baseType: !252, size: 576, offset: 14080)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 394, size: 576, elements: !253)
!253 = !{!254, !255, !256, !266, !267, !268}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !252, file: !72, line: 396, baseType: !67, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !252, file: !72, line: 397, baseType: !67, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !252, file: !72, line: 398, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !70, line: 604, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 593, size: 192, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !259, file: !70, line: 595, baseType: !67, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !259, file: !70, line: 596, baseType: !67, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !259, file: !70, line: 599, baseType: !67, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !259, file: !70, line: 603, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !252, file: !72, line: 399, baseType: !67, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !252, file: !72, line: 400, baseType: !265, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !252, file: !72, line: 401, baseType: !269, size: 320, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !270, line: 56, baseType: !271)
!270 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/bs.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !270, line: 47, size: 320, elements: !272)
!272 = !{!273, !274, !275, !276, !280, !281}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !271, file: !270, line: 49, baseType: !265, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !271, file: !270, line: 50, baseType: !265, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !271, file: !270, line: 51, baseType: !265, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !271, file: !270, line: 53, baseType: !277, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !278, line: 87, baseType: !279)
!278 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!279 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !271, file: !270, line: 54, baseType: !67, size: 32, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !271, file: !270, line: 55, baseType: !67, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !71, file: !72, line: 404, baseType: !265, size: 64, offset: 14656)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !71, file: !72, line: 405, baseType: !67, size: 32, offset: 14720)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !71, file: !72, line: 410, baseType: !67, size: 32, offset: 14752)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !71, file: !72, line: 411, baseType: !67, size: 32, offset: 14784)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !71, file: !72, line: 413, baseType: !67, size: 32, offset: 14816)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !71, file: !72, line: 415, baseType: !67, size: 32, offset: 14848)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !71, file: !72, line: 416, baseType: !67, size: 32, offset: 14880)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !71, file: !72, line: 418, baseType: !67, size: 32, offset: 14912)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !71, file: !72, line: 419, baseType: !67, size: 32, offset: 14944)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !71, file: !72, line: 420, baseType: !67, size: 32, offset: 14976)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !71, file: !72, line: 421, baseType: !67, size: 32, offset: 15008)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !71, file: !72, line: 422, baseType: !67, size: 32, offset: 15040)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !71, file: !72, line: 424, baseType: !67, size: 32, offset: 15072)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !71, file: !72, line: 425, baseType: !67, size: 32, offset: 15104)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !71, file: !72, line: 427, baseType: !67, size: 32, offset: 15136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !71, file: !72, line: 430, baseType: !298, size: 10400, offset: 15168)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 10400, elements: !384)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !6, line: 154, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 52, size: 10400, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !319, !320, !321, !322, !323, !324, !325, !326, !327, !334, !335, !383}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !300, file: !6, line: 54, baseType: !67, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !300, file: !6, line: 56, baseType: !67, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !300, file: !6, line: 57, baseType: !67, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !300, file: !6, line: 59, baseType: !67, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !300, file: !6, line: 60, baseType: !67, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !300, file: !6, line: 61, baseType: !67, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !300, file: !6, line: 63, baseType: !67, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !300, file: !6, line: 65, baseType: !67, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !300, file: !6, line: 67, baseType: !67, size: 32, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !300, file: !6, line: 69, baseType: !67, size: 32, offset: 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !300, file: !6, line: 70, baseType: !67, size: 32, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !300, file: !6, line: 71, baseType: !67, size: 32, offset: 352)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !300, file: !6, line: 72, baseType: !67, size: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !300, file: !6, line: 73, baseType: !316, size: 8192, offset: 416)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8192, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !300, file: !6, line: 75, baseType: !67, size: 32, offset: 8608)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !300, file: !6, line: 76, baseType: !67, size: 32, offset: 8640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !300, file: !6, line: 77, baseType: !67, size: 32, offset: 8672)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !300, file: !6, line: 78, baseType: !67, size: 32, offset: 8704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !300, file: !6, line: 79, baseType: !67, size: 32, offset: 8736)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !300, file: !6, line: 80, baseType: !67, size: 32, offset: 8768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !300, file: !6, line: 81, baseType: !67, size: 32, offset: 8800)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !300, file: !6, line: 83, baseType: !67, size: 32, offset: 8832)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !300, file: !6, line: 90, baseType: !328, size: 128, offset: 8864)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !6, line: 84, size: 128, elements: !329)
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !328, file: !6, line: 86, baseType: !67, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !328, file: !6, line: 87, baseType: !67, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !328, file: !6, line: 88, baseType: !67, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !328, file: !6, line: 89, baseType: !67, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !300, file: !6, line: 92, baseType: !67, size: 32, offset: 8992)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !300, file: !6, line: 150, baseType: !336, size: 1344, offset: 9024)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !6, line: 93, size: 1344, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !336, file: !6, line: 95, baseType: !67, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !336, file: !6, line: 96, baseType: !67, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !336, file: !6, line: 97, baseType: !67, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !336, file: !6, line: 99, baseType: !67, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !336, file: !6, line: 100, baseType: !67, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !336, file: !6, line: 102, baseType: !67, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !336, file: !6, line: 103, baseType: !67, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !336, file: !6, line: 104, baseType: !67, size: 32, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !336, file: !6, line: 105, baseType: !67, size: 32, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !336, file: !6, line: 106, baseType: !67, size: 32, offset: 288)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !336, file: !6, line: 107, baseType: !67, size: 32, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !336, file: !6, line: 108, baseType: !67, size: 32, offset: 352)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !336, file: !6, line: 110, baseType: !67, size: 32, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !336, file: !6, line: 111, baseType: !67, size: 32, offset: 416)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !336, file: !6, line: 112, baseType: !67, size: 32, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !336, file: !6, line: 114, baseType: !67, size: 32, offset: 480)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !336, file: !6, line: 115, baseType: !226, size: 32, offset: 512)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !336, file: !6, line: 116, baseType: !226, size: 32, offset: 544)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !336, file: !6, line: 117, baseType: !67, size: 32, offset: 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !336, file: !6, line: 119, baseType: !67, size: 32, offset: 608)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !336, file: !6, line: 120, baseType: !67, size: 32, offset: 640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !336, file: !6, line: 137, baseType: !360, size: 384, offset: 672)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !336, file: !6, line: 122, size: 384, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !360, file: !6, line: 124, baseType: !67, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !360, file: !6, line: 125, baseType: !67, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !360, file: !6, line: 126, baseType: !67, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !360, file: !6, line: 127, baseType: !67, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !360, file: !6, line: 128, baseType: !67, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !360, file: !6, line: 129, baseType: !67, size: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !360, file: !6, line: 130, baseType: !67, size: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !360, file: !6, line: 131, baseType: !67, size: 32, offset: 224)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !360, file: !6, line: 133, baseType: !67, size: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !360, file: !6, line: 134, baseType: !67, size: 32, offset: 288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !360, file: !6, line: 135, baseType: !67, size: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !360, file: !6, line: 136, baseType: !67, size: 32, offset: 352)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !336, file: !6, line: 139, baseType: !67, size: 32, offset: 1056)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !336, file: !6, line: 140, baseType: !67, size: 32, offset: 1088)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !336, file: !6, line: 141, baseType: !67, size: 32, offset: 1120)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !336, file: !6, line: 142, baseType: !67, size: 32, offset: 1152)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !336, file: !6, line: 143, baseType: !67, size: 32, offset: 1184)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !336, file: !6, line: 144, baseType: !67, size: 32, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !336, file: !6, line: 145, baseType: !67, size: 32, offset: 1248)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !336, file: !6, line: 146, baseType: !67, size: 32, offset: 1280)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !336, file: !6, line: 147, baseType: !67, size: 32, offset: 1312)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !300, file: !6, line: 152, baseType: !67, size: 32, offset: 10368)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !71, file: !72, line: 431, baseType: !387, size: 64, offset: 25600)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !71, file: !72, line: 432, baseType: !389, size: 960, offset: 25664)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 960, elements: !384)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !6, line: 186, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 156, size: 960, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !391, file: !6, line: 158, baseType: !67, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !391, file: !6, line: 159, baseType: !67, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !391, file: !6, line: 161, baseType: !67, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !391, file: !6, line: 163, baseType: !67, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !391, file: !6, line: 164, baseType: !67, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !391, file: !6, line: 166, baseType: !67, size: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !391, file: !6, line: 167, baseType: !67, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !391, file: !6, line: 169, baseType: !67, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !391, file: !6, line: 170, baseType: !67, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !391, file: !6, line: 172, baseType: !67, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !391, file: !6, line: 173, baseType: !67, size: 32, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !391, file: !6, line: 175, baseType: !67, size: 32, offset: 352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !391, file: !6, line: 177, baseType: !67, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !391, file: !6, line: 178, baseType: !67, size: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !391, file: !6, line: 179, baseType: !67, size: 32, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !391, file: !6, line: 181, baseType: !67, size: 32, offset: 480)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !391, file: !6, line: 183, baseType: !67, size: 32, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !391, file: !6, line: 184, baseType: !411, size: 384, offset: 576)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 384, elements: !413)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!413 = !{!27}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !71, file: !72, line: 433, baseType: !415, size: 64, offset: 26624)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !71, file: !72, line: 434, baseType: !67, size: 32, offset: 26688)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !71, file: !72, line: 437, baseType: !67, size: 32, offset: 26720)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !71, file: !72, line: 440, baseType: !419, size: 256, offset: 26752)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 256, elements: !422)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 512, elements: !36)
!422 = !{!423}
!423 = !DISubrange(count: 4)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !71, file: !72, line: 441, baseType: !425, size: 128, offset: 27008)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 128, elements: !174)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 2048, elements: !52)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !71, file: !72, line: 443, baseType: !419, size: 256, offset: 27136)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !71, file: !72, line: 444, baseType: !425, size: 128, offset: 27392)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !71, file: !72, line: 446, baseType: !431, size: 256, offset: 27520)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 256, elements: !422)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !36)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !71, file: !72, line: 447, baseType: !435, size: 128, offset: 27776)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 128, elements: !174)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1024, elements: !52)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !71, file: !72, line: 448, baseType: !431, size: 256, offset: 27904)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !71, file: !72, line: 449, baseType: !435, size: 128, offset: 28160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !71, file: !72, line: 454, baseType: !441, size: 5888, offset: 28288)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 5888, elements: !443)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!443 = !{!444}
!444 = !DISubrange(count: 92)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !71, file: !72, line: 455, baseType: !446, size: 23552, offset: 34176)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 23552, elements: !447)
!447 = !{!444, !423}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !71, file: !72, line: 457, baseType: !412, size: 64, offset: 57728)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !71, file: !72, line: 460, baseType: !450, size: 53376, offset: 57856)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !72, line: 364, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 302, size: 53376, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !481, !511, !512, !513, !519, !520, !521, !522, !523, !524, !525, !526}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !451, file: !72, line: 304, baseType: !387, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !451, file: !72, line: 305, baseType: !415, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !451, file: !72, line: 307, baseType: !67, size: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !451, file: !72, line: 308, baseType: !67, size: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !451, file: !72, line: 309, baseType: !67, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !451, file: !72, line: 311, baseType: !67, size: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !451, file: !72, line: 313, baseType: !67, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !451, file: !72, line: 315, baseType: !67, size: 32, offset: 288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !451, file: !72, line: 316, baseType: !67, size: 32, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !451, file: !72, line: 317, baseType: !67, size: 32, offset: 352)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !451, file: !72, line: 319, baseType: !67, size: 32, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !451, file: !72, line: 321, baseType: !67, size: 32, offset: 416)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !451, file: !72, line: 322, baseType: !67, size: 32, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !451, file: !72, line: 324, baseType: !173, size: 64, offset: 480)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !451, file: !72, line: 325, baseType: !67, size: 32, offset: 544)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !451, file: !72, line: 327, baseType: !67, size: 32, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !451, file: !72, line: 329, baseType: !67, size: 32, offset: 608)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !451, file: !72, line: 330, baseType: !67, size: 32, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !451, file: !72, line: 331, baseType: !67, size: 32, offset: 672)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !451, file: !72, line: 333, baseType: !67, size: 32, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !451, file: !72, line: 334, baseType: !67, size: 32, offset: 736)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !451, file: !72, line: 339, baseType: !475, size: 2048, offset: 768)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 2048, elements: !480)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !451, file: !72, line: 335, size: 64, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !476, file: !72, line: 337, baseType: !67, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !476, file: !72, line: 338, baseType: !67, size: 32, offset: 32)
!480 = !{!175, !37}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !451, file: !72, line: 342, baseType: !482, size: 49152, align: 128, offset: 2816)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 49152, align: 128, elements: !509)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !484, line: 36, baseType: !485, align: 128)
!484 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/mc.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !484, line: 26, size: 512, elements: !486)
!486 = !{!487, !495, !496, !499, !500, !501}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !485, file: !484, line: 30, baseType: !488, size: 128, align: 128)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 128, elements: !493)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !490, line: 25, baseType: !491)
!490 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !24, line: 39, baseType: !492)
!492 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!493 = !{!494}
!494 = !DISubrange(count: 8)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !485, file: !484, line: 31, baseType: !488, size: 128, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !485, file: !484, line: 32, baseType: !497, size: 32, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !490, line: 26, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !24, line: 41, baseType: !67)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !485, file: !484, line: 33, baseType: !497, size: 32, offset: 288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !485, file: !484, line: 34, baseType: !497, size: 32, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !485, file: !484, line: 35, baseType: !502, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !484, line: 25, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !265, !67, !265, !67, !507, !67}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!509 = !{!510, !28}
!510 = !DISubrange(count: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !451, file: !72, line: 344, baseType: !67, size: 32, offset: 51968)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !451, file: !72, line: 345, baseType: !67, size: 32, offset: 52000)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !451, file: !72, line: 350, baseType: !514, size: 1024, offset: 52032)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 1024, elements: !36)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !451, file: !72, line: 346, size: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !515, file: !72, line: 348, baseType: !67, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !515, file: !72, line: 349, baseType: !67, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !451, file: !72, line: 352, baseType: !67, size: 32, offset: 53056)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !451, file: !72, line: 354, baseType: !67, size: 32, offset: 53088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !451, file: !72, line: 355, baseType: !67, size: 32, offset: 53120)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !451, file: !72, line: 356, baseType: !67, size: 32, offset: 53152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !451, file: !72, line: 357, baseType: !67, size: 32, offset: 53184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !451, file: !72, line: 360, baseType: !67, size: 32, offset: 53216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !451, file: !72, line: 361, baseType: !67, size: 32, offset: 53248)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !451, file: !72, line: 362, baseType: !67, size: 32, offset: 53280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !71, file: !72, line: 463, baseType: !528, size: 4096, offset: 111232)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !529, line: 46, baseType: !530)
!529 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/cabac.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 27, size: 4096, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !530, file: !529, line: 30, baseType: !67, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !530, file: !529, line: 31, baseType: !67, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !530, file: !529, line: 34, baseType: !67, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !530, file: !529, line: 35, baseType: !67, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !530, file: !529, line: 37, baseType: !265, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !530, file: !529, line: 38, baseType: !265, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !530, file: !529, line: 39, baseType: !265, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !530, file: !529, line: 42, baseType: !67, size: 32, align: 128, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !530, file: !529, line: 45, baseType: !541, size: 3680, offset: 416)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 3680, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 460)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !71, file: !72, line: 494, baseType: !545, size: 2112, offset: 115328)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 465, size: 2112, elements: !546)
!546 = !{!547, !688, !690, !691, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !704, !705, !706, !707}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !545, file: !72, line: 468, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !551, line: 146, baseType: !552)
!551 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/frame.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !551, line: 31, size: 125056, elements: !553)
!553 = !{!554, !555, !556, !557, !560, !561, !562, !563, !564, !565, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !584, !585, !586, !587, !588, !589, !591, !593, !594, !595, !596, !597, !600, !602, !603, !605, !610, !611, !615, !616, !620, !624, !627, !629, !630, !632, !633, !635, !636, !637, !640, !642, !643, !644, !646, !647, !648, !649, !650, !651, !652, !653, !655, !656, !660, !669, !673, !675, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !552, file: !551, line: 34, baseType: !67, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !552, file: !551, line: 35, baseType: !67, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !552, file: !551, line: 36, baseType: !67, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !552, file: !551, line: 37, baseType: !558, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !490, line: 27, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !24, line: 44, baseType: !279)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !552, file: !551, line: 38, baseType: !558, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !552, file: !551, line: 39, baseType: !67, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !552, file: !551, line: 40, baseType: !67, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !552, file: !551, line: 41, baseType: !67, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !552, file: !551, line: 42, baseType: !67, size: 32, offset: 352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !552, file: !551, line: 43, baseType: !566, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !552, file: !551, line: 45, baseType: !67, size: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !552, file: !551, line: 46, baseType: !67, size: 32, offset: 480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !552, file: !551, line: 47, baseType: !67, size: 32, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !552, file: !551, line: 48, baseType: !67, size: 32, offset: 544)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !552, file: !551, line: 49, baseType: !67, size: 32, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !552, file: !551, line: 50, baseType: !67, size: 32, offset: 608)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !552, file: !551, line: 51, baseType: !67, size: 32, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !552, file: !551, line: 52, baseType: !33, size: 8, offset: 672)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !552, file: !551, line: 53, baseType: !33, size: 8, offset: 680)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !552, file: !551, line: 54, baseType: !33, size: 8, offset: 688)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !552, file: !551, line: 55, baseType: !169, size: 32, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !552, file: !551, line: 56, baseType: !169, size: 32, offset: 736)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !552, file: !551, line: 57, baseType: !67, size: 32, offset: 768)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !552, file: !551, line: 60, baseType: !67, size: 32, offset: 800)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !552, file: !551, line: 61, baseType: !582, size: 96, offset: 832)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 96, elements: !583)
!583 = !{!28}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !552, file: !551, line: 62, baseType: !582, size: 96, offset: 928)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !552, file: !551, line: 63, baseType: !582, size: 96, offset: 1024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !552, file: !551, line: 64, baseType: !67, size: 32, offset: 1120)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !552, file: !551, line: 65, baseType: !67, size: 32, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !552, file: !551, line: 66, baseType: !67, size: 32, offset: 1184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !552, file: !551, line: 67, baseType: !590, size: 192, offset: 1216)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 192, elements: !583)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !552, file: !551, line: 68, baseType: !592, size: 256, offset: 1408)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 256, elements: !422)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !552, file: !551, line: 69, baseType: !592, size: 256, offset: 1664)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !552, file: !551, line: 70, baseType: !442, size: 64, offset: 1920)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !552, file: !551, line: 74, baseType: !592, size: 256, offset: 1984)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !552, file: !551, line: 75, baseType: !592, size: 256, offset: 2240)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !552, file: !551, line: 77, baseType: !598, size: 24576, align: 128, offset: 2560)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 24576, align: 128, elements: !599)
!599 = !{!37, !28}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !552, file: !551, line: 78, baseType: !601, size: 1024, offset: 27136)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 1024, elements: !36)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !552, file: !551, line: 79, baseType: !67, size: 32, offset: 28160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !552, file: !551, line: 80, baseType: !604, size: 64, offset: 28224)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !552, file: !551, line: 83, baseType: !606, size: 64, offset: 28288)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !490, line: 24, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !24, line: 37, baseType: !609)
!609 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !552, file: !551, line: 84, baseType: !265, size: 64, offset: 28352)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !552, file: !551, line: 85, baseType: !612, size: 128, offset: 28416)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 128, elements: !174)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 32, elements: !174)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !552, file: !551, line: 86, baseType: !613, size: 64, offset: 28544)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !552, file: !551, line: 87, baseType: !617, size: 2176, offset: 28608)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 2176, elements: !618)
!618 = !{!175, !619}
!619 = !DISubrange(count: 17)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !552, file: !551, line: 92, baseType: !621, size: 20736, offset: 30784)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 20736, elements: !622)
!622 = !{!623, !623}
!623 = !DISubrange(count: 18)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !552, file: !551, line: 96, baseType: !625, size: 2176, offset: 51520)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 2176, elements: !618)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !552, file: !551, line: 97, baseType: !628, size: 128, offset: 53696)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 128, elements: !174)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !552, file: !551, line: 98, baseType: !173, size: 64, offset: 53824)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !552, file: !551, line: 99, baseType: !631, size: 1024, offset: 53888)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 1024, elements: !480)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !552, file: !551, line: 100, baseType: !614, size: 32, offset: 54912)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !552, file: !551, line: 105, baseType: !634, size: 10368, offset: 54944)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 10368, elements: !622)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !552, file: !551, line: 106, baseType: !634, size: 10368, offset: 65312)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !552, file: !551, line: 107, baseType: !67, size: 32, offset: 75680)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !552, file: !551, line: 108, baseType: !638, size: 576, offset: 75712)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 576, elements: !639)
!639 = !{!623}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !552, file: !551, line: 109, baseType: !641, size: 20736, offset: 76288)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 20736, elements: !622)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !552, file: !551, line: 110, baseType: !626, size: 64, offset: 97024)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !552, file: !551, line: 111, baseType: !626, size: 64, offset: 97088)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !552, file: !551, line: 112, baseType: !645, size: 64, offset: 97152)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !552, file: !551, line: 113, baseType: !645, size: 64, offset: 97216)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !552, file: !551, line: 114, baseType: !645, size: 64, offset: 97280)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !552, file: !551, line: 115, baseType: !67, size: 32, offset: 97344)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !552, file: !551, line: 116, baseType: !442, size: 64, offset: 97408)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !552, file: !551, line: 117, baseType: !442, size: 64, offset: 97472)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !552, file: !551, line: 118, baseType: !442, size: 64, offset: 97536)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !552, file: !551, line: 119, baseType: !67, size: 32, offset: 97600)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !552, file: !551, line: 120, baseType: !654, size: 576, offset: 97632)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 576, elements: !639)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !552, file: !551, line: 121, baseType: !226, size: 32, offset: 98208)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !552, file: !551, line: 122, baseType: !657, size: 64, offset: 98240)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 27, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 45, baseType: !659)
!659 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !552, file: !551, line: 125, baseType: !661, size: 256, offset: 98304)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !70, line: 503, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 496, size: 256, elements: !663)
!663 = !{!664, !666, !667, !668}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !662, file: !70, line: 498, baseType: !665, size: 64)
!665 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !662, file: !70, line: 499, baseType: !665, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !662, file: !70, line: 500, baseType: !665, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !662, file: !70, line: 502, baseType: !665, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !552, file: !551, line: 128, baseType: !670, size: 2008, offset: 98560)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2008, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 251)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !552, file: !551, line: 129, baseType: !674, size: 8032, offset: 100576)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8032, elements: !671)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !552, file: !551, line: 130, baseType: !676, size: 16064, offset: 108608)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 16064, elements: !671)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !552, file: !551, line: 131, baseType: !67, size: 32, offset: 124672)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !552, file: !551, line: 132, baseType: !67, size: 32, offset: 124704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !552, file: !551, line: 135, baseType: !67, size: 32, offset: 124736)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !552, file: !551, line: 136, baseType: !67, size: 32, offset: 124768)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !552, file: !551, line: 137, baseType: !67, size: 32, offset: 124800)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !552, file: !551, line: 138, baseType: !67, size: 32, offset: 124832)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !552, file: !551, line: 139, baseType: !67, size: 32, offset: 124864)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !552, file: !551, line: 142, baseType: !169, size: 32, offset: 124896)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !552, file: !551, line: 143, baseType: !67, size: 32, offset: 124928)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !552, file: !551, line: 144, baseType: !67, size: 32, offset: 124960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !552, file: !551, line: 145, baseType: !67, size: 32, offset: 124992)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !545, file: !72, line: 470, baseType: !689, size: 128, offset: 64)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 128, elements: !174)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !545, file: !72, line: 473, baseType: !548, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !545, file: !72, line: 476, baseType: !692, size: 1152, offset: 256)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 1152, elements: !639)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !545, file: !72, line: 478, baseType: !67, size: 32, offset: 1408)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !545, file: !72, line: 480, baseType: !67, size: 32, offset: 1440)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !545, file: !72, line: 482, baseType: !67, size: 32, offset: 1472)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !545, file: !72, line: 483, baseType: !67, size: 32, offset: 1504)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !545, file: !72, line: 484, baseType: !67, size: 32, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !545, file: !72, line: 485, baseType: !67, size: 32, offset: 1568)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !545, file: !72, line: 486, baseType: !67, size: 32, offset: 1600)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !545, file: !72, line: 487, baseType: !558, size: 64, offset: 1664)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !545, file: !72, line: 488, baseType: !558, size: 64, offset: 1728)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !545, file: !72, line: 489, baseType: !703, size: 128, offset: 1792)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 128, elements: !174)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !545, file: !72, line: 490, baseType: !558, size: 64, offset: 1920)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !545, file: !72, line: 491, baseType: !558, size: 64, offset: 1984)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !545, file: !72, line: 492, baseType: !67, size: 32, offset: 2048)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !545, file: !72, line: 493, baseType: !67, size: 32, offset: 2080)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !71, file: !72, line: 497, baseType: !549, size: 64, offset: 117440)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !71, file: !72, line: 500, baseType: !549, size: 64, offset: 117504)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !71, file: !72, line: 503, baseType: !67, size: 32, offset: 117568)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !71, file: !72, line: 504, baseType: !712, size: 1216, offset: 117632)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 1216, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 19)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !71, file: !72, line: 505, baseType: !67, size: 32, offset: 118848)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !71, file: !72, line: 506, baseType: !712, size: 1216, offset: 118912)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !71, file: !72, line: 507, baseType: !173, size: 64, offset: 120128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !71, file: !72, line: 510, baseType: !67, size: 32, offset: 120192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !71, file: !72, line: 511, baseType: !67, size: 32, offset: 120224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !71, file: !72, line: 512, baseType: !558, size: 64, offset: 120256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !71, file: !72, line: 522, baseType: !722, size: 10624, offset: 120320)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 515, size: 10624, elements: !723)
!723 = !{!724, !726, !729, !732}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !722, file: !72, line: 517, baseType: !725, size: 256, align: 128)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 256, elements: !36)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !722, file: !72, line: 518, baseType: !727, size: 128, align: 128, offset: 256)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 128, elements: !728)
!728 = !{!175, !423}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !722, file: !72, line: 520, baseType: !730, size: 4096, align: 128, offset: 384)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 4096, elements: !731)
!731 = !{!423, !53}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !722, file: !72, line: 521, baseType: !733, size: 6144, align: 128, offset: 4480)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 6144, elements: !734)
!734 = !{!735, !37}
!735 = !DISubrange(count: 24)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !71, file: !72, line: 732, baseType: !737, size: 82688, offset: 130944)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 525, size: 82688, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !766, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !784, !787, !791, !792, !793, !798, !799, !802, !803, !804, !805, !806, !807, !808, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !868, !899, !900, !901, !902, !903, !904, !905, !906, !907, !910, !911, !912, !915, !918, !920, !923, !925, !926}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !737, file: !72, line: 527, baseType: !67, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !737, file: !72, line: 530, baseType: !67, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !737, file: !72, line: 531, baseType: !67, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !737, file: !72, line: 532, baseType: !67, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !737, file: !72, line: 535, baseType: !67, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !737, file: !72, line: 536, baseType: !67, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !737, file: !72, line: 537, baseType: !67, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !737, file: !72, line: 538, baseType: !67, size: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !737, file: !72, line: 539, baseType: !67, size: 32, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !737, file: !72, line: 542, baseType: !67, size: 32, offset: 288)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !737, file: !72, line: 543, baseType: !67, size: 32, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !737, file: !72, line: 544, baseType: !67, size: 32, offset: 352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !737, file: !72, line: 545, baseType: !67, size: 32, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !737, file: !72, line: 546, baseType: !67, size: 32, offset: 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !737, file: !72, line: 547, baseType: !67, size: 32, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !737, file: !72, line: 548, baseType: !67, size: 32, offset: 480)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !737, file: !72, line: 549, baseType: !67, size: 32, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !737, file: !72, line: 551, baseType: !67, size: 32, offset: 544)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !737, file: !72, line: 554, baseType: !173, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !737, file: !72, line: 555, baseType: !173, size: 64, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !737, file: !72, line: 558, baseType: !173, size: 64, offset: 704)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !737, file: !72, line: 559, baseType: !173, size: 64, offset: 768)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !737, file: !72, line: 561, baseType: !173, size: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !737, file: !72, line: 562, baseType: !173, size: 64, offset: 896)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !737, file: !72, line: 565, baseType: !7, size: 32, offset: 960)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !737, file: !72, line: 566, baseType: !765, size: 128, offset: 992)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !422)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !737, file: !72, line: 567, baseType: !767, size: 512, offset: 1120)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !36)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !737, file: !72, line: 568, baseType: !7, size: 32, offset: 1632)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !737, file: !72, line: 569, baseType: !7, size: 32, offset: 1664)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !737, file: !72, line: 570, baseType: !67, size: 32, offset: 1696)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !737, file: !72, line: 571, baseType: !67, size: 32, offset: 1728)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !737, file: !72, line: 572, baseType: !67, size: 32, offset: 1760)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !737, file: !72, line: 573, baseType: !67, size: 32, offset: 1792)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !737, file: !72, line: 574, baseType: !67, size: 32, offset: 1824)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !737, file: !72, line: 575, baseType: !67, size: 32, offset: 1856)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !737, file: !72, line: 576, baseType: !67, size: 32, offset: 1888)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !737, file: !72, line: 577, baseType: !67, size: 32, offset: 1920)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !737, file: !72, line: 578, baseType: !67, size: 32, offset: 1952)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !72, line: 585, baseType: !606, size: 64, offset: 1984)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !737, file: !72, line: 586, baseType: !265, size: 64, offset: 2048)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !737, file: !72, line: 587, baseType: !606, size: 64, offset: 2112)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !737, file: !72, line: 588, baseType: !783, size: 64, offset: 2176)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !737, file: !72, line: 589, baseType: !785, size: 64, offset: 2240)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 64, elements: !493)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !737, file: !72, line: 591, baseType: !788, size: 64, offset: 2304)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 192, elements: !790)
!790 = !{!735}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !737, file: !72, line: 592, baseType: !606, size: 64, offset: 2368)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !737, file: !72, line: 593, baseType: !612, size: 128, offset: 2432)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !737, file: !72, line: 594, baseType: !794, size: 128, offset: 2560)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 128, elements: !174)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !797)
!797 = !{!494, !175}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !737, file: !72, line: 595, baseType: !628, size: 128, offset: 2688)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !737, file: !72, line: 596, baseType: !800, size: 4096, offset: 2816)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 4096, elements: !801)
!801 = !{!175, !510}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !737, file: !72, line: 597, baseType: !606, size: 64, offset: 6912)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !737, file: !72, line: 598, baseType: !606, size: 64, offset: 6976)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !737, file: !72, line: 599, baseType: !442, size: 64, offset: 7040)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !737, file: !72, line: 603, baseType: !601, size: 1024, offset: 7104)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !737, file: !72, line: 606, baseType: !67, size: 32, offset: 8128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !737, file: !72, line: 607, baseType: !67, size: 32, offset: 8160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !737, file: !72, line: 608, baseType: !809, size: 32, align: 32, offset: 8192)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, elements: !422)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !737, file: !72, line: 609, baseType: !67, size: 32, offset: 8224)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !737, file: !72, line: 611, baseType: !67, size: 32, offset: 8256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !737, file: !72, line: 612, baseType: !67, size: 32, offset: 8288)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !737, file: !72, line: 614, baseType: !67, size: 32, offset: 8320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !737, file: !72, line: 615, baseType: !67, size: 32, offset: 8352)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !737, file: !72, line: 621, baseType: !67, size: 32, offset: 8384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !737, file: !72, line: 624, baseType: !67, size: 32, offset: 8416)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !737, file: !72, line: 626, baseType: !67, size: 32, offset: 8448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !737, file: !72, line: 627, baseType: !67, size: 32, offset: 8480)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !737, file: !72, line: 671, baseType: !820, size: 60672, offset: 8576)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !737, file: !72, line: 629, size: 60672, elements: !821)
!821 = !{!822, !826, !830, !832, !833, !836, !840, !842, !843, !844, !845, !846, !849, !853, !856, !857, !858, !859, !860, !863, !865, !867}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !820, file: !72, line: 634, baseType: !823, size: 3072, align: 128)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 3072, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !820, file: !72, line: 635, baseType: !827, size: 6912, align: 128, offset: 3072)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 6912, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 864)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !820, file: !72, line: 638, baseType: !831, size: 2048, align: 128, offset: 9984)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !317)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !820, file: !72, line: 639, baseType: !831, size: 2048, align: 128, offset: 12032)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !820, file: !72, line: 640, baseType: !834, size: 3072, align: 128, offset: 14080)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 3072, elements: !835)
!835 = !{!28, !53}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !820, file: !72, line: 641, baseType: !837, size: 3840, align: 128, offset: 17152)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 3840, elements: !838)
!838 = !{!839, !37}
!839 = !DISubrange(count: 15)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !820, file: !72, line: 642, baseType: !841, size: 128, offset: 20992)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 128, elements: !422)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !820, file: !72, line: 643, baseType: !841, size: 128, offset: 21120)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !820, file: !72, line: 644, baseType: !67, size: 32, offset: 21248)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !820, file: !72, line: 645, baseType: !67, size: 32, offset: 21280)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !820, file: !72, line: 648, baseType: !730, size: 4096, align: 128, offset: 21376)
