; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r/llvm-ir/544.nab_r_bc/src/sff.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/sff.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.molecule_t = type { [4 x [3 x double]], i32, ptr, i32, i32, i32, ptr }
%struct.parm = type { [81 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, [3 x double], double, double, double, double, double, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@ntpr = dso_local local_unnamed_addr global i32 100, align 4, !dbg !0
@gb = dso_local local_unnamed_addr global i32 0, align 4, !dbg !18
@blocksize = dso_local local_unnamed_addr global i32 8, align 4, !dbg !21
@ntpr_md = dso_local local_unnamed_addr global i32 100, align 4, !dbg !23
@dim = internal unnamed_addr global i1 false, align 4, !dbg !783
@stdin = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [2 x i8] c"-\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntpr", scope: !2, file: !20, line: 115, type: !8, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/sff.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r", checksumkind: CSK_MD5, checksum: "d1a2e7f61920d54839b88f8945c170cc")
!4 = !{!5, !6, !8, !9, !11, !13, !14}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 46, baseType: !16)
!15 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!16 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!17 = !{!0, !18, !21, !23, !25, !322, !361, !363, !365, !367, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !389, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !449, !451, !453, !455, !457, !459, !461, !463, !465, !467, !469, !471, !473, !475, !477, !479, !481, !483, !485, !487, !489, !491, !493, !495, !497, !499, !501, !503, !544, !546, !723, !725, !727, !729, !731, !733, !735, !737, !739, !741, !743, !745, !747, !749, !751, !753, !755, !757, !759, !761, !763, !765, !767, !769, !771, !773, !775, !777, !779, !781}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "gb", scope: !2, file: !20, line: 174, type: !8, isLocal: false, isDefinition: true)
!20 = !DIFile(filename: "apps/544.nab_r/src/sff.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d1a2e7f61920d54839b88f8945c170cc")
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "blocksize", scope: !2, file: !20, line: 195, type: !8, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "ntpr_md", scope: !2, file: !20, line: 218, type: !8, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "nold", scope: !27, file: !20, line: 830, type: !8, isLocal: true, isDefinition: true)
!27 = distinct !DISubprogram(name: "mme_init", scope: !20, file: !20, line: 823, type: !28, scopeLine: 826, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !297)
!28 = !DISubroutineType(types: !29)
!29 = !{!8, !30, !6, !6, !11, !241}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !32, line: 126, baseType: !33)
!32 = !DIFile(filename: "apps/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e6947e1b068a9350a45ab4ee56d7a2de")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !32, line: 118, size: 1088, elements: !34)
!34 = !{!35, !41, !43, !136, !137, !138, !139}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !33, file: !32, line: 119, baseType: !36, size: 768)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !32, line: 13, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !38)
!38 = !{!39, !40}
!39 = !DISubrange(count: 4)
!40 = !DISubrange(count: 3)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !33, file: !32, line: 120, baseType: !42, size: 32, offset: 768)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !32, line: 6, baseType: !8)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !33, file: !32, line: 121, baseType: !44, size: 64, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !32, line: 93, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !32, line: 84, size: 384, elements: !47)
!47 = !{!48, !51, !52, !53, !55, !57, !58, !59}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !46, file: !32, line: 85, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !32, line: 17, baseType: !7)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !46, file: !32, line: 86, baseType: !42, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !46, file: !32, line: 87, baseType: !42, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !46, file: !32, line: 88, baseType: !54, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !46, file: !32, line: 89, baseType: !56, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !46, file: !32, line: 90, baseType: !42, size: 32, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !46, file: !32, line: 91, baseType: !42, size: 32, offset: 288)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !46, file: !32, line: 92, baseType: !60, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !32, line: 82, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !32, line: 63, size: 1024, elements: !64)
!64 = !{!65, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !86, !87, !93, !94, !103, !104, !106}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !63, file: !32, line: 64, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !63, file: !32, line: 65, baseType: !42, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !63, file: !32, line: 66, baseType: !42, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !63, file: !32, line: 67, baseType: !42, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !63, file: !32, line: 68, baseType: !49, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !63, file: !32, line: 69, baseType: !49, size: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !63, file: !32, line: 70, baseType: !42, size: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !63, file: !32, line: 71, baseType: !42, size: 32, offset: 352)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !63, file: !32, line: 72, baseType: !42, size: 32, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !63, file: !32, line: 73, baseType: !56, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !63, file: !32, line: 74, baseType: !77, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !32, line: 52, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !32, line: 47, size: 192, elements: !80)
!80 = !{!81, !83, !84, !85}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !79, file: !32, line: 48, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !79, file: !32, line: 49, baseType: !42, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !79, file: !32, line: 50, baseType: !42, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !79, file: !32, line: 51, baseType: !42, size: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !63, file: !32, line: 75, baseType: !42, size: 32, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !63, file: !32, line: 76, baseType: !88, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !32, line: 54, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 2)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !63, file: !32, line: 77, baseType: !42, size: 32, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !63, file: !32, line: 78, baseType: !95, size: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !32, line: 61, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !32, line: 58, size: 192, elements: !98)
!98 = !{!99, !102}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !97, file: !32, line: 59, baseType: !100, size: 128)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 128, elements: !101)
!101 = !{!39}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !97, file: !32, line: 60, baseType: !12, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !63, file: !32, line: 79, baseType: !42, size: 32, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !63, file: !32, line: 80, baseType: !105, size: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !63, file: !32, line: 81, baseType: !107, size: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !32, line: 45, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !32, line: 25, size: 1408, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !135}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !109, file: !32, line: 26, baseType: !49, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !109, file: !32, line: 27, baseType: !49, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !109, file: !32, line: 28, baseType: !42, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !109, file: !32, line: 29, baseType: !42, size: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !109, file: !32, line: 30, baseType: !116, size: 256, offset: 192)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 256, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 8)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !109, file: !32, line: 31, baseType: !66, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !109, file: !32, line: 32, baseType: !12, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !109, file: !32, line: 33, baseType: !12, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !109, file: !32, line: 34, baseType: !12, size: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !109, file: !32, line: 35, baseType: !12, size: 64, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !109, file: !32, line: 36, baseType: !49, size: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !109, file: !32, line: 37, baseType: !42, size: 32, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !109, file: !32, line: 38, baseType: !12, size: 64, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !109, file: !32, line: 39, baseType: !12, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !109, file: !32, line: 40, baseType: !42, size: 32, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !109, file: !32, line: 41, baseType: !42, size: 32, offset: 1056)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !109, file: !32, line: 42, baseType: !49, size: 64, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !109, file: !32, line: 43, baseType: !132, size: 192, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !32, line: 12, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, elements: !134)
!134 = !{!40}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !109, file: !32, line: 44, baseType: !12, size: 64, offset: 1344)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !33, file: !32, line: 122, baseType: !42, size: 32, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !33, file: !32, line: 123, baseType: !42, size: 32, offset: 928)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !33, file: !32, line: 124, baseType: !42, size: 32, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !33, file: !32, line: 125, baseType: !140, size: 64, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !32, line: 115, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !32, line: 95, size: 5760, elements: !143)
!143 = !{!144, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !142, file: !32, line: 96, baseType: !145, size: 648)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 648, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 81)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !142, file: !32, line: 97, baseType: !42, size: 32, offset: 672)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !142, file: !32, line: 97, baseType: !42, size: 32, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !142, file: !32, line: 97, baseType: !42, size: 32, offset: 736)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !142, file: !32, line: 98, baseType: !42, size: 32, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !142, file: !32, line: 98, baseType: !42, size: 32, offset: 800)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !142, file: !32, line: 98, baseType: !42, size: 32, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !142, file: !32, line: 98, baseType: !42, size: 32, offset: 864)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !142, file: !32, line: 98, baseType: !42, size: 32, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !142, file: !32, line: 98, baseType: !42, size: 32, offset: 928)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !142, file: !32, line: 99, baseType: !42, size: 32, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !142, file: !32, line: 99, baseType: !42, size: 32, offset: 992)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !142, file: !32, line: 99, baseType: !42, size: 32, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !142, file: !32, line: 99, baseType: !42, size: 32, offset: 1056)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !142, file: !32, line: 99, baseType: !42, size: 32, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !142, file: !32, line: 99, baseType: !42, size: 32, offset: 1120)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !142, file: !32, line: 100, baseType: !42, size: 32, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !142, file: !32, line: 100, baseType: !42, size: 32, offset: 1184)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !142, file: !32, line: 100, baseType: !42, size: 32, offset: 1216)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !142, file: !32, line: 100, baseType: !42, size: 32, offset: 1248)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !142, file: !32, line: 100, baseType: !42, size: 32, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !142, file: !32, line: 100, baseType: !42, size: 32, offset: 1312)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !142, file: !32, line: 101, baseType: !42, size: 32, offset: 1344)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !142, file: !32, line: 101, baseType: !42, size: 32, offset: 1376)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !142, file: !32, line: 101, baseType: !42, size: 32, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !142, file: !32, line: 101, baseType: !42, size: 32, offset: 1440)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !142, file: !32, line: 101, baseType: !42, size: 32, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !142, file: !32, line: 101, baseType: !42, size: 32, offset: 1504)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !142, file: !32, line: 101, baseType: !42, size: 32, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !142, file: !32, line: 101, baseType: !42, size: 32, offset: 1568)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !142, file: !32, line: 102, baseType: !42, size: 32, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !142, file: !32, line: 102, baseType: !42, size: 32, offset: 1632)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !142, file: !32, line: 102, baseType: !42, size: 32, offset: 1664)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !142, file: !32, line: 103, baseType: !49, size: 64, offset: 1728)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !142, file: !32, line: 103, baseType: !49, size: 64, offset: 1792)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !142, file: !32, line: 103, baseType: !49, size: 64, offset: 1856)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !142, file: !32, line: 103, baseType: !49, size: 64, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !142, file: !32, line: 104, baseType: !11, size: 64, offset: 1984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !142, file: !32, line: 104, baseType: !11, size: 64, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !142, file: !32, line: 104, baseType: !11, size: 64, offset: 2112)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !142, file: !32, line: 104, baseType: !11, size: 64, offset: 2176)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !142, file: !32, line: 104, baseType: !11, size: 64, offset: 2240)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !142, file: !32, line: 104, baseType: !11, size: 64, offset: 2304)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !142, file: !32, line: 104, baseType: !11, size: 64, offset: 2368)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !142, file: !32, line: 104, baseType: !11, size: 64, offset: 2432)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !142, file: !32, line: 104, baseType: !11, size: 64, offset: 2496)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !142, file: !32, line: 105, baseType: !11, size: 64, offset: 2560)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !142, file: !32, line: 105, baseType: !11, size: 64, offset: 2624)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !142, file: !32, line: 105, baseType: !11, size: 64, offset: 2688)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !142, file: !32, line: 105, baseType: !11, size: 64, offset: 2752)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !142, file: !32, line: 105, baseType: !11, size: 64, offset: 2816)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !142, file: !32, line: 105, baseType: !11, size: 64, offset: 2880)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !142, file: !32, line: 105, baseType: !11, size: 64, offset: 2944)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !142, file: !32, line: 106, baseType: !133, size: 192, offset: 3008)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !142, file: !32, line: 106, baseType: !12, size: 64, offset: 3200)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !142, file: !32, line: 106, baseType: !12, size: 64, offset: 3264)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !142, file: !32, line: 106, baseType: !12, size: 64, offset: 3328)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !142, file: !32, line: 106, baseType: !12, size: 64, offset: 3392)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !142, file: !32, line: 106, baseType: !12, size: 64, offset: 3456)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !142, file: !32, line: 107, baseType: !105, size: 64, offset: 3520)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !142, file: !32, line: 107, baseType: !105, size: 64, offset: 3584)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !142, file: !32, line: 107, baseType: !105, size: 64, offset: 3648)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !142, file: !32, line: 107, baseType: !105, size: 64, offset: 3712)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !142, file: !32, line: 107, baseType: !105, size: 64, offset: 3776)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !142, file: !32, line: 107, baseType: !105, size: 64, offset: 3840)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !142, file: !32, line: 108, baseType: !105, size: 64, offset: 3904)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !142, file: !32, line: 108, baseType: !105, size: 64, offset: 3968)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !142, file: !32, line: 108, baseType: !105, size: 64, offset: 4032)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !142, file: !32, line: 108, baseType: !105, size: 64, offset: 4096)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !142, file: !32, line: 108, baseType: !105, size: 64, offset: 4160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !142, file: !32, line: 108, baseType: !105, size: 64, offset: 4224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !142, file: !32, line: 109, baseType: !105, size: 64, offset: 4288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !142, file: !32, line: 109, baseType: !105, size: 64, offset: 4352)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !142, file: !32, line: 109, baseType: !105, size: 64, offset: 4416)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !142, file: !32, line: 109, baseType: !105, size: 64, offset: 4480)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !142, file: !32, line: 109, baseType: !105, size: 64, offset: 4544)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !142, file: !32, line: 110, baseType: !105, size: 64, offset: 4608)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !142, file: !32, line: 110, baseType: !105, size: 64, offset: 4672)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !142, file: !32, line: 110, baseType: !105, size: 64, offset: 4736)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !142, file: !32, line: 110, baseType: !105, size: 64, offset: 4800)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !142, file: !32, line: 110, baseType: !105, size: 64, offset: 4864)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !142, file: !32, line: 111, baseType: !105, size: 64, offset: 4928)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !142, file: !32, line: 111, baseType: !105, size: 64, offset: 4992)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !142, file: !32, line: 111, baseType: !105, size: 64, offset: 5056)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !142, file: !32, line: 111, baseType: !105, size: 64, offset: 5120)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !142, file: !32, line: 111, baseType: !105, size: 64, offset: 5184)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !142, file: !32, line: 111, baseType: !105, size: 64, offset: 5248)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !142, file: !32, line: 112, baseType: !105, size: 64, offset: 5312)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !142, file: !32, line: 112, baseType: !105, size: 64, offset: 5376)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !142, file: !32, line: 112, baseType: !105, size: 64, offset: 5440)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !142, file: !32, line: 112, baseType: !105, size: 64, offset: 5504)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !142, file: !32, line: 113, baseType: !105, size: 64, offset: 5568)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !142, file: !32, line: 113, baseType: !105, size: 64, offset: 5632)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !142, file: !32, line: 114, baseType: !11, size: 64, offset: 5696)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !243, line: 7, baseType: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !245, line: 49, size: 1728, elements: !246)
!245 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !262, !264, !265, !266, !270, !272, !274, !278, !281, !283, !286, !289, !290, !291, !292, !293}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !244, file: !245, line: 51, baseType: !8, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !244, file: !245, line: 54, baseType: !6, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !244, file: !245, line: 55, baseType: !6, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !244, file: !245, line: 56, baseType: !6, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !244, file: !245, line: 57, baseType: !6, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !244, file: !245, line: 58, baseType: !6, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !244, file: !245, line: 59, baseType: !6, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !244, file: !245, line: 60, baseType: !6, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !244, file: !245, line: 61, baseType: !6, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !244, file: !245, line: 64, baseType: !6, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !244, file: !245, line: 65, baseType: !6, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !244, file: !245, line: 66, baseType: !6, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !244, file: !245, line: 68, baseType: !260, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !245, line: 36, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !244, file: !245, line: 70, baseType: !263, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !244, file: !245, line: 72, baseType: !8, size: 32, offset: 896)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !244, file: !245, line: 73, baseType: !8, size: 32, offset: 928)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !244, file: !245, line: 74, baseType: !267, size: 64, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !268, line: 152, baseType: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!269 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !244, file: !245, line: 77, baseType: !271, size: 16, offset: 1024)
!271 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !244, file: !245, line: 78, baseType: !273, size: 8, offset: 1040)
!273 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !244, file: !245, line: 79, baseType: !275, size: 8, offset: 1048)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 1)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !244, file: !245, line: 81, baseType: !279, size: 64, offset: 1088)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !245, line: 43, baseType: null)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !244, file: !245, line: 89, baseType: !282, size: 64, offset: 1152)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !268, line: 153, baseType: !269)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !244, file: !245, line: 91, baseType: !284, size: 64, offset: 1216)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !245, line: 37, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !244, file: !245, line: 92, baseType: !287, size: 64, offset: 1280)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !245, line: 38, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !244, file: !245, line: 93, baseType: !263, size: 64, offset: 1344)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !244, file: !245, line: 94, baseType: !5, size: 64, offset: 1408)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !244, file: !245, line: 95, baseType: !14, size: 64, offset: 1472)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !244, file: !245, line: 96, baseType: !8, size: 32, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !244, file: !245, line: 98, baseType: !294, size: 160, offset: 1568)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 20)
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !313, !320}
!298 = !DILocalVariable(name: "m", arg: 1, scope: !27, file: !20, line: 823, type: !30)
!299 = !DILocalVariable(name: "aexp", arg: 2, scope: !27, file: !20, line: 823, type: !6)
!300 = !DILocalVariable(name: "aexp2", arg: 3, scope: !27, file: !20, line: 823, type: !6)
!301 = !DILocalVariable(name: "x0i", arg: 4, scope: !27, file: !20, line: 824, type: !11)
!302 = !DILocalVariable(name: "bfpi", arg: 5, scope: !27, file: !20, line: 824, type: !241)
!303 = !DILocalVariable(name: "i", scope: !27, file: !20, line: 827, type: !8)
!304 = !DILocalVariable(name: "j", scope: !27, file: !20, line: 827, type: !8)
!305 = !DILocalVariable(name: "at1", scope: !27, file: !20, line: 827, type: !8)
!306 = !DILocalVariable(name: "at2", scope: !27, file: !20, line: 827, type: !8)
!307 = !DILocalVariable(name: "iexcl", scope: !27, file: !20, line: 827, type: !8)
!308 = !DILocalVariable(name: "npairs", scope: !27, file: !20, line: 827, type: !8)
!309 = !DILocalVariable(name: "numb", scope: !27, file: !20, line: 827, type: !10)
!310 = !DILocalVariable(name: "scale", scope: !27, file: !20, line: 828, type: !12)
!311 = !DILocalVariable(name: "atypi", scope: !27, file: !20, line: 829, type: !312)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !134)
!313 = !DILocalVariable(name: "__res", scope: !314, file: !20, line: 883, type: !8)
!314 = distinct !DILexicalBlock(scope: !315, file: !20, line: 883, column: 21)
!315 = distinct !DILexicalBlock(scope: !316, file: !20, line: 882, column: 40)
!316 = distinct !DILexicalBlock(scope: !317, file: !20, line: 882, column: 7)
!317 = distinct !DILexicalBlock(scope: !318, file: !20, line: 882, column: 7)
!318 = distinct !DILexicalBlock(scope: !319, file: !20, line: 856, column: 19)
!319 = distinct !DILexicalBlock(scope: !27, file: !20, line: 856, column: 8)
!320 = !DILocalVariable(name: "__res", scope: !321, file: !20, line: 884, type: !8)
!321 = distinct !DILexicalBlock(scope: !315, file: !20, line: 884, column: 21)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "xold", scope: !324, file: !20, line: 1625, type: !11, isLocal: true, isDefinition: true)
!324 = distinct !DISubprogram(name: "md", scope: !20, file: !20, line: 1616, type: !325, scopeLine: 1618, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !330)
!325 = !DISubroutineType(types: !326)
!326 = !{!8, !8, !8, !11, !11, !11, !327}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !11, !11, !10}
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!331 = !DILocalVariable(name: "n", arg: 1, scope: !324, file: !20, line: 1616, type: !8)
!332 = !DILocalVariable(name: "maxstep", arg: 2, scope: !324, file: !20, line: 1616, type: !8)
!333 = !DILocalVariable(name: "x", arg: 3, scope: !324, file: !20, line: 1616, type: !11)
!334 = !DILocalVariable(name: "f", arg: 4, scope: !324, file: !20, line: 1616, type: !11)
!335 = !DILocalVariable(name: "v", arg: 5, scope: !324, file: !20, line: 1616, type: !11)
!336 = !DILocalVariable(name: "func", arg: 6, scope: !324, file: !20, line: 1617, type: !327)
!337 = !DILocalVariable(name: "dtx", scope: !324, file: !20, line: 1619, type: !12)
!338 = !DILocalVariable(name: "dt5", scope: !324, file: !20, line: 1619, type: !12)
!339 = !DILocalVariable(name: "rndf", scope: !324, file: !20, line: 1619, type: !12)
