; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/shear.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/shear.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._AffineMatrix = type { double, double, double, double, double, double }
%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }

!382 = !DIEnumerator(name: "ImageEvent", value: 512)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384)
!388 = !DIEnumerator(name: "UserEvent", value: 36864)
!389 = !DIEnumerator(name: "WandEvent", value: 65536)
!390 = !DIEnumerator(name: "X11Event", value: 131072)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 27, baseType: !5, size: 32, elements: !395)
!394 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!396 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!397 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!398 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!399 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!400 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!401 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!402 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!403 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!404 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!405 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!406 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!407 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!408 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!409 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!410 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!411 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!412 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!413 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !415, line: 113, baseType: !5, size: 32, elements: !416)
!415 = !DIFile(filename: "apps/538.imagick_r/src/magick/statistic.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cc0a772b8e2f514bf6d24321fcc65365")
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425}
!417 = !DIEnumerator(name: "UndefinedStatistic", value: 0)
!418 = !DIEnumerator(name: "GradientStatistic", value: 1)
!419 = !DIEnumerator(name: "MaximumStatistic", value: 2)
!420 = !DIEnumerator(name: "MeanStatistic", value: 3)
!421 = !DIEnumerator(name: "MedianStatistic", value: 4)
!422 = !DIEnumerator(name: "MinimumStatistic", value: 5)
!423 = !DIEnumerator(name: "ModeStatistic", value: 6)
!424 = !DIEnumerator(name: "NonpeakStatistic", value: 7)
!425 = !DIEnumerator(name: "StandardDeviationStatistic", value: 8)
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!428 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0)
!429 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1)
!430 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2)
!431 = !DIEnumerator(name: "CopyAlphaChannel", value: 3)
!432 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4)
!433 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5)
!434 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6)
!435 = !DIEnumerator(name: "ResetAlphaChannel", value: 7)
!436 = !DIEnumerator(name: "SetAlphaChannel", value: 8)
!437 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9)
!438 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10)
!439 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11)
!440 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12)
!441 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !443, file: !442, line: 1140, baseType: !5, size: 32, elements: !726)
!442 = !DIFile(filename: "apps/538.imagick_r/src/magick/shear.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a152194db47b5d9d396ec7f4166535d4")
!443 = distinct !DISubprogram(name: "XShearImage", scope: !442, file: !442, line: 1134, type: !444, scopeLine: 1137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !674)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !447, !668, !671, !671, !672, !672, !673}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !450)
!450 = !{!451, !453, !455, !457, !461, !463, !464, !465, !466, !467, !468, !469, !480, !481, !482, !483, !485, !499, !501, !503, !505, !508, !509, !510, !516, !517, !518, !526, !527, !528, !529, !530, !531, !533, !535, !537, !539, !541, !543, !545, !546, !547, !548, !549, !550, !551, !559, !574, !588, !589, !590, !591, !595, !599, !603, !604, !605, !606, !607, !625, !626, !628, !629, !639, !640, !642, !643, !644, !645, !646, !647, !649, !650, !651, !652, !653, !654, !655, !657, !658, !659, !660, !661, !665, !667}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !449, file: !73, line: 153, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !449, file: !73, line: 156, baseType: !454, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !449, file: !73, line: 159, baseType: !456, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !449, file: !73, line: 162, baseType: !458, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !459, line: 46, baseType: !460)
!459 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!460 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !449, file: !73, line: 165, baseType: !462, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !449, file: !73, line: 168, baseType: !446, size: 32, offset: 224)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !449, file: !73, line: 169, baseType: !446, size: 32, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !449, file: !73, line: 172, baseType: !458, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !449, file: !73, line: 173, baseType: !458, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !449, file: !73, line: 174, baseType: !458, size: 64, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !449, file: !73, line: 175, baseType: !458, size: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !449, file: !73, line: 178, baseType: !470, size: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !473)
!473 = !{!474, !477, !478, !479}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !472, file: !326, line: 143, baseType: !475, size: 16)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !476)
!476 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !472, file: !326, line: 144, baseType: !475, size: 16, offset: 16)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !472, file: !326, line: 145, baseType: !475, size: 16, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !472, file: !326, line: 146, baseType: !475, size: 16, offset: 48)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !449, file: !73, line: 179, baseType: !471, size: 64, offset: 640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !449, file: !73, line: 180, baseType: !471, size: 64, offset: 704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !449, file: !73, line: 181, baseType: !471, size: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !449, file: !73, line: 184, baseType: !484, size: 64, offset: 832)
!484 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !449, file: !73, line: 187, baseType: !486, size: 768, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !488)
!488 = !{!489, !496, !497, !498}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !487, file: !73, line: 124, baseType: !490, size: 192)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !491, file: !73, line: 98, baseType: !484, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !491, file: !73, line: 99, baseType: !484, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !491, file: !73, line: 100, baseType: !484, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !487, file: !73, line: 125, baseType: !490, size: 192, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !487, file: !73, line: 126, baseType: !490, size: 192, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !487, file: !73, line: 127, baseType: !490, size: 192, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !449, file: !73, line: 190, baseType: !500, size: 32, offset: 1664)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !449, file: !73, line: 193, baseType: !502, size: 64, offset: 1728)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !449, file: !73, line: 196, baseType: !504, size: 32, offset: 1792)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !449, file: !73, line: 199, baseType: !506, size: 64, offset: 1856)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !449, file: !73, line: 200, baseType: !506, size: 64, offset: 1920)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !449, file: !73, line: 201, baseType: !506, size: 64, offset: 1984)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !449, file: !73, line: 204, baseType: !511, size: 64, offset: 2048)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !512, line: 77, baseType: !513)
!512 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !514, line: 193, baseType: !515)
!514 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!515 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !449, file: !73, line: 207, baseType: !484, size: 64, offset: 2112)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !449, file: !73, line: 208, baseType: !484, size: 64, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !449, file: !73, line: 211, baseType: !519, size: 256, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !521)
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !520, file: !153, line: 124, baseType: !458, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !520, file: !153, line: 125, baseType: !458, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !520, file: !153, line: 128, baseType: !511, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !520, file: !153, line: 129, baseType: !511, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !449, file: !73, line: 212, baseType: !519, size: 256, offset: 2496)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !449, file: !73, line: 213, baseType: !519, size: 256, offset: 2752)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !449, file: !73, line: 216, baseType: !484, size: 64, offset: 3008)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !449, file: !73, line: 217, baseType: !484, size: 64, offset: 3072)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !449, file: !73, line: 218, baseType: !484, size: 64, offset: 3136)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !449, file: !73, line: 221, baseType: !532, size: 32, offset: 3200)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !449, file: !73, line: 224, baseType: !534, size: 32, offset: 3232)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !449, file: !73, line: 227, baseType: !536, size: 32, offset: 3264)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !449, file: !73, line: 230, baseType: !538, size: 32, offset: 3296)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !449, file: !73, line: 233, baseType: !540, size: 32, offset: 3328)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !449, file: !73, line: 236, baseType: !542, size: 32, offset: 3360)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !449, file: !73, line: 239, baseType: !544, size: 64, offset: 3392)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !449, file: !73, line: 242, baseType: !458, size: 64, offset: 3456)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !449, file: !73, line: 243, baseType: !458, size: 64, offset: 3520)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !449, file: !73, line: 246, baseType: !511, size: 64, offset: 3584)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !449, file: !73, line: 249, baseType: !458, size: 64, offset: 3648)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !449, file: !73, line: 250, baseType: !458, size: 64, offset: 3712)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !449, file: !73, line: 253, baseType: !511, size: 64, offset: 3776)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !449, file: !73, line: 256, baseType: !552, size: 192, offset: 3840)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !553, line: 68, baseType: !554)
!553 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !553, line: 62, size: 192, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !554, file: !553, line: 65, baseType: !484, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !554, file: !553, line: 66, baseType: !484, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !554, file: !553, line: 67, baseType: !484, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !449, file: !73, line: 259, baseType: !560, size: 512, offset: 4032)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !562)
!562 = !{!563, !570, !571, !573}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !561, file: !247, line: 43, baseType: !564, size: 192)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !565, file: !247, line: 35, baseType: !484, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !565, file: !247, line: 36, baseType: !484, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !565, file: !247, line: 37, baseType: !484, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !561, file: !247, line: 44, baseType: !564, size: 192, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !561, file: !247, line: 47, baseType: !572, size: 32, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !561, file: !247, line: 50, baseType: !458, size: 64, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !449, file: !73, line: 262, baseType: !575, size: 64, offset: 4544)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !576, line: 26, baseType: !577)
!576 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!446, !580, !582, !585, !502}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !584)
!584 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !587)
!587 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !449, file: !73, line: 265, baseType: !502, size: 64, offset: 4608)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !449, file: !73, line: 266, baseType: !502, size: 64, offset: 4672)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !449, file: !73, line: 267, baseType: !502, size: 64, offset: 4736)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !449, file: !73, line: 270, baseType: !592, size: 64, offset: 4800)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !594)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !449, file: !73, line: 273, baseType: !596, size: 64, offset: 4864)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !598)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !449, file: !73, line: 276, baseType: !600, size: 32768, offset: 4928)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 32768, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 4096)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !449, file: !73, line: 277, baseType: !600, size: 32768, offset: 37696)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !449, file: !73, line: 278, baseType: !600, size: 32768, offset: 70464)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !449, file: !73, line: 281, baseType: !458, size: 64, offset: 103232)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !449, file: !73, line: 282, baseType: !458, size: 64, offset: 103296)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !449, file: !73, line: 285, baseType: !608, size: 448, offset: 103360)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !610)
!610 = !{!611, !613, !615, !616, !617, !618, !619, !624}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !609, file: !253, line: 105, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !609, file: !253, line: 108, baseType: !614, size: 32, offset: 32)
!614 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !609, file: !253, line: 111, baseType: !506, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !609, file: !253, line: 112, baseType: !506, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !609, file: !253, line: 115, baseType: !502, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !609, file: !253, line: 118, baseType: !446, size: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !609, file: !253, line: 121, baseType: !620, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !622, line: 26, baseType: !623)
!622 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !622, line: 25, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !609, file: !253, line: 124, baseType: !458, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !449, file: !73, line: 288, baseType: !446, size: 32, offset: 103808)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !449, file: !73, line: 291, baseType: !627, size: 64, offset: 103872)
!627 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !511)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !449, file: !73, line: 294, baseType: !620, size: 64, offset: 103936)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !449, file: !73, line: 297, baseType: !630, size: 256, offset: 104000)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !632)
!632 = !{!633, !634, !635, !638}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !631, file: !89, line: 30, baseType: !506, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !631, file: !89, line: 33, baseType: !458, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !631, file: !89, line: 36, baseType: !636, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !631, file: !89, line: 39, baseType: !458, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !449, file: !73, line: 298, baseType: !630, size: 256, offset: 104256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !449, file: !73, line: 299, baseType: !641, size: 64, offset: 104512)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !449, file: !73, line: 302, baseType: !458, size: 64, offset: 104576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !449, file: !73, line: 305, baseType: !458, size: 64, offset: 104640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !449, file: !73, line: 308, baseType: !544, size: 64, offset: 104704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !449, file: !73, line: 309, baseType: !544, size: 64, offset: 104768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !449, file: !73, line: 310, baseType: !544, size: 64, offset: 104832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !449, file: !73, line: 313, baseType: !648, size: 32, offset: 104896)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !449, file: !73, line: 316, baseType: !446, size: 32, offset: 104928)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !449, file: !73, line: 319, baseType: !471, size: 64, offset: 104960)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !449, file: !73, line: 322, baseType: !544, size: 64, offset: 105024)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !449, file: !73, line: 325, baseType: !519, size: 256, offset: 105088)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !449, file: !73, line: 328, baseType: !502, size: 64, offset: 105344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !449, file: !73, line: 329, baseType: !502, size: 64, offset: 105408)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !73, line: 332, baseType: !656, size: 32, offset: 105472)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !449, file: !73, line: 335, baseType: !446, size: 32, offset: 105504)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !449, file: !73, line: 338, baseType: !586, size: 64, offset: 105536)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !449, file: !73, line: 341, baseType: !446, size: 32, offset: 105600)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !449, file: !73, line: 344, baseType: !458, size: 64, offset: 105664)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !449, file: !73, line: 347, baseType: !662, size: 64, offset: 105728)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !663, line: 7, baseType: !664)
!663 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !514, line: 160, baseType: !515)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !449, file: !73, line: 350, baseType: !666, size: 32, offset: 105792)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !449, file: !73, line: 353, baseType: !458, size: 64, offset: 105856)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !670)
!670 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !686, !687, !688, !702, !703, !707, !708, !709, !710, !711, !715, !716, !718, !719, !720, !722, !723}
!675 = !DILocalVariable(name: "image", arg: 1, scope: !443, file: !442, line: 1134, type: !447)
!676 = !DILocalVariable(name: "degrees", arg: 2, scope: !443, file: !442, line: 1134, type: !668)
!677 = !DILocalVariable(name: "width", arg: 3, scope: !443, file: !442, line: 1135, type: !671)
!678 = !DILocalVariable(name: "height", arg: 4, scope: !443, file: !442, line: 1135, type: !671)
!679 = !DILocalVariable(name: "x_offset", arg: 5, scope: !443, file: !442, line: 1135, type: !672)
!680 = !DILocalVariable(name: "y_offset", arg: 6, scope: !443, file: !442, line: 1136, type: !672)
!681 = !DILocalVariable(name: "exception", arg: 7, scope: !443, file: !442, line: 1136, type: !673)
!682 = !DILocalVariable(name: "image_view", scope: !443, file: !442, line: 1147, type: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !394, line: 50, baseType: !685)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!686 = !DILocalVariable(name: "status", scope: !443, file: !442, line: 1150, type: !446)
!687 = !DILocalVariable(name: "progress", scope: !443, file: !442, line: 1153, type: !583)
!688 = !DILocalVariable(name: "background", scope: !443, file: !442, line: 1156, type: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !690, file: !326, line: 107, baseType: !452, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !690, file: !326, line: 110, baseType: !454, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !690, file: !326, line: 113, baseType: !446, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !690, file: !326, line: 116, baseType: !484, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !690, file: !326, line: 119, baseType: !458, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !690, file: !326, line: 122, baseType: !669, size: 32, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !690, file: !326, line: 123, baseType: !669, size: 32, offset: 288)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !690, file: !326, line: 124, baseType: !669, size: 32, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !690, file: !326, line: 125, baseType: !669, size: 32, offset: 352)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !690, file: !326, line: 126, baseType: !669, size: 32, offset: 384)
!702 = !DILocalVariable(name: "y", scope: !443, file: !442, line: 1159, type: !511)
!703 = !DILocalVariable(name: "pixel", scope: !704, file: !442, line: 1183, type: !689)
!704 = distinct !DILexicalBlock(scope: !705, file: !442, line: 1181, column: 3)
!705 = distinct !DILexicalBlock(scope: !706, file: !442, line: 1180, column: 3)
!706 = distinct !DILexicalBlock(scope: !443, file: !442, line: 1180, column: 3)
!707 = !DILocalVariable(name: "source", scope: !704, file: !442, line: 1184, type: !689)
!708 = !DILocalVariable(name: "destination", scope: !704, file: !442, line: 1185, type: !689)
!709 = !DILocalVariable(name: "area", scope: !704, file: !442, line: 1188, type: !669)
!710 = !DILocalVariable(name: "displacement", scope: !704, file: !442, line: 1189, type: !669)
!711 = !DILocalVariable(name: "indexes", scope: !704, file: !442, line: 1192, type: !712)
!712 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !475)
!715 = !DILocalVariable(name: "shear_indexes", scope: !704, file: !442, line: 1193, type: !712)
!716 = !DILocalVariable(name: "p", scope: !704, file: !442, line: 1196, type: !717)
!717 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !470)
!718 = !DILocalVariable(name: "q", scope: !704, file: !442, line: 1197, type: !717)
!719 = !DILocalVariable(name: "i", scope: !704, file: !442, line: 1200, type: !511)
!720 = !DILocalVariable(name: "direction", scope: !704, file: !442, line: 1203, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShearDirection", scope: !443, file: !442, line: 1144, baseType: !441)
!722 = !DILocalVariable(name: "step", scope: !704, file: !442, line: 1206, type: !511)
!723 = !DILocalVariable(name: "proceed", scope: !724, file: !442, line: 1305, type: !446)
!724 = distinct !DILexicalBlock(scope: !725, file: !442, line: 1303, column: 7)
!725 = distinct !DILexicalBlock(scope: !704, file: !442, line: 1302, column: 9)
!726 = !{!727, !728}
!727 = !DIEnumerator(name: "LEFT", value: 0)
!728 = !DIEnumerator(name: "RIGHT", value: 1)
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !730, file: !442, line: 1361, baseType: !5, size: 32, elements: !763)
!730 = distinct !DISubprogram(name: "YShearImage", scope: !442, file: !442, line: 1355, type: !444, scopeLine: 1358, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !760}
!732 = !DILocalVariable(name: "image", arg: 1, scope: !730, file: !442, line: 1355, type: !447)
!733 = !DILocalVariable(name: "degrees", arg: 2, scope: !730, file: !442, line: 1355, type: !668)
!734 = !DILocalVariable(name: "width", arg: 3, scope: !730, file: !442, line: 1356, type: !671)
!735 = !DILocalVariable(name: "height", arg: 4, scope: !730, file: !442, line: 1356, type: !671)
!736 = !DILocalVariable(name: "x_offset", arg: 5, scope: !730, file: !442, line: 1356, type: !672)
!737 = !DILocalVariable(name: "y_offset", arg: 6, scope: !730, file: !442, line: 1357, type: !672)
!738 = !DILocalVariable(name: "exception", arg: 7, scope: !730, file: !442, line: 1357, type: !673)
!739 = !DILocalVariable(name: "image_view", scope: !730, file: !442, line: 1368, type: !683)
!740 = !DILocalVariable(name: "status", scope: !730, file: !442, line: 1371, type: !446)
!741 = !DILocalVariable(name: "progress", scope: !730, file: !442, line: 1374, type: !583)
!742 = !DILocalVariable(name: "background", scope: !730, file: !442, line: 1377, type: !689)
!743 = !DILocalVariable(name: "x", scope: !730, file: !442, line: 1380, type: !511)
!744 = !DILocalVariable(name: "step", scope: !745, file: !442, line: 1404, type: !511)
!745 = distinct !DILexicalBlock(scope: !746, file: !442, line: 1402, column: 3)
!746 = distinct !DILexicalBlock(scope: !747, file: !442, line: 1401, column: 3)
!747 = distinct !DILexicalBlock(scope: !730, file: !442, line: 1401, column: 3)
!748 = !DILocalVariable(name: "pixel", scope: !745, file: !442, line: 1407, type: !689)
!749 = !DILocalVariable(name: "source", scope: !745, file: !442, line: 1408, type: !689)
!750 = !DILocalVariable(name: "destination", scope: !745, file: !442, line: 1409, type: !689)
!751 = !DILocalVariable(name: "area", scope: !745, file: !442, line: 1412, type: !669)
!752 = !DILocalVariable(name: "displacement", scope: !745, file: !442, line: 1413, type: !669)
!753 = !DILocalVariable(name: "indexes", scope: !745, file: !442, line: 1416, type: !712)
!754 = !DILocalVariable(name: "shear_indexes", scope: !745, file: !442, line: 1417, type: !712)
!755 = !DILocalVariable(name: "i", scope: !745, file: !442, line: 1420, type: !511)
!756 = !DILocalVariable(name: "p", scope: !745, file: !442, line: 1423, type: !717)
!757 = !DILocalVariable(name: "q", scope: !745, file: !442, line: 1424, type: !717)
!758 = !DILocalVariable(name: "direction", scope: !745, file: !442, line: 1427, type: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShearDirection", scope: !730, file: !442, line: 1365, baseType: !729)
!760 = !DILocalVariable(name: "proceed", scope: !761, file: !442, line: 1526, type: !446)
!761 = distinct !DILexicalBlock(scope: !762, file: !442, line: 1524, column: 7)
!762 = distinct !DILexicalBlock(scope: !745, file: !442, line: 1523, column: 9)
!763 = !{!764, !765}
!764 = !DIEnumerator(name: "UP", value: 0)
!765 = !DIEnumerator(name: "DOWN", value: 1)
!766 = !{!767, !458, !502, !460, !447, !511, !484, !580, !768, !470, !713, !575, !583, !714, !770, !669, !772, !637, !476, !475, !776}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatrixInfo", file: !774, line: 26, baseType: !775)
!774 = !DIFile(filename: "apps/538.imagick_r/src/magick/matrix.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "eb3e46c8fbd61488836928d66ca395c0")
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MatrixInfo", file: !774, line: 25, flags: DIFlagFwdDecl)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!777 = !{i32 7, !"Dwarf Version", i32 5}
!778 = !{i32 2, !"Debug Info Version", i32 3}
!779 = !{i32 1, !"wchar_size", i32 4}
!780 = !{i32 7, !"PIC Level", i32 2}
!781 = !{i32 7, !"PIE Level", i32 2}
!782 = !{i32 7, !"uwtable", i32 2}
!783 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!784 = distinct !DISubprogram(name: "DeskewImage", scope: !442, file: !442, line: 565, type: !785, scopeLine: 567, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !790)
!785 = !DISubroutineType(types: !786)
!786 = !{!447, !787, !789, !673}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!790 = !{!791, !792, !793, !794, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817}
!791 = !DILocalVariable(name: "image", arg: 1, scope: !784, file: !442, line: 565, type: !787)
!792 = !DILocalVariable(name: "threshold", arg: 2, scope: !784, file: !442, line: 565, type: !789)
!793 = !DILocalVariable(name: "exception", arg: 3, scope: !784, file: !442, line: 566, type: !673)
!794 = !DILocalVariable(name: "affine_matrix", scope: !784, file: !442, line: 569, type: !795)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !153, line: 102, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !153, line: 93, size: 384, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !796, file: !153, line: 96, baseType: !484, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !796, file: !153, line: 97, baseType: !484, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !796, file: !153, line: 98, baseType: !484, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !796, file: !153, line: 99, baseType: !484, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !796, file: !153, line: 100, baseType: !484, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !796, file: !153, line: 101, baseType: !484, size: 64, offset: 320)
!804 = !DILocalVariable(name: "artifact", scope: !784, file: !442, line: 572, type: !580)
!805 = !DILocalVariable(name: "degrees", scope: !784, file: !442, line: 575, type: !484)
!806 = !DILocalVariable(name: "clone_image", scope: !784, file: !442, line: 578, type: !447)
!807 = !DILocalVariable(name: "crop_image", scope: !784, file: !442, line: 579, type: !447)
!808 = !DILocalVariable(name: "deskew_image", scope: !784, file: !442, line: 580, type: !447)
!809 = !DILocalVariable(name: "median_image", scope: !784, file: !442, line: 581, type: !447)
!810 = !DILocalVariable(name: "status", scope: !784, file: !442, line: 584, type: !446)
!811 = !DILocalVariable(name: "geometry", scope: !784, file: !442, line: 587, type: !519)
!812 = !DILocalVariable(name: "i", scope: !784, file: !442, line: 590, type: !511)
!813 = !DILocalVariable(name: "max_projection", scope: !784, file: !442, line: 593, type: !458)
!814 = !DILocalVariable(name: "projection", scope: !784, file: !442, line: 594, type: !767)
!815 = !DILocalVariable(name: "width", scope: !784, file: !442, line: 595, type: !458)
!816 = !DILocalVariable(name: "skew", scope: !784, file: !442, line: 598, type: !511)
!817 = !DILocalVariable(name: "angle", scope: !818, file: !442, line: 637, type: !600)
!818 = distinct !DILexicalBlock(scope: !784, file: !442, line: 635, column: 3)
!819 = !DILocation(line: 0, scope: !784)
!820 = !DILocation(line: 568, column: 3, scope: !784)
!821 = !DILocation(line: 569, column: 5, scope: !784)
!822 = !DILocation(line: 586, column: 3, scope: !784)
!823 = !DILocation(line: 587, column: 5, scope: !784)
!824 = !{!825, !828, i64 40}
!825 = !{!"_Image", !826, i64 0, !826, i64 4, !826, i64 8, !828, i64 16, !826, i64 24, !826, i64 28, !826, i64 32, !828, i64 40, !828, i64 48, !828, i64 56, !828, i64 64, !829, i64 72, !830, i64 80, !830, i64 88, !830, i64 96, !832, i64 104, !833, i64 112, !826, i64 208, !829, i64 216, !826, i64 224, !829, i64 232, !829, i64 240, !829, i64 248, !828, i64 256, !832, i64 264, !832, i64 272, !835, i64 280, !835, i64 312, !835, i64 344, !832, i64 376, !832, i64 384, !832, i64 392, !826, i64 400, !826, i64 404, !826, i64 408, !826, i64 412, !826, i64 416, !826, i64 420, !829, i64 424, !828, i64 432, !828, i64 440, !828, i64 448, !828, i64 456, !828, i64 464, !828, i64 472, !836, i64 480, !837, i64 504, !829, i64 568, !829, i64 576, !829, i64 584, !829, i64 592, !829, i64 600, !829, i64 608, !826, i64 616, !826, i64 4712, !826, i64 8808, !828, i64 12904, !828, i64 12912, !839, i64 12920, !826, i64 12976, !828, i64 12984, !829, i64 12992, !841, i64 13000, !841, i64 13032, !829, i64 13064, !828, i64 13072, !828, i64 13080, !829, i64 13088, !829, i64 13096, !829, i64 13104, !826, i64 13112, !826, i64 13116, !830, i64 13120, !829, i64 13128, !835, i64 13136, !829, i64 13168, !829, i64 13176, !826, i64 13184, !826, i64 13188, !842, i64 13192, !826, i64 13200, !828, i64 13208, !828, i64 13216, !826, i64 13224, !828, i64 13232}
!826 = !{!"omnipotent char", !827, i64 0}
!827 = !{!"Simple C/C++ TBAA"}
!828 = !{!"long", !826, i64 0}
!829 = !{!"any pointer", !826, i64 0}
!830 = !{!"_PixelPacket", !831, i64 0, !831, i64 2, !831, i64 4, !831, i64 6}
!831 = !{!"short", !826, i64 0}
!832 = !{!"double", !826, i64 0}
!833 = !{!"_ChromaticityInfo", !834, i64 0, !834, i64 24, !834, i64 48, !834, i64 72}
!834 = !{!"_PrimaryInfo", !832, i64 0, !832, i64 8, !832, i64 16}
!835 = !{!"_RectangleInfo", !828, i64 0, !828, i64 8, !828, i64 16, !828, i64 24}
!836 = !{!"_ErrorInfo", !832, i64 0, !832, i64 8, !832, i64 16}
!837 = !{!"_TimerInfo", !838, i64 0, !838, i64 24, !826, i64 48, !828, i64 56}
!838 = !{!"_Timer", !832, i64 0, !832, i64 8, !832, i64 16}
!839 = !{!"_ExceptionInfo", !826, i64 0, !840, i64 4, !829, i64 8, !829, i64 16, !829, i64 24, !826, i64 32, !829, i64 40, !828, i64 48}
!840 = !{!"int", !826, i64 0}
!841 = !{!"_ProfileInfo", !829, i64 0, !828, i64 8, !829, i64 16, !828, i64 24}
!842 = !{!"long long", !826, i64 0}
!843 = !DILocation(line: 603, column: 8, scope: !844)
!844 = distinct !DILexicalBlock(scope: !784, file: !442, line: 603, column: 3)
!845 = !DILocation(line: 0, scope: !844)
!846 = !DILocation(line: 603, column: 23, scope: !847)
!847 = distinct !DILexicalBlock(scope: !844, file: !442, line: 603, column: 3)
!848 = !DILocation(line: 603, column: 54, scope: !847)
!849 = !DILocation(line: 603, column: 3, scope: !844)
!850 = distinct !{!850, !849, !851, !852, !853}
!851 = !DILocation(line: 603, column: 60, scope: !844)
!852 = !{!"llvm.loop.mustprogress"}
!853 = !{!"llvm.loop.unroll.disable"}
!854 = !DILocation(line: 604, column: 63, scope: !784)
!855 = !DILocation(line: 604, column: 25, scope: !784)
!856 = !DILocation(line: 606, column: 18, scope: !857)
!857 = distinct !DILexicalBlock(scope: !784, file: !442, line: 606, column: 7)
!858 = !DILocation(line: 606, column: 7, scope: !784)
!859 = !DILocation(line: 607, column: 5, scope: !860)
!860 = distinct !DILexicalBlock(scope: !857, file: !442, line: 607, column: 5)
!861 = !DILocalVariable(name: "image", arg: 1, scope: !862, file: !442, line: 329, type: !787)
!862 = distinct !DISubprogram(name: "RadonTransform", scope: !442, file: !442, line: 329, type: !863, scopeLine: 331, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !865)
!863 = !DISubroutineType(types: !864)
!864 = !{!446, !787, !789, !767, !673}
!865 = !{!861, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !882, !887, !888, !889, !890, !891, !892, !896, !897, !898, !899, !900}
!866 = !DILocalVariable(name: "threshold", arg: 2, scope: !862, file: !442, line: 330, type: !789)
!867 = !DILocalVariable(name: "projection", arg: 3, scope: !862, file: !442, line: 330, type: !767)
!868 = !DILocalVariable(name: "exception", arg: 4, scope: !862, file: !442, line: 330, type: !673)
!869 = !DILocalVariable(name: "image_view", scope: !862, file: !442, line: 333, type: !683)
!870 = !DILocalVariable(name: "destination_matrix", scope: !862, file: !442, line: 336, type: !772)
!871 = !DILocalVariable(name: "source_matrix", scope: !862, file: !442, line: 337, type: !772)
!872 = !DILocalVariable(name: "status", scope: !862, file: !442, line: 340, type: !446)
!873 = !DILocalVariable(name: "i", scope: !862, file: !442, line: 343, type: !511)
!874 = !DILocalVariable(name: "count", scope: !862, file: !442, line: 346, type: !458)
!875 = !DILocalVariable(name: "width", scope: !862, file: !442, line: 347, type: !458)
!876 = !DILocalVariable(name: "y", scope: !862, file: !442, line: 350, type: !511)
!877 = !DILocalVariable(name: "byte", scope: !862, file: !442, line: 353, type: !637)
!878 = !DILocalVariable(name: "bits", scope: !862, file: !442, line: 356, type: !879)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 4096, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 256)
!882 = !DILocalVariable(name: "p", scope: !883, file: !442, line: 394, type: !886)
!883 = distinct !DILexicalBlock(scope: !884, file: !442, line: 392, column: 3)
!884 = distinct !DILexicalBlock(scope: !885, file: !442, line: 391, column: 3)
!885 = distinct !DILexicalBlock(scope: !862, file: !442, line: 391, column: 3)
!886 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !768)
!887 = !DILocalVariable(name: "i", scope: !883, file: !442, line: 397, type: !511)
!888 = !DILocalVariable(name: "x", scope: !883, file: !442, line: 398, type: !511)
!889 = !DILocalVariable(name: "bit", scope: !883, file: !442, line: 401, type: !458)
!890 = !DILocalVariable(name: "byte", scope: !883, file: !442, line: 402, type: !458)
!891 = !DILocalVariable(name: "value", scope: !883, file: !442, line: 405, type: !476)
!892 = !DILocalVariable(name: "p", scope: !893, file: !442, line: 451, type: !886)
!893 = distinct !DILexicalBlock(scope: !894, file: !442, line: 449, column: 3)
!894 = distinct !DILexicalBlock(scope: !895, file: !442, line: 448, column: 3)
!895 = distinct !DILexicalBlock(scope: !862, file: !442, line: 448, column: 3)
!896 = !DILocalVariable(name: "i", scope: !893, file: !442, line: 454, type: !511)
!897 = !DILocalVariable(name: "x", scope: !893, file: !442, line: 455, type: !511)
!898 = !DILocalVariable(name: "bit", scope: !893, file: !442, line: 458, type: !458)
!899 = !DILocalVariable(name: "byte", scope: !893, file: !442, line: 459, type: !458)
!900 = !DILocalVariable(name: "value", scope: !893, file: !442, line: 462, type: !476)
!901 = !DILocation(line: 0, scope: !862, inlinedAt: !902)
!902 = distinct !DILocation(line: 608, column: 10, scope: !784)
!903 = !DILocation(line: 355, column: 3, scope: !862, inlinedAt: !902)
!904 = !DILocation(line: 356, column: 5, scope: !862, inlinedAt: !902)
!905 = !DILocation(line: 358, column: 8, scope: !906, inlinedAt: !902)
!906 = distinct !DILexicalBlock(scope: !862, file: !442, line: 358, column: 3)
!907 = !DILocation(line: 0, scope: !906, inlinedAt: !902)
!908 = !DILocation(line: 358, column: 23, scope: !909, inlinedAt: !902)
!909 = distinct !DILexicalBlock(scope: !906, file: !442, line: 358, column: 3)
!910 = !DILocation(line: 358, column: 54, scope: !909, inlinedAt: !902)
!911 = !DILocation(line: 358, column: 3, scope: !906, inlinedAt: !902)
!912 = distinct !{!912, !911, !913, !852, !853}
!913 = !DILocation(line: 358, column: 60, scope: !906, inlinedAt: !902)
!914 = !DILocation(line: 359, column: 48, scope: !862, inlinedAt: !902)
!915 = !{!825, !828, i64 48}
!916 = !DILocation(line: 359, column: 17, scope: !862, inlinedAt: !902)
!917 = !DILocation(line: 361, column: 53, scope: !862, inlinedAt: !902)
!918 = !DILocation(line: 361, column: 22, scope: !862, inlinedAt: !902)
!919 = !DILocation(line: 363, column: 22, scope: !920, inlinedAt: !902)
!920 = distinct !DILexicalBlock(scope: !862, file: !442, line: 363, column: 7)
!921 = !DILocation(line: 363, column: 46, scope: !920, inlinedAt: !902)
!922 = !DILocation(line: 366, column: 11, scope: !923, inlinedAt: !902)
!923 = distinct !DILexicalBlock(scope: !920, file: !442, line: 365, column: 5)
!924 = !DILocation(line: 367, column: 28, scope: !925, inlinedAt: !902)
!925 = distinct !DILexicalBlock(scope: !923, file: !442, line: 366, column: 11)
!926 = !DILocation(line: 367, column: 9, scope: !925, inlinedAt: !902)
!927 = !DILocation(line: 368, column: 11, scope: !923, inlinedAt: !902)
!928 = !DILocation(line: 372, column: 7, scope: !929, inlinedAt: !902)
!929 = distinct !DILexicalBlock(scope: !862, file: !442, line: 372, column: 7)
!930 = !DILocation(line: 372, column: 33, scope: !929, inlinedAt: !902)
!931 = !DILocation(line: 372, column: 7, scope: !862, inlinedAt: !902)
!932 = !DILocation(line: 374, column: 26, scope: !933, inlinedAt: !902)
!933 = distinct !DILexicalBlock(scope: !929, file: !442, line: 373, column: 5)
!934 = !DILocation(line: 376, column: 7, scope: !933, inlinedAt: !902)
!935 = !DILocation(line: 380, column: 10, scope: !936, inlinedAt: !902)
!936 = distinct !DILexicalBlock(scope: !937, file: !442, line: 379, column: 3)
!937 = distinct !DILexicalBlock(scope: !938, file: !442, line: 378, column: 3)
!938 = distinct !DILexicalBlock(scope: !862, file: !442, line: 378, column: 3)
!939 = !DILocation(line: 381, column: 24, scope: !940, inlinedAt: !902)
!940 = distinct !DILexicalBlock(scope: !941, file: !442, line: 381, column: 5)
!941 = distinct !DILexicalBlock(scope: !936, file: !442, line: 381, column: 5)
!942 = !DILocation(line: 381, column: 5, scope: !941, inlinedAt: !902)
!943 = !DILocation(line: 382, column: 12, scope: !940, inlinedAt: !902)
!944 = !DILocation(line: 381, column: 34, scope: !940, inlinedAt: !902)
!945 = distinct !{!945, !942, !946, !852, !853}
!946 = !DILocation(line: 382, column: 21, scope: !941, inlinedAt: !902)
!947 = !DILocation(line: 0, scope: !941, inlinedAt: !902)
!948 = !DILocation(line: 383, column: 5, scope: !936, inlinedAt: !902)
!949 = !DILocation(line: 383, column: 12, scope: !936, inlinedAt: !902)
!950 = !{!831, !831, i64 0}
!951 = !DILocation(line: 378, column: 23, scope: !937, inlinedAt: !902)
!952 = !DILocation(line: 378, column: 15, scope: !937, inlinedAt: !902)
!953 = !DILocation(line: 378, column: 3, scope: !938, inlinedAt: !902)
!954 = distinct !{!954, !953, !955, !852, !853}
!955 = !DILocation(line: 384, column: 3, scope: !938, inlinedAt: !902)
!956 = !DILocation(line: 386, column: 14, scope: !862, inlinedAt: !902)
!957 = !DILocation(line: 391, column: 34, scope: !884, inlinedAt: !902)
!958 = !DILocation(line: 391, column: 15, scope: !884, inlinedAt: !902)
!959 = !DILocation(line: 391, column: 3, scope: !885, inlinedAt: !902)
!960 = !DILocation(line: 404, column: 5, scope: !883, inlinedAt: !902)
!961 = !DILocation(line: 407, column: 16, scope: !962, inlinedAt: !902)
!962 = distinct !DILexicalBlock(scope: !883, file: !442, line: 407, column: 9)
!963 = !DILocation(line: 407, column: 9, scope: !883, inlinedAt: !902)
!964 = !DILocation(line: 409, column: 55, scope: !883, inlinedAt: !902)
!965 = !DILocation(line: 409, column: 7, scope: !883, inlinedAt: !902)
!966 = !DILocation(line: 0, scope: !883, inlinedAt: !902)
!967 = !DILocation(line: 410, column: 11, scope: !968, inlinedAt: !902)
!968 = distinct !DILexicalBlock(scope: !883, file: !442, line: 410, column: 9)
!969 = !DILocation(line: 410, column: 9, scope: !883, inlinedAt: !902)
!970 = !DILocation(line: 417, column: 25, scope: !883, inlinedAt: !902)
!971 = !DILocation(line: 418, column: 17, scope: !972, inlinedAt: !902)
!972 = distinct !DILexicalBlock(scope: !973, file: !442, line: 418, column: 5)
!973 = distinct !DILexicalBlock(scope: !883, file: !442, line: 418, column: 5)
!974 = !DILocation(line: 418, column: 5, scope: !973, inlinedAt: !902)
!975 = !DILocation(line: 417, column: 32, scope: !883, inlinedAt: !902)
!976 = !DILocation(line: 417, column: 35, scope: !883, inlinedAt: !902)
!977 = !DILocation(line: 420, column: 11, scope: !978, inlinedAt: !902)
!978 = distinct !DILexicalBlock(scope: !972, file: !442, line: 419, column: 5)
!979 = !DILocation(line: 421, column: 29, scope: !980, inlinedAt: !902)
!980 = distinct !DILexicalBlock(scope: !978, file: !442, line: 421, column: 11)
!981 = !{!830, !831, i64 4}
!982 = !DILocation(line: 421, column: 12, scope: !980, inlinedAt: !902)
!983 = !DILocation(line: 421, column: 44, scope: !980, inlinedAt: !902)
!984 = !DILocation(line: 421, column: 57, scope: !980, inlinedAt: !902)
!985 = !DILocation(line: 422, column: 29, scope: !980, inlinedAt: !902)
!986 = !{!830, !831, i64 2}
!987 = !DILocation(line: 422, column: 12, scope: !980, inlinedAt: !902)
!988 = !DILocation(line: 422, column: 46, scope: !980, inlinedAt: !902)
!989 = !DILocation(line: 422, column: 59, scope: !980, inlinedAt: !902)
!990 = !DILocation(line: 423, column: 29, scope: !980, inlinedAt: !902)
!991 = !{!830, !831, i64 0}
!992 = !DILocation(line: 423, column: 12, scope: !980, inlinedAt: !902)
!993 = !DILocation(line: 423, column: 45, scope: !980, inlinedAt: !902)
!994 = !DILocation(line: 421, column: 11, scope: !978, inlinedAt: !902)
!995 = !DILocation(line: 424, column: 13, scope: !980, inlinedAt: !902)
!996 = !DILocation(line: 424, column: 9, scope: !980, inlinedAt: !902)
!997 = !DILocation(line: 0, scope: !978, inlinedAt: !902)
!998 = !DILocation(line: 425, column: 10, scope: !978, inlinedAt: !902)
!999 = !DILocation(line: 426, column: 15, scope: !1000, inlinedAt: !902)
!1000 = distinct !DILexicalBlock(scope: !978, file: !442, line: 426, column: 11)
!1001 = !DILocation(line: 426, column: 11, scope: !978, inlinedAt: !902)
!1002 = !DILocation(line: 433, column: 8, scope: !978, inlinedAt: !902)
!1003 = !DILocation(line: 418, column: 46, scope: !972, inlinedAt: !902)
!1004 = distinct !{!1004, !974, !1005, !852, !853}
!1005 = !DILocation(line: 434, column: 5, scope: !973, inlinedAt: !902)
!1006 = !DILocation(line: 428, column: 17, scope: !1007, inlinedAt: !902)
!1007 = distinct !DILexicalBlock(scope: !1000, file: !442, line: 427, column: 9)
!1008 = !DILocation(line: 428, column: 16, scope: !1007, inlinedAt: !902)
!1009 = !DILocation(line: 429, column: 49, scope: !1007, inlinedAt: !902)
!1010 = !DILocation(line: 429, column: 18, scope: !1007, inlinedAt: !902)
!1011 = !DILocation(line: 418, column: 36, scope: !972, inlinedAt: !902)
!1012 = !DILocation(line: 437, column: 18, scope: !1013, inlinedAt: !902)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !442, line: 436, column: 7)
!1014 = distinct !DILexicalBlock(scope: !883, file: !442, line: 435, column: 9)
!1015 = !DILocation(line: 437, column: 13, scope: !1013, inlinedAt: !902)
!1016 = !DILocation(line: 438, column: 15, scope: !1013, inlinedAt: !902)
!1017 = !DILocation(line: 438, column: 14, scope: !1013, inlinedAt: !902)
!1018 = !DILocation(line: 439, column: 47, scope: !1013, inlinedAt: !902)
!1019 = !DILocation(line: 439, column: 16, scope: !1013, inlinedAt: !902)
!1020 = !DILocation(line: 440, column: 7, scope: !1013, inlinedAt: !902)
!1021 = !DILocation(line: 441, column: 3, scope: !884, inlinedAt: !902)
!1022 = !DILocation(line: 391, column: 41, scope: !884, inlinedAt: !902)
!1023 = distinct !{!1023, !959, !1024, !852, !853}
!1024 = !DILocation(line: 441, column: 3, scope: !885, inlinedAt: !902)
!1025 = !DILocation(line: 385, column: 9, scope: !862, inlinedAt: !902)
!1026 = !DILocation(line: 442, column: 3, scope: !862, inlinedAt: !902)
!1027 = !DILocation(line: 443, column: 10, scope: !862, inlinedAt: !902)
!1028 = !DILocation(line: 448, column: 34, scope: !894, inlinedAt: !902)
!1029 = !DILocation(line: 448, column: 15, scope: !894, inlinedAt: !902)
!1030 = !DILocation(line: 448, column: 3, scope: !895, inlinedAt: !902)
!1031 = !DILocation(line: 461, column: 5, scope: !893, inlinedAt: !902)
!1032 = !DILocation(line: 464, column: 16, scope: !1033, inlinedAt: !902)
!1033 = distinct !DILexicalBlock(scope: !893, file: !442, line: 464, column: 9)
!1034 = !DILocation(line: 464, column: 9, scope: !893, inlinedAt: !902)
!1035 = !DILocation(line: 466, column: 55, scope: !893, inlinedAt: !902)
!1036 = !DILocation(line: 466, column: 7, scope: !893, inlinedAt: !902)
!1037 = !DILocation(line: 0, scope: !893, inlinedAt: !902)
!1038 = !DILocation(line: 467, column: 11, scope: !1039, inlinedAt: !902)
!1039 = distinct !DILexicalBlock(scope: !893, file: !442, line: 467, column: 9)
!1040 = !DILocation(line: 467, column: 9, scope: !893, inlinedAt: !902)
!1041 = !DILocation(line: 475, column: 36, scope: !1042, inlinedAt: !902)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !442, line: 475, column: 5)
!1043 = distinct !DILexicalBlock(scope: !893, file: !442, line: 475, column: 5)
!1044 = !DILocation(line: 475, column: 17, scope: !1042, inlinedAt: !902)
!1045 = !DILocation(line: 475, column: 5, scope: !1043, inlinedAt: !902)
!1046 = !DILocation(line: 477, column: 11, scope: !1047, inlinedAt: !902)
!1047 = distinct !DILexicalBlock(scope: !1042, file: !442, line: 476, column: 5)
!1048 = !DILocation(line: 478, column: 29, scope: !1049, inlinedAt: !902)
!1049 = distinct !DILexicalBlock(scope: !1047, file: !442, line: 478, column: 11)
!1050 = !DILocation(line: 478, column: 12, scope: !1049, inlinedAt: !902)
!1051 = !DILocation(line: 478, column: 44, scope: !1049, inlinedAt: !902)
!1052 = !DILocation(line: 478, column: 57, scope: !1049, inlinedAt: !902)
!1053 = !DILocation(line: 479, column: 29, scope: !1049, inlinedAt: !902)
!1054 = !DILocation(line: 479, column: 12, scope: !1049, inlinedAt: !902)
!1055 = !DILocation(line: 479, column: 46, scope: !1049, inlinedAt: !902)
!1056 = !DILocation(line: 479, column: 59, scope: !1049, inlinedAt: !902)
!1057 = !DILocation(line: 480, column: 29, scope: !1049, inlinedAt: !902)
!1058 = !DILocation(line: 480, column: 12, scope: !1049, inlinedAt: !902)
!1059 = !DILocation(line: 480, column: 45, scope: !1049, inlinedAt: !902)
!1060 = !DILocation(line: 478, column: 11, scope: !1047, inlinedAt: !902)
!1061 = !DILocation(line: 481, column: 13, scope: !1049, inlinedAt: !902)
!1062 = !DILocation(line: 481, column: 9, scope: !1049, inlinedAt: !902)
!1063 = !DILocation(line: 0, scope: !1047, inlinedAt: !902)
!1064 = !DILocation(line: 482, column: 10, scope: !1047, inlinedAt: !902)
!1065 = !DILocation(line: 483, column: 15, scope: !1066, inlinedAt: !902)
!1066 = distinct !DILexicalBlock(scope: !1047, file: !442, line: 483, column: 11)
!1067 = !DILocation(line: 483, column: 11, scope: !1047, inlinedAt: !902)
!1068 = !DILocation(line: 490, column: 8, scope: !1047, inlinedAt: !902)
!1069 = !DILocation(line: 475, column: 46, scope: !1042, inlinedAt: !902)
!1070 = distinct !{!1070, !1045, !1071, !852, !853}
!1071 = !DILocation(line: 491, column: 5, scope: !1043, inlinedAt: !902)
!1072 = !DILocation(line: 485, column: 17, scope: !1073, inlinedAt: !902)
!1073 = distinct !DILexicalBlock(scope: !1066, file: !442, line: 484, column: 9)
!1074 = !DILocation(line: 485, column: 16, scope: !1073, inlinedAt: !902)
!1075 = !DILocation(line: 486, column: 50, scope: !1073, inlinedAt: !902)
!1076 = !DILocation(line: 486, column: 18, scope: !1073, inlinedAt: !902)
!1077 = !DILocation(line: 494, column: 18, scope: !1078, inlinedAt: !902)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !442, line: 493, column: 7)
!1079 = distinct !DILexicalBlock(scope: !893, file: !442, line: 492, column: 9)
!1080 = !DILocation(line: 494, column: 13, scope: !1078, inlinedAt: !902)
!1081 = !DILocation(line: 495, column: 15, scope: !1078, inlinedAt: !902)
!1082 = !DILocation(line: 495, column: 14, scope: !1078, inlinedAt: !902)
!1083 = !DILocation(line: 496, column: 16, scope: !1078, inlinedAt: !902)
!1084 = !DILocation(line: 497, column: 7, scope: !1078, inlinedAt: !902)
!1085 = !DILocation(line: 498, column: 3, scope: !894, inlinedAt: !902)
!1086 = !DILocation(line: 448, column: 41, scope: !894, inlinedAt: !902)
!1087 = distinct !{!1087, !1030, !1088, !852, !853}
!1088 = !DILocation(line: 498, column: 3, scope: !895, inlinedAt: !902)
!1089 = !DILocation(line: 499, column: 3, scope: !862, inlinedAt: !902)
!1090 = !DILocation(line: 500, column: 14, scope: !862, inlinedAt: !902)
!1091 = !DILocation(line: 501, column: 22, scope: !862, inlinedAt: !902)
!1092 = !DILocation(line: 502, column: 17, scope: !862, inlinedAt: !902)
!1093 = !DILocation(line: 504, column: 1, scope: !862, inlinedAt: !902)
!1094 = !DILocation(line: 616, column: 15, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !442, line: 616, column: 3)
!1096 = distinct !DILexicalBlock(scope: !784, file: !442, line: 616, column: 3)
!1097 = !DILocation(line: 616, column: 3, scope: !1096)
!1098 = !DILocation(line: 611, column: 29, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !442, line: 610, column: 5)
!1100 = distinct !DILexicalBlock(scope: !784, file: !442, line: 609, column: 7)
!1101 = !DILocation(line: 612, column: 7, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1099, file: !442, line: 612, column: 7)
!1103 = !DILocation(line: 618, column: 9, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !442, line: 618, column: 9)
!1105 = distinct !DILexicalBlock(scope: !1095, file: !442, line: 617, column: 3)
!1106 = !{!828, !828, i64 0}
!1107 = !DILocation(line: 618, column: 23, scope: !1104)
!1108 = !DILocation(line: 618, column: 9, scope: !1105)
!1109 = !DILocation(line: 616, column: 41, scope: !1095)
!1110 = distinct !{!1110, !1097, !1111, !852, !853}
!1111 = !DILocation(line: 623, column: 3, scope: !1096)
!1112 = !DILocation(line: 624, column: 25, scope: !784)
!1113 = !DILocation(line: 625, column: 48, scope: !784)
!1114 = !DILocation(line: 625, column: 47, scope: !784)
!1115 = !DILocation(line: 625, column: 53, scope: !784)
!1116 = !DILocation(line: 625, column: 29, scope: !784)
!1117 = !DILocation(line: 625, column: 28, scope: !784)
!1118 = !DILocalVariable(name: "radians", arg: 1, scope: !1119, file: !1120, line: 59, type: !668)
!1119 = distinct !DISubprogram(name: "RadiansToDegrees", scope: !1120, file: !1120, line: 59, type: !1121, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1123)
!1120 = !DIFile(filename: "apps/538.imagick_r/src/magick/image-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "35ccb704e07ae6f7e4c200a043674ce8")
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!669, !668}
!1123 = !{!1118}
!1124 = !DILocation(line: 0, scope: !1119, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 625, column: 11, scope: !784)
!1126 = !DILocation(line: 61, column: 34, scope: !1119, inlinedAt: !1125)
!1127 = !DILocation(line: 61, column: 33, scope: !1119, inlinedAt: !1125)
!1128 = !DILocation(line: 61, column: 41, scope: !1119, inlinedAt: !1125)
!1129 = !DILocation(line: 61, column: 10, scope: !1119, inlinedAt: !1125)
!1130 = !DILocation(line: 625, column: 11, scope: !784)
!1131 = !DILocation(line: 626, column: 14, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !784, file: !442, line: 626, column: 7)
!1133 = !{!825, !826, i64 12976}
!1134 = !DILocation(line: 626, column: 20, scope: !1132)
!1135 = !DILocation(line: 626, column: 7, scope: !784)
!1136 = !DILocation(line: 627, column: 12, scope: !1132)
!1137 = !DILocation(line: 627, column: 5, scope: !1132)
!1138 = !DILocation(line: 632, column: 15, scope: !784)
!1139 = !DILocation(line: 633, column: 19, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !784, file: !442, line: 633, column: 7)
!1141 = !DILocation(line: 633, column: 7, scope: !784)
!1142 = !DILocation(line: 636, column: 5, scope: !818)
!1143 = !DILocation(line: 637, column: 7, scope: !818)
!1144 = !DILocation(line: 639, column: 12, scope: !818)
!1145 = !DILocation(line: 640, column: 12, scope: !818)
!1146 = !DILocation(line: 641, column: 3, scope: !784)
!1147 = !DILocation(line: 642, column: 10, scope: !784)
!1148 = !DILocation(line: 643, column: 41, scope: !784)
!1149 = !DILocalVariable(name: "degrees", arg: 1, scope: !1150, file: !1120, line: 54, type: !789)
!1150 = distinct !DISubprogram(name: "DegreesToRadians", scope: !1120, file: !1120, line: 54, type: !1151, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1153)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!484, !789}
!1153 = !{!1149}
!1154 = !DILocation(line: 0, scope: !1150, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 643, column: 24, scope: !784)
!1156 = !DILocation(line: 56, column: 28, scope: !1150, inlinedAt: !1155)
!1157 = !DILocation(line: 56, column: 36, scope: !1150, inlinedAt: !1155)
!1158 = !DILocation(line: 643, column: 20, scope: !784)
!1159 = !DILocation(line: 643, column: 19, scope: !784)
!1160 = !{!1161, !832, i64 0}
!1161 = !{!"_AffineMatrix", !832, i64 0, !832, i64 8, !832, i64 16, !832, i64 24, !832, i64 32, !832, i64 40}
!1162 = !DILocation(line: 644, column: 41, scope: !784)
!1163 = !DILocation(line: 0, scope: !1150, inlinedAt: !1164)
!1164 = distinct !DILocation(line: 644, column: 24, scope: !784)
!1165 = !DILocation(line: 56, column: 28, scope: !1150, inlinedAt: !1164)
!1166 = !DILocation(line: 56, column: 36, scope: !1150, inlinedAt: !1164)
!1167 = !DILocation(line: 644, column: 20, scope: !784)
!1168 = !DILocation(line: 644, column: 17, scope: !784)
!1169 = !DILocation(line: 644, column: 19, scope: !784)
!1170 = !{!1161, !832, i64 8}
!1171 = !DILocation(line: 645, column: 43, scope: !784)
!1172 = !DILocation(line: 0, scope: !1150, inlinedAt: !1173)
!1173 = distinct !DILocation(line: 645, column: 26, scope: !784)
!1174 = !DILocation(line: 56, column: 28, scope: !1150, inlinedAt: !1173)
!1175 = !DILocation(line: 56, column: 36, scope: !1150, inlinedAt: !1173)
!1176 = !DILocation(line: 645, column: 22, scope: !784)
!1177 = !DILocation(line: 645, column: 21, scope: !784)
!1178 = !DILocation(line: 645, column: 17, scope: !784)
!1179 = !DILocation(line: 645, column: 19, scope: !784)
!1180 = !{!1161, !832, i64 16}
!1181 = !DILocation(line: 646, column: 41, scope: !784)
!1182 = !DILocation(line: 0, scope: !1150, inlinedAt: !1183)
!1183 = distinct !DILocation(line: 646, column: 24, scope: !784)
!1184 = !DILocation(line: 56, column: 28, scope: !1150, inlinedAt: !1183)
!1185 = !DILocation(line: 56, column: 36, scope: !1150, inlinedAt: !1183)
!1186 = !DILocation(line: 646, column: 20, scope: !784)
!1187 = !DILocation(line: 646, column: 17, scope: !784)
!1188 = !DILocation(line: 646, column: 19, scope: !784)
!1189 = !{!1161, !832, i64 24}
!1190 = !DILocation(line: 647, column: 17, scope: !784)
!1191 = !DILocation(line: 648, column: 19, scope: !784)
!1192 = !DILocation(line: 649, column: 12, scope: !784)
!1193 = !DILocation(line: 650, column: 16, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !784, file: !442, line: 650, column: 7)
!1195 = !DILocation(line: 650, column: 7, scope: !784)
!1196 = !DILocation(line: 652, column: 20, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1194, file: !442, line: 651, column: 5)
!1198 = !DILocation(line: 653, column: 19, scope: !1197)
!1199 = !DILocation(line: 654, column: 7, scope: !1197)
!1200 = !DILocalVariable(name: "value", arg: 1, scope: !1201, file: !1202, line: 68, type: !1205)
!1201 = distinct !DISubprogram(name: "StringToLong", scope: !1202, file: !1202, line: 68, type: !1203, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1206)
!1202 = !DIFile(filename: "apps/538.imagick_r/src/magick/string-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "af275f9a9b26a4e8bc1a481724207dee")
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!515, !1205}
!1205 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !580)
!1206 = !{!1200}
!1207 = !DILocation(line: 0, scope: !1201, inlinedAt: !1208)
!1208 = distinct !DILocation(line: 659, column: 49, scope: !784)
!1209 = !DILocation(line: 70, column: 10, scope: !1201, inlinedAt: !1208)
!1210 = !DILocalVariable(name: "image", arg: 1, scope: !1211, file: !442, line: 506, type: !447)
!1211 = distinct !DISubprogram(name: "GetImageBackgroundColor", scope: !442, file: !442, line: 506, type: !1212, scopeLine: 508, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1214)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{null, !447, !672, !673}
!1214 = !{!1210, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1225}
!1215 = !DILocalVariable(name: "offset", arg: 2, scope: !1211, file: !442, line: 506, type: !672)
!1216 = !DILocalVariable(name: "exception", arg: 3, scope: !1211, file: !442, line: 507, type: !673)
!1217 = !DILocalVariable(name: "image_view", scope: !1211, file: !442, line: 510, type: !683)
!1218 = !DILocalVariable(name: "background", scope: !1211, file: !442, line: 513, type: !689)
!1219 = !DILocalVariable(name: "count", scope: !1211, file: !442, line: 516, type: !669)
!1220 = !DILocalVariable(name: "y", scope: !1211, file: !442, line: 519, type: !511)
!1221 = !DILocalVariable(name: "p", scope: !1222, file: !442, line: 532, type: !886)
!1222 = distinct !DILexicalBlock(scope: !1223, file: !442, line: 530, column: 3)
!1223 = distinct !DILexicalBlock(scope: !1224, file: !442, line: 529, column: 3)
!1224 = distinct !DILexicalBlock(scope: !1211, file: !442, line: 529, column: 3)
!1225 = !DILocalVariable(name: "x", scope: !1222, file: !442, line: 535, type: !511)
!1226 = !DILocation(line: 0, scope: !1211, inlinedAt: !1227)
!1227 = distinct !DILocation(line: 659, column: 3, scope: !784)
!1228 = !DILocation(line: 512, column: 3, scope: !1211, inlinedAt: !1227)
!1229 = !DILocation(line: 513, column: 5, scope: !1211, inlinedAt: !1227)
!1230 = !DILocation(line: 524, column: 14, scope: !1231, inlinedAt: !1227)
!1231 = distinct !DILexicalBlock(scope: !1211, file: !442, line: 524, column: 7)
!1232 = !DILocation(line: 524, column: 7, scope: !1211, inlinedAt: !1227)
!1233 = !DILocation(line: 526, column: 3, scope: !1211, inlinedAt: !1227)
!1234 = !DILocation(line: 528, column: 14, scope: !1211, inlinedAt: !1227)
!1235 = !DILocation(line: 529, column: 34, scope: !1223, inlinedAt: !1227)
!1236 = !DILocation(line: 529, column: 15, scope: !1223, inlinedAt: !1227)
!1237 = !DILocation(line: 529, column: 3, scope: !1224, inlinedAt: !1227)
!1238 = !DILocation(line: 537, column: 12, scope: !1239, inlinedAt: !1227)
!1239 = distinct !DILexicalBlock(scope: !1222, file: !442, line: 537, column: 9)
!1240 = !DILocation(line: 537, column: 23, scope: !1239, inlinedAt: !1227)
!1241 = !DILocation(line: 539, column: 55, scope: !1222, inlinedAt: !1227)
!1242 = !DILocation(line: 539, column: 7, scope: !1222, inlinedAt: !1227)
!1243 = !DILocation(line: 0, scope: !1222, inlinedAt: !1227)
!1244 = !DILocation(line: 540, column: 11, scope: !1245, inlinedAt: !1227)
!1245 = distinct !DILexicalBlock(scope: !1222, file: !442, line: 540, column: 9)
!1246 = !DILocation(line: 540, column: 9, scope: !1222, inlinedAt: !1227)
!1247 = !DILocation(line: 542, column: 17, scope: !1248, inlinedAt: !1227)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !442, line: 542, column: 5)
!1249 = distinct !DILexicalBlock(scope: !1222, file: !442, line: 542, column: 5)
!1250 = !DILocation(line: 542, column: 5, scope: !1249, inlinedAt: !1227)
!1251 = !{!1252, !1253, i64 32}
!1252 = !{!"_MagickPixelPacket", !826, i64 0, !826, i64 4, !826, i64 8, !832, i64 16, !828, i64 24, !1253, i64 32, !1253, i64 36, !1253, i64 40, !1253, i64 44, !1253, i64 48}
!1253 = !{!"float", !826, i64 0}
!1254 = !{!1252, !1253, i64 36}
!1255 = !{!1252, !1253, i64 40}
!1256 = !{!1252, !1253, i64 44}
!1257 = !DILocation(line: 544, column: 14, scope: !1258, inlinedAt: !1227)
!1258 = distinct !DILexicalBlock(scope: !1259, file: !442, line: 544, column: 11)
!1259 = distinct !DILexicalBlock(scope: !1248, file: !442, line: 543, column: 5)
!1260 = !DILocation(line: 544, column: 25, scope: !1258, inlinedAt: !1227)
!1261 = !DILocation(line: 546, column: 36, scope: !1259, inlinedAt: !1227)
!1262 = !DILocation(line: 546, column: 21, scope: !1259, inlinedAt: !1227)
!1263 = !DILocation(line: 547, column: 38, scope: !1259, inlinedAt: !1227)
!1264 = !DILocation(line: 547, column: 23, scope: !1259, inlinedAt: !1227)
!1265 = !DILocation(line: 548, column: 37, scope: !1259, inlinedAt: !1227)
!1266 = !DILocation(line: 548, column: 22, scope: !1259, inlinedAt: !1227)
!1267 = !DILocation(line: 549, column: 40, scope: !1259, inlinedAt: !1227)
!1268 = !{!830, !831, i64 6}
!1269 = !DILocation(line: 549, column: 25, scope: !1259, inlinedAt: !1227)
!1270 = !DILocation(line: 550, column: 12, scope: !1259, inlinedAt: !1227)
!1271 = !DILocation(line: 551, column: 8, scope: !1259, inlinedAt: !1227)
!1272 = !DILocation(line: 552, column: 5, scope: !1259, inlinedAt: !1227)
!1273 = !DILocation(line: 542, column: 46, scope: !1248, inlinedAt: !1227)
!1274 = distinct !{!1274, !1250, !1275, !852, !853}
!1275 = !DILocation(line: 552, column: 5, scope: !1249, inlinedAt: !1227)
!1276 = !DILocation(line: 527, column: 8, scope: !1211, inlinedAt: !1227)
!1277 = !DILocation(line: 529, column: 41, scope: !1223, inlinedAt: !1227)
!1278 = distinct !{!1278, !1237, !1279, !852, !853}
!1279 = !DILocation(line: 553, column: 3, scope: !1224, inlinedAt: !1227)
!1280 = !DILocation(line: 554, column: 14, scope: !1211, inlinedAt: !1227)
!1281 = !DILocation(line: 556, column: 16, scope: !1211, inlinedAt: !1227)
!1282 = !DILocation(line: 555, column: 75, scope: !1211, inlinedAt: !1227)
!1283 = !DILocation(line: 556, column: 19, scope: !1211, inlinedAt: !1227)
!1284 = !DILocalVariable(name: "value", arg: 1, scope: !1285, file: !147, line: 87, type: !668)
!1285 = distinct !DISubprogram(name: "ClampToQuantum", scope: !147, file: !147, line: 87, type: !1286, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1288)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!475, !668}
!1288 = !{!1284}
!1289 = !DILocation(line: 0, scope: !1285, inlinedAt: !1290)
!1290 = distinct !DILocation(line: 555, column: 31, scope: !1211, inlinedAt: !1227)
!1291 = !DILocation(line: 92, column: 13, scope: !1292, inlinedAt: !1290)
!1292 = distinct !DILexicalBlock(scope: !1285, file: !147, line: 92, column: 7)
!1293 = !DILocation(line: 92, column: 7, scope: !1285, inlinedAt: !1290)
!1294 = !DILocation(line: 94, column: 13, scope: !1295, inlinedAt: !1290)
!1295 = distinct !DILexicalBlock(scope: !1285, file: !147, line: 94, column: 7)
!1296 = !DILocation(line: 94, column: 7, scope: !1285, inlinedAt: !1290)
!1297 = !DILocation(line: 96, column: 26, scope: !1285, inlinedAt: !1290)
!1298 = !DILocation(line: 96, column: 10, scope: !1285, inlinedAt: !1290)
!1299 = !DILocation(line: 96, column: 3, scope: !1285, inlinedAt: !1290)
!1300 = !DILocation(line: 555, column: 10, scope: !1211, inlinedAt: !1227)
!1301 = !DILocation(line: 555, column: 27, scope: !1211, inlinedAt: !1227)
!1302 = !DILocation(line: 555, column: 30, scope: !1211, inlinedAt: !1227)
!1303 = !{!825, !831, i64 84}
!1304 = !DILocation(line: 558, column: 16, scope: !1211, inlinedAt: !1227)
!1305 = !DILocation(line: 557, column: 77, scope: !1211, inlinedAt: !1227)
!1306 = !DILocation(line: 558, column: 21, scope: !1211, inlinedAt: !1227)
!1307 = !DILocation(line: 0, scope: !1285, inlinedAt: !1308)
!1308 = distinct !DILocation(line: 557, column: 33, scope: !1211, inlinedAt: !1227)
!1309 = !DILocation(line: 92, column: 13, scope: !1292, inlinedAt: !1308)
!1310 = !DILocation(line: 92, column: 7, scope: !1285, inlinedAt: !1308)
!1311 = !DILocation(line: 94, column: 13, scope: !1295, inlinedAt: !1308)
!1312 = !DILocation(line: 94, column: 7, scope: !1285, inlinedAt: !1308)
!1313 = !DILocation(line: 96, column: 26, scope: !1285, inlinedAt: !1308)
!1314 = !DILocation(line: 96, column: 10, scope: !1285, inlinedAt: !1308)
!1315 = !DILocation(line: 96, column: 3, scope: !1285, inlinedAt: !1308)
!1316 = !DILocation(line: 557, column: 27, scope: !1211, inlinedAt: !1227)
!1317 = !DILocation(line: 557, column: 32, scope: !1211, inlinedAt: !1227)
!1318 = !{!825, !831, i64 82}
!1319 = !DILocation(line: 560, column: 16, scope: !1211, inlinedAt: !1227)
!1320 = !DILocation(line: 559, column: 76, scope: !1211, inlinedAt: !1227)
!1321 = !DILocation(line: 560, column: 20, scope: !1211, inlinedAt: !1227)
!1322 = !DILocation(line: 0, scope: !1285, inlinedAt: !1323)
!1323 = distinct !DILocation(line: 559, column: 32, scope: !1211, inlinedAt: !1227)
!1324 = !DILocation(line: 92, column: 13, scope: !1292, inlinedAt: !1323)
!1325 = !DILocation(line: 92, column: 7, scope: !1285, inlinedAt: !1323)
!1326 = !DILocation(line: 94, column: 13, scope: !1295, inlinedAt: !1323)
!1327 = !DILocation(line: 94, column: 7, scope: !1285, inlinedAt: !1323)
!1328 = !DILocation(line: 96, column: 26, scope: !1285, inlinedAt: !1323)
!1329 = !DILocation(line: 96, column: 10, scope: !1285, inlinedAt: !1323)
!1330 = !DILocation(line: 96, column: 3, scope: !1285, inlinedAt: !1323)
!1331 = !DILocation(line: 559, column: 31, scope: !1211, inlinedAt: !1227)
!1332 = !{!825, !831, i64 80}
!1333 = !DILocation(line: 562, column: 16, scope: !1211, inlinedAt: !1227)
!1334 = !DILocation(line: 561, column: 79, scope: !1211, inlinedAt: !1227)
!1335 = !DILocation(line: 562, column: 23, scope: !1211, inlinedAt: !1227)
!1336 = !DILocation(line: 0, scope: !1285, inlinedAt: !1337)
!1337 = distinct !DILocation(line: 561, column: 35, scope: !1211, inlinedAt: !1227)
!1338 = !DILocation(line: 92, column: 13, scope: !1292, inlinedAt: !1337)
!1339 = !DILocation(line: 92, column: 7, scope: !1285, inlinedAt: !1337)
!1340 = !DILocation(line: 94, column: 13, scope: !1295, inlinedAt: !1337)
!1341 = !DILocation(line: 94, column: 7, scope: !1285, inlinedAt: !1337)
!1342 = !DILocation(line: 96, column: 26, scope: !1285, inlinedAt: !1337)
!1343 = !DILocation(line: 96, column: 10, scope: !1285, inlinedAt: !1337)
!1344 = !DILocation(line: 96, column: 3, scope: !1285, inlinedAt: !1337)
!1345 = !DILocation(line: 561, column: 27, scope: !1211, inlinedAt: !1227)
!1346 = !DILocation(line: 561, column: 34, scope: !1211, inlinedAt: !1227)
!1347 = !{!825, !831, i64 86}
!1348 = !DILocation(line: 563, column: 1, scope: !1211, inlinedAt: !1227)
!1349 = !DILocation(line: 661, column: 16, scope: !784)
!1350 = !DILocation(line: 662, column: 15, scope: !784)
!1351 = !DILocation(line: 663, column: 20, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !784, file: !442, line: 663, column: 7)
!1353 = !DILocation(line: 663, column: 7, scope: !784)
!1354 = !DILocation(line: 665, column: 16, scope: !784)
!1355 = !DILocation(line: 666, column: 20, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !784, file: !442, line: 666, column: 7)
!1357 = !DILocation(line: 666, column: 7, scope: !784)
!1358 = !DILocation(line: 668, column: 20, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1356, file: !442, line: 667, column: 5)
!1360 = !DILocation(line: 669, column: 7, scope: !1359)
!1361 = !DILocation(line: 671, column: 12, scope: !784)
!1362 = !DILocation(line: 672, column: 16, scope: !784)
!1363 = !DILocation(line: 673, column: 14, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !784, file: !442, line: 673, column: 7)
!1365 = !DILocation(line: 673, column: 20, scope: !1364)
!1366 = !DILocation(line: 673, column: 7, scope: !784)
!1367 = !DILocation(line: 675, column: 51, scope: !1364)
!1368 = !{!835, !828, i64 0}
!1369 = !DILocation(line: 675, column: 33, scope: !1364)
!1370 = !DILocation(line: 676, column: 16, scope: !1364)
!1371 = !{!835, !828, i64 8}
!1372 = !DILocation(line: 675, column: 57, scope: !1364)
!1373 = !DILocation(line: 676, column: 41, scope: !1364)
!1374 = !{!835, !828, i64 16}
!1375 = !DILocation(line: 676, column: 23, scope: !1364)
!1376 = !DILocation(line: 676, column: 61, scope: !1364)
!1377 = !{!835, !828, i64 24}
!1378 = !DILocation(line: 676, column: 43, scope: !1364)
!1379 = !DILocation(line: 674, column: 12, scope: !1364)
!1380 = !DILocation(line: 674, column: 5, scope: !1364)
!1381 = !DILocation(line: 677, column: 14, scope: !784)
!1382 = !DILocation(line: 678, column: 16, scope: !784)
!1383 = !DILocation(line: 679, column: 3, scope: !784)
!1384 = !DILocation(line: 680, column: 1, scope: !784)
!1385 = !DISubprogram(name: "AcquireQuantumMemory", scope: !1386, file: !1386, line: 42, type: !1387, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1386 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!502, !671, !671}
!1389 = !{}
!1390 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1391, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!446, !673, !580, !580, !671, !1393, !580, !580, null}
!1393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!1394 = !DISubprogram(name: "RelinquishMagickMemory", scope: !1386, file: !1386, line: 51, type: !1395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!502, !502}
!1397 = !DISubprogram(name: "LogMagickEvent", scope: !369, file: !369, line: 83, type: !1398, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1398 = !DISubroutineType(types: !1399)
!1399 = !{!446, !1400, !580, !580, !671, !580, null}
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1401)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !369, line: 58, baseType: !368)
!1402 = !DISubprogram(name: "CloneImage", scope: !73, file: !73, line: 508, type: !1403, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!447, !787, !671, !671, !1405, !673}
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!1406 = !DISubprogram(name: "FormatLocaleString", scope: !1407, file: !1407, line: 71, type: !1408, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1407 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "156c27c5fb4b55284e5f6c924766571a")
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!511, !1410, !671, !1205, null}
!1410 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !506)
!1411 = !DISubprogram(name: "SetImageArtifact", scope: !1412, file: !1412, line: 36, type: !1413, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1412 = !DIFile(filename: "apps/538.imagick_r/src/magick/artifact.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2fff4b6fe3176ac9e10f3231e40b4948")
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!446, !447, !580, !580}
!1415 = !DISubprogram(name: "SetImageVirtualPixelMethod", scope: !73, file: !73, line: 559, type: !1416, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!1418, !787, !1419}
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !394, line: 47, baseType: !393)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1418)
!1420 = !DISubprogram(name: "GetImageArtifact", scope: !1412, file: !1412, line: 30, type: !1421, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!580, !787, !580}
!1423 = !DISubprogram(name: "AffineTransformImage", scope: !1424, file: !1424, line: 73, type: !1425, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1424 = !DIFile(filename: "apps/538.imagick_r/src/magick/distort.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "61738a5e0552018447b32d5aafa59fd2")
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!447, !787, !1427, !673}
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!1429 = !DISubprogram(name: "DestroyImage", scope: !73, file: !73, line: 510, type: !1430, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!447, !447}
!1432 = !DISubprogram(name: "StatisticImage", scope: !415, file: !415, line: 140, type: !1433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!447, !787, !1435, !671, !671, !673}
!1435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1436)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "StatisticType", file: !415, line: 124, baseType: !414)
!1437 = !DISubprogram(name: "GetImageBoundingBox", scope: !1438, file: !1438, line: 40, type: !1439, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1438 = !DIFile(filename: "apps/538.imagick_r/src/magick/attribute.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9f28531949ca431292ce1dd34e70716")
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!519, !787, !673}
!1441 = !DISubprogram(name: "CropImage", scope: !1442, file: !1442, line: 29, type: !1443, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1389)
!1442 = !DIFile(filename: "apps/538.imagick_r/src/magick/transform.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "38be0c2b8a82bf966e7f55606c3e2192")
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!447, !787, !1445, !673}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!1447 = distinct !DISubprogram(name: "IntegralRotateImage", scope: !442, file: !442, line: 709, type: !1448, scopeLine: 711, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1450)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!447, !787, !458, !673}
!1450 = !{!1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1464, !1465, !1466, !1470, !1474, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1486, !1487, !1490, !1493, !1498, !1499, !1500, !1501, !1502, !1503, !1506, !1508, !1509, !1510, !1514, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1529, !1530, !1533}
!1451 = !DILocalVariable(name: "image", arg: 1, scope: !1447, file: !442, line: 709, type: !787)
!1452 = !DILocalVariable(name: "rotations", arg: 2, scope: !1447, file: !442, line: 709, type: !458)
!1453 = !DILocalVariable(name: "exception", arg: 3, scope: !1447, file: !442, line: 710, type: !673)
!1454 = !DILocalVariable(name: "image_view", scope: !1447, file: !442, line: 715, type: !683)
!1455 = !DILocalVariable(name: "rotate_view", scope: !1447, file: !442, line: 716, type: !683)
!1456 = !DILocalVariable(name: "rotate_image", scope: !1447, file: !442, line: 719, type: !447)
!1457 = !DILocalVariable(name: "status", scope: !1447, file: !442, line: 722, type: !446)
!1458 = !DILocalVariable(name: "progress", scope: !1447, file: !442, line: 725, type: !583)
!1459 = !DILocalVariable(name: "page", scope: !1447, file: !442, line: 728, type: !519)
!1460 = !DILocalVariable(name: "y", scope: !1447, file: !442, line: 731, type: !511)
!1461 = !DILocalVariable(name: "tile_height", scope: !1462, file: !442, line: 761, type: !458)
!1462 = distinct !DILexicalBlock(scope: !1463, file: !442, line: 759, column: 5)
!1463 = distinct !DILexicalBlock(scope: !1447, file: !442, line: 757, column: 3)
!1464 = !DILocalVariable(name: "tile_width", scope: !1462, file: !442, line: 762, type: !458)
!1465 = !DILocalVariable(name: "tile_y", scope: !1462, file: !442, line: 765, type: !511)
!1466 = !DILocalVariable(name: "tile_x", scope: !1467, file: !442, line: 779, type: !511)
!1467 = distinct !DILexicalBlock(scope: !1468, file: !442, line: 777, column: 7)
!1468 = distinct !DILexicalBlock(scope: !1469, file: !442, line: 776, column: 7)
!1469 = distinct !DILexicalBlock(scope: !1462, file: !442, line: 776, column: 7)
!1470 = !DILocalVariable(name: "sync", scope: !1471, file: !442, line: 786, type: !446)
!1471 = distinct !DILexicalBlock(scope: !1472, file: !442, line: 784, column: 9)
!1472 = distinct !DILexicalBlock(scope: !1473, file: !442, line: 783, column: 9)
!1473 = distinct !DILexicalBlock(scope: !1467, file: !442, line: 783, column: 9)
!1474 = !DILocalVariable(name: "indexes", scope: !1471, file: !442, line: 789, type: !1475)
!1475 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !770)
!1476 = !DILocalVariable(name: "p", scope: !1471, file: !442, line: 792, type: !886)
!1477 = !DILocalVariable(name: "rotate_indexes", scope: !1471, file: !442, line: 795, type: !712)
!1478 = !DILocalVariable(name: "q", scope: !1471, file: !442, line: 798, type: !717)
!1479 = !DILocalVariable(name: "y", scope: !1471, file: !442, line: 801, type: !511)
!1480 = !DILocalVariable(name: "height", scope: !1471, file: !442, line: 804, type: !458)
!1481 = !DILocalVariable(name: "width", scope: !1471, file: !442, line: 805, type: !458)
!1482 = !DILocalVariable(name: "tile_pixels", scope: !1483, file: !442, line: 824, type: !886)
!1483 = distinct !DILexicalBlock(scope: !1484, file: !442, line: 822, column: 11)
!1484 = distinct !DILexicalBlock(scope: !1485, file: !442, line: 821, column: 11)
!1485 = distinct !DILexicalBlock(scope: !1471, file: !442, line: 821, column: 11)
!1486 = !DILocalVariable(name: "x", scope: !1483, file: !442, line: 827, type: !511)
!1487 = !DILocalVariable(name: "tile_indexes", scope: !1488, file: !442, line: 850, type: !1475)
!1488 = distinct !DILexicalBlock(scope: !1489, file: !442, line: 848, column: 15)
!1489 = distinct !DILexicalBlock(scope: !1483, file: !442, line: 846, column: 17)
!1490 = !DILocalVariable(name: "proceed", scope: !1491, file: !442, line: 867, type: !446)
!1491 = distinct !DILexicalBlock(scope: !1492, file: !442, line: 865, column: 11)
!1492 = distinct !DILexicalBlock(scope: !1467, file: !442, line: 864, column: 13)
!1493 = !DILocalVariable(name: "sync", scope: !1494, file: !442, line: 898, type: !446)
!1494 = distinct !DILexicalBlock(scope: !1495, file: !442, line: 896, column: 7)
!1495 = distinct !DILexicalBlock(scope: !1496, file: !442, line: 895, column: 7)
!1496 = distinct !DILexicalBlock(scope: !1497, file: !442, line: 895, column: 7)
!1497 = distinct !DILexicalBlock(scope: !1463, file: !442, line: 887, column: 5)
!1498 = !DILocalVariable(name: "indexes", scope: !1494, file: !442, line: 901, type: !1475)
!1499 = !DILocalVariable(name: "p", scope: !1494, file: !442, line: 904, type: !886)
!1500 = !DILocalVariable(name: "rotate_indexes", scope: !1494, file: !442, line: 907, type: !712)
!1501 = !DILocalVariable(name: "q", scope: !1494, file: !442, line: 910, type: !717)
!1502 = !DILocalVariable(name: "x", scope: !1494, file: !442, line: 913, type: !511)
!1503 = !DILocalVariable(name: "proceed", scope: !1504, file: !442, line: 942, type: !446)
!1504 = distinct !DILexicalBlock(scope: !1505, file: !442, line: 940, column: 11)
!1505 = distinct !DILexicalBlock(scope: !1494, file: !442, line: 939, column: 13)
!1506 = !DILocalVariable(name: "tile_height", scope: !1507, file: !442, line: 962, type: !458)
!1507 = distinct !DILexicalBlock(scope: !1463, file: !442, line: 960, column: 5)
!1508 = !DILocalVariable(name: "tile_width", scope: !1507, file: !442, line: 963, type: !458)
!1509 = !DILocalVariable(name: "tile_y", scope: !1507, file: !442, line: 966, type: !511)
!1510 = !DILocalVariable(name: "tile_x", scope: !1511, file: !442, line: 980, type: !511)
!1511 = distinct !DILexicalBlock(scope: !1512, file: !442, line: 978, column: 7)
!1512 = distinct !DILexicalBlock(scope: !1513, file: !442, line: 977, column: 7)
!1513 = distinct !DILexicalBlock(scope: !1507, file: !442, line: 977, column: 7)
!1514 = !DILocalVariable(name: "sync", scope: !1515, file: !442, line: 987, type: !446)
!1515 = distinct !DILexicalBlock(scope: !1516, file: !442, line: 985, column: 9)
!1516 = distinct !DILexicalBlock(scope: !1517, file: !442, line: 984, column: 9)
!1517 = distinct !DILexicalBlock(scope: !1511, file: !442, line: 984, column: 9)
!1518 = !DILocalVariable(name: "indexes", scope: !1515, file: !442, line: 990, type: !1475)
