; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/signature.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/signature.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._SignatureInfo = type { i32, i32, ptr, ptr, ptr, i32, i32, i64, i32, i64, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "K", scope: !2, file: !3, line: 627, type: !953, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "TransformSignature", scope: !3, file: !3, line: 610, type: !4, scopeLine: 611, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !53, retainedNodes: !935)
!3 = !DIFile(filename: "apps/538.imagick_r/src/magick/signature.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4647103c047a7b286888a7e35b5030bc")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignatureInfo", file: !8, line: 30, baseType: !9)
!8 = !DIFile(filename: "apps/538.imagick_r/src/magick/signature-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f72c89ffa1995573b65986daac7c57d4")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SignatureInfo", file: !3, line: 65, size: 576, elements: !10)
!10 = !{!11, !13, !14, !33, !34, !36, !37, !38, !39, !46, !52}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "digestsize", scope: !9, file: !3, line: 68, baseType: !12, size: 32)
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !9, file: !3, line: 69, baseType: !12, size: 32, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !9, file: !3, line: 72, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !17, line: 40, baseType: !18)
!17 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !17, line: 29, size: 32960, elements: !19)
!19 = !{!20, !25, !28, !32}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !18, file: !17, line: 32, baseType: !21, size: 32768)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32768, elements: !23)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{!24}
!24 = !DISubrange(count: 4096)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !18, file: !17, line: 35, baseType: !26, size: 64, offset: 32768)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !18, file: !17, line: 38, baseType: !29, size: 64, offset: 32832)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 46, baseType: !31)
!30 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!31 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !18, file: !17, line: 39, baseType: !29, size: 64, offset: 32896)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !9, file: !3, line: 73, baseType: !15, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "accumulator", scope: !9, file: !3, line: 76, baseType: !35, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "low_order", scope: !9, file: !3, line: 77, baseType: !12, size: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "high_order", scope: !9, file: !3, line: 78, baseType: !12, size: 32, offset: 288)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !9, file: !3, line: 81, baseType: !29, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "lsb_first", scope: !9, file: !3, line: 84, baseType: !40, size: 32, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !41, line: 215, baseType: !42)
!41 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 211, baseType: !12, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "MagickFalse", value: 0)
!45 = !DIEnumerator(name: "MagickTrue", value: 1)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !9, file: !3, line: 87, baseType: !47, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !48, line: 77, baseType: !49)
!48 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !50, line: 193, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!51 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !9, file: !3, line: 90, baseType: !29, size: 64, offset: 512)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !557, globals: !934, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/signature.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r", checksumkind: CSK_MD5, checksum: "4647103c047a7b286888a7e35b5030bc")
!55 = !{!42, !56, !129, !154, !159, !196, !221, !233, !241, !246, !281, !291, !297, !312, !383, !391, !397, !414, !428, !440, !446, !451, !481, !514, !536}
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 28, baseType: !12, size: 32, elements: !58)
!57 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cd97c70c025a9cff45f4138c27a79124")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!59 = !DIEnumerator(name: "UndefinedException", value: 0)
!60 = !DIEnumerator(name: "WarningException", value: 300)
!61 = !DIEnumerator(name: "ResourceLimitWarning", value: 300)
!62 = !DIEnumerator(name: "TypeWarning", value: 305)
!63 = !DIEnumerator(name: "OptionWarning", value: 310)
!64 = !DIEnumerator(name: "DelegateWarning", value: 315)
!65 = !DIEnumerator(name: "MissingDelegateWarning", value: 320)
!66 = !DIEnumerator(name: "CorruptImageWarning", value: 325)
!67 = !DIEnumerator(name: "FileOpenWarning", value: 330)
!68 = !DIEnumerator(name: "BlobWarning", value: 335)
!69 = !DIEnumerator(name: "StreamWarning", value: 340)
!70 = !DIEnumerator(name: "CacheWarning", value: 345)
!71 = !DIEnumerator(name: "CoderWarning", value: 350)
!72 = !DIEnumerator(name: "FilterWarning", value: 352)
!73 = !DIEnumerator(name: "ModuleWarning", value: 355)
!74 = !DIEnumerator(name: "DrawWarning", value: 360)
!75 = !DIEnumerator(name: "ImageWarning", value: 365)
!76 = !DIEnumerator(name: "WandWarning", value: 370)
!77 = !DIEnumerator(name: "RandomWarning", value: 375)
!78 = !DIEnumerator(name: "XServerWarning", value: 380)
!79 = !DIEnumerator(name: "MonitorWarning", value: 385)
!80 = !DIEnumerator(name: "RegistryWarning", value: 390)
!81 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!82 = !DIEnumerator(name: "PolicyWarning", value: 399)
!83 = !DIEnumerator(name: "ErrorException", value: 400)
!84 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!85 = !DIEnumerator(name: "TypeError", value: 405)
!86 = !DIEnumerator(name: "OptionError", value: 410)
!87 = !DIEnumerator(name: "DelegateError", value: 415)
!88 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!89 = !DIEnumerator(name: "CorruptImageError", value: 425)
!90 = !DIEnumerator(name: "FileOpenError", value: 430)
!91 = !DIEnumerator(name: "BlobError", value: 435)
!92 = !DIEnumerator(name: "StreamError", value: 440)
!93 = !DIEnumerator(name: "CacheError", value: 445)
!94 = !DIEnumerator(name: "CoderError", value: 450)
!95 = !DIEnumerator(name: "FilterError", value: 452)
!96 = !DIEnumerator(name: "ModuleError", value: 455)
!97 = !DIEnumerator(name: "DrawError", value: 460)
!98 = !DIEnumerator(name: "ImageError", value: 465)
!99 = !DIEnumerator(name: "WandError", value: 470)
!100 = !DIEnumerator(name: "RandomError", value: 475)
!101 = !DIEnumerator(name: "XServerError", value: 480)
!102 = !DIEnumerator(name: "MonitorError", value: 485)
!103 = !DIEnumerator(name: "RegistryError", value: 490)
!104 = !DIEnumerator(name: "ConfigureError", value: 495)
!105 = !DIEnumerator(name: "PolicyError", value: 499)
!106 = !DIEnumerator(name: "FatalErrorException", value: 700)
!107 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!108 = !DIEnumerator(name: "TypeFatalError", value: 705)
!109 = !DIEnumerator(name: "OptionFatalError", value: 710)
!110 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!111 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!112 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!113 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!114 = !DIEnumerator(name: "BlobFatalError", value: 735)
!115 = !DIEnumerator(name: "StreamFatalError", value: 740)
!116 = !DIEnumerator(name: "CacheFatalError", value: 745)
!117 = !DIEnumerator(name: "CoderFatalError", value: 750)
!118 = !DIEnumerator(name: "FilterFatalError", value: 752)
!119 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!120 = !DIEnumerator(name: "DrawFatalError", value: 760)
!121 = !DIEnumerator(name: "ImageFatalError", value: 765)
!122 = !DIEnumerator(name: "WandFatalError", value: 770)
!123 = !DIEnumerator(name: "RandomFatalError", value: 775)
!124 = !DIEnumerator(name: "XServerFatalError", value: 780)
!125 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!126 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!127 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!128 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !130, line: 34, baseType: !12, size: 32, elements: !131)
!130 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!132 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!133 = !DIEnumerator(name: "NoEvents", value: 0)
!134 = !DIEnumerator(name: "TraceEvent", value: 1)
!135 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!136 = !DIEnumerator(name: "BlobEvent", value: 4)
!137 = !DIEnumerator(name: "CacheEvent", value: 8)
!138 = !DIEnumerator(name: "CoderEvent", value: 16)
!139 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!140 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!141 = !DIEnumerator(name: "DrawEvent", value: 128)
!142 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!143 = !DIEnumerator(name: "ImageEvent", value: 512)
!144 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!145 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!146 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!147 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!148 = !DIEnumerator(name: "TransformEvent", value: 16384)
!149 = !DIEnumerator(name: "UserEvent", value: 36864)
!150 = !DIEnumerator(name: "WandEvent", value: 65536)
!151 = !DIEnumerator(name: "X11Event", value: 131072)
!152 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!153 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 204, baseType: !12, size: 32, elements: !155)
!155 = !{!156, !157, !158}
!156 = !DIEnumerator(name: "UndefinedClass", value: 0)
!157 = !DIEnumerator(name: "DirectClass", value: 1)
!158 = !DIEnumerator(name: "PseudoClass", value: 2)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !160, line: 25, baseType: !12, size: 32, elements: !161)
!160 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4f032944b177fc61244445fe3a234334")
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!162 = !DIEnumerator(name: "UndefinedColorspace", value: 0)
!163 = !DIEnumerator(name: "RGBColorspace", value: 1)
!164 = !DIEnumerator(name: "GRAYColorspace", value: 2)
!165 = !DIEnumerator(name: "TransparentColorspace", value: 3)
!166 = !DIEnumerator(name: "OHTAColorspace", value: 4)
!167 = !DIEnumerator(name: "LabColorspace", value: 5)
!168 = !DIEnumerator(name: "XYZColorspace", value: 6)
!169 = !DIEnumerator(name: "YCbCrColorspace", value: 7)
!170 = !DIEnumerator(name: "YCCColorspace", value: 8)
!171 = !DIEnumerator(name: "YIQColorspace", value: 9)
!172 = !DIEnumerator(name: "YPbPrColorspace", value: 10)
!173 = !DIEnumerator(name: "YUVColorspace", value: 11)
!174 = !DIEnumerator(name: "CMYKColorspace", value: 12)
!175 = !DIEnumerator(name: "sRGBColorspace", value: 13)
!176 = !DIEnumerator(name: "HSBColorspace", value: 14)
!177 = !DIEnumerator(name: "HSLColorspace", value: 15)
!178 = !DIEnumerator(name: "HWBColorspace", value: 16)
!179 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17)
!180 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18)
!181 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19)
!182 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20)
!183 = !DIEnumerator(name: "LogColorspace", value: 21)
!184 = !DIEnumerator(name: "CMYColorspace", value: 22)
!185 = !DIEnumerator(name: "LuvColorspace", value: 23)
!186 = !DIEnumerator(name: "HCLColorspace", value: 24)
!187 = !DIEnumerator(name: "LCHColorspace", value: 25)
!188 = !DIEnumerator(name: "LMSColorspace", value: 26)
!189 = !DIEnumerator(name: "LCHabColorspace", value: 27)
!190 = !DIEnumerator(name: "LCHuvColorspace", value: 28)
!191 = !DIEnumerator(name: "scRGBColorspace", value: 29)
!192 = !DIEnumerator(name: "HSIColorspace", value: 30)
!193 = !DIEnumerator(name: "HSVColorspace", value: 31)
!194 = !DIEnumerator(name: "HCLpColorspace", value: 32)
!195 = !DIEnumerator(name: "YDbDrColorspace", value: 33)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !197, line: 25, baseType: !12, size: 32, elements: !198)
!197 = !DIFile(filename: "apps/538.imagick_r/src/magick/compress.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "359677d10ff2e6d05d86b0a6c5af7465")
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!199 = !DIEnumerator(name: "UndefinedCompression", value: 0)
!200 = !DIEnumerator(name: "NoCompression", value: 1)
!201 = !DIEnumerator(name: "BZipCompression", value: 2)
!202 = !DIEnumerator(name: "DXT1Compression", value: 3)
!203 = !DIEnumerator(name: "DXT3Compression", value: 4)
!204 = !DIEnumerator(name: "DXT5Compression", value: 5)
!205 = !DIEnumerator(name: "FaxCompression", value: 6)
!206 = !DIEnumerator(name: "Group4Compression", value: 7)
!207 = !DIEnumerator(name: "JPEGCompression", value: 8)
!208 = !DIEnumerator(name: "JPEG2000Compression", value: 9)
!209 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10)
!210 = !DIEnumerator(name: "LZWCompression", value: 11)
!211 = !DIEnumerator(name: "RLECompression", value: 12)
!212 = !DIEnumerator(name: "ZipCompression", value: 13)
!213 = !DIEnumerator(name: "ZipSCompression", value: 14)
!214 = !DIEnumerator(name: "PizCompression", value: 15)
!215 = !DIEnumerator(name: "Pxr24Compression", value: 16)
!216 = !DIEnumerator(name: "B44Compression", value: 17)
!217 = !DIEnumerator(name: "B44ACompression", value: 18)
!218 = !DIEnumerator(name: "LZMACompression", value: 19)
!219 = !DIEnumerator(name: "JBIG1Compression", value: 20)
!220 = !DIEnumerator(name: "JBIG2Compression", value: 21)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !222, line: 75, baseType: !12, size: 32, elements: !223)
!222 = !DIFile(filename: "apps/538.imagick_r/src/magick/image.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e9408eec9abffe54016aa20ae735786b")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIEnumerator(name: "UndefinedOrientation", value: 0)
!225 = !DIEnumerator(name: "TopLeftOrientation", value: 1)
!226 = !DIEnumerator(name: "TopRightOrientation", value: 2)
!227 = !DIEnumerator(name: "BottomRightOrientation", value: 3)
!228 = !DIEnumerator(name: "BottomLeftOrientation", value: 4)
!229 = !DIEnumerator(name: "LeftTopOrientation", value: 5)
!230 = !DIEnumerator(name: "RightTopOrientation", value: 6)
!231 = !DIEnumerator(name: "RightBottomOrientation", value: 7)
!232 = !DIEnumerator(name: "LeftBottomOrientation", value: 8)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 42, baseType: !12, size: 32, elements: !235)
!234 = !DIFile(filename: "apps/538.imagick_r/src/magick/profile.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fb61c1ae348c42a2b68ac081d4b39ee3")
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIEnumerator(name: "UndefinedIntent", value: 0)
!237 = !DIEnumerator(name: "SaturationIntent", value: 1)
!238 = !DIEnumerator(name: "PerceptualIntent", value: 2)
!239 = !DIEnumerator(name: "AbsoluteIntent", value: 3)
!240 = !DIEnumerator(name: "RelativeIntent", value: 4)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !222, line: 88, baseType: !12, size: 32, elements: !242)
!242 = !{!243, !244, !245}
!243 = !DIEnumerator(name: "UndefinedResolution", value: 0)
!244 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1)
!245 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !247, line: 32, baseType: !12, size: 32, elements: !248)
!247 = !DIFile(filename: "apps/538.imagick_r/src/magick/resample.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "722fed6aaf07c122ede72839e4dadc42")
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!249 = !DIEnumerator(name: "UndefinedFilter", value: 0)
!250 = !DIEnumerator(name: "PointFilter", value: 1)
!251 = !DIEnumerator(name: "BoxFilter", value: 2)
!252 = !DIEnumerator(name: "TriangleFilter", value: 3)
!253 = !DIEnumerator(name: "HermiteFilter", value: 4)
!254 = !DIEnumerator(name: "HanningFilter", value: 5)
!255 = !DIEnumerator(name: "HammingFilter", value: 6)
!256 = !DIEnumerator(name: "BlackmanFilter", value: 7)
!257 = !DIEnumerator(name: "GaussianFilter", value: 8)
!258 = !DIEnumerator(name: "QuadraticFilter", value: 9)
!259 = !DIEnumerator(name: "CubicFilter", value: 10)
!260 = !DIEnumerator(name: "CatromFilter", value: 11)
!261 = !DIEnumerator(name: "MitchellFilter", value: 12)
!262 = !DIEnumerator(name: "JincFilter", value: 13)
!263 = !DIEnumerator(name: "SincFilter", value: 14)
!264 = !DIEnumerator(name: "SincFastFilter", value: 15)
!265 = !DIEnumerator(name: "KaiserFilter", value: 16)
!266 = !DIEnumerator(name: "WelshFilter", value: 17)
!267 = !DIEnumerator(name: "ParzenFilter", value: 18)
!268 = !DIEnumerator(name: "BohmanFilter", value: 19)
!269 = !DIEnumerator(name: "BartlettFilter", value: 20)
!270 = !DIEnumerator(name: "LagrangeFilter", value: 21)
!271 = !DIEnumerator(name: "LanczosFilter", value: 22)
!272 = !DIEnumerator(name: "LanczosSharpFilter", value: 23)
!273 = !DIEnumerator(name: "Lanczos2Filter", value: 24)
!274 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25)
!275 = !DIEnumerator(name: "RobidouxFilter", value: 26)
!276 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27)
!277 = !DIEnumerator(name: "CosineFilter", value: 28)
!278 = !DIEnumerator(name: "SplineFilter", value: 29)
!279 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30)
!280 = !DIEnumerator(name: "SentinelFilter", value: 31)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !222, line: 63, baseType: !12, size: 32, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290}
!283 = !DIEnumerator(name: "UndefinedInterlace", value: 0)
!284 = !DIEnumerator(name: "NoInterlace", value: 1)
!285 = !DIEnumerator(name: "LineInterlace", value: 2)
!286 = !DIEnumerator(name: "PlaneInterlace", value: 3)
!287 = !DIEnumerator(name: "PartitionInterlace", value: 4)
!288 = !DIEnumerator(name: "GIFInterlace", value: 5)
!289 = !DIEnumerator(name: "JPEGInterlace", value: 6)
!290 = !DIEnumerator(name: "PNGInterlace", value: 7)
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !292, line: 30, baseType: !12, size: 32, elements: !293)
!292 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1f6eaed79d9a4eaf712cd066f6ff022a")
!293 = !{!294, !295, !296}
!294 = !DIEnumerator(name: "UndefinedEndian", value: 0)
!295 = !DIEnumerator(name: "LSBEndian", value: 1)
!296 = !DIEnumerator(name: "MSBEndian", value: 2)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !298, line: 77, baseType: !12, size: 32, elements: !299)
!298 = !DIFile(filename: "apps/538.imagick_r/src/magick/geometry.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "889bed117eb2a2fce6e2622bd130bcd2")
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!300 = !DIEnumerator(name: "UndefinedGravity", value: 0)
!301 = !DIEnumerator(name: "ForgetGravity", value: 0)
!302 = !DIEnumerator(name: "NorthWestGravity", value: 1)
!303 = !DIEnumerator(name: "NorthGravity", value: 2)
!304 = !DIEnumerator(name: "NorthEastGravity", value: 3)
!305 = !DIEnumerator(name: "WestGravity", value: 4)
!306 = !DIEnumerator(name: "CenterGravity", value: 5)
!307 = !DIEnumerator(name: "EastGravity", value: 6)
!308 = !DIEnumerator(name: "SouthWestGravity", value: 7)
!309 = !DIEnumerator(name: "SouthGravity", value: 8)
!310 = !DIEnumerator(name: "SouthEastGravity", value: 9)
!311 = !DIEnumerator(name: "StaticGravity", value: 10)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !313, line: 25, baseType: !12, size: 32, elements: !314)
!313 = !DIFile(filename: "apps/538.imagick_r/src/magick/composite.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "837959ddb1dc628f80f1f9b5cdda1fb4")
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!315 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0)
!316 = !DIEnumerator(name: "NoCompositeOp", value: 1)
!317 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2)
!318 = !DIEnumerator(name: "AtopCompositeOp", value: 3)
!319 = !DIEnumerator(name: "BlendCompositeOp", value: 4)
!320 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5)
!321 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6)
!322 = !DIEnumerator(name: "ClearCompositeOp", value: 7)
!323 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8)
!324 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9)
!325 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10)
!326 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11)
!327 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12)
!328 = !DIEnumerator(name: "CopyCompositeOp", value: 13)
!329 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14)
!330 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15)
!331 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16)
!332 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17)
!333 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18)
!334 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19)
!335 = !DIEnumerator(name: "DarkenCompositeOp", value: 20)
!336 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21)
!337 = !DIEnumerator(name: "DstCompositeOp", value: 22)
!338 = !DIEnumerator(name: "DstInCompositeOp", value: 23)
!339 = !DIEnumerator(name: "DstOutCompositeOp", value: 24)
!340 = !DIEnumerator(name: "DstOverCompositeOp", value: 25)
!341 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26)
!342 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27)
!343 = !DIEnumerator(name: "DissolveCompositeOp", value: 28)
!344 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29)
!345 = !DIEnumerator(name: "HardLightCompositeOp", value: 30)
!346 = !DIEnumerator(name: "HueCompositeOp", value: 31)
!347 = !DIEnumerator(name: "InCompositeOp", value: 32)
!348 = !DIEnumerator(name: "LightenCompositeOp", value: 33)
!349 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34)
!350 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35)
!351 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36)
!352 = !DIEnumerator(name: "ModulateCompositeOp", value: 37)
!353 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38)
!354 = !DIEnumerator(name: "OutCompositeOp", value: 39)
!355 = !DIEnumerator(name: "OverCompositeOp", value: 40)
!356 = !DIEnumerator(name: "OverlayCompositeOp", value: 41)
!357 = !DIEnumerator(name: "PlusCompositeOp", value: 42)
!358 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43)
!359 = !DIEnumerator(name: "SaturateCompositeOp", value: 44)
!360 = !DIEnumerator(name: "ScreenCompositeOp", value: 45)
!361 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46)
!362 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47)
!363 = !DIEnumerator(name: "SrcCompositeOp", value: 48)
!364 = !DIEnumerator(name: "SrcInCompositeOp", value: 49)
!365 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50)
!366 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51)
!367 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52)
!368 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53)
!369 = !DIEnumerator(name: "XorCompositeOp", value: 54)
!370 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55)
!371 = !DIEnumerator(name: "DistortCompositeOp", value: 56)
!372 = !DIEnumerator(name: "BlurCompositeOp", value: 57)
!373 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58)
!374 = !DIEnumerator(name: "VividLightCompositeOp", value: 59)
!375 = !DIEnumerator(name: "PinLightCompositeOp", value: 60)
!376 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61)
!377 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62)
!378 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63)
!379 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64)
!380 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65)
!381 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66)
!382 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67)
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !384, line: 25, baseType: !12, size: 32, elements: !385)
!384 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!385 = !{!386, !387, !388, !389, !390}
!386 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!387 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!388 = !DIEnumerator(name: "NoneDispose", value: 1)
!389 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!390 = !DIEnumerator(name: "PreviousDispose", value: 3)
!391 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !392, line: 25, baseType: !12, size: 32, elements: !393)
!392 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!393 = !{!394, !395, !396}
!394 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!395 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!396 = !DIEnumerator(name: "RunningTimerState", value: 2)
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !398, line: 31, baseType: !12, size: 32, elements: !399)
!398 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!400 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!401 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!402 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!403 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!404 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!405 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!406 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!407 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!408 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!409 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!410 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!411 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!412 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!413 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !222, line: 47, baseType: !12, size: 32, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!416 = !DIEnumerator(name: "UndefinedType", value: 0)
!417 = !DIEnumerator(name: "BilevelType", value: 1)
!418 = !DIEnumerator(name: "GrayscaleType", value: 2)
!419 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!420 = !DIEnumerator(name: "PaletteType", value: 4)
!421 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!422 = !DIEnumerator(name: "TrueColorType", value: 6)
!423 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!424 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!425 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!426 = !DIEnumerator(name: "OptimizeType", value: 10)
!427 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !398, line: 67, baseType: !12, size: 32, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439}
!430 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!431 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!432 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!433 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!434 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!435 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!436 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!437 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!438 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!439 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !292, line: 44, baseType: !12, size: 32, elements: !441)
!441 = !{!442, !443, !444, !445}
!442 = !DIEnumerator(name: "UndefinedQuantumFormat", value: 0)
!443 = !DIEnumerator(name: "FloatingPointQuantumFormat", value: 1)
!444 = !DIEnumerator(name: "SignedQuantumFormat", value: 2)
!445 = !DIEnumerator(name: "UnsignedQuantumFormat", value: 3)
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !292, line: 37, baseType: !12, size: 32, elements: !447)
!447 = !{!448, !449, !450}
!448 = !DIEnumerator(name: "UndefinedQuantumAlpha", value: 0)
!449 = !DIEnumerator(name: "AssociatedQuantumAlpha", value: 1)
!450 = !DIEnumerator(name: "DisassociatedQuantumAlpha", value: 2)
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !292, line: 52, baseType: !12, size: 32, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!453 = !DIEnumerator(name: "UndefinedQuantum", value: 0)
!454 = !DIEnumerator(name: "AlphaQuantum", value: 1)
!455 = !DIEnumerator(name: "BlackQuantum", value: 2)
!456 = !DIEnumerator(name: "BlueQuantum", value: 3)
!457 = !DIEnumerator(name: "CMYKAQuantum", value: 4)
!458 = !DIEnumerator(name: "CMYKQuantum", value: 5)
!459 = !DIEnumerator(name: "CyanQuantum", value: 6)
!460 = !DIEnumerator(name: "GrayAlphaQuantum", value: 7)
!461 = !DIEnumerator(name: "GrayQuantum", value: 8)
!462 = !DIEnumerator(name: "GreenQuantum", value: 9)
!463 = !DIEnumerator(name: "IndexAlphaQuantum", value: 10)
!464 = !DIEnumerator(name: "IndexQuantum", value: 11)
!465 = !DIEnumerator(name: "MagentaQuantum", value: 12)
!466 = !DIEnumerator(name: "OpacityQuantum", value: 13)
!467 = !DIEnumerator(name: "RedQuantum", value: 14)
!468 = !DIEnumerator(name: "RGBAQuantum", value: 15)
!469 = !DIEnumerator(name: "BGRAQuantum", value: 16)
!470 = !DIEnumerator(name: "RGBOQuantum", value: 17)
!471 = !DIEnumerator(name: "RGBQuantum", value: 18)
!472 = !DIEnumerator(name: "YellowQuantum", value: 19)
!473 = !DIEnumerator(name: "GrayPadQuantum", value: 20)
!474 = !DIEnumerator(name: "RGBPadQuantum", value: 21)
!475 = !DIEnumerator(name: "CbYCrYQuantum", value: 22)
!476 = !DIEnumerator(name: "CbYCrQuantum", value: 23)
!477 = !DIEnumerator(name: "CbYCrAQuantum", value: 24)
!478 = !DIEnumerator(name: "CMYKOQuantum", value: 25)
!479 = !DIEnumerator(name: "BGRQuantum", value: 26)
!480 = !DIEnumerator(name: "BGROQuantum", value: 27)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !482, line: 27, baseType: !12, size: 32, elements: !483)
!482 = !DIFile(filename: "apps/538.imagick_r/src/magick/effect.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "85233add4591bd6d6001c51d4fa6a546")
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!484 = !DIEnumerator(name: "UndefinedPreview", value: 0)
!485 = !DIEnumerator(name: "RotatePreview", value: 1)
!486 = !DIEnumerator(name: "ShearPreview", value: 2)
!487 = !DIEnumerator(name: "RollPreview", value: 3)
!488 = !DIEnumerator(name: "HuePreview", value: 4)
!489 = !DIEnumerator(name: "SaturationPreview", value: 5)
!490 = !DIEnumerator(name: "BrightnessPreview", value: 6)
!491 = !DIEnumerator(name: "GammaPreview", value: 7)
!492 = !DIEnumerator(name: "SpiffPreview", value: 8)
!493 = !DIEnumerator(name: "DullPreview", value: 9)
!494 = !DIEnumerator(name: "GrayscalePreview", value: 10)
!495 = !DIEnumerator(name: "QuantizePreview", value: 11)
!496 = !DIEnumerator(name: "DespecklePreview", value: 12)
!497 = !DIEnumerator(name: "ReduceNoisePreview", value: 13)
!498 = !DIEnumerator(name: "AddNoisePreview", value: 14)
!499 = !DIEnumerator(name: "SharpenPreview", value: 15)
!500 = !DIEnumerator(name: "BlurPreview", value: 16)
!501 = !DIEnumerator(name: "ThresholdPreview", value: 17)
!502 = !DIEnumerator(name: "EdgeDetectPreview", value: 18)
!503 = !DIEnumerator(name: "SpreadPreview", value: 19)
!504 = !DIEnumerator(name: "SolarizePreview", value: 20)
!505 = !DIEnumerator(name: "ShadePreview", value: 21)
!506 = !DIEnumerator(name: "RaisePreview", value: 22)
!507 = !DIEnumerator(name: "SegmentPreview", value: 23)
!508 = !DIEnumerator(name: "SwirlPreview", value: 24)
!509 = !DIEnumerator(name: "ImplodePreview", value: 25)
!510 = !DIEnumerator(name: "WavePreview", value: 26)
!511 = !DIEnumerator(name: "OilPaintPreview", value: 27)
!512 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28)
!513 = !DIEnumerator(name: "JPEGPreview", value: 29)
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 177, baseType: !12, size: 32, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!516 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!517 = !DIEnumerator(name: "RedChannel", value: 1)
!518 = !DIEnumerator(name: "GrayChannel", value: 1)
!519 = !DIEnumerator(name: "CyanChannel", value: 1)
!520 = !DIEnumerator(name: "GreenChannel", value: 2)
!521 = !DIEnumerator(name: "MagentaChannel", value: 2)
!522 = !DIEnumerator(name: "BlueChannel", value: 4)
!523 = !DIEnumerator(name: "YellowChannel", value: 4)
!524 = !DIEnumerator(name: "AlphaChannel", value: 8)
!525 = !DIEnumerator(name: "OpacityChannel", value: 8)
!526 = !DIEnumerator(name: "MatteChannel", value: 8)
!527 = !DIEnumerator(name: "BlackChannel", value: 32)
!528 = !DIEnumerator(name: "IndexChannel", value: 32)
!529 = !DIEnumerator(name: "CompositeChannels", value: 47)
!530 = !DIEnumerator(name: "AllChannels", value: 134217727)
!531 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!532 = !DIEnumerator(name: "RGBChannels", value: 128)
!533 = !DIEnumerator(name: "GrayChannels", value: 128)
!534 = !DIEnumerator(name: "SyncChannels", value: 256)
!535 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!536 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !537, line: 27, baseType: !12, size: 32, elements: !538)
!537 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!539 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!540 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!541 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!542 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!543 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!544 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!545 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!546 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!547 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!548 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!549 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!550 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!551 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!552 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!553 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!554 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!555 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!556 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!557 = !{!6, !558, !31, !559, !35, !560, !47, !15, !27, !12, !561, !898, !625, !932}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!559 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !41, line: 223, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !222, line: 356, size: 134336, elements: !565)
!565 = !{!566, !568, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !583, !585, !587, !588, !589, !590, !591, !592, !593, !595, !596, !606, !607, !608, !609, !610, !611, !613, !615, !617, !618, !619, !620, !621, !622, !624, !812, !813, !814, !815, !816, !827, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !895, !896, !897}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !564, file: !222, line: 359, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !197, line: 49, baseType: !196)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !564, file: !222, line: 362, baseType: !569, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !222, line: 86, baseType: !221)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !564, file: !222, line: 365, baseType: !40, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !564, file: !222, line: 366, baseType: !40, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !564, file: !222, line: 367, baseType: !40, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !564, file: !222, line: 368, baseType: !40, size: 32, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !564, file: !222, line: 371, baseType: !560, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !564, file: !222, line: 372, baseType: !560, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !564, file: !222, line: 373, baseType: !560, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !564, file: !222, line: 374, baseType: !560, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !564, file: !222, line: 377, baseType: !29, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !564, file: !222, line: 378, baseType: !29, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !564, file: !222, line: 379, baseType: !29, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !564, file: !222, line: 382, baseType: !582, size: 32, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !222, line: 73, baseType: !281)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !564, file: !222, line: 385, baseType: !584, size: 32, offset: 672)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !292, line: 35, baseType: !291)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !564, file: !222, line: 388, baseType: !586, size: 32, offset: 704)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !222, line: 93, baseType: !241)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !564, file: !222, line: 391, baseType: !29, size: 64, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !564, file: !222, line: 394, baseType: !560, size: 64, offset: 832)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !564, file: !222, line: 395, baseType: !560, size: 64, offset: 896)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !564, file: !222, line: 396, baseType: !560, size: 64, offset: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !564, file: !222, line: 397, baseType: !560, size: 64, offset: 1024)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !564, file: !222, line: 398, baseType: !560, size: 64, offset: 1088)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !564, file: !222, line: 401, baseType: !594, size: 64, offset: 1152)
!594 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !564, file: !222, line: 402, baseType: !594, size: 64, offset: 1216)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !564, file: !222, line: 405, baseType: !597, size: 64, offset: 1280)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !398, line: 148, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !398, line: 131, size: 64, elements: !599)
!599 = !{!600, !603, !604, !605}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !598, file: !398, line: 143, baseType: !601, size: 16)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !41, line: 93, baseType: !602)
!602 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !598, file: !398, line: 144, baseType: !601, size: 16, offset: 16)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !598, file: !398, line: 145, baseType: !601, size: 16, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !598, file: !398, line: 146, baseType: !601, size: 16, offset: 48)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !564, file: !222, line: 406, baseType: !597, size: 64, offset: 1344)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !564, file: !222, line: 407, baseType: !597, size: 64, offset: 1408)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !564, file: !222, line: 410, baseType: !40, size: 32, offset: 1472)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !564, file: !222, line: 411, baseType: !40, size: 32, offset: 1504)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !564, file: !222, line: 414, baseType: !29, size: 64, offset: 1536)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !564, file: !222, line: 417, baseType: !612, size: 32, offset: 1600)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !160, line: 61, baseType: !159)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !564, file: !222, line: 420, baseType: !614, size: 32, offset: 1632)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !222, line: 61, baseType: !414)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !564, file: !222, line: 423, baseType: !616, size: 32, offset: 1664)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !482, line: 59, baseType: !481)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !564, file: !222, line: 426, baseType: !47, size: 64, offset: 1728)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !564, file: !222, line: 429, baseType: !40, size: 32, offset: 1792)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !564, file: !222, line: 430, baseType: !40, size: 32, offset: 1824)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !564, file: !222, line: 433, baseType: !560, size: 64, offset: 1856)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !564, file: !222, line: 434, baseType: !560, size: 64, offset: 1920)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !564, file: !222, line: 437, baseType: !623, size: 32, offset: 1984)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !41, line: 202, baseType: !514)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !564, file: !222, line: 440, baseType: !625, size: 64, offset: 2048)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !41, line: 221, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !222, line: 150, size: 105920, elements: !628)
!628 = !{!629, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !643, !644, !645, !646, !647, !661, !663, !664, !665, !666, !667, !668, !669, !670, !671, !679, !680, !681, !682, !683, !684, !686, !687, !688, !690, !692, !694, !696, !697, !698, !699, !700, !701, !702, !710, !725, !739, !740, !741, !742, !746, !750, !751, !752, !753, !754, !755, !772, !773, !775, !776, !784, !785, !787, !788, !789, !790, !791, !792, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !809, !811}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !627, file: !222, line: 153, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !41, line: 209, baseType: !154)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !627, file: !222, line: 156, baseType: !612, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !627, file: !222, line: 159, baseType: !567, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !627, file: !222, line: 162, baseType: !29, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !627, file: !222, line: 165, baseType: !569, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !627, file: !222, line: 168, baseType: !40, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !627, file: !222, line: 169, baseType: !40, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !627, file: !222, line: 172, baseType: !29, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !627, file: !222, line: 173, baseType: !29, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !627, file: !222, line: 174, baseType: !29, size: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !627, file: !222, line: 175, baseType: !29, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !627, file: !222, line: 178, baseType: !642, size: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !627, file: !222, line: 179, baseType: !597, size: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !627, file: !222, line: 180, baseType: !597, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !627, file: !222, line: 181, baseType: !597, size: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !627, file: !222, line: 184, baseType: !594, size: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !627, file: !222, line: 187, baseType: !648, size: 768, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !222, line: 128, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !222, line: 121, size: 768, elements: !650)
!650 = !{!651, !658, !659, !660}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !649, file: !222, line: 124, baseType: !652, size: 192)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !222, line: 101, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !222, line: 95, size: 192, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !653, file: !222, line: 98, baseType: !594, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !653, file: !222, line: 99, baseType: !594, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !653, file: !222, line: 100, baseType: !594, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !649, file: !222, line: 125, baseType: !652, size: 192, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !649, file: !222, line: 126, baseType: !652, size: 192, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !649, file: !222, line: 127, baseType: !652, size: 192, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !627, file: !222, line: 190, baseType: !662, size: 32, offset: 1664)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !234, line: 49, baseType: !233)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !627, file: !222, line: 193, baseType: !558, size: 64, offset: 1728)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !627, file: !222, line: 196, baseType: !586, size: 32, offset: 1792)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !627, file: !222, line: 199, baseType: !560, size: 64, offset: 1856)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !627, file: !222, line: 200, baseType: !560, size: 64, offset: 1920)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !627, file: !222, line: 201, baseType: !560, size: 64, offset: 1984)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !627, file: !222, line: 204, baseType: !47, size: 64, offset: 2048)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !627, file: !222, line: 207, baseType: !594, size: 64, offset: 2112)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !627, file: !222, line: 208, baseType: !594, size: 64, offset: 2176)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !627, file: !222, line: 211, baseType: !672, size: 256, offset: 2240)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !298, line: 130, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !298, line: 121, size: 256, elements: !674)
!674 = !{!675, !676, !677, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !673, file: !298, line: 124, baseType: !29, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !673, file: !298, line: 125, baseType: !29, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !673, file: !298, line: 128, baseType: !47, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !673, file: !298, line: 129, baseType: !47, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !627, file: !222, line: 212, baseType: !672, size: 256, offset: 2496)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !627, file: !222, line: 213, baseType: !672, size: 256, offset: 2752)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !627, file: !222, line: 216, baseType: !594, size: 64, offset: 3008)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !627, file: !222, line: 217, baseType: !594, size: 64, offset: 3072)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !627, file: !222, line: 218, baseType: !594, size: 64, offset: 3136)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !627, file: !222, line: 221, baseType: !685, size: 32, offset: 3200)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !247, line: 66, baseType: !246)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !627, file: !222, line: 224, baseType: !582, size: 32, offset: 3232)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !627, file: !222, line: 227, baseType: !584, size: 32, offset: 3264)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !627, file: !222, line: 230, baseType: !689, size: 32, offset: 3296)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !298, line: 91, baseType: !297)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !627, file: !222, line: 233, baseType: !691, size: 32, offset: 3328)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !313, line: 99, baseType: !312)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !627, file: !222, line: 236, baseType: !693, size: 32, offset: 3360)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !384, line: 32, baseType: !383)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !627, file: !222, line: 239, baseType: !695, size: 64, offset: 3392)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !627, file: !222, line: 242, baseType: !29, size: 64, offset: 3456)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !627, file: !222, line: 243, baseType: !29, size: 64, offset: 3520)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !627, file: !222, line: 246, baseType: !47, size: 64, offset: 3584)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !627, file: !222, line: 249, baseType: !29, size: 64, offset: 3648)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !627, file: !222, line: 250, baseType: !29, size: 64, offset: 3712)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !627, file: !222, line: 253, baseType: !47, size: 64, offset: 3776)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !627, file: !222, line: 256, baseType: !703, size: 192, offset: 3840)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !704, line: 68, baseType: !705)
!704 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !704, line: 62, size: 192, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !705, file: !704, line: 65, baseType: !594, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !705, file: !704, line: 66, baseType: !594, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !705, file: !704, line: 67, baseType: !594, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !627, file: !222, line: 259, baseType: !711, size: 512, offset: 4032)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !392, line: 51, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !392, line: 40, size: 512, elements: !713)
!713 = !{!714, !721, !722, !724}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !712, file: !392, line: 43, baseType: !715, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !392, line: 38, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !392, line: 32, size: 192, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !716, file: !392, line: 35, baseType: !594, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !716, file: !392, line: 36, baseType: !594, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !716, file: !392, line: 37, baseType: !594, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !712, file: !392, line: 44, baseType: !715, size: 192, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !712, file: !392, line: 47, baseType: !723, size: 32, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !392, line: 30, baseType: !391)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !712, file: !392, line: 50, baseType: !29, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !627, file: !222, line: 262, baseType: !726, size: 64, offset: 4544)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !727, line: 26, baseType: !728)
!727 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!40, !731, !733, !736, !558}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !41, line: 150, baseType: !735)
!735 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !41, line: 151, baseType: !738)
!738 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !627, file: !222, line: 265, baseType: !558, size: 64, offset: 4608)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !627, file: !222, line: 266, baseType: !558, size: 64, offset: 4672)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !627, file: !222, line: 267, baseType: !558, size: 64, offset: 4736)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !627, file: !222, line: 270, baseType: !743, size: 64, offset: 4800)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !197, line: 52, baseType: !745)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !197, line: 51, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !627, file: !222, line: 273, baseType: !747, size: 64, offset: 4864)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !41, line: 217, baseType: !749)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !41, line: 217, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !627, file: !222, line: 276, baseType: !21, size: 32768, offset: 4928)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !627, file: !222, line: 277, baseType: !21, size: 32768, offset: 37696)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !627, file: !222, line: 278, baseType: !21, size: 32768, offset: 70464)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !627, file: !222, line: 281, baseType: !29, size: 64, offset: 103232)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !627, file: !222, line: 282, baseType: !29, size: 64, offset: 103296)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !627, file: !222, line: 285, baseType: !756, size: 448, offset: 103360)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !41, line: 219, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !57, line: 102, size: 448, elements: !758)
!758 = !{!759, !761, !762, !763, !764, !765, !766, !771}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !757, file: !57, line: 105, baseType: !760, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !57, line: 100, baseType: !56)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !757, file: !57, line: 108, baseType: !559, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !757, file: !57, line: 111, baseType: !560, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !757, file: !57, line: 112, baseType: !560, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !757, file: !57, line: 115, baseType: !558, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !757, file: !57, line: 118, baseType: !40, size: 32, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !757, file: !57, line: 121, baseType: !767, size: 64, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !769, line: 26, baseType: !770)
!769 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !769, line: 25, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !757, file: !57, line: 124, baseType: !29, size: 64, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !627, file: !222, line: 288, baseType: !40, size: 32, offset: 103808)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !627, file: !222, line: 291, baseType: !774, size: 64, offset: 103872)
!774 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !627, file: !222, line: 294, baseType: !767, size: 64, offset: 103936)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !627, file: !222, line: 297, baseType: !777, size: 256, offset: 104000)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !234, line: 40, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !234, line: 27, size: 256, elements: !779)
!779 = !{!780, !781, !782, !783}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !778, file: !234, line: 30, baseType: !560, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !778, file: !234, line: 33, baseType: !29, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !778, file: !234, line: 36, baseType: !26, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !778, file: !234, line: 39, baseType: !29, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !627, file: !222, line: 298, baseType: !777, size: 256, offset: 104256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !627, file: !222, line: 299, baseType: !786, size: 64, offset: 104512)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !627, file: !222, line: 302, baseType: !29, size: 64, offset: 104576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !627, file: !222, line: 305, baseType: !29, size: 64, offset: 104640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !627, file: !222, line: 308, baseType: !695, size: 64, offset: 104704)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !627, file: !222, line: 309, baseType: !695, size: 64, offset: 104768)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !222, line: 310, baseType: !695, size: 64, offset: 104832)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !627, file: !222, line: 313, baseType: !793, size: 32, offset: 104896)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !398, line: 47, baseType: !397)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !627, file: !222, line: 316, baseType: !40, size: 32, offset: 104928)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !627, file: !222, line: 319, baseType: !597, size: 64, offset: 104960)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !627, file: !222, line: 322, baseType: !695, size: 64, offset: 105024)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !627, file: !222, line: 325, baseType: !672, size: 256, offset: 105088)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !627, file: !222, line: 328, baseType: !558, size: 64, offset: 105344)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !627, file: !222, line: 329, baseType: !558, size: 64, offset: 105408)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !627, file: !222, line: 332, baseType: !614, size: 32, offset: 105472)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !627, file: !222, line: 335, baseType: !40, size: 32, offset: 105504)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !627, file: !222, line: 338, baseType: !737, size: 64, offset: 105536)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !627, file: !222, line: 341, baseType: !40, size: 32, offset: 105600)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !627, file: !222, line: 344, baseType: !29, size: 64, offset: 105664)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !627, file: !222, line: 347, baseType: !806, size: 64, offset: 105728)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !807, line: 7, baseType: !808)
!807 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !50, line: 160, baseType: !51)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !627, file: !222, line: 350, baseType: !810, size: 32, offset: 105792)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !398, line: 79, baseType: !428)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !627, file: !222, line: 353, baseType: !29, size: 64, offset: 105856)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !564, file: !222, line: 443, baseType: !558, size: 64, offset: 2112)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !564, file: !222, line: 446, baseType: !726, size: 64, offset: 2176)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !564, file: !222, line: 449, baseType: !558, size: 64, offset: 2240)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !564, file: !222, line: 450, baseType: !558, size: 64, offset: 2304)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !564, file: !222, line: 453, baseType: !817, size: 64, offset: 2368)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !818, line: 26, baseType: !819)
!818 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!29, !822, !824, !826}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !564, file: !222, line: 456, baseType: !828, size: 64, offset: 2432)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !830, line: 7, baseType: !831)
!830 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !832, line: 49, size: 1728, elements: !833)
!832 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !849, !851, !852, !853, !855, !856, !858, !862, !865, !867, !870, !873, !874, !875, !876, !877}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !831, file: !832, line: 51, baseType: !559, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !831, file: !832, line: 54, baseType: !560, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !831, file: !832, line: 55, baseType: !560, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !831, file: !832, line: 56, baseType: !560, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !831, file: !832, line: 57, baseType: !560, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !831, file: !832, line: 58, baseType: !560, size: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !831, file: !832, line: 59, baseType: !560, size: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !831, file: !832, line: 60, baseType: !560, size: 64, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !831, file: !832, line: 61, baseType: !560, size: 64, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !831, file: !832, line: 64, baseType: !560, size: 64, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !831, file: !832, line: 65, baseType: !560, size: 64, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !831, file: !832, line: 66, baseType: !560, size: 64, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !831, file: !832, line: 68, baseType: !847, size: 64, offset: 768)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !832, line: 36, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !831, file: !832, line: 70, baseType: !850, size: 64, offset: 832)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !831, file: !832, line: 72, baseType: !559, size: 32, offset: 896)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !831, file: !832, line: 73, baseType: !559, size: 32, offset: 928)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !831, file: !832, line: 74, baseType: !854, size: 64, offset: 960)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 152, baseType: !51)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !831, file: !832, line: 77, baseType: !602, size: 16, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !831, file: !832, line: 78, baseType: !857, size: 8, offset: 1040)
!857 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !831, file: !832, line: 79, baseType: !859, size: 8, offset: 1048)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 1)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !831, file: !832, line: 81, baseType: !863, size: 64, offset: 1088)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !832, line: 43, baseType: null)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !831, file: !832, line: 89, baseType: !866, size: 64, offset: 1152)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 153, baseType: !51)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !831, file: !832, line: 91, baseType: !868, size: 64, offset: 1216)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !832, line: 37, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !831, file: !832, line: 92, baseType: !871, size: 64, offset: 1280)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !832, line: 38, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !831, file: !832, line: 93, baseType: !850, size: 64, offset: 1344)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !831, file: !832, line: 94, baseType: !558, size: 64, offset: 1408)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !831, file: !832, line: 95, baseType: !29, size: 64, offset: 1472)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !831, file: !832, line: 96, baseType: !559, size: 32, offset: 1536)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !831, file: !832, line: 98, baseType: !878, size: 160, offset: 1568)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 20)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !564, file: !222, line: 459, baseType: !558, size: 64, offset: 2496)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !564, file: !222, line: 462, baseType: !29, size: 64, offset: 2560)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !564, file: !222, line: 465, baseType: !21, size: 32768, offset: 2624)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !564, file: !222, line: 466, baseType: !21, size: 32768, offset: 35392)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !564, file: !222, line: 467, baseType: !21, size: 32768, offset: 68160)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !564, file: !222, line: 468, baseType: !21, size: 32768, offset: 100928)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !564, file: !222, line: 471, baseType: !40, size: 32, offset: 133696)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !564, file: !222, line: 474, baseType: !560, size: 64, offset: 133760)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !564, file: !222, line: 477, baseType: !29, size: 64, offset: 133824)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !564, file: !222, line: 478, baseType: !29, size: 64, offset: 133888)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !564, file: !222, line: 481, baseType: !597, size: 64, offset: 133952)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !564, file: !222, line: 484, baseType: !29, size: 64, offset: 134016)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !564, file: !222, line: 487, baseType: !894, size: 32, offset: 134080)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !537, line: 47, baseType: !536)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !564, file: !222, line: 490, baseType: !597, size: 64, offset: 134112)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !564, file: !222, line: 493, baseType: !558, size: 64, offset: 134208)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !564, file: !222, line: 496, baseType: !40, size: 32, offset: 134272)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumInfo", file: !292, line: 85, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumInfo", file: !901, line: 42, size: 1216, elements: !902)
!901 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!902 = !{!903, !904, !905, !907, !908, !909, !910, !911, !912, !913, !915, !916, !918, !919, !920, !930, !931}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !900, file: !901, line: 45, baseType: !29, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !900, file: !901, line: 46, baseType: !29, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !900, file: !901, line: 49, baseType: !906, size: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumFormatType", file: !292, line: 50, baseType: !440)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !900, file: !901, line: 52, baseType: !594, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !900, file: !901, line: 53, baseType: !594, size: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !900, file: !901, line: 54, baseType: !594, size: 64, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !900, file: !901, line: 57, baseType: !29, size: 64, offset: 384)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "min_is_white", scope: !900, file: !901, line: 60, baseType: !40, size: 32, offset: 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !900, file: !901, line: 61, baseType: !40, size: 32, offset: 480)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_type", scope: !900, file: !901, line: 64, baseType: !914, size: 32, offset: 512)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAlphaType", file: !292, line: 42, baseType: !446)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !900, file: !901, line: 67, baseType: !29, size: 64, offset: 576)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !900, file: !901, line: 70, baseType: !917, size: 64, offset: 640)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !900, file: !901, line: 73, baseType: !29, size: 64, offset: 704)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !900, file: !901, line: 76, baseType: !584, size: 32, offset: 768)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !900, file: !901, line: 79, baseType: !921, size: 256, offset: 832)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumState", file: !901, line: 40, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumState", file: !901, line: 27, size: 256, elements: !923)
!923 = !{!924, !925, !926, !927}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_scale", scope: !922, file: !901, line: 30, baseType: !594, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !922, file: !901, line: 33, baseType: !12, size: 32, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !922, file: !901, line: 36, baseType: !29, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !922, file: !901, line: 39, baseType: !928, size: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !900, file: !901, line: 82, baseType: !767, size: 64, offset: 1088)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !900, file: !901, line: 85, baseType: !29, size: 64, offset: 1152)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!934 = !{!0}
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!936 = !DILocalVariable(name: "signature_info", arg: 1, scope: !2, file: !3, line: 610, type: !6)
!937 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 618, type: !47)
!938 = !DILocalVariable(name: "p", scope: !2, file: !3, line: 621, type: !26)
!939 = !DILocalVariable(name: "j", scope: !2, file: !3, line: 624, type: !47)
!940 = !DILocalVariable(name: "A", scope: !2, file: !3, line: 645, type: !12)
!941 = !DILocalVariable(name: "B", scope: !2, file: !3, line: 646, type: !12)
!942 = !DILocalVariable(name: "C", scope: !2, file: !3, line: 647, type: !12)
!943 = !DILocalVariable(name: "D", scope: !2, file: !3, line: 648, type: !12)
!944 = !DILocalVariable(name: "E", scope: !2, file: !3, line: 649, type: !12)
!945 = !DILocalVariable(name: "F", scope: !2, file: !3, line: 650, type: !12)
!946 = !DILocalVariable(name: "G", scope: !2, file: !3, line: 651, type: !12)
!947 = !DILocalVariable(name: "H", scope: !2, file: !3, line: 652, type: !12)
!948 = !DILocalVariable(name: "shift", scope: !2, file: !3, line: 653, type: !12)
!949 = !DILocalVariable(name: "T", scope: !2, file: !3, line: 654, type: !12)
!950 = !DILocalVariable(name: "T1", scope: !2, file: !3, line: 655, type: !12)
!951 = !DILocalVariable(name: "T2", scope: !2, file: !3, line: 656, type: !12)
!952 = !DILocalVariable(name: "W", scope: !2, file: !3, line: 657, type: !953)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 64)
!956 = !{i32 7, !"Dwarf Version", i32 5}
!957 = !{i32 2, !"Debug Info Version", i32 3}
!958 = !{i32 1, !"wchar_size", i32 4}
!959 = !{i32 7, !"PIC Level", i32 2}
!960 = !{i32 7, !"PIE Level", i32 2}
!961 = !{i32 7, !"uwtable", i32 2}
!962 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!963 = distinct !DISubprogram(name: "AcquireSignatureInfo", scope: !3, file: !3, line: 119, type: !964, scopeLine: 120, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !53, retainedNodes: !966)
!964 = !DISubroutineType(types: !965)
!965 = !{!6}
!966 = !{!967, !968, !969, !972, !973, !976}
!967 = !DILocalVariable(name: "signature_info", scope: !963, file: !3, line: 122, type: !6)
!968 = !DILocalVariable(name: "lsb_first", scope: !963, file: !3, line: 125, type: !12)
!969 = !DILocalVariable(name: "message", scope: !970, file: !3, line: 129, type: !560)
!970 = distinct !DILexicalBlock(scope: !971, file: !3, line: 129, column: 5)
!971 = distinct !DILexicalBlock(scope: !963, file: !3, line: 128, column: 7)
!972 = !DILocalVariable(name: "exception", scope: !970, file: !3, line: 129, type: !756)
!973 = !DILocalVariable(name: "message", scope: !974, file: !3, line: 138, type: !560)
!974 = distinct !DILexicalBlock(scope: !975, file: !3, line: 138, column: 5)
!975 = distinct !DILexicalBlock(scope: !963, file: !3, line: 137, column: 7)
!976 = !DILocalVariable(name: "exception", scope: !974, file: !3, line: 138, type: !756)
!977 = !DILocation(line: 127, column: 36, scope: !963)
!978 = !DILocation(line: 0, scope: !963)
!979 = !DILocation(line: 128, column: 22, scope: !971)
!980 = !DILocation(line: 128, column: 7, scope: !963)
!981 = !DILocation(line: 129, column: 5, scope: !970)
!982 = !{!983, !983, i64 0}
!983 = !{!"int", !984, i64 0}
!984 = !{!"omnipotent char", !985, i64 0}
!985 = !{!"Simple C/C++ TBAA"}
!986 = !DILocation(line: 0, scope: !970)
!987 = !DILocation(line: 130, column: 10, scope: !963)
!988 = !DILocation(line: 131, column: 29, scope: !963)
!989 = !{!990, !983, i64 0}
