; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/src/spec.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/spec.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.spec_fd_t = type { i64, i64, i64, i32, ptr }

@.str = private unnamed_addr constant [46 x i8] c"main: Error mallocing memory for SHA-%d sum!\0A\00", align 1
@stderr = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [76 x i8] c"Error: Supplied original hash value is not the correct length to be SHA-%d\0A\00", align 1
@.str.2 = private unnamed_addr constant [127 x i8] c"Usage: %s <input filename> <input size> <input raw SHA-%d> <compressed minimum> <compressed maximum> <compression level, ...>\0A\00", align 1
@.str.3 = private unnamed_addr constant [41 x i8] c"SPEC CPU XZ driver: input=%s insize=%ld\0A\00", align 1
@spec_fd = external local_unnamed_addr global ptr, align 8
@.str.4 = private unnamed_addr constant [45 x i8] c"Error allocating in-memory file descriptors\0A\00", align 1
@.str.6 = private unnamed_addr constant [32 x i8] c"Input data %ld bytes in length\0A\00", align 1
@.str.7 = private unnamed_addr constant [44 x i8] c"Error: compression level '%s' is not valid\0A\00", align 1
@.str.8 = private unnamed_addr constant [36 x i8] c"Compressing Input Data, level %d%s\0A\00", align 1

!135 = distinct !DILexicalBlock(scope: !136, file: !14, line: 100, column: 5)
!136 = distinct !DILexicalBlock(scope: !13, file: !14, line: 100, column: 5)
!137 = !DILocation(line: 100, column: 5, scope: !136)
!138 = !DILocation(line: 102, column: 17, scope: !139)
!139 = distinct !DILexicalBlock(scope: !135, file: !14, line: 100, column: 31)
!140 = !{!54, !54, i64 0}
!141 = !DILocation(line: 108, column: 23, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !14, line: 108, column: 13)
!143 = !DILocation(line: 109, column: 13, scope: !144)
!144 = distinct !DILexicalBlock(scope: !142, file: !14, line: 108, column: 37)
!145 = !DILocation(line: 110, column: 151, scope: !144)
!146 = !DILocation(line: 110, column: 13, scope: !144)
!147 = !DILocation(line: 111, column: 13, scope: !144)
!148 = !DILocation(line: 103, column: 13, scope: !149)
!149 = distinct !DILexicalBlock(scope: !139, file: !14, line: 103, column: 13)
!150 = !DILocation(line: 103, column: 24, scope: !149)
!151 = !DILocation(line: 102, column: 28, scope: !139)
!152 = !DILocation(line: 114, column: 9, scope: !139)
!153 = !DILocation(line: 115, column: 63, scope: !139)
!154 = !DILocation(line: 115, column: 9, scope: !139)
!155 = !DILocation(line: 117, column: 34, scope: !139)
!156 = !DILocation(line: 117, column: 9, scope: !139)
!157 = !DILocation(line: 119, column: 9, scope: !139)
!158 = !DILocation(line: 120, column: 17, scope: !139)
!159 = !DILocation(line: 120, column: 74, scope: !139)
!160 = !DILocation(line: 120, column: 85, scope: !139)
!161 = !DILocation(line: 120, column: 9, scope: !139)
!162 = !DILocation(line: 121, column: 13, scope: !139)
!163 = !DILocation(line: 122, column: 15, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !14, line: 122, column: 15)
!165 = distinct !DILexicalBlock(scope: !166, file: !14, line: 121, column: 33)
!166 = distinct !DILexicalBlock(scope: !139, file: !14, line: 121, column: 13)
!167 = !DILocation(line: 122, column: 26, scope: !164)
!168 = !DILocation(line: 122, column: 30, scope: !164)
!169 = !DILocation(line: 122, column: 48, scope: !164)
!170 = !DILocation(line: 123, column: 17, scope: !171)
!171 = distinct !DILexicalBlock(scope: !164, file: !14, line: 122, column: 85)
!172 = !DILocation(line: 124, column: 15, scope: !173)
!173 = distinct !DILexicalBlock(scope: !171, file: !14, line: 123, column: 17)
!174 = !DILocation(line: 127, column: 15, scope: !173)
!175 = !DILocation(line: 130, column: 17, scope: !176)
!176 = distinct !DILexicalBlock(scope: !164, file: !14, line: 129, column: 18)
!177 = !DILocation(line: 131, column: 15, scope: !178)
!178 = distinct !DILexicalBlock(scope: !176, file: !14, line: 130, column: 17)
!179 = !DILocation(line: 134, column: 15, scope: !178)
!180 = !DILocation(line: 138, column: 9, scope: !139)
!181 = !DILocation(line: 150, column: 9, scope: !139)
!182 = !DILocation(line: 151, column: 9, scope: !139)
!183 = !DILocation(line: 153, column: 9, scope: !139)
!184 = !DILocation(line: 154, column: 9, scope: !139)
!185 = !DILocation(line: 155, column: 9, scope: !139)
!186 = !DILocation(line: 156, column: 9, scope: !139)
!187 = !DILocation(line: 157, column: 67, scope: !139)
!188 = !DILocation(line: 157, column: 78, scope: !139)
!189 = !DILocation(line: 157, column: 9, scope: !139)
!190 = !DILocation(line: 169, column: 9, scope: !191)
!191 = distinct !DILexicalBlock(scope: !139, file: !14, line: 169, column: 9)
!192 = !DILocation(line: 170, column: 13, scope: !193)
!193 = distinct !DILexicalBlock(scope: !139, file: !14, line: 170, column: 13)
!194 = !DILocation(line: 170, column: 13, scope: !139)
!195 = !DILocation(line: 171, column: 13, scope: !196)
!196 = distinct !DILexicalBlock(scope: !193, file: !14, line: 170, column: 57)
!197 = !DILocation(line: 172, column: 13, scope: !196)
!198 = !DILocation(line: 173, column: 23, scope: !196)
!199 = !DILocation(line: 173, column: 13, scope: !196)
!200 = !DILocation(line: 174, column: 13, scope: !196)
!201 = !DILocation(line: 175, column: 13, scope: !196)
!202 = !DILocation(line: 176, column: 23, scope: !196)
!203 = !DILocation(line: 176, column: 13, scope: !196)
!204 = !DILocation(line: 177, column: 13, scope: !196)
!205 = !DILocation(line: 178, column: 13, scope: !196)
!206 = !DILocation(line: 180, column: 9, scope: !139)
!207 = !DILocation(line: 181, column: 9, scope: !139)
!208 = !DILocation(line: 182, column: 9, scope: !139)
!209 = !DILocation(line: 183, column: 9, scope: !139)
!210 = !DILocation(line: 184, column: 9, scope: !139)
!211 = !DILocation(line: 185, column: 16, scope: !139)
!212 = !DILocation(line: 185, column: 9, scope: !139)
!213 = !DILocation(line: 100, column: 27, scope: !135)
!214 = distinct !{!214, !137, !215, !216, !217}
!215 = !DILocation(line: 186, column: 5, scope: !136)
!216 = !{!"llvm.loop.mustprogress"}
!217 = !{!"llvm.loop.unroll.disable"}
!218 = !DILocation(line: 188, column: 5, scope: !13)
!219 = !DISubprogram(name: "sum_str_to_hex", scope: !220, file: !220, line: 68, type: !221, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!220 = !DIFile(filename: "apps/557.xz_r/src/spec_mem_io/spec_mem_io.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "20f82235716911ab040d2b344ceb3e0d")
!221 = !DISubroutineType(types: !222)
!222 = !{!3, !19, !17}
!223 = !{}
!224 = !DISubprogram(name: "spec_mem_alloc_fds", scope: !220, file: !220, line: 43, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !27}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_fd_t", file: !220, line: 40, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !220, line: 34, size: 320, elements: !230)
!230 = !{!231, !232, !233, !234, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !229, file: !220, line: 35, baseType: !29, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !229, file: !220, line: 36, baseType: !29, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !229, file: !220, line: 37, baseType: !29, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !229, file: !220, line: 38, baseType: !17, size: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !229, file: !220, line: 39, baseType: !3, size: 64, offset: 256)
!236 = !DISubprogram(name: "spec_mem_init", scope: !220, file: !220, line: 48, type: !237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!237 = !DISubroutineType(types: !238)
!238 = !{!17, !227, !27, !27}
!239 = !DISubprogram(name: "debug_time", scope: !220, file: !220, line: 66, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!240 = !DISubroutineType(types: !241)
!241 = !{!17}
!242 = !DISubprogram(name: "spec_mem_load", scope: !220, file: !220, line: 49, type: !243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!243 = !DISubroutineType(types: !244)
!244 = !{!3, !227, !27, !17, !19, !29, !17, !3, !17}
!245 = !DISubprogram(name: "spec_initbufs", scope: !220, file: !220, line: 45, type: !246, spFlags: DISPFlagOptimized, retainedNodes: !223)
!246 = !DISubroutineType(types: !247)
!247 = !{null}
!248 = !DISubprogram(name: "spec_compress", scope: !220, file: !220, line: 46, type: !249, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !17, !17, !27}
!251 = !DISubprogram(name: "spec_mem_reset", scope: !220, file: !220, line: 53, type: !252, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!252 = !DISubroutineType(types: !253)
!253 = !{!17, !227, !27, !17}
!254 = !DISubprogram(name: "spec_mem_rewind", scope: !220, file: !220, line: 61, type: !252, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!255 = !DISubprogram(name: "spec_uncompress", scope: !220, file: !220, line: 47, type: !256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !17, !17}
!258 = !DISubprogram(name: "spec_mem_sum", scope: !220, file: !220, line: 70, type: !259, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!259 = !DISubroutineType(types: !260)
!260 = !{!3, !227, !3, !17}
!261 = !DISubprogram(name: "compare_sum", scope: !220, file: !220, line: 67, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!262 = !DISubroutineType(types: !263)
!263 = !{!17, !3, !3, !17}
!264 = !DISubprogram(name: "print_sum", scope: !220, file: !220, line: 69, type: !265, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !267, !3, !17}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !269, line: 7, baseType: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !271, line: 49, size: 1728, elements: !272)
!271 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !288, !290, !291, !292, !294, !296, !298, !302, !305, !307, !310, !313, !314, !315, !319, !320}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !270, file: !271, line: 51, baseType: !17, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !270, file: !271, line: 54, baseType: !19, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !270, file: !271, line: 55, baseType: !19, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !270, file: !271, line: 56, baseType: !19, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !270, file: !271, line: 57, baseType: !19, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !270, file: !271, line: 58, baseType: !19, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !270, file: !271, line: 59, baseType: !19, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !270, file: !271, line: 60, baseType: !19, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !270, file: !271, line: 61, baseType: !19, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !270, file: !271, line: 64, baseType: !19, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !270, file: !271, line: 65, baseType: !19, size: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !270, file: !271, line: 66, baseType: !19, size: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !270, file: !271, line: 68, baseType: !286, size: 64, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !271, line: 36, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !270, file: !271, line: 70, baseType: !289, size: 64, offset: 832)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !270, file: !271, line: 72, baseType: !17, size: 32, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !270, file: !271, line: 73, baseType: !17, size: 32, offset: 928)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !270, file: !271, line: 74, baseType: !293, size: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !32, line: 152, baseType: !33)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !270, file: !271, line: 77, baseType: !295, size: 16, offset: 1024)
!295 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !270, file: !271, line: 78, baseType: !297, size: 8, offset: 1040)
!297 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !270, file: !271, line: 79, baseType: !299, size: 8, offset: 1048)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 1)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !270, file: !271, line: 81, baseType: !303, size: 64, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !271, line: 43, baseType: null)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !270, file: !271, line: 89, baseType: !306, size: 64, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !32, line: 153, baseType: !33)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !270, file: !271, line: 91, baseType: !308, size: 64, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !271, line: 37, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !270, file: !271, line: 92, baseType: !311, size: 64, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !271, line: 38, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !270, file: !271, line: 93, baseType: !289, size: 64, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !270, file: !271, line: 94, baseType: !5, size: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !270, file: !271, line: 95, baseType: !316, size: 64, offset: 1472)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !317, line: 46, baseType: !318)
!317 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!318 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !270, file: !271, line: 96, baseType: !17, size: 32, offset: 1536)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !270, file: !271, line: 98, baseType: !321, size: 160, offset: 1568)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 20)
!324 = !DISubprogram(name: "fflush", scope: !325, file: !325, line: 218, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !223)
!325 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!326 = !DISubroutineType(types: !327)
!327 = !{!17, !267}
