; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/spec_mem_io/spec_mem_io.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/spec_mem_io/spec_mem_io.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.spec_fd_t = type { i64, i64, i64, i32, ptr }
%struct.sha512_state = type { i64, [8 x i64], i32, [128 x i8] }

@dbglvl = dso_local local_unnamed_addr global i32 3, align 4, !dbg !0
@.str = private unnamed_addr constant [52 x i8] c"spec_mem_init(fds=0x%p, fd_limit=%u, touch_all=%d)\0A\00", align 1
@spec_fd = dso_local local_unnamed_addr global ptr null, align 8, !dbg !29
@stdout = external local_unnamed_addr global ptr, align 8
@stderr = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [59 x i8] c"spec_mem_init: Overflow in requested size (%ld) for fd %d\0A\00", align 1
@.str.2 = private unnamed_addr constant [56 x i8] c"spec_mem_init: Error mallocing %ld bytes for fd %d@%p!\0A\00", align 1
@.str.3 = private unnamed_addr constant [50 x i8] c" fd[%d] limit is %ld bytes (%ld bytes allocated)\0A\00", align 1
@.str.4 = private unnamed_addr constant [41 x i8] c"spec_mem_sum: Only SHA-512 is available\0A\00", align 1
@.str.5 = private unnamed_addr constant [58 x i8] c"spec_mem_load: couldn't allocate %d chars for SHA-%d sum\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dbglvl", scope: !2, file: !31, line: 26, type: !9, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !28, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/spec_mem_io/spec_mem_io.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "047cbb8fb8ff391b745246463800d41f")
!4 = !{!5, !6, !8, !7, !9, !10, !13}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_fd_t", file: !15, line: 40, baseType: !16)
!15 = !DIFile(filename: "apps/557.xz_r/src/spec_mem_io/spec_mem_io.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "20f82235716911ab040d2b344ceb3e0d")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 34, size: 320, elements: !17)
!17 = !{!18, !24, !25, !26, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !16, file: !15, line: 35, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !20, line: 27, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !22, line: 44, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!23 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !16, file: !15, line: 36, baseType: !19, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !16, file: !15, line: 37, baseType: !19, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !16, file: !15, line: 38, baseType: !9, size: 32, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !16, file: !15, line: 39, baseType: !6, size: 64, offset: 256)
!28 = !{!0, !29}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "spec_fd", scope: !2, file: !31, line: 22, type: !13, isLocal: false, isDefinition: true)
!31 = !DIFile(filename: "apps/557.xz_r/src/spec_mem_io/spec_mem_io.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "047cbb8fb8ff391b745246463800d41f")
!32 = !{i32 7, !"Dwarf Version", i32 5}
!33 = !{i32 2, !"Debug Info Version", i32 3}
!34 = !{i32 1, !"wchar_size", i32 4}
!35 = !{i32 7, !"PIC Level", i32 2}
!36 = !{i32 7, !"PIE Level", i32 2}
!37 = !{i32 7, !"uwtable", i32 2}
!38 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!39 = distinct !DISubprogram(name: "spec_mem_init", scope: !31, file: !31, line: 67, type: !40, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !42)
!40 = !DISubroutineType(types: !41)
!41 = !{!9, !13, !8, !8}
!42 = !{!43, !44, !45, !46, !47, !48}
!43 = !DILocalVariable(name: "fds", arg: 1, scope: !39, file: !31, line: 67, type: !13)
!44 = !DILocalVariable(name: "fd_limit", arg: 2, scope: !39, file: !31, line: 67, type: !8)
!45 = !DILocalVariable(name: "touch_all", arg: 3, scope: !39, file: !31, line: 67, type: !8)
!46 = !DILocalVariable(name: "i", scope: !39, file: !31, line: 68, type: !8)
!47 = !DILocalVariable(name: "j", scope: !39, file: !31, line: 69, type: !19)
!48 = !DILocalVariable(name: "limit", scope: !49, file: !31, line: 77, type: !19)
!49 = distinct !DILexicalBlock(scope: !50, file: !31, line: 76, column: 36)
!50 = distinct !DILexicalBlock(scope: !51, file: !31, line: 76, column: 5)
!51 = distinct !DILexicalBlock(scope: !39, file: !31, line: 76, column: 5)
!52 = !DILocation(line: 0, scope: !39)
!53 = !DILocation(line: 71, column: 5, scope: !54)
!54 = distinct !DILexicalBlock(scope: !55, file: !31, line: 71, column: 5)
!55 = distinct !DILexicalBlock(scope: !39, file: !31, line: 71, column: 5)
!56 = !{!57, !57, i64 0}
!57 = !{!"int", !58, i64 0}
!58 = !{!"omnipotent char", !59, i64 0}
!59 = !{!"Simple C/C++ TBAA"}
!60 = !DILocation(line: 71, column: 5, scope: !55)
!61 = !DILocation(line: 71, column: 5, scope: !62)
!62 = distinct !DILexicalBlock(scope: !54, file: !31, line: 71, column: 5)
!63 = !{!64, !64, i64 0}
!64 = !{!"any pointer", !58, i64 0}
!65 = !DILocation(line: 76, column: 19, scope: !50)
!66 = !DILocation(line: 76, column: 5, scope: !51)
!67 = !DILocation(line: 93, column: 13, scope: !49)
!68 = !DILocation(line: 77, column: 18, scope: !49)
!69 = !DILocation(line: 77, column: 25, scope: !49)
!70 = !{!71, !72, i64 0}
!71 = !{!"", !72, i64 0, !72, i64 8, !72, i64 16, !57, i64 24, !64, i64 32}
!72 = !{!"long", !58, i64 0}
!73 = !DILocation(line: 0, scope: !49)
!74 = !DILocation(line: 78, column: 9, scope: !49)
!75 = !DILocation(line: 79, column: 15, scope: !49)
!76 = !DILocation(line: 80, column: 9, scope: !49)
!77 = !DILocation(line: 80, column: 14, scope: !49)
!78 = !{!71, !57, i64 24}
!79 = !DILocation(line: 81, column: 12, scope: !80)
!80 = distinct !DILexicalBlock(scope: !49, file: !31, line: 81, column: 6)
!81 = !DILocation(line: 81, column: 6, scope: !49)
!82 = !DILocation(line: 86, column: 44, scope: !49)
!83 = !DILocation(line: 86, column: 32, scope: !49)
!84 = !DILocation(line: 86, column: 9, scope: !49)
!85 = !DILocation(line: 86, column: 13, scope: !49)
!86 = !{!71, !64, i64 32}
!87 = !DILocation(line: 87, column: 17, scope: !88)
!88 = distinct !DILexicalBlock(scope: !49, file: !31, line: 87, column: 6)
!89 = !DILocation(line: 87, column: 6, scope: !49)
!90 = !DILocation(line: 92, column: 9, scope: !91)
!91 = distinct !DILexicalBlock(scope: !92, file: !31, line: 92, column: 9)
!92 = distinct !DILexicalBlock(scope: !49, file: !31, line: 92, column: 9)
!93 = !DILocation(line: 92, column: 9, scope: !92)
!94 = !DILocation(line: 92, column: 9, scope: !95)
!95 = distinct !DILexicalBlock(scope: !91, file: !31, line: 92, column: 9)
!96 = !DILocation(line: 76, column: 32, scope: !50)
!97 = distinct !{!97, !66, !98, !99, !100}
!98 = !DILocation(line: 97, column: 5, scope: !51)
!99 = !{!"llvm.loop.mustprogress"}
!100 = !{!"llvm.loop.unroll.disable"}
!101 = !DILocation(line: 82, column: 14, scope: !102)
!102 = distinct !DILexicalBlock(scope: !80, file: !31, line: 81, column: 17)
!103 = !DILocation(line: 82, column: 98, scope: !102)
!104 = !DILocation(line: 82, column: 6, scope: !102)
!105 = !DILocation(line: 83, column: 6, scope: !102)
!106 = !DILocation(line: 88, column: 14, scope: !107)
!107 = distinct !DILexicalBlock(scope: !88, file: !31, line: 87, column: 26)
!108 = !DILocation(line: 88, column: 6, scope: !107)
!109 = !DILocation(line: 89, column: 6, scope: !107)
!110 = !DILocation(line: 94, column: 27, scope: !111)
!111 = distinct !DILexicalBlock(scope: !112, file: !31, line: 94, column: 13)
!112 = distinct !DILexicalBlock(scope: !113, file: !31, line: 94, column: 13)
!113 = distinct !DILexicalBlock(scope: !49, file: !31, line: 93, column: 13)
!114 = !DILocation(line: 94, column: 13, scope: !112)
!115 = !DILocation(line: 95, column: 24, scope: !116)
!116 = distinct !DILexicalBlock(scope: !111, file: !31, line: 94, column: 47)
!117 = !DILocation(line: 95, column: 17, scope: !116)
!118 = !DILocation(line: 95, column: 31, scope: !116)
!119 = !{!58, !58, i64 0}
!120 = !DILocation(line: 94, column: 38, scope: !111)
!121 = distinct !{!121, !114, !122, !99, !100}
!122 = !DILocation(line: 96, column: 13, scope: !112)
!123 = !DILocation(line: 98, column: 5, scope: !39)
!124 = !DISubprogram(name: "fflush", scope: !125, file: !125, line: 218, type: !126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !185)
!125 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!126 = !DISubroutineType(types: !127)
!127 = !{!9, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !130, line: 7, baseType: !131)
!130 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !132, line: 49, size: 1728, elements: !133)
!132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !149, !151, !152, !153, !155, !157, !159, !163, !166, !168, !171, !174, !175, !176, !180, !181}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !131, file: !132, line: 51, baseType: !9, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !131, file: !132, line: 54, baseType: !11, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !131, file: !132, line: 55, baseType: !11, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !131, file: !132, line: 56, baseType: !11, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !131, file: !132, line: 57, baseType: !11, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !131, file: !132, line: 58, baseType: !11, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !131, file: !132, line: 59, baseType: !11, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !131, file: !132, line: 60, baseType: !11, size: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !131, file: !132, line: 61, baseType: !11, size: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !131, file: !132, line: 64, baseType: !11, size: 64, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !131, file: !132, line: 65, baseType: !11, size: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !131, file: !132, line: 66, baseType: !11, size: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !131, file: !132, line: 68, baseType: !147, size: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !132, line: 36, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !131, file: !132, line: 70, baseType: !150, size: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !131, file: !132, line: 72, baseType: !9, size: 32, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !131, file: !132, line: 73, baseType: !9, size: 32, offset: 928)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !131, file: !132, line: 74, baseType: !154, size: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 152, baseType: !23)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !131, file: !132, line: 77, baseType: !156, size: 16, offset: 1024)
!156 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !131, file: !132, line: 78, baseType: !158, size: 8, offset: 1040)
!158 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !131, file: !132, line: 79, baseType: !160, size: 8, offset: 1048)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 1)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !131, file: !132, line: 81, baseType: !164, size: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !132, line: 43, baseType: null)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !131, file: !132, line: 89, baseType: !167, size: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 153, baseType: !23)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !131, file: !132, line: 91, baseType: !169, size: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !132, line: 37, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !131, file: !132, line: 92, baseType: !172, size: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !132, line: 38, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !131, file: !132, line: 93, baseType: !150, size: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !131, file: !132, line: 94, baseType: !5, size: 64, offset: 1408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !131, file: !132, line: 95, baseType: !177, size: 64, offset: 1472)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !178, line: 46, baseType: !179)
!178 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!179 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !131, file: !132, line: 96, baseType: !9, size: 32, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !131, file: !132, line: 98, baseType: !182, size: 160, offset: 1568)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 20)
!185 = !{}
!186 = distinct !DISubprogram(name: "spec_mem_sum", scope: !31, file: !31, line: 101, type: !187, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !189)
!187 = !DISubroutineType(types: !188)
!188 = !{!6, !13, !6, !9}
!189 = !{!190, !191, !192, !193, !213, !214}
!190 = !DILocalVariable(name: "fd", arg: 1, scope: !186, file: !31, line: 101, type: !13)
!191 = !DILocalVariable(name: "sum", arg: 2, scope: !186, file: !31, line: 101, type: !6)
!192 = !DILocalVariable(name: "bits", arg: 3, scope: !186, file: !31, line: 101, type: !9)
!193 = !DILocalVariable(name: "ctx", scope: !186, file: !31, line: 102, type: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "sha512_state", file: !195, line: 13, baseType: !196)
!195 = !DIFile(filename: "apps/557.xz_r/src/sha-2/sha512.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a9972f2f4bb45d8b6de350a024786c")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 7, size: 1664, elements: !197)
!197 = !{!198, !202, !206, !209}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !196, file: !195, line: 9, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !200, line: 27, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !22, line: 45, baseType: !179)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !196, file: !195, line: 10, baseType: !203, size: 512, offset: 64)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 512, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 8)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "curlen", scope: !196, file: !195, line: 11, baseType: !207, size: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !200, line: 26, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !22, line: 42, baseType: !8)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !196, file: !195, line: 12, baseType: !210, size: 1024, offset: 608)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 128)
!213 = !DILocalVariable(name: "currpos", scope: !186, file: !31, line: 103, type: !19)
!214 = !DILocalVariable(name: "chunk", scope: !186, file: !31, line: 104, type: !23)
!215 = !DILocation(line: 0, scope: !186)
!216 = !DILocation(line: 102, column: 5, scope: !186)
!217 = !DILocation(line: 102, column: 18, scope: !186)
!218 = !DILocation(line: 107, column: 14, scope: !219)
!219 = distinct !DILexicalBlock(scope: !186, file: !31, line: 107, column: 9)
!220 = !DILocation(line: 107, column: 9, scope: !186)
!221 = !DILocation(line: 108, column: 15, scope: !222)
!222 = distinct !DILexicalBlock(scope: !219, file: !31, line: 107, column: 22)
!223 = !DILocation(line: 108, column: 7, scope: !222)
!224 = !DILocation(line: 109, column: 7, scope: !222)
!225 = !DILocation(line: 112, column: 13, scope: !226)
!226 = distinct !DILexicalBlock(scope: !186, file: !31, line: 112, column: 9)
!227 = !DILocation(line: 112, column: 9, scope: !186)
!228 = !DILocation(line: 113, column: 9, scope: !229)
!229 = distinct !DILexicalBlock(scope: !226, file: !31, line: 112, column: 22)
!230 = !DILocation(line: 114, column: 59, scope: !231)
!231 = distinct !DILexicalBlock(scope: !232, file: !31, line: 114, column: 9)
!232 = distinct !DILexicalBlock(scope: !229, file: !31, line: 114, column: 9)
!233 = !{!71, !72, i64 8}
!234 = !DILocation(line: 114, column: 53, scope: !231)
!235 = !DILocation(line: 114, column: 9, scope: !232)
!236 = !DILocation(line: 115, column: 25, scope: !237)
!237 = distinct !DILexicalBlock(scope: !238, file: !31, line: 115, column: 17)
!238 = distinct !DILexicalBlock(scope: !231, file: !31, line: 114, column: 82)
!239 = !DILocation(line: 115, column: 17, scope: !238)
!240 = !DILocation(line: 117, column: 35, scope: !238)
!241 = !DILocation(line: 117, column: 39, scope: !238)
!242 = !DILocation(line: 117, column: 50, scope: !238)
!243 = !DILocation(line: 117, column: 13, scope: !238)
!244 = !DILocation(line: 114, column: 72, scope: !231)
!245 = distinct !{!245, !235, !246, !99, !100}
!246 = !DILocation(line: 118, column: 9, scope: !232)
!247 = !DILocation(line: 119, column: 9, scope: !229)
!248 = !DILocation(line: 120, column: 5, scope: !229)
!249 = !DILocation(line: 122, column: 1, scope: !186)
!250 = !DILocation(line: 121, column: 5, scope: !186)
!251 = !DISubprogram(name: "sha_init", scope: !195, file: !195, line: 15, type: !252, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !185)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !254}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!255 = !DISubprogram(name: "sha_process", scope: !195, file: !195, line: 16, type: !256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !185)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !254, !258, !207}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!260 = !DISubprogram(name: "sha_done", scope: !195, file: !195, line: 17, type: !261, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !185)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !254, !5}
!263 = distinct !DISubprogram(name: "spec_mem_load", scope: !31, file: !31, line: 124, type: !264, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{!6, !13, !8, !9, !11, !19, !9, !6, !9}
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!267 = !DILocalVariable(name: "fds", arg: 1, scope: !263, file: !31, line: 124, type: !13)
