; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/statistic.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/statistic.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!421 = !DIEnumerator(name: "RGBChannels", value: 128)
!422 = !DIEnumerator(name: "GrayChannels", value: 128)
!423 = !DIEnumerator(name: "SyncChannels", value: 256)
!424 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !426, line: 34, baseType: !5, size: 32, elements: !427)
!426 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!428 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!429 = !DIEnumerator(name: "NoEvents", value: 0)
!430 = !DIEnumerator(name: "TraceEvent", value: 1)
!431 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!432 = !DIEnumerator(name: "BlobEvent", value: 4)
!433 = !DIEnumerator(name: "CacheEvent", value: 8)
!434 = !DIEnumerator(name: "CoderEvent", value: 16)
!435 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!436 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!437 = !DIEnumerator(name: "DrawEvent", value: 128)
!438 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!439 = !DIEnumerator(name: "ImageEvent", value: 512)
!440 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!441 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!442 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!443 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!444 = !DIEnumerator(name: "TransformEvent", value: 16384)
!445 = !DIEnumerator(name: "UserEvent", value: 36864)
!446 = !DIEnumerator(name: "WandEvent", value: 65536)
!447 = !DIEnumerator(name: "X11Event", value: 131072)
!448 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!449 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 104, baseType: !5, size: 32, elements: !451)
!451 = !{!452, !453, !454, !455, !456}
!452 = !DIEnumerator(name: "UndefinedFunction", value: 0)
!453 = !DIEnumerator(name: "PolynomialFunction", value: 1)
!454 = !DIEnumerator(name: "SinusoidFunction", value: 2)
!455 = !DIEnumerator(name: "ArcsinFunction", value: 3)
!456 = !DIEnumerator(name: "ArctanFunction", value: 4)
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 113, baseType: !5, size: 32, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467}
!459 = !DIEnumerator(name: "UndefinedStatistic", value: 0)
!460 = !DIEnumerator(name: "GradientStatistic", value: 1)
!461 = !DIEnumerator(name: "MaximumStatistic", value: 2)
!462 = !DIEnumerator(name: "MeanStatistic", value: 3)
!463 = !DIEnumerator(name: "MedianStatistic", value: 4)
!464 = !DIEnumerator(name: "MinimumStatistic", value: 5)
!465 = !DIEnumerator(name: "ModeStatistic", value: 6)
!466 = !DIEnumerator(name: "NonpeakStatistic", value: 7)
!467 = !DIEnumerator(name: "StandardDeviationStatistic", value: 8)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !469, line: 25, baseType: !5, size: 32, elements: !470)
!469 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479}
!471 = !DIEnumerator(name: "UndefinedResource", value: 0)
!472 = !DIEnumerator(name: "AreaResource", value: 1)
!473 = !DIEnumerator(name: "DiskResource", value: 2)
!474 = !DIEnumerator(name: "FileResource", value: 3)
!475 = !DIEnumerator(name: "MapResource", value: 4)
!476 = !DIEnumerator(name: "MemoryResource", value: 5)
!477 = !DIEnumerator(name: "ThreadResource", value: 6)
!478 = !DIEnumerator(name: "TimeResource", value: 7)
!479 = !DIEnumerator(name: "ThrottleResource", value: 8)
!480 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !481, line: 27, baseType: !5, size: 32, elements: !482)
!481 = !DIFile(filename: "apps/538.imagick_r/src/magick/fx.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cd08d328d828970731689944b1df77bd")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490}
!483 = !DIEnumerator(name: "UndefinedNoise", value: 0)
!484 = !DIEnumerator(name: "UniformNoise", value: 1)
!485 = !DIEnumerator(name: "GaussianNoise", value: 2)
!486 = !DIEnumerator(name: "MultiplicativeGaussianNoise", value: 3)
!487 = !DIEnumerator(name: "ImpulseNoise", value: 4)
!488 = !DIEnumerator(name: "LaplacianNoise", value: 5)
!489 = !DIEnumerator(name: "PoissonNoise", value: 6)
!490 = !DIEnumerator(name: "RandomNoise", value: 7)
!491 = !{!492, !493, !548, !714, !557, !516, !731, !521, !733, !734, !621, !735, !725, !530, !504, !737, !753, !772, !778, !715, !806, !807, !811, !660, !632, !813, !779, !794, !522, !814}
!492 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !496)
!496 = !{!497, !499, !501, !503, !506, !508, !510, !511, !512, !513, !514, !515, !526, !527, !528, !529, !531, !545, !547, !549, !551, !554, !555, !556, !562, !563, !564, !572, !573, !574, !575, !576, !577, !579, !581, !583, !585, !587, !589, !591, !592, !593, !594, !595, !596, !597, !605, !620, !634, !635, !636, !637, !641, !645, !649, !650, !651, !652, !653, !671, !672, !674, !675, !685, !686, !688, !689, !690, !691, !692, !693, !695, !696, !697, !698, !699, !700, !701, !703, !704, !705, !706, !707, !711, !713}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !495, file: !77, line: 153, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !495, file: !77, line: 156, baseType: !500, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !495, file: !77, line: 159, baseType: !502, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !495, file: !77, line: 162, baseType: !504, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !505, line: 46, baseType: !492)
!505 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!506 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !495, file: !77, line: 165, baseType: !507, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !495, file: !77, line: 168, baseType: !509, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !495, file: !77, line: 169, baseType: !509, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !495, file: !77, line: 172, baseType: !504, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !495, file: !77, line: 173, baseType: !504, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !495, file: !77, line: 174, baseType: !504, size: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !495, file: !77, line: 175, baseType: !504, size: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !495, file: !77, line: 178, baseType: !516, size: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !519)
!519 = !{!520, !523, !524, !525}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !518, file: !326, line: 143, baseType: !521, size: 16)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !522)
!522 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !518, file: !326, line: 144, baseType: !521, size: 16, offset: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !518, file: !326, line: 145, baseType: !521, size: 16, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !518, file: !326, line: 146, baseType: !521, size: 16, offset: 48)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !495, file: !77, line: 179, baseType: !517, size: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !495, file: !77, line: 180, baseType: !517, size: 64, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !495, file: !77, line: 181, baseType: !517, size: 64, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !495, file: !77, line: 184, baseType: !530, size: 64, offset: 832)
!530 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !495, file: !77, line: 187, baseType: !532, size: 768, offset: 896)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !534)
!534 = !{!535, !542, !543, !544}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !533, file: !77, line: 124, baseType: !536, size: 192)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !538)
!538 = !{!539, !540, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !537, file: !77, line: 98, baseType: !530, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !537, file: !77, line: 99, baseType: !530, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !537, file: !77, line: 100, baseType: !530, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !533, file: !77, line: 125, baseType: !536, size: 192, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !533, file: !77, line: 126, baseType: !536, size: 192, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !533, file: !77, line: 127, baseType: !536, size: 192, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !495, file: !77, line: 190, baseType: !546, size: 32, offset: 1664)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !495, file: !77, line: 193, baseType: !548, size: 64, offset: 1728)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !495, file: !77, line: 196, baseType: !550, size: 32, offset: 1792)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !495, file: !77, line: 199, baseType: !552, size: 64, offset: 1856)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !495, file: !77, line: 200, baseType: !552, size: 64, offset: 1920)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !495, file: !77, line: 201, baseType: !552, size: 64, offset: 1984)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !495, file: !77, line: 204, baseType: !557, size: 64, offset: 2048)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !558, line: 77, baseType: !559)
!558 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !560, line: 193, baseType: !561)
!560 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!561 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !495, file: !77, line: 207, baseType: !530, size: 64, offset: 2112)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !495, file: !77, line: 208, baseType: !530, size: 64, offset: 2176)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !495, file: !77, line: 211, baseType: !565, size: 256, offset: 2240)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !567)
!567 = !{!568, !569, !570, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !566, file: !153, line: 124, baseType: !504, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !566, file: !153, line: 125, baseType: !504, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !566, file: !153, line: 128, baseType: !557, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !566, file: !153, line: 129, baseType: !557, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !495, file: !77, line: 212, baseType: !565, size: 256, offset: 2496)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !495, file: !77, line: 213, baseType: !565, size: 256, offset: 2752)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !495, file: !77, line: 216, baseType: !530, size: 64, offset: 3008)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !495, file: !77, line: 217, baseType: !530, size: 64, offset: 3072)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !495, file: !77, line: 218, baseType: !530, size: 64, offset: 3136)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !495, file: !77, line: 221, baseType: !578, size: 32, offset: 3200)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !495, file: !77, line: 224, baseType: !580, size: 32, offset: 3232)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !495, file: !77, line: 227, baseType: !582, size: 32, offset: 3264)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !495, file: !77, line: 230, baseType: !584, size: 32, offset: 3296)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !495, file: !77, line: 233, baseType: !586, size: 32, offset: 3328)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !495, file: !77, line: 236, baseType: !588, size: 32, offset: 3360)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !495, file: !77, line: 239, baseType: !590, size: 64, offset: 3392)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !495, file: !77, line: 242, baseType: !504, size: 64, offset: 3456)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !495, file: !77, line: 243, baseType: !504, size: 64, offset: 3520)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !495, file: !77, line: 246, baseType: !557, size: 64, offset: 3584)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !495, file: !77, line: 249, baseType: !504, size: 64, offset: 3648)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !495, file: !77, line: 250, baseType: !504, size: 64, offset: 3712)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !495, file: !77, line: 253, baseType: !557, size: 64, offset: 3776)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !495, file: !77, line: 256, baseType: !598, size: 192, offset: 3840)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !599, line: 68, baseType: !600)
!599 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !599, line: 62, size: 192, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !600, file: !599, line: 65, baseType: !530, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !600, file: !599, line: 66, baseType: !530, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !600, file: !599, line: 67, baseType: !530, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !495, file: !77, line: 259, baseType: !606, size: 512, offset: 4032)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !608)
!608 = !{!609, !616, !617, !619}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !607, file: !247, line: 43, baseType: !610, size: 192)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !611, file: !247, line: 35, baseType: !530, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !611, file: !247, line: 36, baseType: !530, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !611, file: !247, line: 37, baseType: !530, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !607, file: !247, line: 44, baseType: !610, size: 192, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !607, file: !247, line: 47, baseType: !618, size: 32, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !607, file: !247, line: 50, baseType: !504, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !495, file: !77, line: 262, baseType: !621, size: 64, offset: 4544)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !622, line: 26, baseType: !623)
!622 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!509, !626, !628, !631, !548}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !630)
!630 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !633)
!633 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !495, file: !77, line: 265, baseType: !548, size: 64, offset: 4608)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !495, file: !77, line: 266, baseType: !548, size: 64, offset: 4672)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !495, file: !77, line: 267, baseType: !548, size: 64, offset: 4736)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !495, file: !77, line: 270, baseType: !638, size: 64, offset: 4800)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !640)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !495, file: !77, line: 273, baseType: !642, size: 64, offset: 4864)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !644)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !495, file: !77, line: 276, baseType: !646, size: 32768, offset: 4928)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 32768, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 4096)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !495, file: !77, line: 277, baseType: !646, size: 32768, offset: 37696)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !495, file: !77, line: 278, baseType: !646, size: 32768, offset: 70464)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !495, file: !77, line: 281, baseType: !504, size: 64, offset: 103232)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !495, file: !77, line: 282, baseType: !504, size: 64, offset: 103296)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !495, file: !77, line: 285, baseType: !654, size: 448, offset: 103360)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !656)
!656 = !{!657, !659, !661, !662, !663, !664, !665, !670}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !655, file: !253, line: 105, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !655, file: !253, line: 108, baseType: !660, size: 32, offset: 32)
!660 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !655, file: !253, line: 111, baseType: !552, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !655, file: !253, line: 112, baseType: !552, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !655, file: !253, line: 115, baseType: !548, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !655, file: !253, line: 118, baseType: !509, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !655, file: !253, line: 121, baseType: !666, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !668, line: 26, baseType: !669)
!668 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !668, line: 25, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !655, file: !253, line: 124, baseType: !504, size: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !495, file: !77, line: 288, baseType: !509, size: 32, offset: 103808)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !495, file: !77, line: 291, baseType: !673, size: 64, offset: 103872)
!673 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !557)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !495, file: !77, line: 294, baseType: !666, size: 64, offset: 103936)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !495, file: !77, line: 297, baseType: !676, size: 256, offset: 104000)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !678)
!678 = !{!679, !680, !681, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !677, file: !89, line: 30, baseType: !552, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !677, file: !89, line: 33, baseType: !504, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !677, file: !89, line: 36, baseType: !682, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !677, file: !89, line: 39, baseType: !504, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !495, file: !77, line: 298, baseType: !676, size: 256, offset: 104256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !495, file: !77, line: 299, baseType: !687, size: 64, offset: 104512)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !495, file: !77, line: 302, baseType: !504, size: 64, offset: 104576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !495, file: !77, line: 305, baseType: !504, size: 64, offset: 104640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !495, file: !77, line: 308, baseType: !590, size: 64, offset: 104704)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !495, file: !77, line: 309, baseType: !590, size: 64, offset: 104768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !77, line: 310, baseType: !590, size: 64, offset: 104832)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !495, file: !77, line: 313, baseType: !694, size: 32, offset: 104896)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !495, file: !77, line: 316, baseType: !509, size: 32, offset: 104928)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !495, file: !77, line: 319, baseType: !517, size: 64, offset: 104960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !495, file: !77, line: 322, baseType: !590, size: 64, offset: 105024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !495, file: !77, line: 325, baseType: !565, size: 256, offset: 105088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !495, file: !77, line: 328, baseType: !548, size: 64, offset: 105344)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !495, file: !77, line: 329, baseType: !548, size: 64, offset: 105408)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !77, line: 332, baseType: !702, size: 32, offset: 105472)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !495, file: !77, line: 335, baseType: !509, size: 32, offset: 105504)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !495, file: !77, line: 338, baseType: !632, size: 64, offset: 105536)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !495, file: !77, line: 341, baseType: !509, size: 32, offset: 105600)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !495, file: !77, line: 344, baseType: !504, size: 64, offset: 105664)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !495, file: !77, line: 347, baseType: !708, size: 64, offset: 105728)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !709, line: 7, baseType: !710)
!709 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !560, line: 160, baseType: !561)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !495, file: !77, line: 350, baseType: !712, size: 32, offset: 105792)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !495, file: !77, line: 353, baseType: !504, size: 64, offset: 105856)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !727, !728, !729, !730}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !717, file: !326, line: 107, baseType: !498, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !717, file: !326, line: 110, baseType: !500, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !717, file: !326, line: 113, baseType: !509, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !717, file: !326, line: 116, baseType: !530, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !717, file: !326, line: 119, baseType: !504, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !717, file: !326, line: 122, baseType: !725, size: 32, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !726)
!726 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !717, file: !326, line: 123, baseType: !725, size: 32, offset: 288)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !717, file: !326, line: 124, baseType: !725, size: 32, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !717, file: !326, line: 125, baseType: !725, size: 32, offset: 352)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !717, file: !326, line: 126, baseType: !725, size: 32, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !521)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelStatistics", file: !369, line: 44, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelStatistics", file: !369, line: 27, size: 768, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !739, file: !369, line: 30, baseType: !504, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "minima", scope: !739, file: !369, line: 33, baseType: !530, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "maxima", scope: !739, file: !369, line: 34, baseType: !530, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !739, file: !369, line: 35, baseType: !530, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sum_squared", scope: !739, file: !369, line: 36, baseType: !530, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sum_cubed", scope: !739, file: !369, line: 37, baseType: !530, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sum_fourth_power", scope: !739, file: !369, line: 38, baseType: !530, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !739, file: !369, line: 39, baseType: !530, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !739, file: !369, line: 40, baseType: !530, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "standard_deviation", scope: !739, file: !369, line: 41, baseType: !530, size: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "kurtosis", scope: !739, file: !369, line: 42, baseType: !530, size: 64, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "skewness", scope: !739, file: !369, line: 43, baseType: !530, size: 64, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelMoments", file: !369, line: 59, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelMoments", file: !369, line: 46, size: 2496, elements: !756)
!756 = !{!757, !761, !768, !769, !770, !771}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "I", scope: !755, file: !369, line: 49, baseType: !758, size: 2048)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 2048, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "centroid", scope: !755, file: !369, line: 52, baseType: !762, size: 128, offset: 2048)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !763, line: 142, baseType: !764)
!763 = !DIFile(filename: "apps/538.imagick_r/src/magick/draw.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7430ad7998fb3d4ef58bbf5582967ea1")
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !763, line: 137, size: 128, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !764, file: !763, line: 140, baseType: !530, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !764, file: !763, line: 141, baseType: !530, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_axis", scope: !755, file: !369, line: 53, baseType: !762, size: 128, offset: 2176)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_angle", scope: !755, file: !369, line: 56, baseType: !530, size: 64, offset: 2304)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_eccentricity", scope: !755, file: !369, line: 57, baseType: !530, size: 64, offset: 2368)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_intensity", scope: !755, file: !369, line: 58, baseType: !530, size: 64, offset: 2432)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelPerceptualHash", file: !369, line: 66, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelPerceptualHash", file: !369, line: 61, size: 4096, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !774, file: !369, line: 64, baseType: !758, size: 2048)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !774, file: !369, line: 65, baseType: !758, size: 2048, offset: 2048)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelList", file: !781, line: 2696, baseType: !782)
!781 = !DIFile(filename: "apps/538.imagick_r/src/magick/statistic.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "fe5fad88f18680e9ee8c5f095f8da590")
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelList", file: !781, line: 2687, size: 832, elements: !783)
!783 = !{!784, !785, !786, !787}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !782, file: !781, line: 2690, baseType: !504, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !782, file: !781, line: 2691, baseType: !504, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !782, file: !781, line: 2692, baseType: !504, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lists", scope: !782, file: !781, line: 2695, baseType: !788, size: 640, offset: 192)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 640, elements: !804)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "SkipList", file: !781, line: 2685, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SkipList", file: !781, line: 2678, size: 128, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !790, file: !781, line: 2681, baseType: !557, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !790, file: !781, line: 2684, baseType: !794, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListNode", file: !781, line: 2676, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ListNode", file: !781, line: 2670, size: 704, elements: !797)
!797 = !{!798, !802, !803}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !781, line: 2673, baseType: !799, size: 576)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 576, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 9)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !796, file: !781, line: 2674, baseType: !504, size: 64, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !796, file: !781, line: 2675, baseType: !504, size: 64, offset: 640)
!804 = !{!805}
!805 = !DISubrange(count: 5)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !809, line: 31, baseType: !810)
!809 = !DIFile(filename: "apps/538.imagick_r/src/magick/random_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "95f31caf92e8a7cab5b1bf8cc3698f31")
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !809, line: 30, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAny", file: !4, line: 170, baseType: !632)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!816 = !{i32 7, !"Dwarf Version", i32 5}
!817 = !{i32 2, !"Debug Info Version", i32 3}
!818 = !{i32 1, !"wchar_size", i32 4}
!819 = !{i32 7, !"PIC Level", i32 2}
!820 = !{i32 7, !"PIE Level", i32 2}
!821 = !{i32 7, !"uwtable", i32 2}
!822 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!823 = distinct !DISubprogram(name: "EvaluateImage", scope: !781, file: !781, line: 417, type: !824, scopeLine: 419, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !830)
!824 = !DISubroutineType(types: !825)
!825 = !{!509, !493, !826, !828, !829}
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickEvaluateOperator", file: !369, line: 102, baseType: !368)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!830 = !{!831, !832, !833, !834, !835}
!831 = !DILocalVariable(name: "image", arg: 1, scope: !823, file: !781, line: 417, type: !493)
!832 = !DILocalVariable(name: "op", arg: 2, scope: !823, file: !781, line: 418, type: !826)
!833 = !DILocalVariable(name: "value", arg: 3, scope: !823, file: !781, line: 418, type: !828)
!834 = !DILocalVariable(name: "exception", arg: 4, scope: !823, file: !781, line: 418, type: !829)
!835 = !DILocalVariable(name: "status", scope: !823, file: !781, line: 421, type: !509)
!836 = !DILocation(line: 0, scope: !823)
!837 = !DILocation(line: 423, column: 10, scope: !823)
!838 = !DILocation(line: 424, column: 3, scope: !823)
!839 = distinct !DISubprogram(name: "EvaluateImageChannel", scope: !781, file: !781, line: 746, type: !840, scopeLine: 749, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !844)
!840 = !DISubroutineType(types: !841)
!841 = !{!509, !493, !842, !826, !828, !829}
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !403)
!844 = !{!845, !846, !847, !848, !849, !850, !855, !856, !857, !859, !860, !865, !867, !869, !870}
!845 = !DILocalVariable(name: "image", arg: 1, scope: !839, file: !781, line: 746, type: !493)
!846 = !DILocalVariable(name: "channel", arg: 2, scope: !839, file: !781, line: 747, type: !842)
!847 = !DILocalVariable(name: "op", arg: 3, scope: !839, file: !781, line: 747, type: !826)
!848 = !DILocalVariable(name: "value", arg: 4, scope: !839, file: !781, line: 747, type: !828)
!849 = !DILocalVariable(name: "exception", arg: 5, scope: !839, file: !781, line: 748, type: !829)
!850 = !DILocalVariable(name: "image_view", scope: !839, file: !781, line: 751, type: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
