; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/common/stream_flags_decoder.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/stream_flags_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_stream_flags = type { i32, i64, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32 }

@lzma_header_magic = external constant [6 x i8], align 1
@lzma_footer_magic = external constant [2 x i8], align 1

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_stream_header_decode(ptr nocapture noundef writeonly %options, ptr noundef %in) local_unnamed_addr #0 !dbg !41 {
entry:
  call void @llvm.dbg.value(metadata ptr %options, metadata !82, metadata !DIExpression()), !dbg !86
  call void @llvm.dbg.value(metadata ptr %in, metadata !83, metadata !DIExpression()), !dbg !86
  %bcmp = tail call i32 @bcmp(ptr noundef nonnull dereferenceable(6) %in, ptr noundef nonnull dereferenceable(6) @lzma_header_magic, i64 6), !dbg !87
  %cmp.not = icmp eq i32 %bcmp, 0, !dbg !89
  br i1 %cmp.not, label %if.end, label %return, !dbg !90

if.end:                                           ; preds = %entry
  %add.ptr = getelementptr inbounds i8, ptr %in, i64 6, !dbg !91
  %call1 = tail call i32 @lzma_crc32(ptr noundef nonnull %add.ptr, i64 noundef 2, i32 noundef 0) #4, !dbg !92

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/common/stream_flags_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "a6d63bd83f97b1aa444916dbbbfa60b1")
!2 = !{!3, !19, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 27, baseType: !5, size: 32, elements: !21)
!20 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!24 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!25 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !27)
!27 = !{!28}
!28 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!29 = !{!30}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 26, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !33, line: 42, baseType: !5)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!34 = !{i32 7, !"Dwarf Version", i32 5}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{i32 1, !"wchar_size", i32 4}
!37 = !{i32 7, !"PIC Level", i32 2}
!38 = !{i32 7, !"PIE Level", i32 2}
!39 = !{i32 7, !"uwtable", i32 2}
!40 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!41 = distinct !DISubprogram(name: "lzma_stream_header_decode", scope: !42, file: !42, line: 31, type: !43, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !81)
!42 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/stream_flags_decoder.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a6d63bd83f97b1aa444916dbbbfa60b1")
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !46, !77}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream_flags", file: !48, line: 105, baseType: !49)
!48 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/stream_flags.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d3814c86a389337e759db33a259f1072")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 33, size: 448, elements: !50)
!50 = !{!51, !52, !58, !60, !62, !63, !64, !65, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !49, file: !48, line: 51, baseType: !30, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "backward_size", scope: !49, file: !48, line: 69, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !54, line: 63, baseType: !55)
!54 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 27, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !33, line: 45, baseType: !57)
!57 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !49, file: !48, line: 79, baseType: !59, size: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !20, line: 55, baseType: !19)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !49, file: !48, line: 90, baseType: !61, size: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !26)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !49, file: !48, line: 91, baseType: !61, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !49, file: !48, line: 92, baseType: !61, size: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !49, file: !48, line: 93, baseType: !61, size: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !49, file: !48, line: 94, baseType: !66, size: 8, offset: 288)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !67)
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !49, file: !48, line: 95, baseType: !66, size: 8, offset: 296)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !49, file: !48, line: 96, baseType: !66, size: 8, offset: 304)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !49, file: !48, line: 97, baseType: !66, size: 8, offset: 312)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !49, file: !48, line: 98, baseType: !66, size: 8, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !49, file: !48, line: 99, baseType: !66, size: 8, offset: 328)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !49, file: !48, line: 100, baseType: !66, size: 8, offset: 336)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !49, file: !48, line: 101, baseType: !66, size: 8, offset: 344)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !49, file: !48, line: 102, baseType: !30, size: 32, offset: 352)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !49, file: !48, line: 103, baseType: !30, size: 32, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !31, line: 24, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !33, line: 38, baseType: !67)
!81 = !{!82, !83, !84}
!82 = !DILocalVariable(name: "options", arg: 1, scope: !41, file: !42, line: 31, type: !46)
!83 = !DILocalVariable(name: "in", arg: 2, scope: !41, file: !42, line: 31, type: !77)
!84 = !DILocalVariable(name: "crc", scope: !41, file: !42, line: 39, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!86 = !DILocation(line: 0, scope: !41)
!87 = !DILocation(line: 34, column: 6, scope: !88)
!88 = distinct !DILexicalBlock(scope: !41, file: !42, line: 34, column: 6)
!89 = !DILocation(line: 34, column: 63, scope: !88)
!90 = !DILocation(line: 34, column: 6, scope: !41)
!91 = !DILocation(line: 39, column: 37, scope: !41)
!92 = !DILocation(line: 39, column: 23, scope: !41)
!93 = !DILocation(line: 42, column: 4, scope: !94)
!94 = distinct !DILexicalBlock(scope: !41, file: !42, line: 41, column: 6)
!95 = !DILocalVariable(name: "buf", arg: 1, scope: !96, file: !97, line: 311, type: !77)
!96 = distinct !DISubprogram(name: "unaligned_read32le", scope: !97, file: !97, line: 311, type: !98, scopeLine: 312, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !100)
!97 = !DIFile(filename: "apps/557.xz_r/src/common/tuklib_integer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "877bd6a1d04ec1170bc985c87ef412ed")
!98 = !DISubroutineType(types: !99)
!99 = !{!30, !77}
!100 = !{!95, !101}
!101 = !DILocalVariable(name: "num", scope: !96, file: !97, line: 313, type: !30)
!102 = !DILocation(line: 0, scope: !96, inlinedAt: !103)
!103 = distinct !DILocation(line: 41, column: 13, scope: !94)
!104 = !DILocation(line: 313, column: 27, scope: !96, inlinedAt: !103)
!105 = !{!106, !106, i64 0}
!106 = !{!"omnipotent char", !107, i64 0}
!107 = !{!"Simple C/C++ TBAA"}
!108 = !DILocation(line: 313, column: 17, scope: !96, inlinedAt: !103)
!109 = !DILocation(line: 314, column: 19, scope: !96, inlinedAt: !103)
!110 = !DILocation(line: 314, column: 9, scope: !96, inlinedAt: !103)
!111 = !DILocation(line: 314, column: 26, scope: !96, inlinedAt: !103)
!112 = !DILocation(line: 314, column: 6, scope: !96, inlinedAt: !103)
!113 = !DILocation(line: 315, column: 19, scope: !96, inlinedAt: !103)
!114 = !DILocation(line: 315, column: 9, scope: !96, inlinedAt: !103)
!115 = !DILocation(line: 315, column: 26, scope: !96, inlinedAt: !103)
!116 = !DILocation(line: 315, column: 6, scope: !96, inlinedAt: !103)
!117 = !DILocation(line: 316, column: 19, scope: !96, inlinedAt: !103)
!118 = !DILocation(line: 316, column: 9, scope: !96, inlinedAt: !103)
!119 = !DILocation(line: 316, column: 26, scope: !96, inlinedAt: !103)
!120 = !DILocation(line: 316, column: 6, scope: !96, inlinedAt: !103)
!121 = !DILocation(line: 41, column: 10, scope: !94)
!122 = !DILocation(line: 41, column: 6, scope: !41)
!123 = !DILocalVariable(name: "options", arg: 1, scope: !124, file: !42, line: 17, type: !46)
!124 = distinct !DISubprogram(name: "stream_flags_decode", scope: !42, file: !42, line: 17, type: !125, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !128)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !46, !77}
!127 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!128 = !{!123, !129}
!129 = !DILocalVariable(name: "in", arg: 2, scope: !124, file: !42, line: 17, type: !77)
!130 = !DILocation(line: 0, scope: !124, inlinedAt: !131)
