; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/stream.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/stream.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._StreamInfo = type { ptr, ptr, ptr, ptr, ptr, i32, ptr, %struct._RectangleInfo, i64, ptr, ptr, i64 }
%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }

!488 = !DIEnumerator(name: "X11Event", value: 131072)
!489 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!490 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !492, line: 35, baseType: !5, size: 32, elements: !493)
!492 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a66ea2eabdd36512a199f3a0075ea4ad")
!493 = !{!494, !495, !496, !497, !498, !499, !500}
!494 = !DIEnumerator(name: "UndefinedBlobMode", value: 0)
!495 = !DIEnumerator(name: "ReadBlobMode", value: 1)
!496 = !DIEnumerator(name: "ReadBinaryBlobMode", value: 2)
!497 = !DIEnumerator(name: "WriteBlobMode", value: 3)
!498 = !DIEnumerator(name: "WriteBinaryBlobMode", value: 4)
!499 = !DIEnumerator(name: "AppendBlobMode", value: 5)
!500 = !DIEnumerator(name: "AppendBinaryBlobMode", value: 6)
!501 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !502, line: 27, baseType: !5, size: 32, elements: !503)
!502 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "71eb387e577d57b17607c7f6f5128e97")
!503 = !{!504, !505, !506, !507, !508, !509}
!504 = !DIEnumerator(name: "UndefinedCache", value: 0)
!505 = !DIEnumerator(name: "MemoryCache", value: 1)
!506 = !DIEnumerator(name: "MapCache", value: 2)
!507 = !DIEnumerator(name: "DiskCache", value: 3)
!508 = !DIEnumerator(name: "PingCache", value: 4)
!509 = !DIEnumerator(name: "DistributedCache", value: 5)
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !511, line: 30, baseType: !5, size: 32, elements: !512)
!511 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "aeac60f5bee0fb1a4f0bd1456ae975f0")
!512 = !{!513, !514, !515}
!513 = !DIEnumerator(name: "ReadMode", value: 0)
!514 = !DIEnumerator(name: "WriteMode", value: 1)
!515 = !DIEnumerator(name: "IOMode", value: 2)
!516 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 52, baseType: !5, size: 32, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!518 = !DIEnumerator(name: "UndefinedQuantum", value: 0)
!519 = !DIEnumerator(name: "AlphaQuantum", value: 1)
!520 = !DIEnumerator(name: "BlackQuantum", value: 2)
!521 = !DIEnumerator(name: "BlueQuantum", value: 3)
!522 = !DIEnumerator(name: "CMYKAQuantum", value: 4)
!523 = !DIEnumerator(name: "CMYKQuantum", value: 5)
!524 = !DIEnumerator(name: "CyanQuantum", value: 6)
!525 = !DIEnumerator(name: "GrayAlphaQuantum", value: 7)
!526 = !DIEnumerator(name: "GrayQuantum", value: 8)
!527 = !DIEnumerator(name: "GreenQuantum", value: 9)
!528 = !DIEnumerator(name: "IndexAlphaQuantum", value: 10)
!529 = !DIEnumerator(name: "IndexQuantum", value: 11)
!530 = !DIEnumerator(name: "MagentaQuantum", value: 12)
!531 = !DIEnumerator(name: "OpacityQuantum", value: 13)
!532 = !DIEnumerator(name: "RedQuantum", value: 14)
!533 = !DIEnumerator(name: "RGBAQuantum", value: 15)
!534 = !DIEnumerator(name: "BGRAQuantum", value: 16)
!535 = !DIEnumerator(name: "RGBOQuantum", value: 17)
!536 = !DIEnumerator(name: "RGBQuantum", value: 18)
!537 = !DIEnumerator(name: "YellowQuantum", value: 19)
!538 = !DIEnumerator(name: "GrayPadQuantum", value: 20)
!539 = !DIEnumerator(name: "RGBPadQuantum", value: 21)
!540 = !DIEnumerator(name: "CbYCrYQuantum", value: 22)
!541 = !DIEnumerator(name: "CbYCrQuantum", value: 23)
!542 = !DIEnumerator(name: "CbYCrAQuantum", value: 24)
!543 = !DIEnumerator(name: "CMYKOQuantum", value: 25)
!544 = !DIEnumerator(name: "BGRQuantum", value: 26)
!545 = !DIEnumerator(name: "BGROQuantum", value: 27)
!546 = !{!547, !668, !577, !770, !792, !569, !629, !912, !617, !646, !956, !742, !575, !1004, !828, !835, !1022, !992, !776, !1095, !600, !1036, !1097, !593, !1098, !985, !1099, !5, !1100, !1101, !1102, !793, !984, !601}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamInfo", file: !549, line: 26, baseType: !550)
!549 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "98ad0c35b5bc2f21c333fb4ef4a1a007")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StreamInfo", file: !551, line: 67, size: 960, elements: !552)
!551 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d02161c935fa3bda6a6c1af92e3abeb")
!552 = !{!553, !909, !910, !911, !946, !947, !949, !950, !951, !952, !954, !955}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !550, file: !551, line: 70, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !42, line: 223, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !30, line: 356, size: 134336, elements: !558)
!558 = !{!559, !561, !563, !565, !566, !567, !568, !571, !572, !573, !574, !578, !579, !580, !582, !584, !586, !587, !588, !589, !590, !591, !592, !594, !595, !605, !606, !607, !608, !609, !610, !612, !614, !616, !622, !623, !624, !625, !626, !628, !823, !824, !825, !826, !827, !838, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !906, !907, !908}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !557, file: !30, line: 359, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !4, line: 49, baseType: !3)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !557, file: !30, line: 362, baseType: !562, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !30, line: 86, baseType: !29)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !557, file: !30, line: 365, baseType: !564, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !42, line: 215, baseType: !41)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !557, file: !30, line: 366, baseType: !564, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !557, file: !30, line: 367, baseType: !564, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !557, file: !30, line: 368, baseType: !564, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !557, file: !30, line: 371, baseType: !569, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !557, file: !30, line: 372, baseType: !569, size: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !557, file: !30, line: 373, baseType: !569, size: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !557, file: !30, line: 374, baseType: !569, size: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !557, file: !30, line: 377, baseType: !575, size: 64, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !576, line: 46, baseType: !577)
!576 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!577 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !557, file: !30, line: 378, baseType: !575, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !557, file: !30, line: 379, baseType: !575, size: 64, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !557, file: !30, line: 382, baseType: !581, size: 32, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !30, line: 73, baseType: !46)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !557, file: !30, line: 385, baseType: !583, size: 32, offset: 672)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !57, line: 35, baseType: !56)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !557, file: !30, line: 388, baseType: !585, size: 32, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !30, line: 93, baseType: !62)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !557, file: !30, line: 391, baseType: !575, size: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !557, file: !30, line: 394, baseType: !569, size: 64, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !557, file: !30, line: 395, baseType: !569, size: 64, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !557, file: !30, line: 396, baseType: !569, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !557, file: !30, line: 397, baseType: !569, size: 64, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !557, file: !30, line: 398, baseType: !569, size: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !557, file: !30, line: 401, baseType: !593, size: 64, offset: 1152)
!593 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !557, file: !30, line: 402, baseType: !593, size: 64, offset: 1216)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !557, file: !30, line: 405, baseType: !596, size: 64, offset: 1280)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !598)
!598 = !{!599, !602, !603, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !597, file: !395, line: 143, baseType: !600, size: 16)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !42, line: 93, baseType: !601)
!601 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !597, file: !395, line: 144, baseType: !600, size: 16, offset: 16)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !597, file: !395, line: 145, baseType: !600, size: 16, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !597, file: !395, line: 146, baseType: !600, size: 16, offset: 48)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !557, file: !30, line: 406, baseType: !596, size: 64, offset: 1344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !557, file: !30, line: 407, baseType: !596, size: 64, offset: 1408)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !557, file: !30, line: 410, baseType: !564, size: 32, offset: 1472)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !557, file: !30, line: 411, baseType: !564, size: 32, offset: 1504)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !557, file: !30, line: 414, baseType: !575, size: 64, offset: 1536)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !557, file: !30, line: 417, baseType: !611, size: 32, offset: 1600)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !68, line: 61, baseType: !67)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !557, file: !30, line: 420, baseType: !613, size: 32, offset: 1632)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !30, line: 61, baseType: !104)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !557, file: !30, line: 423, baseType: !615, size: 32, offset: 1664)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !119, line: 59, baseType: !118)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !557, file: !30, line: 426, baseType: !617, size: 64, offset: 1728)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !618, line: 77, baseType: !619)
!618 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !620, line: 193, baseType: !621)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!621 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !557, file: !30, line: 429, baseType: !564, size: 32, offset: 1792)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !557, file: !30, line: 430, baseType: !564, size: 32, offset: 1824)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !557, file: !30, line: 433, baseType: !569, size: 64, offset: 1856)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !557, file: !30, line: 434, baseType: !569, size: 64, offset: 1920)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !557, file: !30, line: 437, baseType: !627, size: 32, offset: 1984)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !42, line: 202, baseType: !151)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !557, file: !30, line: 440, baseType: !629, size: 64, offset: 2048)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !42, line: 221, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !30, line: 150, size: 105920, elements: !632)
!632 = !{!633, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !647, !648, !649, !650, !651, !665, !667, !669, !670, !671, !672, !673, !674, !675, !676, !684, !685, !686, !687, !688, !689, !691, !692, !693, !695, !697, !699, !701, !702, !703, !704, !705, !706, !707, !715, !730, !744, !745, !746, !747, !751, !755, !759, !760, !761, !762, !763, !781, !782, !784, !785, !795, !796, !798, !799, !800, !801, !802, !803, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !820, !822}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !631, file: !30, line: 153, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !42, line: 209, baseType: !173)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !631, file: !30, line: 156, baseType: !611, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !631, file: !30, line: 159, baseType: !560, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !631, file: !30, line: 162, baseType: !575, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !631, file: !30, line: 165, baseType: !562, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !631, file: !30, line: 168, baseType: !564, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !631, file: !30, line: 169, baseType: !564, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !631, file: !30, line: 172, baseType: !575, size: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !631, file: !30, line: 173, baseType: !575, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !631, file: !30, line: 174, baseType: !575, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !631, file: !30, line: 175, baseType: !575, size: 64, offset: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !631, file: !30, line: 178, baseType: !646, size: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !631, file: !30, line: 179, baseType: !596, size: 64, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !631, file: !30, line: 180, baseType: !596, size: 64, offset: 704)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !631, file: !30, line: 181, baseType: !596, size: 64, offset: 768)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !631, file: !30, line: 184, baseType: !593, size: 64, offset: 832)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !631, file: !30, line: 187, baseType: !652, size: 768, offset: 896)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !30, line: 128, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !30, line: 121, size: 768, elements: !654)
!654 = !{!655, !662, !663, !664}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !653, file: !30, line: 124, baseType: !656, size: 192)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !30, line: 101, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !30, line: 95, size: 192, elements: !658)
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !657, file: !30, line: 98, baseType: !593, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !657, file: !30, line: 99, baseType: !593, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !657, file: !30, line: 100, baseType: !593, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !653, file: !30, line: 125, baseType: !656, size: 192, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !653, file: !30, line: 126, baseType: !656, size: 192, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !653, file: !30, line: 127, baseType: !656, size: 192, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !631, file: !30, line: 190, baseType: !666, size: 32, offset: 1664)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !179, line: 49, baseType: !178)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !631, file: !30, line: 193, baseType: !668, size: 64, offset: 1728)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !631, file: !30, line: 196, baseType: !585, size: 32, offset: 1792)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !631, file: !30, line: 199, baseType: !569, size: 64, offset: 1856)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !631, file: !30, line: 200, baseType: !569, size: 64, offset: 1920)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !631, file: !30, line: 201, baseType: !569, size: 64, offset: 1984)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !631, file: !30, line: 204, baseType: !617, size: 64, offset: 2048)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !631, file: !30, line: 207, baseType: !593, size: 64, offset: 2112)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !631, file: !30, line: 208, baseType: !593, size: 64, offset: 2176)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !631, file: !30, line: 211, baseType: !677, size: 256, offset: 2240)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !222, line: 130, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !222, line: 121, size: 256, elements: !679)
!679 = !{!680, !681, !682, !683}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !678, file: !222, line: 124, baseType: !575, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !678, file: !222, line: 125, baseType: !575, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !678, file: !222, line: 128, baseType: !617, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !678, file: !222, line: 129, baseType: !617, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !631, file: !30, line: 212, baseType: !677, size: 256, offset: 2496)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !631, file: !30, line: 213, baseType: !677, size: 256, offset: 2752)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !631, file: !30, line: 216, baseType: !593, size: 64, offset: 3008)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !631, file: !30, line: 217, baseType: !593, size: 64, offset: 3072)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !631, file: !30, line: 218, baseType: !593, size: 64, offset: 3136)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !631, file: !30, line: 221, baseType: !690, size: 32, offset: 3200)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !187, line: 66, baseType: !186)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !631, file: !30, line: 224, baseType: !581, size: 32, offset: 3232)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !631, file: !30, line: 227, baseType: !583, size: 32, offset: 3264)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !631, file: !30, line: 230, baseType: !694, size: 32, offset: 3296)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !222, line: 91, baseType: !221)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !631, file: !30, line: 233, baseType: !696, size: 32, offset: 3328)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !237, line: 99, baseType: !236)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !631, file: !30, line: 236, baseType: !698, size: 32, offset: 3360)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !308, line: 32, baseType: !307)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !631, file: !30, line: 239, baseType: !700, size: 64, offset: 3392)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !631, file: !30, line: 242, baseType: !575, size: 64, offset: 3456)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !631, file: !30, line: 243, baseType: !575, size: 64, offset: 3520)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !631, file: !30, line: 246, baseType: !617, size: 64, offset: 3584)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !631, file: !30, line: 249, baseType: !575, size: 64, offset: 3648)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !631, file: !30, line: 250, baseType: !575, size: 64, offset: 3712)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !631, file: !30, line: 253, baseType: !617, size: 64, offset: 3776)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !631, file: !30, line: 256, baseType: !708, size: 192, offset: 3840)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !709, line: 68, baseType: !710)
!709 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !709, line: 62, size: 192, elements: !711)
!711 = !{!712, !713, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !710, file: !709, line: 65, baseType: !593, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !710, file: !709, line: 66, baseType: !593, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !710, file: !709, line: 67, baseType: !593, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !631, file: !30, line: 259, baseType: !716, size: 512, offset: 4032)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !316, line: 51, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !316, line: 40, size: 512, elements: !718)
!718 = !{!719, !726, !727, !729}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !717, file: !316, line: 43, baseType: !720, size: 192)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !316, line: 38, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !316, line: 32, size: 192, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !721, file: !316, line: 35, baseType: !593, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !721, file: !316, line: 36, baseType: !593, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !721, file: !316, line: 37, baseType: !593, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !717, file: !316, line: 44, baseType: !720, size: 192, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !717, file: !316, line: 47, baseType: !728, size: 32, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !316, line: 30, baseType: !315)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !717, file: !316, line: 50, baseType: !575, size: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !631, file: !30, line: 262, baseType: !731, size: 64, offset: 4544)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !732, line: 26, baseType: !733)
!732 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!564, !736, !738, !741, !668}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !42, line: 150, baseType: !740)
!740 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !42, line: 151, baseType: !743)
!743 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !631, file: !30, line: 265, baseType: !668, size: 64, offset: 4608)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !631, file: !30, line: 266, baseType: !668, size: 64, offset: 4672)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !631, file: !30, line: 267, baseType: !668, size: 64, offset: 4736)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !631, file: !30, line: 270, baseType: !748, size: 64, offset: 4800)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !4, line: 52, baseType: !750)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !4, line: 51, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !631, file: !30, line: 273, baseType: !752, size: 64, offset: 4864)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !42, line: 217, baseType: !754)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !42, line: 217, flags: DIFlagFwdDecl)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !631, file: !30, line: 276, baseType: !756, size: 32768, offset: 4928)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 32768, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 4096)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !631, file: !30, line: 277, baseType: !756, size: 32768, offset: 37696)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !631, file: !30, line: 278, baseType: !756, size: 32768, offset: 70464)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !631, file: !30, line: 281, baseType: !575, size: 64, offset: 103232)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !631, file: !30, line: 282, baseType: !575, size: 64, offset: 103296)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !631, file: !30, line: 285, baseType: !764, size: 448, offset: 103360)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !42, line: 219, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !322, line: 102, size: 448, elements: !766)
!766 = !{!767, !769, !771, !772, !773, !774, !775, !780}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !765, file: !322, line: 105, baseType: !768, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !322, line: 100, baseType: !321)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !765, file: !322, line: 108, baseType: !770, size: 32, offset: 32)
!770 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !765, file: !322, line: 111, baseType: !569, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !765, file: !322, line: 112, baseType: !569, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !765, file: !322, line: 115, baseType: !668, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !765, file: !322, line: 118, baseType: !564, size: 32, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !765, file: !322, line: 121, baseType: !776, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !778, line: 26, baseType: !779)
!778 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !778, line: 25, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !765, file: !322, line: 124, baseType: !575, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !631, file: !30, line: 288, baseType: !564, size: 32, offset: 103808)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !631, file: !30, line: 291, baseType: !783, size: 64, offset: 103872)
!783 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !617)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !631, file: !30, line: 294, baseType: !776, size: 64, offset: 103936)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !631, file: !30, line: 297, baseType: !786, size: 256, offset: 104000)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !179, line: 40, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !179, line: 27, size: 256, elements: !788)
!788 = !{!789, !790, !791, !794}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !787, file: !179, line: 30, baseType: !569, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !787, file: !179, line: 33, baseType: !575, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !787, file: !179, line: 36, baseType: !792, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !787, file: !179, line: 39, baseType: !575, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !631, file: !30, line: 298, baseType: !786, size: 256, offset: 104256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !631, file: !30, line: 299, baseType: !797, size: 64, offset: 104512)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !631, file: !30, line: 302, baseType: !575, size: 64, offset: 104576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !631, file: !30, line: 305, baseType: !575, size: 64, offset: 104640)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !631, file: !30, line: 308, baseType: !700, size: 64, offset: 104704)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !631, file: !30, line: 309, baseType: !700, size: 64, offset: 104768)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !631, file: !30, line: 310, baseType: !700, size: 64, offset: 104832)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !631, file: !30, line: 313, baseType: !804, size: 32, offset: 104896)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !631, file: !30, line: 316, baseType: !564, size: 32, offset: 104928)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !631, file: !30, line: 319, baseType: !596, size: 64, offset: 104960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !631, file: !30, line: 322, baseType: !700, size: 64, offset: 105024)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !631, file: !30, line: 325, baseType: !677, size: 256, offset: 105088)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !631, file: !30, line: 328, baseType: !668, size: 64, offset: 105344)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !631, file: !30, line: 329, baseType: !668, size: 64, offset: 105408)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !631, file: !30, line: 332, baseType: !613, size: 32, offset: 105472)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !631, file: !30, line: 335, baseType: !564, size: 32, offset: 105504)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !631, file: !30, line: 338, baseType: !742, size: 64, offset: 105536)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !631, file: !30, line: 341, baseType: !564, size: 32, offset: 105600)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !631, file: !30, line: 344, baseType: !575, size: 64, offset: 105664)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !631, file: !30, line: 347, baseType: !817, size: 64, offset: 105728)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !818, line: 7, baseType: !819)
!818 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !620, line: 160, baseType: !621)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !631, file: !30, line: 350, baseType: !821, size: 32, offset: 105792)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !631, file: !30, line: 353, baseType: !575, size: 64, offset: 105856)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !557, file: !30, line: 443, baseType: !668, size: 64, offset: 2112)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !557, file: !30, line: 446, baseType: !731, size: 64, offset: 2176)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !557, file: !30, line: 449, baseType: !668, size: 64, offset: 2240)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !557, file: !30, line: 450, baseType: !668, size: 64, offset: 2304)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !557, file: !30, line: 453, baseType: !828, size: 64, offset: 2368)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !829, line: 26, baseType: !830)
!829 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!575, !833, !835, !837}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !557, file: !30, line: 456, baseType: !839, size: 64, offset: 2432)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !841, line: 7, baseType: !842)
!841 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !843, line: 49, size: 1728, elements: !844)
!843 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !860, !862, !863, !864, !866, !867, !869, !873, !876, !878, !881, !884, !885, !886, !887, !888}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !842, file: !843, line: 51, baseType: !770, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !842, file: !843, line: 54, baseType: !569, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !842, file: !843, line: 55, baseType: !569, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !842, file: !843, line: 56, baseType: !569, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !842, file: !843, line: 57, baseType: !569, size: 64, offset: 256)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !842, file: !843, line: 58, baseType: !569, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !842, file: !843, line: 59, baseType: !569, size: 64, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !842, file: !843, line: 60, baseType: !569, size: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !842, file: !843, line: 61, baseType: !569, size: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !842, file: !843, line: 64, baseType: !569, size: 64, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !842, file: !843, line: 65, baseType: !569, size: 64, offset: 640)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !842, file: !843, line: 66, baseType: !569, size: 64, offset: 704)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !842, file: !843, line: 68, baseType: !858, size: 64, offset: 768)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !843, line: 36, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !842, file: !843, line: 70, baseType: !861, size: 64, offset: 832)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !842, file: !843, line: 72, baseType: !770, size: 32, offset: 896)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !842, file: !843, line: 73, baseType: !770, size: 32, offset: 928)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !842, file: !843, line: 74, baseType: !865, size: 64, offset: 960)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !620, line: 152, baseType: !621)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !842, file: !843, line: 77, baseType: !601, size: 16, offset: 1024)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !842, file: !843, line: 78, baseType: !868, size: 8, offset: 1040)
!868 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !842, file: !843, line: 79, baseType: !870, size: 8, offset: 1048)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 8, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 1)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !842, file: !843, line: 81, baseType: !874, size: 64, offset: 1088)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !843, line: 43, baseType: null)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !842, file: !843, line: 89, baseType: !877, size: 64, offset: 1152)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !620, line: 153, baseType: !621)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !842, file: !843, line: 91, baseType: !879, size: 64, offset: 1216)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !843, line: 37, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !842, file: !843, line: 92, baseType: !882, size: 64, offset: 1280)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !843, line: 38, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !842, file: !843, line: 93, baseType: !861, size: 64, offset: 1344)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !842, file: !843, line: 94, baseType: !668, size: 64, offset: 1408)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !842, file: !843, line: 95, baseType: !575, size: 64, offset: 1472)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !842, file: !843, line: 96, baseType: !770, size: 32, offset: 1536)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !842, file: !843, line: 98, baseType: !889, size: 160, offset: 1568)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 160, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 20)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !557, file: !30, line: 459, baseType: !668, size: 64, offset: 2496)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !557, file: !30, line: 462, baseType: !575, size: 64, offset: 2560)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !557, file: !30, line: 465, baseType: !756, size: 32768, offset: 2624)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !557, file: !30, line: 466, baseType: !756, size: 32768, offset: 35392)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !557, file: !30, line: 467, baseType: !756, size: 32768, offset: 68160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !557, file: !30, line: 468, baseType: !756, size: 32768, offset: 100928)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !557, file: !30, line: 471, baseType: !564, size: 32, offset: 133696)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !557, file: !30, line: 474, baseType: !569, size: 64, offset: 133760)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !557, file: !30, line: 477, baseType: !575, size: 64, offset: 133824)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !557, file: !30, line: 478, baseType: !575, size: 64, offset: 133888)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !557, file: !30, line: 481, baseType: !596, size: 64, offset: 133952)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !557, file: !30, line: 484, baseType: !575, size: 64, offset: 134016)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !557, file: !30, line: 487, baseType: !905, size: 32, offset: 134080)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !557, file: !30, line: 490, baseType: !596, size: 64, offset: 134112)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !557, file: !30, line: 493, baseType: !668, size: 64, offset: 134208)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !557, file: !30, line: 496, baseType: !564, size: 32, offset: 134272)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !550, file: !551, line: 73, baseType: !833, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !550, file: !551, line: 76, baseType: !629, size: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "quantum_info", scope: !550, file: !551, line: 79, baseType: !912, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumInfo", file: !57, line: 85, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumInfo", file: !915, line: 42, size: 1216, elements: !916)
!915 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!916 = !{!917, !918, !919, !921, !922, !923, !924, !925, !926, !927, !929, !930, !932, !933, !934, !944, !945}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !914, file: !915, line: 45, baseType: !575, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !914, file: !915, line: 46, baseType: !575, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !914, file: !915, line: 49, baseType: !920, size: 32, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumFormatType", file: !57, line: 50, baseType: !444)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !914, file: !915, line: 52, baseType: !593, size: 64, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !914, file: !915, line: 53, baseType: !593, size: 64, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !914, file: !915, line: 54, baseType: !593, size: 64, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !914, file: !915, line: 57, baseType: !575, size: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "min_is_white", scope: !914, file: !915, line: 60, baseType: !564, size: 32, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !914, file: !915, line: 61, baseType: !564, size: 32, offset: 480)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_type", scope: !914, file: !915, line: 64, baseType: !928, size: 32, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAlphaType", file: !57, line: 42, baseType: !450)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !914, file: !915, line: 67, baseType: !575, size: 64, offset: 576)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !914, file: !915, line: 70, baseType: !931, size: 64, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !914, file: !915, line: 73, baseType: !575, size: 64, offset: 704)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !914, file: !915, line: 76, baseType: !583, size: 32, offset: 768)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !914, file: !915, line: 79, baseType: !935, size: 256, offset: 832)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumState", file: !915, line: 40, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumState", file: !915, line: 27, size: 256, elements: !937)
!937 = !{!938, !939, !940, !941}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_scale", scope: !936, file: !915, line: 30, baseType: !593, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !936, file: !915, line: 33, baseType: !5, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !936, file: !915, line: 36, baseType: !575, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !936, file: !915, line: 39, baseType: !942, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !914, file: !915, line: 82, baseType: !776, size: 64, offset: 1088)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !914, file: !915, line: 85, baseType: !575, size: 64, offset: 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !550, file: !551, line: 82, baseType: !569, size: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "storage_type", scope: !550, file: !551, line: 85, baseType: !948, size: 32, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorageType", file: !456, line: 35, baseType: !455)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !550, file: !551, line: 88, baseType: !792, size: 64, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !550, file: !551, line: 91, baseType: !677, size: 256, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !550, file: !551, line: 94, baseType: !617, size: 64, offset: 704)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !550, file: !551, line: 97, baseType: !953, size: 64, offset: 768)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !550, file: !551, line: 100, baseType: !835, size: 64, offset: 832)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !550, file: !551, line: 103, baseType: !575, size: 64, offset: 896)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheInfo", file: !958, line: 217, baseType: !959)
!958 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "6b4e371270617573d29dc6ff902677c8")
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheInfo", file: !958, line: 128, size: 68224, elements: !960)
!960 = !{!961, !962, !963, !964, !966, !968, !969, !970, !971, !972, !973, !974, !990, !991, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1075, !1080, !1081, !1082, !1083, !1084, !1090, !1091, !1092, !1093, !1094}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !959, file: !958, line: 131, baseType: !634, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !959, file: !958, line: 134, baseType: !611, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !959, file: !958, line: 137, baseType: !575, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !959, file: !958, line: 140, baseType: !965, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheType", file: !502, line: 35, baseType: !501)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !959, file: !958, line: 143, baseType: !967, size: 32, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "MapMode", file: !511, line: 35, baseType: !510)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !959, file: !958, line: 146, baseType: !564, size: 32, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !959, file: !958, line: 149, baseType: !575, size: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !959, file: !958, line: 150, baseType: !575, size: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !959, file: !958, line: 153, baseType: !739, size: 64, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !959, file: !958, line: 156, baseType: !742, size: 64, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !959, file: !958, line: 159, baseType: !905, size: 32, offset: 512)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_color", scope: !959, file: !958, line: 162, baseType: !975, size: 448, offset: 576)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !395, line: 127, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !395, line: 104, size: 448, elements: !977)
!977 = !{!978, !979, !980, !981, !982, !983, !986, !987, !988, !989}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !976, file: !395, line: 107, baseType: !634, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !976, file: !395, line: 110, baseType: !611, size: 32, offset: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !976, file: !395, line: 113, baseType: !564, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !976, file: !395, line: 116, baseType: !593, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !976, file: !395, line: 119, baseType: !575, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !976, file: !395, line: 122, baseType: !984, size: 32, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !42, line: 78, baseType: !985)
!985 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !976, file: !395, line: 123, baseType: !984, size: 32, offset: 288)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !976, file: !395, line: 124, baseType: !984, size: 32, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !976, file: !395, line: 125, baseType: !984, size: 32, offset: 352)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !976, file: !395, line: 126, baseType: !984, size: 32, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !959, file: !958, line: 165, baseType: !575, size: 64, offset: 1024)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "nexus_info", scope: !959, file: !958, line: 168, baseType: !992, size: 64, offset: 1088)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "NexusInfo", file: !958, line: 126, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NexusInfo", file: !958, line: 103, size: 704, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1002, !1003, !1006}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !995, file: !958, line: 106, baseType: !564, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !995, file: !958, line: 109, baseType: !677, size: 256, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !995, file: !958, line: 112, baseType: !742, size: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !995, file: !958, line: 115, baseType: !646, size: 64, offset: 384)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !995, file: !958, line: 116, baseType: !646, size: 64, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "authentic_pixel_cache", scope: !995, file: !958, line: 119, baseType: !564, size: 32, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !995, file: !958, line: 122, baseType: !1004, size: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !395, line: 129, baseType: !600)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !995, file: !958, line: 125, baseType: !575, size: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !959, file: !958, line: 171, baseType: !646, size: 64, offset: 1152)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !959, file: !958, line: 174, baseType: !1004, size: 64, offset: 1216)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "active_index_channel", scope: !959, file: !958, line: 177, baseType: !564, size: 32, offset: 1280)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !959, file: !958, line: 180, baseType: !770, size: 32, offset: 1312)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !959, file: !958, line: 183, baseType: !756, size: 32768, offset: 1344)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "cache_filename", scope: !959, file: !958, line: 184, baseType: !756, size: 32768, offset: 34112)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !959, file: !958, line: 187, baseType: !1014, size: 704, offset: 66880)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheMethods", file: !958, line: 101, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheMethods", file: !958, line: 67, size: 704, elements: !1016)
!1016 = !{!1017, !1026, !1031, !1038, !1043, !1048, !1053, !1058, !1063, !1065, !1070}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_pixel_handler", scope: !1015, file: !958, line: 70, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualPixelHandler", file: !958, line: 49, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!1022, !833, !1024, !1025, !1025, !837, !837, !953}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_pixels_handler", scope: !1015, file: !958, line: 73, baseType: !1027, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualPixelsHandler", file: !958, line: 51, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1022, !833}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_indexes_from_handler", scope: !1015, file: !958, line: 76, baseType: !1032, size: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualIndexesFromHandler", file: !958, line: 36, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!1036, !833}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "get_one_virtual_pixel_from_handler", scope: !1015, file: !958, line: 79, baseType: !1039, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetOneVirtualPixelFromHandler", file: !958, line: 44, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!564, !833, !1024, !1025, !1025, !646, !953}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_pixels_handler", scope: !1015, file: !958, line: 82, baseType: !1044, size: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticPixelsHandler", file: !958, line: 54, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!646, !629, !1025, !1025, !837, !837, !953}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_indexes_from_handler", scope: !1015, file: !958, line: 85, baseType: !1049, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticIndexesFromHandler", file: !958, line: 39, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1004, !833}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "get_one_authentic_pixel_from_handler", scope: !1015, file: !958, line: 88, baseType: !1054, size: 64, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetOneAuthenticPixelFromHandler", file: !958, line: 42, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!564, !629, !1025, !1025, !646, !953}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_pixels_from_handler", scope: !1015, file: !958, line: 91, baseType: !1059, size: 64, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticPixelsFromHandler", file: !958, line: 58, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!646, !833}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "queue_authentic_pixels_handler", scope: !1015, file: !958, line: 94, baseType: !1064, size: 64, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueAuthenticPixelsHandler", file: !958, line: 61, baseType: !1045)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "sync_authentic_pixels_handler", scope: !1015, file: !958, line: 97, baseType: !1066, size: 64, offset: 576)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncAuthenticPixelsHandler", file: !958, line: 46, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!564, !629, !953}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_pixel_handler", scope: !1015, file: !958, line: 100, baseType: !1071, size: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "DestroyPixelHandler", file: !958, line: 65, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !629}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "random_info", scope: !959, file: !958, line: 190, baseType: !1076, size: 64, offset: 67584)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !1078, line: 31, baseType: !1079)
!1078 = !DIFile(filename: "apps/538.imagick_r/src/magick/random_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "95f31caf92e8a7cab5b1bf8cc3698f31")
!1079 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !1078, line: 30, flags: DIFlagFwdDecl)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "number_connections", scope: !959, file: !958, line: 193, baseType: !575, size: 64, offset: 67648)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "server_info", scope: !959, file: !958, line: 196, baseType: !668, size: 64, offset: 67712)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !959, file: !958, line: 199, baseType: !564, size: 32, offset: 67776)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !959, file: !958, line: 200, baseType: !564, size: 32, offset: 67808)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !959, file: !958, line: 203, baseType: !1085, size: 32, offset: 67840)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickThreadType", file: !1086, line: 30, baseType: !1087)
!1086 = !DIFile(filename: "apps/538.imagick_r/src/magick/thread_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c99214db95297b06bb439184c535bbc9")
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1088, line: 97, baseType: !1089)
!1088 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !620, line: 154, baseType: !770)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !959, file: !958, line: 206, baseType: !617, size: 64, offset: 67904)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !959, file: !958, line: 209, baseType: !776, size: 64, offset: 67968)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "file_semaphore", scope: !959, file: !958, line: 210, baseType: !776, size: 64, offset: 68032)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !959, file: !958, line: 213, baseType: !817, size: 64, offset: 68096)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !959, file: !958, line: 216, baseType: !575, size: 64, offset: 68160)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumType", file: !57, line: 82, baseType: !516)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!1103 = !{i32 7, !"Dwarf Version", i32 5}
!1104 = !{i32 2, !"Debug Info Version", i32 3}
!1105 = !{i32 1, !"wchar_size", i32 4}
!1106 = !{i32 7, !"PIC Level", i32 2}
!1107 = !{i32 7, !"PIE Level", i32 2}
!1108 = !{i32 7, !"uwtable", i32 2}
!1109 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!1110 = distinct !DISubprogram(name: "AcquireStreamInfo", scope: !551, file: !551, line: 151, type: !1111, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1113)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!547, !554}
!1113 = !{!1114, !1115, !1116, !1119, !1120, !1123}
!1114 = !DILocalVariable(name: "image_info", arg: 1, scope: !1110, file: !551, line: 151, type: !554)
!1115 = !DILocalVariable(name: "stream_info", scope: !1110, file: !551, line: 154, type: !547)
!1116 = !DILocalVariable(name: "message", scope: !1117, file: !551, line: 158, type: !569)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !551, line: 158, column: 5)
!1118 = distinct !DILexicalBlock(scope: !1110, file: !551, line: 157, column: 7)
!1119 = !DILocalVariable(name: "exception", scope: !1117, file: !551, line: 158, type: !764)
!1120 = !DILocalVariable(name: "message", scope: !1121, file: !551, line: 163, type: !569)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !551, line: 163, column: 5)
!1122 = distinct !DILexicalBlock(scope: !1110, file: !551, line: 162, column: 7)
!1123 = !DILocalVariable(name: "exception", scope: !1121, file: !551, line: 163, type: !764)
!1124 = !DILocation(line: 0, scope: !1110)
!1125 = !DILocation(line: 156, column: 30, scope: !1110)
!1126 = !DILocation(line: 157, column: 19, scope: !1118)
!1127 = !DILocation(line: 157, column: 7, scope: !1110)
!1128 = !DILocation(line: 158, column: 5, scope: !1117)
!1129 = !{!1130, !1130, i64 0}
!1130 = !{!"int", !1131, i64 0}
!1131 = !{!"omnipotent char", !1132, i64 0}
!1132 = !{!"Simple C/C++ TBAA"}
!1133 = !DILocation(line: 0, scope: !1117)
!1134 = !DILocation(line: 159, column: 10, scope: !1110)
!1135 = !DILocation(line: 160, column: 41, scope: !1110)
!1136 = !DILocation(line: 160, column: 16, scope: !1110)
!1137 = !DILocation(line: 160, column: 22, scope: !1110)
!1138 = !{!1139, !1140, i64 48}
!1139 = !{!"_StreamInfo", !1140, i64 0, !1140, i64 8, !1140, i64 16, !1140, i64 24, !1140, i64 32, !1131, i64 40, !1140, i64 48, !1141, i64 56, !1142, i64 88, !1140, i64 96, !1140, i64 104, !1142, i64 112}
!1140 = !{!"any pointer", !1131, i64 0}
!1141 = !{!"_RectangleInfo", !1142, i64 0, !1142, i64 8, !1142, i64 16, !1142, i64 24}
!1142 = !{!"long", !1131, i64 0}
!1143 = !DILocation(line: 162, column: 27, scope: !1122)
!1144 = !DILocation(line: 162, column: 7, scope: !1110)
!1145 = !DILocation(line: 163, column: 5, scope: !1121)
!1146 = !DILocation(line: 0, scope: !1121)
!1147 = !DILocation(line: 164, column: 20, scope: !1110)
!1148 = !DILocation(line: 164, column: 16, scope: !1110)
!1149 = !DILocation(line: 164, column: 19, scope: !1110)
!1150 = !{!1139, !1140, i64 32}
!1151 = !DILocation(line: 165, column: 16, scope: !1110)
!1152 = !DILocation(line: 165, column: 28, scope: !1110)
!1153 = !{!1139, !1131, i64 40}
