; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/coders/tga.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/coders/tga.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagickInfo = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i64, ptr, ptr }
%struct._PixelPacket = type { i16, i16, i16, i16 }
%struct._TGAInfo = type { i8, i8, i8, i16, i16, i8, i16, i16, i16, i16, i8, i8 }
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i64, i64, i64, i32, i32, i32, i64, ptr, ptr, ptr, ptr, ptr, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, ptr, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, ptr, i32 }

!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 27, baseType: !5, size: 32, elements: !425)
!424 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!426 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!427 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!428 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!429 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!430 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!431 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!432 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!433 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!434 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!435 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!436 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!437 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!438 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!439 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!440 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!441 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!442 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!443 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!444 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !445, line: 28, baseType: !5, size: 32, elements: !446)
!445 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!446 = !{!447, !448, !449}
!447 = !DIEnumerator(name: "UndefinedFormatType", value: 0)
!448 = !DIEnumerator(name: "ImplicitFormatType", value: 1)
!449 = !DIEnumerator(name: "ExplicitFormatType", value: 2)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !451, line: 34, baseType: !5, size: 32, elements: !452)
!451 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!453 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!454 = !DIEnumerator(name: "NoEvents", value: 0)
!455 = !DIEnumerator(name: "TraceEvent", value: 1)
!456 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!457 = !DIEnumerator(name: "BlobEvent", value: 4)
!458 = !DIEnumerator(name: "CacheEvent", value: 8)
!459 = !DIEnumerator(name: "CoderEvent", value: 16)
!460 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!461 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!462 = !DIEnumerator(name: "DrawEvent", value: 128)
!463 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!464 = !DIEnumerator(name: "ImageEvent", value: 512)
!465 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!466 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!467 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!468 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!469 = !DIEnumerator(name: "TransformEvent", value: 16384)
!470 = !DIEnumerator(name: "UserEvent", value: 36864)
!471 = !DIEnumerator(name: "WandEvent", value: 65536)
!472 = !DIEnumerator(name: "X11Event", value: 131072)
!473 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!474 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!475 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !476, line: 35, baseType: !5, size: 32, elements: !477)
!476 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a66ea2eabdd36512a199f3a0075ea4ad")
!477 = !{!478, !479, !480, !481, !482, !483, !484}
!478 = !DIEnumerator(name: "UndefinedBlobMode", value: 0)
!479 = !DIEnumerator(name: "ReadBlobMode", value: 1)
!480 = !DIEnumerator(name: "ReadBinaryBlobMode", value: 2)
!481 = !DIEnumerator(name: "WriteBlobMode", value: 3)
!482 = !DIEnumerator(name: "WriteBinaryBlobMode", value: 4)
!483 = !DIEnumerator(name: "AppendBlobMode", value: 5)
!484 = !DIEnumerator(name: "AppendBinaryBlobMode", value: 6)
!485 = !{!486, !846, !501, !503, !490, !546, !681, !520, !550, !680, !519, !555, !850, !514, !851, !627, !630, !852, !619, !624, !854, !856}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !445, line: 43, baseType: !488)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !712, !845}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !42, line: 221, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !30, line: 150, size: 105920, elements: !493)
!493 = !{!494, !496, !498, !500, !504, !506, !508, !509, !510, !511, !512, !513, !524, !525, !526, !527, !529, !543, !545, !547, !549, !552, !553, !554, !560, !561, !562, !570, !571, !572, !573, !574, !575, !577, !579, !581, !583, !585, !587, !589, !590, !591, !592, !593, !594, !595, !603, !618, !632, !633, !634, !635, !639, !643, !647, !648, !649, !650, !651, !669, !670, !672, !673, !683, !684, !686, !687, !688, !689, !690, !691, !693, !694, !695, !696, !697, !698, !699, !701, !702, !703, !704, !705, !709, !711}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !492, file: !30, line: 153, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !42, line: 209, baseType: !173)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !492, file: !30, line: 156, baseType: !497, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !68, line: 61, baseType: !67)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !492, file: !30, line: 159, baseType: !499, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !4, line: 49, baseType: !3)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !492, file: !30, line: 162, baseType: !501, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !502, line: 46, baseType: !503)
!502 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!503 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !492, file: !30, line: 165, baseType: !505, size: 32, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !30, line: 86, baseType: !29)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !492, file: !30, line: 168, baseType: !507, size: 32, offset: 224)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !42, line: 215, baseType: !41)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !492, file: !30, line: 169, baseType: !507, size: 32, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !492, file: !30, line: 172, baseType: !501, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !492, file: !30, line: 173, baseType: !501, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !492, file: !30, line: 174, baseType: !501, size: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !492, file: !30, line: 175, baseType: !501, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !492, file: !30, line: 178, baseType: !514, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !517)
!517 = !{!518, !521, !522, !523}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !516, file: !395, line: 143, baseType: !519, size: 16)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !42, line: 93, baseType: !520)
!520 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !516, file: !395, line: 144, baseType: !519, size: 16, offset: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !516, file: !395, line: 145, baseType: !519, size: 16, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !516, file: !395, line: 146, baseType: !519, size: 16, offset: 48)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !492, file: !30, line: 179, baseType: !515, size: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !492, file: !30, line: 180, baseType: !515, size: 64, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !492, file: !30, line: 181, baseType: !515, size: 64, offset: 768)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !492, file: !30, line: 184, baseType: !528, size: 64, offset: 832)
!528 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !492, file: !30, line: 187, baseType: !530, size: 768, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !30, line: 128, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !30, line: 121, size: 768, elements: !532)
!532 = !{!533, !540, !541, !542}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !531, file: !30, line: 124, baseType: !534, size: 192)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !30, line: 101, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !30, line: 95, size: 192, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !535, file: !30, line: 98, baseType: !528, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !535, file: !30, line: 99, baseType: !528, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !535, file: !30, line: 100, baseType: !528, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !531, file: !30, line: 125, baseType: !534, size: 192, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !531, file: !30, line: 126, baseType: !534, size: 192, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !531, file: !30, line: 127, baseType: !534, size: 192, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !492, file: !30, line: 190, baseType: !544, size: 32, offset: 1664)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !179, line: 49, baseType: !178)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !492, file: !30, line: 193, baseType: !546, size: 64, offset: 1728)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !492, file: !30, line: 196, baseType: !548, size: 32, offset: 1792)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !30, line: 93, baseType: !62)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !492, file: !30, line: 199, baseType: !550, size: 64, offset: 1856)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !492, file: !30, line: 200, baseType: !550, size: 64, offset: 1920)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !492, file: !30, line: 201, baseType: !550, size: 64, offset: 1984)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !492, file: !30, line: 204, baseType: !555, size: 64, offset: 2048)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !556, line: 77, baseType: !557)
!556 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !558, line: 193, baseType: !559)
!558 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!559 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !492, file: !30, line: 207, baseType: !528, size: 64, offset: 2112)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !492, file: !30, line: 208, baseType: !528, size: 64, offset: 2176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !492, file: !30, line: 211, baseType: !563, size: 256, offset: 2240)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !222, line: 130, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !222, line: 121, size: 256, elements: !565)
!565 = !{!566, !567, !568, !569}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !564, file: !222, line: 124, baseType: !501, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !564, file: !222, line: 125, baseType: !501, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !564, file: !222, line: 128, baseType: !555, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !564, file: !222, line: 129, baseType: !555, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !492, file: !30, line: 212, baseType: !563, size: 256, offset: 2496)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !492, file: !30, line: 213, baseType: !563, size: 256, offset: 2752)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !492, file: !30, line: 216, baseType: !528, size: 64, offset: 3008)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !492, file: !30, line: 217, baseType: !528, size: 64, offset: 3072)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !492, file: !30, line: 218, baseType: !528, size: 64, offset: 3136)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !492, file: !30, line: 221, baseType: !576, size: 32, offset: 3200)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !187, line: 66, baseType: !186)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !492, file: !30, line: 224, baseType: !578, size: 32, offset: 3232)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !30, line: 73, baseType: !46)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !492, file: !30, line: 227, baseType: !580, size: 32, offset: 3264)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !57, line: 35, baseType: !56)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !492, file: !30, line: 230, baseType: !582, size: 32, offset: 3296)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !222, line: 91, baseType: !221)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !492, file: !30, line: 233, baseType: !584, size: 32, offset: 3328)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !237, line: 99, baseType: !236)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !492, file: !30, line: 236, baseType: !586, size: 32, offset: 3360)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !308, line: 32, baseType: !307)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !492, file: !30, line: 239, baseType: !588, size: 64, offset: 3392)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !492, file: !30, line: 242, baseType: !501, size: 64, offset: 3456)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !492, file: !30, line: 243, baseType: !501, size: 64, offset: 3520)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !492, file: !30, line: 246, baseType: !555, size: 64, offset: 3584)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !492, file: !30, line: 249, baseType: !501, size: 64, offset: 3648)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !492, file: !30, line: 250, baseType: !501, size: 64, offset: 3712)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !492, file: !30, line: 253, baseType: !555, size: 64, offset: 3776)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !492, file: !30, line: 256, baseType: !596, size: 192, offset: 3840)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !597, line: 68, baseType: !598)
!597 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !597, line: 62, size: 192, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !598, file: !597, line: 65, baseType: !528, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !598, file: !597, line: 66, baseType: !528, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !598, file: !597, line: 67, baseType: !528, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !492, file: !30, line: 259, baseType: !604, size: 512, offset: 4032)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !316, line: 51, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !316, line: 40, size: 512, elements: !606)
!606 = !{!607, !614, !615, !617}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !605, file: !316, line: 43, baseType: !608, size: 192)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !316, line: 38, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !316, line: 32, size: 192, elements: !610)
!610 = !{!611, !612, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !609, file: !316, line: 35, baseType: !528, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !609, file: !316, line: 36, baseType: !528, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !609, file: !316, line: 37, baseType: !528, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !605, file: !316, line: 44, baseType: !608, size: 192, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !605, file: !316, line: 47, baseType: !616, size: 32, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !316, line: 30, baseType: !315)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !605, file: !316, line: 50, baseType: !501, size: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !492, file: !30, line: 262, baseType: !619, size: 64, offset: 4544)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !620, line: 26, baseType: !621)
!620 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!507, !624, !626, !629, !546}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !551)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !42, line: 150, baseType: !628)
!628 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !42, line: 151, baseType: !631)
!631 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !492, file: !30, line: 265, baseType: !546, size: 64, offset: 4608)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !492, file: !30, line: 266, baseType: !546, size: 64, offset: 4672)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !492, file: !30, line: 267, baseType: !546, size: 64, offset: 4736)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !492, file: !30, line: 270, baseType: !636, size: 64, offset: 4800)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !4, line: 52, baseType: !638)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !4, line: 51, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !492, file: !30, line: 273, baseType: !640, size: 64, offset: 4864)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !42, line: 217, baseType: !642)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !42, line: 217, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !492, file: !30, line: 276, baseType: !644, size: 32768, offset: 4928)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 32768, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 4096)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !492, file: !30, line: 277, baseType: !644, size: 32768, offset: 37696)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !492, file: !30, line: 278, baseType: !644, size: 32768, offset: 70464)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !492, file: !30, line: 281, baseType: !501, size: 64, offset: 103232)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !492, file: !30, line: 282, baseType: !501, size: 64, offset: 103296)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !492, file: !30, line: 285, baseType: !652, size: 448, offset: 103360)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !42, line: 219, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !322, line: 102, size: 448, elements: !654)
!654 = !{!655, !657, !659, !660, !661, !662, !663, !668}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !653, file: !322, line: 105, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !322, line: 100, baseType: !321)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !653, file: !322, line: 108, baseType: !658, size: 32, offset: 32)
!658 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !653, file: !322, line: 111, baseType: !550, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !653, file: !322, line: 112, baseType: !550, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !653, file: !322, line: 115, baseType: !546, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !653, file: !322, line: 118, baseType: !507, size: 32, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !653, file: !322, line: 121, baseType: !664, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !666, line: 26, baseType: !667)
!666 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !666, line: 25, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !653, file: !322, line: 124, baseType: !501, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !492, file: !30, line: 288, baseType: !507, size: 32, offset: 103808)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !492, file: !30, line: 291, baseType: !671, size: 64, offset: 103872)
!671 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !555)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !492, file: !30, line: 294, baseType: !664, size: 64, offset: 103936)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !492, file: !30, line: 297, baseType: !674, size: 256, offset: 104000)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !179, line: 40, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !179, line: 27, size: 256, elements: !676)
!676 = !{!677, !678, !679, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !179, line: 30, baseType: !550, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !675, file: !179, line: 33, baseType: !501, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !675, file: !179, line: 36, baseType: !680, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !675, file: !179, line: 39, baseType: !501, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !492, file: !30, line: 298, baseType: !674, size: 256, offset: 104256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !492, file: !30, line: 299, baseType: !685, size: 64, offset: 104512)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !492, file: !30, line: 302, baseType: !501, size: 64, offset: 104576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !492, file: !30, line: 305, baseType: !501, size: 64, offset: 104640)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !492, file: !30, line: 308, baseType: !588, size: 64, offset: 104704)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !492, file: !30, line: 309, baseType: !588, size: 64, offset: 104768)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !30, line: 310, baseType: !588, size: 64, offset: 104832)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !492, file: !30, line: 313, baseType: !692, size: 32, offset: 104896)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !492, file: !30, line: 316, baseType: !507, size: 32, offset: 104928)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !492, file: !30, line: 319, baseType: !515, size: 64, offset: 104960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !492, file: !30, line: 322, baseType: !588, size: 64, offset: 105024)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !492, file: !30, line: 325, baseType: !563, size: 256, offset: 105088)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !492, file: !30, line: 328, baseType: !546, size: 64, offset: 105344)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !492, file: !30, line: 329, baseType: !546, size: 64, offset: 105408)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !492, file: !30, line: 332, baseType: !700, size: 32, offset: 105472)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !30, line: 61, baseType: !104)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !492, file: !30, line: 335, baseType: !507, size: 32, offset: 105504)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !492, file: !30, line: 338, baseType: !630, size: 64, offset: 105536)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !492, file: !30, line: 341, baseType: !507, size: 32, offset: 105600)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !492, file: !30, line: 344, baseType: !501, size: 64, offset: 105664)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !492, file: !30, line: 347, baseType: !706, size: 64, offset: 105728)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !707, line: 7, baseType: !708)
!707 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !558, line: 160, baseType: !559)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !492, file: !30, line: 350, baseType: !710, size: 32, offset: 105792)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !492, file: !30, line: 353, baseType: !501, size: 64, offset: 105856)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !42, line: 223, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !30, line: 356, size: 134336, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !751, !752, !753, !754, !755, !756, !758, !759, !760, !761, !762, !763, !774, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !842, !843, !844}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !715, file: !30, line: 359, baseType: !499, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !715, file: !30, line: 362, baseType: !505, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !715, file: !30, line: 365, baseType: !507, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !715, file: !30, line: 366, baseType: !507, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !715, file: !30, line: 367, baseType: !507, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !715, file: !30, line: 368, baseType: !507, size: 32, offset: 160)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !715, file: !30, line: 371, baseType: !550, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !715, file: !30, line: 372, baseType: !550, size: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !715, file: !30, line: 373, baseType: !550, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !715, file: !30, line: 374, baseType: !550, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !715, file: !30, line: 377, baseType: !501, size: 64, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !715, file: !30, line: 378, baseType: !501, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !715, file: !30, line: 379, baseType: !501, size: 64, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !715, file: !30, line: 382, baseType: !578, size: 32, offset: 640)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !715, file: !30, line: 385, baseType: !580, size: 32, offset: 672)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !715, file: !30, line: 388, baseType: !548, size: 32, offset: 704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !715, file: !30, line: 391, baseType: !501, size: 64, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !715, file: !30, line: 394, baseType: !550, size: 64, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !715, file: !30, line: 395, baseType: !550, size: 64, offset: 896)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !715, file: !30, line: 396, baseType: !550, size: 64, offset: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !715, file: !30, line: 397, baseType: !550, size: 64, offset: 1024)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !715, file: !30, line: 398, baseType: !550, size: 64, offset: 1088)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !715, file: !30, line: 401, baseType: !528, size: 64, offset: 1152)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !715, file: !30, line: 402, baseType: !528, size: 64, offset: 1216)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !715, file: !30, line: 405, baseType: !515, size: 64, offset: 1280)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !715, file: !30, line: 406, baseType: !515, size: 64, offset: 1344)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !715, file: !30, line: 407, baseType: !515, size: 64, offset: 1408)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !715, file: !30, line: 410, baseType: !507, size: 32, offset: 1472)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !715, file: !30, line: 411, baseType: !507, size: 32, offset: 1504)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !715, file: !30, line: 414, baseType: !501, size: 64, offset: 1536)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !715, file: !30, line: 417, baseType: !497, size: 32, offset: 1600)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !30, line: 420, baseType: !700, size: 32, offset: 1632)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !715, file: !30, line: 423, baseType: !750, size: 32, offset: 1664)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !119, line: 59, baseType: !118)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !715, file: !30, line: 426, baseType: !555, size: 64, offset: 1728)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !715, file: !30, line: 429, baseType: !507, size: 32, offset: 1792)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !715, file: !30, line: 430, baseType: !507, size: 32, offset: 1824)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !715, file: !30, line: 433, baseType: !550, size: 64, offset: 1856)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !715, file: !30, line: 434, baseType: !550, size: 64, offset: 1920)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !715, file: !30, line: 437, baseType: !757, size: 32, offset: 1984)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !42, line: 202, baseType: !151)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !715, file: !30, line: 440, baseType: !490, size: 64, offset: 2048)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !715, file: !30, line: 443, baseType: !546, size: 64, offset: 2112)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !715, file: !30, line: 446, baseType: !619, size: 64, offset: 2176)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !715, file: !30, line: 449, baseType: !546, size: 64, offset: 2240)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !715, file: !30, line: 450, baseType: !546, size: 64, offset: 2304)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !715, file: !30, line: 453, baseType: !764, size: 64, offset: 2368)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !765, line: 26, baseType: !766)
!765 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!501, !769, !771, !773}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !715, file: !30, line: 456, baseType: !775, size: 64, offset: 2432)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !777, line: 7, baseType: !778)
!777 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !779, line: 49, size: 1728, elements: !780)
!779 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !796, !798, !799, !800, !802, !803, !805, !809, !812, !814, !817, !820, !821, !822, !823, !824}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !778, file: !779, line: 51, baseType: !658, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !778, file: !779, line: 54, baseType: !550, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !778, file: !779, line: 55, baseType: !550, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !778, file: !779, line: 56, baseType: !550, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !778, file: !779, line: 57, baseType: !550, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !778, file: !779, line: 58, baseType: !550, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !778, file: !779, line: 59, baseType: !550, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !778, file: !779, line: 60, baseType: !550, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !778, file: !779, line: 61, baseType: !550, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !778, file: !779, line: 64, baseType: !550, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !778, file: !779, line: 65, baseType: !550, size: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !778, file: !779, line: 66, baseType: !550, size: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !778, file: !779, line: 68, baseType: !794, size: 64, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !779, line: 36, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !778, file: !779, line: 70, baseType: !797, size: 64, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !778, file: !779, line: 72, baseType: !658, size: 32, offset: 896)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !778, file: !779, line: 73, baseType: !658, size: 32, offset: 928)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !778, file: !779, line: 74, baseType: !801, size: 64, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !558, line: 152, baseType: !559)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !778, file: !779, line: 77, baseType: !520, size: 16, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !778, file: !779, line: 78, baseType: !804, size: 8, offset: 1040)
!804 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !778, file: !779, line: 79, baseType: !806, size: 8, offset: 1048)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 8, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 1)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !778, file: !779, line: 81, baseType: !810, size: 64, offset: 1088)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !779, line: 43, baseType: null)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !778, file: !779, line: 89, baseType: !813, size: 64, offset: 1152)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !558, line: 153, baseType: !559)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !778, file: !779, line: 91, baseType: !815, size: 64, offset: 1216)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !779, line: 37, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !778, file: !779, line: 92, baseType: !818, size: 64, offset: 1280)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !779, line: 38, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !778, file: !779, line: 93, baseType: !797, size: 64, offset: 1344)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !778, file: !779, line: 94, baseType: !546, size: 64, offset: 1408)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !778, file: !779, line: 95, baseType: !501, size: 64, offset: 1472)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !778, file: !779, line: 96, baseType: !658, size: 32, offset: 1536)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !778, file: !779, line: 98, baseType: !825, size: 160, offset: 1568)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 160, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 20)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !715, file: !30, line: 459, baseType: !546, size: 64, offset: 2496)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !715, file: !30, line: 462, baseType: !501, size: 64, offset: 2560)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !715, file: !30, line: 465, baseType: !644, size: 32768, offset: 2624)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !715, file: !30, line: 466, baseType: !644, size: 32768, offset: 35392)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !715, file: !30, line: 467, baseType: !644, size: 32768, offset: 68160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !715, file: !30, line: 468, baseType: !644, size: 32768, offset: 100928)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !715, file: !30, line: 471, baseType: !507, size: 32, offset: 133696)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !715, file: !30, line: 474, baseType: !550, size: 64, offset: 133760)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !715, file: !30, line: 477, baseType: !501, size: 64, offset: 133824)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !715, file: !30, line: 478, baseType: !501, size: 64, offset: 133888)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !715, file: !30, line: 481, baseType: !515, size: 64, offset: 133952)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !715, file: !30, line: 484, baseType: !501, size: 64, offset: 134016)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !715, file: !30, line: 487, baseType: !841, size: 32, offset: 134080)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !715, file: !30, line: 490, baseType: !515, size: 64, offset: 134112)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !715, file: !30, line: 493, baseType: !546, size: 64, offset: 134208)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !715, file: !30, line: 496, baseType: !507, size: 32, offset: 134272)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !445, line: 46, baseType: !848)
!848 = !DISubroutineType(types: !849)
!849 = !{!507, !712, !490}
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !395, line: 129, baseType: !519)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !42, line: 78, baseType: !853)
!853 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!858 = !{i32 7, !"Dwarf Version", i32 5}
!859 = !{i32 2, !"Debug Info Version", i32 3}
!860 = !{i32 1, !"wchar_size", i32 4}
!861 = !{i32 7, !"PIC Level", i32 2}
!862 = !{i32 7, !"PIE Level", i32 2}
!863 = !{i32 7, !"uwtable", i32 2}
!864 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!865 = distinct !DISubprogram(name: "RegisterTGAImage", scope: !866, file: !866, line: 538, type: !867, scopeLine: 539, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !869)
!866 = !DIFile(filename: "apps/538.imagick_r/src/coders/tga.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15e59979782d13cd88d7288c680d9312")
!867 = !DISubroutineType(types: !868)
!868 = !{!501}
!869 = !{!870}
!870 = !DILocalVariable(name: "entry", scope: !865, file: !866, line: 541, type: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !445, line: 103, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !445, line: 51, size: 1216, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !882, !883, !884, !891, !892, !893, !894, !895, !896, !897, !899, !901, !902, !904, !905, !906, !907}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !873, file: !445, line: 54, baseType: !550, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !873, file: !445, line: 55, baseType: !550, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !873, file: !445, line: 56, baseType: !550, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !873, file: !445, line: 57, baseType: !550, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !873, file: !445, line: 58, baseType: !550, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !873, file: !445, line: 61, baseType: !881, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !873, file: !445, line: 64, baseType: !486, size: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !873, file: !445, line: 67, baseType: !846, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !873, file: !445, line: 70, baseType: !885, size: 64, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !445, line: 49, baseType: !887)
!887 = !DISubroutineType(types: !888)
!888 = !{!507, !889, !773}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !873, file: !445, line: 73, baseType: !546, size: 64, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !873, file: !445, line: 76, baseType: !507, size: 32, offset: 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !873, file: !445, line: 77, baseType: !507, size: 32, offset: 672)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !873, file: !445, line: 78, baseType: !507, size: 32, offset: 704)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !873, file: !445, line: 79, baseType: !507, size: 32, offset: 736)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !873, file: !445, line: 80, baseType: !507, size: 32, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !873, file: !445, line: 83, baseType: !898, size: 32, offset: 800)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !445, line: 33, baseType: !444)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !873, file: !445, line: 86, baseType: !900, size: 32, offset: 832)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !42, line: 147, baseType: !5)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !873, file: !445, line: 89, baseType: !507, size: 32, offset: 864)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !873, file: !445, line: 92, baseType: !903, size: 64, offset: 896)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !873, file: !445, line: 93, baseType: !903, size: 64, offset: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !873, file: !445, line: 96, baseType: !501, size: 64, offset: 1024)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !873, file: !445, line: 99, baseType: !550, size: 64, offset: 1088)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !873, file: !445, line: 102, baseType: !664, size: 64, offset: 1152)
!908 = !DILocation(line: 543, column: 9, scope: !865)
!909 = !DILocation(line: 0, scope: !865)
!910 = !DILocation(line: 544, column: 10, scope: !865)
!911 = !DILocation(line: 544, column: 17, scope: !865)
!912 = !{!913, !914, i64 48}
!913 = !{!"_MagickInfo", !914, i64 0, !914, i64 8, !914, i64 16, !914, i64 24, !914, i64 32, !914, i64 40, !914, i64 48, !914, i64 56, !914, i64 64, !914, i64 72, !915, i64 80, !915, i64 84, !915, i64 88, !915, i64 92, !915, i64 96, !915, i64 100, !917, i64 104, !915, i64 108, !914, i64 112, !914, i64 120, !918, i64 128, !914, i64 136, !914, i64 144}
!914 = !{!"any pointer", !915, i64 0}
!915 = !{!"omnipotent char", !916, i64 0}
!916 = !{!"Simple C/C++ TBAA"}
!917 = !{!"int", !915, i64 0}
!918 = !{!"long", !915, i64 0}
!919 = !DILocation(line: 545, column: 10, scope: !865)
!920 = !DILocation(line: 545, column: 17, scope: !865)
!921 = !{!913, !914, i64 56}
!922 = !DILocation(line: 546, column: 10, scope: !865)
!923 = !DILocation(line: 546, column: 16, scope: !865)
!924 = !{!913, !915, i64 80}
!925 = !DILocation(line: 547, column: 22, scope: !865)
!926 = !DILocation(line: 547, column: 10, scope: !865)
!927 = !DILocation(line: 547, column: 21, scope: !865)
!928 = !{!913, !914, i64 8}
!929 = !DILocation(line: 548, column: 17, scope: !865)
!930 = !DILocation(line: 548, column: 10, scope: !865)
!931 = !DILocation(line: 548, column: 16, scope: !865)
!932 = !{!913, !914, i64 32}
!933 = !DILocation(line: 549, column: 10, scope: !865)
!934 = !DILocation(line: 550, column: 9, scope: !865)
!935 = !DILocation(line: 551, column: 10, scope: !865)
!936 = !DILocation(line: 551, column: 17, scope: !865)
!937 = !DILocation(line: 552, column: 10, scope: !865)
!938 = !DILocation(line: 552, column: 17, scope: !865)
!939 = !DILocation(line: 553, column: 10, scope: !865)
!940 = !DILocation(line: 553, column: 16, scope: !865)
!941 = !DILocation(line: 554, column: 22, scope: !865)
!942 = !DILocation(line: 554, column: 10, scope: !865)
!943 = !DILocation(line: 554, column: 21, scope: !865)
!944 = !DILocation(line: 555, column: 17, scope: !865)
!945 = !DILocation(line: 555, column: 10, scope: !865)
!946 = !DILocation(line: 555, column: 16, scope: !865)
!947 = !DILocation(line: 556, column: 10, scope: !865)
!948 = !DILocation(line: 557, column: 9, scope: !865)
!949 = !DILocation(line: 558, column: 10, scope: !865)
!950 = !DILocation(line: 558, column: 17, scope: !865)
!951 = !DILocation(line: 559, column: 10, scope: !865)
!952 = !DILocation(line: 559, column: 17, scope: !865)
!953 = !DILocation(line: 560, column: 10, scope: !865)
!954 = !DILocation(line: 560, column: 16, scope: !865)
!955 = !DILocation(line: 561, column: 22, scope: !865)
!956 = !DILocation(line: 561, column: 10, scope: !865)
!957 = !DILocation(line: 561, column: 21, scope: !865)
!958 = !DILocation(line: 562, column: 17, scope: !865)
!959 = !DILocation(line: 562, column: 10, scope: !865)
!960 = !DILocation(line: 562, column: 16, scope: !865)
!961 = !DILocation(line: 563, column: 10, scope: !865)
!962 = !DILocation(line: 564, column: 9, scope: !865)
!963 = !DILocation(line: 565, column: 10, scope: !865)
!964 = !DILocation(line: 565, column: 17, scope: !865)
!965 = !DILocation(line: 566, column: 10, scope: !865)
!966 = !DILocation(line: 566, column: 17, scope: !865)
!967 = !DILocation(line: 567, column: 10, scope: !865)
!968 = !DILocation(line: 567, column: 16, scope: !865)
!969 = !DILocation(line: 568, column: 22, scope: !865)
!970 = !DILocation(line: 568, column: 10, scope: !865)
!971 = !DILocation(line: 568, column: 21, scope: !865)
!972 = !DILocation(line: 569, column: 17, scope: !865)
!973 = !DILocation(line: 569, column: 10, scope: !865)
!974 = !DILocation(line: 569, column: 16, scope: !865)
!975 = !DILocation(line: 570, column: 10, scope: !865)
!976 = !DILocation(line: 571, column: 3, scope: !865)
!977 = !DISubprogram(name: "SetMagickInfo", scope: !445, file: !445, line: 139, type: !978, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !980)
!978 = !DISubroutineType(types: !979)
!979 = !{!871, !624}
!980 = !{}
!981 = distinct !DISubprogram(name: "ReadTGAImage", scope: !866, file: !866, line: 100, type: !488, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !982)
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1016, !1017, !1018, !1022, !1023, !1024, !1029, !1032, !1033, !1042, !1052}
!983 = !DILocalVariable(name: "image_info", arg: 1, scope: !981, file: !866, line: 100, type: !712)
!984 = !DILocalVariable(name: "exception", arg: 2, scope: !981, file: !866, line: 100, type: !845)
!985 = !DILocalVariable(name: "image", scope: !981, file: !866, line: 135, type: !490)
!986 = !DILocalVariable(name: "index", scope: !981, file: !866, line: 138, type: !850)
!987 = !DILocalVariable(name: "status", scope: !981, file: !866, line: 141, type: !507)
!988 = !DILocalVariable(name: "pixel", scope: !981, file: !866, line: 144, type: !515)
!989 = !DILocalVariable(name: "indexes", scope: !981, file: !866, line: 147, type: !851)
!990 = !DILocalVariable(name: "q", scope: !981, file: !866, line: 150, type: !514)
!991 = !DILocalVariable(name: "i", scope: !981, file: !866, line: 153, type: !555)
!992 = !DILocalVariable(name: "x", scope: !981, file: !866, line: 154, type: !555)
!993 = !DILocalVariable(name: "base", scope: !981, file: !866, line: 157, type: !501)
!994 = !DILocalVariable(name: "flag", scope: !981, file: !866, line: 158, type: !501)
!995 = !DILocalVariable(name: "offset", scope: !981, file: !866, line: 159, type: !501)
!996 = !DILocalVariable(name: "real", scope: !981, file: !866, line: 160, type: !501)
!997 = !DILocalVariable(name: "skip", scope: !981, file: !866, line: 161, type: !501)
!998 = !DILocalVariable(name: "count", scope: !981, file: !866, line: 164, type: !555)
!999 = !DILocalVariable(name: "y", scope: !981, file: !866, line: 165, type: !555)
!1000 = !DILocalVariable(name: "tga_info", scope: !981, file: !866, line: 168, type: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "TGAInfo", scope: !981, file: !866, line: 132, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TGAInfo", scope: !981, file: !866, line: 109, size: 160, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "id_length", scope: !1002, file: !866, line: 112, baseType: !681, size: 8)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_type", scope: !1002, file: !866, line: 113, baseType: !681, size: 8, offset: 8)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "image_type", scope: !1002, file: !866, line: 114, baseType: !681, size: 8, offset: 16)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_index", scope: !1002, file: !866, line: 117, baseType: !520, size: 16, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_length", scope: !1002, file: !866, line: 118, baseType: !520, size: 16, offset: 48)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_size", scope: !1002, file: !866, line: 121, baseType: !681, size: 8, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "x_origin", scope: !1002, file: !866, line: 124, baseType: !520, size: 16, offset: 80)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "y_origin", scope: !1002, file: !866, line: 125, baseType: !520, size: 16, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1002, file: !866, line: 126, baseType: !520, size: 16, offset: 112)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1002, file: !866, line: 127, baseType: !520, size: 16, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !1002, file: !866, line: 130, baseType: !681, size: 8, offset: 144)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1002, file: !866, line: 131, baseType: !681, size: 8, offset: 152)
!1016 = !DILocalVariable(name: "j", scope: !981, file: !866, line: 171, type: !681)
!1017 = !DILocalVariable(name: "k", scope: !981, file: !866, line: 172, type: !681)
!1018 = !DILocalVariable(name: "pixels", scope: !981, file: !866, line: 173, type: !1019)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 32, elements: !1020)
!1020 = !{!1021}
!1021 = !DISubrange(count: 4)
!1022 = !DILocalVariable(name: "runlength", scope: !981, file: !866, line: 174, type: !681)
!1023 = !DILocalVariable(name: "alpha_bits", scope: !981, file: !866, line: 177, type: !5)
!1024 = !DILocalVariable(name: "one", scope: !1025, file: !866, line: 262, type: !501)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !866, line: 260, column: 9)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !866, line: 257, column: 11)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !866, line: 256, column: 5)
!1028 = distinct !DILexicalBlock(scope: !981, file: !866, line: 255, column: 7)
!1029 = !DILocalVariable(name: "comment", scope: !1030, file: !866, line: 273, type: !550)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !866, line: 271, column: 5)
!1031 = distinct !DILexicalBlock(scope: !981, file: !866, line: 270, column: 7)
!1032 = !DILocalVariable(name: "length", scope: !1030, file: !866, line: 276, type: !501)
!1033 = !DILocalVariable(name: "range", scope: !1034, file: !866, line: 321, type: !1041)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !866, line: 319, column: 11)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !866, line: 305, column: 9)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !866, line: 303, column: 7)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !866, line: 302, column: 7)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !866, line: 302, column: 7)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !866, line: 296, column: 5)
!1040 = distinct !DILexicalBlock(scope: !981, file: !866, line: 295, column: 7)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAny", file: !42, line: 170, baseType: !630)
!1042 = !DILocalVariable(name: "range", scope: !1043, file: !866, line: 427, type: !1041)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !866, line: 425, column: 11)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !866, line: 404, column: 9)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !866, line: 402, column: 11)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !866, line: 381, column: 5)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !866, line: 380, column: 5)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !866, line: 380, column: 5)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !866, line: 372, column: 3)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !866, line: 371, column: 3)
!1051 = distinct !DILexicalBlock(scope: !981, file: !866, line: 371, column: 3)
!1052 = !DILocalVariable(name: "message", scope: !1053, file: !866, line: 509, type: !550)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !866, line: 509, column: 5)
!1054 = distinct !DILexicalBlock(scope: !981, file: !866, line: 508, column: 7)
!1055 = !DILocation(line: 0, scope: !981)
!1056 = !DILocation(line: 143, column: 3, scope: !981)
!1057 = !DILocation(line: 144, column: 5, scope: !981)
!1058 = !DILocation(line: 167, column: 3, scope: !981)
!1059 = !DILocation(line: 168, column: 5, scope: !981)
!1060 = !DILocation(line: 170, column: 3, scope: !981)
!1061 = !DILocation(line: 173, column: 5, scope: !981)
!1062 = !DILocation(line: 184, column: 19, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !981, file: !866, line: 184, column: 7)
!1064 = !{!1065, !915, i64 16712}
!1065 = !{!"_ImageInfo", !915, i64 0, !915, i64 4, !915, i64 8, !915, i64 12, !915, i64 16, !915, i64 20, !914, i64 24, !914, i64 32, !914, i64 40, !914, i64 48, !918, i64 56, !918, i64 64, !918, i64 72, !915, i64 80, !915, i64 84, !915, i64 88, !918, i64 96, !914, i64 104, !914, i64 112, !914, i64 120, !914, i64 128, !914, i64 136, !1066, i64 144, !1066, i64 152, !1067, i64 160, !1067, i64 168, !1067, i64 176, !915, i64 184, !915, i64 188, !918, i64 192, !915, i64 200, !915, i64 204, !915, i64 208, !918, i64 216, !915, i64 224, !915, i64 228, !914, i64 232, !914, i64 240, !915, i64 248, !914, i64 256, !914, i64 264, !914, i64 272, !914, i64 280, !914, i64 288, !914, i64 296, !914, i64 304, !914, i64 312, !918, i64 320, !915, i64 328, !915, i64 4424, !915, i64 8520, !915, i64 12616, !915, i64 16712, !914, i64 16720, !918, i64 16728, !918, i64 16736, !1067, i64 16744, !918, i64 16752, !915, i64 16760, !1067, i64 16764, !914, i64 16776, !915, i64 16784}
!1066 = !{!"double", !915, i64 0}
!1067 = !{!"_PixelPacket", !1068, i64 0, !1068, i64 2, !1068, i64 4, !1068, i64 6}
!1068 = !{!"short", !915, i64 0}
!1069 = !DILocation(line: 184, column: 25, scope: !1063)
!1070 = !DILocation(line: 184, column: 7, scope: !981)
!1071 = !DILocation(line: 186, column: 19, scope: !1063)
!1072 = !DILocation(line: 185, column: 12, scope: !1063)
!1073 = !DILocation(line: 185, column: 5, scope: !1063)
!1074 = !DILocation(line: 189, column: 9, scope: !981)
!1075 = !DILocation(line: 190, column: 10, scope: !981)
!1076 = !DILocation(line: 191, column: 14, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !981, file: !866, line: 191, column: 7)
!1078 = !DILocation(line: 191, column: 7, scope: !981)
!1079 = !DILocation(line: 193, column: 13, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1077, file: !866, line: 192, column: 5)
!1081 = !DILocation(line: 194, column: 7, scope: !1080)
!1082 = !DILocation(line: 199, column: 9, scope: !981)
!1083 = !DILocation(line: 200, column: 42, scope: !981)
!1084 = !DILocation(line: 200, column: 26, scope: !981)
!1085 = !DILocation(line: 200, column: 12, scope: !981)
!1086 = !DILocation(line: 200, column: 25, scope: !981)
!1087 = !{!1088, !915, i64 1}
!1088 = !{!"_TGAInfo", !915, i64 0, !915, i64 1, !915, i64 2, !1068, i64 4, !1068, i64 6, !915, i64 8, !1068, i64 10, !1068, i64 12, !1068, i64 14, !1068, i64 16, !915, i64 18, !915, i64 19}
!1089 = !DILocation(line: 201, column: 39, scope: !981)
!1090 = !DILocation(line: 201, column: 23, scope: !981)
!1091 = !DILocation(line: 201, column: 12, scope: !981)
!1092 = !DILocation(line: 201, column: 22, scope: !981)
!1093 = !{!1088, !915, i64 2}
!1094 = !DILocation(line: 202, column: 14, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !981, file: !866, line: 202, column: 7)
!1096 = !DILocation(line: 202, column: 20, scope: !1095)
!1097 = !DILocation(line: 203, column: 45, scope: !1095)
!1098 = !DILocation(line: 209, column: 46, scope: !1095)
!1099 = !DILocation(line: 212, column: 5, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1095, file: !866, line: 212, column: 5)
!1101 = !DILocation(line: 212, column: 5, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1100, file: !866, line: 212, column: 5)
!1103 = !DILocation(line: 212, column: 5, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1102, file: !866, line: 212, column: 5)
!1105 = !DILocation(line: 213, column: 27, scope: !981)
!1106 = !DILocation(line: 213, column: 12, scope: !981)
!1107 = !DILocation(line: 213, column: 26, scope: !981)
!1108 = !{!1088, !1068, i64 4}
!1109 = !DILocation(line: 214, column: 28, scope: !981)
!1110 = !DILocation(line: 214, column: 12, scope: !981)
!1111 = !DILocation(line: 214, column: 27, scope: !981)
!1112 = !{!1088, !1068, i64 6}
!1113 = !DILocation(line: 215, column: 42, scope: !981)
!1114 = !DILocation(line: 215, column: 26, scope: !981)
!1115 = !DILocation(line: 215, column: 12, scope: !981)
!1116 = !DILocation(line: 215, column: 25, scope: !981)
!1117 = !{!1088, !915, i64 8}
!1118 = !DILocation(line: 216, column: 21, scope: !981)
!1119 = !DILocation(line: 216, column: 12, scope: !981)
!1120 = !DILocation(line: 216, column: 20, scope: !981)
!1121 = !{!1088, !1068, i64 10}
!1122 = !DILocation(line: 217, column: 21, scope: !981)
!1123 = !DILocation(line: 217, column: 12, scope: !981)
!1124 = !DILocation(line: 217, column: 20, scope: !981)
!1125 = !{!1088, !1068, i64 12}
!1126 = !DILocation(line: 218, column: 35, scope: !981)
!1127 = !DILocation(line: 218, column: 12, scope: !981)
!1128 = !DILocation(line: 218, column: 17, scope: !981)
!1129 = !{!1088, !1068, i64 14}
!1130 = !DILocation(line: 219, column: 36, scope: !981)
!1131 = !DILocation(line: 219, column: 12, scope: !981)
!1132 = !DILocation(line: 219, column: 18, scope: !981)
!1133 = !{!1088, !1068, i64 16}
!1134 = !DILocation(line: 220, column: 43, scope: !981)
!1135 = !DILocation(line: 220, column: 27, scope: !981)
!1136 = !DILocation(line: 220, column: 12, scope: !981)
!1137 = !DILocation(line: 220, column: 26, scope: !981)
!1138 = !{!1088, !915, i64 18}
!1139 = !DILocation(line: 221, column: 39, scope: !981)
!1140 = !DILocation(line: 221, column: 23, scope: !981)
!1141 = !DILocation(line: 221, column: 12, scope: !981)
!1142 = !DILocation(line: 221, column: 22, scope: !981)
!1143 = !{!1088, !915, i64 19}
!1144 = !DILocation(line: 222, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !981, file: !866, line: 222, column: 7)
!1146 = !DILocation(line: 222, column: 22, scope: !1145)
!1147 = !DILocation(line: 222, column: 7, scope: !981)
!1148 = !DILocation(line: 223, column: 5, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1145, file: !866, line: 223, column: 5)
!1150 = !DILocation(line: 223, column: 5, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1149, file: !866, line: 223, column: 5)
!1152 = !DILocation(line: 223, column: 5, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1151, file: !866, line: 223, column: 5)
!1154 = !DILocation(line: 224, column: 19, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !981, file: !866, line: 224, column: 7)
!1156 = !DILocation(line: 224, column: 40, scope: !1155)
!1157 = !DILocation(line: 226, column: 5, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1155, file: !866, line: 226, column: 5)
!1159 = !DILocation(line: 226, column: 5, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1158, file: !866, line: 226, column: 5)
!1161 = !DILocation(line: 226, column: 5, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1160, file: !866, line: 226, column: 5)
!1163 = !DILocation(line: 230, column: 27, scope: !981)
!1164 = !DILocation(line: 230, column: 18, scope: !981)
!1165 = !DILocation(line: 230, column: 10, scope: !981)
!1166 = !DILocation(line: 230, column: 17, scope: !981)
!1167 = !{!1168, !918, i64 40}
!1168 = !{!"_Image", !915, i64 0, !915, i64 4, !915, i64 8, !918, i64 16, !915, i64 24, !915, i64 28, !915, i64 32, !918, i64 40, !918, i64 48, !918, i64 56, !918, i64 64, !914, i64 72, !1067, i64 80, !1067, i64 88, !1067, i64 96, !1066, i64 104, !1169, i64 112, !915, i64 208, !914, i64 216, !915, i64 224, !914, i64 232, !914, i64 240, !914, i64 248, !918, i64 256, !1066, i64 264, !1066, i64 272, !1171, i64 280, !1171, i64 312, !1171, i64 344, !1066, i64 376, !1066, i64 384, !1066, i64 392, !915, i64 400, !915, i64 404, !915, i64 408, !915, i64 412, !915, i64 416, !915, i64 420, !914, i64 424, !918, i64 432, !918, i64 440, !918, i64 448, !918, i64 456, !918, i64 464, !918, i64 472, !1172, i64 480, !1173, i64 504, !914, i64 568, !914, i64 576, !914, i64 584, !914, i64 592, !914, i64 600, !914, i64 608, !915, i64 616, !915, i64 4712, !915, i64 8808, !918, i64 12904, !918, i64 12912, !1175, i64 12920, !915, i64 12976, !918, i64 12984, !914, i64 12992, !1176, i64 13000, !1176, i64 13032, !914, i64 13064, !918, i64 13072, !918, i64 13080, !914, i64 13088, !914, i64 13096, !914, i64 13104, !915, i64 13112, !915, i64 13116, !1067, i64 13120, !914, i64 13128, !1171, i64 13136, !914, i64 13168, !914, i64 13176, !915, i64 13184, !915, i64 13188, !1177, i64 13192, !915, i64 13200, !918, i64 13208, !918, i64 13216, !915, i64 13224, !918, i64 13232}
!1169 = !{!"_ChromaticityInfo", !1170, i64 0, !1170, i64 24, !1170, i64 48, !1170, i64 72}
!1170 = !{!"_PrimaryInfo", !1066, i64 0, !1066, i64 8, !1066, i64 16}
!1171 = !{!"_RectangleInfo", !918, i64 0, !918, i64 8, !918, i64 16, !918, i64 24}
!1172 = !{!"_ErrorInfo", !1066, i64 0, !1066, i64 8, !1066, i64 16}
!1173 = !{!"_TimerInfo", !1174, i64 0, !1174, i64 24, !915, i64 48, !918, i64 56}
!1174 = !{!"_Timer", !1066, i64 0, !1066, i64 8, !1066, i64 16}
!1175 = !{!"_ExceptionInfo", !915, i64 0, !917, i64 4, !914, i64 8, !914, i64 16, !914, i64 24, !915, i64 32, !914, i64 40, !918, i64 48}
!1176 = !{!"_ProfileInfo", !914, i64 0, !918, i64 8, !914, i64 16, !918, i64 24}
!1177 = !{!"long long", !915, i64 0}
!1178 = !DILocation(line: 231, column: 24, scope: !981)
!1179 = !DILocation(line: 231, column: 15, scope: !981)
!1180 = !DILocation(line: 231, column: 10, scope: !981)
!1181 = !DILocation(line: 231, column: 14, scope: !981)
!1182 = !{!1168, !918, i64 48}
!1183 = !DILocation(line: 232, column: 24, scope: !981)
!1184 = !DILocation(line: 232, column: 35, scope: !981)
!1185 = !DILocation(line: 233, column: 28, scope: !981)
!1186 = !DILocation(line: 233, column: 33, scope: !981)
!1187 = !DILocation(line: 234, column: 15, scope: !981)
!1188 = !DILocation(line: 234, column: 29, scope: !981)
!1189 = !DILocation(line: 233, column: 68, scope: !981)
!1190 = !DILocation(line: 233, column: 16, scope: !981)
!1191 = !DILocation(line: 233, column: 10, scope: !981)
!1192 = !DILocation(line: 233, column: 15, scope: !981)
!1193 = !{!1168, !915, i64 32}
!1194 = !DILocation(line: 235, column: 17, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !981, file: !866, line: 235, column: 7)
!1196 = !DILocation(line: 235, column: 44, scope: !1195)
!1197 = !DILocation(line: 237, column: 53, scope: !1195)
!1198 = !DILocation(line: 237, column: 28, scope: !1195)
!1199 = !DILocation(line: 238, column: 32, scope: !1195)
!1200 = !DILocation(line: 238, column: 7, scope: !1195)
!1201 = !DILocation(line: 242, column: 38, scope: !1195)
!1202 = !DILocation(line: 242, column: 52, scope: !1195)
!1203 = !DILocation(line: 242, column: 28, scope: !1195)
!1204 = !DILocation(line: 243, column: 31, scope: !1195)
!1205 = !DILocation(line: 243, column: 7, scope: !1195)
!1206 = !DILocation(line: 0, scope: !1195)
!1207 = !{!1168, !918, i64 56}
!1208 = !DILocation(line: 246, column: 44, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !981, file: !866, line: 246, column: 7)
!1210 = !DILocation(line: 250, column: 25, scope: !1209)
!1211 = !{!1168, !915, i64 0}
!1212 = !DILocation(line: 251, column: 10, scope: !981)
!1213 = !DILocation(line: 252, column: 47, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !981, file: !866, line: 252, column: 7)
!1215 = !DILocation(line: 0, scope: !1214)
!1216 = !DILocation(line: 255, column: 7, scope: !981)
!1217 = !DILocation(line: 255, column: 14, scope: !1028)
!1218 = !DILocation(line: 255, column: 28, scope: !1028)
!1219 = !DILocation(line: 257, column: 20, scope: !1026)
!1220 = !DILocation(line: 257, column: 34, scope: !1026)
!1221 = !DILocation(line: 257, column: 11, scope: !1027)
!1222 = !DILocation(line: 258, column: 32, scope: !1026)
!1223 = !DILocation(line: 258, column: 23, scope: !1026)
!1224 = !DILocation(line: 258, column: 16, scope: !1026)
!1225 = !DILocation(line: 258, column: 22, scope: !1026)
!1226 = !{!1168, !918, i64 64}
!1227 = !DILocation(line: 258, column: 9, scope: !1026)
!1228 = !DILocation(line: 0, scope: !1025)
!1229 = !DILocation(line: 265, column: 41, scope: !1025)
!1230 = !DILocation(line: 265, column: 29, scope: !1025)
!1231 = !DILocation(line: 265, column: 18, scope: !1025)
!1232 = !DILocation(line: 265, column: 24, scope: !1025)
!1233 = !DILocation(line: 266, column: 15, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1025, file: !866, line: 266, column: 15)
!1235 = !DILocation(line: 266, column: 57, scope: !1234)
!1236 = !DILocation(line: 266, column: 15, scope: !1025)
!1237 = !DILocation(line: 267, column: 13, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1234, file: !866, line: 267, column: 13)
!1239 = !DILocation(line: 267, column: 13, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1241, file: !866, line: 267, column: 13)
!1241 = distinct !DILexicalBlock(scope: !1238, file: !866, line: 267, column: 13)
!1242 = !DILocation(line: 270, column: 16, scope: !1031)
!1243 = !{!1088, !915, i64 0}
!1244 = !DILocation(line: 270, column: 26, scope: !1031)
!1245 = !DILocation(line: 270, column: 7, scope: !981)
!1246 = !DILocation(line: 0, scope: !1030)
!1247 = !DILocation(line: 281, column: 14, scope: !1030)
!1248 = !DILocation(line: 284, column: 53, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1030, file: !866, line: 283, column: 11)
!1250 = !DILocation(line: 284, column: 26, scope: !1249)
!1251 = !DILocation(line: 286, column: 19, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1030, file: !866, line: 286, column: 11)
!1253 = !DILocation(line: 286, column: 11, scope: !1030)
!1254 = !DILocation(line: 287, column: 9, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1252, file: !866, line: 287, column: 9)
!1256 = !DILocation(line: 287, column: 9, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1258, file: !866, line: 287, column: 9)
!1258 = distinct !DILexicalBlock(scope: !1255, file: !866, line: 287, column: 9)
!1259 = !DILocation(line: 288, column: 37, scope: !1030)
!1260 = !DILocation(line: 288, column: 28, scope: !1030)
!1261 = !DILocation(line: 288, column: 13, scope: !1030)
!1262 = !DILocation(line: 289, column: 24, scope: !1030)
!1263 = !DILocation(line: 289, column: 7, scope: !1030)
!1264 = !DILocation(line: 289, column: 34, scope: !1030)
!1265 = !{!915, !915, i64 0}
!1266 = !DILocation(line: 290, column: 14, scope: !1030)
!1267 = !DILocation(line: 291, column: 15, scope: !1030)
!1268 = !DILocation(line: 293, column: 10, scope: !981)
!1269 = !DILocation(line: 294, column: 9, scope: !981)
!1270 = !DILocation(line: 294, column: 16, scope: !981)
!1271 = !{!1067, !1068, i64 6}
!1272 = !DILocation(line: 295, column: 16, scope: !1040)
!1273 = !DILocation(line: 295, column: 30, scope: !1040)
!1274 = !DILocation(line: 295, column: 7, scope: !981)
!1275 = !DILocation(line: 300, column: 45, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1039, file: !866, line: 300, column: 11)
!1277 = !DILocation(line: 300, column: 11, scope: !1276)
!1278 = !DILocation(line: 300, column: 53, scope: !1276)
!1279 = !DILocation(line: 300, column: 11, scope: !1039)
!1280 = !DILocation(line: 302, column: 38, scope: !1037)
!1281 = !DILocation(line: 302, column: 19, scope: !1037)
!1282 = !DILocation(line: 302, column: 7, scope: !1038)
!1283 = !DILocation(line: 301, column: 9, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1276, file: !866, line: 301, column: 9)
!1285 = !DILocation(line: 301, column: 9, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1287, file: !866, line: 301, column: 9)
!1287 = distinct !DILexicalBlock(scope: !1284, file: !866, line: 301, column: 9)
!1288 = !DILocation(line: 304, column: 26, scope: !1036)
!1289 = !DILocation(line: 304, column: 9, scope: !1036)
!1290 = !DILocation(line: 312, column: 58, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1035, file: !866, line: 308, column: 11)
!1292 = !DILocation(line: 312, column: 42, scope: !1291)
!1293 = !DILocation(line: 366, column: 26, scope: !1294, inlinedAt: !1300)
!1294 = distinct !DISubprogram(name: "ScaleCharToQuantum", scope: !1295, file: !1295, line: 363, type: !1296, scopeLine: 364, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1298)
!1295 = !DIFile(filename: "apps/538.imagick_r/src/magick/quantum-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f56ff413af29c367aaef7b4fe7af9628")
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!519, !890}
!1298 = !{!1299}
!1299 = !DILocalVariable(name: "value", arg: 1, scope: !1294, file: !1295, line: 363, type: !890)
!1300 = distinct !DILocation(line: 312, column: 23, scope: !1291)
!1301 = !DILocation(line: 0, scope: !1294, inlinedAt: !1300)
!1302 = !DILocation(line: 366, column: 25, scope: !1294, inlinedAt: !1300)
!1303 = !DILocation(line: 312, column: 22, scope: !1291)
!1304 = !{!1067, !1068, i64 4}
!1305 = !DILocation(line: 313, column: 24, scope: !1291)
!1306 = !{!1067, !1068, i64 2}
!1307 = !DILocation(line: 314, column: 23, scope: !1291)
!1308 = !{!1067, !1068, i64 0}
!1309 = !DILocation(line: 315, column: 13, scope: !1291)
!1310 = !DILocation(line: 326, column: 31, scope: !1034)
!1311 = !DILocation(line: 327, column: 31, scope: !1034)
!1312 = !DILocation(line: 0, scope: !1034)
!1313 = !DILocation(line: 329, column: 56, scope: !1034)
!1314 = !DILocalVariable(name: "quantum", arg: 1, scope: !1315, file: !1295, line: 271, type: !1318)
!1315 = distinct !DISubprogram(name: "ScaleAnyToQuantum", scope: !1295, file: !1295, line: 271, type: !1316, scopeLine: 273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1319)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!519, !1318, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1319 = !{!1314, !1320}
!1320 = !DILocalVariable(name: "range", arg: 2, scope: !1315, file: !1295, line: 272, type: !1318)
!1321 = !DILocation(line: 0, scope: !1315, inlinedAt: !1322)
!1322 = distinct !DILocation(line: 329, column: 23, scope: !1034)
!1323 = !DILocation(line: 275, column: 52, scope: !1315, inlinedAt: !1322)
!1324 = !DILocation(line: 275, column: 51, scope: !1315, inlinedAt: !1322)
!1325 = !DILocation(line: 275, column: 60, scope: !1315, inlinedAt: !1322)
!1326 = !DILocation(line: 275, column: 21, scope: !1315, inlinedAt: !1322)
!1327 = !DILocation(line: 275, column: 66, scope: !1315, inlinedAt: !1322)
!1328 = !DILocation(line: 275, column: 10, scope: !1315, inlinedAt: !1322)
!1329 = !DILocation(line: 329, column: 22, scope: !1034)
!1330 = !DILocation(line: 330, column: 59, scope: !1034)
!1331 = !DILocation(line: 331, column: 31, scope: !1034)
!1332 = !DILocation(line: 330, column: 64, scope: !1034)
!1333 = !DILocation(line: 0, scope: !1315, inlinedAt: !1334)
!1334 = distinct !DILocation(line: 330, column: 25, scope: !1034)
!1335 = !DILocation(line: 275, column: 52, scope: !1315, inlinedAt: !1334)
!1336 = !DILocation(line: 275, column: 51, scope: !1315, inlinedAt: !1334)
!1337 = !DILocation(line: 275, column: 60, scope: !1315, inlinedAt: !1334)
!1338 = !DILocation(line: 275, column: 21, scope: !1315, inlinedAt: !1334)
!1339 = !DILocation(line: 275, column: 66, scope: !1315, inlinedAt: !1334)
!1340 = !DILocation(line: 275, column: 10, scope: !1315, inlinedAt: !1334)
!1341 = !DILocation(line: 330, column: 24, scope: !1034)
!1342 = !DILocation(line: 332, column: 49, scope: !1034)
!1343 = !DILocation(line: 0, scope: !1315, inlinedAt: !1344)
!1344 = distinct !DILocation(line: 332, column: 24, scope: !1034)
!1345 = !DILocation(line: 275, column: 52, scope: !1315, inlinedAt: !1344)
!1346 = !DILocation(line: 275, column: 51, scope: !1315, inlinedAt: !1344)
!1347 = !DILocation(line: 275, column: 60, scope: !1315, inlinedAt: !1344)
!1348 = !DILocation(line: 275, column: 21, scope: !1315, inlinedAt: !1344)
!1349 = !DILocation(line: 275, column: 66, scope: !1315, inlinedAt: !1344)
!1350 = !DILocation(line: 275, column: 10, scope: !1315, inlinedAt: !1344)
!1351 = !DILocation(line: 332, column: 23, scope: !1034)
!1352 = !DILocation(line: 340, column: 59, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1035, file: !866, line: 336, column: 11)
!1354 = !DILocation(line: 340, column: 43, scope: !1353)
!1355 = !DILocation(line: 366, column: 26, scope: !1294, inlinedAt: !1356)
!1356 = distinct !DILocation(line: 340, column: 24, scope: !1353)
!1357 = !DILocation(line: 0, scope: !1294, inlinedAt: !1356)
!1358 = !DILocation(line: 366, column: 25, scope: !1294, inlinedAt: !1356)
!1359 = !DILocation(line: 340, column: 23, scope: !1353)
!1360 = !DILocation(line: 341, column: 60, scope: !1353)
!1361 = !DILocation(line: 341, column: 44, scope: !1353)
!1362 = !DILocation(line: 366, column: 26, scope: !1294, inlinedAt: !1363)
!1363 = distinct !DILocation(line: 341, column: 25, scope: !1353)
!1364 = !DILocation(line: 0, scope: !1294, inlinedAt: !1363)
!1365 = !DILocation(line: 366, column: 25, scope: !1294, inlinedAt: !1363)
!1366 = !DILocation(line: 341, column: 24, scope: !1353)
!1367 = !DILocation(line: 342, column: 58, scope: !1353)
!1368 = !DILocation(line: 342, column: 42, scope: !1353)
!1369 = !DILocation(line: 366, column: 26, scope: !1294, inlinedAt: !1370)
!1370 = distinct !DILocation(line: 342, column: 23, scope: !1353)
!1371 = !DILocation(line: 0, scope: !1294, inlinedAt: !1370)
!1372 = !DILocation(line: 366, column: 25, scope: !1294, inlinedAt: !1370)
!1373 = !DILocation(line: 342, column: 22, scope: !1353)
!1374 = !DILocation(line: 343, column: 13, scope: !1353)
!1375 = !DILocation(line: 350, column: 59, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1035, file: !866, line: 346, column: 11)
!1377 = !DILocation(line: 350, column: 43, scope: !1376)
!1378 = !DILocation(line: 366, column: 26, scope: !1294, inlinedAt: !1379)
!1379 = distinct !DILocation(line: 350, column: 24, scope: !1376)
!1380 = !DILocation(line: 0, scope: !1294, inlinedAt: !1379)
!1381 = !DILocation(line: 366, column: 25, scope: !1294, inlinedAt: !1379)
!1382 = !DILocation(line: 350, column: 23, scope: !1376)
!1383 = !DILocation(line: 351, column: 60, scope: !1376)
!1384 = !DILocation(line: 351, column: 44, scope: !1376)
!1385 = !DILocation(line: 366, column: 26, scope: !1294, inlinedAt: !1386)
!1386 = distinct !DILocation(line: 351, column: 25, scope: !1376)
!1387 = !DILocation(line: 0, scope: !1294, inlinedAt: !1386)
!1388 = !DILocation(line: 366, column: 25, scope: !1294, inlinedAt: !1386)
!1389 = !DILocation(line: 351, column: 24, scope: !1376)
!1390 = !DILocation(line: 352, column: 58, scope: !1376)
!1391 = !DILocation(line: 352, column: 42, scope: !1376)
!1392 = !DILocation(line: 366, column: 26, scope: !1294, inlinedAt: !1393)
!1393 = distinct !DILocation(line: 352, column: 23, scope: !1376)
!1394 = !DILocation(line: 0, scope: !1294, inlinedAt: !1393)
!1395 = !DILocation(line: 366, column: 25, scope: !1294, inlinedAt: !1393)
!1396 = !DILocation(line: 352, column: 22, scope: !1376)
!1397 = !DILocation(line: 354, column: 31, scope: !1376)
!1398 = !DILocation(line: 354, column: 15, scope: !1376)
!1399 = !DILocation(line: 366, column: 26, scope: !1294, inlinedAt: !1400)
!1400 = distinct !DILocation(line: 353, column: 51, scope: !1376)
!1401 = !DILocation(line: 0, scope: !1294, inlinedAt: !1400)
!1402 = !DILocation(line: 366, column: 25, scope: !1294, inlinedAt: !1400)
!1403 = !DILocation(line: 353, column: 50, scope: !1376)
!1404 = !DILocation(line: 353, column: 26, scope: !1376)
!1405 = !DILocation(line: 355, column: 13, scope: !1376)
!1406 = !DILocation(line: 358, column: 16, scope: !1036)
!1407 = !{!1168, !914, i64 72}
!1408 = !DILocation(line: 358, column: 9, scope: !1036)
!1409 = !DILocation(line: 358, column: 28, scope: !1036)
!1410 = !DILocation(line: 302, column: 47, scope: !1037)
!1411 = distinct !{!1411, !1282, !1412, !1413, !1414}
!1412 = !DILocation(line: 359, column: 7, scope: !1038)
!1413 = !{!"llvm.loop.mustprogress"}
!1414 = !{!"llvm.loop.unroll.disable"}
!1415 = !DILocation(line: 369, column: 12, scope: !981)
!1416 = !DILocation(line: 371, column: 34, scope: !1050)
!1417 = !DILocation(line: 371, column: 15, scope: !1050)
!1418 = !DILocation(line: 371, column: 3, scope: !1051)
!1419 = !DILocation(line: 374, column: 36, scope: !1420)
!1420 = distinct !DILexicalBlock(scope: !1049, file: !866, line: 374, column: 9)
!1421 = !DILocation(line: 374, column: 61, scope: !1420)
!1422 = !DILocation(line: 374, column: 9, scope: !1049)
!1423 = !DILocation(line: 375, column: 28, scope: !1420)
!1424 = !DILocation(line: 375, column: 7, scope: !1420)
!1425 = !DILocation(line: 0, scope: !1049)
!1426 = !DILocation(line: 376, column: 58, scope: !1049)
!1427 = !DILocation(line: 376, column: 7, scope: !1049)
!1428 = !DILocation(line: 377, column: 11, scope: !1429)
!1429 = distinct !DILexicalBlock(scope: !1049, file: !866, line: 377, column: 9)
!1430 = !DILocation(line: 377, column: 9, scope: !1049)
!1431 = !DILocation(line: 379, column: 13, scope: !1049)
!1432 = !DILocation(line: 380, column: 36, scope: !1047)
!1433 = !DILocation(line: 380, column: 17, scope: !1047)
!1434 = !DILocation(line: 380, column: 5, scope: !1048)
!1435 = !DILocation(line: 382, column: 21, scope: !1436)
!1436 = distinct !DILexicalBlock(scope: !1046, file: !866, line: 382, column: 11)
!1437 = !DILocation(line: 382, column: 51, scope: !1436)
!1438 = !DILocation(line: 386, column: 15, scope: !1439)
!1439 = distinct !DILexicalBlock(scope: !1440, file: !866, line: 386, column: 15)
!1440 = distinct !DILexicalBlock(scope: !1436, file: !866, line: 385, column: 9)
!1441 = !DILocation(line: 386, column: 25, scope: !1439)
!1442 = !DILocation(line: 386, column: 15, scope: !1440)
!1443 = !DILocation(line: 388, column: 24, scope: !1444)
!1444 = distinct !DILexicalBlock(scope: !1439, file: !866, line: 387, column: 13)
!1445 = !DILocation(line: 389, column: 25, scope: !1444)
!1446 = !DILocation(line: 390, column: 13, scope: !1444)
!1447 = !DILocation(line: 393, column: 21, scope: !1448)
!1448 = distinct !DILexicalBlock(scope: !1439, file: !866, line: 392, column: 13)
!1449 = !DILocation(line: 394, column: 25, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !1448, file: !866, line: 394, column: 19)
!1451 = !DILocation(line: 394, column: 19, scope: !1448)
!1452 = !DILocation(line: 395, column: 17, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1450, file: !866, line: 395, column: 17)
!1454 = !DILocation(line: 395, column: 17, scope: !1455)
!1455 = distinct !DILexicalBlock(scope: !1456, file: !866, line: 395, column: 17)
!1456 = distinct !DILexicalBlock(scope: !1453, file: !866, line: 395, column: 17)
!1457 = !DILocation(line: 396, column: 20, scope: !1448)
!1458 = !DILocation(line: 396, column: 30, scope: !1448)
!1459 = !DILocation(line: 397, column: 24, scope: !1460)
!1460 = distinct !DILexicalBlock(scope: !1448, file: !866, line: 397, column: 19)
!1461 = !DILocation(line: 397, column: 19, scope: !1448)
!1462 = !DILocation(line: 398, column: 26, scope: !1460)
!1463 = !DILocation(line: 398, column: 17, scope: !1460)
!1464 = !DILocation(line: 402, column: 16, scope: !1045)
!1465 = !DILocation(line: 402, column: 11, scope: !1046)
!1466 = !DILocation(line: 403, column: 26, scope: !1045)
!1467 = !DILocation(line: 403, column: 9, scope: !1045)
!1468 = !DILocation(line: 411, column: 33, scope: !1469)
!1469 = distinct !DILexicalBlock(scope: !1044, file: !866, line: 407, column: 11)
!1470 = !DILocation(line: 411, column: 19, scope: !1469)
!1471 = !DILocation(line: 412, column: 26, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !1469, file: !866, line: 412, column: 17)
!1473 = !DILocation(line: 412, column: 40, scope: !1472)
!1474 = !DILocation(line: 412, column: 17, scope: !1469)
!1475 = !DILocation(line: 413, column: 28, scope: !1472)
!1476 = !DILocation(line: 414, column: 21, scope: !1472)
!1477 = !DILocalVariable(name: "image", arg: 1, scope: !1478, file: !1479, line: 29, type: !490)
!1478 = distinct !DISubprogram(name: "ConstrainColormapIndex", scope: !1479, file: !1479, line: 29, type: !1480, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1482)
!1479 = !DIFile(filename: "apps/538.imagick_r/src/magick/colormap-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4aa48b1ade7c8fc5938cc8de08671b4d")
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!850, !490, !773}
!1482 = !{!1477, !1483}
!1483 = !DILocalVariable(name: "index", arg: 2, scope: !1478, file: !1479, line: 30, type: !773)
!1484 = !DILocation(line: 0, scope: !1478, inlinedAt: !1485)
!1485 = distinct !DILocation(line: 413, column: 47, scope: !1472)
!1486 = !DILocation(line: 32, column: 22, scope: !1487, inlinedAt: !1485)
!1487 = distinct !DILexicalBlock(scope: !1478, file: !1479, line: 32, column: 7)
!1488 = !DILocation(line: 32, column: 13, scope: !1487, inlinedAt: !1485)
!1489 = !DILocation(line: 32, column: 7, scope: !1478, inlinedAt: !1485)
!1490 = !DILocation(line: 34, column: 10, scope: !1478, inlinedAt: !1485)
!1491 = !DILocation(line: 36, column: 3, scope: !1478, inlinedAt: !1485)
!1492 = !DILocation(line: 413, column: 21, scope: !1472)
!1493 = !DILocation(line: 413, column: 15, scope: !1472)
!1494 = !DILocation(line: 366, column: 26, scope: !1294, inlinedAt: !1495)
!1495 = distinct !DILocation(line: 417, column: 27, scope: !1496)
!1496 = distinct !DILexicalBlock(scope: !1472, file: !866, line: 416, column: 15)
!1497 = !DILocation(line: 0, scope: !1294, inlinedAt: !1495)
!1498 = !DILocation(line: 366, column: 25, scope: !1294, inlinedAt: !1495)
!1499 = !DILocation(line: 417, column: 26, scope: !1496)
!1500 = !DILocation(line: 0, scope: !1294, inlinedAt: !1501)
!1501 = distinct !DILocation(line: 418, column: 29, scope: !1496)
!1502 = !DILocation(line: 418, column: 28, scope: !1496)
!1503 = !DILocation(line: 0, scope: !1294, inlinedAt: !1504)
!1504 = distinct !DILocation(line: 419, column: 28, scope: !1496)
!1505 = !DILocation(line: 419, column: 27, scope: !1496)
!1506 = !DILocation(line: 432, column: 17, scope: !1507)
!1507 = distinct !DILexicalBlock(scope: !1043, file: !866, line: 432, column: 17)
!1508 = !DILocation(line: 432, column: 42, scope: !1507)
!1509 = !DILocation(line: 432, column: 17, scope: !1043)
!1510 = !DILocation(line: 433, column: 15, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1507, file: !866, line: 433, column: 15)
!1512 = !DILocation(line: 433, column: 15, scope: !1513)
!1513 = distinct !DILexicalBlock(scope: !1511, file: !866, line: 433, column: 15)
!1514 = !DILocation(line: 433, column: 15, scope: !1515)
!1515 = distinct !DILexicalBlock(scope: !1513, file: !866, line: 433, column: 15)
!1516 = !DILocation(line: 434, column: 15, scope: !1043)
!1517 = !DILocation(line: 435, column: 15, scope: !1043)
!1518 = !DILocation(line: 0, scope: !1043)
!1519 = !DILocation(line: 437, column: 46, scope: !1043)
!1520 = !DILocation(line: 437, column: 56, scope: !1043)
!1521 = !DILocation(line: 0, scope: !1315, inlinedAt: !1522)
!1522 = distinct !DILocation(line: 437, column: 23, scope: !1043)
!1523 = !DILocation(line: 275, column: 52, scope: !1315, inlinedAt: !1522)
!1524 = !DILocation(line: 275, column: 51, scope: !1315, inlinedAt: !1522)
!1525 = !DILocation(line: 275, column: 60, scope: !1315, inlinedAt: !1522)
!1526 = !DILocation(line: 275, column: 21, scope: !1315, inlinedAt: !1522)
!1527 = !DILocation(line: 275, column: 66, scope: !1315, inlinedAt: !1522)
!1528 = !DILocation(line: 275, column: 10, scope: !1315, inlinedAt: !1522)
!1529 = !DILocation(line: 437, column: 22, scope: !1043)
!1530 = !DILocation(line: 438, column: 59, scope: !1043)
!1531 = !DILocation(line: 439, column: 31, scope: !1043)
!1532 = !DILocation(line: 438, column: 64, scope: !1043)
!1533 = !DILocation(line: 0, scope: !1315, inlinedAt: !1534)
!1534 = distinct !DILocation(line: 438, column: 25, scope: !1043)
!1535 = !DILocation(line: 275, column: 52, scope: !1315, inlinedAt: !1534)
!1536 = !DILocation(line: 275, column: 51, scope: !1315, inlinedAt: !1534)
!1537 = !DILocation(line: 275, column: 60, scope: !1315, inlinedAt: !1534)
!1538 = !DILocation(line: 275, column: 21, scope: !1315, inlinedAt: !1534)
!1539 = !DILocation(line: 275, column: 66, scope: !1315, inlinedAt: !1534)
!1540 = !DILocation(line: 275, column: 10, scope: !1315, inlinedAt: !1534)
!1541 = !DILocation(line: 438, column: 24, scope: !1043)
!1542 = !DILocation(line: 440, column: 49, scope: !1043)
!1543 = !DILocation(line: 0, scope: !1315, inlinedAt: !1544)
!1544 = distinct !DILocation(line: 440, column: 24, scope: !1043)
!1545 = !DILocation(line: 275, column: 52, scope: !1315, inlinedAt: !1544)
!1546 = !DILocation(line: 275, column: 51, scope: !1315, inlinedAt: !1544)
!1547 = !DILocation(line: 275, column: 60, scope: !1315, inlinedAt: !1544)
!1548 = !DILocation(line: 275, column: 21, scope: !1315, inlinedAt: !1544)
!1549 = !DILocation(line: 275, column: 66, scope: !1315, inlinedAt: !1544)
!1550 = !DILocation(line: 275, column: 10, scope: !1315, inlinedAt: !1544)
!1551 = !DILocation(line: 440, column: 23, scope: !1043)
!1552 = !DILocation(line: 441, column: 24, scope: !1553)
!1553 = distinct !DILexicalBlock(scope: !1043, file: !866, line: 441, column: 17)
!1554 = !DILocation(line: 441, column: 30, scope: !1553)
!1555 = !DILocation(line: 441, column: 17, scope: !1043)
!1556 = !DILocation(line: 442, column: 29, scope: !1553)
