; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/threshold.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/threshold.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }

!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!395 = !DIEnumerator(name: "UndefinedChannel", value: 0)
!396 = !DIEnumerator(name: "RedChannel", value: 1)
!397 = !DIEnumerator(name: "GrayChannel", value: 1)
!398 = !DIEnumerator(name: "CyanChannel", value: 1)
!399 = !DIEnumerator(name: "GreenChannel", value: 2)
!400 = !DIEnumerator(name: "MagentaChannel", value: 2)
!401 = !DIEnumerator(name: "BlueChannel", value: 4)
!402 = !DIEnumerator(name: "YellowChannel", value: 4)
!403 = !DIEnumerator(name: "AlphaChannel", value: 8)
!404 = !DIEnumerator(name: "OpacityChannel", value: 8)
!405 = !DIEnumerator(name: "MatteChannel", value: 8)
!406 = !DIEnumerator(name: "BlackChannel", value: 32)
!407 = !DIEnumerator(name: "IndexChannel", value: 32)
!408 = !DIEnumerator(name: "CompositeChannels", value: 47)
!409 = !DIEnumerator(name: "AllChannels", value: 134217727)
!410 = !DIEnumerator(name: "TrueAlphaChannel", value: 64)
!411 = !DIEnumerator(name: "RGBChannels", value: 128)
!412 = !DIEnumerator(name: "GrayChannels", value: 128)
!413 = !DIEnumerator(name: "SyncChannels", value: 256)
!414 = !DIEnumerator(name: "DefaultChannels", value: 134217719)
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !153, line: 25, baseType: !5, size: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!417 = !DIEnumerator(name: "NoValue", value: 0)
!418 = !DIEnumerator(name: "XValue", value: 1)
!419 = !DIEnumerator(name: "XiValue", value: 1)
!420 = !DIEnumerator(name: "YValue", value: 2)
!421 = !DIEnumerator(name: "PsiValue", value: 2)
!422 = !DIEnumerator(name: "WidthValue", value: 4)
!423 = !DIEnumerator(name: "RhoValue", value: 4)
!424 = !DIEnumerator(name: "HeightValue", value: 8)
!425 = !DIEnumerator(name: "SigmaValue", value: 8)
!426 = !DIEnumerator(name: "ChiValue", value: 16)
!427 = !DIEnumerator(name: "XiNegative", value: 32)
!428 = !DIEnumerator(name: "XNegative", value: 32)
!429 = !DIEnumerator(name: "PsiNegative", value: 64)
!430 = !DIEnumerator(name: "YNegative", value: 64)
!431 = !DIEnumerator(name: "ChiNegative", value: 128)
!432 = !DIEnumerator(name: "PercentValue", value: 4096)
!433 = !DIEnumerator(name: "AspectValue", value: 8192)
!434 = !DIEnumerator(name: "NormalizeValue", value: 8192)
!435 = !DIEnumerator(name: "LessValue", value: 16384)
!436 = !DIEnumerator(name: "GreaterValue", value: 32768)
!437 = !DIEnumerator(name: "MinimumValue", value: 65536)
!438 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536)
!439 = !DIEnumerator(name: "AreaValue", value: 131072)
!440 = !DIEnumerator(name: "DecimalValue", value: 262144)
!441 = !DIEnumerator(name: "SeparatorValue", value: 524288)
!442 = !DIEnumerator(name: "AllValues", value: 2147483647)
!443 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !444, line: 46, baseType: !5, size: 32, elements: !445)
!444 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!446 = !DIEnumerator(name: "_ISupper", value: 256)
!447 = !DIEnumerator(name: "_ISlower", value: 512)
!448 = !DIEnumerator(name: "_ISalpha", value: 1024)
!449 = !DIEnumerator(name: "_ISdigit", value: 2048)
!450 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!451 = !DIEnumerator(name: "_ISspace", value: 8192)
!452 = !DIEnumerator(name: "_ISprint", value: 16384)
!453 = !DIEnumerator(name: "_ISgraph", value: 32768)
!454 = !DIEnumerator(name: "_ISblank", value: 1)
!455 = !DIEnumerator(name: "_IScntrl", value: 2)
!456 = !DIEnumerator(name: "_ISpunct", value: 4)
!457 = !DIEnumerator(name: "_ISalnum", value: 8)
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !459, line: 25, baseType: !5, size: 32, elements: !460)
!459 = !DIFile(filename: "apps/538.imagick_r/src/magick/resource_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "933ce0dda2adf2da84827500e98d468e")
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469}
!461 = !DIEnumerator(name: "UndefinedResource", value: 0)
!462 = !DIEnumerator(name: "AreaResource", value: 1)
!463 = !DIEnumerator(name: "DiskResource", value: 2)
!464 = !DIEnumerator(name: "FileResource", value: 3)
!465 = !DIEnumerator(name: "MapResource", value: 4)
!466 = !DIEnumerator(name: "MemoryResource", value: 5)
!467 = !DIEnumerator(name: "ThreadResource", value: 6)
!468 = !DIEnumerator(name: "TimeResource", value: 7)
!469 = !DIEnumerator(name: "ThrottleResource", value: 8)
!470 = !{!471, !472, !527, !693, !536, !695, !495, !697, !500, !700, !699, !600, !605, !531, !701, !702, !714, !639, !483, !509, !718, !728, !662, !501, !5, !781, !782, !783}
!471 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !475)
!475 = !{!476, !478, !480, !482, !485, !487, !489, !490, !491, !492, !493, !494, !505, !506, !507, !508, !510, !524, !526, !528, !530, !533, !534, !535, !541, !542, !543, !551, !552, !553, !554, !555, !556, !558, !560, !562, !564, !566, !568, !570, !571, !572, !573, !574, !575, !576, !584, !599, !613, !614, !615, !616, !620, !624, !628, !629, !630, !631, !632, !650, !651, !653, !654, !664, !665, !667, !668, !669, !670, !671, !672, !674, !675, !676, !677, !678, !679, !680, !682, !683, !684, !685, !686, !690, !692}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !474, file: !73, line: 153, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !474, file: !73, line: 156, baseType: !479, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !474, file: !73, line: 159, baseType: !481, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !474, file: !73, line: 162, baseType: !483, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !484, line: 46, baseType: !471)
!484 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!485 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !474, file: !73, line: 165, baseType: !486, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !474, file: !73, line: 168, baseType: !488, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !474, file: !73, line: 169, baseType: !488, size: 32, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !474, file: !73, line: 172, baseType: !483, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !474, file: !73, line: 173, baseType: !483, size: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !474, file: !73, line: 174, baseType: !483, size: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !474, file: !73, line: 175, baseType: !483, size: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !474, file: !73, line: 178, baseType: !495, size: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !498)
!498 = !{!499, !502, !503, !504}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !497, file: !326, line: 143, baseType: !500, size: 16)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !501)
!501 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !497, file: !326, line: 144, baseType: !500, size: 16, offset: 16)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !497, file: !326, line: 145, baseType: !500, size: 16, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !497, file: !326, line: 146, baseType: !500, size: 16, offset: 48)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !474, file: !73, line: 179, baseType: !496, size: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !474, file: !73, line: 180, baseType: !496, size: 64, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !474, file: !73, line: 181, baseType: !496, size: 64, offset: 768)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !474, file: !73, line: 184, baseType: !509, size: 64, offset: 832)
!509 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !474, file: !73, line: 187, baseType: !511, size: 768, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !513)
!513 = !{!514, !521, !522, !523}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !512, file: !73, line: 124, baseType: !515, size: 192)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !516, file: !73, line: 98, baseType: !509, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !516, file: !73, line: 99, baseType: !509, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !516, file: !73, line: 100, baseType: !509, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !512, file: !73, line: 125, baseType: !515, size: 192, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !512, file: !73, line: 126, baseType: !515, size: 192, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !512, file: !73, line: 127, baseType: !515, size: 192, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !474, file: !73, line: 190, baseType: !525, size: 32, offset: 1664)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !474, file: !73, line: 193, baseType: !527, size: 64, offset: 1728)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !474, file: !73, line: 196, baseType: !529, size: 32, offset: 1792)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !474, file: !73, line: 199, baseType: !531, size: 64, offset: 1856)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !474, file: !73, line: 200, baseType: !531, size: 64, offset: 1920)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !474, file: !73, line: 201, baseType: !531, size: 64, offset: 1984)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !474, file: !73, line: 204, baseType: !536, size: 64, offset: 2048)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !537, line: 77, baseType: !538)
!537 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !539, line: 193, baseType: !540)
!539 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!540 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !474, file: !73, line: 207, baseType: !509, size: 64, offset: 2112)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !474, file: !73, line: 208, baseType: !509, size: 64, offset: 2176)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !474, file: !73, line: 211, baseType: !544, size: 256, offset: 2240)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !546)
!546 = !{!547, !548, !549, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !545, file: !153, line: 124, baseType: !483, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !545, file: !153, line: 125, baseType: !483, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !545, file: !153, line: 128, baseType: !536, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !545, file: !153, line: 129, baseType: !536, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !474, file: !73, line: 212, baseType: !544, size: 256, offset: 2496)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !474, file: !73, line: 213, baseType: !544, size: 256, offset: 2752)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !474, file: !73, line: 216, baseType: !509, size: 64, offset: 3008)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !474, file: !73, line: 217, baseType: !509, size: 64, offset: 3072)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !474, file: !73, line: 218, baseType: !509, size: 64, offset: 3136)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !474, file: !73, line: 221, baseType: !557, size: 32, offset: 3200)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !474, file: !73, line: 224, baseType: !559, size: 32, offset: 3232)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !474, file: !73, line: 227, baseType: !561, size: 32, offset: 3264)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !474, file: !73, line: 230, baseType: !563, size: 32, offset: 3296)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !474, file: !73, line: 233, baseType: !565, size: 32, offset: 3328)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !474, file: !73, line: 236, baseType: !567, size: 32, offset: 3360)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !474, file: !73, line: 239, baseType: !569, size: 64, offset: 3392)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !474, file: !73, line: 242, baseType: !483, size: 64, offset: 3456)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !474, file: !73, line: 243, baseType: !483, size: 64, offset: 3520)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !474, file: !73, line: 246, baseType: !536, size: 64, offset: 3584)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !474, file: !73, line: 249, baseType: !483, size: 64, offset: 3648)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !474, file: !73, line: 250, baseType: !483, size: 64, offset: 3712)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !474, file: !73, line: 253, baseType: !536, size: 64, offset: 3776)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !474, file: !73, line: 256, baseType: !577, size: 192, offset: 3840)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !578, line: 68, baseType: !579)
!578 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !578, line: 62, size: 192, elements: !580)
!580 = !{!581, !582, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !579, file: !578, line: 65, baseType: !509, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !579, file: !578, line: 66, baseType: !509, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !579, file: !578, line: 67, baseType: !509, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !474, file: !73, line: 259, baseType: !585, size: 512, offset: 4032)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !587)
!587 = !{!588, !595, !596, !598}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !586, file: !247, line: 43, baseType: !589, size: 192)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !590, file: !247, line: 35, baseType: !509, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !590, file: !247, line: 36, baseType: !509, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !590, file: !247, line: 37, baseType: !509, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !586, file: !247, line: 44, baseType: !589, size: 192, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !586, file: !247, line: 47, baseType: !597, size: 32, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !586, file: !247, line: 50, baseType: !483, size: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !474, file: !73, line: 262, baseType: !600, size: 64, offset: 4544)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !601, line: 26, baseType: !602)
!601 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!488, !605, !607, !610, !527}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !609)
!609 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !612)
!612 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !474, file: !73, line: 265, baseType: !527, size: 64, offset: 4608)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !474, file: !73, line: 266, baseType: !527, size: 64, offset: 4672)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !474, file: !73, line: 267, baseType: !527, size: 64, offset: 4736)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !474, file: !73, line: 270, baseType: !617, size: 64, offset: 4800)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !619)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !474, file: !73, line: 273, baseType: !621, size: 64, offset: 4864)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !623)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !474, file: !73, line: 276, baseType: !625, size: 32768, offset: 4928)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 32768, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 4096)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !474, file: !73, line: 277, baseType: !625, size: 32768, offset: 37696)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !474, file: !73, line: 278, baseType: !625, size: 32768, offset: 70464)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !474, file: !73, line: 281, baseType: !483, size: 64, offset: 103232)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !474, file: !73, line: 282, baseType: !483, size: 64, offset: 103296)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !474, file: !73, line: 285, baseType: !633, size: 448, offset: 103360)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !635)
!635 = !{!636, !638, !640, !641, !642, !643, !644, !649}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !634, file: !253, line: 105, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !634, file: !253, line: 108, baseType: !639, size: 32, offset: 32)
!639 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !634, file: !253, line: 111, baseType: !531, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !634, file: !253, line: 112, baseType: !531, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !634, file: !253, line: 115, baseType: !527, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !634, file: !253, line: 118, baseType: !488, size: 32, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !634, file: !253, line: 121, baseType: !645, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !647, line: 26, baseType: !648)
!647 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !647, line: 25, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !634, file: !253, line: 124, baseType: !483, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !474, file: !73, line: 288, baseType: !488, size: 32, offset: 103808)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !474, file: !73, line: 291, baseType: !652, size: 64, offset: 103872)
!652 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !536)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !474, file: !73, line: 294, baseType: !645, size: 64, offset: 103936)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !474, file: !73, line: 297, baseType: !655, size: 256, offset: 104000)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !657)
!657 = !{!658, !659, !660, !663}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !656, file: !89, line: 30, baseType: !531, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !656, file: !89, line: 33, baseType: !483, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !656, file: !89, line: 36, baseType: !661, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !656, file: !89, line: 39, baseType: !483, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !474, file: !73, line: 298, baseType: !655, size: 256, offset: 104256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !474, file: !73, line: 299, baseType: !666, size: 64, offset: 104512)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !474, file: !73, line: 302, baseType: !483, size: 64, offset: 104576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !474, file: !73, line: 305, baseType: !483, size: 64, offset: 104640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !474, file: !73, line: 308, baseType: !569, size: 64, offset: 104704)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !474, file: !73, line: 309, baseType: !569, size: 64, offset: 104768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !73, line: 310, baseType: !569, size: 64, offset: 104832)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !474, file: !73, line: 313, baseType: !673, size: 32, offset: 104896)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !474, file: !73, line: 316, baseType: !488, size: 32, offset: 104928)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !474, file: !73, line: 319, baseType: !496, size: 64, offset: 104960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !474, file: !73, line: 322, baseType: !569, size: 64, offset: 105024)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !474, file: !73, line: 325, baseType: !544, size: 256, offset: 105088)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !474, file: !73, line: 328, baseType: !527, size: 64, offset: 105344)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !474, file: !73, line: 329, baseType: !527, size: 64, offset: 105408)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !474, file: !73, line: 332, baseType: !681, size: 32, offset: 105472)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !474, file: !73, line: 335, baseType: !488, size: 32, offset: 105504)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !474, file: !73, line: 338, baseType: !611, size: 64, offset: 105536)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !474, file: !73, line: 341, baseType: !488, size: 32, offset: 105600)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !474, file: !73, line: 344, baseType: !483, size: 64, offset: 105664)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !474, file: !73, line: 347, baseType: !687, size: 64, offset: 105728)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !688, line: 7, baseType: !689)
!688 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !539, line: 160, baseType: !540)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !474, file: !73, line: 350, baseType: !691, size: 32, offset: 105792)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !474, file: !73, line: 353, baseType: !483, size: 64, offset: 105856)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !694)
!694 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !500)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThresholdMap", file: !704, line: 26, baseType: !705)
!704 = !DIFile(filename: "apps/538.imagick_r/src/magick/threshold.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "025e5deece754d1f8c0275d8e77e5252")
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ThresholdMap", file: !706, line: 96, size: 384, elements: !707)
!706 = !DIFile(filename: "apps/538.imagick_r/src/magick/threshold.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bb492fb6ca966470a904dc4f9ba10be4")
!707 = !{!708, !709, !710, !711, !712, !713}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "map_id", scope: !705, file: !706, line: 99, baseType: !531, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !705, file: !706, line: 100, baseType: !531, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !705, file: !706, line: 103, baseType: !483, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !705, file: !706, line: 104, baseType: !483, size: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "divisor", scope: !705, file: !706, line: 107, baseType: !536, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !705, file: !706, line: 108, baseType: !701, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLTreeInfo", file: !716, line: 29, baseType: !717)
!716 = !DIFile(filename: "apps/538.imagick_r/src/magick/xml-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e544995a74b1ca30ba5edadca4a5927")
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XMLTreeInfo", file: !716, line: 28, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !721, line: 40, baseType: !722)
!721 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !721, line: 29, size: 32960, elements: !723)
!723 = !{!724, !725, !726, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !722, file: !721, line: 32, baseType: !625, size: 32768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !722, file: !721, line: 35, baseType: !661, size: 64, offset: 32768)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !722, file: !721, line: 38, baseType: !483, size: 64, offset: 32832)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !722, file: !721, line: 39, baseType: !483, size: 64, offset: 32896)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !730, line: 7, baseType: !731)
!730 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !732, line: 49, size: 1728, elements: !733)
!732 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !749, !751, !752, !753, !755, !756, !758, !762, !765, !767, !770, !773, !774, !775, !776, !777}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !731, file: !732, line: 51, baseType: !639, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !731, file: !732, line: 54, baseType: !531, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !731, file: !732, line: 55, baseType: !531, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !731, file: !732, line: 56, baseType: !531, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !731, file: !732, line: 57, baseType: !531, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !731, file: !732, line: 58, baseType: !531, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !731, file: !732, line: 59, baseType: !531, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !731, file: !732, line: 60, baseType: !531, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !731, file: !732, line: 61, baseType: !531, size: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !731, file: !732, line: 64, baseType: !531, size: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !731, file: !732, line: 65, baseType: !531, size: 64, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !731, file: !732, line: 66, baseType: !531, size: 64, offset: 704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !731, file: !732, line: 68, baseType: !747, size: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !732, line: 36, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !731, file: !732, line: 70, baseType: !750, size: 64, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !731, file: !732, line: 72, baseType: !639, size: 32, offset: 896)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !731, file: !732, line: 73, baseType: !639, size: 32, offset: 928)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !731, file: !732, line: 74, baseType: !754, size: 64, offset: 960)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !539, line: 152, baseType: !540)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !731, file: !732, line: 77, baseType: !501, size: 16, offset: 1024)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !731, file: !732, line: 78, baseType: !757, size: 8, offset: 1040)
!757 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !731, file: !732, line: 79, baseType: !759, size: 8, offset: 1048)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 8, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 1)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !731, file: !732, line: 81, baseType: !763, size: 64, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !732, line: 43, baseType: null)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !731, file: !732, line: 89, baseType: !766, size: 64, offset: 1152)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !539, line: 153, baseType: !540)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !731, file: !732, line: 91, baseType: !768, size: 64, offset: 1216)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !732, line: 37, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !731, file: !732, line: 92, baseType: !771, size: 64, offset: 1280)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !732, line: 38, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !731, file: !732, line: 93, baseType: !750, size: 64, offset: 1344)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !731, file: !732, line: 94, baseType: !527, size: 64, offset: 1408)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !731, file: !732, line: 95, baseType: !483, size: 64, offset: 1472)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !731, file: !732, line: 96, baseType: !639, size: 32, offset: 1536)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !731, file: !732, line: 98, baseType: !778, size: 160, offset: 1568)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 160, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 20)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !785, line: 31, baseType: !786)
!785 = !DIFile(filename: "apps/538.imagick_r/src/magick/random_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "95f31caf92e8a7cab5b1bf8cc3698f31")
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !785, line: 30, flags: DIFlagFwdDecl)
!787 = !{!788}
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "MinimalThresholdMap", scope: !0, file: !706, line: 115, type: !605, isLocal: true, isDefinition: true)
!790 = !{i32 7, !"Dwarf Version", i32 5}
!791 = !{i32 2, !"Debug Info Version", i32 3}
!792 = !{i32 1, !"wchar_size", i32 4}
!793 = !{i32 7, !"PIC Level", i32 2}
!794 = !{i32 7, !"PIE Level", i32 2}
!795 = !{i32 7, !"uwtable", i32 2}
!796 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!797 = distinct !DISubprogram(name: "AdaptiveThresholdImage", scope: !706, file: !706, line: 168, type: !798, scopeLine: 171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !805)
!798 = !DISubroutineType(types: !799)
!799 = !{!472, !800, !802, !802, !803, !804}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!805 = !{!806, !807, !808, !809, !810, !811, !816, !817, !818, !819, !820, !834, !835, !836, !840, !841, !842, !844, !846, !847, !849, !851, !852, !853, !854, !858}
!806 = !DILocalVariable(name: "image", arg: 1, scope: !797, file: !706, line: 168, type: !800)
!807 = !DILocalVariable(name: "width", arg: 2, scope: !797, file: !706, line: 169, type: !802)
!808 = !DILocalVariable(name: "height", arg: 3, scope: !797, file: !706, line: 169, type: !802)
!809 = !DILocalVariable(name: "offset", arg: 4, scope: !797, file: !706, line: 169, type: !803)
!810 = !DILocalVariable(name: "exception", arg: 5, scope: !797, file: !706, line: 170, type: !804)
!811 = !DILocalVariable(name: "image_view", scope: !797, file: !706, line: 175, type: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !814, line: 50, baseType: !815)
!814 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!816 = !DILocalVariable(name: "threshold_view", scope: !797, file: !706, line: 176, type: !812)
!817 = !DILocalVariable(name: "threshold_image", scope: !797, file: !706, line: 179, type: !472)
!818 = !DILocalVariable(name: "status", scope: !797, file: !706, line: 182, type: !488)
!819 = !DILocalVariable(name: "progress", scope: !797, file: !706, line: 185, type: !608)
!820 = !DILocalVariable(name: "zero", scope: !797, file: !706, line: 188, type: !821)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !822, file: !326, line: 107, baseType: !477, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !822, file: !326, line: 110, baseType: !479, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !822, file: !326, line: 113, baseType: !488, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !822, file: !326, line: 116, baseType: !509, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !822, file: !326, line: 119, baseType: !483, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !822, file: !326, line: 122, baseType: !693, size: 32, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !822, file: !326, line: 123, baseType: !693, size: 32, offset: 288)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !822, file: !326, line: 124, baseType: !693, size: 32, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !822, file: !326, line: 125, baseType: !693, size: 32, offset: 352)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !822, file: !326, line: 126, baseType: !693, size: 32, offset: 384)
!834 = !DILocalVariable(name: "number_pixels", scope: !797, file: !706, line: 191, type: !693)
!835 = !DILocalVariable(name: "y", scope: !797, file: !706, line: 194, type: !536)
!836 = !DILocalVariable(name: "sync", scope: !837, file: !706, line: 227, type: !488)
!837 = distinct !DILexicalBlock(scope: !838, file: !706, line: 225, column: 3)
!838 = distinct !DILexicalBlock(scope: !839, file: !706, line: 224, column: 3)
!839 = distinct !DILexicalBlock(scope: !797, file: !706, line: 224, column: 3)
!840 = !DILocalVariable(name: "channel_bias", scope: !837, file: !706, line: 230, type: !821)
!841 = !DILocalVariable(name: "channel_sum", scope: !837, file: !706, line: 231, type: !821)
!842 = !DILocalVariable(name: "indexes", scope: !837, file: !706, line: 234, type: !843)
!843 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !697)
!844 = !DILocalVariable(name: "p", scope: !837, file: !706, line: 237, type: !845)
!845 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !695)
!846 = !DILocalVariable(name: "r", scope: !837, file: !706, line: 238, type: !845)
!847 = !DILocalVariable(name: "threshold_indexes", scope: !837, file: !706, line: 241, type: !848)
!848 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !700)
!849 = !DILocalVariable(name: "q", scope: !837, file: !706, line: 244, type: !850)
!850 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !495)
!851 = !DILocalVariable(name: "x", scope: !837, file: !706, line: 247, type: !536)
!852 = !DILocalVariable(name: "u", scope: !837, file: !706, line: 250, type: !536)
!853 = !DILocalVariable(name: "v", scope: !837, file: !706, line: 251, type: !536)
!854 = !DILocalVariable(name: "mean", scope: !855, file: !706, line: 295, type: !821)
!855 = distinct !DILexicalBlock(scope: !856, file: !706, line: 293, column: 5)
!856 = distinct !DILexicalBlock(scope: !857, file: !706, line: 292, column: 5)
!857 = distinct !DILexicalBlock(scope: !837, file: !706, line: 292, column: 5)
!858 = !DILocalVariable(name: "proceed", scope: !859, file: !706, line: 348, type: !488)
!859 = distinct !DILexicalBlock(scope: !860, file: !706, line: 346, column: 7)
!860 = distinct !DILexicalBlock(scope: !837, file: !706, line: 345, column: 9)
!861 = !DILocation(line: 0, scope: !797)
!862 = !DILocation(line: 187, column: 3, scope: !797)
!863 = !DILocation(line: 188, column: 5, scope: !797)
!864 = !DILocation(line: 198, column: 14, scope: !865)
!865 = distinct !DILexicalBlock(scope: !797, file: !706, line: 198, column: 7)
!866 = !{!867, !868, i64 12976}
!867 = !{!"_Image", !868, i64 0, !868, i64 4, !868, i64 8, !870, i64 16, !868, i64 24, !868, i64 28, !868, i64 32, !870, i64 40, !870, i64 48, !870, i64 56, !870, i64 64, !871, i64 72, !872, i64 80, !872, i64 88, !872, i64 96, !874, i64 104, !875, i64 112, !868, i64 208, !871, i64 216, !868, i64 224, !871, i64 232, !871, i64 240, !871, i64 248, !870, i64 256, !874, i64 264, !874, i64 272, !877, i64 280, !877, i64 312, !877, i64 344, !874, i64 376, !874, i64 384, !874, i64 392, !868, i64 400, !868, i64 404, !868, i64 408, !868, i64 412, !868, i64 416, !868, i64 420, !871, i64 424, !870, i64 432, !870, i64 440, !870, i64 448, !870, i64 456, !870, i64 464, !870, i64 472, !878, i64 480, !879, i64 504, !871, i64 568, !871, i64 576, !871, i64 584, !871, i64 592, !871, i64 600, !871, i64 608, !868, i64 616, !868, i64 4712, !868, i64 8808, !870, i64 12904, !870, i64 12912, !881, i64 12920, !868, i64 12976, !870, i64 12984, !871, i64 12992, !883, i64 13000, !883, i64 13032, !871, i64 13064, !870, i64 13072, !870, i64 13080, !871, i64 13088, !871, i64 13096, !871, i64 13104, !868, i64 13112, !868, i64 13116, !872, i64 13120, !871, i64 13128, !877, i64 13136, !871, i64 13168, !871, i64 13176, !868, i64 13184, !868, i64 13188, !884, i64 13192, !868, i64 13200, !870, i64 13208, !870, i64 13216, !868, i64 13224, !870, i64 13232}
!868 = !{!"omnipotent char", !869, i64 0}
!869 = !{!"Simple C/C++ TBAA"}
!870 = !{!"long", !868, i64 0}
!871 = !{!"any pointer", !868, i64 0}
!872 = !{!"_PixelPacket", !873, i64 0, !873, i64 2, !873, i64 4, !873, i64 6}
!873 = !{!"short", !868, i64 0}
!874 = !{!"double", !868, i64 0}
!875 = !{!"_ChromaticityInfo", !876, i64 0, !876, i64 24, !876, i64 48, !876, i64 72}
!876 = !{!"_PrimaryInfo", !874, i64 0, !874, i64 8, !874, i64 16}
!877 = !{!"_RectangleInfo", !870, i64 0, !870, i64 8, !870, i64 16, !870, i64 24}
!878 = !{!"_ErrorInfo", !874, i64 0, !874, i64 8, !874, i64 16}
!879 = !{!"_TimerInfo", !880, i64 0, !880, i64 24, !868, i64 48, !870, i64 56}
!880 = !{!"_Timer", !874, i64 0, !874, i64 8, !874, i64 16}
!881 = !{!"_ExceptionInfo", !868, i64 0, !882, i64 4, !871, i64 8, !871, i64 16, !871, i64 24, !868, i64 32, !871, i64 40, !870, i64 48}
!882 = !{!"int", !868, i64 0}
!883 = !{!"_ProfileInfo", !871, i64 0, !870, i64 8, !871, i64 16, !870, i64 24}
!884 = !{!"long long", !868, i64 0}
!885 = !DILocation(line: 198, column: 20, scope: !865)
!886 = !DILocation(line: 198, column: 7, scope: !797)
!887 = !DILocation(line: 199, column: 68, scope: !865)
!888 = !DILocation(line: 199, column: 12, scope: !865)
!889 = !DILocation(line: 199, column: 5, scope: !865)
!890 = !DILocation(line: 202, column: 19, scope: !797)
!891 = !DILocation(line: 203, column: 23, scope: !892)
!892 = distinct !DILexicalBlock(scope: !797, file: !706, line: 203, column: 7)
!893 = !DILocation(line: 203, column: 7, scope: !797)
!894 = !DILocation(line: 205, column: 7, scope: !895)
!895 = distinct !DILexicalBlock(scope: !797, file: !706, line: 205, column: 7)
!896 = !DILocation(line: 205, column: 57, scope: !895)
!897 = !DILocation(line: 205, column: 7, scope: !797)
!898 = !DILocation(line: 207, column: 52, scope: !899)
!899 = distinct !DILexicalBlock(scope: !895, file: !706, line: 206, column: 5)
!900 = !DILocation(line: 207, column: 7, scope: !899)
!901 = !DILocation(line: 208, column: 23, scope: !899)
!902 = !DILocation(line: 209, column: 7, scope: !899)
!903 = !DILocation(line: 216, column: 3, scope: !797)
!904 = !DILocation(line: 217, column: 40, scope: !797)
!905 = !DILocation(line: 217, column: 17, scope: !797)
!906 = !DILocation(line: 218, column: 14, scope: !797)
!907 = !DILocation(line: 219, column: 18, scope: !797)
!908 = !DILocation(line: 224, column: 34, scope: !838)
!909 = !{!867, !870, i64 48}
!910 = !DILocation(line: 224, column: 15, scope: !838)
!911 = !DILocation(line: 224, column: 3, scope: !839)
!912 = !DILocation(line: 253, column: 16, scope: !913)
!913 = distinct !DILexicalBlock(scope: !837, file: !706, line: 253, column: 9)
!914 = !DILocation(line: 253, column: 9, scope: !837)
!915 = !DILocation(line: 255, column: 67, scope: !837)
!916 = !DILocation(line: 256, column: 24, scope: !837)
!917 = !{!867, !870, i64 40}
!918 = !DILocation(line: 256, column: 31, scope: !837)
!919 = !DILocation(line: 255, column: 7, scope: !837)
!920 = !DILocation(line: 0, scope: !837)
!921 = !DILocation(line: 257, column: 71, scope: !837)
!922 = !DILocation(line: 257, column: 7, scope: !837)
!923 = !DILocation(line: 259, column: 12, scope: !924)
!924 = distinct !DILexicalBlock(scope: !837, file: !706, line: 259, column: 9)
!925 = !DILocation(line: 259, column: 43, scope: !924)
!926 = !DILocation(line: 264, column: 13, scope: !837)
!927 = !DILocation(line: 265, column: 23, scope: !837)
!928 = !DILocation(line: 266, column: 18, scope: !837)
!929 = !{i64 0, i64 4, !930, i64 4, i64 4, !930, i64 8, i64 4, !930, i64 12, i64 4, !930, i64 16, i64 4, !930}
!930 = !{!931, !931, i64 0}
!931 = !{!"float", !868, i64 0}
!932 = !{i64 0, i64 4, !930, i64 4, i64 4, !930, i64 8, i64 4, !930, i64 12, i64 4, !930}
!933 = !{i64 0, i64 4, !930, i64 4, i64 4, !930, i64 8, i64 4, !930}
!934 = !DILocation(line: 269, column: 5, scope: !935)
!935 = distinct !DILexicalBlock(scope: !837, file: !706, line: 269, column: 5)
!936 = !DILocation(line: 271, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !938, file: !706, line: 271, column: 7)
!938 = distinct !DILexicalBlock(scope: !939, file: !706, line: 270, column: 5)
!939 = distinct !DILexicalBlock(scope: !935, file: !706, line: 269, column: 5)
!940 = !{!867, !868, i64 4}
!941 = !DILocation(line: 287, column: 13, scope: !942)
!942 = distinct !DILexicalBlock(scope: !943, file: !706, line: 272, column: 7)
!943 = distinct !DILexicalBlock(scope: !937, file: !706, line: 271, column: 7)
!944 = !DILocation(line: 281, column: 17, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !706, line: 279, column: 17)
!946 = distinct !DILexicalBlock(scope: !947, file: !706, line: 274, column: 11)
!947 = distinct !DILexicalBlock(scope: !942, file: !706, line: 273, column: 13)
!948 = !DILocation(line: 273, column: 15, scope: !947)
!949 = !DILocation(line: 273, column: 13, scope: !942)
!950 = !DILocation(line: 275, column: 36, scope: !946)
!951 = !{!872, !873, i64 4}
!952 = !DILocation(line: 275, column: 31, scope: !946)
!953 = !DILocation(line: 275, column: 29, scope: !946)
!954 = !DILocation(line: 276, column: 38, scope: !946)
!955 = !{!872, !873, i64 2}
!956 = !DILocation(line: 276, column: 33, scope: !946)
!957 = !DILocation(line: 276, column: 31, scope: !946)
!958 = !DILocation(line: 277, column: 37, scope: !946)
!959 = !{!872, !873, i64 0}
!960 = !DILocation(line: 277, column: 32, scope: !946)
!961 = !DILocation(line: 277, column: 30, scope: !946)
!962 = !DILocation(line: 278, column: 40, scope: !946)
!963 = !{!872, !873, i64 6}
!964 = !DILocation(line: 278, column: 35, scope: !946)
!965 = !DILocation(line: 278, column: 33, scope: !946)
!966 = !DILocation(line: 279, column: 17, scope: !946)
!967 = !DILocation(line: 283, column: 26, scope: !942)
!968 = !DILocation(line: 283, column: 31, scope: !942)
!969 = !DILocation(line: 283, column: 24, scope: !942)
!970 = !DILocation(line: 284, column: 33, scope: !942)
!971 = !DILocation(line: 284, column: 28, scope: !942)
!972 = !DILocation(line: 284, column: 26, scope: !942)
!973 = !DILocation(line: 285, column: 32, scope: !942)
!974 = !DILocation(line: 285, column: 27, scope: !942)
!975 = !DILocation(line: 285, column: 25, scope: !942)
!976 = !DILocation(line: 286, column: 35, scope: !942)
!977 = !DILocation(line: 286, column: 30, scope: !942)
!978 = !DILocation(line: 286, column: 28, scope: !942)
!979 = !DILocation(line: 271, column: 39, scope: !943)
!980 = !DILocation(line: 271, column: 19, scope: !943)
!981 = distinct !{!981, !936, !982, !983, !984}
!982 = !DILocation(line: 289, column: 7, scope: !937)
!983 = !{!"llvm.loop.mustprogress"}
!984 = !{!"llvm.loop.unroll.disable"}
!985 = !DILocation(line: 290, column: 8, scope: !938)
!986 = !DILocation(line: 269, column: 38, scope: !939)
!987 = !DILocation(line: 269, column: 17, scope: !939)
!988 = distinct !{!988, !934, !989, !983, !984}
!989 = !DILocation(line: 291, column: 5, scope: !935)
!990 = !{!873, !873, i64 0}
!991 = !DILocation(line: 280, column: 34, scope: !945)
!992 = !DILocation(line: 280, column: 15, scope: !945)
!993 = !DILocation(line: 288, column: 46, scope: !994)
!994 = distinct !DILexicalBlock(scope: !942, file: !706, line: 287, column: 13)
!995 = !DILocation(line: 288, column: 29, scope: !994)
!996 = !DILocation(line: 267, column: 17, scope: !837)
!997 = !DILocation(line: 292, column: 17, scope: !856)
!998 = !DILocation(line: 292, column: 5, scope: !857)
!999 = !DILocation(line: 304, column: 20, scope: !855)
!1000 = !DILocation(line: 297, column: 12, scope: !855)
!1001 = !DILocation(line: 0, scope: !855)
!1002 = !DILocation(line: 299, column: 22, scope: !855)
!1003 = !DILocation(line: 300, column: 24, scope: !855)
!1004 = !DILocation(line: 301, column: 23, scope: !855)
!1005 = !DILocation(line: 302, column: 26, scope: !855)
!1006 = !DILocation(line: 303, column: 24, scope: !855)
!1007 = !DILocation(line: 305, column: 7, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !855, file: !706, line: 305, column: 7)
!1009 = !DILocation(line: 311, column: 13, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !706, line: 306, column: 7)
!1011 = distinct !DILexicalBlock(scope: !1008, file: !706, line: 305, column: 7)
!1012 = !DILocation(line: 307, column: 32, scope: !1010)
!1013 = !DILocation(line: 307, column: 27, scope: !1010)
!1014 = !DILocation(line: 307, column: 25, scope: !1010)
!1015 = !DILocation(line: 308, column: 34, scope: !1010)
!1016 = !DILocation(line: 308, column: 29, scope: !1010)
!1017 = !DILocation(line: 308, column: 27, scope: !1010)
!1018 = !DILocation(line: 309, column: 33, scope: !1010)
!1019 = !DILocation(line: 309, column: 28, scope: !1010)
!1020 = !DILocation(line: 309, column: 26, scope: !1010)
!1021 = !DILocation(line: 310, column: 36, scope: !1010)
!1022 = !DILocation(line: 310, column: 31, scope: !1010)
!1023 = !DILocation(line: 310, column: 29, scope: !1010)
!1024 = !DILocation(line: 312, column: 47, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1010, file: !706, line: 311, column: 13)
!1026 = !DILocation(line: 313, column: 26, scope: !1010)
!1027 = !DILocation(line: 313, column: 37, scope: !1010)
!1028 = !DILocation(line: 313, column: 24, scope: !1010)
!1029 = !DILocation(line: 314, column: 39, scope: !1010)
!1030 = !DILocation(line: 314, column: 28, scope: !1010)
!1031 = !DILocation(line: 314, column: 26, scope: !1010)
!1032 = !DILocation(line: 315, column: 38, scope: !1010)
!1033 = !DILocation(line: 315, column: 27, scope: !1010)
!1034 = !DILocation(line: 315, column: 25, scope: !1010)
!1035 = !DILocation(line: 316, column: 41, scope: !1010)
!1036 = !DILocation(line: 316, column: 30, scope: !1010)
!1037 = !DILocation(line: 316, column: 28, scope: !1010)
!1038 = !DILocation(line: 320, column: 10, scope: !1010)
!1039 = !DILocation(line: 305, column: 40, scope: !1011)
!1040 = !DILocation(line: 305, column: 19, scope: !1011)
!1041 = distinct !{!1041, !1007, !1042, !983, !984}
!1042 = !DILocation(line: 321, column: 7, scope: !1008)
!1043 = !DILocation(line: 318, column: 46, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1010, file: !706, line: 317, column: 13)
!1045 = !DILocation(line: 318, column: 29, scope: !1044)
!1046 = !DILocation(line: 312, column: 30, scope: !1025)
!1047 = !DILocation(line: 322, column: 49, scope: !855)
!1048 = !DILocation(line: 322, column: 63, scope: !855)
!1049 = !DILocation(line: 323, column: 53, scope: !855)
!1050 = !DILocation(line: 323, column: 67, scope: !855)
!1051 = !DILocation(line: 324, column: 51, scope: !855)
!1052 = !DILocation(line: 324, column: 65, scope: !855)
!1053 = !DILocation(line: 325, column: 57, scope: !855)
!1054 = !DILocation(line: 325, column: 71, scope: !855)
!1055 = !DILocation(line: 326, column: 11, scope: !855)
!1056 = !DILocation(line: 327, column: 55, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !855, file: !706, line: 326, column: 11)
!1058 = !DILocation(line: 327, column: 69, scope: !1057)
!1059 = !DILocation(line: 327, column: 9, scope: !1057)
!1060 = !DILocation(line: 328, column: 7, scope: !855)
!1061 = !DILocation(line: 330, column: 7, scope: !855)
!1062 = !DILocation(line: 332, column: 7, scope: !855)
!1063 = !DILocation(line: 334, column: 7, scope: !855)
!1064 = !DILocation(line: 336, column: 11, scope: !855)
!1065 = !DILocation(line: 337, column: 9, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !706, line: 337, column: 9)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !706, line: 337, column: 9)
!1068 = distinct !DILexicalBlock(scope: !855, file: !706, line: 336, column: 11)
!1069 = !DILocation(line: 292, column: 46, scope: !856)
!1070 = distinct !{!1070, !998, !1071, !983, !984}
!1071 = !DILocation(line: 341, column: 5, scope: !857)
!1072 = !DILocation(line: 340, column: 8, scope: !855)
!1073 = !DILocation(line: 339, column: 8, scope: !855)
!1074 = !{i64 0, i64 4, !930}
!1075 = !{i64 0, i64 4, !930, i64 4, i64 4, !930}
!1076 = !DILocation(line: 342, column: 10, scope: !837)
!1077 = !DILocation(line: 343, column: 14, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !837, file: !706, line: 343, column: 9)
!1079 = !DILocation(line: 343, column: 9, scope: !837)
!1080 = !DILocation(line: 345, column: 16, scope: !860)
!1081 = !{!867, !871, i64 568}
!1082 = !DILocation(line: 345, column: 33, scope: !860)
!1083 = !DILocation(line: 345, column: 9, scope: !837)
!1084 = !DILocation(line: 353, column: 66, scope: !859)
!1085 = !DILocation(line: 354, column: 18, scope: !859)
!1086 = !DILocalVariable(name: "image", arg: 1, scope: !1087, file: !1088, line: 27, type: !800)
!1087 = distinct !DISubprogram(name: "SetImageProgress", scope: !1088, file: !1088, line: 27, type: !1089, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1091)
!1088 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a84e9021f92665a913f9cbc20a804774")
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!488, !800, !605, !607, !610}
!1091 = !{!1086, !1092, !1093, !1094, !1095}
!1092 = !DILocalVariable(name: "tag", arg: 2, scope: !1087, file: !1088, line: 28, type: !605)
!1093 = !DILocalVariable(name: "offset", arg: 3, scope: !1087, file: !1088, line: 28, type: !607)
!1094 = !DILocalVariable(name: "extent", arg: 4, scope: !1087, file: !1088, line: 28, type: !610)
!1095 = !DILocalVariable(name: "message", scope: !1087, file: !1088, line: 31, type: !625)
!1096 = !DILocation(line: 0, scope: !1087, inlinedAt: !1097)
!1097 = distinct !DILocation(line: 353, column: 17, scope: !859)
!1098 = !DILocation(line: 30, column: 3, scope: !1087, inlinedAt: !1097)
!1099 = !DILocation(line: 31, column: 5, scope: !1087, inlinedAt: !1097)
!1100 = !DILocation(line: 35, column: 10, scope: !1087, inlinedAt: !1097)
!1101 = !DILocation(line: 36, column: 17, scope: !1087, inlinedAt: !1097)
!1102 = !DILocation(line: 36, column: 63, scope: !1087, inlinedAt: !1097)
!1103 = !{!867, !871, i64 576}
!1104 = !DILocation(line: 36, column: 10, scope: !1087, inlinedAt: !1097)
!1105 = !DILocation(line: 37, column: 1, scope: !1087, inlinedAt: !1097)
!1106 = !DILocation(line: 0, scope: !859)
!1107 = !DILocation(line: 355, column: 21, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !859, file: !706, line: 355, column: 13)
!1109 = !DILocation(line: 355, column: 13, scope: !859)
!1110 = !DILocation(line: 357, column: 7, scope: !859)
!1111 = !DILocation(line: 224, column: 41, scope: !838)
!1112 = distinct !{!1112, !911, !1113, !983, !984}
!1113 = !DILocation(line: 358, column: 3, scope: !839)
!1114 = !DILocation(line: 214, column: 9, scope: !797)
!1115 = !DILocation(line: 359, column: 18, scope: !797)
!1116 = !DILocation(line: 360, column: 14, scope: !797)
!1117 = !DILocation(line: 361, column: 14, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !797, file: !706, line: 361, column: 7)
!1119 = !DILocation(line: 361, column: 7, scope: !797)
!1120 = !DILocation(line: 362, column: 21, scope: !1118)
!1121 = !DILocation(line: 362, column: 5, scope: !1118)
!1122 = !DILocation(line: 364, column: 1, scope: !797)
!1123 = !DISubprogram(name: "LogMagickEvent", scope: !369, file: !369, line: 83, type: !1124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!488, !1126, !605, !605, !802, !605, null}
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !369, line: 58, baseType: !368)
!1128 = !{}
!1129 = !DISubprogram(name: "CloneImage", scope: !73, file: !73, line: 508, type: !1130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!472, !800, !802, !802, !1132, !804}
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!1133 = !DISubprogram(name: "SetImageStorageClass", scope: !73, file: !73, line: 542, type: !1134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!488, !472, !1136}
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!1137 = !DISubprogram(name: "InheritException", scope: !253, file: !253, line: 167, type: !1138, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{null, !804, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!1142 = !DISubprogram(name: "DestroyImage", scope: !73, file: !73, line: 510, type: !1143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!472, !472}
!1145 = !DISubprogram(name: "GetMagickPixelPacket", scope: !326, file: !326, line: 185, type: !1146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !800, !1148}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!1149 = !DISubprogram(name: "AcquireVirtualCacheView", scope: !814, file: !814, line: 55, type: !1150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!812, !800, !804}
!1152 = !DISubprogram(name: "AcquireAuthenticCacheView", scope: !814, file: !814, line: 53, type: !1150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1153 = !DISubprogram(name: "GetCacheViewVirtualPixels", scope: !814, file: !814, line: 69, type: !1154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!695, !1156, !803, !803, !802, !802, !804}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!1158 = !DISubprogram(name: "GetCacheViewAuthenticPixels", scope: !814, file: !814, line: 99, type: !1159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!495, !812, !803, !803, !802, !802, !804}
!1161 = !DISubprogram(name: "GetCacheViewVirtualIndexQueue", scope: !814, file: !814, line: 66, type: !1162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!697, !1156}
!1164 = !DISubprogram(name: "GetCacheViewAuthenticIndexQueue", scope: !814, file: !814, line: 77, type: !1165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!700, !812}
!1167 = !DISubprogram(name: "SyncCacheViewAuthenticPixels", scope: !814, file: !814, line: 89, type: !1168, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!488, !812, !804}
!1170 = !DISubprogram(name: "DestroyCacheView", scope: !814, file: !814, line: 57, type: !1171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!812, !812}
!1173 = distinct !DISubprogram(name: "BilevelImage", scope: !706, file: !706, line: 409, type: !1174, scopeLine: 410, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1177)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!488, !472, !1176}
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!1177 = !{!1178, !1179, !1180}
!1178 = !DILocalVariable(name: "image", arg: 1, scope: !1173, file: !706, line: 409, type: !472)
!1179 = !DILocalVariable(name: "threshold", arg: 2, scope: !1173, file: !706, line: 409, type: !1176)
!1180 = !DILocalVariable(name: "status", scope: !1173, file: !706, line: 412, type: !488)
!1181 = !DILocation(line: 0, scope: !1173)
!1182 = !DILocation(line: 414, column: 10, scope: !1173)
!1183 = !DILocation(line: 415, column: 3, scope: !1173)
!1184 = distinct !DISubprogram(name: "BilevelImageChannel", scope: !706, file: !706, line: 418, type: !1185, scopeLine: 420, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1189)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!488, !472, !1187, !1176}
!1187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !393)
!1189 = !{!1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1202, !1203, !1204}
!1190 = !DILocalVariable(name: "image", arg: 1, scope: !1184, file: !706, line: 418, type: !472)
!1191 = !DILocalVariable(name: "channel", arg: 2, scope: !1184, file: !706, line: 419, type: !1187)
!1192 = !DILocalVariable(name: "threshold", arg: 3, scope: !1184, file: !706, line: 419, type: !1176)
!1193 = !DILocalVariable(name: "image_view", scope: !1184, file: !706, line: 424, type: !812)
!1194 = !DILocalVariable(name: "exception", scope: !1184, file: !706, line: 427, type: !804)
!1195 = !DILocalVariable(name: "status", scope: !1184, file: !706, line: 430, type: !488)
!1196 = !DILocalVariable(name: "progress", scope: !1184, file: !706, line: 433, type: !608)
!1197 = !DILocalVariable(name: "y", scope: !1184, file: !706, line: 436, type: !536)
!1198 = !DILocalVariable(name: "indexes", scope: !1199, file: !706, line: 460, type: !848)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !706, line: 458, column: 3)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !706, line: 457, column: 3)
!1201 = distinct !DILexicalBlock(scope: !1184, file: !706, line: 457, column: 3)
!1202 = !DILocalVariable(name: "x", scope: !1199, file: !706, line: 463, type: !536)
!1203 = !DILocalVariable(name: "q", scope: !1199, file: !706, line: 466, type: !850)
!1204 = !DILocalVariable(name: "proceed", scope: !1205, file: !706, line: 520, type: !488)
!1205 = distinct !DILexicalBlock(scope: !1206, file: !706, line: 518, column: 7)
!1206 = distinct !DILexicalBlock(scope: !1199, file: !706, line: 517, column: 9)
!1207 = !DILocation(line: 0, scope: !1184)
!1208 = !DILocation(line: 440, column: 14, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1184, file: !706, line: 440, column: 7)
!1210 = !DILocation(line: 440, column: 20, scope: !1209)
!1211 = !DILocation(line: 440, column: 7, scope: !1184)
!1212 = !DILocation(line: 441, column: 68, scope: !1209)
!1213 = !DILocation(line: 441, column: 12, scope: !1209)
!1214 = !DILocation(line: 441, column: 5, scope: !1209)
!1215 = !DILocation(line: 442, column: 7, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1184, file: !706, line: 442, column: 7)
!1217 = !DILocation(line: 442, column: 47, scope: !1216)
!1218 = !DILocation(line: 442, column: 7, scope: !1184)
!1219 = !DILocation(line: 444, column: 31, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1184, file: !706, line: 444, column: 7)
!1221 = !DILocalVariable(name: "colorspace", arg: 1, scope: !1222, file: !1223, line: 86, type: !1226)
!1222 = distinct !DISubprogram(name: "IsGrayColorspace", scope: !1223, file: !1223, line: 85, type: !1224, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1227)
!1223 = !DIFile(filename: "apps/538.imagick_r/src/magick/colorspace-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bac8bff1724649a3818d765f5f2e1482")
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!488, !1226}
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!1227 = !{!1221}
!1228 = !DILocation(line: 0, scope: !1222, inlinedAt: !1229)
!1229 = distinct !DILocation(line: 444, column: 7, scope: !1220)
!1230 = !DILocation(line: 88, column: 38, scope: !1231, inlinedAt: !1229)
!1231 = distinct !DILexicalBlock(scope: !1222, file: !1223, line: 88, column: 7)
!1232 = !DILocation(line: 445, column: 12, scope: !1220)
!1233 = !DILocation(line: 445, column: 5, scope: !1220)
!1234 = !DILocation(line: 451, column: 22, scope: !1184)
!1235 = !DILocation(line: 452, column: 14, scope: !1184)
!1236 = !DILocation(line: 457, column: 34, scope: !1200)
!1237 = !DILocation(line: 457, column: 15, scope: !1200)
!1238 = !DILocation(line: 457, column: 3, scope: !1201)
!1239 = !DILocation(line: 477, column: 9, scope: !1199)
!1240 = !DILocation(line: 500, column: 13, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !706, line: 490, column: 7)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !706, line: 489, column: 7)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !706, line: 489, column: 7)
!1244 = distinct !DILexicalBlock(scope: !1199, file: !706, line: 477, column: 9)
!1245 = !DILocation(line: 509, column: 45, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1241, file: !706, line: 509, column: 13)
!1247 = !DILocation(line: 468, column: 16, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1199, file: !706, line: 468, column: 9)
!1249 = !DILocation(line: 468, column: 9, scope: !1199)
!1250 = !DILocation(line: 470, column: 57, scope: !1199)
!1251 = !DILocation(line: 470, column: 7, scope: !1199)
!1252 = !DILocation(line: 0, scope: !1199)
!1253 = !DILocation(line: 471, column: 11, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1199, file: !706, line: 471, column: 9)
!1255 = !DILocation(line: 471, column: 9, scope: !1199)
!1256 = !DILocation(line: 476, column: 13, scope: !1199)
!1257 = !DILocation(line: 489, column: 19, scope: !1242)
!1258 = !DILocation(line: 489, column: 7, scope: !1243)
!1259 = !DILocation(line: 525, column: 66, scope: !1205)
!1260 = !DILocation(line: 526, column: 18, scope: !1205)
!1261 = !DILocation(line: 0, scope: !1087, inlinedAt: !1262)
!1262 = distinct !DILocation(line: 525, column: 17, scope: !1205)
!1263 = !DILocation(line: 30, column: 3, scope: !1087, inlinedAt: !1262)
!1264 = !DILocation(line: 31, column: 5, scope: !1087, inlinedAt: !1262)
!1265 = !DILocation(line: 35, column: 10, scope: !1087, inlinedAt: !1262)
!1266 = !DILocation(line: 36, column: 17, scope: !1087, inlinedAt: !1262)
!1267 = !DILocation(line: 36, column: 63, scope: !1087, inlinedAt: !1262)
!1268 = !DILocation(line: 36, column: 10, scope: !1087, inlinedAt: !1262)
!1269 = !DILocation(line: 37, column: 1, scope: !1087, inlinedAt: !1262)
!1270 = !DILocation(line: 0, scope: !1205)
!1271 = !DILocation(line: 527, column: 21, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1205, file: !706, line: 527, column: 13)
!1273 = !DILocation(line: 527, column: 13, scope: !1205)
!1274 = !DILocation(line: 529, column: 7, scope: !1205)
!1275 = !DILocation(line: 457, column: 41, scope: !1200)
!1276 = distinct !{!1276, !1238, !1277, !983, !984}
!1277 = !DILocation(line: 530, column: 3, scope: !1201)
!1278 = !DILocation(line: 515, column: 9, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1199, file: !706, line: 515, column: 9)
!1280 = !DILocation(line: 515, column: 60, scope: !1279)
!1281 = !DILocation(line: 515, column: 9, scope: !1199)
!1282 = !DILocation(line: 517, column: 16, scope: !1206)
!1283 = !DILocation(line: 517, column: 33, scope: !1206)
!1284 = !DILocation(line: 517, column: 9, scope: !1199)
!1285 = !DILocation(line: 491, column: 13, scope: !1241)
!1286 = !DILocation(line: 492, column: 11, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1241, file: !706, line: 491, column: 13)
!1288 = !DILocation(line: 495, column: 11, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1241, file: !706, line: 494, column: 13)
!1290 = !DILocation(line: 497, column: 13, scope: !1241)
!1291 = !DILocation(line: 498, column: 11, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1241, file: !706, line: 497, column: 13)
!1293 = !DILocation(line: 513, column: 10, scope: !1241)
!1294 = !DILocation(line: 489, column: 48, scope: !1242)
!1295 = distinct !{!1295, !1258, !1296, !983, !984}
!1296 = !DILocation(line: 514, column: 7, scope: !1243)
!1297 = !DILocation(line: 494, column: 13, scope: !1241)
!1298 = !DILocation(line: 509, column: 13, scope: !1241)
!1299 = !DILocation(line: 511, column: 11, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1301, file: !706, line: 511, column: 11)
!1301 = distinct !DILexicalBlock(scope: !1246, file: !706, line: 511, column: 11)
!1302 = !DILocation(line: 0, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1304, file: !706, line: 502, column: 17)
!1304 = distinct !DILexicalBlock(scope: !1305, file: !706, line: 501, column: 11)
!1305 = distinct !DILexicalBlock(scope: !1241, file: !706, line: 500, column: 13)
!1306 = !DILocation(line: 510, column: 21, scope: !1246)
!1307 = !DILocation(line: 510, column: 32, scope: !1246)
!1308 = !DILocation(line: 479, column: 40, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1310, file: !706, line: 479, column: 9)
!1310 = distinct !DILexicalBlock(scope: !1311, file: !706, line: 479, column: 9)
!1311 = distinct !DILexicalBlock(scope: !1244, file: !706, line: 478, column: 7)
!1312 = !DILocation(line: 479, column: 21, scope: !1309)
!1313 = !DILocation(line: 479, column: 9, scope: !1310)
!1314 = !DILocation(line: 481, column: 11, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1309, file: !706, line: 480, column: 9)
!1316 = !DILocation(line: 483, column: 11, scope: !1315)
!1317 = !DILocation(line: 484, column: 11, scope: !1315)
!1318 = !DILocation(line: 485, column: 12, scope: !1315)
!1319 = !DILocation(line: 479, column: 50, scope: !1309)
!1320 = distinct !{!1320, !1313, !1321, !983, !984}
!1321 = !DILocation(line: 486, column: 9, scope: !1310)
!1322 = !DILocation(line: 449, column: 9, scope: !1184)
!1323 = !DILocation(line: 531, column: 14, scope: !1184)
!1324 = !DILocation(line: 532, column: 3, scope: !1184)
!1325 = !DILocation(line: 533, column: 1, scope: !1184)
!1326 = !DISubprogram(name: "SetImageColorspace", scope: !11, file: !11, line: 65, type: !1327, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!488, !472, !1226}
!1329 = !DISubprogram(name: "GetPixelIntensity", scope: !326, file: !326, line: 181, type: !1330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!693, !800, !845}
!1332 = distinct !DISubprogram(name: "BlackThresholdImage", scope: !706, file: !706, line: 568, type: !1333, scopeLine: 570, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1335)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!488, !472, !605}
!1335 = !{!1336, !1337, !1338}
!1336 = !DILocalVariable(name: "image", arg: 1, scope: !1332, file: !706, line: 568, type: !472)
!1337 = !DILocalVariable(name: "threshold", arg: 2, scope: !1332, file: !706, line: 569, type: !605)
!1338 = !DILocalVariable(name: "status", scope: !1332, file: !706, line: 572, type: !488)
!1339 = !DILocation(line: 0, scope: !1332)
!1340 = !DILocation(line: 575, column: 13, scope: !1332)
!1341 = !DILocation(line: 574, column: 10, scope: !1332)
!1342 = !DILocation(line: 576, column: 3, scope: !1332)
!1343 = distinct !DISubprogram(name: "BlackThresholdImageChannel", scope: !706, file: !706, line: 579, type: !1344, scopeLine: 581, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1346)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!488, !472, !1187, !605, !804}
!1346 = !{!1347, !1348, !1349, !1350, !1351, !1352, !1361, !1362, !1363, !1364, !1366, !1367, !1371, !1372, !1373}
!1347 = !DILocalVariable(name: "image", arg: 1, scope: !1343, file: !706, line: 579, type: !472)
!1348 = !DILocalVariable(name: "channel", arg: 2, scope: !1343, file: !706, line: 580, type: !1187)
!1349 = !DILocalVariable(name: "thresholds", arg: 3, scope: !1343, file: !706, line: 580, type: !605)
!1350 = !DILocalVariable(name: "exception", arg: 4, scope: !1343, file: !706, line: 580, type: !804)
!1351 = !DILocalVariable(name: "image_view", scope: !1343, file: !706, line: 585, type: !812)
!1352 = !DILocalVariable(name: "geometry_info", scope: !1343, file: !706, line: 588, type: !1353)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryInfo", file: !153, line: 112, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GeometryInfo", file: !153, line: 104, size: 320, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1360}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !1354, file: !153, line: 107, baseType: !509, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !1354, file: !153, line: 108, baseType: !509, size: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !1354, file: !153, line: 109, baseType: !509, size: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !1354, file: !153, line: 110, baseType: !509, size: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "chi", scope: !1354, file: !153, line: 111, baseType: !509, size: 64, offset: 256)
!1361 = !DILocalVariable(name: "status", scope: !1343, file: !706, line: 591, type: !488)
!1362 = !DILocalVariable(name: "progress", scope: !1343, file: !706, line: 594, type: !608)
!1363 = !DILocalVariable(name: "threshold", scope: !1343, file: !706, line: 597, type: !821)
!1364 = !DILocalVariable(name: "flags", scope: !1343, file: !706, line: 600, type: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1366 = !DILocalVariable(name: "y", scope: !1343, file: !706, line: 603, type: !536)
!1367 = !DILocalVariable(name: "indexes", scope: !1368, file: !706, line: 652, type: !848)
!1368 = distinct !DILexicalBlock(scope: !1369, file: !706, line: 650, column: 3)
!1369 = distinct !DILexicalBlock(scope: !1370, file: !706, line: 649, column: 3)
!1370 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 649, column: 3)
!1371 = !DILocalVariable(name: "x", scope: !1368, file: !706, line: 655, type: !536)
!1372 = !DILocalVariable(name: "q", scope: !1368, file: !706, line: 658, type: !850)
!1373 = !DILocalVariable(name: "proceed", scope: !1374, file: !706, line: 694, type: !488)
!1374 = distinct !DILexicalBlock(scope: !1375, file: !706, line: 692, column: 7)
!1375 = distinct !DILexicalBlock(scope: !1368, file: !706, line: 691, column: 9)
!1376 = !DILocation(line: 0, scope: !1343)
!1377 = !DILocation(line: 587, column: 3, scope: !1343)
!1378 = !DILocation(line: 588, column: 5, scope: !1343)
!1379 = !DILocation(line: 596, column: 3, scope: !1343)
!1380 = !DILocation(line: 597, column: 5, scope: !1343)
!1381 = !DILocation(line: 607, column: 14, scope: !1382)
!1382 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 607, column: 7)
!1383 = !DILocation(line: 607, column: 20, scope: !1382)
!1384 = !DILocation(line: 607, column: 7, scope: !1343)
!1385 = !DILocation(line: 608, column: 68, scope: !1382)
!1386 = !DILocation(line: 608, column: 12, scope: !1382)
!1387 = !DILocation(line: 608, column: 5, scope: !1382)
!1388 = !DILocation(line: 609, column: 18, scope: !1389)
!1389 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 609, column: 7)
!1390 = !DILocation(line: 609, column: 7, scope: !1343)
!1391 = !DILocation(line: 611, column: 7, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 611, column: 7)
!1393 = !DILocation(line: 611, column: 47, scope: !1392)
!1394 = !DILocation(line: 611, column: 7, scope: !1343)
!1395 = !DILocation(line: 613, column: 3, scope: !1343)
!1396 = !DILocation(line: 614, column: 9, scope: !1343)
!1397 = !DILocation(line: 615, column: 31, scope: !1343)
!1398 = !{!1399, !874, i64 0}
!1399 = !{!"_GeometryInfo", !874, i64 0, !874, i64 8, !874, i64 16, !874, i64 24, !874, i64 32}
!1400 = !DILocation(line: 615, column: 17, scope: !1343)
!1401 = !DILocation(line: 615, column: 13, scope: !1343)
!1402 = !DILocation(line: 615, column: 16, scope: !1343)
!1403 = !{!1404, !931, i64 32}
!1404 = !{!"_MagickPixelPacket", !868, i64 0, !868, i64 4, !868, i64 8, !874, i64 16, !870, i64 24, !931, i64 32, !931, i64 36, !931, i64 40, !931, i64 44, !931, i64 48}
!1405 = !DILocation(line: 616, column: 33, scope: !1343)
!1406 = !{!1399, !874, i64 8}
!1407 = !DILocation(line: 616, column: 19, scope: !1343)
!1408 = !DILocation(line: 616, column: 13, scope: !1343)
!1409 = !DILocation(line: 617, column: 14, scope: !1410)
!1410 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 617, column: 7)
!1411 = !DILocation(line: 617, column: 28, scope: !1410)
!1412 = !DILocation(line: 617, column: 7, scope: !1343)
!1413 = !DILocation(line: 619, column: 32, scope: !1343)
!1414 = !{!1399, !874, i64 16}
!1415 = !DILocation(line: 619, column: 18, scope: !1343)
!1416 = !DILocation(line: 619, column: 13, scope: !1343)
!1417 = !DILocation(line: 620, column: 14, scope: !1418)
!1418 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 620, column: 7)
!1419 = !DILocation(line: 620, column: 25, scope: !1418)
!1420 = !DILocation(line: 620, column: 7, scope: !1343)
!1421 = !DILocation(line: 622, column: 35, scope: !1343)
!1422 = !{!1399, !874, i64 24}
!1423 = !DILocation(line: 622, column: 21, scope: !1343)
!1424 = !DILocation(line: 622, column: 13, scope: !1343)
!1425 = !DILocation(line: 623, column: 14, scope: !1426)
!1426 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 623, column: 7)
!1427 = !DILocation(line: 623, column: 26, scope: !1426)
!1428 = !DILocation(line: 623, column: 7, scope: !1343)
!1429 = !DILocation(line: 625, column: 33, scope: !1343)
!1430 = !{!1399, !874, i64 32}
!1431 = !DILocation(line: 625, column: 19, scope: !1343)
!1432 = !DILocation(line: 625, column: 13, scope: !1343)
!1433 = !DILocation(line: 626, column: 14, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 626, column: 7)
!1435 = !DILocation(line: 626, column: 26, scope: !1434)
!1436 = !DILocation(line: 626, column: 7, scope: !1343)
!1437 = !DILocation(line: 628, column: 14, scope: !1438)
!1438 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 628, column: 7)
!1439 = !DILocation(line: 628, column: 30, scope: !1438)
!1440 = !DILocation(line: 628, column: 7, scope: !1343)
!1441 = !DILocation(line: 630, column: 20, scope: !1442)
!1442 = distinct !DILexicalBlock(scope: !1438, file: !706, line: 629, column: 5)
!1443 = !DILocation(line: 631, column: 22, scope: !1442)
!1444 = !{!1404, !931, i64 36}
!1445 = !DILocation(line: 632, column: 21, scope: !1442)
!1446 = !{!1404, !931, i64 40}
!1447 = !DILocation(line: 633, column: 24, scope: !1442)
!1448 = !{!1404, !931, i64 44}
!1449 = !DILocation(line: 634, column: 22, scope: !1442)
!1450 = !{!1404, !931, i64 48}
!1451 = !DILocation(line: 635, column: 5, scope: !1442)
!1452 = !DILocalVariable(name: "pixel", arg: 1, scope: !1453, file: !1454, line: 76, type: !1457)
!1453 = distinct !DISubprogram(name: "IsMagickGray", scope: !1454, file: !1454, line: 76, type: !1455, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1459)
!1454 = !DIFile(filename: "apps/538.imagick_r/src/magick/color-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "1d5db1c576095b1d3349b678b2a970e8")
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!488, !1457}
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!1459 = !{!1452}
!1460 = !DILocation(line: 0, scope: !1453, inlinedAt: !1461)
!1461 = distinct !DILocation(line: 636, column: 8, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1343, file: !706, line: 636, column: 7)
!1463 = !DILocation(line: 78, column: 15, scope: !1464, inlinedAt: !1461)
!1464 = distinct !DILexicalBlock(scope: !1453, file: !1454, line: 78, column: 7)
!1465 = !{!1404, !868, i64 4}
!1466 = !DILocation(line: 78, column: 45, scope: !1464, inlinedAt: !1461)
!1467 = !DILocation(line: 81, column: 23, scope: !1468, inlinedAt: !1461)
!1468 = distinct !DILexicalBlock(scope: !1453, file: !1454, line: 81, column: 7)
!1469 = !DILocation(line: 81, column: 8, scope: !1468, inlinedAt: !1461)
!1470 = !DILocation(line: 81, column: 38, scope: !1468, inlinedAt: !1461)
!1471 = !DILocation(line: 81, column: 55, scope: !1468, inlinedAt: !1461)
!1472 = !DILocation(line: 82, column: 25, scope: !1468, inlinedAt: !1461)
!1473 = !DILocation(line: 82, column: 8, scope: !1468, inlinedAt: !1461)
!1474 = !DILocation(line: 82, column: 39, scope: !1468, inlinedAt: !1461)
!1475 = !DILocation(line: 81, column: 7, scope: !1453, inlinedAt: !1461)
!1476 = !DILocation(line: 637, column: 32, scope: !1462)
!1477 = !DILocation(line: 0, scope: !1222, inlinedAt: !1478)
!1478 = distinct !DILocation(line: 637, column: 8, scope: !1462)
!1479 = !DILocation(line: 88, column: 38, scope: !1231, inlinedAt: !1478)
!1480 = !DILocation(line: 638, column: 12, scope: !1462)
!1481 = !DILocation(line: 638, column: 5, scope: !1462)
!1482 = !DILocation(line: 644, column: 14, scope: !1343)
!1483 = !DILocation(line: 649, column: 34, scope: !1369)
!1484 = !DILocation(line: 649, column: 15, scope: !1369)
!1485 = !DILocation(line: 649, column: 3, scope: !1370)
!1486 = !DILocation(line: 660, column: 16, scope: !1487)
!1487 = distinct !DILexicalBlock(scope: !1368, file: !706, line: 660, column: 9)
!1488 = !DILocation(line: 660, column: 9, scope: !1368)
!1489 = !DILocation(line: 662, column: 57, scope: !1368)
!1490 = !DILocation(line: 662, column: 7, scope: !1368)
!1491 = !DILocation(line: 0, scope: !1368)
!1492 = !DILocation(line: 663, column: 11, scope: !1493)
!1493 = distinct !DILexicalBlock(scope: !1368, file: !706, line: 663, column: 9)
!1494 = !DILocation(line: 663, column: 9, scope: !1368)
!1495 = !DILocation(line: 668, column: 13, scope: !1368)
!1496 = !DILocation(line: 669, column: 17, scope: !1497)
!1497 = distinct !DILexicalBlock(scope: !1498, file: !706, line: 669, column: 5)
!1498 = distinct !DILexicalBlock(scope: !1368, file: !706, line: 669, column: 5)
!1499 = !DILocation(line: 669, column: 5, scope: !1498)
!1500 = !DILocation(line: 683, column: 43, scope: !1501)
!1501 = distinct !DILexicalBlock(scope: !1502, file: !706, line: 683, column: 11)
!1502 = distinct !DILexicalBlock(scope: !1497, file: !706, line: 670, column: 5)
!1503 = !DILocation(line: 671, column: 41, scope: !1504)
!1504 = distinct !DILexicalBlock(scope: !1502, file: !706, line: 671, column: 11)
!1505 = !DILocation(line: 672, column: 29, scope: !1504)
!1506 = !DILocation(line: 672, column: 12, scope: !1504)
!1507 = !DILocation(line: 672, column: 44, scope: !1504)
!1508 = !DILocation(line: 671, column: 11, scope: !1502)
!1509 = !DILocation(line: 673, column: 9, scope: !1504)
!1510 = !DILocation(line: 674, column: 43, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1502, file: !706, line: 674, column: 11)
!1512 = !DILocation(line: 675, column: 29, scope: !1511)
!1513 = !DILocation(line: 675, column: 12, scope: !1511)
!1514 = !DILocation(line: 675, column: 46, scope: !1511)
!1515 = !DILocation(line: 674, column: 11, scope: !1502)
!1516 = !DILocation(line: 676, column: 9, scope: !1511)
!1517 = !DILocation(line: 677, column: 42, scope: !1518)
!1518 = distinct !DILexicalBlock(scope: !1502, file: !706, line: 677, column: 11)
!1519 = !DILocation(line: 678, column: 29, scope: !1518)
!1520 = !DILocation(line: 678, column: 12, scope: !1518)
!1521 = !DILocation(line: 678, column: 45, scope: !1518)
!1522 = !DILocation(line: 677, column: 11, scope: !1502)
!1523 = !DILocation(line: 679, column: 9, scope: !1518)
!1524 = !DILocation(line: 680, column: 45, scope: !1525)
!1525 = distinct !DILexicalBlock(scope: !1502, file: !706, line: 680, column: 11)
!1526 = !DILocation(line: 681, column: 29, scope: !1525)
!1527 = !DILocation(line: 681, column: 12, scope: !1525)
!1528 = !DILocation(line: 681, column: 48, scope: !1525)
!1529 = !DILocation(line: 680, column: 11, scope: !1502)
!1530 = !DILocation(line: 682, column: 9, scope: !1525)
!1531 = !DILocation(line: 687, column: 8, scope: !1502)
!1532 = !DILocation(line: 669, column: 46, scope: !1497)
!1533 = distinct !{!1533, !1499, !1534, !983, !984}
!1534 = !DILocation(line: 688, column: 5, scope: !1498)
!1535 = !DILocation(line: 684, column: 49, scope: !1501)
!1536 = !DILocation(line: 685, column: 29, scope: !1501)
!1537 = !DILocation(line: 685, column: 12, scope: !1501)
!1538 = !DILocation(line: 685, column: 54, scope: !1501)
!1539 = !DILocation(line: 683, column: 11, scope: !1502)
!1540 = !DILocation(line: 686, column: 9, scope: !1541)
!1541 = distinct !DILexicalBlock(scope: !1542, file: !706, line: 686, column: 9)
!1542 = distinct !DILexicalBlock(scope: !1501, file: !706, line: 686, column: 9)
!1543 = !DILocation(line: 689, column: 9, scope: !1544)
!1544 = distinct !DILexicalBlock(scope: !1368, file: !706, line: 689, column: 9)
!1545 = !DILocation(line: 689, column: 60, scope: !1544)
!1546 = !DILocation(line: 689, column: 9, scope: !1368)
!1547 = !DILocation(line: 691, column: 16, scope: !1375)
!1548 = !DILocation(line: 691, column: 33, scope: !1375)
!1549 = !DILocation(line: 691, column: 9, scope: !1368)
!1550 = !DILocation(line: 699, column: 66, scope: !1374)
!1551 = !DILocation(line: 700, column: 18, scope: !1374)
!1552 = !DILocation(line: 0, scope: !1087, inlinedAt: !1553)
!1553 = distinct !DILocation(line: 699, column: 17, scope: !1374)
!1554 = !DILocation(line: 30, column: 3, scope: !1087, inlinedAt: !1553)
!1555 = !DILocation(line: 31, column: 5, scope: !1087, inlinedAt: !1553)
!1556 = !DILocation(line: 35, column: 10, scope: !1087, inlinedAt: !1553)
!1557 = !DILocation(line: 36, column: 17, scope: !1087, inlinedAt: !1553)
!1558 = !DILocation(line: 36, column: 63, scope: !1087, inlinedAt: !1553)
!1559 = !DILocation(line: 36, column: 10, scope: !1087, inlinedAt: !1553)
!1560 = !DILocation(line: 37, column: 1, scope: !1087, inlinedAt: !1553)
!1561 = !DILocation(line: 0, scope: !1374)
!1562 = !DILocation(line: 701, column: 21, scope: !1563)
!1563 = distinct !DILexicalBlock(scope: !1374, file: !706, line: 701, column: 13)
!1564 = !DILocation(line: 701, column: 13, scope: !1374)
!1565 = !DILocation(line: 703, column: 7, scope: !1374)
!1566 = !DILocation(line: 649, column: 41, scope: !1369)
!1567 = distinct !{!1567, !1485, !1568, !983, !984}
!1568 = !DILocation(line: 704, column: 3, scope: !1370)
!1569 = !DILocation(line: 642, column: 9, scope: !1343)
!1570 = !DILocation(line: 705, column: 14, scope: !1343)
!1571 = !DILocation(line: 706, column: 3, scope: !1343)
!1572 = !DILocation(line: 707, column: 1, scope: !1343)
!1573 = !DISubprogram(name: "ParseGeometry", scope: !153, file: !153, line: 143, type: !1574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1128)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!1365, !605, !1576}
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1577 = distinct !DISubprogram(name: "ClampImage", scope: !706, file: !706, line: 751, type: !1578, scopeLine: 752, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1580)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!488, !472}
!1580 = !{!1581, !1582}
!1581 = !DILocalVariable(name: "image", arg: 1, scope: !1577, file: !706, line: 751, type: !472)
!1582 = !DILocalVariable(name: "status", scope: !1577, file: !706, line: 754, type: !488)
!1583 = !DILocation(line: 0, scope: !1577)
!1584 = !DILocation(line: 756, column: 10, scope: !1577)
!1585 = !DILocation(line: 757, column: 3, scope: !1577)
!1586 = distinct !DISubprogram(name: "ClampImageChannel", scope: !706, file: !706, line: 760, type: !1587, scopeLine: 762, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1589)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{!488, !472, !1187}
