; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/input/timecode.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/input/timecode.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_input_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.timecode_hnd_t = type { %struct.cli_input_t, ptr, i32, i32, i32, i64, i64, i32, i32, ptr, double, double }
%struct.cli_input_opt_t = type { ptr, ptr, ptr, i32 }
%struct.video_info_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.x264_picture_t = type { i32, i32, i32, i32, i64, i64, ptr, %struct.x264_image_t, %struct.x264_hrd_t, ptr }
%struct.x264_image_t = type { i32, i32, [4 x i32], [4 x ptr] }
%struct.x264_hrd_t = type { double, double, double, double }

@timecode_input = dso_local local_unnamed_addr global %struct.cli_input_t { ptr @open_file, ptr @get_frame_total, ptr null, ptr @read_frame, ptr @release_frame, ptr null, ptr @close_file }, align 8, !dbg !0
@stderr = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [33 x i8] c"timecode [error]: malloc failed\0A\00", align 1
@input = external local_unnamed_addr global %struct.cli_input_t, align 8
@.str.1 = private unnamed_addr constant [8 x i8] c"%lu/%lu\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "timecode_input", scope: !2, file: !14, line: 499, type: !15, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !13, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/input/timecode.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "38d56a1630a2a8343c423fb69854a920")
!4 = !{!5, !6, !7, !8}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !9, line: 27, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !11, line: 44, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!12 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!13 = !{!0}
!14 = !DIFile(filename: "apps/525.x264_r/src/x264_src/input/timecode.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "38d56a1630a2a8343c423fb69854a920")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_t", file: !16, line: 63, baseType: !17)
!16 = !DIFile(filename: "apps/525.x264_r/src/x264_src/input/input.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f28c863d273681dfcaca9779e9fcbd53")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 54, size: 448, elements: !18)
!18 = !{!19, !56, !60, !269, !273, !277, !281}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !17, file: !16, line: 56, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!6, !23, !25, !28, !48}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !27, line: 30, baseType: !5)
!27 = !DIFile(filename: "apps/525.x264_r/src/x264_src/muxers.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bcea0820748b2dc47392b7f6393a96ff")
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_info_t", file: !16, line: 52, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 38, size: 384, elements: !31)
!31 = !{!32, !33, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "csp", scope: !30, file: !16, line: 40, baseType: !6, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "fps_num", scope: !30, file: !16, line: 41, baseType: !34, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !35, line: 26, baseType: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !11, line: 42, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fps_den", scope: !30, file: !16, line: 42, baseType: !34, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !30, file: !16, line: 43, baseType: !6, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !30, file: !16, line: 44, baseType: !6, size: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !30, file: !16, line: 45, baseType: !34, size: 32, offset: 160)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !30, file: !16, line: 46, baseType: !34, size: 32, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tff", scope: !30, file: !16, line: 47, baseType: !6, size: 32, offset: 224)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !30, file: !16, line: 48, baseType: !34, size: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !30, file: !16, line: 49, baseType: !34, size: 32, offset: 288)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "vfr", scope: !30, file: !16, line: 50, baseType: !6, size: 32, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !30, file: !16, line: 51, baseType: !6, size: 32, offset: 352)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_opt_t", file: !16, line: 35, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 29, size: 256, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !50, file: !16, line: 31, baseType: !23, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !50, file: !16, line: 32, baseType: !23, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "timebase", scope: !50, file: !16, line: 33, baseType: !23, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !50, file: !16, line: 34, baseType: !6, size: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "get_frame_total", scope: !17, file: !16, line: 57, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!6, !26}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "picture_alloc", scope: !17, file: !16, line: 58, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!6, !64, !6, !6, !6}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !66, line: 549, baseType: !67)
!66 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 513, size: 1088, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !247, !260, !268}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !67, file: !66, line: 521, baseType: !6, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !67, file: !66, line: 523, baseType: !6, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !67, file: !66, line: 526, baseType: !6, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !67, file: !66, line: 529, baseType: !6, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !67, file: !66, line: 531, baseType: !8, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !67, file: !66, line: 534, baseType: !8, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !67, file: !66, line: 541, baseType: !76, size: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !66, line: 376, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !66, line: 176, size: 5632, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !128, !129, !130, !131, !135, !136, !150, !151, !152, !153, !154, !185, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !78, file: !66, line: 179, baseType: !37, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !78, file: !66, line: 180, baseType: !6, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !78, file: !66, line: 181, baseType: !6, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !78, file: !66, line: 182, baseType: !6, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !78, file: !66, line: 183, baseType: !6, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !78, file: !66, line: 186, baseType: !6, size: 32, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !78, file: !66, line: 187, baseType: !6, size: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !78, file: !66, line: 188, baseType: !6, size: 32, offset: 224)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !78, file: !66, line: 189, baseType: !6, size: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !78, file: !66, line: 190, baseType: !6, size: 32, offset: 288)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !78, file: !66, line: 198, baseType: !6, size: 32, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !78, file: !66, line: 215, baseType: !92, size: 288, offset: 352)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !66, line: 200, size: 288, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !92, file: !66, line: 203, baseType: !6, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !92, file: !66, line: 204, baseType: !6, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !92, file: !66, line: 206, baseType: !6, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !92, file: !66, line: 209, baseType: !6, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !92, file: !66, line: 210, baseType: !6, size: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !92, file: !66, line: 211, baseType: !6, size: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !92, file: !66, line: 212, baseType: !6, size: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !92, file: !66, line: 213, baseType: !6, size: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !92, file: !66, line: 214, baseType: !6, size: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !78, file: !66, line: 218, baseType: !6, size: 32, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !78, file: !66, line: 219, baseType: !6, size: 32, offset: 672)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !78, file: !66, line: 220, baseType: !6, size: 32, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !78, file: !66, line: 221, baseType: !6, size: 32, offset: 736)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !78, file: !66, line: 222, baseType: !6, size: 32, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !78, file: !66, line: 224, baseType: !6, size: 32, offset: 800)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !78, file: !66, line: 225, baseType: !6, size: 32, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !78, file: !66, line: 226, baseType: !6, size: 32, offset: 864)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !78, file: !66, line: 227, baseType: !6, size: 32, offset: 896)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !78, file: !66, line: 229, baseType: !6, size: 32, offset: 928)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !78, file: !66, line: 230, baseType: !6, size: 32, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !78, file: !66, line: 231, baseType: !6, size: 32, offset: 992)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !78, file: !66, line: 233, baseType: !6, size: 32, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !78, file: !66, line: 234, baseType: !6, size: 32, offset: 1056)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !78, file: !66, line: 236, baseType: !6, size: 32, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !78, file: !66, line: 237, baseType: !6, size: 32, offset: 1120)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !78, file: !66, line: 239, baseType: !6, size: 32, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !78, file: !66, line: 240, baseType: !23, size: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !78, file: !66, line: 241, baseType: !122, size: 128, offset: 1280)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !126)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !35, line: 24, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !11, line: 38, baseType: !125)
!125 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !{!127}
!127 = !DISubrange(count: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !78, file: !66, line: 242, baseType: !122, size: 128, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !78, file: !66, line: 243, baseType: !122, size: 128, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !78, file: !66, line: 244, baseType: !122, size: 128, offset: 1664)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !78, file: !66, line: 245, baseType: !132, size: 512, offset: 1792)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 512, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !78, file: !66, line: 246, baseType: !132, size: 512, offset: 2304)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !78, file: !66, line: 249, baseType: !137, size: 64, offset: 2816)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !5, !6, !140, !142}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !144)
!144 = !{!145, !147, !148, !149}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !143, file: !146, line: 499, baseType: !37, size: 32)
!146 = !DIFile(filename: "apps/525.x264_r/src/x264_src/input/timecode.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !143, file: !146, line: 499, baseType: !37, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !143, file: !146, line: 499, baseType: !5, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !143, file: !146, line: 499, baseType: !5, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !78, file: !66, line: 250, baseType: !5, size: 64, offset: 2880)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !78, file: !66, line: 251, baseType: !6, size: 32, offset: 2944)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !78, file: !66, line: 252, baseType: !6, size: 32, offset: 2976)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !78, file: !66, line: 253, baseType: !23, size: 64, offset: 3008)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !78, file: !66, line: 287, baseType: !155, size: 800, offset: 3072)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !66, line: 256, size: 800, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !177, !178, !179, !183, !184}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !155, file: !66, line: 258, baseType: !37, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !155, file: !66, line: 259, baseType: !37, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !155, file: !66, line: 261, baseType: !6, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !155, file: !66, line: 262, baseType: !6, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !155, file: !66, line: 263, baseType: !6, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !155, file: !66, line: 264, baseType: !6, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !155, file: !66, line: 265, baseType: !6, size: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !155, file: !66, line: 267, baseType: !6, size: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !155, file: !66, line: 268, baseType: !6, size: 32, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !155, file: !66, line: 269, baseType: !6, size: 32, offset: 288)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !155, file: !66, line: 270, baseType: !6, size: 32, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !155, file: !66, line: 271, baseType: !6, size: 32, offset: 352)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !155, file: !66, line: 272, baseType: !6, size: 32, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !155, file: !66, line: 273, baseType: !6, size: 32, offset: 416)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !155, file: !66, line: 274, baseType: !6, size: 32, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !155, file: !66, line: 275, baseType: !6, size: 32, offset: 480)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !155, file: !66, line: 276, baseType: !6, size: 32, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !155, file: !66, line: 277, baseType: !6, size: 32, offset: 544)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !155, file: !66, line: 278, baseType: !176, size: 32, offset: 576)
!176 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !155, file: !66, line: 279, baseType: !176, size: 32, offset: 608)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !155, file: !66, line: 280, baseType: !6, size: 32, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !155, file: !66, line: 283, baseType: !180, size: 64, offset: 672)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 2)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !155, file: !66, line: 285, baseType: !6, size: 32, offset: 736)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !155, file: !66, line: 286, baseType: !6, size: 32, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !78, file: !66, line: 327, baseType: !186, size: 1152, offset: 3904)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !66, line: 290, size: 1152, elements: !187)
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !225, !226}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !186, file: !66, line: 292, baseType: !6, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !186, file: !66, line: 294, baseType: !6, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !186, file: !66, line: 295, baseType: !6, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !186, file: !66, line: 296, baseType: !6, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !186, file: !66, line: 297, baseType: !6, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !186, file: !66, line: 299, baseType: !6, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !186, file: !66, line: 300, baseType: !176, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !186, file: !66, line: 301, baseType: !176, size: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !186, file: !66, line: 302, baseType: !176, size: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !186, file: !66, line: 303, baseType: !6, size: 32, offset: 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !186, file: !66, line: 304, baseType: !6, size: 32, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !186, file: !66, line: 305, baseType: !176, size: 32, offset: 352)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !186, file: !66, line: 306, baseType: !176, size: 32, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !186, file: !66, line: 307, baseType: !176, size: 32, offset: 416)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !186, file: !66, line: 309, baseType: !6, size: 32, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !186, file: !66, line: 310, baseType: !176, size: 32, offset: 480)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !186, file: !66, line: 311, baseType: !6, size: 32, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !186, file: !66, line: 312, baseType: !6, size: 32, offset: 544)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !186, file: !66, line: 315, baseType: !6, size: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !186, file: !66, line: 316, baseType: !23, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !186, file: !66, line: 317, baseType: !6, size: 32, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !186, file: !66, line: 318, baseType: !23, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !186, file: !66, line: 321, baseType: !176, size: 32, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !186, file: !66, line: 322, baseType: !176, size: 32, offset: 864)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !186, file: !66, line: 323, baseType: !176, size: 32, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !186, file: !66, line: 324, baseType: !214, size: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !66, line: 174, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 167, size: 256, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !216, file: !66, line: 169, baseType: !6, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !216, file: !66, line: 169, baseType: !6, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !216, file: !66, line: 170, baseType: !6, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !216, file: !66, line: 171, baseType: !6, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !216, file: !66, line: 172, baseType: !176, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !216, file: !66, line: 173, baseType: !224, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !186, file: !66, line: 325, baseType: !6, size: 32, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !186, file: !66, line: 326, baseType: !23, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !78, file: !66, line: 330, baseType: !6, size: 32, offset: 5056)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !78, file: !66, line: 331, baseType: !6, size: 32, offset: 5088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !78, file: !66, line: 332, baseType: !6, size: 32, offset: 5120)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !78, file: !66, line: 334, baseType: !6, size: 32, offset: 5152)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !78, file: !66, line: 335, baseType: !6, size: 32, offset: 5184)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !78, file: !66, line: 336, baseType: !34, size: 32, offset: 5216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !78, file: !66, line: 337, baseType: !34, size: 32, offset: 5248)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !78, file: !66, line: 338, baseType: !34, size: 32, offset: 5280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !78, file: !66, line: 339, baseType: !34, size: 32, offset: 5312)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !78, file: !66, line: 340, baseType: !6, size: 32, offset: 5344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !78, file: !66, line: 344, baseType: !6, size: 32, offset: 5376)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !78, file: !66, line: 356, baseType: !6, size: 32, offset: 5408)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !78, file: !66, line: 364, baseType: !6, size: 32, offset: 5440)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !78, file: !66, line: 367, baseType: !6, size: 32, offset: 5472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !78, file: !66, line: 368, baseType: !6, size: 32, offset: 5504)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !78, file: !66, line: 369, baseType: !6, size: 32, offset: 5536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !78, file: !66, line: 375, baseType: !244, size: 64, offset: 5568)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !5}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !67, file: !66, line: 543, baseType: !248, size: 448, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !66, line: 511, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 505, size: 448, elements: !250)
!250 = !{!251, !252, !253, !257}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !249, file: !66, line: 507, baseType: !6, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !249, file: !66, line: 508, baseType: !6, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !249, file: !66, line: 509, baseType: !254, size: 128, offset: 64)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 4)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !249, file: !66, line: 510, baseType: !258, size: 256, offset: 192)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 256, elements: !255)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !67, file: !66, line: 545, baseType: !261, size: 256, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !66, line: 503, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 496, size: 256, elements: !263)
!263 = !{!264, !265, !266, !267}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !262, file: !66, line: 498, baseType: !7, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !262, file: !66, line: 499, baseType: !7, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !262, file: !66, line: 500, baseType: !7, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !262, file: !66, line: 502, baseType: !7, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !67, file: !66, line: 548, baseType: !5, size: 64, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "read_frame", scope: !17, file: !16, line: 59, baseType: !270, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!6, !64, !26, !6}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "release_frame", scope: !17, file: !16, line: 60, baseType: !274, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!6, !64, !26}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "picture_clean", scope: !17, file: !16, line: 61, baseType: !278, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !64}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !17, file: !16, line: 62, baseType: !57, size: 64, offset: 384)
!282 = !{i32 7, !"Dwarf Version", i32 5}
!283 = !{i32 2, !"Debug Info Version", i32 3}
!284 = !{i32 1, !"wchar_size", i32 4}
!285 = !{i32 7, !"PIC Level", i32 2}
!286 = !{i32 7, !"PIE Level", i32 2}
!287 = !{i32 7, !"uwtable", i32 2}
!288 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!289 = distinct !DISubprogram(name: "open_file", scope: !14, file: !14, line: 384, type: !21, scopeLine: 385, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !354}
!291 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !289, file: !14, line: 384, type: !23)
!292 = !DILocalVariable(name: "p_handle", arg: 2, scope: !289, file: !14, line: 384, type: !25)
!293 = !DILocalVariable(name: "info", arg: 3, scope: !289, file: !14, line: 384, type: !28)
!294 = !DILocalVariable(name: "opt", arg: 4, scope: !289, file: !14, line: 384, type: !48)
!295 = !DILocalVariable(name: "ret", scope: !289, file: !14, line: 386, type: !6)
!296 = !DILocalVariable(name: "tcfile_in", scope: !289, file: !14, line: 387, type: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !299, line: 7, baseType: !300)
!299 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !301, line: 49, size: 1728, elements: !302)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !318, !320, !321, !322, !324, !326, !328, !332, !335, !337, !340, !343, !344, !345, !349, !350}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !300, file: !301, line: 51, baseType: !6, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !300, file: !301, line: 54, baseType: !23, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !300, file: !301, line: 55, baseType: !23, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !300, file: !301, line: 56, baseType: !23, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !300, file: !301, line: 57, baseType: !23, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !300, file: !301, line: 58, baseType: !23, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !300, file: !301, line: 59, baseType: !23, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !300, file: !301, line: 60, baseType: !23, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !300, file: !301, line: 61, baseType: !23, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !300, file: !301, line: 64, baseType: !23, size: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !300, file: !301, line: 65, baseType: !23, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !300, file: !301, line: 66, baseType: !23, size: 64, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !300, file: !301, line: 68, baseType: !316, size: 64, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !301, line: 36, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !300, file: !301, line: 70, baseType: !319, size: 64, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !300, file: !301, line: 72, baseType: !6, size: 32, offset: 896)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !300, file: !301, line: 73, baseType: !6, size: 32, offset: 928)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !300, file: !301, line: 74, baseType: !323, size: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !11, line: 152, baseType: !12)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !300, file: !301, line: 77, baseType: !325, size: 16, offset: 1024)
!325 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !300, file: !301, line: 78, baseType: !327, size: 8, offset: 1040)
!327 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !300, file: !301, line: 79, baseType: !329, size: 8, offset: 1048)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 1)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !300, file: !301, line: 81, baseType: !333, size: 64, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !301, line: 43, baseType: null)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !300, file: !301, line: 89, baseType: !336, size: 64, offset: 1152)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !11, line: 153, baseType: !12)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !300, file: !301, line: 91, baseType: !338, size: 64, offset: 1216)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !301, line: 37, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !300, file: !301, line: 92, baseType: !341, size: 64, offset: 1280)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !301, line: 38, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !300, file: !301, line: 93, baseType: !319, size: 64, offset: 1344)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !300, file: !301, line: 94, baseType: !5, size: 64, offset: 1408)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !300, file: !301, line: 95, baseType: !346, size: 64, offset: 1472)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !347, line: 46, baseType: !348)
!347 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!348 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !300, file: !301, line: 96, baseType: !6, size: 32, offset: 1536)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !300, file: !301, line: 98, baseType: !351, size: 160, offset: 1568)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 20)
!354 = !DILocalVariable(name: "h", scope: !289, file: !14, line: 388, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "timecode_hnd_t", file: !14, line: 42, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 28, size: 1024, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !367, !368, !369, !370, !372, !373}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !357, file: !14, line: 30, baseType: !15, size: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "p_handle", scope: !357, file: !14, line: 31, baseType: !26, size: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "frame_total", scope: !357, file: !14, line: 32, baseType: !6, size: 32, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "auto_timebase_num", scope: !357, file: !14, line: 33, baseType: !6, size: 32, offset: 544)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "auto_timebase_den", scope: !357, file: !14, line: 34, baseType: !6, size: 32, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !357, file: !14, line: 35, baseType: !365, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !35, line: 27, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !11, line: 45, baseType: !348)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !357, file: !14, line: 36, baseType: !365, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !357, file: !14, line: 37, baseType: !6, size: 32, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "stored_pts_num", scope: !357, file: !14, line: 38, baseType: !6, size: 32, offset: 800)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !357, file: !14, line: 39, baseType: !371, size: 64, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "assume_fps", scope: !357, file: !14, line: 40, baseType: !7, size: 64, offset: 896)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "last_timecode", scope: !357, file: !14, line: 41, baseType: !7, size: 64, offset: 960)
!374 = !DILocation(line: 0, scope: !289)
!375 = !DILocation(line: 388, column: 25, scope: !289)
!376 = !DILocation(line: 389, column: 10, scope: !377)
!377 = distinct !DILexicalBlock(scope: !289, file: !14, line: 389, column: 9)
!378 = !DILocation(line: 389, column: 9, scope: !289)
!379 = !DILocation(line: 391, column: 18, scope: !380)
!380 = distinct !DILexicalBlock(scope: !377, file: !14, line: 390, column: 5)
!381 = !{!382, !382, i64 0}
!382 = !{!"any pointer", !383, i64 0}
!383 = !{!"omnipotent char", !384, i64 0}
!384 = !{!"Simple C/C++ TBAA"}
!385 = !DILocation(line: 391, column: 9, scope: !380)
!386 = !DILocation(line: 392, column: 9, scope: !380)
!387 = !DILocation(line: 394, column: 16, scope: !289)
!388 = !{i64 0, i64 8, !381, i64 8, i64 8, !381, i64 16, i64 8, !381, i64 24, i64 8, !381, i64 32, i64 8, !381, i64 40, i64 8, !381, i64 48, i64 8, !381}
!389 = !DILocation(line: 395, column: 19, scope: !289)
!390 = !DILocation(line: 395, column: 8, scope: !289)
!391 = !DILocation(line: 395, column: 17, scope: !289)
!392 = !{!393, !382, i64 56}
!393 = !{!"", !394, i64 0, !382, i64 56, !395, i64 64, !395, i64 68, !395, i64 72, !396, i64 80, !396, i64 88, !395, i64 96, !395, i64 100, !382, i64 104, !397, i64 112, !397, i64 120}
!394 = !{!"", !382, i64 0, !382, i64 8, !382, i64 16, !382, i64 24, !382, i64 32, !382, i64 40, !382, i64 48}
!395 = !{!"int", !383, i64 0}
!396 = !{!"long", !383, i64 0}
!397 = !{!"double", !383, i64 0}
!398 = !DILocation(line: 396, column: 28, scope: !289)
!399 = !{!394, !382, i64 8}
!400 = !DILocation(line: 396, column: 22, scope: !289)
!401 = !DILocation(line: 396, column: 8, scope: !289)
!402 = !DILocation(line: 396, column: 20, scope: !289)
!403 = !{!393, !395, i64 64}
!404 = !DILocation(line: 397, column: 20, scope: !289)
!405 = !{!406, !395, i64 24}
!406 = !{!"", !382, i64 0, !382, i64 8, !382, i64 16, !395, i64 24}
!407 = !DILocation(line: 397, column: 8, scope: !289)
!408 = !DILocation(line: 397, column: 13, scope: !289)
!409 = !{!393, !395, i64 96}
!410 = !DILocation(line: 398, column: 14, scope: !411)
!411 = distinct !DILexicalBlock(scope: !289, file: !14, line: 398, column: 9)
!412 = !{!406, !382, i64 16}
!413 = !DILocation(line: 398, column: 9, scope: !411)
!414 = !DILocation(line: 398, column: 9, scope: !289)
!415 = !DILocation(line: 409, column: 8, scope: !289)
!416 = !DILocation(line: 409, column: 26, scope: !289)
!417 = !{!393, !395, i64 68}
!418 = !DILocation(line: 410, column: 8, scope: !289)
!419 = !DILocation(line: 410, column: 26, scope: !289)
!420 = !{!393, !395, i64 72}
!421 = !DILocation(line: 411, column: 9, scope: !289)
!422 = !DILocation(line: 400, column: 63, scope: !423)
!423 = distinct !DILexicalBlock(scope: !411, file: !14, line: 399, column: 5)
!424 = !DILocation(line: 400, column: 81, scope: !423)
!425 = !DILocation(line: 400, column: 15, scope: !423)
!426 = !DILocation(line: 401, column: 17, scope: !427)
!427 = distinct !DILexicalBlock(scope: !423, file: !14, line: 401, column: 13)
!428 = !DILocation(line: 401, column: 13, scope: !423)
!429 = !DILocation(line: 402, column: 45, scope: !427)
!430 = !DILocation(line: 402, column: 31, scope: !427)
!431 = !DILocation(line: 402, column: 29, scope: !427)
!432 = !{!393, !396, i64 80}
!433 = !DILocation(line: 402, column: 13, scope: !427)
!434 = !DILocation(line: 403, column: 16, scope: !435)
!435 = distinct !DILexicalBlock(scope: !423, file: !14, line: 403, column: 13)
!436 = !DILocation(line: 403, column: 29, scope: !435)
!437 = !DILocation(line: 403, column: 42, scope: !435)
!438 = !DILocation(line: 403, column: 48, scope: !435)
!439 = !{!393, !396, i64 88}
!440 = !DILocation(line: 403, column: 61, scope: !435)
!441 = !DILocation(line: 403, column: 13, scope: !423)
!442 = !DILocation(line: 405, column: 22, scope: !443)
!443 = distinct !DILexicalBlock(scope: !435, file: !14, line: 404, column: 9)
