; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/timer.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/timer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

@.str = private unnamed_addr constant [84 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/timer.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [22 x i8] c"UnableToAcquireString\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1

; Function Attrs: nounwind uwtable
define dso_local ptr @AcquireTimerInfo() local_unnamed_addr #0 !dbg !117 {
entry:
  %exception = alloca %struct._ExceptionInfo, align 8
  %call = tail call ptr @AcquireMagickMemory(i64 noundef 64) #9, !dbg !146
  call void @llvm.dbg.value(metadata ptr %call, metadata !122, metadata !DIExpression()), !dbg !147
  %cmp = icmp eq ptr %call, null, !dbg !148
  br i1 %cmp, label %if.then, label %if.end, !dbg !149

if.then:                                          ; preds = %entry

!9 = !DIEnumerator(name: "RunningTimerState", value: 2)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 28, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "apps/538.imagick_r/src/magick/exception.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cd97c70c025a9cff45f4138c27a79124")
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!13 = !DIEnumerator(name: "UndefinedException", value: 0)
!14 = !DIEnumerator(name: "WarningException", value: 300)
!15 = !DIEnumerator(name: "ResourceLimitWarning", value: 300)
!16 = !DIEnumerator(name: "TypeWarning", value: 305)
!17 = !DIEnumerator(name: "OptionWarning", value: 310)
!18 = !DIEnumerator(name: "DelegateWarning", value: 315)
!19 = !DIEnumerator(name: "MissingDelegateWarning", value: 320)
!20 = !DIEnumerator(name: "CorruptImageWarning", value: 325)
!21 = !DIEnumerator(name: "FileOpenWarning", value: 330)
!22 = !DIEnumerator(name: "BlobWarning", value: 335)
!23 = !DIEnumerator(name: "StreamWarning", value: 340)
!24 = !DIEnumerator(name: "CacheWarning", value: 345)
!25 = !DIEnumerator(name: "CoderWarning", value: 350)
!26 = !DIEnumerator(name: "FilterWarning", value: 352)
!27 = !DIEnumerator(name: "ModuleWarning", value: 355)
!28 = !DIEnumerator(name: "DrawWarning", value: 360)
!29 = !DIEnumerator(name: "ImageWarning", value: 365)
!30 = !DIEnumerator(name: "WandWarning", value: 370)
!31 = !DIEnumerator(name: "RandomWarning", value: 375)
!32 = !DIEnumerator(name: "XServerWarning", value: 380)
!33 = !DIEnumerator(name: "MonitorWarning", value: 385)
!34 = !DIEnumerator(name: "RegistryWarning", value: 390)
!35 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!36 = !DIEnumerator(name: "PolicyWarning", value: 399)
!37 = !DIEnumerator(name: "ErrorException", value: 400)
!38 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!39 = !DIEnumerator(name: "TypeError", value: 405)
!40 = !DIEnumerator(name: "OptionError", value: 410)
!41 = !DIEnumerator(name: "DelegateError", value: 415)
!42 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!43 = !DIEnumerator(name: "CorruptImageError", value: 425)
!44 = !DIEnumerator(name: "FileOpenError", value: 430)
!45 = !DIEnumerator(name: "BlobError", value: 435)
!46 = !DIEnumerator(name: "StreamError", value: 440)
!47 = !DIEnumerator(name: "CacheError", value: 445)
!48 = !DIEnumerator(name: "CoderError", value: 450)
!49 = !DIEnumerator(name: "FilterError", value: 452)
!50 = !DIEnumerator(name: "ModuleError", value: 455)
!51 = !DIEnumerator(name: "DrawError", value: 460)
!52 = !DIEnumerator(name: "ImageError", value: 465)
!53 = !DIEnumerator(name: "WandError", value: 470)
!54 = !DIEnumerator(name: "RandomError", value: 475)
!55 = !DIEnumerator(name: "XServerError", value: 480)
!56 = !DIEnumerator(name: "MonitorError", value: 485)
!57 = !DIEnumerator(name: "RegistryError", value: 490)
!58 = !DIEnumerator(name: "ConfigureError", value: 495)
!59 = !DIEnumerator(name: "PolicyError", value: 499)
!60 = !DIEnumerator(name: "FatalErrorException", value: 700)
!61 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!62 = !DIEnumerator(name: "TypeFatalError", value: 705)
!63 = !DIEnumerator(name: "OptionFatalError", value: 710)
!64 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!65 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!66 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!67 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!68 = !DIEnumerator(name: "BlobFatalError", value: 735)
!69 = !DIEnumerator(name: "StreamFatalError", value: 740)
!70 = !DIEnumerator(name: "CacheFatalError", value: 745)
!71 = !DIEnumerator(name: "CoderFatalError", value: 750)
!72 = !DIEnumerator(name: "FilterFatalError", value: 752)
!73 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!74 = !DIEnumerator(name: "DrawFatalError", value: 760)
!75 = !DIEnumerator(name: "ImageFatalError", value: 765)
!76 = !DIEnumerator(name: "WandFatalError", value: 770)
!77 = !DIEnumerator(name: "RandomFatalError", value: 775)
!78 = !DIEnumerator(name: "XServerFatalError", value: 780)
!79 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!80 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!81 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!82 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 211, baseType: !5, size: 32, elements: !85)
!84 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick-type.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "169cac3440ee2afef5214a701fd1486e")
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "MagickFalse", value: 0)
!87 = !DIEnumerator(name: "MagickTrue", value: 1)
!88 = !{!89, !108, !107, !109}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !4, line: 51, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !4, line: 40, size: 512, elements: !92)
!92 = !{!93, !101, !102, !104}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !91, file: !4, line: 43, baseType: !94, size: 192)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !4, line: 38, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !4, line: 32, size: 192, elements: !96)
!96 = !{!97, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !95, file: !4, line: 35, baseType: !98, size: 64)
!98 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !95, file: !4, line: 36, baseType: !98, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !95, file: !4, line: 37, baseType: !98, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !91, file: !4, line: 44, baseType: !94, size: 192, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !91, file: !4, line: 47, baseType: !103, size: 32, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !4, line: 30, baseType: !3)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !91, file: !4, line: 50, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 46, baseType: !107)
!106 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!107 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !{i32 7, !"Dwarf Version", i32 5}
!111 = !{i32 2, !"Debug Info Version", i32 3}
!112 = !{i32 1, !"wchar_size", i32 4}
!113 = !{i32 7, !"PIC Level", i32 2}
!114 = !{i32 7, !"PIE Level", i32 2}
!115 = !{i32 7, !"uwtable", i32 2}
!116 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!117 = distinct !DISubprogram(name: "AcquireTimerInfo", scope: !118, file: !118, line: 91, type: !119, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !121)
!118 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5664d1abba1627c0ba1a6fd1276b8710")
!119 = !DISubroutineType(types: !120)
!120 = !{!89}
!121 = !{!122, !123, !128}
!122 = !DILocalVariable(name: "timer_info", scope: !117, file: !118, line: 94, type: !89)
!123 = !DILocalVariable(name: "message", scope: !124, file: !118, line: 98, type: !126)
!124 = distinct !DILexicalBlock(scope: !125, file: !118, line: 98, column: 5)
!125 = distinct !DILexicalBlock(scope: !117, file: !118, line: 97, column: 7)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DILocalVariable(name: "exception", scope: !124, file: !118, line: 98, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !84, line: 219, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !11, line: 102, size: 448, elements: !131)
!131 = !{!132, !134, !135, !136, !137, !138, !140, !145}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !130, file: !11, line: 105, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !11, line: 100, baseType: !10)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !130, file: !11, line: 108, baseType: !109, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !130, file: !11, line: 111, baseType: !126, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !130, file: !11, line: 112, baseType: !126, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !130, file: !11, line: 115, baseType: !108, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !130, file: !11, line: 118, baseType: !139, size: 32, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !84, line: 215, baseType: !83)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !130, file: !11, line: 121, baseType: !141, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !143, line: 26, baseType: !144)
!143 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !143, line: 25, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !130, file: !11, line: 124, baseType: !105, size: 64, offset: 384)
!146 = !DILocation(line: 96, column: 28, scope: !117)
!147 = !DILocation(line: 0, scope: !117)
!148 = !DILocation(line: 97, column: 18, scope: !125)
!149 = !DILocation(line: 97, column: 7, scope: !117)
!150 = !DILocation(line: 98, column: 5, scope: !124)
!151 = !{!152, !152, i64 0}
!152 = !{!"int", !153, i64 0}
!153 = !{!"omnipotent char", !154, i64 0}
!154 = !{!"Simple C/C++ TBAA"}
!155 = !DILocation(line: 0, scope: !124)
!156 = !DILocation(line: 99, column: 10, scope: !117)
!157 = !DILocation(line: 100, column: 15, scope: !117)
!158 = !DILocation(line: 100, column: 24, scope: !117)
!159 = !{!160, !163, i64 56}
!160 = !{!"_TimerInfo", !161, i64 0, !161, i64 24, !153, i64 48, !163, i64 56}
!161 = !{!"_Timer", !162, i64 0, !162, i64 8, !162, i64 16}
!162 = !{!"double", !153, i64 0}
!163 = !{!"long", !153, i64 0}
!164 = !DILocalVariable(name: "time_info", arg: 1, scope: !165, file: !118, line: 271, type: !89)
!165 = distinct !DISubprogram(name: "GetTimerInfo", scope: !118, file: !118, line: 271, type: !166, scopeLine: 272, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !168)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !89}
!168 = !{!164}
!169 = !DILocation(line: 0, scope: !165, inlinedAt: !170)
!170 = distinct !DILocation(line: 101, column: 3, scope: !117)
!171 = !DILocation(line: 277, column: 10, scope: !165, inlinedAt: !170)
!172 = !DILocation(line: 278, column: 14, scope: !165, inlinedAt: !170)
!173 = !DILocation(line: 279, column: 23, scope: !165, inlinedAt: !170)
!174 = !DILocalVariable(name: "time_info", arg: 1, scope: !175, file: !118, line: 375, type: !89)
!175 = distinct !DISubprogram(name: "StartTimer", scope: !118, file: !118, line: 375, type: !176, scopeLine: 376, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !179)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !89, !178}
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!179 = !{!174, !180}
!180 = !DILocalVariable(name: "reset", arg: 2, scope: !175, file: !118, line: 375, type: !178)
!181 = !DILocation(line: 0, scope: !175, inlinedAt: !182)
!182 = distinct !DILocation(line: 280, column: 3, scope: !165, inlinedAt: !170)
!183 = !DILocation(line: 384, column: 23, scope: !184, inlinedAt: !182)
!184 = distinct !DILexicalBlock(scope: !185, file: !118, line: 380, column: 5)
!185 = distinct !DILexicalBlock(scope: !175, file: !118, line: 379, column: 7)
!186 = !DILocation(line: 385, column: 26, scope: !184, inlinedAt: !182)
!187 = !DILocation(line: 385, column: 31, scope: !184, inlinedAt: !182)
!188 = !{!160, !162, i64 40}
!189 = !DILocation(line: 390, column: 28, scope: !190, inlinedAt: !182)
!190 = distinct !DILexicalBlock(scope: !191, file: !118, line: 388, column: 5)
!191 = distinct !DILexicalBlock(scope: !175, file: !118, line: 387, column: 7)
!192 = !{!160, !162, i64 0}
!193 = !DILocation(line: 389, column: 31, scope: !190, inlinedAt: !182)
!194 = !DILocation(line: 392, column: 19, scope: !175, inlinedAt: !182)
!195 = !{!160, !153, i64 48}
!196 = !DILocation(line: 102, column: 3, scope: !117)
!197 = !DISubprogram(name: "AcquireMagickMemory", scope: !198, file: !198, line: 40, type: !199, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !202)
!198 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!199 = !DISubroutineType(types: !200)
!200 = !{!108, !201}
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!202 = !{}
!203 = !DISubprogram(name: "GetExceptionInfo", scope: !11, file: !11, line: 166, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !202)
