; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/token.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/token.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UTFInfo = type { i32, i32, i32, i32 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._TokenInfo = type { i32, i32, i64, i8, i64 }
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i64, i64, i64, i32, i32, i32, i64, ptr, ptr, ptr, ptr, ptr, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, ptr, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, ptr, i32 }
%struct._PixelPacket = type { i16, i16, i16, i16 }

@.str = private unnamed_addr constant [84 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/token.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [23 x i8] c"MemoryAllocationFailed\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1

!422 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 25, baseType: !7, size: 32, elements: !424)
!423 = !DIFile(filename: "apps/538.imagick_r/src/magick/layer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9d504d6f7e210e092dfcf0dd62bc2dbe")
!424 = !{!425, !426, !427, !428, !429}
!425 = !DIEnumerator(name: "UnrecognizedDispose", value: 0)
!426 = !DIEnumerator(name: "UndefinedDispose", value: 0)
!427 = !DIEnumerator(name: "NoneDispose", value: 1)
!428 = !DIEnumerator(name: "BackgroundDispose", value: 2)
!429 = !DIEnumerator(name: "PreviousDispose", value: 3)
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !431, line: 25, baseType: !7, size: 32, elements: !432)
!431 = !DIFile(filename: "apps/538.imagick_r/src/magick/timer.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "28e2e01a3aeaa6ec566b3ffbac970563")
!432 = !{!433, !434, !435}
!433 = !DIEnumerator(name: "UndefinedTimerState", value: 0)
!434 = !DIEnumerator(name: "StoppedTimerState", value: 1)
!435 = !DIEnumerator(name: "RunningTimerState", value: 2)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !437, line: 31, baseType: !7, size: 32, elements: !438)
!437 = !DIFile(filename: "apps/538.imagick_r/src/magick/pixel.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b980ba059a4e0a748c02c115a1a7704f")
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!439 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0)
!440 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1)
!441 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2)
!442 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3)
!443 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4)
!444 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5)
!445 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6)
!446 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7)
!447 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8)
!448 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9)
!449 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10)
!450 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11)
!451 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12)
!452 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !437, line: 67, baseType: !7, size: 32, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!455 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!456 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!457 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!458 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!459 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!460 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!461 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!462 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!463 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!464 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!465 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !466, line: 27, baseType: !7, size: 32, elements: !467)
!466 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!468 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0)
!469 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1)
!470 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2)
!471 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3)
!472 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4)
!473 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5)
!474 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6)
!475 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7)
!476 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8)
!477 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9)
!478 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10)
!479 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11)
!480 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12)
!481 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13)
!482 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14)
!483 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15)
!484 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16)
!485 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17)
!486 = !{!487, !509, !508, !494, !510, !511, !498, !512, !513, !515, !504, !7, !506}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "TokenInfo", file: !489, line: 29, baseType: !490)
!489 = !DIFile(filename: "apps/538.imagick_r/src/magick/token.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f90c1544ca665b41425c6912f2cbc1e4")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TokenInfo", file: !491, line: 57, size: 256, elements: !492)
!491 = !DIFile(filename: "apps/538.imagick_r/src/magick/token.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "022ba07134ca4f673b5e815593a7e31d")
!492 = !{!493, !495, !497, !503, !505}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !490, file: !491, line: 60, baseType: !494, size: 32)
!494 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !491, line: 63, baseType: !496, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !80, line: 147, baseType: !7)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !490, file: !491, line: 66, baseType: !498, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !499, line: 77, baseType: !500)
!499 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !501, line: 193, baseType: !502)
!501 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!502 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !490, file: !491, line: 69, baseType: !504, size: 8, offset: 128)
!504 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !490, file: !491, line: 72, baseType: !506, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !507, line: 46, baseType: !508)
!507 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!508 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!510 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!511 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!516 = !{!0}
!517 = !DIFile(filename: "apps/538.imagick_r/src/magick/token-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a46756b24cd287baa0681a9d976f3bd8")
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 768, elements: !526)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "UTFInfo", file: !517, line: 38, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 31, size: 128, elements: !521)
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "code_mask", scope: !520, file: !517, line: 34, baseType: !494, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "code_value", scope: !520, file: !517, line: 35, baseType: !494, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "utf_mask", scope: !520, file: !517, line: 36, baseType: !494, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "utf_value", scope: !520, file: !517, line: 37, baseType: !494, size: 32, offset: 96)
!526 = !{!527}
!527 = !DISubrange(count: 6)
!528 = !{i32 7, !"Dwarf Version", i32 5}
!529 = !{i32 2, !"Debug Info Version", i32 3}
!530 = !{i32 1, !"wchar_size", i32 4}
!531 = !{i32 7, !"PIC Level", i32 2}
!532 = !{i32 7, !"PIE Level", i32 2}
!533 = !{i32 7, !"uwtable", i32 2}
!534 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!535 = distinct !DISubprogram(name: "AcquireTokenInfo", scope: !491, file: !491, line: 93, type: !536, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !538)
!536 = !DISubroutineType(types: !537)
!537 = !{!487}
!538 = !{!539, !540, !543}
!539 = !DILocalVariable(name: "token_info", scope: !535, file: !491, line: 96, type: !487)
!540 = !DILocalVariable(name: "message", scope: !541, file: !491, line: 100, type: !515)
!541 = distinct !DILexicalBlock(scope: !542, file: !491, line: 100, column: 5)
!542 = distinct !DILexicalBlock(scope: !535, file: !491, line: 99, column: 7)
!543 = !DILocalVariable(name: "exception", scope: !541, file: !491, line: 100, type: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !80, line: 219, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !6, line: 102, size: 448, elements: !546)
!546 = !{!547, !549, !550, !551, !552, !553, !555, !560}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !545, file: !6, line: 105, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !6, line: 100, baseType: !5)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !545, file: !6, line: 108, baseType: !494, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !545, file: !6, line: 111, baseType: !515, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !545, file: !6, line: 112, baseType: !515, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !545, file: !6, line: 115, baseType: !509, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !545, file: !6, line: 118, baseType: !554, size: 32, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !80, line: 215, baseType: !79)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !545, file: !6, line: 121, baseType: !556, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !558, line: 26, baseType: !559)
!558 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !558, line: 25, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !545, file: !6, line: 124, baseType: !506, size: 64, offset: 384)
!561 = !DILocation(line: 98, column: 28, scope: !535)
!562 = !DILocation(line: 0, scope: !535)
!563 = !DILocation(line: 99, column: 18, scope: !542)
!564 = !DILocation(line: 99, column: 7, scope: !535)
!565 = !DILocation(line: 100, column: 5, scope: !541)
!566 = !{!567, !567, i64 0}
!567 = !{!"int", !568, i64 0}
!568 = !{!"omnipotent char", !569, i64 0}
!569 = !{!"Simple C/C++ TBAA"}
!570 = !DILocation(line: 0, scope: !541)
!571 = !DILocation(line: 101, column: 15, scope: !535)
!572 = !DILocation(line: 101, column: 24, scope: !535)
!573 = !{!574, !575, i64 24}
!574 = !{!"_TokenInfo", !567, i64 0, !567, i64 4, !575, i64 8, !568, i64 16, !575, i64 24}
!575 = !{!"long", !568, i64 0}
!576 = !DILocation(line: 102, column: 3, scope: !535)
!577 = !DISubprogram(name: "AcquireMagickMemory", scope: !578, file: !578, line: 40, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!578 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!579 = !DISubroutineType(types: !580)
!580 = !{!509, !581}
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!582 = !{}
!583 = !DISubprogram(name: "GetExceptionInfo", scope: !6, file: !6, line: 166, type: !584, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!587 = !DISubprogram(name: "GetExceptionMessage", scope: !6, file: !6, line: 137, type: !588, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!588 = !DISubroutineType(types: !589)
!589 = !{!515, !590}
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!591 = !DISubprogram(name: "ThrowMagickException", scope: !6, file: !6, line: 156, type: !592, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!592 = !DISubroutineType(types: !593)
!593 = !{!554, !586, !513, !513, !581, !594, !513, !513, null}
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!595 = !DISubprogram(name: "DestroyString", scope: !596, file: !596, line: 46, type: !597, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!596 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!597 = !DISubroutineType(types: !598)
!598 = !{!515, !515}
!599 = !DISubprogram(name: "CatchException", scope: !6, file: !6, line: 164, type: !584, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!600 = !DISubprogram(name: "DestroyExceptionInfo", scope: !6, file: !6, line: 148, type: !601, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!601 = !DISubroutineType(types: !602)
!602 = !{!586, !586}
!603 = !DISubprogram(name: "MagickCoreTerminus", scope: !604, file: !604, line: 147, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!604 = !DIFile(filename: "apps/538.imagick_r/src/magick/magick.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5adb931d8998efbd9da8007cf3af7d19")
!605 = !DISubroutineType(types: !606)
!606 = !{null}
!607 = distinct !DISubprogram(name: "DestroyTokenInfo", scope: !491, file: !491, line: 128, type: !608, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !610)
!608 = !DISubroutineType(types: !609)
!609 = !{!487, !487}
!610 = !{!611}
!611 = !DILocalVariable(name: "token_info", arg: 1, scope: !607, file: !491, line: 128, type: !487)
!612 = !DILocation(line: 0, scope: !607)
!613 = !DILocation(line: 130, column: 10, scope: !607)
!614 = !DILocation(line: 133, column: 15, scope: !607)
!615 = !DILocation(line: 133, column: 24, scope: !607)
!616 = !DILocation(line: 134, column: 28, scope: !607)
!617 = !DILocation(line: 135, column: 3, scope: !607)
!618 = !DISubprogram(name: "LogMagickEvent", scope: !85, file: !85, line: 83, type: !619, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!619 = !DISubroutineType(types: !620)
!620 = !{!554, !621, !513, !513, !581, !513, null}
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !85, line: 58, baseType: !84)
!623 = !DISubprogram(name: "RelinquishMagickMemory", scope: !578, file: !578, line: 51, type: !624, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!624 = !DISubroutineType(types: !625)
!625 = !{!509, !509}
!626 = distinct !DISubprogram(name: "GetMagickToken", scope: !491, file: !491, line: 168, type: !627, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !513, !512, !515}
!629 = !{!630, !631, !632, !633, !635, !636, !637, !640, !642}
!630 = !DILocalVariable(name: "start", arg: 1, scope: !626, file: !491, line: 168, type: !513)
!631 = !DILocalVariable(name: "end", arg: 2, scope: !626, file: !491, line: 168, type: !512)
!632 = !DILocalVariable(name: "token", arg: 3, scope: !626, file: !491, line: 168, type: !515)
!633 = !DILocalVariable(name: "value", scope: !626, file: !491, line: 171, type: !634)
!634 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!635 = !DILocalVariable(name: "p", scope: !626, file: !491, line: 174, type: !513)
!636 = !DILocalVariable(name: "i", scope: !626, file: !491, line: 177, type: !498)
!637 = !DILocalVariable(name: "escape", scope: !638, file: !491, line: 195, type: !504)
!638 = distinct !DILexicalBlock(scope: !639, file: !491, line: 193, column: 5)
!639 = distinct !DILexicalBlock(scope: !626, file: !491, line: 186, column: 3)
!640 = !DILocalVariable(name: "q", scope: !641, file: !491, line: 229, type: !515)
!641 = distinct !DILexicalBlock(scope: !639, file: !491, line: 227, column: 5)
!642 = !DILocalVariable(name: "offset", scope: !643, file: !491, line: 272, type: !498)
!643 = distinct !DILexicalBlock(scope: !644, file: !491, line: 270, column: 5)
!644 = distinct !DILexicalBlock(scope: !626, file: !491, line: 269, column: 7)
!645 = !DILocation(line: 0, scope: !626)
!646 = !{!647, !647, i64 0}
!647 = !{!"any pointer", !568, i64 0}
!648 = !DILocation(line: 183, column: 3, scope: !626)
!649 = !DILocation(line: 183, column: 11, scope: !626)
!650 = !{!568, !568, i64 0}
!651 = !{!652, !652, i64 0}
!652 = !{!"short", !568, i64 0}
!653 = !DILocation(line: 183, column: 47, scope: !626)
!654 = !DILocation(line: 183, column: 53, scope: !626)
!655 = !DILocation(line: 184, column: 6, scope: !626)
!656 = distinct !{!656, !648, !655, !657, !658}
!657 = !{!"llvm.loop.mustprogress"}
!658 = !{!"llvm.loop.unroll.disable"}
!659 = !DILocation(line: 185, column: 11, scope: !626)
!660 = !DILocation(line: 185, column: 3, scope: !626)
!661 = !DILocation(line: 0, scope: !638)
!662 = !DILocation(line: 200, column: 33, scope: !663)
!663 = distinct !DILexicalBlock(scope: !638, file: !491, line: 198, column: 7)
!664 = !DILocation(line: 201, column: 32, scope: !663)
!665 = !DILocation(line: 202, column: 31, scope: !663)
!666 = !DILocation(line: 205, column: 12, scope: !667)
!667 = distinct !DILexicalBlock(scope: !638, file: !491, line: 205, column: 7)
!668 = !DILocation(line: 0, scope: !667)
!669 = !DILocation(line: 205, column: 17, scope: !670)
!670 = distinct !DILexicalBlock(scope: !667, file: !491, line: 205, column: 7)
!671 = !DILocation(line: 205, column: 7, scope: !667)
!672 = !DILocation(line: 207, column: 34, scope: !673)
!673 = distinct !DILexicalBlock(scope: !674, file: !491, line: 207, column: 13)
!674 = distinct !DILexicalBlock(scope: !670, file: !491, line: 206, column: 7)
!675 = !DILocation(line: 207, column: 31, scope: !673)
!676 = !DILocation(line: 207, column: 38, scope: !673)
!677 = !DILocation(line: 207, column: 49, scope: !673)
!678 = !DILocation(line: 210, column: 15, scope: !679)
!679 = distinct !DILexicalBlock(scope: !673, file: !491, line: 210, column: 15)
!680 = !DILocation(line: 210, column: 18, scope: !679)
!681 = !DILocation(line: 210, column: 15, scope: !673)
!682 = !DILocation(line: 212, column: 16, scope: !683)
!683 = distinct !DILexicalBlock(scope: !679, file: !491, line: 211, column: 13)
!684 = !DILocation(line: 213, column: 15, scope: !683)
!685 = !DILocation(line: 215, column: 21, scope: !674)
!686 = !DILocation(line: 215, column: 16, scope: !674)
!687 = !DILocation(line: 215, column: 9, scope: !674)
!688 = !DILocation(line: 215, column: 19, scope: !674)
!689 = !DILocation(line: 205, column: 7, scope: !670)
!690 = distinct !{!690, !671, !691, !657, !658}
!691 = !DILocation(line: 216, column: 7, scope: !667)
!692 = !DILocation(line: 221, column: 17, scope: !693)
!693 = distinct !DILexicalBlock(scope: !639, file: !491, line: 220, column: 5)
!694 = !DILocation(line: 222, column: 12, scope: !695)
!695 = distinct !DILexicalBlock(scope: !693, file: !491, line: 222, column: 11)
!696 = !DILocation(line: 222, column: 23, scope: !695)
!697 = !DILocation(line: 223, column: 23, scope: !695)
!698 = !DILocation(line: 223, column: 9, scope: !695)
!699 = !DILocation(line: 223, column: 19, scope: !695)
!700 = !DILocation(line: 228, column: 7, scope: !641)
!701 = !DILocation(line: 0, scope: !641)
!702 = !DILocalVariable(name: "string", arg: 1, scope: !703, file: !704, line: 42, type: !707)
!703 = distinct !DISubprogram(name: "StringToDouble", scope: !704, file: !704, line: 42, type: !705, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !710)
!704 = !DIFile(filename: "apps/538.imagick_r/src/magick/string-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "af275f9a9b26a4e8bc1a481724207dee")
!705 = !DISubroutineType(types: !706)
!706 = !{!634, !707, !708}
!707 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !513)
!708 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!710 = !{!702, !711}
!711 = !DILocalVariable(name: "sentinal", arg: 2, scope: !703, file: !704, line: 43, type: !708)
!712 = !DILocation(line: 0, scope: !703, inlinedAt: !713)
!713 = distinct !DILocation(line: 231, column: 13, scope: !641)
!714 = !DILocation(line: 45, column: 10, scope: !703, inlinedAt: !713)
!715 = !DILocation(line: 233, column: 17, scope: !716)
!716 = distinct !DILexicalBlock(scope: !641, file: !491, line: 233, column: 11)
!717 = !DILocation(line: 233, column: 14, scope: !716)
!718 = !DILocation(line: 233, column: 20, scope: !716)
!719 = !DILocation(line: 233, column: 27, scope: !716)
!720 = !DILocation(line: 233, column: 11, scope: !641)
!721 = !DILocation(line: 235, column: 22, scope: !722)
!722 = distinct !DILexicalBlock(scope: !723, file: !491, line: 235, column: 11)
!723 = distinct !DILexicalBlock(scope: !724, file: !491, line: 235, column: 11)
!724 = distinct !DILexicalBlock(scope: !716, file: !491, line: 234, column: 9)
!725 = !DILocation(line: 235, column: 27, scope: !722)
!726 = !DILocation(line: 235, column: 11, scope: !723)
!727 = !DILocation(line: 235, column: 34, scope: !722)
!728 = !DILocation(line: 236, column: 20, scope: !722)
!729 = !DILocation(line: 236, column: 13, scope: !722)
!730 = !DILocation(line: 236, column: 23, scope: !722)
!731 = !DILocation(line: 235, column: 44, scope: !722)
!732 = !DILocation(line: 0, scope: !724)
!733 = distinct !{!733, !726, !734, !657, !658}
!734 = !DILocation(line: 236, column: 27, scope: !723)
!735 = !DILocation(line: 237, column: 15, scope: !736)
!736 = distinct !DILexicalBlock(scope: !724, file: !491, line: 237, column: 15)
!737 = !DILocation(line: 237, column: 18, scope: !736)
!738 = !DILocation(line: 237, column: 15, scope: !724)
!739 = !DILocation(line: 238, column: 27, scope: !736)
!740 = !DILocation(line: 238, column: 20, scope: !736)
!741 = !DILocation(line: 238, column: 13, scope: !736)
!742 = !DILocation(line: 238, column: 23, scope: !736)
!743 = !DILocation(line: 241, column: 15, scope: !744)
!744 = distinct !DILexicalBlock(scope: !641, file: !491, line: 241, column: 11)
!745 = !DILocation(line: 241, column: 24, scope: !744)
!746 = !DILocation(line: 241, column: 28, scope: !744)
!747 = !DILocation(line: 241, column: 64, scope: !744)
!748 = !DILocation(line: 241, column: 70, scope: !744)
!749 = !DILocation(line: 247, column: 7, scope: !750)
!750 = distinct !DILexicalBlock(scope: !641, file: !491, line: 247, column: 7)
!751 = !DILocation(line: 244, column: 21, scope: !752)
!752 = distinct !DILexicalBlock(scope: !744, file: !491, line: 243, column: 9)
!753 = !DILocation(line: 245, column: 11, scope: !752)
!754 = !DILocation(line: 249, column: 15, scope: !755)
!755 = distinct !DILexicalBlock(scope: !756, file: !491, line: 249, column: 13)
!756 = distinct !DILexicalBlock(scope: !757, file: !491, line: 248, column: 7)
!757 = distinct !DILexicalBlock(scope: !750, file: !491, line: 247, column: 7)
!758 = !DILocation(line: 249, column: 51, scope: !755)
!759 = !DILocation(line: 249, column: 57, scope: !755)
!760 = !DILocation(line: 250, column: 63, scope: !755)
!761 = !DILocation(line: 250, column: 60, scope: !755)
!762 = !DILocation(line: 250, column: 67, scope: !755)
!763 = !DILocation(line: 249, column: 13, scope: !756)
!764 = !DILocation(line: 252, column: 16, scope: !765)
!765 = distinct !DILexicalBlock(scope: !756, file: !491, line: 252, column: 13)
!766 = !DILocation(line: 252, column: 21, scope: !765)
!767 = !DILocation(line: 254, column: 16, scope: !756)
!768 = !DILocation(line: 254, column: 9, scope: !756)
!769 = !DILocation(line: 254, column: 19, scope: !756)
!770 = !DILocation(line: 255, column: 13, scope: !771)
!771 = distinct !DILexicalBlock(scope: !756, file: !491, line: 255, column: 13)
!772 = !DILocation(line: 255, column: 13, scope: !756)
!773 = !DILocation(line: 0, scope: !774)
!774 = distinct !DILexicalBlock(scope: !775, file: !491, line: 258, column: 11)
!775 = distinct !DILexicalBlock(scope: !756, file: !491, line: 257, column: 13)
!776 = !DILocation(line: 258, column: 21, scope: !777)
!777 = distinct !DILexicalBlock(scope: !774, file: !491, line: 258, column: 11)
!778 = !DILocation(line: 258, column: 24, scope: !777)
!779 = !DILocation(line: 258, column: 11, scope: !774)
!780 = !DILocation(line: 260, column: 20, scope: !781)
!781 = distinct !DILexicalBlock(scope: !777, file: !491, line: 259, column: 11)
!782 = !DILocation(line: 260, column: 13, scope: !781)
!783 = !DILocation(line: 260, column: 23, scope: !781)
!784 = !DILocation(line: 261, column: 18, scope: !785)
!785 = distinct !DILexicalBlock(scope: !781, file: !491, line: 261, column: 17)
!786 = !DILocation(line: 261, column: 21, scope: !785)
!787 = !DILocation(line: 261, column: 29, scope: !785)
!788 = !DILocation(line: 261, column: 33, scope: !785)
!789 = !DILocation(line: 261, column: 40, scope: !785)
!790 = !DILocation(line: 261, column: 17, scope: !781)
!791 = distinct !{!791, !779, !792, !657, !658}
!792 = !DILocation(line: 263, column: 11, scope: !774)
!793 = !DILocation(line: 0, scope: !756)
!794 = !DILocation(line: 247, column: 28, scope: !757)
!795 = !DILocation(line: 247, column: 15, scope: !757)
!796 = !DILocation(line: 247, column: 18, scope: !757)
!797 = distinct !{!797, !749, !798, !657, !658}
!798 = !DILocation(line: 264, column: 7, scope: !750)
!799 = !DILocation(line: 266, column: 5, scope: !639)
!800 = !DILocation(line: 268, column: 3, scope: !626)
!801 = !DILocation(line: 268, column: 11, scope: !626)
!802 = !DILocation(line: 269, column: 7, scope: !644)
!803 = !DILocation(line: 269, column: 38, scope: !644)
!804 = !DILocation(line: 269, column: 7, scope: !626)
!805 = !DILocation(line: 0, scope: !643)
!806 = !DILocation(line: 275, column: 11, scope: !807)
!807 = distinct !DILexicalBlock(scope: !643, file: !491, line: 275, column: 11)
!808 = !DILocation(line: 275, column: 25, scope: !807)
!809 = !DILocation(line: 275, column: 11, scope: !643)
!810 = !DILocation(line: 277, column: 19, scope: !643)
!811 = !DILocation(line: 278, column: 42, scope: !643)
!812 = !DILocation(line: 278, column: 14, scope: !643)
!813 = !DILocation(line: 279, column: 21, scope: !643)
!814 = !DILocation(line: 279, column: 7, scope: !643)
!815 = !DILocation(line: 279, column: 24, scope: !643)
!816 = !DILocation(line: 280, column: 5, scope: !643)
!817 = !DILocation(line: 281, column: 3, scope: !626)
!818 = !DILocation(line: 281, column: 10, scope: !626)
!819 = !DILocation(line: 281, column: 46, scope: !626)
!820 = !DILocation(line: 282, column: 6, scope: !626)
!821 = distinct !{!821, !817, !820, !657, !658}
!822 = !DILocation(line: 283, column: 11, scope: !823)
!823 = distinct !DILexicalBlock(scope: !626, file: !491, line: 283, column: 7)
!824 = !DILocation(line: 283, column: 7, scope: !626)
!825 = !DILocation(line: 284, column: 9, scope: !823)
!826 = !DILocation(line: 284, column: 5, scope: !823)
!827 = !DILocation(line: 285, column: 1, scope: !626)
!828 = !DISubprogram(name: "LocaleNCompare", scope: !596, file: !596, line: 67, type: !829, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!829 = !DISubroutineType(types: !830)
!830 = !{!494, !513, !513, !581}
!831 = !DISubprogram(name: "CopyMagickString", scope: !596, file: !596, line: 78, type: !832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!832 = !DISubroutineType(types: !833)
!833 = !{!506, !515, !513, !581}
!834 = distinct !DISubprogram(name: "GlobExpression", scope: !491, file: !491, line: 315, type: !835, scopeLine: 317, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !838)
!835 = !DISubroutineType(types: !836)
!836 = !{!554, !513, !513, !837}
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !848, !1168, !1172, !1174, !1176, !1182}
!839 = !DILocalVariable(name: "expression", arg: 1, scope: !834, file: !491, line: 315, type: !513)
!840 = !DILocalVariable(name: "pattern", arg: 2, scope: !834, file: !491, line: 316, type: !513)
!841 = !DILocalVariable(name: "case_insensitive", arg: 3, scope: !834, file: !491, line: 316, type: !837)
!842 = !DILocalVariable(name: "done", scope: !834, file: !491, line: 319, type: !554)
!843 = !DILocalVariable(name: "match", scope: !834, file: !491, line: 320, type: !554)
!844 = !DILocalVariable(name: "p", scope: !834, file: !491, line: 323, type: !513)
!845 = !DILocalVariable(name: "exception", scope: !846, file: !491, line: 338, type: !586)
!846 = distinct !DILexicalBlock(scope: !847, file: !491, line: 336, column: 5)
!847 = distinct !DILexicalBlock(scope: !834, file: !491, line: 335, column: 7)
!848 = !DILocalVariable(name: "image_info", scope: !846, file: !491, line: 341, type: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !80, line: 223, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !150, line: 356, size: 134336, elements: !852)
!852 = !{!853, !855, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !870, !872, !874, !875, !876, !877, !878, !879, !880, !881, !882, !891, !892, !893, !894, !895, !896, !898, !900, !902, !903, !904, !905, !906, !907, !909, !1083, !1084, !1085, !1086, !1087, !1097, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1165, !1166, !1167}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !851, file: !150, line: 359, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !125, line: 49, baseType: !124)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !851, file: !150, line: 362, baseType: !856, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !150, line: 86, baseType: !149)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !851, file: !150, line: 365, baseType: !554, size: 32, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !851, file: !150, line: 366, baseType: !554, size: 32, offset: 96)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !851, file: !150, line: 367, baseType: !554, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !851, file: !150, line: 368, baseType: !554, size: 32, offset: 160)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !851, file: !150, line: 371, baseType: !515, size: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !851, file: !150, line: 372, baseType: !515, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !851, file: !150, line: 373, baseType: !515, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !851, file: !150, line: 374, baseType: !515, size: 64, offset: 384)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !851, file: !150, line: 377, baseType: !506, size: 64, offset: 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !851, file: !150, line: 378, baseType: !506, size: 64, offset: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !851, file: !150, line: 379, baseType: !506, size: 64, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !851, file: !150, line: 382, baseType: !869, size: 32, offset: 640)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !150, line: 73, baseType: !161)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !851, file: !150, line: 385, baseType: !871, size: 32, offset: 672)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !172, line: 35, baseType: !171)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !851, file: !150, line: 388, baseType: !873, size: 32, offset: 704)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !150, line: 93, baseType: !177)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !851, file: !150, line: 391, baseType: !506, size: 64, offset: 768)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !851, file: !150, line: 394, baseType: !515, size: 64, offset: 832)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !851, file: !150, line: 395, baseType: !515, size: 64, offset: 896)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !851, file: !150, line: 396, baseType: !515, size: 64, offset: 960)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !851, file: !150, line: 397, baseType: !515, size: 64, offset: 1024)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !851, file: !150, line: 398, baseType: !515, size: 64, offset: 1088)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !851, file: !150, line: 401, baseType: !634, size: 64, offset: 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !851, file: !150, line: 402, baseType: !634, size: 64, offset: 1216)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !851, file: !150, line: 405, baseType: !883, size: 64, offset: 1280)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !437, line: 148, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !437, line: 131, size: 64, elements: !885)
!885 = !{!886, !888, !889, !890}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !884, file: !437, line: 143, baseType: !887, size: 16)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !80, line: 93, baseType: !511)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !884, file: !437, line: 144, baseType: !887, size: 16, offset: 16)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !884, file: !437, line: 145, baseType: !887, size: 16, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !884, file: !437, line: 146, baseType: !887, size: 16, offset: 48)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !851, file: !150, line: 406, baseType: !883, size: 64, offset: 1344)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !851, file: !150, line: 407, baseType: !883, size: 64, offset: 1408)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !851, file: !150, line: 410, baseType: !554, size: 32, offset: 1472)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !851, file: !150, line: 411, baseType: !554, size: 32, offset: 1504)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !851, file: !150, line: 414, baseType: !506, size: 64, offset: 1536)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !851, file: !150, line: 417, baseType: !897, size: 32, offset: 1600)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !183, line: 61, baseType: !182)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !851, file: !150, line: 420, baseType: !899, size: 32, offset: 1632)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !150, line: 61, baseType: !219)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !851, file: !150, line: 423, baseType: !901, size: 32, offset: 1664)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !234, line: 59, baseType: !233)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !851, file: !150, line: 426, baseType: !498, size: 64, offset: 1728)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !851, file: !150, line: 429, baseType: !554, size: 32, offset: 1792)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !851, file: !150, line: 430, baseType: !554, size: 32, offset: 1824)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !851, file: !150, line: 433, baseType: !515, size: 64, offset: 1856)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !851, file: !150, line: 434, baseType: !515, size: 64, offset: 1920)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !851, file: !150, line: 437, baseType: !908, size: 32, offset: 1984)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !80, line: 202, baseType: !266)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !851, file: !150, line: 440, baseType: !910, size: 64, offset: 2048)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !80, line: 221, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !150, line: 150, size: 105920, elements: !913)
!913 = !{!914, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !928, !929, !930, !931, !932, !946, !948, !949, !950, !951, !952, !953, !954, !955, !956, !964, !965, !966, !967, !968, !969, !971, !972, !973, !975, !977, !979, !981, !982, !983, !984, !985, !986, !987, !995, !1010, !1022, !1023, !1024, !1025, !1029, !1033, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1045, !1046, !1055, !1056, !1058, !1059, !1060, !1061, !1062, !1063, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1080, !1082}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !912, file: !150, line: 153, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !80, line: 209, baseType: !288)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !912, file: !150, line: 156, baseType: !897, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !912, file: !150, line: 159, baseType: !854, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !912, file: !150, line: 162, baseType: !506, size: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !912, file: !150, line: 165, baseType: !856, size: 32, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !912, file: !150, line: 168, baseType: !554, size: 32, offset: 224)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !912, file: !150, line: 169, baseType: !554, size: 32, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !912, file: !150, line: 172, baseType: !506, size: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !912, file: !150, line: 173, baseType: !506, size: 64, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !912, file: !150, line: 174, baseType: !506, size: 64, offset: 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !912, file: !150, line: 175, baseType: !506, size: 64, offset: 512)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !912, file: !150, line: 178, baseType: !927, size: 64, offset: 576)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !912, file: !150, line: 179, baseType: !883, size: 64, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !912, file: !150, line: 180, baseType: !883, size: 64, offset: 704)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !912, file: !150, line: 181, baseType: !883, size: 64, offset: 768)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !912, file: !150, line: 184, baseType: !634, size: 64, offset: 832)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !912, file: !150, line: 187, baseType: !933, size: 768, offset: 896)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !150, line: 128, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !150, line: 121, size: 768, elements: !935)
!935 = !{!936, !943, !944, !945}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !934, file: !150, line: 124, baseType: !937, size: 192)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !150, line: 101, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !150, line: 95, size: 192, elements: !939)
!939 = !{!940, !941, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !938, file: !150, line: 98, baseType: !634, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !938, file: !150, line: 99, baseType: !634, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !938, file: !150, line: 100, baseType: !634, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !934, file: !150, line: 125, baseType: !937, size: 192, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !934, file: !150, line: 126, baseType: !937, size: 192, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !934, file: !150, line: 127, baseType: !937, size: 192, offset: 576)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !912, file: !150, line: 190, baseType: !947, size: 32, offset: 1664)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !294, line: 49, baseType: !293)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !912, file: !150, line: 193, baseType: !509, size: 64, offset: 1728)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !912, file: !150, line: 196, baseType: !873, size: 32, offset: 1792)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !912, file: !150, line: 199, baseType: !515, size: 64, offset: 1856)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !912, file: !150, line: 200, baseType: !515, size: 64, offset: 1920)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !912, file: !150, line: 201, baseType: !515, size: 64, offset: 1984)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !912, file: !150, line: 204, baseType: !498, size: 64, offset: 2048)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !912, file: !150, line: 207, baseType: !634, size: 64, offset: 2112)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !912, file: !150, line: 208, baseType: !634, size: 64, offset: 2176)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !912, file: !150, line: 211, baseType: !957, size: 256, offset: 2240)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !337, line: 130, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !337, line: 121, size: 256, elements: !959)
!959 = !{!960, !961, !962, !963}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !958, file: !337, line: 124, baseType: !506, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !958, file: !337, line: 125, baseType: !506, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !958, file: !337, line: 128, baseType: !498, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !958, file: !337, line: 129, baseType: !498, size: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !912, file: !150, line: 212, baseType: !957, size: 256, offset: 2496)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !912, file: !150, line: 213, baseType: !957, size: 256, offset: 2752)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !912, file: !150, line: 216, baseType: !634, size: 64, offset: 3008)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !912, file: !150, line: 217, baseType: !634, size: 64, offset: 3072)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !912, file: !150, line: 218, baseType: !634, size: 64, offset: 3136)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !912, file: !150, line: 221, baseType: !970, size: 32, offset: 3200)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !302, line: 66, baseType: !301)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !912, file: !150, line: 224, baseType: !869, size: 32, offset: 3232)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !912, file: !150, line: 227, baseType: !871, size: 32, offset: 3264)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !912, file: !150, line: 230, baseType: !974, size: 32, offset: 3296)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !337, line: 91, baseType: !336)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !912, file: !150, line: 233, baseType: !976, size: 32, offset: 3328)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !352, line: 99, baseType: !351)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !912, file: !150, line: 236, baseType: !978, size: 32, offset: 3360)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !423, line: 32, baseType: !422)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !912, file: !150, line: 239, baseType: !980, size: 64, offset: 3392)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !912, file: !150, line: 242, baseType: !506, size: 64, offset: 3456)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !912, file: !150, line: 243, baseType: !506, size: 64, offset: 3520)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !912, file: !150, line: 246, baseType: !498, size: 64, offset: 3584)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !912, file: !150, line: 249, baseType: !506, size: 64, offset: 3648)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !912, file: !150, line: 250, baseType: !506, size: 64, offset: 3712)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !912, file: !150, line: 253, baseType: !498, size: 64, offset: 3776)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !912, file: !150, line: 256, baseType: !988, size: 192, offset: 3840)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !989, line: 68, baseType: !990)
!989 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !989, line: 62, size: 192, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !990, file: !989, line: 65, baseType: !634, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !990, file: !989, line: 66, baseType: !634, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !990, file: !989, line: 67, baseType: !634, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !912, file: !150, line: 259, baseType: !996, size: 512, offset: 4032)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !431, line: 51, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !431, line: 40, size: 512, elements: !998)
!998 = !{!999, !1006, !1007, !1009}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !997, file: !431, line: 43, baseType: !1000, size: 192)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !431, line: 38, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !431, line: 32, size: 192, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1001, file: !431, line: 35, baseType: !634, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1001, file: !431, line: 36, baseType: !634, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1001, file: !431, line: 37, baseType: !634, size: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !997, file: !431, line: 44, baseType: !1000, size: 192, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !997, file: !431, line: 47, baseType: !1008, size: 32, offset: 384)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !431, line: 30, baseType: !430)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !997, file: !431, line: 50, baseType: !506, size: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !912, file: !150, line: 262, baseType: !1011, size: 64, offset: 4544)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !1012, line: 26, baseType: !1013)
!1012 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!554, !513, !1016, !1019, !509}
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !80, line: 150, baseType: !1018)
!1018 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !80, line: 151, baseType: !1021)
!1021 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !912, file: !150, line: 265, baseType: !509, size: 64, offset: 4608)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !912, file: !150, line: 266, baseType: !509, size: 64, offset: 4672)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !912, file: !150, line: 267, baseType: !509, size: 64, offset: 4736)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !912, file: !150, line: 270, baseType: !1026, size: 64, offset: 4800)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !125, line: 52, baseType: !1028)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !125, line: 51, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !912, file: !150, line: 273, baseType: !1030, size: 64, offset: 4864)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !80, line: 217, baseType: !1032)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !80, line: 217, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !912, file: !150, line: 276, baseType: !1034, size: 32768, offset: 4928)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 32768, elements: !1035)
!1035 = !{!1036}
!1036 = !DISubrange(count: 4096)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !912, file: !150, line: 277, baseType: !1034, size: 32768, offset: 37696)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !912, file: !150, line: 278, baseType: !1034, size: 32768, offset: 70464)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !912, file: !150, line: 281, baseType: !506, size: 64, offset: 103232)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !912, file: !150, line: 282, baseType: !506, size: 64, offset: 103296)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !912, file: !150, line: 285, baseType: !544, size: 448, offset: 103360)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !912, file: !150, line: 288, baseType: !554, size: 32, offset: 103808)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !912, file: !150, line: 291, baseType: !1044, size: 64, offset: 103872)
!1044 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !498)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !912, file: !150, line: 294, baseType: !556, size: 64, offset: 103936)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !912, file: !150, line: 297, baseType: !1047, size: 256, offset: 104000)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !294, line: 40, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !294, line: 27, size: 256, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1054}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1048, file: !294, line: 30, baseType: !515, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1048, file: !294, line: 33, baseType: !506, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1048, file: !294, line: 36, baseType: !1053, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1048, file: !294, line: 39, baseType: !506, size: 64, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !912, file: !150, line: 298, baseType: !1047, size: 256, offset: 104256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !912, file: !150, line: 299, baseType: !1057, size: 64, offset: 104512)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !912, file: !150, line: 302, baseType: !506, size: 64, offset: 104576)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !912, file: !150, line: 305, baseType: !506, size: 64, offset: 104640)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !912, file: !150, line: 308, baseType: !980, size: 64, offset: 104704)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !912, file: !150, line: 309, baseType: !980, size: 64, offset: 104768)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !912, file: !150, line: 310, baseType: !980, size: 64, offset: 104832)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !912, file: !150, line: 313, baseType: !1064, size: 32, offset: 104896)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !437, line: 47, baseType: !436)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !912, file: !150, line: 316, baseType: !554, size: 32, offset: 104928)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !912, file: !150, line: 319, baseType: !883, size: 64, offset: 104960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !912, file: !150, line: 322, baseType: !980, size: 64, offset: 105024)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !912, file: !150, line: 325, baseType: !957, size: 256, offset: 105088)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !912, file: !150, line: 328, baseType: !509, size: 64, offset: 105344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !912, file: !150, line: 329, baseType: !509, size: 64, offset: 105408)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !912, file: !150, line: 332, baseType: !899, size: 32, offset: 105472)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !912, file: !150, line: 335, baseType: !554, size: 32, offset: 105504)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !912, file: !150, line: 338, baseType: !1020, size: 64, offset: 105536)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !912, file: !150, line: 341, baseType: !554, size: 32, offset: 105600)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !912, file: !150, line: 344, baseType: !506, size: 64, offset: 105664)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !912, file: !150, line: 347, baseType: !1077, size: 64, offset: 105728)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1078, line: 7, baseType: !1079)
!1078 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !501, line: 160, baseType: !502)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !912, file: !150, line: 350, baseType: !1081, size: 32, offset: 105792)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !437, line: 79, baseType: !453)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !912, file: !150, line: 353, baseType: !506, size: 64, offset: 105856)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !851, file: !150, line: 443, baseType: !509, size: 64, offset: 2112)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !851, file: !150, line: 446, baseType: !1011, size: 64, offset: 2176)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !851, file: !150, line: 449, baseType: !509, size: 64, offset: 2240)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !851, file: !150, line: 450, baseType: !509, size: 64, offset: 2304)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !851, file: !150, line: 453, baseType: !1088, size: 64, offset: 2368)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1089, line: 26, baseType: !1090)
!1089 = !DIFile(filename: "apps/538.imagick_r/src/magick/stream.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c2638a9d0a3b6b6108dcfea44dbab39d")
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!506, !1093, !1095, !581}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !851, file: !150, line: 456, baseType: !1098, size: 64, offset: 2432)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1100, line: 7, baseType: !1101)
!1100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1102, line: 49, size: 1728, elements: !1103)
!1102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1119, !1121, !1122, !1123, !1125, !1126, !1128, !1132, !1135, !1137, !1140, !1143, !1144, !1145, !1146, !1147}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1101, file: !1102, line: 51, baseType: !494, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1101, file: !1102, line: 54, baseType: !515, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1101, file: !1102, line: 55, baseType: !515, size: 64, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1101, file: !1102, line: 56, baseType: !515, size: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1101, file: !1102, line: 57, baseType: !515, size: 64, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1101, file: !1102, line: 58, baseType: !515, size: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1101, file: !1102, line: 59, baseType: !515, size: 64, offset: 384)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1101, file: !1102, line: 60, baseType: !515, size: 64, offset: 448)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1101, file: !1102, line: 61, baseType: !515, size: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1101, file: !1102, line: 64, baseType: !515, size: 64, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1101, file: !1102, line: 65, baseType: !515, size: 64, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1101, file: !1102, line: 66, baseType: !515, size: 64, offset: 704)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1101, file: !1102, line: 68, baseType: !1117, size: 64, offset: 768)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1102, line: 36, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1101, file: !1102, line: 70, baseType: !1120, size: 64, offset: 832)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1101, file: !1102, line: 72, baseType: !494, size: 32, offset: 896)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1101, file: !1102, line: 73, baseType: !494, size: 32, offset: 928)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1101, file: !1102, line: 74, baseType: !1124, size: 64, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !501, line: 152, baseType: !502)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1101, file: !1102, line: 77, baseType: !511, size: 16, offset: 1024)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1101, file: !1102, line: 78, baseType: !1127, size: 8, offset: 1040)
!1127 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1101, file: !1102, line: 79, baseType: !1129, size: 8, offset: 1048)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 8, elements: !1130)
!1130 = !{!1131}
!1131 = !DISubrange(count: 1)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1101, file: !1102, line: 81, baseType: !1133, size: 64, offset: 1088)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1102, line: 43, baseType: null)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1101, file: !1102, line: 89, baseType: !1136, size: 64, offset: 1152)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !501, line: 153, baseType: !502)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1101, file: !1102, line: 91, baseType: !1138, size: 64, offset: 1216)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1102, line: 37, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1101, file: !1102, line: 92, baseType: !1141, size: 64, offset: 1280)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1102, line: 38, flags: DIFlagFwdDecl)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1101, file: !1102, line: 93, baseType: !1120, size: 64, offset: 1344)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1101, file: !1102, line: 94, baseType: !509, size: 64, offset: 1408)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1101, file: !1102, line: 95, baseType: !506, size: 64, offset: 1472)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1101, file: !1102, line: 96, baseType: !494, size: 32, offset: 1536)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1101, file: !1102, line: 98, baseType: !1148, size: 160, offset: 1568)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 160, elements: !1149)
!1149 = !{!1150}
!1150 = !DISubrange(count: 20)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !851, file: !150, line: 459, baseType: !509, size: 64, offset: 2496)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !851, file: !150, line: 462, baseType: !506, size: 64, offset: 2560)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !851, file: !150, line: 465, baseType: !1034, size: 32768, offset: 2624)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !851, file: !150, line: 466, baseType: !1034, size: 32768, offset: 35392)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !851, file: !150, line: 467, baseType: !1034, size: 32768, offset: 68160)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !851, file: !150, line: 468, baseType: !1034, size: 32768, offset: 100928)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !851, file: !150, line: 471, baseType: !554, size: 32, offset: 133696)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !851, file: !150, line: 474, baseType: !515, size: 64, offset: 133760)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !851, file: !150, line: 477, baseType: !506, size: 64, offset: 133824)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !851, file: !150, line: 478, baseType: !506, size: 64, offset: 133888)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !851, file: !150, line: 481, baseType: !883, size: 64, offset: 133952)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !851, file: !150, line: 484, baseType: !506, size: 64, offset: 134016)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !851, file: !150, line: 487, baseType: !1164, size: 32, offset: 134080)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !466, line: 47, baseType: !465)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !851, file: !150, line: 490, baseType: !883, size: 64, offset: 134112)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !851, file: !150, line: 493, baseType: !509, size: 64, offset: 134208)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !851, file: !150, line: 496, baseType: !554, size: 32, offset: 134272)
!1168 = !DILocalVariable(name: "status", scope: !1169, file: !491, line: 372, type: !554)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !491, line: 370, column: 7)
!1170 = distinct !DILexicalBlock(scope: !1171, file: !491, line: 368, column: 5)
!1171 = distinct !DILexicalBlock(scope: !834, file: !491, line: 363, column: 3)
!1172 = !DILocalVariable(name: "c", scope: !1173, file: !491, line: 393, type: !494)
!1173 = distinct !DILexicalBlock(scope: !1170, file: !491, line: 391, column: 7)
!1174 = !DILocalVariable(name: "p", scope: !1175, file: !491, line: 470, type: !513)
!1175 = distinct !DILexicalBlock(scope: !1170, file: !491, line: 468, column: 7)
!1176 = !DILocalVariable(name: "__res", scope: !1177, file: !491, line: 541, type: !494)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !491, line: 541, column: 17)
!1178 = distinct !DILexicalBlock(scope: !1179, file: !491, line: 541, column: 17)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !491, line: 540, column: 11)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !491, line: 539, column: 13)
!1181 = distinct !DILexicalBlock(scope: !1170, file: !491, line: 538, column: 7)
!1182 = !DILocalVariable(name: "__res", scope: !1183, file: !491, line: 542, type: !494)
!1183 = distinct !DILexicalBlock(scope: !1178, file: !491, line: 542, column: 17)
!1184 = !DILocation(line: 0, scope: !834)
!1185 = !DILocation(line: 328, column: 15, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !834, file: !491, line: 328, column: 7)
!1187 = !DILocation(line: 328, column: 7, scope: !834)
!1188 = !DILocalVariable(name: "text", arg: 1, scope: !1189, file: !517, line: 137, type: !513)
!1189 = distinct !DISubprogram(name: "GetUTFCode", scope: !517, file: !517, line: 137, type: !1190, scopeLine: 138, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1192)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!494, !513}
!1192 = !{!1188, !1193}
!1193 = !DILocalVariable(name: "octets", scope: !1189, file: !517, line: 140, type: !7)
!1194 = !DILocation(line: 0, scope: !1189, inlinedAt: !1195)
!1195 = distinct !DILocation(line: 330, column: 7, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !834, file: !491, line: 330, column: 7)
!1197 = !DILocalVariable(name: "octets", arg: 2, scope: !1198, file: !517, line: 92, type: !1201)
!1198 = distinct !DISubprogram(name: "GetNextUTFCode", scope: !517, file: !517, line: 92, type: !1199, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1202)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!494, !513, !1201}
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1202 = !{!1203, !1197, !1204, !1205, !1206, !1207}
!1203 = !DILocalVariable(name: "text", arg: 1, scope: !1198, file: !517, line: 92, type: !513)
!1204 = !DILocalVariable(name: "code", scope: !1198, file: !517, line: 95, type: !494)
!1205 = !DILocalVariable(name: "i", scope: !1198, file: !517, line: 98, type: !498)
!1206 = !DILocalVariable(name: "c", scope: !1198, file: !517, line: 101, type: !494)
!1207 = !DILocalVariable(name: "unicode", scope: !1198, file: !517, line: 102, type: !494)
!1208 = !DILocation(line: 0, scope: !1198, inlinedAt: !1209)
!1209 = distinct !DILocation(line: 142, column: 10, scope: !1189, inlinedAt: !1195)
!1210 = !DILocation(line: 110, column: 15, scope: !1198, inlinedAt: !1209)
!1211 = !DILocation(line: 110, column: 8, scope: !1198, inlinedAt: !1209)
!1212 = !DILocation(line: 112, column: 3, scope: !1213, inlinedAt: !1209)
!1213 = distinct !DILexicalBlock(scope: !1198, file: !517, line: 112, column: 3)
!1214 = !DILocation(line: 114, column: 17, scope: !1215, inlinedAt: !1209)
