; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/transform.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/transform.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, ptr, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, ptr, i32, ptr, ptr, ptr, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, ptr, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, ptr, ptr, ptr, ptr, ptr, ptr, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, ptr, %struct._ProfileInfo, %struct._ProfileInfo, ptr, i64, i64, ptr, ptr, ptr, i32, i32, %struct._PixelPacket, ptr, %struct._RectangleInfo, ptr, ptr, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!345 = !DIEnumerator(name: "BilevelType", value: 1)
!346 = !DIEnumerator(name: "GrayscaleType", value: 2)
!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3)
!348 = !DIEnumerator(name: "PaletteType", value: 4)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5)
!350 = !DIEnumerator(name: "TrueColorType", value: 6)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9)
!354 = !DIEnumerator(name: "OptimizeType", value: 10)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "apps/538.imagick_r/src/magick/log.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "15f43965ef1d878ccbef125be1cb0cab")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0)
!372 = !DIEnumerator(name: "NoEvents", value: 0)
!373 = !DIEnumerator(name: "TraceEvent", value: 1)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2)
!375 = !DIEnumerator(name: "BlobEvent", value: 4)
!376 = !DIEnumerator(name: "CacheEvent", value: 8)
!377 = !DIEnumerator(name: "CoderEvent", value: 16)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64)
!380 = !DIEnumerator(name: "DrawEvent", value: 128)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256)
!382 = !DIEnumerator(name: "ImageEvent", value: 512)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384)
!388 = !DIEnumerator(name: "UserEvent", value: 36864)
!389 = !DIEnumerator(name: "WandEvent", value: 65536)
!390 = !DIEnumerator(name: "X11Event", value: 131072)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !153, line: 25, baseType: !5, size: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!395 = !DIEnumerator(name: "NoValue", value: 0)
!396 = !DIEnumerator(name: "XValue", value: 1)
!397 = !DIEnumerator(name: "XiValue", value: 1)
!398 = !DIEnumerator(name: "YValue", value: 2)
!399 = !DIEnumerator(name: "PsiValue", value: 2)
!400 = !DIEnumerator(name: "WidthValue", value: 4)
!401 = !DIEnumerator(name: "RhoValue", value: 4)
!402 = !DIEnumerator(name: "HeightValue", value: 8)
!403 = !DIEnumerator(name: "SigmaValue", value: 8)
!404 = !DIEnumerator(name: "ChiValue", value: 16)
!405 = !DIEnumerator(name: "XiNegative", value: 32)
!406 = !DIEnumerator(name: "XNegative", value: 32)
!407 = !DIEnumerator(name: "PsiNegative", value: 64)
!408 = !DIEnumerator(name: "YNegative", value: 64)
!409 = !DIEnumerator(name: "ChiNegative", value: 128)
!410 = !DIEnumerator(name: "PercentValue", value: 4096)
!411 = !DIEnumerator(name: "AspectValue", value: 8192)
!412 = !DIEnumerator(name: "NormalizeValue", value: 8192)
!413 = !DIEnumerator(name: "LessValue", value: 16384)
!414 = !DIEnumerator(name: "GreaterValue", value: 32768)
!415 = !DIEnumerator(name: "MinimumValue", value: 65536)
!416 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536)
!417 = !DIEnumerator(name: "AreaValue", value: 131072)
!418 = !DIEnumerator(name: "DecimalValue", value: 262144)
!419 = !DIEnumerator(name: "SeparatorValue", value: 524288)
!420 = !DIEnumerator(name: "AllValues", value: 2147483647)
!421 = !{!422, !478, !435, !487, !433, !644, !446, !646, !648, !551, !451, !647, !460, !650, !556, !652}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !425)
!425 = !{!426, !428, !430, !432, !436, !438, !440, !441, !442, !443, !444, !445, !456, !457, !458, !459, !461, !475, !477, !479, !481, !484, !485, !486, !492, !493, !494, !502, !503, !504, !505, !506, !507, !509, !511, !513, !515, !517, !519, !521, !522, !523, !524, !525, !526, !527, !535, !550, !564, !565, !566, !567, !571, !575, !579, !580, !581, !582, !583, !601, !602, !604, !605, !615, !616, !618, !619, !620, !621, !622, !623, !625, !626, !627, !628, !629, !630, !631, !633, !634, !635, !636, !637, !641, !643}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !424, file: !73, line: 153, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !424, file: !73, line: 156, baseType: !429, size: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !424, file: !73, line: 159, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !424, file: !73, line: 162, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !434, line: 46, baseType: !435)
!434 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!435 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !424, file: !73, line: 165, baseType: !437, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !424, file: !73, line: 168, baseType: !439, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !424, file: !73, line: 169, baseType: !439, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !424, file: !73, line: 172, baseType: !433, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !424, file: !73, line: 173, baseType: !433, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !424, file: !73, line: 174, baseType: !433, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !424, file: !73, line: 175, baseType: !433, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !424, file: !73, line: 178, baseType: !446, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !449)
!449 = !{!450, !453, !454, !455}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !448, file: !326, line: 143, baseType: !451, size: 16)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !452)
!452 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !448, file: !326, line: 144, baseType: !451, size: 16, offset: 16)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !448, file: !326, line: 145, baseType: !451, size: 16, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !448, file: !326, line: 146, baseType: !451, size: 16, offset: 48)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !424, file: !73, line: 179, baseType: !447, size: 64, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !424, file: !73, line: 180, baseType: !447, size: 64, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !424, file: !73, line: 181, baseType: !447, size: 64, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !424, file: !73, line: 184, baseType: !460, size: 64, offset: 832)
!460 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !424, file: !73, line: 187, baseType: !462, size: 768, offset: 896)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !464)
!464 = !{!465, !472, !473, !474}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !463, file: !73, line: 124, baseType: !466, size: 192)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !467, file: !73, line: 98, baseType: !460, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !467, file: !73, line: 99, baseType: !460, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !467, file: !73, line: 100, baseType: !460, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !463, file: !73, line: 125, baseType: !466, size: 192, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !463, file: !73, line: 126, baseType: !466, size: 192, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !463, file: !73, line: 127, baseType: !466, size: 192, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !424, file: !73, line: 190, baseType: !476, size: 32, offset: 1664)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !424, file: !73, line: 193, baseType: !478, size: 64, offset: 1728)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !424, file: !73, line: 196, baseType: !480, size: 32, offset: 1792)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !424, file: !73, line: 199, baseType: !482, size: 64, offset: 1856)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !424, file: !73, line: 200, baseType: !482, size: 64, offset: 1920)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !424, file: !73, line: 201, baseType: !482, size: 64, offset: 1984)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !424, file: !73, line: 204, baseType: !487, size: 64, offset: 2048)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !488, line: 77, baseType: !489)
!488 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !490, line: 193, baseType: !491)
!490 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!491 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !424, file: !73, line: 207, baseType: !460, size: 64, offset: 2112)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !424, file: !73, line: 208, baseType: !460, size: 64, offset: 2176)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !424, file: !73, line: 211, baseType: !495, size: 256, offset: 2240)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !496, file: !153, line: 124, baseType: !433, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !496, file: !153, line: 125, baseType: !433, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !496, file: !153, line: 128, baseType: !487, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !496, file: !153, line: 129, baseType: !487, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !424, file: !73, line: 212, baseType: !495, size: 256, offset: 2496)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !424, file: !73, line: 213, baseType: !495, size: 256, offset: 2752)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !424, file: !73, line: 216, baseType: !460, size: 64, offset: 3008)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !424, file: !73, line: 217, baseType: !460, size: 64, offset: 3072)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !424, file: !73, line: 218, baseType: !460, size: 64, offset: 3136)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !424, file: !73, line: 221, baseType: !508, size: 32, offset: 3200)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !424, file: !73, line: 224, baseType: !510, size: 32, offset: 3232)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !424, file: !73, line: 227, baseType: !512, size: 32, offset: 3264)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !424, file: !73, line: 230, baseType: !514, size: 32, offset: 3296)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !424, file: !73, line: 233, baseType: !516, size: 32, offset: 3328)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !424, file: !73, line: 236, baseType: !518, size: 32, offset: 3360)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !424, file: !73, line: 239, baseType: !520, size: 64, offset: 3392)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !424, file: !73, line: 242, baseType: !433, size: 64, offset: 3456)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !424, file: !73, line: 243, baseType: !433, size: 64, offset: 3520)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !424, file: !73, line: 246, baseType: !487, size: 64, offset: 3584)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !424, file: !73, line: 249, baseType: !433, size: 64, offset: 3648)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !424, file: !73, line: 250, baseType: !433, size: 64, offset: 3712)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !424, file: !73, line: 253, baseType: !487, size: 64, offset: 3776)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !424, file: !73, line: 256, baseType: !528, size: 192, offset: 3840)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !529, line: 68, baseType: !530)
!529 = !DIFile(filename: "apps/538.imagick_r/src/magick/color.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2d6c9912b898cc88c4750d63b727c87")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !529, line: 62, size: 192, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !530, file: !529, line: 65, baseType: !460, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !530, file: !529, line: 66, baseType: !460, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !530, file: !529, line: 67, baseType: !460, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !424, file: !73, line: 259, baseType: !536, size: 512, offset: 4032)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !538)
!538 = !{!539, !546, !547, !549}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !537, file: !247, line: 43, baseType: !540, size: 192)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !541, file: !247, line: 35, baseType: !460, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !541, file: !247, line: 36, baseType: !460, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !541, file: !247, line: 37, baseType: !460, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !537, file: !247, line: 44, baseType: !540, size: 192, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !537, file: !247, line: 47, baseType: !548, size: 32, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !537, file: !247, line: 50, baseType: !433, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !424, file: !73, line: 262, baseType: !551, size: 64, offset: 4544)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !552, line: 26, baseType: !553)
!552 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "400538b2e088c5fbc0a033f037fbaca2")
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!439, !556, !558, !561, !478}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !560)
!560 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !563)
!563 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !424, file: !73, line: 265, baseType: !478, size: 64, offset: 4608)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !424, file: !73, line: 266, baseType: !478, size: 64, offset: 4672)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !424, file: !73, line: 267, baseType: !478, size: 64, offset: 4736)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !424, file: !73, line: 270, baseType: !568, size: 64, offset: 4800)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !570)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !424, file: !73, line: 273, baseType: !572, size: 64, offset: 4864)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !574)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !424, file: !73, line: 276, baseType: !576, size: 32768, offset: 4928)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 32768, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 4096)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !424, file: !73, line: 277, baseType: !576, size: 32768, offset: 37696)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !424, file: !73, line: 278, baseType: !576, size: 32768, offset: 70464)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !424, file: !73, line: 281, baseType: !433, size: 64, offset: 103232)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !424, file: !73, line: 282, baseType: !433, size: 64, offset: 103296)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !424, file: !73, line: 285, baseType: !584, size: 448, offset: 103360)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !586)
!586 = !{!587, !589, !591, !592, !593, !594, !595, !600}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !585, file: !253, line: 105, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !585, file: !253, line: 108, baseType: !590, size: 32, offset: 32)
!590 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !585, file: !253, line: 111, baseType: !482, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !585, file: !253, line: 112, baseType: !482, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !585, file: !253, line: 115, baseType: !478, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !585, file: !253, line: 118, baseType: !439, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !585, file: !253, line: 121, baseType: !596, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !598, line: 26, baseType: !599)
!598 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !598, line: 25, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !585, file: !253, line: 124, baseType: !433, size: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !424, file: !73, line: 288, baseType: !439, size: 32, offset: 103808)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !424, file: !73, line: 291, baseType: !603, size: 64, offset: 103872)
!603 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !487)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !424, file: !73, line: 294, baseType: !596, size: 64, offset: 103936)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !424, file: !73, line: 297, baseType: !606, size: 256, offset: 104000)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !608)
!608 = !{!609, !610, !611, !614}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !607, file: !89, line: 30, baseType: !482, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !607, file: !89, line: 33, baseType: !433, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !607, file: !89, line: 36, baseType: !612, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !607, file: !89, line: 39, baseType: !433, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !424, file: !73, line: 298, baseType: !606, size: 256, offset: 104256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !424, file: !73, line: 299, baseType: !617, size: 64, offset: 104512)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !424, file: !73, line: 302, baseType: !433, size: 64, offset: 104576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !424, file: !73, line: 305, baseType: !433, size: 64, offset: 104640)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !424, file: !73, line: 308, baseType: !520, size: 64, offset: 104704)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !424, file: !73, line: 309, baseType: !520, size: 64, offset: 104768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !73, line: 310, baseType: !520, size: 64, offset: 104832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !424, file: !73, line: 313, baseType: !624, size: 32, offset: 104896)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !424, file: !73, line: 316, baseType: !439, size: 32, offset: 104928)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !424, file: !73, line: 319, baseType: !447, size: 64, offset: 104960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !424, file: !73, line: 322, baseType: !520, size: 64, offset: 105024)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !424, file: !73, line: 325, baseType: !495, size: 256, offset: 105088)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !424, file: !73, line: 328, baseType: !478, size: 64, offset: 105344)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !424, file: !73, line: 329, baseType: !478, size: 64, offset: 105408)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !424, file: !73, line: 332, baseType: !632, size: 32, offset: 105472)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !424, file: !73, line: 335, baseType: !439, size: 32, offset: 105504)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !424, file: !73, line: 338, baseType: !562, size: 64, offset: 105536)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !424, file: !73, line: 341, baseType: !439, size: 32, offset: 105600)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !424, file: !73, line: 344, baseType: !433, size: 64, offset: 105664)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !424, file: !73, line: 347, baseType: !638, size: 64, offset: 105728)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !639, line: 7, baseType: !640)
!639 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !490, line: 160, baseType: !491)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !424, file: !73, line: 350, baseType: !642, size: 32, offset: 105792)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !424, file: !73, line: 353, baseType: !433, size: 64, offset: 105856)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !451)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !651)
!651 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!653 = !{i32 7, !"Dwarf Version", i32 5}
!654 = !{i32 2, !"Debug Info Version", i32 3}
!655 = !{i32 1, !"wchar_size", i32 4}
!656 = !{i32 7, !"PIC Level", i32 2}
!657 = !{i32 7, !"PIE Level", i32 2}
!658 = !{i32 7, !"uwtable", i32 2}
!659 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!660 = distinct !DISubprogram(name: "AutoOrientImage", scope: !661, file: !661, line: 98, type: !662, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !668)
!661 = !DIFile(filename: "apps/538.imagick_r/src/magick/transform.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "051aaf514c06d6d0e3d49c9b2a68a4bf")
!662 = !DISubroutineType(types: !663)
!663 = !{!422, !664, !666, !667}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!668 = !{!669, !670, !671, !672}
!669 = !DILocalVariable(name: "image", arg: 1, scope: !660, file: !661, line: 98, type: !664)
!670 = !DILocalVariable(name: "orientation", arg: 2, scope: !660, file: !661, line: 99, type: !666)
!671 = !DILocalVariable(name: "exception", arg: 3, scope: !660, file: !661, line: 99, type: !667)
!672 = !DILocalVariable(name: "orient_image", scope: !660, file: !661, line: 102, type: !422)
!673 = !DILocation(line: 0, scope: !660)
!674 = !DILocation(line: 109, column: 3, scope: !660)
!675 = !DILocation(line: 115, column: 20, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !661, line: 114, column: 5)
!677 = distinct !DILexicalBlock(scope: !660, file: !661, line: 110, column: 3)
!678 = !DILocation(line: 116, column: 7, scope: !676)
!679 = !DILocation(line: 120, column: 20, scope: !680)
!680 = distinct !DILexicalBlock(scope: !677, file: !661, line: 119, column: 5)
!681 = !DILocation(line: 121, column: 7, scope: !680)
!682 = !DILocation(line: 125, column: 20, scope: !683)
!683 = distinct !DILexicalBlock(scope: !677, file: !661, line: 124, column: 5)
!684 = !DILocation(line: 126, column: 7, scope: !683)
!685 = !DILocation(line: 130, column: 20, scope: !686)
!686 = distinct !DILexicalBlock(scope: !677, file: !661, line: 129, column: 5)
!687 = !DILocation(line: 131, column: 7, scope: !686)
!688 = !DILocation(line: 135, column: 20, scope: !689)
!689 = distinct !DILexicalBlock(scope: !677, file: !661, line: 134, column: 5)
!690 = !DILocation(line: 136, column: 7, scope: !689)
!691 = !DILocation(line: 140, column: 20, scope: !692)
!692 = distinct !DILexicalBlock(scope: !677, file: !661, line: 139, column: 5)
!693 = !DILocation(line: 141, column: 7, scope: !692)
!694 = !DILocation(line: 145, column: 20, scope: !695)
!695 = distinct !DILexicalBlock(scope: !677, file: !661, line: 144, column: 5)
!696 = !DILocation(line: 146, column: 7, scope: !695)
!697 = !DILocation(line: 150, column: 20, scope: !698)
!698 = distinct !DILexicalBlock(scope: !677, file: !661, line: 149, column: 5)
!699 = !DILocation(line: 151, column: 7, scope: !698)
!700 = !DILocation(line: 0, scope: !677)
!701 = !DILocation(line: 154, column: 20, scope: !702)
!702 = distinct !DILexicalBlock(scope: !660, file: !661, line: 154, column: 7)
!703 = !DILocation(line: 154, column: 7, scope: !660)
!704 = !DILocation(line: 155, column: 19, scope: !702)
!705 = !DILocation(line: 155, column: 30, scope: !702)
!706 = !{!707, !708, i64 24}
!707 = !{!"_Image", !708, i64 0, !708, i64 4, !708, i64 8, !710, i64 16, !708, i64 24, !708, i64 28, !708, i64 32, !710, i64 40, !710, i64 48, !710, i64 56, !710, i64 64, !711, i64 72, !712, i64 80, !712, i64 88, !712, i64 96, !714, i64 104, !715, i64 112, !708, i64 208, !711, i64 216, !708, i64 224, !711, i64 232, !711, i64 240, !711, i64 248, !710, i64 256, !714, i64 264, !714, i64 272, !717, i64 280, !717, i64 312, !717, i64 344, !714, i64 376, !714, i64 384, !714, i64 392, !708, i64 400, !708, i64 404, !708, i64 408, !708, i64 412, !708, i64 416, !708, i64 420, !711, i64 424, !710, i64 432, !710, i64 440, !710, i64 448, !710, i64 456, !710, i64 464, !710, i64 472, !718, i64 480, !719, i64 504, !711, i64 568, !711, i64 576, !711, i64 584, !711, i64 592, !711, i64 600, !711, i64 608, !708, i64 616, !708, i64 4712, !708, i64 8808, !710, i64 12904, !710, i64 12912, !721, i64 12920, !708, i64 12976, !710, i64 12984, !711, i64 12992, !723, i64 13000, !723, i64 13032, !711, i64 13064, !710, i64 13072, !710, i64 13080, !711, i64 13088, !711, i64 13096, !711, i64 13104, !708, i64 13112, !708, i64 13116, !712, i64 13120, !711, i64 13128, !717, i64 13136, !711, i64 13168, !711, i64 13176, !708, i64 13184, !708, i64 13188, !724, i64 13192, !708, i64 13200, !710, i64 13208, !710, i64 13216, !708, i64 13224, !710, i64 13232}
!708 = !{!"omnipotent char", !709, i64 0}
!709 = !{!"Simple C/C++ TBAA"}
!710 = !{!"long", !708, i64 0}
!711 = !{!"any pointer", !708, i64 0}
!712 = !{!"_PixelPacket", !713, i64 0, !713, i64 2, !713, i64 4, !713, i64 6}
!713 = !{!"short", !708, i64 0}
!714 = !{!"double", !708, i64 0}
!715 = !{!"_ChromaticityInfo", !716, i64 0, !716, i64 24, !716, i64 48, !716, i64 72}
!716 = !{!"_PrimaryInfo", !714, i64 0, !714, i64 8, !714, i64 16}
!717 = !{!"_RectangleInfo", !710, i64 0, !710, i64 8, !710, i64 16, !710, i64 24}
!718 = !{!"_ErrorInfo", !714, i64 0, !714, i64 8, !714, i64 16}
!719 = !{!"_TimerInfo", !720, i64 0, !720, i64 24, !708, i64 48, !710, i64 56}
!720 = !{!"_Timer", !714, i64 0, !714, i64 8, !714, i64 16}
!721 = !{!"_ExceptionInfo", !708, i64 0, !722, i64 4, !711, i64 8, !711, i64 16, !711, i64 24, !708, i64 32, !711, i64 40, !710, i64 48}
!722 = !{!"int", !708, i64 0}
!723 = !{!"_ProfileInfo", !711, i64 0, !710, i64 8, !711, i64 16, !710, i64 24}
!724 = !{!"long long", !708, i64 0}
!725 = !DILocation(line: 155, column: 5, scope: !702)
!726 = !DILocation(line: 156, column: 3, scope: !660)
!727 = !DISubprogram(name: "CloneImage", scope: !73, file: !73, line: 508, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!728 = !DISubroutineType(types: !729)
!729 = !{!422, !664, !730, !730, !731, !667}
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!732 = !{}
!733 = distinct !DISubprogram(name: "FlopImage", scope: !661, file: !661, line: 1360, type: !734, scopeLine: 1361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !736)
!734 = !DISubroutineType(types: !735)
!735 = !{!422, !664, !667}
!736 = !{!737, !738, !739, !744, !745, !746, !747, !748, !749, !750, !755, !757, !759, !760, !762}
!737 = !DILocalVariable(name: "image", arg: 1, scope: !733, file: !661, line: 1360, type: !664)
!738 = !DILocalVariable(name: "exception", arg: 2, scope: !733, file: !661, line: 1360, type: !667)
!739 = !DILocalVariable(name: "flop_view", scope: !733, file: !661, line: 1365, type: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !742, line: 50, baseType: !743)
!742 = !DIFile(filename: "apps/538.imagick_r/src/magick/cache-view.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53261e86cf828449e5e37ac4d3650cdd")
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!744 = !DILocalVariable(name: "image_view", scope: !733, file: !661, line: 1366, type: !740)
!745 = !DILocalVariable(name: "flop_image", scope: !733, file: !661, line: 1369, type: !422)
!746 = !DILocalVariable(name: "status", scope: !733, file: !661, line: 1372, type: !439)
!747 = !DILocalVariable(name: "progress", scope: !733, file: !661, line: 1375, type: !559)
!748 = !DILocalVariable(name: "page", scope: !733, file: !661, line: 1378, type: !495)
!749 = !DILocalVariable(name: "y", scope: !733, file: !661, line: 1381, type: !487)
!750 = !DILocalVariable(name: "indexes", scope: !751, file: !661, line: 1407, type: !754)
!751 = distinct !DILexicalBlock(scope: !752, file: !661, line: 1405, column: 3)
!752 = distinct !DILexicalBlock(scope: !753, file: !661, line: 1404, column: 3)
!753 = distinct !DILexicalBlock(scope: !733, file: !661, line: 1404, column: 3)
!754 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !648)
!755 = !DILocalVariable(name: "p", scope: !751, file: !661, line: 1410, type: !756)
!756 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !644)
!757 = !DILocalVariable(name: "flop_indexes", scope: !751, file: !661, line: 1413, type: !758)
!758 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !646)
!759 = !DILocalVariable(name: "x", scope: !751, file: !661, line: 1416, type: !487)
!760 = !DILocalVariable(name: "q", scope: !751, file: !661, line: 1419, type: !761)
!761 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !446)
!762 = !DILocalVariable(name: "proceed", scope: !763, file: !661, line: 1447, type: !439)
!763 = distinct !DILexicalBlock(scope: !764, file: !661, line: 1445, column: 7)
!764 = distinct !DILexicalBlock(scope: !751, file: !661, line: 1444, column: 9)
!765 = !DILocation(line: 0, scope: !733)
!766 = !DILocation(line: 1385, column: 14, scope: !767)
!767 = distinct !DILexicalBlock(scope: !733, file: !661, line: 1385, column: 7)
!768 = !{!707, !708, i64 12976}
!769 = !DILocation(line: 1385, column: 20, scope: !767)
!770 = !DILocation(line: 1385, column: 7, scope: !733)
!771 = !DILocation(line: 1386, column: 68, scope: !767)
!772 = !DILocation(line: 1386, column: 12, scope: !767)
!773 = !DILocation(line: 1386, column: 5, scope: !767)
!774 = !DILocation(line: 1389, column: 38, scope: !733)
!775 = !{!707, !710, i64 40}
!776 = !DILocation(line: 1389, column: 53, scope: !733)
!777 = !{!707, !710, i64 48}
!778 = !DILocation(line: 1389, column: 14, scope: !733)
!779 = !DILocation(line: 1390, column: 18, scope: !780)
!780 = distinct !DILexicalBlock(scope: !733, file: !661, line: 1390, column: 7)
!781 = !DILocation(line: 1390, column: 7, scope: !733)
!782 = !DILocation(line: 1397, column: 15, scope: !733)
!783 = !{i64 0, i64 8, !784, i64 8, i64 8, !784, i64 16, i64 8, !784, i64 24, i64 8, !784}
!784 = !{!710, !710, i64 0}
!785 = !{i64 0, i64 8, !784, i64 8, i64 8, !784, i64 16, i64 8, !784}
!786 = !{i64 0, i64 8, !784, i64 8, i64 8, !784}
!787 = !{i64 0, i64 8, !784}
!788 = !DILocation(line: 1398, column: 14, scope: !733)
!789 = !DILocation(line: 1399, column: 13, scope: !733)
!790 = !DILocation(line: 1404, column: 39, scope: !752)
!791 = !DILocation(line: 1404, column: 15, scope: !752)
!792 = !DILocation(line: 1404, column: 3, scope: !753)
!793 = !DILocation(line: 1421, column: 16, scope: !794)
!794 = distinct !DILexicalBlock(scope: !751, file: !661, line: 1421, column: 9)
!795 = !DILocation(line: 1421, column: 9, scope: !751)
!796 = !DILocation(line: 1423, column: 55, scope: !751)
!797 = !DILocation(line: 1423, column: 7, scope: !751)
!798 = !DILocation(line: 0, scope: !751)
!799 = !DILocation(line: 1424, column: 63, scope: !751)
!800 = !DILocation(line: 1424, column: 7, scope: !751)
!801 = !DILocation(line: 1426, column: 12, scope: !802)
!802 = distinct !DILexicalBlock(scope: !751, file: !661, line: 1426, column: 9)
!803 = !DILocation(line: 1426, column: 37, scope: !802)
!804 = !DILocation(line: 1431, column: 20, scope: !751)
!805 = !DILocation(line: 1432, column: 13, scope: !751)
!806 = !DILocation(line: 1433, column: 18, scope: !751)
!807 = !DILocation(line: 1434, column: 41, scope: !808)
!808 = distinct !DILexicalBlock(scope: !809, file: !661, line: 1434, column: 5)
!809 = distinct !DILexicalBlock(scope: !751, file: !661, line: 1434, column: 5)
!810 = !DILocation(line: 1434, column: 17, scope: !808)
!811 = !DILocation(line: 1434, column: 5, scope: !809)
!812 = !DILocation(line: 1431, column: 6, scope: !751)
!813 = !DILocation(line: 1437, column: 51, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !661, line: 1437, column: 11)
!815 = distinct !DILexicalBlock(scope: !808, file: !661, line: 1435, column: 5)
!816 = !DILocation(line: 1436, column: 9, scope: !815)
!817 = !DILocation(line: 1436, column: 17, scope: !815)
!818 = !DILocation(line: 1436, column: 15, scope: !815)
!819 = !DILocation(line: 1439, column: 9, scope: !820)
!820 = distinct !DILexicalBlock(scope: !821, file: !661, line: 1439, column: 9)
!821 = distinct !DILexicalBlock(scope: !814, file: !661, line: 1439, column: 9)
!822 = !{!713, !713, i64 0}
!823 = !DILocation(line: 1434, column: 51, scope: !808)
!824 = distinct !{!824, !811, !825, !826, !827}
!825 = !DILocation(line: 1441, column: 5, scope: !809)
!826 = !{!"llvm.loop.mustprogress"}
!827 = !{!"llvm.loop.unroll.disable"}
!828 = !DILocation(line: 1442, column: 9, scope: !829)
!829 = distinct !DILexicalBlock(scope: !751, file: !661, line: 1442, column: 9)
!830 = !DILocation(line: 1442, column: 59, scope: !829)
!831 = !DILocation(line: 1442, column: 9, scope: !751)
!832 = !DILocation(line: 1444, column: 16, scope: !764)
!833 = !{!707, !711, i64 568}
!834 = !DILocation(line: 1444, column: 33, scope: !764)
!835 = !DILocation(line: 1444, column: 9, scope: !751)
!836 = !DILocation(line: 1452, column: 61, scope: !763)
!837 = !DILocation(line: 1452, column: 71, scope: !763)
!838 = !DILocalVariable(name: "image", arg: 1, scope: !839, file: !840, line: 27, type: !664)
!839 = distinct !DISubprogram(name: "SetImageProgress", scope: !840, file: !840, line: 27, type: !841, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !843)
!840 = !DIFile(filename: "apps/538.imagick_r/src/magick/monitor-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a84e9021f92665a913f9cbc20a804774")
!841 = !DISubroutineType(types: !842)
!842 = !{!439, !664, !556, !558, !561}
!843 = !{!838, !844, !845, !846, !847}
!844 = !DILocalVariable(name: "tag", arg: 2, scope: !839, file: !840, line: 28, type: !556)
!845 = !DILocalVariable(name: "offset", arg: 3, scope: !839, file: !840, line: 28, type: !558)
!846 = !DILocalVariable(name: "extent", arg: 4, scope: !839, file: !840, line: 28, type: !561)
!847 = !DILocalVariable(name: "message", scope: !839, file: !840, line: 31, type: !576)
!848 = !DILocation(line: 0, scope: !839, inlinedAt: !849)
!849 = distinct !DILocation(line: 1452, column: 17, scope: !763)
!850 = !DILocation(line: 30, column: 3, scope: !839, inlinedAt: !849)
!851 = !DILocation(line: 31, column: 5, scope: !839, inlinedAt: !849)
!852 = !DILocation(line: 35, column: 10, scope: !839, inlinedAt: !849)
!853 = !DILocation(line: 36, column: 17, scope: !839, inlinedAt: !849)
!854 = !DILocation(line: 36, column: 63, scope: !839, inlinedAt: !849)
!855 = !{!707, !711, i64 576}
!856 = !DILocation(line: 36, column: 10, scope: !839, inlinedAt: !849)
!857 = !DILocation(line: 37, column: 1, scope: !839, inlinedAt: !849)
!858 = !DILocation(line: 0, scope: !763)
!859 = !DILocation(line: 1453, column: 21, scope: !860)
!860 = distinct !DILexicalBlock(scope: !763, file: !661, line: 1453, column: 13)
!861 = !DILocation(line: 1453, column: 13, scope: !763)
!862 = !DILocation(line: 1455, column: 7, scope: !763)
!863 = !DILocation(line: 1404, column: 46, scope: !752)
!864 = distinct !{!864, !792, !865, !826, !827}
!865 = !DILocation(line: 1456, column: 3, scope: !753)
!866 = !DILocation(line: 1395, column: 9, scope: !733)
!867 = !DILocation(line: 1457, column: 13, scope: !733)
!868 = !DILocation(line: 1458, column: 14, scope: !733)
!869 = !DILocation(line: 1459, column: 27, scope: !733)
!870 = !{!707, !708, i64 13184}
!871 = !DILocation(line: 1459, column: 15, scope: !733)
!872 = !DILocation(line: 1459, column: 19, scope: !733)
!873 = !DILocation(line: 1460, column: 18, scope: !874)
!874 = distinct !DILexicalBlock(scope: !733, file: !661, line: 1460, column: 7)
!875 = !DILocation(line: 1460, column: 7, scope: !733)
!876 = !DILocation(line: 1461, column: 46, scope: !874)
!877 = !DILocation(line: 1461, column: 53, scope: !874)
!878 = !DILocation(line: 1461, column: 5, scope: !874)
!879 = !DILocation(line: 1462, column: 15, scope: !733)
!880 = !DILocation(line: 1462, column: 20, scope: !733)
!881 = !DILocation(line: 1463, column: 14, scope: !882)
!882 = distinct !DILexicalBlock(scope: !733, file: !661, line: 1463, column: 7)
!883 = !DILocation(line: 1463, column: 7, scope: !733)
!884 = !DILocation(line: 1464, column: 16, scope: !882)
!885 = !DILocation(line: 1464, column: 5, scope: !882)
!886 = !DILocation(line: 1466, column: 1, scope: !733)
!887 = !DISubprogram(name: "RotateImage", scope: !888, file: !888, line: 77, type: !889, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!888 = !DIFile(filename: "apps/538.imagick_r/src/magick/distort.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "61738a5e0552018447b32d5aafa59fd2")
!889 = !DISubroutineType(types: !890)
!890 = !{!422, !664, !891, !667}
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!892 = distinct !DISubprogram(name: "FlipImage", scope: !661, file: !661, line: 1232, type: !734, scopeLine: 1233, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !893)
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !907, !908, !909, !910}
!894 = !DILocalVariable(name: "image", arg: 1, scope: !892, file: !661, line: 1232, type: !664)
!895 = !DILocalVariable(name: "exception", arg: 2, scope: !892, file: !661, line: 1232, type: !667)
!896 = !DILocalVariable(name: "flip_view", scope: !892, file: !661, line: 1237, type: !740)
!897 = !DILocalVariable(name: "image_view", scope: !892, file: !661, line: 1238, type: !740)
!898 = !DILocalVariable(name: "flip_image", scope: !892, file: !661, line: 1241, type: !422)
!899 = !DILocalVariable(name: "status", scope: !892, file: !661, line: 1244, type: !439)
!900 = !DILocalVariable(name: "progress", scope: !892, file: !661, line: 1247, type: !559)
!901 = !DILocalVariable(name: "page", scope: !892, file: !661, line: 1250, type: !495)
!902 = !DILocalVariable(name: "y", scope: !892, file: !661, line: 1253, type: !487)
!903 = !DILocalVariable(name: "indexes", scope: !904, file: !661, line: 1279, type: !754)
!904 = distinct !DILexicalBlock(scope: !905, file: !661, line: 1277, column: 3)
!905 = distinct !DILexicalBlock(scope: !906, file: !661, line: 1276, column: 3)
!906 = distinct !DILexicalBlock(scope: !892, file: !661, line: 1276, column: 3)
!907 = !DILocalVariable(name: "p", scope: !904, file: !661, line: 1282, type: !756)
!908 = !DILocalVariable(name: "flip_indexes", scope: !904, file: !661, line: 1285, type: !758)
!909 = !DILocalVariable(name: "q", scope: !904, file: !661, line: 1288, type: !761)
!910 = !DILocalVariable(name: "proceed", scope: !911, file: !661, line: 1314, type: !439)
!911 = distinct !DILexicalBlock(scope: !912, file: !661, line: 1312, column: 7)
!912 = distinct !DILexicalBlock(scope: !904, file: !661, line: 1311, column: 9)
!913 = !DILocation(line: 0, scope: !892)
!914 = !DILocation(line: 1257, column: 14, scope: !915)
!915 = distinct !DILexicalBlock(scope: !892, file: !661, line: 1257, column: 7)
!916 = !DILocation(line: 1257, column: 20, scope: !915)
!917 = !DILocation(line: 1257, column: 7, scope: !892)
!918 = !DILocation(line: 1258, column: 68, scope: !915)
!919 = !DILocation(line: 1258, column: 12, scope: !915)
!920 = !DILocation(line: 1258, column: 5, scope: !915)
!921 = !DILocation(line: 1261, column: 38, scope: !892)
!922 = !DILocation(line: 1261, column: 53, scope: !892)
!923 = !DILocation(line: 1261, column: 14, scope: !892)
!924 = !DILocation(line: 1262, column: 18, scope: !925)
!925 = distinct !DILexicalBlock(scope: !892, file: !661, line: 1262, column: 7)
!926 = !DILocation(line: 1262, column: 7, scope: !892)
!927 = !DILocation(line: 1269, column: 15, scope: !892)
!928 = !DILocation(line: 1270, column: 14, scope: !892)
!929 = !DILocation(line: 1271, column: 13, scope: !892)
!930 = !DILocation(line: 1276, column: 39, scope: !905)
!931 = !DILocation(line: 1276, column: 15, scope: !905)
!932 = !DILocation(line: 1276, column: 3, scope: !906)
!933 = !DILocation(line: 1290, column: 16, scope: !934)
!934 = distinct !DILexicalBlock(scope: !904, file: !661, line: 1290, column: 9)
!935 = !DILocation(line: 1290, column: 9, scope: !904)
!936 = !DILocation(line: 1292, column: 55, scope: !904)
!937 = !DILocation(line: 1292, column: 7, scope: !904)
!938 = !DILocation(line: 0, scope: !904)
!939 = !DILocation(line: 1293, column: 72, scope: !904)
!940 = !DILocation(line: 1293, column: 78, scope: !904)
!941 = !DILocation(line: 1294, column: 22, scope: !904)
!942 = !DILocation(line: 1293, column: 7, scope: !904)
!943 = !DILocation(line: 1295, column: 12, scope: !944)
!944 = distinct !DILexicalBlock(scope: !904, file: !661, line: 1295, column: 9)
!945 = !DILocation(line: 1295, column: 43, scope: !944)
!946 = !DILocation(line: 1300, column: 49, scope: !904)
!947 = !DILocation(line: 1300, column: 56, scope: !904)
!948 = !DILocation(line: 1300, column: 12, scope: !904)
!949 = !DILocation(line: 1301, column: 13, scope: !904)
!950 = !DILocation(line: 1302, column: 17, scope: !951)
!951 = distinct !DILexicalBlock(scope: !904, file: !661, line: 1302, column: 9)
!952 = !DILocation(line: 1302, column: 9, scope: !904)
!953 = !DILocation(line: 1304, column: 22, scope: !954)
!954 = distinct !DILexicalBlock(scope: !951, file: !661, line: 1303, column: 7)
!955 = !DILocation(line: 1305, column: 26, scope: !956)
!956 = distinct !DILexicalBlock(scope: !954, file: !661, line: 1305, column: 13)
!957 = !DILocation(line: 1305, column: 13, scope: !954)
!958 = !DILocation(line: 1306, column: 72, scope: !956)
!959 = !DILocation(line: 1306, column: 79, scope: !956)
!960 = !DILocation(line: 1306, column: 18, scope: !956)
!961 = !DILocation(line: 1306, column: 11, scope: !956)
!962 = !DILocation(line: 1309, column: 9, scope: !963)
!963 = distinct !DILexicalBlock(scope: !904, file: !661, line: 1309, column: 9)
!964 = !DILocation(line: 1309, column: 59, scope: !963)
!965 = !DILocation(line: 1309, column: 9, scope: !904)
!966 = !DILocation(line: 1311, column: 16, scope: !912)
!967 = !DILocation(line: 1311, column: 33, scope: !912)
!968 = !DILocation(line: 1311, column: 9, scope: !904)
!969 = !DILocation(line: 1319, column: 61, scope: !911)
!970 = !DILocation(line: 1319, column: 71, scope: !911)
!971 = !DILocation(line: 0, scope: !839, inlinedAt: !972)
!972 = distinct !DILocation(line: 1319, column: 17, scope: !911)
!973 = !DILocation(line: 30, column: 3, scope: !839, inlinedAt: !972)
!974 = !DILocation(line: 31, column: 5, scope: !839, inlinedAt: !972)
!975 = !DILocation(line: 35, column: 10, scope: !839, inlinedAt: !972)
!976 = !DILocation(line: 36, column: 17, scope: !839, inlinedAt: !972)
!977 = !DILocation(line: 36, column: 63, scope: !839, inlinedAt: !972)
!978 = !DILocation(line: 36, column: 10, scope: !839, inlinedAt: !972)
!979 = !DILocation(line: 37, column: 1, scope: !839, inlinedAt: !972)
!980 = !DILocation(line: 0, scope: !911)
!981 = !DILocation(line: 1320, column: 21, scope: !982)
!982 = distinct !DILexicalBlock(scope: !911, file: !661, line: 1320, column: 13)
!983 = !DILocation(line: 1320, column: 13, scope: !911)
!984 = !DILocation(line: 1322, column: 7, scope: !911)
!985 = !DILocation(line: 1276, column: 46, scope: !905)
!986 = distinct !{!986, !932, !987, !826, !827}
!987 = !DILocation(line: 1323, column: 3, scope: !906)
!988 = !DILocation(line: 1267, column: 9, scope: !892)
!989 = !DILocation(line: 1324, column: 13, scope: !892)
!990 = !DILocation(line: 1325, column: 14, scope: !892)
!991 = !DILocation(line: 1326, column: 27, scope: !892)
!992 = !DILocation(line: 1326, column: 15, scope: !892)
!993 = !DILocation(line: 1326, column: 19, scope: !892)
!994 = !DILocation(line: 1327, column: 19, scope: !995)
!995 = distinct !DILexicalBlock(scope: !892, file: !661, line: 1327, column: 7)
!996 = !DILocation(line: 1327, column: 7, scope: !892)
!997 = !DILocation(line: 1328, column: 47, scope: !995)
!998 = !DILocation(line: 1328, column: 51, scope: !995)
!999 = !DILocation(line: 1328, column: 5, scope: !995)
!1000 = !DILocation(line: 1329, column: 15, scope: !892)
!1001 = !DILocation(line: 1329, column: 20, scope: !892)
!1002 = !DILocation(line: 1330, column: 14, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !892, file: !661, line: 1330, column: 7)
!1004 = !DILocation(line: 1330, column: 7, scope: !892)
!1005 = !DILocation(line: 1331, column: 16, scope: !1003)
!1006 = !DILocation(line: 1331, column: 5, scope: !1003)
!1007 = !DILocation(line: 1333, column: 1, scope: !892)
!1008 = distinct !DISubprogram(name: "TransposeImage", scope: !661, file: !661, line: 2189, type: !734, scopeLine: 2190, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1023, !1024, !1025, !1026}
!1010 = !DILocalVariable(name: "image", arg: 1, scope: !1008, file: !661, line: 2189, type: !664)
!1011 = !DILocalVariable(name: "exception", arg: 2, scope: !1008, file: !661, line: 2189, type: !667)
!1012 = !DILocalVariable(name: "image_view", scope: !1008, file: !661, line: 2194, type: !740)
!1013 = !DILocalVariable(name: "transpose_view", scope: !1008, file: !661, line: 2195, type: !740)
!1014 = !DILocalVariable(name: "transpose_image", scope: !1008, file: !661, line: 2198, type: !422)
!1015 = !DILocalVariable(name: "status", scope: !1008, file: !661, line: 2201, type: !439)
!1016 = !DILocalVariable(name: "progress", scope: !1008, file: !661, line: 2204, type: !559)
!1017 = !DILocalVariable(name: "page", scope: !1008, file: !661, line: 2207, type: !495)
!1018 = !DILocalVariable(name: "y", scope: !1008, file: !661, line: 2210, type: !487)
!1019 = !DILocalVariable(name: "p", scope: !1020, file: !661, line: 2236, type: !756)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !661, line: 2234, column: 3)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !661, line: 2233, column: 3)
!1022 = distinct !DILexicalBlock(scope: !1008, file: !661, line: 2233, column: 3)
!1023 = !DILocalVariable(name: "transpose_indexes", scope: !1020, file: !661, line: 2239, type: !758)
!1024 = !DILocalVariable(name: "indexes", scope: !1020, file: !661, line: 2240, type: !758)
!1025 = !DILocalVariable(name: "q", scope: !1020, file: !661, line: 2243, type: !761)
!1026 = !DILocalVariable(name: "proceed", scope: !1027, file: !661, line: 2270, type: !439)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !661, line: 2268, column: 7)
!1028 = distinct !DILexicalBlock(scope: !1020, file: !661, line: 2267, column: 9)
!1029 = !DILocation(line: 0, scope: !1008)
!1030 = !DILocation(line: 2214, column: 14, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1008, file: !661, line: 2214, column: 7)
!1032 = !DILocation(line: 2214, column: 20, scope: !1031)
!1033 = !DILocation(line: 2214, column: 7, scope: !1008)
!1034 = !DILocation(line: 2215, column: 68, scope: !1031)
!1035 = !DILocation(line: 2215, column: 12, scope: !1031)
!1036 = !DILocation(line: 2215, column: 5, scope: !1031)
!1037 = !DILocation(line: 2218, column: 43, scope: !1008)
!1038 = !DILocation(line: 2218, column: 55, scope: !1008)
!1039 = !DILocation(line: 2218, column: 19, scope: !1008)
!1040 = !DILocation(line: 2220, column: 23, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1008, file: !661, line: 2220, column: 7)
!1042 = !DILocation(line: 2220, column: 7, scope: !1008)
!1043 = !DILocation(line: 2227, column: 14, scope: !1008)
!1044 = !DILocation(line: 2228, column: 18, scope: !1008)
!1045 = !DILocation(line: 2233, column: 34, scope: !1021)
!1046 = !DILocation(line: 2233, column: 15, scope: !1021)
!1047 = !DILocation(line: 2233, column: 3, scope: !1022)
!1048 = !DILocation(line: 2245, column: 16, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1020, file: !661, line: 2245, column: 9)
!1050 = !DILocation(line: 2245, column: 9, scope: !1020)
!1051 = !DILocation(line: 2247, column: 69, scope: !1020)
!1052 = !DILocation(line: 2248, column: 14, scope: !1020)
!1053 = !DILocation(line: 2247, column: 7, scope: !1020)
!1054 = !DILocation(line: 0, scope: !1020)
!1055 = !DILocation(line: 2249, column: 70, scope: !1020)
!1056 = !DILocation(line: 2249, column: 76, scope: !1020)
!1057 = !DILocation(line: 2250, column: 28, scope: !1020)
!1058 = !DILocation(line: 2249, column: 7, scope: !1020)
!1059 = !DILocation(line: 2251, column: 12, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1020, file: !661, line: 2251, column: 9)
!1061 = !DILocation(line: 2251, column: 43, scope: !1060)
!1062 = !DILocation(line: 2256, column: 49, scope: !1020)
!1063 = !DILocation(line: 2256, column: 56, scope: !1020)
!1064 = !DILocation(line: 2256, column: 12, scope: !1020)
!1065 = !DILocation(line: 2257, column: 13, scope: !1020)
!1066 = !DILocation(line: 2258, column: 17, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1020, file: !661, line: 2258, column: 9)
!1068 = !DILocation(line: 2258, column: 9, scope: !1020)
!1069 = !DILocation(line: 2260, column: 27, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1067, file: !661, line: 2259, column: 7)
!1071 = !DILocation(line: 2261, column: 31, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1070, file: !661, line: 2261, column: 13)
!1073 = !DILocation(line: 2261, column: 13, scope: !1070)
!1074 = !DILocation(line: 2263, column: 20, scope: !1072)
!1075 = !DILocation(line: 2263, column: 27, scope: !1072)
!1076 = !DILocation(line: 2262, column: 18, scope: !1072)
!1077 = !DILocation(line: 2262, column: 11, scope: !1072)
!1078 = !DILocation(line: 2265, column: 9, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1020, file: !661, line: 2265, column: 9)
!1080 = !DILocation(line: 2265, column: 64, scope: !1079)
!1081 = !DILocation(line: 2265, column: 9, scope: !1020)
!1082 = !DILocation(line: 2267, column: 16, scope: !1028)
!1083 = !DILocation(line: 2267, column: 33, scope: !1028)
!1084 = !DILocation(line: 2267, column: 9, scope: !1020)
!1085 = !DILocation(line: 2275, column: 66, scope: !1027)
!1086 = !DILocation(line: 2276, column: 18, scope: !1027)
!1087 = !DILocation(line: 0, scope: !839, inlinedAt: !1088)
!1088 = distinct !DILocation(line: 2275, column: 17, scope: !1027)
!1089 = !DILocation(line: 30, column: 3, scope: !839, inlinedAt: !1088)
!1090 = !DILocation(line: 31, column: 5, scope: !839, inlinedAt: !1088)
!1091 = !DILocation(line: 35, column: 10, scope: !839, inlinedAt: !1088)
!1092 = !DILocation(line: 36, column: 17, scope: !839, inlinedAt: !1088)
!1093 = !DILocation(line: 36, column: 63, scope: !839, inlinedAt: !1088)
!1094 = !DILocation(line: 36, column: 10, scope: !839, inlinedAt: !1088)
!1095 = !DILocation(line: 37, column: 1, scope: !839, inlinedAt: !1088)
!1096 = !DILocation(line: 0, scope: !1027)
!1097 = !DILocation(line: 2277, column: 21, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1027, file: !661, line: 2277, column: 13)
!1099 = !DILocation(line: 2277, column: 13, scope: !1027)
!1100 = !DILocation(line: 2279, column: 7, scope: !1027)
!1101 = !DILocation(line: 2233, column: 41, scope: !1021)
!1102 = distinct !{!1102, !1047, !1103, !826, !827}
!1103 = !DILocation(line: 2280, column: 3, scope: !1022)
!1104 = !DILocation(line: 2225, column: 9, scope: !1008)
!1105 = !DILocation(line: 2281, column: 18, scope: !1008)
!1106 = !DILocation(line: 2282, column: 14, scope: !1008)
!1107 = !DILocation(line: 2283, column: 32, scope: !1008)
!1108 = !DILocation(line: 2283, column: 20, scope: !1008)
!1109 = !DILocation(line: 2283, column: 24, scope: !1008)
!1110 = !DILocation(line: 2284, column: 25, scope: !1008)
!1111 = !DILocation(line: 2287, column: 25, scope: !1008)
!1112 = !DILocation(line: 2288, column: 14, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1008, file: !661, line: 2288, column: 7)
!1114 = !DILocation(line: 2288, column: 7, scope: !1008)
!1115 = !DILocation(line: 2289, column: 21, scope: !1113)
!1116 = !DILocation(line: 2289, column: 5, scope: !1113)
!1117 = !DILocation(line: 2291, column: 1, scope: !1008)
!1118 = distinct !DISubprogram(name: "TransverseImage", scope: !661, file: !661, line: 2318, type: !734, scopeLine: 2319, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1133, !1134, !1135, !1136, !1137, !1138}
!1120 = !DILocalVariable(name: "image", arg: 1, scope: !1118, file: !661, line: 2318, type: !664)
!1121 = !DILocalVariable(name: "exception", arg: 2, scope: !1118, file: !661, line: 2318, type: !667)
!1122 = !DILocalVariable(name: "image_view", scope: !1118, file: !661, line: 2323, type: !740)
!1123 = !DILocalVariable(name: "transverse_view", scope: !1118, file: !661, line: 2324, type: !740)
!1124 = !DILocalVariable(name: "transverse_image", scope: !1118, file: !661, line: 2327, type: !422)
!1125 = !DILocalVariable(name: "status", scope: !1118, file: !661, line: 2330, type: !439)
!1126 = !DILocalVariable(name: "progress", scope: !1118, file: !661, line: 2333, type: !559)
!1127 = !DILocalVariable(name: "page", scope: !1118, file: !661, line: 2336, type: !495)
!1128 = !DILocalVariable(name: "y", scope: !1118, file: !661, line: 2339, type: !487)
!1129 = !DILocalVariable(name: "sync", scope: !1130, file: !661, line: 2365, type: !439)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !661, line: 2363, column: 3)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !661, line: 2362, column: 3)
!1132 = distinct !DILexicalBlock(scope: !1118, file: !661, line: 2362, column: 3)
!1133 = !DILocalVariable(name: "p", scope: !1130, file: !661, line: 2368, type: !756)
!1134 = !DILocalVariable(name: "transverse_indexes", scope: !1130, file: !661, line: 2371, type: !758)
!1135 = !DILocalVariable(name: "indexes", scope: !1130, file: !661, line: 2372, type: !758)
!1136 = !DILocalVariable(name: "x", scope: !1130, file: !661, line: 2375, type: !487)
!1137 = !DILocalVariable(name: "q", scope: !1130, file: !661, line: 2378, type: !761)
!1138 = !DILocalVariable(name: "proceed", scope: !1139, file: !661, line: 2408, type: !439)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !661, line: 2406, column: 7)
!1140 = distinct !DILexicalBlock(scope: !1130, file: !661, line: 2405, column: 9)
!1141 = !DILocation(line: 0, scope: !1118)
!1142 = !DILocation(line: 2343, column: 14, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1118, file: !661, line: 2343, column: 7)
!1144 = !DILocation(line: 2343, column: 20, scope: !1143)
!1145 = !DILocation(line: 2343, column: 7, scope: !1118)
!1146 = !DILocation(line: 2344, column: 68, scope: !1143)
!1147 = !DILocation(line: 2344, column: 12, scope: !1143)
!1148 = !DILocation(line: 2344, column: 5, scope: !1143)
!1149 = !DILocation(line: 2347, column: 44, scope: !1118)
!1150 = !DILocation(line: 2347, column: 56, scope: !1118)
!1151 = !DILocation(line: 2347, column: 20, scope: !1118)
!1152 = !DILocation(line: 2349, column: 24, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1118, file: !661, line: 2349, column: 7)
!1154 = !DILocation(line: 2349, column: 7, scope: !1118)
!1155 = !DILocation(line: 2356, column: 14, scope: !1118)
!1156 = !DILocation(line: 2357, column: 19, scope: !1118)
!1157 = !DILocation(line: 2362, column: 34, scope: !1131)
!1158 = !DILocation(line: 2362, column: 15, scope: !1131)
!1159 = !DILocation(line: 2362, column: 3, scope: !1132)
!1160 = !DILocation(line: 2380, column: 16, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1130, file: !661, line: 2380, column: 9)
!1162 = !DILocation(line: 2380, column: 9, scope: !1130)
!1163 = !DILocation(line: 2382, column: 55, scope: !1130)
!1164 = !DILocation(line: 2382, column: 7, scope: !1130)
!1165 = !DILocation(line: 0, scope: !1130)
!1166 = !DILocation(line: 2383, column: 71, scope: !1130)
!1167 = !DILocation(line: 2383, column: 77, scope: !1130)
!1168 = !DILocation(line: 2384, column: 32, scope: !1130)
!1169 = !DILocation(line: 2383, column: 7, scope: !1130)
!1170 = !DILocation(line: 2385, column: 12, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1130, file: !661, line: 2385, column: 9)
!1172 = !DILocation(line: 2385, column: 43, scope: !1171)
!1173 = !DILocation(line: 2390, column: 15, scope: !1130)
!1174 = !DILocation(line: 2391, column: 17, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1176, file: !661, line: 2391, column: 5)
!1176 = distinct !DILexicalBlock(scope: !1130, file: !661, line: 2391, column: 5)
!1177 = !DILocation(line: 2391, column: 5, scope: !1176)
!1178 = !DILocation(line: 2390, column: 6, scope: !1130)
!1179 = !DILocation(line: 2392, column: 8, scope: !1175)
!1180 = !DILocation(line: 2392, column: 15, scope: !1175)
!1181 = !DILocation(line: 2392, column: 13, scope: !1175)
!1182 = !DILocation(line: 2391, column: 46, scope: !1175)
!1183 = !DILocation(line: 2391, column: 36, scope: !1175)
!1184 = distinct !{!1184, !1177, !1185, !826, !827}
!1185 = !DILocation(line: 2392, column: 17, scope: !1176)
!1186 = !DILocation(line: 2393, column: 13, scope: !1130)
!1187 = !DILocation(line: 2394, column: 17, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1130, file: !661, line: 2394, column: 9)
!1189 = !DILocation(line: 2394, column: 9, scope: !1130)
!1190 = !DILocation(line: 2396, column: 28, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1188, file: !661, line: 2395, column: 7)
!1192 = !DILocation(line: 2397, column: 32, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1191, file: !661, line: 2397, column: 13)
!1194 = !DILocation(line: 2397, column: 13, scope: !1191)
!1195 = !DILocation(line: 2398, column: 23, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !661, line: 2398, column: 11)
!1197 = distinct !DILexicalBlock(scope: !1193, file: !661, line: 2398, column: 11)
!1198 = !DILocation(line: 2398, column: 11, scope: !1197)
!1199 = !DILocation(line: 2399, column: 13, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !661, line: 2399, column: 13)
!1201 = distinct !DILexicalBlock(scope: !1196, file: !661, line: 2399, column: 13)
!1202 = !DILocation(line: 2398, column: 52, scope: !1196)
!1203 = distinct !{!1203, !1198, !1204, !826, !827}
!1204 = !DILocation(line: 2399, column: 13, scope: !1197)
!1205 = !DILocation(line: 2402, column: 10, scope: !1130)
!1206 = !DILocation(line: 2403, column: 14, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1130, file: !661, line: 2403, column: 9)
!1208 = !DILocation(line: 2403, column: 9, scope: !1130)
!1209 = !DILocation(line: 2405, column: 16, scope: !1140)
!1210 = !DILocation(line: 2405, column: 33, scope: !1140)
!1211 = !DILocation(line: 2405, column: 9, scope: !1130)
!1212 = !DILocation(line: 2413, column: 67, scope: !1139)
!1213 = !DILocation(line: 2414, column: 18, scope: !1139)
!1214 = !DILocation(line: 0, scope: !839, inlinedAt: !1215)
!1215 = distinct !DILocation(line: 2413, column: 17, scope: !1139)
!1216 = !DILocation(line: 30, column: 3, scope: !839, inlinedAt: !1215)
!1217 = !DILocation(line: 31, column: 5, scope: !839, inlinedAt: !1215)
!1218 = !DILocation(line: 35, column: 10, scope: !839, inlinedAt: !1215)
!1219 = !DILocation(line: 36, column: 17, scope: !839, inlinedAt: !1215)
!1220 = !DILocation(line: 36, column: 63, scope: !839, inlinedAt: !1215)
!1221 = !DILocation(line: 36, column: 10, scope: !839, inlinedAt: !1215)
!1222 = !DILocation(line: 37, column: 1, scope: !839, inlinedAt: !1215)
!1223 = !DILocation(line: 0, scope: !1139)
!1224 = !DILocation(line: 2415, column: 21, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1139, file: !661, line: 2415, column: 13)
!1226 = !DILocation(line: 2415, column: 13, scope: !1139)
!1227 = !DILocation(line: 2417, column: 7, scope: !1139)
!1228 = !DILocation(line: 2362, column: 41, scope: !1131)
!1229 = distinct !{!1229, !1159, !1230, !826, !827}
!1230 = !DILocation(line: 2418, column: 3, scope: !1132)
!1231 = !DILocation(line: 2354, column: 9, scope: !1118)
!1232 = !DILocation(line: 2419, column: 19, scope: !1118)
!1233 = !DILocation(line: 2420, column: 14, scope: !1118)
!1234 = !DILocation(line: 2421, column: 33, scope: !1118)
!1235 = !DILocation(line: 2421, column: 21, scope: !1118)
!1236 = !DILocation(line: 2421, column: 25, scope: !1118)
!1237 = !DILocation(line: 2422, column: 26, scope: !1118)
!1238 = !DILocation(line: 2425, column: 18, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1118, file: !661, line: 2425, column: 7)
!1240 = !DILocation(line: 2425, column: 7, scope: !1118)
!1241 = !DILocation(line: 2426, column: 52, scope: !1239)
!1242 = !DILocation(line: 2426, column: 59, scope: !1239)
!1243 = !DILocation(line: 2426, column: 5, scope: !1239)
!1244 = !DILocation(line: 2427, column: 19, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1118, file: !661, line: 2427, column: 7)
!1246 = !DILocation(line: 2427, column: 7, scope: !1118)
!1247 = !DILocation(line: 2428, column: 53, scope: !1245)
!1248 = !DILocation(line: 2428, column: 57, scope: !1245)
!1249 = !DILocation(line: 2428, column: 5, scope: !1245)
!1250 = !DILocation(line: 2429, column: 26, scope: !1118)
!1251 = !DILocation(line: 2430, column: 14, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1118, file: !661, line: 2430, column: 7)
!1253 = !DILocation(line: 2430, column: 7, scope: !1118)
!1254 = !DILocation(line: 2431, column: 22, scope: !1252)
!1255 = !DILocation(line: 2431, column: 5, scope: !1252)
!1256 = !DILocation(line: 2433, column: 1, scope: !1118)
!1257 = distinct !DISubprogram(name: "ChopImage", scope: !661, file: !661, line: 187, type: !1258, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1262)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!422, !664, !1260, !667}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!1262 = !{!1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1277, !1278, !1279, !1280, !1281, !1284, !1288, !1289, !1290, !1291, !1292}
!1263 = !DILocalVariable(name: "image", arg: 1, scope: !1257, file: !661, line: 187, type: !664)
!1264 = !DILocalVariable(name: "chop_info", arg: 2, scope: !1257, file: !661, line: 187, type: !1260)
!1265 = !DILocalVariable(name: "exception", arg: 3, scope: !1257, file: !661, line: 188, type: !667)
!1266 = !DILocalVariable(name: "chop_view", scope: !1257, file: !661, line: 193, type: !740)
!1267 = !DILocalVariable(name: "image_view", scope: !1257, file: !661, line: 194, type: !740)
!1268 = !DILocalVariable(name: "chop_image", scope: !1257, file: !661, line: 197, type: !422)
!1269 = !DILocalVariable(name: "status", scope: !1257, file: !661, line: 200, type: !439)
!1270 = !DILocalVariable(name: "progress", scope: !1257, file: !661, line: 203, type: !559)
!1271 = !DILocalVariable(name: "extent", scope: !1257, file: !661, line: 206, type: !495)
!1272 = !DILocalVariable(name: "y", scope: !1257, file: !661, line: 209, type: !487)
!1273 = !DILocalVariable(name: "p", scope: !1274, file: !661, line: 259, type: !756)
!1274 = distinct !DILexicalBlock(scope: !1275, file: !661, line: 257, column: 3)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !661, line: 256, column: 3)
!1276 = distinct !DILexicalBlock(scope: !1257, file: !661, line: 256, column: 3)
!1277 = !DILocalVariable(name: "chop_indexes", scope: !1274, file: !661, line: 262, type: !758)
!1278 = !DILocalVariable(name: "indexes", scope: !1274, file: !661, line: 263, type: !758)
!1279 = !DILocalVariable(name: "x", scope: !1274, file: !661, line: 266, type: !487)
!1280 = !DILocalVariable(name: "q", scope: !1274, file: !661, line: 269, type: !761)
!1281 = !DILocalVariable(name: "proceed", scope: !1282, file: !661, line: 302, type: !439)
!1282 = distinct !DILexicalBlock(scope: !1283, file: !661, line: 300, column: 7)
!1283 = distinct !DILexicalBlock(scope: !1274, file: !661, line: 299, column: 9)
!1284 = !DILocalVariable(name: "p", scope: !1285, file: !661, line: 322, type: !756)
!1285 = distinct !DILexicalBlock(scope: !1286, file: !661, line: 320, column: 3)
!1286 = distinct !DILexicalBlock(scope: !1287, file: !661, line: 319, column: 3)
!1287 = distinct !DILexicalBlock(scope: !1257, file: !661, line: 319, column: 3)
!1288 = !DILocalVariable(name: "chop_indexes", scope: !1285, file: !661, line: 325, type: !758)
!1289 = !DILocalVariable(name: "indexes", scope: !1285, file: !661, line: 326, type: !758)
!1290 = !DILocalVariable(name: "x", scope: !1285, file: !661, line: 329, type: !487)
!1291 = !DILocalVariable(name: "q", scope: !1285, file: !661, line: 332, type: !761)
!1292 = !DILocalVariable(name: "proceed", scope: !1293, file: !661, line: 366, type: !439)
!1293 = distinct !DILexicalBlock(scope: !1294, file: !661, line: 364, column: 7)
!1294 = distinct !DILexicalBlock(scope: !1285, file: !661, line: 363, column: 9)
!1295 = !DILocation(line: 0, scope: !1257)
!1296 = !DILocation(line: 216, column: 14, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1257, file: !661, line: 216, column: 7)
!1298 = !DILocation(line: 216, column: 20, scope: !1297)
!1299 = !DILocation(line: 216, column: 7, scope: !1257)
!1300 = !DILocation(line: 217, column: 68, scope: !1297)
!1301 = !DILocation(line: 217, column: 12, scope: !1297)
!1302 = !DILocation(line: 217, column: 5, scope: !1297)
!1303 = !DILocation(line: 221, column: 20, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1257, file: !661, line: 221, column: 7)
!1305 = !{!717, !710, i64 16}
!1306 = !DILocation(line: 221, column: 43, scope: !1304)
!1307 = !{!717, !710, i64 0}
!1308 = !DILocation(line: 221, column: 21, scope: !1304)
!1309 = !DILocation(line: 221, column: 50, scope: !1304)
!1310 = !DILocation(line: 221, column: 55, scope: !1304)
!1311 = !DILocation(line: 222, column: 20, scope: !1304)
!1312 = !{!717, !710, i64 24}
!1313 = !DILocation(line: 222, column: 43, scope: !1304)
!1314 = !{!717, !710, i64 8}
!1315 = !DILocation(line: 222, column: 21, scope: !1304)
!1316 = !DILocation(line: 222, column: 51, scope: !1304)
!1317 = !DILocation(line: 222, column: 56, scope: !1304)
!1318 = !DILocation(line: 223, column: 40, scope: !1304)
!1319 = !DILocation(line: 223, column: 21, scope: !1304)
!1320 = !DILocation(line: 223, column: 49, scope: !1304)
!1321 = !DILocation(line: 224, column: 40, scope: !1304)
!1322 = !DILocation(line: 224, column: 21, scope: !1304)
!1323 = !DILocation(line: 221, column: 7, scope: !1257)
!1324 = !DILocation(line: 225, column: 5, scope: !1325)
!1325 = distinct !DILexicalBlock(scope: !1304, file: !661, line: 225, column: 5)
!1326 = !DILocation(line: 227, column: 41, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1257, file: !661, line: 227, column: 7)
!1328 = !DILocation(line: 227, column: 7, scope: !1257)
!1329 = !DILocation(line: 229, column: 42, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1257, file: !661, line: 229, column: 7)
!1331 = !DILocation(line: 229, column: 7, scope: !1257)
!1332 = !DILocation(line: 231, column: 7, scope: !1257)
!1333 = !DILocation(line: 236, column: 7, scope: !1257)
!1334 = !DILocation(line: 241, column: 45, scope: !1257)
!1335 = !DILocation(line: 241, column: 70, scope: !1257)
!1336 = !DILocation(line: 241, column: 14, scope: !1257)
!1337 = !DILocation(line: 243, column: 18, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1257, file: !661, line: 243, column: 7)
!1339 = !DILocation(line: 243, column: 7, scope: !1257)
!1340 = !DILocation(line: 250, column: 14, scope: !1257)
!1341 = !DILocation(line: 251, column: 13, scope: !1257)
!1342 = !DILocation(line: 256, column: 15, scope: !1275)
!1343 = !DILocation(line: 256, column: 3, scope: !1276)
!1344 = !DILocation(line: 248, column: 9, scope: !1257)
!1345 = !DILocation(line: 249, column: 11, scope: !1257)
!1346 = !DILocation(line: 319, column: 35, scope: !1286)
!1347 = !DILocation(line: 319, column: 39, scope: !1286)
!1348 = !DILocation(line: 319, column: 15, scope: !1286)
!1349 = !DILocation(line: 319, column: 3, scope: !1287)
!1350 = !DILocation(line: 271, column: 16, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1274, file: !661, line: 271, column: 9)
!1352 = !DILocation(line: 271, column: 9, scope: !1274)
!1353 = !DILocation(line: 273, column: 55, scope: !1274)
!1354 = !DILocation(line: 273, column: 7, scope: !1274)
!1355 = !DILocation(line: 0, scope: !1274)
!1356 = !DILocation(line: 274, column: 63, scope: !1274)
!1357 = !DILocation(line: 274, column: 7, scope: !1274)
!1358 = !DILocation(line: 276, column: 12, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1274, file: !661, line: 276, column: 9)
!1360 = !DILocation(line: 276, column: 43, scope: !1359)
!1361 = !DILocation(line: 281, column: 13, scope: !1274)
!1362 = !DILocation(line: 282, column: 18, scope: !1274)
!1363 = !DILocation(line: 283, column: 36, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !1365, file: !661, line: 283, column: 5)
!1365 = distinct !DILexicalBlock(scope: !1274, file: !661, line: 283, column: 5)
!1366 = !DILocation(line: 283, column: 17, scope: !1364)
!1367 = !DILocation(line: 283, column: 5, scope: !1365)
!1368 = !DILocation(line: 285, column: 14, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1370, file: !661, line: 285, column: 11)
!1370 = distinct !DILexicalBlock(scope: !1364, file: !661, line: 284, column: 5)
!1371 = !DILocation(line: 285, column: 26, scope: !1369)
!1372 = !DILocation(line: 287, column: 15, scope: !1373)
!1373 = distinct !DILexicalBlock(scope: !1369, file: !661, line: 286, column: 9)
!1374 = !DILocation(line: 293, column: 12, scope: !1373)
!1375 = !DILocation(line: 294, column: 9, scope: !1373)
!1376 = !DILocation(line: 295, column: 8, scope: !1370)
!1377 = !DILocation(line: 283, column: 46, scope: !1364)
!1378 = distinct !{!1378, !1367, !1379, !826, !827}
!1379 = !DILocation(line: 296, column: 5, scope: !1365)
!1380 = !DILocation(line: 288, column: 15, scope: !1373)
!1381 = !DILocation(line: 291, column: 33, scope: !1382)
!1382 = distinct !DILexicalBlock(scope: !1383, file: !661, line: 290, column: 19)
!1383 = distinct !DILexicalBlock(scope: !1384, file: !661, line: 289, column: 13)
!1384 = distinct !DILexicalBlock(scope: !1373, file: !661, line: 288, column: 15)
!1385 = !DILocation(line: 291, column: 30, scope: !1382)
!1386 = !DILocation(line: 291, column: 32, scope: !1382)
!1387 = !DILocation(line: 291, column: 17, scope: !1382)
!1388 = !DILocation(line: 297, column: 9, scope: !1389)
!1389 = distinct !DILexicalBlock(scope: !1274, file: !661, line: 297, column: 9)
!1390 = !DILocation(line: 297, column: 59, scope: !1389)
!1391 = !DILocation(line: 297, column: 9, scope: !1274)
!1392 = !DILocation(line: 299, column: 16, scope: !1283)
!1393 = !DILocation(line: 299, column: 33, scope: !1283)
!1394 = !DILocation(line: 299, column: 9, scope: !1274)
!1395 = !DILocation(line: 307, column: 61, scope: !1282)
!1396 = !DILocation(line: 307, column: 71, scope: !1282)
!1397 = !DILocation(line: 0, scope: !839, inlinedAt: !1398)
!1398 = distinct !DILocation(line: 307, column: 17, scope: !1282)
!1399 = !DILocation(line: 30, column: 3, scope: !839, inlinedAt: !1398)
!1400 = !DILocation(line: 31, column: 5, scope: !839, inlinedAt: !1398)
!1401 = !DILocation(line: 35, column: 10, scope: !839, inlinedAt: !1398)
!1402 = !DILocation(line: 36, column: 17, scope: !839, inlinedAt: !1398)
!1403 = !DILocation(line: 36, column: 63, scope: !839, inlinedAt: !1398)
!1404 = !DILocation(line: 36, column: 10, scope: !839, inlinedAt: !1398)
!1405 = !DILocation(line: 37, column: 1, scope: !839, inlinedAt: !1398)
!1406 = !DILocation(line: 0, scope: !1282)
!1407 = !DILocation(line: 308, column: 21, scope: !1408)
!1408 = distinct !DILexicalBlock(scope: !1282, file: !661, line: 308, column: 13)
!1409 = !DILocation(line: 308, column: 13, scope: !1282)
!1410 = !DILocation(line: 310, column: 7, scope: !1282)
!1411 = !DILocation(line: 256, column: 38, scope: !1275)
!1412 = distinct !{!1412, !1343, !1413, !826, !827}
!1413 = !DILocation(line: 311, column: 3, scope: !1276)
!1414 = !DILocation(line: 334, column: 16, scope: !1415)
!1415 = distinct !DILexicalBlock(scope: !1285, file: !661, line: 334, column: 9)
!1416 = !DILocation(line: 334, column: 9, scope: !1285)
!1417 = !DILocation(line: 336, column: 68, scope: !1285)
!1418 = !DILocation(line: 337, column: 14, scope: !1285)
!1419 = !DILocation(line: 336, column: 7, scope: !1285)
!1420 = !DILocation(line: 0, scope: !1285)
!1421 = !DILocation(line: 338, column: 57, scope: !1285)
!1422 = !DILocation(line: 338, column: 72, scope: !1285)
!1423 = !DILocation(line: 338, column: 7, scope: !1285)
!1424 = !DILocation(line: 340, column: 12, scope: !1425)
!1425 = distinct !DILexicalBlock(scope: !1285, file: !661, line: 340, column: 9)
!1426 = !DILocation(line: 340, column: 37, scope: !1425)
!1427 = !DILocation(line: 345, column: 13, scope: !1285)
!1428 = !DILocation(line: 346, column: 18, scope: !1285)
!1429 = !DILocation(line: 347, column: 36, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1431, file: !661, line: 347, column: 5)
!1431 = distinct !DILexicalBlock(scope: !1285, file: !661, line: 347, column: 5)
!1432 = !DILocation(line: 347, column: 17, scope: !1430)
!1433 = !DILocation(line: 347, column: 5, scope: !1431)
!1434 = !DILocation(line: 349, column: 14, scope: !1435)
!1435 = distinct !DILexicalBlock(scope: !1436, file: !661, line: 349, column: 11)
!1436 = distinct !DILexicalBlock(scope: !1430, file: !661, line: 348, column: 5)
!1437 = !DILocation(line: 349, column: 26, scope: !1435)
!1438 = !DILocation(line: 351, column: 15, scope: !1439)
!1439 = distinct !DILexicalBlock(scope: !1435, file: !661, line: 350, column: 9)
!1440 = !DILocation(line: 357, column: 12, scope: !1439)
!1441 = !DILocation(line: 358, column: 9, scope: !1439)
!1442 = !DILocation(line: 359, column: 8, scope: !1436)
!1443 = !DILocation(line: 347, column: 46, scope: !1430)
!1444 = distinct !{!1444, !1433, !1445, !826, !827}
!1445 = !DILocation(line: 360, column: 5, scope: !1431)
!1446 = !DILocation(line: 352, column: 15, scope: !1439)
!1447 = !DILocation(line: 355, column: 33, scope: !1448)
!1448 = distinct !DILexicalBlock(scope: !1449, file: !661, line: 354, column: 19)
!1449 = distinct !DILexicalBlock(scope: !1450, file: !661, line: 353, column: 13)
!1450 = distinct !DILexicalBlock(scope: !1439, file: !661, line: 352, column: 15)
!1451 = !DILocation(line: 355, column: 30, scope: !1448)
!1452 = !DILocation(line: 355, column: 32, scope: !1448)
!1453 = !DILocation(line: 355, column: 17, scope: !1448)
!1454 = !DILocation(line: 361, column: 9, scope: !1455)
!1455 = distinct !DILexicalBlock(scope: !1285, file: !661, line: 361, column: 9)
!1456 = !DILocation(line: 361, column: 59, scope: !1455)
!1457 = !DILocation(line: 361, column: 9, scope: !1285)
!1458 = !DILocation(line: 363, column: 16, scope: !1294)
!1459 = !DILocation(line: 363, column: 33, scope: !1294)
!1460 = !DILocation(line: 363, column: 9, scope: !1285)
!1461 = !DILocation(line: 371, column: 61, scope: !1293)
!1462 = !DILocation(line: 371, column: 71, scope: !1293)
!1463 = !DILocation(line: 0, scope: !839, inlinedAt: !1464)
!1464 = distinct !DILocation(line: 371, column: 17, scope: !1293)
!1465 = !DILocation(line: 30, column: 3, scope: !839, inlinedAt: !1464)
!1466 = !DILocation(line: 31, column: 5, scope: !839, inlinedAt: !1464)
!1467 = !DILocation(line: 35, column: 10, scope: !839, inlinedAt: !1464)
!1468 = !DILocation(line: 36, column: 17, scope: !839, inlinedAt: !1464)
!1469 = !DILocation(line: 36, column: 63, scope: !839, inlinedAt: !1464)
!1470 = !DILocation(line: 36, column: 10, scope: !839, inlinedAt: !1464)
!1471 = !DILocation(line: 37, column: 1, scope: !839, inlinedAt: !1464)
!1472 = !DILocation(line: 0, scope: !1293)
!1473 = !DILocation(line: 372, column: 21, scope: !1474)
!1474 = distinct !DILexicalBlock(scope: !1293, file: !661, line: 372, column: 13)
!1475 = !DILocation(line: 372, column: 13, scope: !1293)
!1476 = !DILocation(line: 374, column: 7, scope: !1293)
!1477 = !DILocation(line: 319, column: 68, scope: !1286)
!1478 = distinct !{!1478, !1349, !1479, !826, !827}
!1479 = !DILocation(line: 375, column: 3, scope: !1287)
!1480 = !DILocation(line: 376, column: 13, scope: !1257)
!1481 = !DILocation(line: 377, column: 14, scope: !1257)
!1482 = !DILocation(line: 378, column: 27, scope: !1257)
!1483 = !DILocation(line: 378, column: 15, scope: !1257)
!1484 = !DILocation(line: 378, column: 19, scope: !1257)
!1485 = !DILocation(line: 379, column: 14, scope: !1486)
!1486 = distinct !DILexicalBlock(scope: !1257, file: !661, line: 379, column: 7)
!1487 = !DILocation(line: 379, column: 7, scope: !1257)
!1488 = !DILocation(line: 380, column: 16, scope: !1486)
!1489 = !DILocation(line: 380, column: 5, scope: !1486)
!1490 = !DILocation(line: 382, column: 1, scope: !1257)
!1491 = !DISubprogram(name: "LogMagickEvent", scope: !369, file: !369, line: 83, type: !1492, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!439, !1494, !556, !556, !730, !556, null}
!1494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1495)
!1495 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !369, line: 58, baseType: !368)
!1496 = !DISubprogram(name: "ThrowMagickException", scope: !253, file: !253, line: 156, type: !1497, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!439, !667, !556, !556, !730, !1499, !556, !556, null}
!1499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!1500 = !DISubprogram(name: "AcquireVirtualCacheView", scope: !742, file: !742, line: 55, type: !1501, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!740, !664, !667}
!1503 = !DISubprogram(name: "AcquireAuthenticCacheView", scope: !742, file: !742, line: 53, type: !1501, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1504 = !DISubprogram(name: "GetCacheViewVirtualPixels", scope: !742, file: !742, line: 69, type: !1505, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!644, !1507, !1509, !1509, !730, !730, !667}
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64)
!1508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!1509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!1510 = !DISubprogram(name: "QueueCacheViewAuthenticPixels", scope: !742, file: !742, line: 101, type: !1511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!446, !740, !1509, !1509, !730, !730, !667}
!1513 = !DISubprogram(name: "GetCacheViewAuthenticIndexQueue", scope: !742, file: !742, line: 77, type: !1514, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!646, !740}
!1516 = !DISubprogram(name: "SyncCacheViewAuthenticPixels", scope: !742, file: !742, line: 89, type: !1517, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!439, !740, !667}
!1519 = !DISubprogram(name: "DestroyCacheView", scope: !742, file: !742, line: 57, type: !1520, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!740, !740}
!1522 = !DISubprogram(name: "DestroyImage", scope: !73, file: !73, line: 510, type: !1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{!422, !422}
!1525 = distinct !DISubprogram(name: "ConsolidateCMYKImages", scope: !661, file: !661, line: 409, type: !734, scopeLine: 411, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1526)
!1526 = !{!1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1542, !1543, !1544, !1548, !1549, !1550, !1554, !1555, !1556, !1560, !1561, !1562}
!1527 = !DILocalVariable(name: "images", arg: 1, scope: !1525, file: !661, line: 409, type: !664)
!1528 = !DILocalVariable(name: "exception", arg: 2, scope: !1525, file: !661, line: 410, type: !667)
!1529 = !DILocalVariable(name: "cmyk_view", scope: !1525, file: !661, line: 413, type: !740)
!1530 = !DILocalVariable(name: "image_view", scope: !1525, file: !661, line: 414, type: !740)
!1531 = !DILocalVariable(name: "cmyk_image", scope: !1525, file: !661, line: 417, type: !422)
!1532 = !DILocalVariable(name: "cmyk_images", scope: !1525, file: !661, line: 418, type: !422)
!1533 = !DILocalVariable(name: "i", scope: !1525, file: !661, line: 421, type: !487)
!1534 = !DILocalVariable(name: "y", scope: !1525, file: !661, line: 424, type: !487)
!1535 = !DILocalVariable(name: "p", scope: !1536, file: !661, line: 450, type: !756)
!1536 = distinct !DILexicalBlock(scope: !1537, file: !661, line: 448, column: 5)
!1537 = distinct !DILexicalBlock(scope: !1538, file: !661, line: 447, column: 5)
!1538 = distinct !DILexicalBlock(scope: !1539, file: !661, line: 447, column: 5)
!1539 = distinct !DILexicalBlock(scope: !1540, file: !661, line: 437, column: 3)
!1540 = distinct !DILexicalBlock(scope: !1541, file: !661, line: 436, column: 3)
!1541 = distinct !DILexicalBlock(scope: !1525, file: !661, line: 436, column: 3)
!1542 = !DILocalVariable(name: "x", scope: !1536, file: !661, line: 453, type: !487)
!1543 = !DILocalVariable(name: "q", scope: !1536, file: !661, line: 456, type: !761)
!1544 = !DILocalVariable(name: "p", scope: !1545, file: !661, line: 482, type: !756)
!1545 = distinct !DILexicalBlock(scope: !1546, file: !661, line: 480, column: 5)
!1546 = distinct !DILexicalBlock(scope: !1547, file: !661, line: 479, column: 5)
!1547 = distinct !DILexicalBlock(scope: !1539, file: !661, line: 479, column: 5)
!1548 = !DILocalVariable(name: "x", scope: !1545, file: !661, line: 485, type: !487)
!1549 = !DILocalVariable(name: "q", scope: !1545, file: !661, line: 488, type: !761)
!1550 = !DILocalVariable(name: "p", scope: !1551, file: !661, line: 514, type: !756)
!1551 = distinct !DILexicalBlock(scope: !1552, file: !661, line: 512, column: 5)
!1552 = distinct !DILexicalBlock(scope: !1553, file: !661, line: 511, column: 5)
!1553 = distinct !DILexicalBlock(scope: !1539, file: !661, line: 511, column: 5)
!1554 = !DILocalVariable(name: "x", scope: !1551, file: !661, line: 517, type: !487)
!1555 = !DILocalVariable(name: "q", scope: !1551, file: !661, line: 520, type: !761)
!1556 = !DILocalVariable(name: "p", scope: !1557, file: !661, line: 546, type: !756)
!1557 = distinct !DILexicalBlock(scope: !1558, file: !661, line: 544, column: 5)
!1558 = distinct !DILexicalBlock(scope: !1559, file: !661, line: 543, column: 5)
!1559 = distinct !DILexicalBlock(scope: !1539, file: !661, line: 543, column: 5)
!1560 = !DILocalVariable(name: "indexes", scope: !1557, file: !661, line: 549, type: !758)
!1561 = !DILocalVariable(name: "x", scope: !1557, file: !661, line: 552, type: !487)
!1562 = !DILocalVariable(name: "q", scope: !1557, file: !661, line: 555, type: !761)
!1563 = !DILocation(line: 0, scope: !1525)
!1564 = !DILocation(line: 416, column: 3, scope: !1525)
!1565 = !DILocation(line: 431, column: 15, scope: !1566)
!1566 = distinct !DILexicalBlock(scope: !1525, file: !661, line: 431, column: 7)
!1567 = !DILocation(line: 431, column: 21, scope: !1566)
!1568 = !DILocation(line: 431, column: 7, scope: !1525)
!1569 = !DILocation(line: 432, column: 69, scope: !1566)
!1570 = !DILocation(line: 432, column: 12, scope: !1566)
!1571 = !DILocation(line: 432, column: 5, scope: !1566)
!1572 = !DILocation(line: 435, column: 15, scope: !1525)
!1573 = !DILocation(line: 435, column: 14, scope: !1525)
!1574 = !{!711, !711, i64 0}
!1575 = !DILocation(line: 436, column: 27, scope: !1540)
!1576 = !DILocation(line: 436, column: 15, scope: !1540)
!1577 = !DILocation(line: 436, column: 3, scope: !1541)
!1578 = !DILocation(line: 436, column: 56, scope: !1540)
!1579 = distinct !{!1579, !1577, !1580, !826, !827}
!1580 = !DILocation(line: 578, column: 3, scope: !1541)
!1581 = !DILocation(line: 438, column: 42, scope: !1539)
!1582 = !DILocation(line: 438, column: 58, scope: !1539)
!1583 = !DILocation(line: 438, column: 16, scope: !1539)
!1584 = !DILocation(line: 440, column: 20, scope: !1585)
!1585 = distinct !DILexicalBlock(scope: !1539, file: !661, line: 440, column: 9)
!1586 = !DILocation(line: 440, column: 9, scope: !1539)
!1587 = !DILocation(line: 442, column: 9, scope: !1588)
!1588 = distinct !DILexicalBlock(scope: !1539, file: !661, line: 442, column: 9)
!1589 = !DILocation(line: 442, column: 54, scope: !1588)
!1590 = !DILocation(line: 442, column: 9, scope: !1539)
!1591 = !DILocation(line: 444, column: 12, scope: !1539)
!1592 = !DILocation(line: 445, column: 16, scope: !1539)
!1593 = !DILocation(line: 446, column: 15, scope: !1539)
!1594 = !DILocation(line: 447, column: 37, scope: !1537)
!1595 = !DILocation(line: 447, column: 17, scope: !1537)
!1596 = !DILocation(line: 447, column: 5, scope: !1538)
!1597 = !DILocation(line: 447, column: 44, scope: !1537)
!1598 = distinct !{!1598, !1596, !1599, !826, !827}
!1599 = !DILocation(line: 471, column: 5, scope: !1538)
!1600 = !DILocation(line: 458, column: 58, scope: !1536)
!1601 = !DILocation(line: 458, column: 9, scope: !1536)
!1602 = !DILocation(line: 0, scope: !1536)
!1603 = !DILocation(line: 459, column: 65, scope: !1536)
!1604 = !DILocation(line: 459, column: 9, scope: !1536)
!1605 = !DILocation(line: 461, column: 14, scope: !1606)
!1606 = distinct !DILexicalBlock(scope: !1536, file: !661, line: 461, column: 11)
!1607 = !DILocation(line: 461, column: 45, scope: !1606)
!1608 = !DILocation(line: 463, column: 39, scope: !1609)
!1609 = distinct !DILexicalBlock(scope: !1610, file: !661, line: 463, column: 7)
!1610 = distinct !DILexicalBlock(scope: !1536, file: !661, line: 463, column: 7)
!1611 = !DILocation(line: 463, column: 19, scope: !1609)
