; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/type.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/type.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Fontmap = type { ptr, ptr }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct._TypeInfo = type { i64, ptr, ptr, ptr, ptr, i32, i32, i64, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i64 }

@type_semaphore = internal global ptr null, align 8, !dbg !0
@.str = private unnamed_addr constant [2 x i8] c"*\00", align 1
@type_cache = internal unnamed_addr global ptr null, align 8, !dbg !387
@GetTypeInfoByFamily.fontmap = internal unnamed_addr constant [8 x %struct._Fontmap] [%struct._Fontmap { ptr @.str.1, ptr @.str.2 }, %struct._Fontmap { ptr @.str.3, ptr @.str.2 }, %struct._Fontmap { ptr @.str.4, ptr @.str.2 }, %struct._Fontmap { ptr @.str.5, ptr @.str.6 }, %struct._Fontmap { ptr @.str.7, ptr @.str.2 }, %struct._Fontmap { ptr @.str.8, ptr @.str.2 }, %struct._Fontmap { ptr @.str.9, ptr @.str.10 }, %struct._Fontmap zeroinitializer], align 16, !dbg !344
@.str.1 = private unnamed_addr constant [6 x i8] c"fixed\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"courier\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"modern\00", align 1

!141 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!142 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!143 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!144 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!145 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!146 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!147 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!148 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!149 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!150 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!151 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!152 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!153 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!154 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!155 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!156 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!157 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!158 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!159 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!160 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!161 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!162 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!163 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!164 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!165 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!166 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!167 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!168 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!169 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!170 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!171 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!172 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!173 = !DIEnumerator(name: "MagickListOptions", value: 38)
!174 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!175 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!176 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!177 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!178 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!179 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!180 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!181 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!182 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!183 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!184 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!185 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!186 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!187 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!188 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!189 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!190 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!191 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!192 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!193 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!194 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!195 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!196 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!197 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!198 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!199 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!200 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!201 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!202 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!203 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!204 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!205 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !207, line: 25, baseType: !7, size: 32, elements: !208)
!207 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "7ccc9d0e9544cf426f040ba36e5bd04e")
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217}
!209 = !DIEnumerator(name: "UndefinedPath", value: 0)
!210 = !DIEnumerator(name: "MagickPath", value: 1)
!211 = !DIEnumerator(name: "RootPath", value: 2)
!212 = !DIEnumerator(name: "HeadPath", value: 3)
!213 = !DIEnumerator(name: "TailPath", value: 4)
!214 = !DIEnumerator(name: "BasePath", value: 5)
!215 = !DIEnumerator(name: "ExtensionPath", value: 6)
!216 = !DIEnumerator(name: "SubimagePath", value: 7)
!217 = !DIEnumerator(name: "CanonicalPath", value: 8)
!218 = !{!219, !250, !251, !253, !257, !229, !258, !227, !263, !225, !264, !265, !319, !320, !324, !325, !132, !328, !237, !235}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypeInfo", file: !6, line: 85, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TypeInfo", file: !6, line: 49, size: 1024, elements: !223)
!223 = !{!224, !228, !231, !232, !233, !234, !236, !238, !239, !240, !241, !242, !243, !244, !246, !248, !249}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !222, file: !6, line: 52, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !226, line: 46, baseType: !227)
!226 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!227 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !222, file: !6, line: 55, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !6, line: 56, baseType: !229, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !222, file: !6, line: 57, baseType: !229, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !222, file: !6, line: 58, baseType: !229, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !222, file: !6, line: 61, baseType: !235, size: 32, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleType", file: !6, line: 47, baseType: !5)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !222, file: !6, line: 64, baseType: !237, size: 32, offset: 352)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "StretchType", file: !6, line: 38, baseType: !14)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !222, file: !6, line: 67, baseType: !225, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !222, file: !6, line: 70, baseType: !229, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "foundry", scope: !222, file: !6, line: 71, baseType: !229, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !222, file: !6, line: 72, baseType: !229, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !222, file: !6, line: 73, baseType: !229, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs", scope: !222, file: !6, line: 74, baseType: !229, size: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !222, file: !6, line: 77, baseType: !245, size: 32, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !28, line: 215, baseType: !27)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !222, file: !6, line: 80, baseType: !247, size: 64, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !6, line: 81, baseType: !247, size: 64, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !222, file: !6, line: 84, baseType: !225, size: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !255, line: 26, baseType: !256)
!255 = !DIFile(filename: "apps/538.imagick_r/src/magick/splay-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9016e3627c0f26bd31d286f50189c16b")
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !255, line: 25, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !259, line: 77, baseType: !260)
!259 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !261, line: 193, baseType: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!262 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !267, line: 7, baseType: !268)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !269, line: 49, size: 1728, elements: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !286, !288, !289, !290, !292, !294, !296, !300, !303, !305, !308, !311, !312, !313, !314, !315}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !268, file: !269, line: 51, baseType: !132, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !268, file: !269, line: 54, baseType: !229, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !268, file: !269, line: 55, baseType: !229, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !268, file: !269, line: 56, baseType: !229, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !268, file: !269, line: 57, baseType: !229, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !268, file: !269, line: 58, baseType: !229, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !268, file: !269, line: 59, baseType: !229, size: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !268, file: !269, line: 60, baseType: !229, size: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !268, file: !269, line: 61, baseType: !229, size: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !268, file: !269, line: 64, baseType: !229, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !268, file: !269, line: 65, baseType: !229, size: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !268, file: !269, line: 66, baseType: !229, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !268, file: !269, line: 68, baseType: !284, size: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !269, line: 36, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !268, file: !269, line: 70, baseType: !287, size: 64, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !268, file: !269, line: 72, baseType: !132, size: 32, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !268, file: !269, line: 73, baseType: !132, size: 32, offset: 928)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !268, file: !269, line: 74, baseType: !291, size: 64, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !261, line: 152, baseType: !262)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !268, file: !269, line: 77, baseType: !293, size: 16, offset: 1024)
!293 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !268, file: !269, line: 78, baseType: !295, size: 8, offset: 1040)
!295 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !268, file: !269, line: 79, baseType: !297, size: 8, offset: 1048)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 8, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 1)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !268, file: !269, line: 81, baseType: !301, size: 64, offset: 1088)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !269, line: 43, baseType: null)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !268, file: !269, line: 89, baseType: !304, size: 64, offset: 1152)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !261, line: 153, baseType: !262)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !268, file: !269, line: 91, baseType: !306, size: 64, offset: 1216)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !269, line: 37, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !268, file: !269, line: 92, baseType: !309, size: 64, offset: 1280)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !269, line: 38, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !268, file: !269, line: 93, baseType: !287, size: 64, offset: 1344)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !268, file: !269, line: 94, baseType: !250, size: 64, offset: 1408)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !268, file: !269, line: 95, baseType: !225, size: 64, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !268, file: !269, line: 96, baseType: !132, size: 32, offset: 1536)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !268, file: !269, line: 98, baseType: !316, size: 160, offset: 1568)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 160, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 20)
!319 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !322, line: 26, baseType: !323)
!322 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !322, line: 25, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!250, !250}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !331, line: 40, baseType: !332)
!331 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !331, line: 29, size: 32960, elements: !333)
!333 = !{!334, !338, !341, !342}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !332, file: !331, line: 32, baseType: !335, size: 32768)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 32768, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 4096)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !332, file: !331, line: 35, baseType: !339, size: 64, offset: 32768)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !332, file: !331, line: 38, baseType: !225, size: 64, offset: 32832)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !332, file: !331, line: 39, baseType: !225, size: 64, offset: 32896)
!343 = !{!344, !0, !387, !389}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "fontmap", scope: !346, file: !347, line: 370, type: !378, isLocal: true, isDefinition: true)
!346 = distinct !DISubprogram(name: "GetTypeInfoByFamily", scope: !347, file: !347, line: 346, type: !348, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !366)
!347 = !DIFile(filename: "apps/538.imagick_r/src/magick/type.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3f5eb7e7cb071fcaa52e758f28cd7051")
!348 = !DISubroutineType(types: !349)
!349 = !{!219, !251, !350, !351, !352, !353}
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !28, line: 219, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !33, line: 102, size: 448, elements: !356)
!356 = !{!357, !359, !360, !361, !362, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !355, file: !33, line: 105, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !33, line: 100, baseType: !32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !355, file: !33, line: 108, baseType: !132, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !355, file: !33, line: 111, baseType: !229, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !355, file: !33, line: 112, baseType: !229, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !355, file: !33, line: 115, baseType: !250, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !355, file: !33, line: 118, baseType: !245, size: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !355, file: !33, line: 121, baseType: !320, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !355, file: !33, line: 124, baseType: !225, size: 64, offset: 384)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!367 = !DILocalVariable(name: "family", arg: 1, scope: !346, file: !347, line: 346, type: !251)
!368 = !DILocalVariable(name: "style", arg: 2, scope: !346, file: !347, line: 347, type: !350)
!369 = !DILocalVariable(name: "stretch", arg: 3, scope: !346, file: !347, line: 347, type: !351)
!370 = !DILocalVariable(name: "weight", arg: 4, scope: !346, file: !347, line: 347, type: !352)
!371 = !DILocalVariable(name: "exception", arg: 5, scope: !346, file: !347, line: 348, type: !353)
!372 = !DILocalVariable(name: "type_info", scope: !346, file: !347, line: 358, type: !219)
!373 = !DILocalVariable(name: "p", scope: !346, file: !347, line: 361, type: !219)
!374 = !DILocalVariable(name: "i", scope: !346, file: !347, line: 364, type: !258)
!375 = !DILocalVariable(name: "range", scope: !346, file: !347, line: 367, type: !258)
!376 = !DILocalVariable(name: "max_score", scope: !346, file: !347, line: 383, type: !225)
!377 = !DILocalVariable(name: "score", scope: !346, file: !347, line: 384, type: !225)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 1024, elements: !385)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "Fontmap", scope: !346, file: !347, line: 355, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Fontmap", scope: !346, file: !347, line: 350, size: 128, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !347, line: 353, baseType: !251, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "substitute", scope: !381, file: !347, line: 354, baseType: !251, size: 64, offset: 64)
!385 = !{!386}
!386 = !DISubrange(count: 8)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "type_cache", scope: !2, file: !347, line: 122, type: !253, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "TypeMap", scope: !2, file: !347, line: 108, type: !251, isLocal: true, isDefinition: true)
!391 = !{i32 7, !"Dwarf Version", i32 5}
!392 = !{i32 2, !"Debug Info Version", i32 3}
!393 = !{i32 1, !"wchar_size", i32 4}
!394 = !{i32 7, !"PIC Level", i32 2}
!395 = !{i32 7, !"PIE Level", i32 2}
!396 = !{i32 7, !"uwtable", i32 2}
!397 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!398 = distinct !DISubprogram(name: "GetTypeInfo", scope: !347, file: !347, line: 274, type: !399, scopeLine: 276, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!219, !251, !353}
!401 = !{!402, !403, !404}
!402 = !DILocalVariable(name: "name", arg: 1, scope: !398, file: !347, line: 274, type: !251)
!403 = !DILocalVariable(name: "exception", arg: 2, scope: !398, file: !347, line: 275, type: !353)
!404 = !DILocalVariable(name: "type_info", scope: !398, file: !347, line: 278, type: !219)
!405 = !DILocation(line: 0, scope: !398)
!406 = !DILocalVariable(name: "exception", arg: 1, scope: !407, file: !347, line: 903, type: !353)
!407 = distinct !DISubprogram(name: "IsTypeTreeInstantiated", scope: !347, file: !347, line: 903, type: !408, scopeLine: 904, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{!245, !353}
!410 = !{!406}
!411 = !DILocation(line: 0, scope: !407, inlinedAt: !412)
!412 = distinct !DILocation(line: 281, column: 7, scope: !413)
!413 = distinct !DILexicalBlock(scope: !398, file: !347, line: 281, column: 7)
!414 = !DILocation(line: 905, column: 7, scope: !415, inlinedAt: !412)
!415 = distinct !DILexicalBlock(scope: !407, file: !347, line: 905, column: 7)
!416 = !{!417, !417, i64 0}
!417 = !{!"any pointer", !418, i64 0}
!418 = !{!"omnipotent char", !419, i64 0}
!419 = !{!"Simple C/C++ TBAA"}
!420 = !DILocation(line: 905, column: 18, scope: !415, inlinedAt: !412)
!421 = !DILocation(line: 905, column: 7, scope: !407, inlinedAt: !412)
!422 = !DILocation(line: 907, column: 11, scope: !423, inlinedAt: !412)
!423 = distinct !DILexicalBlock(scope: !424, file: !347, line: 907, column: 11)
!424 = distinct !DILexicalBlock(scope: !415, file: !347, line: 906, column: 5)
!425 = !DILocation(line: 907, column: 26, scope: !423, inlinedAt: !412)
!426 = !DILocation(line: 907, column: 11, scope: !424, inlinedAt: !412)
!427 = !DILocation(line: 908, column: 9, scope: !423, inlinedAt: !412)
!428 = !DILocation(line: 909, column: 25, scope: !424, inlinedAt: !412)
!429 = !DILocation(line: 909, column: 7, scope: !424, inlinedAt: !412)
!430 = !DILocation(line: 910, column: 11, scope: !431, inlinedAt: !412)
!431 = distinct !DILexicalBlock(scope: !424, file: !347, line: 910, column: 11)
!432 = !DILocation(line: 910, column: 22, scope: !431, inlinedAt: !412)
!433 = !DILocation(line: 910, column: 11, scope: !424, inlinedAt: !412)
!434 = !DILocalVariable(name: "filename", arg: 1, scope: !435, file: !347, line: 186, type: !251)
!435 = distinct !DISubprogram(name: "AcquireTypeCache", scope: !347, file: !347, line: 186, type: !436, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !438)
!436 = !DISubroutineType(types: !437)
!437 = !{!253, !251, !353}
