; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/x264_src/x264.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/x264.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_input_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.option = type { ptr, i32, ptr, i32 }
%struct.cli_output_t = type { ptr, ptr, ptr, ptr, ptr }
%struct.x264_level_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cli_pulldown_t = type { i32, [24 x i8], float }
%struct.x264_picture_t = type { i32, i32, i32, i32, i64, i64, ptr, %struct.x264_image_t, %struct.x264_hrd_t, ptr }
%struct.x264_image_t = type { i32, i32, [4 x i32], [4 x ptr] }
%struct.x264_hrd_t = type { double, double, double, double }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "seek_val", scope: !2, file: !19, line: 45, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !16, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/x264.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "31ddb1a0de50b882c944461ce64730d6")
!4 = !{!5, !6, !7, !10, !11}
!5 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !12, line: 27, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !14, line: 44, baseType: !15)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!15 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!16 = !{!0, !17, !285, !287, !289, !293, !298, !303, !316, !318, !320, !325, !327, !332, !337, !342, !347, !349, !354, !388, !401}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "input", scope: !2, file: !19, line: 70, type: !20, isLocal: false, isDefinition: true)
!19 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "31ddb1a0de50b882c944461ce64730d6")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_t", file: !21, line: 63, baseType: !22)
!21 = !DIFile(filename: "apps/525.x264_r/src/x264_src/input/input.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f28c863d273681dfcaca9779e9fcbd53")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 54, size: 448, elements: !23)
!23 = !{!24, !59, !63, !272, !276, !280, !284}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !22, file: !21, line: 56, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!6, !8, !28, !31, !51}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !30, line: 30, baseType: !10)
!30 = !DIFile(filename: "apps/525.x264_r/src/x264_src/muxers.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bcea0820748b2dc47392b7f6393a96ff")
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_info_t", file: !21, line: 52, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 38, size: 384, elements: !34)
!34 = !{!35, !36, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "csp", scope: !33, file: !21, line: 40, baseType: !6, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fps_num", scope: !33, file: !21, line: 41, baseType: !37, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !38, line: 26, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !14, line: 42, baseType: !40)
!40 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "fps_den", scope: !33, file: !21, line: 42, baseType: !37, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !33, file: !21, line: 43, baseType: !6, size: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !33, file: !21, line: 44, baseType: !6, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !33, file: !21, line: 45, baseType: !37, size: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !33, file: !21, line: 46, baseType: !37, size: 32, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tff", scope: !33, file: !21, line: 47, baseType: !6, size: 32, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !33, file: !21, line: 48, baseType: !37, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !33, file: !21, line: 49, baseType: !37, size: 32, offset: 288)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vfr", scope: !33, file: !21, line: 50, baseType: !6, size: 32, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !33, file: !21, line: 51, baseType: !6, size: 32, offset: 352)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_opt_t", file: !21, line: 35, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 29, size: 256, elements: !54)
!54 = !{!55, !56, !57, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !53, file: !21, line: 31, baseType: !8, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !53, file: !21, line: 32, baseType: !8, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "timebase", scope: !53, file: !21, line: 33, baseType: !8, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !53, file: !21, line: 34, baseType: !6, size: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "get_frame_total", scope: !22, file: !21, line: 57, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!6, !29}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "picture_alloc", scope: !22, file: !21, line: 58, baseType: !64, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!6, !67, !6, !6, !6}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !69, line: 549, baseType: !70)
!69 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 513, size: 1088, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !250, !263, !271}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !70, file: !69, line: 521, baseType: !6, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !70, file: !69, line: 523, baseType: !6, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !70, file: !69, line: 526, baseType: !6, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !70, file: !69, line: 529, baseType: !6, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !70, file: !69, line: 531, baseType: !11, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !70, file: !69, line: 534, baseType: !11, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !70, file: !69, line: 541, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !69, line: 376, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !69, line: 176, size: 5632, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !131, !132, !133, !134, !138, !139, !153, !154, !155, !156, !157, !188, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !81, file: !69, line: 179, baseType: !40, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !81, file: !69, line: 180, baseType: !6, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !81, file: !69, line: 181, baseType: !6, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !81, file: !69, line: 182, baseType: !6, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !81, file: !69, line: 183, baseType: !6, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !81, file: !69, line: 186, baseType: !6, size: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !81, file: !69, line: 187, baseType: !6, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !81, file: !69, line: 188, baseType: !6, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !81, file: !69, line: 189, baseType: !6, size: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !81, file: !69, line: 190, baseType: !6, size: 32, offset: 288)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !81, file: !69, line: 198, baseType: !6, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !81, file: !69, line: 215, baseType: !95, size: 288, offset: 352)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !81, file: !69, line: 200, size: 288, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !95, file: !69, line: 203, baseType: !6, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !95, file: !69, line: 204, baseType: !6, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !95, file: !69, line: 206, baseType: !6, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !95, file: !69, line: 209, baseType: !6, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !95, file: !69, line: 210, baseType: !6, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !95, file: !69, line: 211, baseType: !6, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !95, file: !69, line: 212, baseType: !6, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !95, file: !69, line: 213, baseType: !6, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !95, file: !69, line: 214, baseType: !6, size: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !81, file: !69, line: 218, baseType: !6, size: 32, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !81, file: !69, line: 219, baseType: !6, size: 32, offset: 672)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !81, file: !69, line: 220, baseType: !6, size: 32, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !81, file: !69, line: 221, baseType: !6, size: 32, offset: 736)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !81, file: !69, line: 222, baseType: !6, size: 32, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !81, file: !69, line: 224, baseType: !6, size: 32, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !81, file: !69, line: 225, baseType: !6, size: 32, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !81, file: !69, line: 226, baseType: !6, size: 32, offset: 864)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !81, file: !69, line: 227, baseType: !6, size: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !81, file: !69, line: 229, baseType: !6, size: 32, offset: 928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !81, file: !69, line: 230, baseType: !6, size: 32, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !81, file: !69, line: 231, baseType: !6, size: 32, offset: 992)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !81, file: !69, line: 233, baseType: !6, size: 32, offset: 1024)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !81, file: !69, line: 234, baseType: !6, size: 32, offset: 1056)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !81, file: !69, line: 236, baseType: !6, size: 32, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !81, file: !69, line: 237, baseType: !6, size: 32, offset: 1120)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !81, file: !69, line: 239, baseType: !6, size: 32, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !81, file: !69, line: 240, baseType: !8, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !81, file: !69, line: 241, baseType: !125, size: 128, offset: 1280)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !129)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !38, line: 24, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !14, line: 38, baseType: !128)
!128 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!129 = !{!130}
!130 = !DISubrange(count: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !81, file: !69, line: 242, baseType: !125, size: 128, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !81, file: !69, line: 243, baseType: !125, size: 128, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !81, file: !69, line: 244, baseType: !125, size: 128, offset: 1664)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !81, file: !69, line: 245, baseType: !135, size: 512, offset: 1792)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !81, file: !69, line: 246, baseType: !135, size: 512, offset: 2304)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !81, file: !69, line: 249, baseType: !140, size: 64, offset: 2816)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !10, !6, !143, !145}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !147)
!147 = !{!148, !150, !151, !152}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !146, file: !149, line: 153, baseType: !40, size: 32)
!149 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !146, file: !149, line: 153, baseType: !40, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !146, file: !149, line: 153, baseType: !10, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !146, file: !149, line: 153, baseType: !10, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !81, file: !69, line: 250, baseType: !10, size: 64, offset: 2880)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !81, file: !69, line: 251, baseType: !6, size: 32, offset: 2944)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !81, file: !69, line: 252, baseType: !6, size: 32, offset: 2976)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !81, file: !69, line: 253, baseType: !8, size: 64, offset: 3008)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !81, file: !69, line: 287, baseType: !158, size: 800, offset: 3072)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !81, file: !69, line: 256, size: 800, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !180, !181, !182, !186, !187}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !158, file: !69, line: 258, baseType: !40, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !158, file: !69, line: 259, baseType: !40, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !158, file: !69, line: 261, baseType: !6, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !158, file: !69, line: 262, baseType: !6, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !158, file: !69, line: 263, baseType: !6, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !158, file: !69, line: 264, baseType: !6, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !158, file: !69, line: 265, baseType: !6, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !158, file: !69, line: 267, baseType: !6, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !158, file: !69, line: 268, baseType: !6, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !158, file: !69, line: 269, baseType: !6, size: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !158, file: !69, line: 270, baseType: !6, size: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !158, file: !69, line: 271, baseType: !6, size: 32, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !158, file: !69, line: 272, baseType: !6, size: 32, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !158, file: !69, line: 273, baseType: !6, size: 32, offset: 416)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !158, file: !69, line: 274, baseType: !6, size: 32, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !158, file: !69, line: 275, baseType: !6, size: 32, offset: 480)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !158, file: !69, line: 276, baseType: !6, size: 32, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !158, file: !69, line: 277, baseType: !6, size: 32, offset: 544)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !158, file: !69, line: 278, baseType: !179, size: 32, offset: 576)
!179 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !158, file: !69, line: 279, baseType: !179, size: 32, offset: 608)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !158, file: !69, line: 280, baseType: !6, size: 32, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !158, file: !69, line: 283, baseType: !183, size: 64, offset: 672)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !158, file: !69, line: 285, baseType: !6, size: 32, offset: 736)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !158, file: !69, line: 286, baseType: !6, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !81, file: !69, line: 327, baseType: !189, size: 1152, offset: 3904)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !81, file: !69, line: 290, size: 1152, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !228, !229}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !189, file: !69, line: 292, baseType: !6, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !189, file: !69, line: 294, baseType: !6, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !189, file: !69, line: 295, baseType: !6, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !189, file: !69, line: 296, baseType: !6, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !189, file: !69, line: 297, baseType: !6, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !189, file: !69, line: 299, baseType: !6, size: 32, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !189, file: !69, line: 300, baseType: !179, size: 32, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !189, file: !69, line: 301, baseType: !179, size: 32, offset: 224)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !189, file: !69, line: 302, baseType: !179, size: 32, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !189, file: !69, line: 303, baseType: !6, size: 32, offset: 288)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !189, file: !69, line: 304, baseType: !6, size: 32, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !189, file: !69, line: 305, baseType: !179, size: 32, offset: 352)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !189, file: !69, line: 306, baseType: !179, size: 32, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !189, file: !69, line: 307, baseType: !179, size: 32, offset: 416)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !189, file: !69, line: 309, baseType: !6, size: 32, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !189, file: !69, line: 310, baseType: !179, size: 32, offset: 480)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !189, file: !69, line: 311, baseType: !6, size: 32, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !189, file: !69, line: 312, baseType: !6, size: 32, offset: 544)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !189, file: !69, line: 315, baseType: !6, size: 32, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !189, file: !69, line: 316, baseType: !8, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !189, file: !69, line: 317, baseType: !6, size: 32, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !189, file: !69, line: 318, baseType: !8, size: 64, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !189, file: !69, line: 321, baseType: !179, size: 32, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !189, file: !69, line: 322, baseType: !179, size: 32, offset: 864)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !189, file: !69, line: 323, baseType: !179, size: 32, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !189, file: !69, line: 324, baseType: !217, size: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !69, line: 174, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 167, size: 256, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !219, file: !69, line: 169, baseType: !6, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !219, file: !69, line: 169, baseType: !6, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !219, file: !69, line: 170, baseType: !6, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !219, file: !69, line: 171, baseType: !6, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !219, file: !69, line: 172, baseType: !179, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !219, file: !69, line: 173, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !189, file: !69, line: 325, baseType: !6, size: 32, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !189, file: !69, line: 326, baseType: !8, size: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !81, file: !69, line: 330, baseType: !6, size: 32, offset: 5056)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !81, file: !69, line: 331, baseType: !6, size: 32, offset: 5088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !81, file: !69, line: 332, baseType: !6, size: 32, offset: 5120)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !81, file: !69, line: 334, baseType: !6, size: 32, offset: 5152)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !81, file: !69, line: 335, baseType: !6, size: 32, offset: 5184)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !81, file: !69, line: 336, baseType: !37, size: 32, offset: 5216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !81, file: !69, line: 337, baseType: !37, size: 32, offset: 5248)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !81, file: !69, line: 338, baseType: !37, size: 32, offset: 5280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !81, file: !69, line: 339, baseType: !37, size: 32, offset: 5312)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !81, file: !69, line: 340, baseType: !6, size: 32, offset: 5344)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !81, file: !69, line: 344, baseType: !6, size: 32, offset: 5376)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !81, file: !69, line: 356, baseType: !6, size: 32, offset: 5408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !81, file: !69, line: 364, baseType: !6, size: 32, offset: 5440)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !81, file: !69, line: 367, baseType: !6, size: 32, offset: 5472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !81, file: !69, line: 368, baseType: !6, size: 32, offset: 5504)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !81, file: !69, line: 369, baseType: !6, size: 32, offset: 5536)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !81, file: !69, line: 375, baseType: !247, size: 64, offset: 5568)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !10}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !70, file: !69, line: 543, baseType: !251, size: 448, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !69, line: 511, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 505, size: 448, elements: !253)
!253 = !{!254, !255, !256, !260}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !252, file: !69, line: 507, baseType: !6, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !252, file: !69, line: 508, baseType: !6, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !252, file: !69, line: 509, baseType: !257, size: 128, offset: 64)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 4)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !252, file: !69, line: 510, baseType: !261, size: 256, offset: 192)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 256, elements: !258)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !70, file: !69, line: 545, baseType: !264, size: 256, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !69, line: 503, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 496, size: 256, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !265, file: !69, line: 498, baseType: !5, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !265, file: !69, line: 499, baseType: !5, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !265, file: !69, line: 500, baseType: !5, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !265, file: !69, line: 502, baseType: !5, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !70, file: !69, line: 548, baseType: !10, size: 64, offset: 1024)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "read_frame", scope: !22, file: !21, line: 59, baseType: !273, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!6, !67, !29, !6}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "release_frame", scope: !22, file: !21, line: 60, baseType: !277, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!6, !67, !29}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "picture_clean", scope: !22, file: !21, line: 61, baseType: !281, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !67}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !22, file: !21, line: 62, baseType: !60, size: 64, offset: 384)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "b_exit_on_ctrl_c", scope: !2, file: !19, line: 50, type: !6, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "b_ctrl_c", scope: !2, file: !19, line: 49, type: !6, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "demuxer_names", scope: !2, file: !19, line: 73, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 256, elements: !258)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "muxer_names", scope: !2, file: !19, line: 90, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 320, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 5)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !19, line: 616, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 240, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 30)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !19, line: 617, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 36352, elements: !314)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !307, line: 93, size: 256, elements: !308)
!307 = !DIFile(filename: "apps/525.x264_r/src/x264_src/extras/getopt.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "82623bb5aeb34f6c33cfa9f633ed0dc8")
!308 = !{!309, !310, !311, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 96, baseType: !143, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !306, file: !307, line: 102, baseType: !6, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !306, file: !307, line: 103, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !306, file: !307, line: 104, baseType: !6, size: 32, offset: 192)
!314 = !{!315}
!315 = !DISubrange(count: 142)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "x264_b_pyramid_names", scope: !2, file: !69, line: 114, type: !291, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "x264_direct_pred_names", scope: !2, file: !69, line: 112, type: !295, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "x264_motion_est_names", scope: !2, file: !69, line: 113, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 384, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 6)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "x264_overscan_names", scope: !2, file: !69, line: 115, type: !291, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "x264_vidformat_names", scope: !2, file: !69, line: 116, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 448, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 7)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "x264_fullrange_names", scope: !2, file: !69, line: 117, type: !334, isLocal: true, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 192, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 3)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "x264_colorprim_names", scope: !2, file: !69, line: 118, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 640, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 10)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "x264_transfer_names", scope: !2, file: !69, line: 119, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 768, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 12)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "x264_colmatrix_names", scope: !2, file: !69, line: 120, type: !339, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "pulldown_names", scope: !2, file: !19, line: 102, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 512, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 8)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "output", scope: !2, file: !19, line: 71, type: !356, isLocal: true, isDefinition: true)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_output_t", file: !357, line: 34, baseType: !358)
!357 = !DIFile(filename: "apps/525.x264_r/src/x264_src/output/output.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2609bd03b72b40b15579de35b2e5f690")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 27, size: 320, elements: !359)
!359 = !{!360, !364, !368, !380, !384}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !358, file: !357, line: 29, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!6, !8, !28}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "set_param", scope: !358, file: !357, line: 30, baseType: !365, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!6, !29, !79}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "write_headers", scope: !358, file: !357, line: 31, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!6, !29, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !69, line: 604, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 593, size: 192, elements: !375)
!375 = !{!376, !377, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !374, file: !69, line: 595, baseType: !6, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !374, file: !69, line: 596, baseType: !6, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !374, file: !69, line: 599, baseType: !6, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !374, file: !69, line: 603, baseType: !262, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame", scope: !358, file: !357, line: 32, baseType: !381, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!6, !29, !262, !6, !67}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !358, file: !357, line: 33, baseType: !385, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!6, !29, !11, !11}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "pulldown_values", scope: !2, file: !19, line: 125, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 1792, elements: !330)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_pulldown_t", file: !19, line: 108, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 104, size: 256, elements: !394)
!394 = !{!395, !396, !400}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !393, file: !19, line: 105, baseType: !6, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !393, file: !19, line: 106, baseType: !397, size: 192, offset: 32)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 192, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 24)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fps_factor", scope: !393, file: !19, line: 107, baseType: !179, size: 32, offset: 224)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "pulldown_frame_duration", scope: !2, file: !19, line: 142, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 320, elements: !340)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!405 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!406 = !{i32 7, !"Dwarf Version", i32 5}
!407 = !{i32 2, !"Debug Info Version", i32 3}
!408 = !{i32 1, !"wchar_size", i32 4}
!409 = !{i32 7, !"PIC Level", i32 2}
!410 = !{i32 7, !"PIE Level", i32 2}
!411 = !{i32 7, !"uwtable", i32 2}
!412 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!413 = distinct !DISubprogram(name: "main", scope: !19, file: !19, line: 151, type: !414, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !416)
!414 = !DISubroutineType(types: !415)
!415 = !{!6, !6, !7}
!416 = !{!417, !418, !419, !420, !489}
!417 = !DILocalVariable(name: "argc", arg: 1, scope: !413, file: !19, line: 151, type: !6)
!418 = !DILocalVariable(name: "argv", arg: 2, scope: !413, file: !19, line: 151, type: !7)
!419 = !DILocalVariable(name: "param", scope: !413, file: !19, line: 153, type: !80)
!420 = !DILocalVariable(name: "opt", scope: !413, file: !19, line: 154, type: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_opt_t", file: !19, line: 67, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 58, size: 448, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !486, !487, !488}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_progress", scope: !422, file: !19, line: 59, baseType: !6, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_seek", scope: !422, file: !19, line: 60, baseType: !6, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "hin", scope: !422, file: !19, line: 61, baseType: !29, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "hout", scope: !422, file: !19, line: 62, baseType: !29, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "qpfile", scope: !422, file: !19, line: 63, baseType: !429, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !431, line: 7, baseType: !432)
!431 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !433, line: 49, size: 1728, elements: !434)
!433 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !450, !452, !453, !454, !456, !458, !460, !464, !467, !469, !472, !475, !476, !477, !481, !482}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !432, file: !433, line: 51, baseType: !6, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !432, file: !433, line: 54, baseType: !8, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !432, file: !433, line: 55, baseType: !8, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !432, file: !433, line: 56, baseType: !8, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !432, file: !433, line: 57, baseType: !8, size: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !432, file: !433, line: 58, baseType: !8, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !432, file: !433, line: 59, baseType: !8, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !432, file: !433, line: 60, baseType: !8, size: 64, offset: 448)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !432, file: !433, line: 61, baseType: !8, size: 64, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !432, file: !433, line: 64, baseType: !8, size: 64, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !432, file: !433, line: 65, baseType: !8, size: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !432, file: !433, line: 66, baseType: !8, size: 64, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !432, file: !433, line: 68, baseType: !448, size: 64, offset: 768)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !433, line: 36, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !432, file: !433, line: 70, baseType: !451, size: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !432, file: !433, line: 72, baseType: !6, size: 32, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !432, file: !433, line: 73, baseType: !6, size: 32, offset: 928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !432, file: !433, line: 74, baseType: !455, size: 64, offset: 960)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !14, line: 152, baseType: !15)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !432, file: !433, line: 77, baseType: !457, size: 16, offset: 1024)
!457 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !432, file: !433, line: 78, baseType: !459, size: 8, offset: 1040)
!459 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !432, file: !433, line: 79, baseType: !461, size: 8, offset: 1048)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 1)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !432, file: !433, line: 81, baseType: !465, size: 64, offset: 1088)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !433, line: 43, baseType: null)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !432, file: !433, line: 89, baseType: !468, size: 64, offset: 1152)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !14, line: 153, baseType: !15)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !432, file: !433, line: 91, baseType: !470, size: 64, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !433, line: 37, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !432, file: !433, line: 92, baseType: !473, size: 64, offset: 1280)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !433, line: 38, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !432, file: !433, line: 93, baseType: !451, size: 64, offset: 1344)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !432, file: !433, line: 94, baseType: !10, size: 64, offset: 1408)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !432, file: !433, line: 95, baseType: !478, size: 64, offset: 1472)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !479, line: 46, baseType: !480)
!479 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!480 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !432, file: !433, line: 96, baseType: !6, size: 32, offset: 1536)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !432, file: !433, line: 98, baseType: !483, size: 160, offset: 1568)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 20)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tcfile_out", scope: !422, file: !19, line: 64, baseType: !429, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_convert_multiplier", scope: !422, file: !19, line: 65, baseType: !5, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_pulldown", scope: !422, file: !19, line: 66, baseType: !6, size: 32, offset: 384)
!489 = !DILocalVariable(name: "ret", scope: !413, file: !19, line: 155, type: !6)
!490 = !DILocation(line: 0, scope: !413)
!491 = !DILocation(line: 153, column: 5, scope: !413)
!492 = !DILocation(line: 153, column: 18, scope: !413)
!493 = !DILocation(line: 154, column: 5, scope: !413)
!494 = !DILocation(line: 154, column: 15, scope: !413)
!495 = !DILocation(line: 0, scope: !496, inlinedAt: !555)
!496 = distinct !DISubprogram(name: "Parse", scope: !19, file: !19, line: 910, type: !497, scopeLine: 911, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !500)
!497 = !DISubroutineType(types: !498)
!498 = !{!6, !6, !7, !79, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !524, !528, !529, !530, !536, !539, !540, !542, !547, !548, !549, !552, !554}
!501 = !DILocalVariable(name: "argc", arg: 1, scope: !496, file: !19, line: 910, type: !6)
!502 = !DILocalVariable(name: "argv", arg: 2, scope: !496, file: !19, line: 910, type: !7)
!503 = !DILocalVariable(name: "param", arg: 3, scope: !496, file: !19, line: 910, type: !79)
!504 = !DILocalVariable(name: "opt", arg: 4, scope: !496, file: !19, line: 910, type: !499)
!505 = !DILocalVariable(name: "input_filename", scope: !496, file: !19, line: 912, type: !8)
!506 = !DILocalVariable(name: "demuxer", scope: !496, file: !19, line: 913, type: !143)
!507 = !DILocalVariable(name: "output_filename", scope: !496, file: !19, line: 914, type: !8)
!508 = !DILocalVariable(name: "muxer", scope: !496, file: !19, line: 915, type: !143)
!509 = !DILocalVariable(name: "tcfile_name", scope: !496, file: !19, line: 916, type: !8)
!510 = !DILocalVariable(name: "defaults", scope: !496, file: !19, line: 917, type: !80)
!511 = !DILocalVariable(name: "profile", scope: !496, file: !19, line: 918, type: !8)
!512 = !DILocalVariable(name: "b_thread_input", scope: !496, file: !19, line: 919, type: !6)
!513 = !DILocalVariable(name: "b_turbo", scope: !496, file: !19, line: 920, type: !6)
!514 = !DILocalVariable(name: "b_user_ref", scope: !496, file: !19, line: 921, type: !6)
!515 = !DILocalVariable(name: "b_user_fps", scope: !496, file: !19, line: 922, type: !6)
!516 = !DILocalVariable(name: "b_user_interlaced", scope: !496, file: !19, line: 923, type: !6)
!517 = !DILocalVariable(name: "input_opt", scope: !496, file: !19, line: 924, type: !52)
!518 = !DILocalVariable(name: "preset", scope: !496, file: !19, line: 925, type: !8)
!519 = !DILocalVariable(name: "tune", scope: !496, file: !19, line: 926, type: !8)
!520 = !DILocalVariable(name: "c", scope: !521, file: !19, line: 940, type: !6)
!521 = distinct !DILexicalBlock(scope: !522, file: !19, line: 939, column: 5)
!522 = distinct !DILexicalBlock(scope: !523, file: !19, line: 938, column: 5)
!523 = distinct !DILexicalBlock(scope: !496, file: !19, line: 938, column: 5)
!524 = !DILocalVariable(name: "b_error", scope: !525, file: !19, line: 959, type: !6)
!525 = distinct !DILexicalBlock(scope: !526, file: !19, line: 958, column: 5)
!526 = distinct !DILexicalBlock(scope: !527, file: !19, line: 957, column: 5)
!527 = distinct !DILexicalBlock(scope: !496, file: !19, line: 957, column: 5)
!528 = !DILocalVariable(name: "long_options_index", scope: !525, file: !19, line: 960, type: !6)
!529 = !DILocalVariable(name: "c", scope: !525, file: !19, line: 962, type: !6)
!530 = !DILocalVariable(name: "i", scope: !531, file: !19, line: 1099, type: !6)
!531 = distinct !DILexicalBlock(scope: !532, file: !19, line: 1099, column: 21)
!532 = distinct !DILexicalBlock(scope: !533, file: !19, line: 1098, column: 17)
!533 = distinct !DILexicalBlock(scope: !534, file: !19, line: 1097, column: 21)
!534 = distinct !DILexicalBlock(scope: !535, file: !19, line: 1096, column: 13)
!535 = distinct !DILexicalBlock(scope: !525, file: !19, line: 970, column: 9)
!536 = !DILocalVariable(name: "name", scope: !537, file: !19, line: 1118, type: !143)
!537 = distinct !DILexicalBlock(scope: !538, file: !19, line: 1117, column: 9)
!538 = distinct !DILexicalBlock(scope: !525, file: !19, line: 1116, column: 13)
!539 = !DILocalVariable(name: "info", scope: !496, file: !19, line: 1150, type: !32)
!540 = !DILocalVariable(name: "demuxername", scope: !496, file: !19, line: 1151, type: !541)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 40, elements: !296)
!542 = !DILocalVariable(name: "i_user_timebase_num", scope: !543, file: !19, line: 1230, type: !545)
!543 = distinct !DILexicalBlock(scope: !544, file: !19, line: 1229, column: 5)
!544 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1228, column: 9)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !38, line: 27, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !14, line: 45, baseType: !480)
!547 = !DILocalVariable(name: "i_user_timebase_den", scope: !543, file: !19, line: 1231, type: !545)
!548 = !DILocalVariable(name: "ret", scope: !543, file: !19, line: 1232, type: !6)
!549 = !DILocalVariable(name: "mbs", scope: !550, file: !19, line: 1279, type: !6)
!550 = distinct !DILexicalBlock(scope: !551, file: !19, line: 1278, column: 5)
!551 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1277, column: 9)
!552 = !DILocalVariable(name: "i", scope: !553, file: !19, line: 1280, type: !6)
!553 = distinct !DILexicalBlock(scope: !550, file: !19, line: 1280, column: 9)
!554 = !DILabel(scope: !535, name: "generic_option", file: !19, line: 1095)
!555 = distinct !DILocation(line: 168, column: 9, scope: !556)
!556 = distinct !DILexicalBlock(scope: !413, file: !19, line: 168, column: 9)
!557 = !DILocation(line: 917, column: 5, scope: !496, inlinedAt: !555)
!558 = !DILocation(line: 917, column: 18, scope: !496, inlinedAt: !555)
!559 = !DILocation(line: 924, column: 5, scope: !496, inlinedAt: !555)
!560 = !DILocation(line: 924, column: 21, scope: !496, inlinedAt: !555)
!561 = !DILocation(line: 931, column: 5, scope: !496, inlinedAt: !555)
!562 = !DILocation(line: 933, column: 5, scope: !496, inlinedAt: !555)
!563 = !DILocation(line: 934, column: 5, scope: !496, inlinedAt: !555)
!564 = !DILocation(line: 935, column: 21, scope: !496, inlinedAt: !555)
!565 = !{!566, !567, i64 0}
!566 = !{!"", !567, i64 0, !567, i64 4, !570, i64 8, !570, i64 16, !570, i64 24, !570, i64 32, !571, i64 40, !567, i64 48}
!567 = !{!"int", !568, i64 0}
!568 = !{!"omnipotent char", !569, i64 0}
!569 = !{!"Simple C/C++ TBAA"}
!570 = !{!"any pointer", !568, i64 0}
!571 = !{!"double", !568, i64 0}
!572 = !DILocation(line: 938, column: 17, scope: !523, inlinedAt: !555)
!573 = !{!567, !567, i64 0}
!574 = !DILocation(line: 938, column: 10, scope: !523, inlinedAt: !555)
!575 = !DILocation(line: 941, column: 13, scope: !521, inlinedAt: !555)
!576 = !DILocation(line: 940, column: 17, scope: !521, inlinedAt: !555)
!577 = !DILocation(line: 0, scope: !521, inlinedAt: !555)
!578 = !DILocation(line: 943, column: 22, scope: !579, inlinedAt: !555)
!579 = distinct !DILexicalBlock(scope: !521, file: !19, line: 942, column: 13)
!580 = !{!570, !570, i64 0}
!581 = !DILocation(line: 944, column: 13, scope: !521, inlinedAt: !555)
!582 = !DILocation(line: 945, column: 20, scope: !583, inlinedAt: !555)
!583 = distinct !DILexicalBlock(scope: !521, file: !19, line: 944, column: 13)
!584 = !DILocation(line: 945, column: 13, scope: !583, inlinedAt: !555)
!585 = !DILocation(line: 950, column: 9, scope: !586, inlinedAt: !555)
!586 = distinct !DILexicalBlock(scope: !496, file: !19, line: 950, column: 9)
!587 = !DILocation(line: 950, column: 16, scope: !586, inlinedAt: !555)
!588 = !DILocation(line: 950, column: 20, scope: !586, inlinedAt: !555)
!589 = !DILocation(line: 950, column: 9, scope: !496, inlinedAt: !555)
!590 = !DILocation(line: 953, column: 9, scope: !591, inlinedAt: !555)
!591 = distinct !DILexicalBlock(scope: !496, file: !19, line: 953, column: 9)
!592 = !DILocation(line: 953, column: 58, scope: !591, inlinedAt: !555)
!593 = !DILocation(line: 953, column: 9, scope: !496, inlinedAt: !555)
!594 = !DILocation(line: 957, column: 17, scope: !527, inlinedAt: !555)
!595 = !DILocation(line: 957, column: 10, scope: !527, inlinedAt: !555)
!596 = !DILocation(line: 913, column: 17, scope: !496, inlinedAt: !555)
!597 = !DILocation(line: 915, column: 17, scope: !496, inlinedAt: !555)
!598 = !DILocation(line: 920, column: 9, scope: !496, inlinedAt: !555)
!599 = !DILocation(line: 921, column: 9, scope: !496, inlinedAt: !555)
!600 = !DILocation(line: 922, column: 9, scope: !496, inlinedAt: !555)
!601 = !DILocation(line: 923, column: 9, scope: !496, inlinedAt: !555)
!602 = !DILocation(line: 918, column: 11, scope: !496, inlinedAt: !555)
!603 = !DILocation(line: 916, column: 11, scope: !496, inlinedAt: !555)
!604 = !DILocation(line: 914, column: 11, scope: !496, inlinedAt: !555)
!605 = !DILocation(line: 0, scope: !525, inlinedAt: !555)
!606 = !DILocation(line: 960, column: 9, scope: !525, inlinedAt: !555)
!607 = !DILocation(line: 960, column: 13, scope: !525, inlinedAt: !555)
!608 = !DILocation(line: 962, column: 17, scope: !525, inlinedAt: !555)
!609 = !DILocation(line: 964, column: 13, scope: !525, inlinedAt: !555)
!610 = !DILocation(line: 972, column: 17, scope: !535, inlinedAt: !555)
!611 = !DILocation(line: 973, column: 17, scope: !535, inlinedAt: !555)
!612 = !DILocation(line: 975, column: 17, scope: !535, inlinedAt: !555)
!613 = !DILocation(line: 976, column: 17, scope: !535, inlinedAt: !555)
!614 = !DILocation(line: 978, column: 17, scope: !535, inlinedAt: !555)
!615 = !DILocation(line: 979, column: 17, scope: !535, inlinedAt: !555)
!616 = !DILocation(line: 982, column: 17, scope: !535, inlinedAt: !555)
!617 = !DILocation(line: 994, column: 17, scope: !535, inlinedAt: !555)
!618 = !DILocation(line: 997, column: 33, scope: !535, inlinedAt: !555)
!619 = !DILocalVariable(name: "__nptr", arg: 1, scope: !620, file: !621, line: 361, type: !143)
!620 = distinct !DISubprogram(name: "atoi", scope: !621, file: !621, line: 361, type: !622, scopeLine: 362, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !624)
!621 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!622 = !DISubroutineType(types: !623)
!623 = !{!6, !143}
!624 = !{!619}
!625 = !DILocation(line: 0, scope: !620, inlinedAt: !626)
!626 = distinct !DILocation(line: 997, column: 33, scope: !535, inlinedAt: !555)
!627 = !DILocation(line: 363, column: 16, scope: !620, inlinedAt: !626)
!628 = !DILocation(line: 363, column: 10, scope: !620, inlinedAt: !626)
!629 = !DILocation(line: 997, column: 31, scope: !535, inlinedAt: !555)
!630 = !DILocation(line: 998, column: 17, scope: !535, inlinedAt: !555)
!631 = !DILocation(line: 1001, column: 40, scope: !535, inlinedAt: !555)
!632 = !DILocation(line: 0, scope: !620, inlinedAt: !633)
!633 = distinct !DILocation(line: 1001, column: 40, scope: !535, inlinedAt: !555)
!634 = !DILocation(line: 363, column: 16, scope: !620, inlinedAt: !633)
!635 = !DILocation(line: 363, column: 10, scope: !620, inlinedAt: !633)
!636 = !DILocation(line: 1001, column: 38, scope: !535, inlinedAt: !555)
!637 = !{!638, !567, i64 36}
!638 = !{!"x264_param_t", !567, i64 0, !567, i64 4, !567, i64 8, !567, i64 12, !567, i64 16, !567, i64 20, !567, i64 24, !567, i64 28, !567, i64 32, !567, i64 36, !567, i64 40, !639, i64 44, !567, i64 80, !567, i64 84, !567, i64 88, !567, i64 92, !567, i64 96, !567, i64 100, !567, i64 104, !567, i64 108, !567, i64 112, !567, i64 116, !567, i64 120, !567, i64 124, !567, i64 128, !567, i64 132, !567, i64 136, !567, i64 140, !567, i64 144, !570, i64 152, !568, i64 160, !568, i64 176, !568, i64 192, !568, i64 208, !568, i64 224, !568, i64 288, !570, i64 352, !570, i64 360, !567, i64 368, !567, i64 372, !570, i64 376, !640, i64 384, !642, i64 488, !567, i64 632, !567, i64 636, !567, i64 640, !567, i64 644, !567, i64 648, !567, i64 652, !567, i64 656, !567, i64 660, !567, i64 664, !567, i64 668, !567, i64 672, !567, i64 676, !567, i64 680, !567, i64 684, !567, i64 688, !567, i64 692, !570, i64 696}
!639 = !{!"", !567, i64 0, !567, i64 4, !567, i64 8, !567, i64 12, !567, i64 16, !567, i64 20, !567, i64 24, !567, i64 28, !567, i64 32}
!640 = !{!"", !567, i64 0, !567, i64 4, !567, i64 8, !567, i64 12, !567, i64 16, !567, i64 20, !567, i64 24, !567, i64 28, !567, i64 32, !567, i64 36, !567, i64 40, !567, i64 44, !567, i64 48, !567, i64 52, !567, i64 56, !567, i64 60, !567, i64 64, !567, i64 68, !641, i64 72, !641, i64 76, !567, i64 80, !568, i64 84, !567, i64 92, !567, i64 96}
!641 = !{!"float", !568, i64 0}
!642 = !{!"", !567, i64 0, !567, i64 4, !567, i64 8, !567, i64 12, !567, i64 16, !567, i64 20, !641, i64 24, !641, i64 28, !641, i64 32, !567, i64 36, !567, i64 40, !641, i64 44, !641, i64 48, !641, i64 52, !567, i64 56, !641, i64 60, !567, i64 64, !567, i64 68, !567, i64 72, !570, i64 80, !567, i64 88, !570, i64 96, !641, i64 104, !641, i64 108, !641, i64 112, !570, i64 120, !567, i64 128, !570, i64 136}
!643 = !DILocation(line: 1002, column: 17, scope: !535, inlinedAt: !555)
!644 = !DILocation(line: 1004, column: 48, scope: !535, inlinedAt: !555)
!645 = !DILocation(line: 0, scope: !620, inlinedAt: !646)
!646 = distinct !DILocation(line: 1004, column: 48, scope: !535, inlinedAt: !555)
!647 = !DILocation(line: 363, column: 16, scope: !620, inlinedAt: !646)
!648 = !DILocation(line: 363, column: 10, scope: !620, inlinedAt: !646)
!649 = !DILocation(line: 1004, column: 46, scope: !535, inlinedAt: !555)
!650 = !{!651, !567, i64 24}
!651 = !{!"", !570, i64 0, !570, i64 8, !570, i64 16, !567, i64 24}
!652 = !DILocation(line: 1004, column: 29, scope: !535, inlinedAt: !555)
!653 = !{!566, !567, i64 4}
!654 = !DILocation(line: 1006, column: 19, scope: !535, inlinedAt: !555)
!655 = !DILocation(line: 1008, column: 17, scope: !535, inlinedAt: !555)
!656 = !DILocation(line: 1010, column: 35, scope: !535, inlinedAt: !555)
!657 = !DILocation(line: 1011, column: 17, scope: !535, inlinedAt: !555)
!658 = !DILocation(line: 1013, column: 38, scope: !659, inlinedAt: !555)
!659 = distinct !DILexicalBlock(scope: !535, file: !19, line: 1013, column: 21)
!660 = !DILocalVariable(name: "arg", arg: 1, scope: !661, file: !19, line: 885, type: !143)
!661 = distinct !DISubprogram(name: "parse_enum_name", scope: !19, file: !19, line: 885, type: !662, scopeLine: 886, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !666)
!662 = !DISubroutineType(types: !663)
!663 = !{!6, !143, !664, !665}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!666 = !{!660, !667, !668, !669}
!667 = !DILocalVariable(name: "names", arg: 2, scope: !661, file: !19, line: 885, type: !664)
!668 = !DILocalVariable(name: "dst", arg: 3, scope: !661, file: !19, line: 885, type: !665)
!669 = !DILocalVariable(name: "i", scope: !670, file: !19, line: 887, type: !6)
!670 = distinct !DILexicalBlock(scope: !661, file: !19, line: 887, column: 5)
!671 = !DILocation(line: 0, scope: !661, inlinedAt: !672)
!672 = distinct !DILocation(line: 1013, column: 21, scope: !659, inlinedAt: !555)
!673 = !DILocation(line: 0, scope: !670, inlinedAt: !672)
!674 = !DILocation(line: 887, column: 32, scope: !675, inlinedAt: !672)
!675 = distinct !DILexicalBlock(scope: !670, file: !19, line: 887, column: 5)
!676 = !DILocation(line: 887, column: 21, scope: !675, inlinedAt: !672)
!677 = !DILocation(line: 887, column: 5, scope: !670, inlinedAt: !672)
!678 = distinct !{!678, !677, !679, !680, !681}
!679 = !DILocation(line: 892, column: 9, scope: !670, inlinedAt: !672)
!680 = !{!"llvm.loop.mustprogress"}
!681 = !{!"llvm.loop.unroll.disable"}
!682 = !DILocation(line: 888, column: 14, scope: !683, inlinedAt: !672)
!683 = distinct !DILexicalBlock(scope: !675, file: !19, line: 888, column: 13)
!684 = !DILocation(line: 888, column: 13, scope: !675, inlinedAt: !672)
!685 = !DILocation(line: 1017, column: 38, scope: !686, inlinedAt: !555)
!686 = distinct !DILexicalBlock(scope: !535, file: !19, line: 1017, column: 21)
!687 = !DILocation(line: 0, scope: !661, inlinedAt: !688)
!688 = distinct !DILocation(line: 1017, column: 21, scope: !686, inlinedAt: !555)
!689 = !DILocation(line: 0, scope: !670, inlinedAt: !688)
!690 = !DILocation(line: 887, column: 32, scope: !675, inlinedAt: !688)
!691 = !DILocation(line: 887, column: 21, scope: !675, inlinedAt: !688)
!692 = !DILocation(line: 887, column: 5, scope: !670, inlinedAt: !688)
!693 = distinct !{!693, !692, !694, !680, !681}
!694 = !DILocation(line: 892, column: 9, scope: !670, inlinedAt: !688)
!695 = !DILocation(line: 888, column: 14, scope: !683, inlinedAt: !688)
!696 = !DILocation(line: 888, column: 13, scope: !675, inlinedAt: !688)
!697 = !DILocation(line: 1021, column: 35, scope: !535, inlinedAt: !555)
!698 = !DILocation(line: 1021, column: 33, scope: !535, inlinedAt: !555)
!699 = !{!651, !570, i64 0}
!700 = !DILocation(line: 1022, column: 17, scope: !535, inlinedAt: !555)
!701 = !DILocation(line: 1024, column: 38, scope: !535, inlinedAt: !555)
!702 = !DILocation(line: 1024, column: 31, scope: !535, inlinedAt: !555)
!703 = !DILocation(line: 1024, column: 29, scope: !535, inlinedAt: !555)
!704 = !{!566, !570, i64 24}
!705 = !DILocation(line: 1025, column: 22, scope: !706, inlinedAt: !555)
!706 = distinct !DILexicalBlock(scope: !535, file: !19, line: 1025, column: 21)
!707 = !DILocation(line: 1025, column: 21, scope: !535, inlinedAt: !555)
!708 = !DILocation(line: 1027, column: 30, scope: !709, inlinedAt: !555)
!709 = distinct !DILexicalBlock(scope: !706, file: !19, line: 1026, column: 17)
!710 = !DILocation(line: 1027, column: 80, scope: !709, inlinedAt: !555)
!711 = !DILocation(line: 1027, column: 21, scope: !709, inlinedAt: !555)
!712 = !DILocation(line: 1028, column: 21, scope: !709, inlinedAt: !555)
!713 = !DILocation(line: 1041, column: 36, scope: !535, inlinedAt: !555)
!714 = !{!638, !567, i64 368}
!715 = !DILocation(line: 1042, column: 17, scope: !535, inlinedAt: !555)
!716 = !DILocation(line: 1044, column: 36, scope: !535, inlinedAt: !555)
!717 = !DILocation(line: 1045, column: 17, scope: !535, inlinedAt: !555)
!718 = !DILocation(line: 1047, column: 33, scope: !535, inlinedAt: !555)
!719 = !DILocation(line: 1048, column: 17, scope: !535, inlinedAt: !555)
!720 = !DILocation(line: 1054, column: 26, scope: !535, inlinedAt: !555)
!721 = !DILocation(line: 1054, column: 17, scope: !535, inlinedAt: !555)
!722 = !DILocation(line: 1056, column: 17, scope: !535, inlinedAt: !555)
!723 = !DILocation(line: 1061, column: 27, scope: !535, inlinedAt: !555)
!724 = !DILocation(line: 1062, column: 17, scope: !535, inlinedAt: !555)
!725 = !DILocation(line: 1065, column: 17, scope: !535, inlinedAt: !555)
!726 = !DILocation(line: 1068, column: 17, scope: !535, inlinedAt: !555)
!727 = !DILocation(line: 1071, column: 36, scope: !535, inlinedAt: !555)
!728 = !{!638, !567, i64 648}
!729 = !DILocation(line: 1072, column: 17, scope: !535, inlinedAt: !555)
!730 = !DILocation(line: 1075, column: 17, scope: !535, inlinedAt: !555)
!731 = !DILocation(line: 1077, column: 31, scope: !535, inlinedAt: !555)
!732 = !DILocation(line: 1078, column: 17, scope: !535, inlinedAt: !555)
!733 = !DILocation(line: 1080, column: 42, scope: !535, inlinedAt: !555)
!734 = !DILocation(line: 1080, column: 35, scope: !535, inlinedAt: !555)
!735 = !DILocation(line: 1080, column: 33, scope: !535, inlinedAt: !555)
!736 = !{!566, !570, i64 32}
!737 = !DILocation(line: 1081, column: 22, scope: !738, inlinedAt: !555)
!738 = distinct !DILexicalBlock(scope: !535, file: !19, line: 1081, column: 21)
!739 = !DILocation(line: 1081, column: 21, scope: !535, inlinedAt: !555)
!740 = !DILocation(line: 1083, column: 30, scope: !741, inlinedAt: !555)
!741 = distinct !DILexicalBlock(scope: !738, file: !19, line: 1082, column: 17)
!742 = !DILocation(line: 1083, column: 73, scope: !741, inlinedAt: !555)
!743 = !DILocation(line: 1083, column: 21, scope: !741, inlinedAt: !555)
!744 = !DILocation(line: 1084, column: 21, scope: !741, inlinedAt: !555)
!745 = !DILocation(line: 1088, column: 38, scope: !535, inlinedAt: !555)
!746 = !DILocation(line: 1088, column: 36, scope: !535, inlinedAt: !555)
!747 = !{!651, !570, i64 16}
!748 = !DILocation(line: 1089, column: 17, scope: !535, inlinedAt: !555)
!749 = !DILocation(line: 1091, column: 39, scope: !750, inlinedAt: !555)
!750 = distinct !DILexicalBlock(scope: !535, file: !19, line: 1091, column: 21)
!751 = !DILocalVariable(name: "arg", arg: 1, scope: !752, file: !19, line: 896, type: !143)
!752 = distinct !DISubprogram(name: "parse_enum_value", scope: !19, file: !19, line: 896, type: !753, scopeLine: 897, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !755)
!753 = !DISubroutineType(types: !754)
!754 = !{!6, !143, !664, !312}
!755 = !{!751, !756, !757, !758}
!756 = !DILocalVariable(name: "names", arg: 2, scope: !752, file: !19, line: 896, type: !664)
!757 = !DILocalVariable(name: "dst", arg: 3, scope: !752, file: !19, line: 896, type: !312)
!758 = !DILocalVariable(name: "i", scope: !759, file: !19, line: 898, type: !6)
!759 = distinct !DILexicalBlock(scope: !752, file: !19, line: 898, column: 5)
!760 = !DILocation(line: 0, scope: !752, inlinedAt: !761)
!761 = distinct !DILocation(line: 1091, column: 21, scope: !750, inlinedAt: !555)
!762 = !DILocation(line: 0, scope: !759, inlinedAt: !761)
!763 = !DILocation(line: 899, column: 14, scope: !764, inlinedAt: !761)
!764 = distinct !DILexicalBlock(scope: !765, file: !19, line: 899, column: 13)
!765 = distinct !DILexicalBlock(scope: !759, file: !19, line: 898, column: 5)
!766 = !DILocation(line: 899, column: 13, scope: !765, inlinedAt: !761)
!767 = distinct !{!767, !768, !769, !680, !681}
!768 = !DILocation(line: 898, column: 5, scope: !759, inlinedAt: !761)
!769 = !DILocation(line: 903, column: 9, scope: !759, inlinedAt: !761)
!770 = !DILocation(line: 901, column: 18, scope: !771, inlinedAt: !761)
!771 = distinct !DILexicalBlock(scope: !764, file: !19, line: 900, column: 9)
!772 = !DILocation(line: 1091, column: 21, scope: !535, inlinedAt: !555)
!773 = !DILocation(line: 898, column: 32, scope: !765, inlinedAt: !761)
!774 = !DILocation(line: 898, column: 21, scope: !765, inlinedAt: !761)
!775 = distinct !{!775, !768, !769, !680, !681}
!776 = !DILocation(line: 1095, column: 1, scope: !535, inlinedAt: !555)
!777 = !DILocation(line: 1097, column: 21, scope: !533, inlinedAt: !555)
!778 = !DILocation(line: 1097, column: 40, scope: !533, inlinedAt: !555)
!779 = !DILocation(line: 1097, column: 21, scope: !534, inlinedAt: !555)
!780 = !DILocation(line: 0, scope: !531, inlinedAt: !555)
!781 = !DILocation(line: 1099, column: 53, scope: !782, inlinedAt: !555)
!782 = distinct !DILexicalBlock(scope: !531, file: !19, line: 1099, column: 21)
!783 = !{!784, !570, i64 0}
!784 = !{!"option", !570, i64 0, !567, i64 8, !570, i64 16, !567, i64 24}
!785 = !DILocation(line: 1099, column: 21, scope: !531, inlinedAt: !555)
!786 = !DILocation(line: 1100, column: 45, scope: !787, inlinedAt: !555)
!787 = distinct !DILexicalBlock(scope: !782, file: !19, line: 1100, column: 29)
!788 = !{!784, !567, i64 24}
!789 = !DILocation(line: 1100, column: 49, scope: !787, inlinedAt: !555)
!790 = !DILocation(line: 1100, column: 29, scope: !782, inlinedAt: !555)
!791 = !DILocation(line: 1102, column: 48, scope: !792, inlinedAt: !555)
!792 = distinct !DILexicalBlock(scope: !787, file: !19, line: 1101, column: 25)
!793 = !DILocation(line: 1105, column: 25, scope: !532, inlinedAt: !555)
!794 = !DILocation(line: 1099, column: 60, scope: !782, inlinedAt: !555)
!795 = !DILocation(line: 1099, column: 37, scope: !782, inlinedAt: !555)
!796 = distinct !{!796, !785, !797, !680, !681}
!797 = !DILocation(line: 1104, column: 25, scope: !531, inlinedAt: !555)
!798 = !DILocation(line: 1112, column: 66, scope: !534, inlinedAt: !555)
!799 = !DILocation(line: 1112, column: 53, scope: !534, inlinedAt: !555)
!800 = !DILocation(line: 1112, column: 86, scope: !534, inlinedAt: !555)
!801 = !DILocation(line: 1112, column: 92, scope: !534, inlinedAt: !555)
!802 = !DILocation(line: 1112, column: 28, scope: !534, inlinedAt: !555)
!803 = !DILocation(line: 1116, column: 13, scope: !538, inlinedAt: !555)
!804 = !DILocation(line: 1116, column: 13, scope: !525, inlinedAt: !555)
!805 = !DILocation(line: 1118, column: 32, scope: !537, inlinedAt: !555)
!806 = !DILocation(line: 1118, column: 51, scope: !537, inlinedAt: !555)
!807 = !DILocation(line: 1118, column: 57, scope: !537, inlinedAt: !555)
!808 = !DILocation(line: 1118, column: 102, scope: !537, inlinedAt: !555)
!809 = !DILocation(line: 1118, column: 108, scope: !537, inlinedAt: !555)
!810 = !DILocation(line: 1118, column: 97, scope: !537, inlinedAt: !555)
!811 = !DILocation(line: 0, scope: !537, inlinedAt: !555)
!812 = !DILocation(line: 1119, column: 22, scope: !537, inlinedAt: !555)
!813 = !DILocation(line: 1119, column: 81, scope: !537, inlinedAt: !555)
!814 = !DILocation(line: 1119, column: 13, scope: !537, inlinedAt: !555)
!815 = !DILocation(line: 1122, column: 5, scope: !526, inlinedAt: !555)
!816 = !DILocation(line: 1125, column: 9, scope: !817, inlinedAt: !555)
!817 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1125, column: 9)
!818 = !DILocation(line: 1125, column: 9, scope: !496, inlinedAt: !555)
!819 = !DILocation(line: 1126, column: 9, scope: !817, inlinedAt: !555)
!820 = !DILocation(line: 1129, column: 9, scope: !821, inlinedAt: !555)
!821 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1129, column: 9)
!822 = !DILocation(line: 1129, column: 52, scope: !821, inlinedAt: !555)
!823 = !DILocation(line: 1129, column: 9, scope: !496, inlinedAt: !555)
!824 = !DILocation(line: 1133, column: 9, scope: !825, inlinedAt: !555)
!825 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1133, column: 9)
!826 = !DILocation(line: 1133, column: 16, scope: !825, inlinedAt: !555)
!827 = !DILocation(line: 1133, column: 27, scope: !825, inlinedAt: !555)
!828 = !DILocation(line: 1135, column: 18, scope: !829, inlinedAt: !555)
!829 = distinct !DILexicalBlock(scope: !825, file: !19, line: 1134, column: 5)
!830 = !DILocation(line: 1136, column: 18, scope: !829, inlinedAt: !555)
!831 = !DILocation(line: 1135, column: 9, scope: !829, inlinedAt: !555)
!832 = !DILocation(line: 1137, column: 9, scope: !829, inlinedAt: !555)
!833 = !DILocalVariable(name: "muxer", arg: 1, scope: !834, file: !19, line: 763, type: !143)
!834 = distinct !DISubprogram(name: "select_output", scope: !19, file: !19, line: 763, type: !835, scopeLine: 764, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!6, !143, !8, !79}
!837 = !{!833, !838, !839, !840}
!838 = !DILocalVariable(name: "filename", arg: 2, scope: !834, file: !19, line: 763, type: !8)
!839 = !DILocalVariable(name: "param", arg: 3, scope: !834, file: !19, line: 763, type: !79)
!840 = !DILocalVariable(name: "ext", scope: !834, file: !19, line: 765, type: !143)
!841 = !DILocation(line: 0, scope: !834, inlinedAt: !842)
!842 = distinct !DILocation(line: 1140, column: 9, scope: !843, inlinedAt: !555)
!843 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1140, column: 9)
!844 = !DILocalVariable(name: "filename", arg: 1, scope: !845, file: !30, line: 49, type: !8)
!845 = distinct !DISubprogram(name: "get_filename_extension", scope: !30, file: !30, line: 49, type: !846, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !848)
!846 = !DISubroutineType(types: !847)
!847 = !{!8, !8}
!848 = !{!844, !849}
!849 = !DILocalVariable(name: "ext", scope: !845, file: !30, line: 51, type: !8)
!850 = !DILocation(line: 0, scope: !845, inlinedAt: !851)
!851 = distinct !DILocation(line: 765, column: 23, scope: !834, inlinedAt: !842)
!852 = !DILocation(line: 51, column: 28, scope: !845, inlinedAt: !851)
!853 = !DILocation(line: 51, column: 26, scope: !845, inlinedAt: !851)
!854 = !DILocation(line: 52, column: 5, scope: !845, inlinedAt: !851)
!855 = !DILocation(line: 52, column: 12, scope: !845, inlinedAt: !851)
!856 = !{!568, !568, i64 0}
!857 = !DILocation(line: 52, column: 17, scope: !845, inlinedAt: !851)
!858 = !DILocation(line: 52, column: 24, scope: !845, inlinedAt: !851)
!859 = !DILocation(line: 53, column: 12, scope: !845, inlinedAt: !851)
!860 = distinct !{!860, !854, !859, !680, !681}
!861 = !DILocation(line: 766, column: 10, scope: !862, inlinedAt: !842)
!862 = distinct !DILexicalBlock(scope: !834, file: !19, line: 766, column: 9)
!863 = !DILocation(line: 766, column: 34, scope: !862, inlinedAt: !842)
!864 = !DILocation(line: 54, column: 17, scope: !845, inlinedAt: !851)
!865 = !DILocation(line: 54, column: 9, scope: !845, inlinedAt: !851)
!866 = !DILocation(line: 766, column: 37, scope: !862, inlinedAt: !842)
!867 = !DILocation(line: 766, column: 9, scope: !834, inlinedAt: !842)
!868 = !DILocation(line: 767, column: 9, scope: !862, inlinedAt: !842)
!869 = !DILocation(line: 769, column: 10, scope: !870, inlinedAt: !842)
!870 = distinct !DILexicalBlock(scope: !834, file: !19, line: 769, column: 9)
!871 = !DILocation(line: 769, column: 9, scope: !834, inlinedAt: !842)
!872 = !DILocation(line: 786, column: 15, scope: !873, inlinedAt: !842)
!873 = distinct !DILexicalBlock(scope: !870, file: !19, line: 786, column: 14)
!874 = !DILocation(line: 786, column: 14, scope: !870, inlinedAt: !842)
!875 = !DILocation(line: 788, column: 18, scope: !876, inlinedAt: !842)
!876 = distinct !DILexicalBlock(scope: !873, file: !19, line: 787, column: 5)
!877 = !{i64 0, i64 8, !580, i64 8, i64 8, !580, i64 16, i64 8, !580, i64 24, i64 8, !580, i64 32, i64 8, !580}
!878 = !DILocation(line: 789, column: 16, scope: !876, inlinedAt: !842)
!879 = !DILocation(line: 789, column: 25, scope: !876, inlinedAt: !842)
!880 = !{!638, !567, i64 640}
!881 = !DILocation(line: 790, column: 16, scope: !876, inlinedAt: !842)
!882 = !DILocation(line: 790, column: 31, scope: !876, inlinedAt: !842)
!883 = !{!638, !567, i64 668}
!884 = !DILocation(line: 791, column: 16, scope: !876, inlinedAt: !842)
!885 = !DILocation(line: 791, column: 33, scope: !876, inlinedAt: !842)
!886 = !{!638, !567, i64 636}
!887 = !DILocation(line: 792, column: 5, scope: !876, inlinedAt: !842)
!888 = !DILocation(line: 793, column: 15, scope: !889, inlinedAt: !842)
!889 = distinct !DILexicalBlock(scope: !873, file: !19, line: 793, column: 14)
!890 = !DILocation(line: 793, column: 14, scope: !873, inlinedAt: !842)
!891 = !DILocation(line: 795, column: 18, scope: !892, inlinedAt: !842)
!892 = distinct !DILexicalBlock(scope: !889, file: !19, line: 794, column: 5)
!893 = !DILocation(line: 796, column: 16, scope: !892, inlinedAt: !842)
!894 = !DILocation(line: 796, column: 25, scope: !892, inlinedAt: !842)
!895 = !DILocation(line: 797, column: 16, scope: !892, inlinedAt: !842)
!896 = !DILocation(line: 797, column: 31, scope: !892, inlinedAt: !842)
!897 = !DILocation(line: 798, column: 16, scope: !892, inlinedAt: !842)
!898 = !DILocation(line: 798, column: 33, scope: !892, inlinedAt: !842)
!899 = !DILocation(line: 799, column: 5, scope: !892, inlinedAt: !842)
!900 = !DILocation(line: 801, column: 18, scope: !889, inlinedAt: !842)
!901 = !DILocation(line: 782, column: 18, scope: !902, inlinedAt: !842)
!902 = distinct !DILexicalBlock(scope: !870, file: !19, line: 770, column: 5)
!903 = !DILocation(line: 782, column: 9, scope: !902, inlinedAt: !842)
!904 = !DILocation(line: 1140, column: 9, scope: !496, inlinedAt: !555)
!905 = !DILocation(line: 1142, column: 16, scope: !906, inlinedAt: !555)
!906 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1142, column: 9)
!907 = !{!908, !570, i64 0}
!908 = !{!"", !570, i64 0, !570, i64 8, !570, i64 16, !570, i64 24, !570, i64 32}
!909 = !DILocation(line: 1142, column: 50, scope: !906, inlinedAt: !555)
!910 = !DILocation(line: 1142, column: 9, scope: !906, inlinedAt: !555)
!911 = !DILocation(line: 1142, column: 9, scope: !496, inlinedAt: !555)
!912 = !DILocation(line: 1144, column: 18, scope: !913, inlinedAt: !555)
!913 = distinct !DILexicalBlock(scope: !906, file: !19, line: 1143, column: 5)
!914 = !DILocation(line: 1144, column: 9, scope: !913, inlinedAt: !555)
!915 = !DILocation(line: 1145, column: 9, scope: !913, inlinedAt: !555)
!916 = !DILocation(line: 1148, column: 33, scope: !496, inlinedAt: !555)
!917 = !DILocation(line: 1148, column: 22, scope: !496, inlinedAt: !555)
!918 = !DILocation(line: 1149, column: 35, scope: !496, inlinedAt: !555)
!919 = !DILocation(line: 1149, column: 28, scope: !496, inlinedAt: !555)
!920 = !DILocation(line: 1149, column: 55, scope: !496, inlinedAt: !555)
!921 = !DILocation(line: 1149, column: 44, scope: !496, inlinedAt: !555)
!922 = !DILocation(line: 1149, column: 15, scope: !496, inlinedAt: !555)
!923 = !DILocation(line: 1149, column: 26, scope: !496, inlinedAt: !555)
!924 = !{!651, !570, i64 8}
!925 = !DILocation(line: 1150, column: 18, scope: !496, inlinedAt: !555)
!926 = !DILocation(line: 1151, column: 10, scope: !496, inlinedAt: !555)
!927 = !DILocation(line: 1154, column: 30, scope: !496, inlinedAt: !555)
!928 = !{!638, !567, i64 28}
!929 = !DILocation(line: 1154, column: 21, scope: !496, inlinedAt: !555)
!930 = !{!931, !567, i64 0}
!931 = !{!"", !567, i64 0, !567, i64 4, !567, i64 8, !567, i64 12, !567, i64 16, !567, i64 20, !567, i64 24, !567, i64 28, !567, i64 32, !567, i64 36, !567, i64 40, !567, i64 44}
!932 = !DILocation(line: 1155, column: 30, scope: !496, inlinedAt: !555)
!933 = !{!638, !567, i64 652}
!934 = !DILocation(line: 1155, column: 10, scope: !496, inlinedAt: !555)
!935 = !DILocation(line: 1155, column: 21, scope: !496, inlinedAt: !555)
!936 = !{!931, !567, i64 4}
!937 = !DILocation(line: 1156, column: 30, scope: !496, inlinedAt: !555)
!938 = !{!638, !567, i64 656}
!939 = !DILocation(line: 1156, column: 10, scope: !496, inlinedAt: !555)
!940 = !DILocation(line: 1156, column: 21, scope: !496, inlinedAt: !555)
!941 = !{!931, !567, i64 8}
!942 = !DILocation(line: 1157, column: 30, scope: !496, inlinedAt: !555)
!943 = !{!638, !567, i64 136}
!944 = !DILocation(line: 1157, column: 10, scope: !496, inlinedAt: !555)
!945 = !DILocation(line: 1157, column: 21, scope: !496, inlinedAt: !555)
!946 = !{!931, !567, i64 16}
!947 = !DILocation(line: 1158, column: 30, scope: !496, inlinedAt: !555)
!948 = !DILocation(line: 1158, column: 34, scope: !496, inlinedAt: !555)
!949 = !{!638, !567, i64 48}
!950 = !DILocation(line: 1158, column: 10, scope: !496, inlinedAt: !555)
!951 = !DILocation(line: 1158, column: 21, scope: !496, inlinedAt: !555)
!952 = !{!931, !567, i64 20}
!953 = !DILocation(line: 1159, column: 34, scope: !496, inlinedAt: !555)
!954 = !{!638, !567, i64 44}
!955 = !DILocation(line: 1159, column: 10, scope: !496, inlinedAt: !555)
!956 = !DILocation(line: 1159, column: 21, scope: !496, inlinedAt: !555)
!957 = !{!931, !567, i64 24}
!958 = !DILocation(line: 1160, column: 30, scope: !496, inlinedAt: !555)
!959 = !{!638, !567, i64 672}
!960 = !DILocation(line: 1160, column: 10, scope: !496, inlinedAt: !555)
!961 = !DILocation(line: 1160, column: 21, scope: !496, inlinedAt: !555)
!962 = !{!931, !567, i64 28}
!963 = !DILocation(line: 1161, column: 30, scope: !496, inlinedAt: !555)
!964 = !DILocation(line: 1161, column: 10, scope: !496, inlinedAt: !555)
!965 = !DILocation(line: 1161, column: 21, scope: !496, inlinedAt: !555)
!966 = !{!931, !567, i64 40}
!967 = !DILocalVariable(name: "demuxer", arg: 1, scope: !968, file: !19, line: 805, type: !143)
!968 = distinct !DISubprogram(name: "select_input", scope: !19, file: !19, line: 805, type: !969, scopeLine: 807, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !971)
!969 = !DISubroutineType(types: !970)
!970 = !{!6, !143, !8, !8, !28, !31, !51}
!971 = !{!967, !972, !973, !974, !975, !976, !977, !978, !979, !980, !983}
!972 = !DILocalVariable(name: "used_demuxer", arg: 2, scope: !968, file: !19, line: 805, type: !8)
!973 = !DILocalVariable(name: "filename", arg: 3, scope: !968, file: !19, line: 805, type: !8)
!974 = !DILocalVariable(name: "p_handle", arg: 4, scope: !968, file: !19, line: 806, type: !28)
!975 = !DILocalVariable(name: "info", arg: 5, scope: !968, file: !19, line: 806, type: !31)
!976 = !DILocalVariable(name: "opt", arg: 6, scope: !968, file: !19, line: 806, type: !51)
!977 = !DILocalVariable(name: "ext", scope: !968, file: !19, line: 808, type: !143)
!978 = !DILocalVariable(name: "b_regular", scope: !968, file: !19, line: 809, type: !6)
!979 = !DILocalVariable(name: "b_auto", scope: !968, file: !19, line: 810, type: !6)
!980 = !DILocalVariable(name: "f", scope: !981, file: !19, line: 815, type: !429)
!981 = distinct !DILexicalBlock(scope: !982, file: !19, line: 814, column: 5)
!982 = distinct !DILexicalBlock(scope: !968, file: !19, line: 813, column: 9)
!983 = !DILocalVariable(name: "module", scope: !968, file: !19, line: 822, type: !143)
!984 = !DILocation(line: 0, scope: !968, inlinedAt: !985)
!985 = distinct !DILocation(line: 1163, column: 9, scope: !986, inlinedAt: !555)
!986 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1163, column: 9)
!987 = !DILocation(line: 0, scope: !845, inlinedAt: !988)
!988 = distinct !DILocation(line: 808, column: 23, scope: !968, inlinedAt: !985)
!989 = !DILocation(line: 51, column: 28, scope: !845, inlinedAt: !988)
!990 = !DILocation(line: 51, column: 26, scope: !845, inlinedAt: !988)
!991 = !DILocation(line: 52, column: 5, scope: !845, inlinedAt: !988)
!992 = !DILocation(line: 52, column: 12, scope: !845, inlinedAt: !988)
!993 = !DILocation(line: 52, column: 17, scope: !845, inlinedAt: !988)
!994 = !DILocation(line: 52, column: 24, scope: !845, inlinedAt: !988)
!995 = !DILocation(line: 53, column: 12, scope: !845, inlinedAt: !988)
!996 = distinct !{!996, !991, !995, !680, !681}
!997 = !DILocation(line: 1163, column: 67, scope: !986, inlinedAt: !555)
!998 = !DILocation(line: 54, column: 17, scope: !845, inlinedAt: !988)
!999 = !DILocation(line: 54, column: 9, scope: !845, inlinedAt: !988)
!1000 = !DILocation(line: 809, column: 21, scope: !968, inlinedAt: !985)
!1001 = !DILocation(line: 810, column: 19, scope: !968, inlinedAt: !985)
!1002 = !DILocation(line: 810, column: 18, scope: !968, inlinedAt: !985)
!1003 = !DILocation(line: 811, column: 10, scope: !1004, inlinedAt: !985)
!1004 = distinct !DILexicalBlock(scope: !968, file: !19, line: 811, column: 9)
!1005 = !DILocation(line: 811, column: 20, scope: !1004, inlinedAt: !985)
!1006 = !DILocation(line: 813, column: 9, scope: !968, inlinedAt: !985)
!1007 = !DILocation(line: 815, column: 19, scope: !981, inlinedAt: !985)
!1008 = !DILocation(line: 0, scope: !981, inlinedAt: !985)
!1009 = !DILocation(line: 816, column: 13, scope: !1010, inlinedAt: !985)
!1010 = distinct !DILexicalBlock(scope: !981, file: !19, line: 816, column: 13)
!1011 = !DILocation(line: 816, column: 13, scope: !981, inlinedAt: !985)
!1012 = !DILocation(line: 819, column: 13, scope: !1013, inlinedAt: !985)
!1013 = distinct !DILexicalBlock(scope: !1010, file: !19, line: 817, column: 9)
!1014 = !DILocation(line: 820, column: 9, scope: !1013, inlinedAt: !985)
!1015 = !DILocation(line: 822, column: 26, scope: !968, inlinedAt: !985)
!1016 = !DILocation(line: 824, column: 10, scope: !1017, inlinedAt: !985)
!1017 = distinct !DILexicalBlock(scope: !968, file: !19, line: 824, column: 9)
!1018 = !DILocation(line: 824, column: 34, scope: !1017, inlinedAt: !985)
!1019 = !DILocation(line: 824, column: 38, scope: !1017, inlinedAt: !985)
!1020 = !DILocation(line: 824, column: 59, scope: !1017, inlinedAt: !985)
!1021 = !DILocation(line: 824, column: 63, scope: !1017, inlinedAt: !985)
!1022 = !DILocation(line: 824, column: 9, scope: !968, inlinedAt: !985)
!1023 = !DILocation(line: 830, column: 18, scope: !1024, inlinedAt: !985)
!1024 = distinct !DILexicalBlock(scope: !1017, file: !19, line: 825, column: 5)
!1025 = !DILocation(line: 830, column: 9, scope: !1024, inlinedAt: !985)
!1026 = !DILocation(line: 831, column: 9, scope: !1024, inlinedAt: !985)
!1027 = !DILocation(line: 834, column: 15, scope: !1028, inlinedAt: !985)
!1028 = distinct !DILexicalBlock(scope: !1017, file: !19, line: 834, column: 14)
!1029 = !DILocation(line: 834, column: 14, scope: !1017, inlinedAt: !985)
!1030 = !DILocation(line: 835, column: 17, scope: !1028, inlinedAt: !985)
!1031 = !{i64 0, i64 8, !580, i64 8, i64 8, !580, i64 16, i64 8, !580, i64 24, i64 8, !580, i64 32, i64 8, !580, i64 40, i64 8, !580, i64 48, i64 8, !580}
!1032 = !DILocation(line: 835, column: 9, scope: !1028, inlinedAt: !985)
!1033 = !DILocation(line: 836, column: 15, scope: !1034, inlinedAt: !985)
!1034 = distinct !DILexicalBlock(scope: !1028, file: !19, line: 836, column: 14)
!1035 = !DILocation(line: 836, column: 14, scope: !1028, inlinedAt: !985)
!1036 = !DILocation(line: 837, column: 17, scope: !1034, inlinedAt: !985)
!1037 = !DILocation(line: 837, column: 9, scope: !1034, inlinedAt: !985)
!1038 = !DILocation(line: 867, column: 20, scope: !1039, inlinedAt: !985)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !19, line: 867, column: 13)
!1040 = distinct !DILexicalBlock(scope: !1034, file: !19, line: 839, column: 5)
!1041 = !DILocation(line: 867, column: 34, scope: !1039, inlinedAt: !985)
!1042 = !{!1043, !570, i64 0}
!1043 = !{!"", !570, i64 0, !570, i64 8, !570, i64 16, !570, i64 24, !570, i64 32, !570, i64 40, !570, i64 48}
!1044 = !DILocation(line: 867, column: 24, scope: !1039, inlinedAt: !985)
!1045 = !DILocation(line: 867, column: 13, scope: !1040, inlinedAt: !985)
!1046 = !DILocation(line: 871, column: 21, scope: !1047, inlinedAt: !985)
!1047 = distinct !DILexicalBlock(scope: !1039, file: !19, line: 868, column: 9)
!1048 = !DILocation(line: 872, column: 9, scope: !1047, inlinedAt: !985)
!1049 = !DILocation(line: 874, column: 15, scope: !1050, inlinedAt: !985)
!1050 = distinct !DILexicalBlock(scope: !1040, file: !19, line: 874, column: 13)
!1051 = !DILocation(line: 874, column: 14, scope: !1050, inlinedAt: !985)
!1052 = !DILocation(line: 874, column: 13, scope: !1040, inlinedAt: !985)
!1053 = !DILocation(line: 880, column: 5, scope: !968, inlinedAt: !985)
!1054 = !DILocation(line: 1166, column: 19, scope: !1055, inlinedAt: !555)
!1055 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1166, column: 9)
!1056 = !DILocation(line: 876, column: 22, scope: !1057, inlinedAt: !985)
!1057 = distinct !DILexicalBlock(scope: !1050, file: !19, line: 875, column: 9)
!1058 = !DILocation(line: 876, column: 13, scope: !1057, inlinedAt: !985)
!1059 = !DILocation(line: 877, column: 13, scope: !1057, inlinedAt: !985)
!1060 = !DILocation(line: 1166, column: 15, scope: !1055, inlinedAt: !555)
!1061 = !{!566, !570, i64 8}
!1062 = !DILocation(line: 1166, column: 10, scope: !1055, inlinedAt: !555)
!1063 = !DILocation(line: 1166, column: 28, scope: !1055, inlinedAt: !555)
!1064 = !DILocation(line: 1166, column: 22, scope: !1055, inlinedAt: !555)
!1065 = !DILocation(line: 1166, column: 9, scope: !496, inlinedAt: !555)
!1066 = !DILocation(line: 1168, column: 18, scope: !1067, inlinedAt: !555)
!1067 = distinct !DILexicalBlock(scope: !1055, file: !19, line: 1167, column: 5)
!1068 = !DILocation(line: 1168, column: 9, scope: !1067, inlinedAt: !555)
!1069 = !DILocation(line: 1169, column: 9, scope: !1067, inlinedAt: !555)
!1070 = !DILocation(line: 1172, column: 5, scope: !496, inlinedAt: !555)
!1071 = !DILocation(line: 1173, column: 5, scope: !496, inlinedAt: !555)
!1072 = !DILocation(line: 1174, column: 16, scope: !1073, inlinedAt: !555)
!1073 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1174, column: 9)
!1074 = !DILocation(line: 1174, column: 28, scope: !1073, inlinedAt: !555)
!1075 = !DILocation(line: 1174, column: 9, scope: !496, inlinedAt: !555)
!1076 = !DILocation(line: 1175, column: 18, scope: !1073, inlinedAt: !555)
!1077 = !DILocation(line: 1175, column: 93, scope: !1073, inlinedAt: !555)
!1078 = !{!931, !567, i64 44}
!1079 = !DILocation(line: 1176, column: 23, scope: !1073, inlinedAt: !555)
!1080 = !{!931, !567, i64 12}
!1081 = !DILocation(line: 1176, column: 36, scope: !1073, inlinedAt: !555)
!1082 = !DILocation(line: 1176, column: 31, scope: !1073, inlinedAt: !555)
!1083 = !DILocation(line: 1176, column: 65, scope: !1073, inlinedAt: !555)
!1084 = !DILocation(line: 1176, column: 81, scope: !1073, inlinedAt: !555)
!1085 = !DILocation(line: 1177, column: 23, scope: !1073, inlinedAt: !555)
!1086 = !DILocation(line: 1177, column: 37, scope: !1073, inlinedAt: !555)
!1087 = !DILocation(line: 1177, column: 51, scope: !1073, inlinedAt: !555)
!1088 = !DILocation(line: 1177, column: 46, scope: !1073, inlinedAt: !555)
!1089 = !DILocation(line: 1175, column: 9, scope: !1073, inlinedAt: !555)
!1090 = !DILocation(line: 1179, column: 9, scope: !1091, inlinedAt: !555)
!1091 = distinct !DILexicalBlock(scope: !496, file: !19, line: 1179, column: 9)
!1092 = !DILocation(line: 1179, column: 9, scope: !496, inlinedAt: !555)
!1093 = !DILocation(line: 1181, column: 13, scope: !1094, inlinedAt: !555)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !19, line: 1181, column: 13)
!1095 = distinct !DILexicalBlock(scope: !1091, file: !19, line: 1180, column: 5)
!1096 = !DILocation(line: 1181, column: 13, scope: !1095, inlinedAt: !555)
!1097 = !DILocation(line: 1183, column: 22, scope: !1098, inlinedAt: !555)
!1098 = distinct !DILexicalBlock(scope: !1094, file: !19, line: 1182, column: 9)
!1099 = !DILocation(line: 1183, column: 13, scope: !1098, inlinedAt: !555)
!1100 = !DILocation(line: 1184, column: 13, scope: !1098, inlinedAt: !555)
!1101 = !DILocation(line: 1186, column: 28, scope: !1102, inlinedAt: !555)
!1102 = distinct !DILexicalBlock(scope: !1095, file: !19, line: 1186, column: 13)
!1103 = !DILocation(line: 1186, column: 13, scope: !1102, inlinedAt: !555)
!1104 = !DILocation(line: 1186, column: 13, scope: !1095, inlinedAt: !555)
!1105 = !DILocation(line: 1188, column: 22, scope: !1106, inlinedAt: !555)
!1106 = distinct !DILexicalBlock(scope: !1102, file: !19, line: 1187, column: 9)
!1107 = !DILocation(line: 1188, column: 13, scope: !1106, inlinedAt: !555)
!1108 = !DILocation(line: 1189, column: 13, scope: !1106, inlinedAt: !555)
!1109 = !DILocation(line: 1192, column: 21, scope: !1102, inlinedAt: !555)
