; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r/llvm-ir/557.xz_r_bc/simple/x86.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/simple/x86.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i8, i8, ptr, ptr, i32, i64, i64, i64, i64, [0 x i8] }
%struct.lzma_next_coder_s = type { ptr, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.lzma_simple_s = type { i32, i32 }

@x86_code.MASK_TO_BIT_NUMBER = internal unnamed_addr constant [8 x i32] [i32 0, i32 1, i32 2, i32 2, i32 3, i32 3, i32 3, i32 3], align 16, !dbg !0

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_simple_x86_encoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters) local_unnamed_addr #0 !dbg !187 {
entry:
  call void @llvm.dbg.value(metadata ptr %next, metadata !202, metadata !DIExpression()), !dbg !205
  call void @llvm.dbg.value(metadata ptr %allocator, metadata !203, metadata !DIExpression()), !dbg !205
  call void @llvm.dbg.value(metadata ptr %filters, metadata !204, metadata !DIExpression()), !dbg !205
  call void @llvm.dbg.value(metadata ptr %next, metadata !206, metadata !DIExpression()) #4, !dbg !216
  call void @llvm.dbg.value(metadata ptr %allocator, metadata !211, metadata !DIExpression()) #4, !dbg !216

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MASK_TO_BIT_NUMBER", scope: !2, file: !3, line: 33, type: !179, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "x86_code", scope: !3, file: !3, line: 27, type: !4, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !154)
!3 = !DIFile(filename: "apps/557.xz_r/src/liblzma/simple/x86.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d511d504c4e6105d3bb96252bce2f620")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9, !15, !21, !22, !6}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 46, baseType: !8)
!7 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!8 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_simple", file: !11, line: 19, baseType: !12)
!11 = !DIFile(filename: "apps/557.xz_r/src/liblzma/simple/simple_private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2921a659cca72849047c4661dc5d5b7e")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_simple_s", file: !3, line: 20, size: 64, elements: !13)
!13 = !{!14, !20}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "prev_mask", scope: !12, file: !3, line: 21, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 26, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !18, line: 42, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "prev_pos", scope: !12, file: !3, line: 22, baseType: !15, size: 32, offset: 32)
!21 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 24, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !18, line: 38, baseType: !25)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = distinct !DICompileUnit(language: DW_LANG_C99, file: !27, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !28, retainedTypes: !57, globals: !147, splitDebugInlining: false, nameTableKind: None)
!27 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/557.xz_r/src/liblzma/simple/x86.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/557.xz_r", checksumkind: CSK_MD5, checksum: "d511d504c4e6105d3bb96252bce2f620")
!28 = !{!29, !44, !50}
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 57, baseType: !19, size: 32, elements: !31)
!30 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/base.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!32 = !DIEnumerator(name: "LZMA_OK", value: 0)
!33 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!34 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!35 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!36 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!37 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!38 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!39 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!40 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!41 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!42 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!43 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 250, baseType: !19, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!47 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!48 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!49 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 27, baseType: !19, size: 32, elements: !52)
!51 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/check.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!54 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!55 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!56 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!57 = !{!58, !15, !23}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !11, line: 21, size: 1024, elements: !60)
!60 = !{!61, !133, !134, !135, !137, !138, !139, !140, !141, !142, !143}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !11, line: 23, baseType: !62, size: 512)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !63, line: 80, baseType: !64)
!63 = !DIFile(filename: "apps/557.xz_r/src/liblzma/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !63, line: 124, size: 512, elements: !65)
!65 = !{!66, !69, !74, !77, !104, !109, !116, !121}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !64, file: !63, line: 126, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !63, line: 78, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !64, file: !63, line: 130, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !71, line: 63, baseType: !72)
!71 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/vli.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !16, line: 27, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !18, line: 45, baseType: !8)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !64, file: !63, line: 136, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !76, line: 90, baseType: !8)
!76 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "24103e292ae21916e87130b926c8d2f8")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !64, file: !63, line: 139, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !63, line: 94, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !67, !83, !97, !100, !6, !102, !100, !6, !103}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !30, line: 237, baseType: !29)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !30, line: 403, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 341, size: 192, elements: !86)
!86 = !{!87, !92, !96}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !85, file: !30, line: 376, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!91, !91, !6, !6}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !85, file: !30, line: 390, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !91, !91}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !85, file: !30, line: 401, baseType: !91, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!100 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !22)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !30, line: 322, baseType: !44)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !64, file: !63, line: 144, baseType: !105, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !63, line: 102, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !67, !83}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !64, file: !63, line: 148, baseType: !110, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !51, line: 55, baseType: !50)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !64, file: !63, line: 152, baseType: !117, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!82, !67, !120, !120, !72}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !64, file: !63, line: 157, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!82, !67, !83, !125, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !128, line: 65, baseType: !129)
!128 = !DIFile(filename: "apps/557.xz_r/src/liblzma/api/lzma/filter.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 43, size: 128, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !129, file: !128, line: 54, baseType: !70, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !129, file: !128, line: 63, baseType: !91, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "end_was_reached", scope: !59, file: !11, line: 26, baseType: !21, size: 8, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "is_encoder", scope: !59, file: !11, line: 32, baseType: !21, size: 8, offset: 520)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !59, file: !11, line: 36, baseType: !136, size: 64, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "simple", scope: !59, file: !11, line: 41, baseType: !9, size: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "now_pos", scope: !59, file: !11, line: 46, baseType: !15, size: 32, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !59, file: !11, line: 49, baseType: !6, size: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !59, file: !11, line: 53, baseType: !6, size: 64, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !59, file: !11, line: 57, baseType: !6, size: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !59, file: !11, line: 61, baseType: !6, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !59, file: !11, line: 64, baseType: !144, offset: 1024)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: -1)
!147 = !{!148, !0}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "MASK_TO_ALLOWED_STATUS", scope: !2, file: !3, line: 30, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !152)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!152 = !{!153}
!153 = !DISubrange(count: 8)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !164, !165, !167, !169, !173, !176, !177}
!155 = !DILocalVariable(name: "simple", arg: 1, scope: !2, file: !3, line: 27, type: !9)
!156 = !DILocalVariable(name: "now_pos", arg: 2, scope: !2, file: !3, line: 27, type: !15)
!157 = !DILocalVariable(name: "is_encoder", arg: 3, scope: !2, file: !3, line: 27, type: !21)
!158 = !DILocalVariable(name: "buffer", arg: 4, scope: !2, file: !3, line: 28, type: !22)
!159 = !DILocalVariable(name: "size", arg: 5, scope: !2, file: !3, line: 28, type: !6)
!160 = !DILocalVariable(name: "prev_mask", scope: !2, file: !3, line: 36, type: !15)
!161 = !DILocalVariable(name: "prev_pos", scope: !2, file: !3, line: 37, type: !15)
!162 = !DILocalVariable(name: "limit", scope: !2, file: !3, line: 45, type: !163)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!164 = !DILocalVariable(name: "buffer_pos", scope: !2, file: !3, line: 46, type: !6)
!165 = !DILocalVariable(name: "b", scope: !166, file: !3, line: 49, type: !23)
!166 = distinct !DILexicalBlock(scope: !2, file: !3, line: 48, column: 30)
!167 = !DILocalVariable(name: "offset", scope: !166, file: !3, line: 55, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!169 = !DILocalVariable(name: "i", scope: !170, file: !3, line: 62, type: !15)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 62, column: 4)
!171 = distinct !DILexicalBlock(scope: !172, file: !3, line: 61, column: 10)
!172 = distinct !DILexicalBlock(scope: !166, file: !3, line: 59, column: 7)
!173 = !DILocalVariable(name: "src", scope: !174, file: !3, line: 74, type: !15)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 72, column: 33)
!175 = distinct !DILexicalBlock(scope: !166, file: !3, line: 70, column: 7)
!176 = !DILocalVariable(name: "dest", scope: !174, file: !3, line: 79, type: !15)
!177 = !DILocalVariable(name: "i", scope: !178, file: !3, line: 91, type: !168)
!178 = distinct !DILexicalBlock(scope: !174, file: !3, line: 80, column: 17)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 256, elements: !152)
!180 = !{i32 7, !"Dwarf Version", i32 5}
!181 = !{i32 2, !"Debug Info Version", i32 3}
!182 = !{i32 1, !"wchar_size", i32 4}
!183 = !{i32 7, !"PIC Level", i32 2}
!184 = !{i32 7, !"PIE Level", i32 2}
!185 = !{i32 7, !"uwtable", i32 2}
!186 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!187 = distinct !DISubprogram(name: "lzma_simple_x86_encoder_init", scope: !3, file: !3, line: 142, type: !188, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !201)
!188 = !DISubroutineType(types: !189)
!189 = !{!82, !190, !83, !191}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !63, line: 82, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !63, line: 109, size: 192, elements: !195)
!195 = !{!196, !197, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !194, file: !63, line: 112, baseType: !70, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !194, file: !63, line: 116, baseType: !198, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !63, line: 86, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !194, file: !63, line: 119, baseType: !91, size: 64, offset: 128)
!201 = !{!202, !203, !204}
!202 = !DILocalVariable(name: "next", arg: 1, scope: !187, file: !3, line: 142, type: !190)
!203 = !DILocalVariable(name: "allocator", arg: 2, scope: !187, file: !3, line: 142, type: !83)
!204 = !DILocalVariable(name: "filters", arg: 3, scope: !187, file: !3, line: 143, type: !191)
!205 = !DILocation(line: 0, scope: !187)
!206 = !DILocalVariable(name: "next", arg: 1, scope: !207, file: !3, line: 126, type: !190)
!207 = distinct !DISubprogram(name: "x86_coder_init", scope: !3, file: !3, line: 126, type: !208, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !210)
!208 = !DISubroutineType(types: !209)
!209 = !{!82, !190, !83, !191, !21}
!210 = !{!206, !211, !212, !213, !214}
!211 = !DILocalVariable(name: "allocator", arg: 2, scope: !207, file: !3, line: 126, type: !83)
!212 = !DILocalVariable(name: "filters", arg: 3, scope: !207, file: !3, line: 127, type: !191)
!213 = !DILocalVariable(name: "is_encoder", arg: 4, scope: !207, file: !3, line: 127, type: !21)
!214 = !DILocalVariable(name: "ret", scope: !207, file: !3, line: 129, type: !215)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!216 = !DILocation(line: 0, scope: !207, inlinedAt: !217)
!217 = distinct !DILocation(line: 145, column: 9, scope: !187)
!218 = !DILocation(line: 129, column: 23, scope: !207, inlinedAt: !217)
!219 = !DILocation(line: 132, column: 10, scope: !220, inlinedAt: !217)
!220 = distinct !DILexicalBlock(scope: !207, file: !3, line: 132, column: 6)
!221 = !DILocation(line: 132, column: 6, scope: !207, inlinedAt: !217)
!222 = !DILocation(line: 133, column: 32, scope: !223, inlinedAt: !217)
!223 = distinct !DILexicalBlock(scope: !220, file: !3, line: 132, column: 22)
!224 = !{!225, !226, i64 0}
!225 = !{!"lzma_next_coder_s", !226, i64 0, !229, i64 8, !229, i64 16, !226, i64 24, !226, i64 32, !226, i64 40, !226, i64 48, !226, i64 56}
!226 = !{!"any pointer", !227, i64 0}
!227 = !{!"omnipotent char", !228, i64 0}
!228 = !{!"Simple C/C++ TBAA"}
!229 = !{!"long", !227, i64 0}
!230 = !DILocation(line: 133, column: 40, scope: !223, inlinedAt: !217)
!231 = !{!226, !226, i64 0}
!232 = !DILocation(line: 133, column: 58, scope: !223, inlinedAt: !217)
!233 = !{!234, !235, i64 0}
!234 = !{!"lzma_simple_s", !235, i64 0, !235, i64 4}
!235 = !{!"int", !227, i64 0}
!236 = !DILocation(line: 134, column: 48, scope: !223, inlinedAt: !217)
!237 = !DILocation(line: 134, column: 57, scope: !223, inlinedAt: !217)
!238 = !{!234, !235, i64 4}
!239 = !DILocation(line: 135, column: 2, scope: !223, inlinedAt: !217)
!240 = !DILocation(line: 145, column: 2, scope: !187)
!241 = distinct !DISubprogram(name: "lzma_simple_x86_decoder_init", scope: !3, file: !3, line: 150, type: !188, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !242)
!242 = !{!243, !244, !245}
!243 = !DILocalVariable(name: "next", arg: 1, scope: !241, file: !3, line: 150, type: !190)
!244 = !DILocalVariable(name: "allocator", arg: 2, scope: !241, file: !3, line: 150, type: !83)
!245 = !DILocalVariable(name: "filters", arg: 3, scope: !241, file: !3, line: 151, type: !191)
!246 = !DILocation(line: 0, scope: !241)
!247 = !DILocation(line: 0, scope: !207, inlinedAt: !248)
!248 = distinct !DILocation(line: 153, column: 9, scope: !241)
!249 = !DILocation(line: 129, column: 23, scope: !207, inlinedAt: !248)
!250 = !DILocation(line: 132, column: 10, scope: !220, inlinedAt: !248)
!251 = !DILocation(line: 132, column: 6, scope: !207, inlinedAt: !248)
!252 = !DILocation(line: 133, column: 32, scope: !223, inlinedAt: !248)
!253 = !DILocation(line: 133, column: 40, scope: !223, inlinedAt: !248)
!254 = !DILocation(line: 133, column: 58, scope: !223, inlinedAt: !248)
