; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/538.imagick_r/llvm-ir/538.imagick_r_bc/magick/xml-tree.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/xml-tree.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._XMLTreeInfo = type { ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, i32, ptr, i64 }
%struct._XMLTreeRoot = type { %struct._XMLTreeInfo, ptr, i32, ptr, ptr, ptr, i32, ptr, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._ExceptionInfo = type { i32, i32, ptr, ptr, ptr, i32, ptr, i64 }

@sentinel = internal global [1 x ptr] zeroinitializer, align 8, !dbg !0
@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.1 = private unnamed_addr constant [87 x i8] c"/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/538.imagick_r/src/magick/xml-tree.c\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"...\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"<base64>\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"</base64>\00", align 1
@.str.5 = private unnamed_addr constant [6 x i8] c"&amp;\00", align 1
@.str.6 = private unnamed_addr constant [5 x i8] c"&lt;\00", align 1

!59 = !DIEnumerator(name: "ResourceLimitWarning", value: 300)
!60 = !DIEnumerator(name: "TypeWarning", value: 305)
!61 = !DIEnumerator(name: "OptionWarning", value: 310)
!62 = !DIEnumerator(name: "DelegateWarning", value: 315)
!63 = !DIEnumerator(name: "MissingDelegateWarning", value: 320)
!64 = !DIEnumerator(name: "CorruptImageWarning", value: 325)
!65 = !DIEnumerator(name: "FileOpenWarning", value: 330)
!66 = !DIEnumerator(name: "BlobWarning", value: 335)
!67 = !DIEnumerator(name: "StreamWarning", value: 340)
!68 = !DIEnumerator(name: "CacheWarning", value: 345)
!69 = !DIEnumerator(name: "CoderWarning", value: 350)
!70 = !DIEnumerator(name: "FilterWarning", value: 352)
!71 = !DIEnumerator(name: "ModuleWarning", value: 355)
!72 = !DIEnumerator(name: "DrawWarning", value: 360)
!73 = !DIEnumerator(name: "ImageWarning", value: 365)
!74 = !DIEnumerator(name: "WandWarning", value: 370)
!75 = !DIEnumerator(name: "RandomWarning", value: 375)
!76 = !DIEnumerator(name: "XServerWarning", value: 380)
!77 = !DIEnumerator(name: "MonitorWarning", value: 385)
!78 = !DIEnumerator(name: "RegistryWarning", value: 390)
!79 = !DIEnumerator(name: "ConfigureWarning", value: 395)
!80 = !DIEnumerator(name: "PolicyWarning", value: 399)
!81 = !DIEnumerator(name: "ErrorException", value: 400)
!82 = !DIEnumerator(name: "ResourceLimitError", value: 400)
!83 = !DIEnumerator(name: "TypeError", value: 405)
!84 = !DIEnumerator(name: "OptionError", value: 410)
!85 = !DIEnumerator(name: "DelegateError", value: 415)
!86 = !DIEnumerator(name: "MissingDelegateError", value: 420)
!87 = !DIEnumerator(name: "CorruptImageError", value: 425)
!88 = !DIEnumerator(name: "FileOpenError", value: 430)
!89 = !DIEnumerator(name: "BlobError", value: 435)
!90 = !DIEnumerator(name: "StreamError", value: 440)
!91 = !DIEnumerator(name: "CacheError", value: 445)
!92 = !DIEnumerator(name: "CoderError", value: 450)
!93 = !DIEnumerator(name: "FilterError", value: 452)
!94 = !DIEnumerator(name: "ModuleError", value: 455)
!95 = !DIEnumerator(name: "DrawError", value: 460)
!96 = !DIEnumerator(name: "ImageError", value: 465)
!97 = !DIEnumerator(name: "WandError", value: 470)
!98 = !DIEnumerator(name: "RandomError", value: 475)
!99 = !DIEnumerator(name: "XServerError", value: 480)
!100 = !DIEnumerator(name: "MonitorError", value: 485)
!101 = !DIEnumerator(name: "RegistryError", value: 490)
!102 = !DIEnumerator(name: "ConfigureError", value: 495)
!103 = !DIEnumerator(name: "PolicyError", value: 499)
!104 = !DIEnumerator(name: "FatalErrorException", value: 700)
!105 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700)
!106 = !DIEnumerator(name: "TypeFatalError", value: 705)
!107 = !DIEnumerator(name: "OptionFatalError", value: 710)
!108 = !DIEnumerator(name: "DelegateFatalError", value: 715)
!109 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720)
!110 = !DIEnumerator(name: "CorruptImageFatalError", value: 725)
!111 = !DIEnumerator(name: "FileOpenFatalError", value: 730)
!112 = !DIEnumerator(name: "BlobFatalError", value: 735)
!113 = !DIEnumerator(name: "StreamFatalError", value: 740)
!114 = !DIEnumerator(name: "CacheFatalError", value: 745)
!115 = !DIEnumerator(name: "CoderFatalError", value: 750)
!116 = !DIEnumerator(name: "FilterFatalError", value: 752)
!117 = !DIEnumerator(name: "ModuleFatalError", value: 755)
!118 = !DIEnumerator(name: "DrawFatalError", value: 760)
!119 = !DIEnumerator(name: "ImageFatalError", value: 765)
!120 = !DIEnumerator(name: "WandFatalError", value: 770)
!121 = !DIEnumerator(name: "RandomFatalError", value: 775)
!122 = !DIEnumerator(name: "XServerFatalError", value: 780)
!123 = !DIEnumerator(name: "MonitorFatalError", value: 785)
!124 = !DIEnumerator(name: "RegistryFatalError", value: 790)
!125 = !DIEnumerator(name: "ConfigureFatalError", value: 795)
!126 = !DIEnumerator(name: "PolicyFatalError", value: 799)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 46, baseType: !7, size: 32, elements: !129)
!128 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!130 = !DIEnumerator(name: "_ISupper", value: 256)
!131 = !DIEnumerator(name: "_ISlower", value: 512)
!132 = !DIEnumerator(name: "_ISalpha", value: 1024)
!133 = !DIEnumerator(name: "_ISdigit", value: 2048)
!134 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!135 = !DIEnumerator(name: "_ISspace", value: 8192)
!136 = !DIEnumerator(name: "_ISprint", value: 16384)
!137 = !DIEnumerator(name: "_ISgraph", value: 32768)
!138 = !DIEnumerator(name: "_ISblank", value: 1)
!139 = !DIEnumerator(name: "_IScntrl", value: 2)
!140 = !DIEnumerator(name: "_ISpunct", value: 4)
!141 = !DIEnumerator(name: "_ISalnum", value: 8)
!142 = !{!143, !172, !158, !153, !173, !178, !181, !150, !151, !182, !156, !184, !186, !188, !202, !203, !180, !204, !196}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLTreeInfo", file: !145, line: 29, baseType: !146)
!145 = !DIFile(filename: "apps/538.imagick_r/src/magick/xml-tree.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5e544995a74b1ca30ba5edadca4a5927")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XMLTreeInfo", file: !147, line: 75, size: 768, elements: !148)
!147 = !DIFile(filename: "apps/538.imagick_r/src/magick/xml-tree.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "21071739556752a89aac40182a991ff0")
!148 = !{!149, !152, !154, !155, !159, !160, !161, !162, !163, !164, !166, !171}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !146, file: !147, line: 78, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !146, file: !147, line: 79, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !146, file: !147, line: 80, baseType: !150, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !146, file: !147, line: 83, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 46, baseType: !158)
!157 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!158 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !146, file: !147, line: 86, baseType: !143, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !147, line: 87, baseType: !143, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !146, file: !147, line: 88, baseType: !143, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ordered", scope: !146, file: !147, line: 89, baseType: !143, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !146, file: !147, line: 90, baseType: !143, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !146, file: !147, line: 93, baseType: !165, size: 32, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !146, file: !147, line: 96, baseType: !167, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !169, line: 26, baseType: !170)
!169 = !DIFile(filename: "apps/538.imagick_r/src/magick/semaphore.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2aa908a2bf8f89cc488437590c0b4f4e")
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !169, line: 25, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !146, file: !147, line: 99, baseType: !156, size: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !174, line: 77, baseType: !175)
!174 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !176, line: 193, baseType: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!177 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !183)
!183 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !185)
!185 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLTreeRoot", file: !147, line: 103, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XMLTreeRoot", file: !147, line: 105, size: 1280, elements: !191)
!191 = !{!192, !193, !194, !195, !197, !198, !199, !200, !201}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !190, file: !147, line: 108, baseType: !146, size: 768)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !190, file: !147, line: 111, baseType: !143, size: 64, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "standalone", scope: !190, file: !147, line: 114, baseType: !165, size: 32, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "processing_instructions", scope: !190, file: !147, line: 117, baseType: !196, size: 64, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "entities", scope: !190, file: !147, line: 118, baseType: !153, size: 64, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !190, file: !147, line: 119, baseType: !196, size: 64, offset: 1024)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !190, file: !147, line: 122, baseType: !165, size: 32, offset: 1088)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !190, file: !147, line: 125, baseType: !167, size: 64, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !190, file: !147, line: 128, baseType: !156, size: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!203 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!204 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!205 = !{!206, !0}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "predefined_entities", scope: !208, file: !147, line: 2309, type: !214, isLocal: true, isDefinition: true)
!208 = distinct !DISubprogram(name: "NewXMLTreeTag", scope: !147, file: !147, line: 2306, type: !209, scopeLine: 2307, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{!143, !186}
!211 = !{!212, !213}
!212 = !DILocalVariable(name: "tag", arg: 1, scope: !208, file: !147, line: 2306, type: !186)
!213 = !DILocalVariable(name: "root", scope: !208, file: !147, line: 2316, type: !188)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 704, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 11)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 1)
!220 = !{i32 7, !"Dwarf Version", i32 5}
!221 = !{i32 2, !"Debug Info Version", i32 3}
!222 = !{i32 1, !"wchar_size", i32 4}
!223 = !{i32 7, !"PIC Level", i32 2}
!224 = !{i32 7, !"PIE Level", i32 2}
!225 = !{i32 7, !"uwtable", i32 2}
!226 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!227 = distinct !DISubprogram(name: "AddChildToXMLTree", scope: !147, file: !147, line: 165, type: !228, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !231)
!228 = !DISubroutineType(types: !229)
!229 = !{!143, !143, !186, !230}
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!231 = !{!232, !233, !234, !235}
!232 = !DILocalVariable(name: "xml_info", arg: 1, scope: !227, file: !147, line: 165, type: !143)
!233 = !DILocalVariable(name: "tag", arg: 2, scope: !227, file: !147, line: 166, type: !186)
!234 = !DILocalVariable(name: "offset", arg: 3, scope: !227, file: !147, line: 166, type: !230)
!235 = !DILocalVariable(name: "child", scope: !227, file: !147, line: 169, type: !143)
!236 = !DILocation(line: 0, scope: !227)
!237 = !DILocation(line: 171, column: 16, scope: !238)
!238 = distinct !DILexicalBlock(scope: !227, file: !147, line: 171, column: 7)
!239 = !DILocation(line: 171, column: 7, scope: !227)
!240 = !DILocation(line: 173, column: 25, scope: !227)
!241 = !DILocation(line: 174, column: 13, scope: !242)
!242 = distinct !DILexicalBlock(scope: !227, file: !147, line: 174, column: 7)
!243 = !DILocation(line: 174, column: 7, scope: !227)
!244 = !DILocation(line: 176, column: 10, scope: !227)
!245 = !DILocation(line: 177, column: 14, scope: !227)
!246 = !DILocation(line: 177, column: 13, scope: !227)
!247 = !{!248, !249, i64 0}
!248 = !{!"_XMLTreeInfo", !249, i64 0, !249, i64 8, !249, i64 16, !252, i64 24, !249, i64 32, !249, i64 40, !249, i64 48, !249, i64 56, !249, i64 64, !250, i64 72, !249, i64 80, !252, i64 88}
!249 = !{!"any pointer", !250, i64 0}
!250 = !{!"omnipotent char", !251, i64 0}
!251 = !{!"Simple C/C++ TBAA"}
!252 = !{!"long", !250, i64 0}
!253 = !DILocation(line: 178, column: 10, scope: !227)
!254 = !DILocation(line: 178, column: 20, scope: !227)
!255 = !{!248, !249, i64 8}
!256 = !DILocation(line: 179, column: 18, scope: !227)
!257 = !DILocation(line: 179, column: 10, scope: !227)
!258 = !DILocation(line: 179, column: 17, scope: !227)
!259 = !{!248, !249, i64 16}
!260 = !DILocation(line: 180, column: 16, scope: !227)
!261 = !DILocation(line: 180, column: 10, scope: !227)
!262 = !DILocation(line: 180, column: 15, scope: !227)
!263 = !{!248, !250, i64 72}
!264 = !DILocation(line: 181, column: 10, scope: !227)
!265 = !DILocation(line: 181, column: 19, scope: !227)
!266 = !{!248, !252, i64 88}
!267 = !DILocalVariable(name: "xml_info", arg: 1, scope: !268, file: !147, line: 1219, type: !143)
!268 = distinct !DISubprogram(name: "InsertTagIntoXMLTree", scope: !147, file: !147, line: 1219, type: !269, scopeLine: 1221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !271)
!269 = !DISubroutineType(types: !270)
!270 = !{!143, !143, !143, !230}
!271 = !{!267, !272, !273, !274, !275, !276}
!272 = !DILocalVariable(name: "child", arg: 2, scope: !268, file: !147, line: 1220, type: !143)
!273 = !DILocalVariable(name: "offset", arg: 3, scope: !268, file: !147, line: 1220, type: !230)
!274 = !DILocalVariable(name: "head", scope: !268, file: !147, line: 1223, type: !143)
!275 = !DILocalVariable(name: "node", scope: !268, file: !147, line: 1224, type: !143)
!276 = !DILocalVariable(name: "previous", scope: !268, file: !147, line: 1225, type: !143)
!277 = !DILocation(line: 0, scope: !268, inlinedAt: !278)
!278 = distinct !DILocation(line: 182, column: 10, scope: !227)
!279 = !DILocation(line: 1227, column: 10, scope: !268, inlinedAt: !278)
!280 = !DILocation(line: 1228, column: 10, scope: !268, inlinedAt: !278)
!281 = !DILocation(line: 1229, column: 10, scope: !268, inlinedAt: !278)
!282 = !DILocation(line: 1230, column: 10, scope: !268, inlinedAt: !278)
!283 = !DILocation(line: 1228, column: 17, scope: !268, inlinedAt: !278)
!284 = !DILocation(line: 1230, column: 16, scope: !268, inlinedAt: !278)
!285 = !{!248, !252, i64 24}
!286 = !DILocation(line: 1231, column: 10, scope: !268, inlinedAt: !278)
!287 = !DILocation(line: 1231, column: 16, scope: !268, inlinedAt: !278)
!288 = !{!248, !249, i64 32}
!289 = !DILocation(line: 1232, column: 17, scope: !290, inlinedAt: !278)
!290 = distinct !DILexicalBlock(scope: !268, file: !147, line: 1232, column: 7)
!291 = !{!248, !249, i64 64}
!292 = !DILocation(line: 1232, column: 23, scope: !290, inlinedAt: !278)
!293 = !DILocation(line: 1232, column: 7, scope: !268, inlinedAt: !278)
!294 = !DILocation(line: 1238, column: 13, scope: !295, inlinedAt: !278)
!295 = distinct !DILexicalBlock(scope: !268, file: !147, line: 1238, column: 7)
!296 = !DILocation(line: 1238, column: 20, scope: !295, inlinedAt: !278)
!297 = !DILocation(line: 1238, column: 7, scope: !268, inlinedAt: !278)
!298 = !DILocation(line: 0, scope: !299, inlinedAt: !278)
!299 = distinct !DILexicalBlock(scope: !295, file: !147, line: 1244, column: 5)
!300 = !DILocation(line: 1246, column: 21, scope: !299, inlinedAt: !278)
!301 = !{!248, !249, i64 56}
!302 = !DILocation(line: 1246, column: 29, scope: !299, inlinedAt: !278)
!303 = !DILocation(line: 1246, column: 54, scope: !299, inlinedAt: !278)
!304 = !DILocation(line: 1247, column: 30, scope: !299, inlinedAt: !278)
!305 = !DILocation(line: 1247, column: 37, scope: !299, inlinedAt: !278)
!306 = !DILocation(line: 1246, column: 7, scope: !299, inlinedAt: !278)
!307 = distinct !{!307, !306, !308, !309, !310}
!308 = !DILocation(line: 1248, column: 20, scope: !299, inlinedAt: !278)
!309 = !{!"llvm.loop.mustprogress"}
!310 = !{!"llvm.loop.unroll.disable"}
!311 = !DILocation(line: 0, scope: !295, inlinedAt: !278)
!312 = !{!249, !249, i64 0}
!313 = !DILocation(line: 1254, column: 58, scope: !268, inlinedAt: !278)
!314 = !DILocation(line: 1254, column: 45, scope: !268, inlinedAt: !278)
!315 = !DILocation(line: 1254, column: 74, scope: !268, inlinedAt: !278)
!316 = !DILocation(line: 1254, column: 3, scope: !268, inlinedAt: !278)
!317 = distinct !{!317, !316, !318, !309, !310}
!318 = !DILocation(line: 1258, column: 3, scope: !268, inlinedAt: !278)
!319 = !DILocation(line: 1257, column: 16, scope: !320, inlinedAt: !278)
!320 = distinct !DILexicalBlock(scope: !268, file: !147, line: 1255, column: 3)
!321 = !{!248, !249, i64 48}
!322 = !DILocation(line: 1254, column: 16, scope: !268, inlinedAt: !278)
!323 = !DILocation(line: 1254, column: 41, scope: !268, inlinedAt: !278)
!324 = !DILocation(line: 1259, column: 48, scope: !325, inlinedAt: !278)
!325 = distinct !DILexicalBlock(scope: !268, file: !147, line: 1259, column: 7)
!326 = !DILocation(line: 1259, column: 55, scope: !325, inlinedAt: !278)
!327 = !DILocation(line: 1259, column: 7, scope: !268, inlinedAt: !278)
!328 = !DILocation(line: 1261, column: 7, scope: !329, inlinedAt: !278)
!329 = distinct !DILexicalBlock(scope: !325, file: !147, line: 1260, column: 5)
!330 = !DILocation(line: 1261, column: 21, scope: !329, inlinedAt: !278)
!331 = !{!248, !249, i64 40}
!332 = !DILocation(line: 1261, column: 26, scope: !329, inlinedAt: !278)
!333 = !DILocation(line: 1261, column: 51, scope: !329, inlinedAt: !278)
!334 = !DILocation(line: 1262, column: 27, scope: !329, inlinedAt: !278)
!335 = !DILocation(line: 1262, column: 34, scope: !329, inlinedAt: !278)
!336 = distinct !{!336, !328, !337, !309, !310}
!337 = !DILocation(line: 1263, column: 20, scope: !329, inlinedAt: !278)
!338 = !DILocation(line: 1264, column: 18, scope: !329, inlinedAt: !278)
!339 = !DILocation(line: 1266, column: 5, scope: !329, inlinedAt: !278)
!340 = !DILocation(line: 1270, column: 33, scope: !341, inlinedAt: !278)
!341 = distinct !DILexicalBlock(scope: !342, file: !147, line: 1269, column: 11)
!342 = distinct !DILexicalBlock(scope: !325, file: !147, line: 1268, column: 5)
!343 = !DILocation(line: 1270, column: 19, scope: !341, inlinedAt: !278)
!344 = !DILocation(line: 1270, column: 26, scope: !341, inlinedAt: !278)
!345 = !DILocation(line: 1270, column: 9, scope: !341, inlinedAt: !278)
!346 = !DILocation(line: 1271, column: 18, scope: !342, inlinedAt: !278)
!347 = !DILocation(line: 1274, column: 7, scope: !342, inlinedAt: !278)
!348 = !DILocation(line: 1279, column: 21, scope: !342, inlinedAt: !278)
!349 = !DILocation(line: 1280, column: 11, scope: !342, inlinedAt: !278)
!350 = !DILocation(line: 1277, column: 20, scope: !351, inlinedAt: !278)
!351 = distinct !DILexicalBlock(scope: !342, file: !147, line: 1275, column: 7)
!352 = !DILocation(line: 1274, column: 20, scope: !342, inlinedAt: !278)
!353 = !DILocation(line: 1274, column: 45, scope: !342, inlinedAt: !278)
!354 = distinct !{!354, !347, !355, !309, !310}
!355 = !DILocation(line: 1278, column: 7, scope: !342, inlinedAt: !278)
!356 = !DILocation(line: 1274, column: 55, scope: !342, inlinedAt: !278)
!357 = !DILocation(line: 1274, column: 62, scope: !342, inlinedAt: !278)
!358 = !DILocation(line: 1281, column: 19, scope: !359, inlinedAt: !278)
!359 = distinct !DILexicalBlock(scope: !342, file: !147, line: 1280, column: 11)
!360 = !DILocation(line: 1281, column: 9, scope: !359, inlinedAt: !278)
!361 = !DILocation(line: 1284, column: 1, scope: !268, inlinedAt: !278)
!362 = !DILocation(line: 183, column: 1, scope: !227)
!363 = !DISubprogram(name: "AcquireMagickMemory", scope: !364, file: !364, line: 40, type: !365, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!364 = !DIFile(filename: "apps/538.imagick_r/src/magick/memory_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3e3188004f7f1dd341e651bacd9a624e")
!365 = !DISubroutineType(types: !366)
!366 = !{!172, !230}
!367 = !{}
!368 = !DISubprogram(name: "ResetMagickMemory", scope: !364, file: !364, line: 52, type: !369, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!369 = !DISubroutineType(types: !370)
!370 = !{!172, !172, !203, !230}
!371 = !DISubprogram(name: "ConstantString", scope: !372, file: !372, line: 45, type: !373, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!372 = !DIFile(filename: "apps/538.imagick_r/src/magick/string_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "53229bbaa0eccdd1667d55ca93211203")
!373 = !DISubroutineType(types: !374)
!374 = !{!150, !186}
!375 = !DISubprogram(name: "IsEventLogging", scope: !12, file: !12, line: 80, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!376 = !DISubroutineType(types: !377)
!377 = !{!165}
!378 = !DILocation(line: 0, scope: !268)
!379 = !DILocation(line: 1227, column: 10, scope: !268)
!380 = !DILocation(line: 1228, column: 10, scope: !268)
!381 = !DILocation(line: 1229, column: 10, scope: !268)
!382 = !DILocation(line: 1230, column: 10, scope: !268)
!383 = !DILocation(line: 1228, column: 17, scope: !268)
!384 = !DILocation(line: 1230, column: 16, scope: !268)
!385 = !DILocation(line: 1231, column: 10, scope: !268)
!386 = !DILocation(line: 1231, column: 16, scope: !268)
!387 = !DILocation(line: 1232, column: 17, scope: !290)
!388 = !DILocation(line: 1232, column: 23, scope: !290)
!389 = !DILocation(line: 1232, column: 7, scope: !268)
!390 = !DILocation(line: 1238, column: 13, scope: !295)
!391 = !DILocation(line: 1238, column: 20, scope: !295)
!392 = !DILocation(line: 1238, column: 7, scope: !268)
!393 = !DILocation(line: 0, scope: !299)
!394 = !DILocation(line: 1246, column: 21, scope: !299)
!395 = !DILocation(line: 1246, column: 29, scope: !299)
!396 = !DILocation(line: 1246, column: 54, scope: !299)
!397 = !DILocation(line: 1247, column: 30, scope: !299)
!398 = !DILocation(line: 1247, column: 37, scope: !299)
!399 = !DILocation(line: 1246, column: 7, scope: !299)
!400 = distinct !{!400, !399, !401, !309, !310}
!401 = !DILocation(line: 1248, column: 20, scope: !299)
!402 = !DILocation(line: 0, scope: !295)
!403 = !DILocation(line: 1254, column: 58, scope: !268)
!404 = !DILocation(line: 1254, column: 45, scope: !268)
!405 = !DILocation(line: 1254, column: 74, scope: !268)
!406 = !DILocation(line: 1254, column: 3, scope: !268)
!407 = distinct !{!407, !406, !408, !309, !310}
!408 = !DILocation(line: 1258, column: 3, scope: !268)
!409 = !DILocation(line: 1257, column: 16, scope: !320)
!410 = !DILocation(line: 1254, column: 16, scope: !268)
!411 = !DILocation(line: 1254, column: 41, scope: !268)
!412 = !DILocation(line: 1259, column: 48, scope: !325)
!413 = !DILocation(line: 1259, column: 55, scope: !325)
!414 = !DILocation(line: 1259, column: 7, scope: !268)
!415 = !DILocation(line: 1261, column: 21, scope: !329)
!416 = !DILocation(line: 1261, column: 26, scope: !329)
!417 = !DILocation(line: 1261, column: 51, scope: !329)
!418 = !DILocation(line: 1262, column: 27, scope: !329)
!419 = !DILocation(line: 1262, column: 34, scope: !329)
!420 = !DILocation(line: 1261, column: 7, scope: !329)
!421 = distinct !{!421, !420, !422, !309, !310}
!422 = !DILocation(line: 1263, column: 20, scope: !329)
!423 = !DILocation(line: 1264, column: 18, scope: !329)
!424 = !DILocation(line: 1266, column: 5, scope: !329)
!425 = !DILocation(line: 1269, column: 21, scope: !341)
!426 = !DILocation(line: 1269, column: 46, scope: !341)
!427 = !DILocation(line: 1270, column: 33, scope: !341)
!428 = !DILocation(line: 1270, column: 19, scope: !341)
!429 = !DILocation(line: 1270, column: 26, scope: !341)
!430 = !DILocation(line: 1270, column: 9, scope: !341)
!431 = !DILocation(line: 1271, column: 18, scope: !342)
!432 = !DILocation(line: 1274, column: 62, scope: !342)
!433 = !DILocation(line: 1274, column: 7, scope: !342)
!434 = !DILocation(line: 1277, column: 20, scope: !351)
!435 = !DILocation(line: 1274, column: 20, scope: !342)
!436 = !DILocation(line: 1274, column: 45, scope: !342)
!437 = distinct !{!437, !433, !438, !309, !310}
!438 = !DILocation(line: 1278, column: 7, scope: !342)
!439 = !DILocation(line: 1279, column: 21, scope: !342)
!440 = !DILocation(line: 1280, column: 11, scope: !342)
!441 = !DILocation(line: 1274, column: 55, scope: !342)
!442 = !DILocation(line: 1280, column: 20, scope: !359)
!443 = !DILocation(line: 1281, column: 19, scope: !359)
!444 = !DILocation(line: 1281, column: 9, scope: !359)
!445 = !DILocation(line: 1284, column: 1, scope: !268)
!446 = distinct !DISubprogram(name: "AddPathToXMLTree", scope: !147, file: !147, line: 213, type: !228, scopeLine: 215, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !447)
!447 = !{!448, !449, !450, !451, !452, !456, !457, !458, !459, !460, !461}
!448 = !DILocalVariable(name: "xml_info", arg: 1, scope: !446, file: !147, line: 213, type: !143)
!449 = !DILocalVariable(name: "path", arg: 2, scope: !446, file: !147, line: 214, type: !186)
!450 = !DILocalVariable(name: "offset", arg: 3, scope: !446, file: !147, line: 214, type: !230)
!451 = !DILocalVariable(name: "components", scope: !446, file: !147, line: 217, type: !153)
!452 = !DILocalVariable(name: "subnode", scope: !446, file: !147, line: 218, type: !453)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32768, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 4096)
!456 = !DILocalVariable(name: "tag", scope: !446, file: !147, line: 219, type: !453)
!457 = !DILocalVariable(name: "i", scope: !446, file: !147, line: 222, type: !173)
!458 = !DILocalVariable(name: "number_components", scope: !446, file: !147, line: 225, type: !156)
!459 = !DILocalVariable(name: "j", scope: !446, file: !147, line: 228, type: !173)
!460 = !DILocalVariable(name: "child", scope: !446, file: !147, line: 231, type: !143)
!461 = !DILocalVariable(name: "node", scope: !446, file: !147, line: 232, type: !143)
!462 = !DILocation(line: 0, scope: !446)
!463 = !DILocation(line: 216, column: 3, scope: !446)
!464 = !DILocation(line: 218, column: 5, scope: !446)
!465 = !DILocation(line: 219, column: 5, scope: !446)
!466 = !DILocation(line: 224, column: 3, scope: !446)
!467 = !DILocation(line: 237, column: 17, scope: !468)
!468 = distinct !DILexicalBlock(scope: !446, file: !147, line: 237, column: 7)
!469 = !DILocation(line: 237, column: 23, scope: !468)
!470 = !DILocation(line: 237, column: 7, scope: !446)
!471 = !DILocation(line: 238, column: 12, scope: !468)
!472 = !DILocation(line: 238, column: 5, scope: !468)
!473 = !DILocation(line: 240, column: 14, scope: !446)
!474 = !DILocation(line: 241, column: 18, scope: !475)
!475 = distinct !DILexicalBlock(scope: !446, file: !147, line: 241, column: 7)
!476 = !DILocation(line: 241, column: 7, scope: !446)
!477 = !DILocation(line: 243, column: 27, scope: !478)
!478 = distinct !DILexicalBlock(scope: !479, file: !147, line: 243, column: 3)
!479 = distinct !DILexicalBlock(scope: !446, file: !147, line: 243, column: 3)
!480 = !{!252, !252, i64 0}
!481 = !DILocation(line: 243, column: 15, scope: !478)
!482 = !DILocation(line: 243, column: 3, scope: !479)
!483 = !DILocation(line: 245, column: 22, scope: !484)
!484 = distinct !DILexicalBlock(scope: !478, file: !147, line: 244, column: 3)
!485 = !DILocation(line: 245, column: 5, scope: !484)
!486 = !DILocation(line: 246, column: 22, scope: !484)
!487 = !DILocation(line: 246, column: 5, scope: !484)
!488 = !DILocalVariable(name: "xml_info", arg: 1, scope: !489, file: !147, line: 919, type: !143)
!489 = distinct !DISubprogram(name: "GetXMLTreeChild", scope: !147, file: !147, line: 919, type: !490, scopeLine: 920, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{!143, !143, !186}
!492 = !{!488, !493, !494}
!493 = !DILocalVariable(name: "tag", arg: 2, scope: !489, file: !147, line: 919, type: !186)
!494 = !DILocalVariable(name: "child", scope: !489, file: !147, line: 922, type: !143)
!495 = !DILocation(line: 0, scope: !489, inlinedAt: !496)
!496 = distinct !DILocation(line: 247, column: 11, scope: !484)
!497 = !DILocation(line: 927, column: 17, scope: !498, inlinedAt: !496)
!498 = distinct !DILexicalBlock(scope: !489, file: !147, line: 927, column: 7)
!499 = !DILocation(line: 927, column: 23, scope: !498, inlinedAt: !496)
!500 = !DILocation(line: 927, column: 7, scope: !489, inlinedAt: !496)
!501 = !DILocation(line: 928, column: 12, scope: !498, inlinedAt: !496)
!502 = !DILocation(line: 928, column: 5, scope: !498, inlinedAt: !496)
!503 = !DILocation(line: 929, column: 19, scope: !489, inlinedAt: !496)
!504 = !DILocation(line: 930, column: 7, scope: !489, inlinedAt: !496)
!505 = !DILocation(line: 931, column: 62, scope: !506, inlinedAt: !496)
!506 = distinct !DILexicalBlock(scope: !489, file: !147, line: 930, column: 7)
!507 = !DILocation(line: 931, column: 48, scope: !506, inlinedAt: !496)
!508 = !DILocation(line: 931, column: 71, scope: !506, inlinedAt: !496)
!509 = !DILocation(line: 931, column: 5, scope: !506, inlinedAt: !496)
!510 = !DILocation(line: 932, column: 20, scope: !506, inlinedAt: !496)
!511 = !DILocation(line: 931, column: 19, scope: !506, inlinedAt: !496)
!512 = !DILocation(line: 931, column: 44, scope: !506, inlinedAt: !496)
!513 = !DILocation(line: 249, column: 13, scope: !514)
!514 = distinct !DILexicalBlock(scope: !484, file: !147, line: 248, column: 9)
!515 = !DILocation(line: 251, column: 14, scope: !516)
!516 = distinct !DILexicalBlock(scope: !484, file: !147, line: 251, column: 9)
!517 = !DILocation(line: 251, column: 9, scope: !484)
!518 = !DILocalVariable(name: "value", arg: 1, scope: !519, file: !520, line: 68, type: !523)
!519 = distinct !DISubprogram(name: "StringToLong", scope: !520, file: !520, line: 68, type: !521, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !524)
!520 = !DIFile(filename: "apps/538.imagick_r/src/magick/string-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "af275f9a9b26a4e8bc1a481724207dee")
!521 = !DISubroutineType(types: !522)
!522 = !{!177, !523}
!523 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !186)
!524 = !{!518}
!525 = !DILocation(line: 0, scope: !519, inlinedAt: !526)
!526 = distinct !DILocation(line: 253, column: 22, scope: !527)
!527 = distinct !DILexicalBlock(scope: !484, file: !147, line: 253, column: 5)
!528 = !DILocation(line: 70, column: 10, scope: !519, inlinedAt: !526)
!529 = !DILocation(line: 253, column: 10, scope: !527)
!530 = !DILocation(line: 0, scope: !484)
!531 = !DILocation(line: 0, scope: !527)
!532 = !DILocation(line: 253, column: 49, scope: !533)
!533 = distinct !DILexicalBlock(scope: !527, file: !147, line: 253, column: 5)
!534 = !DILocation(line: 253, column: 5, scope: !527)
!535 = !DILocalVariable(name: "xml_info", arg: 1, scope: !536, file: !147, line: 991, type: !143)
!536 = distinct !DISubprogram(name: "GetXMLTreeOrdered", scope: !147, file: !147, line: 991, type: !537, scopeLine: 992, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!143, !143}
!539 = !{!535}
!540 = !DILocation(line: 0, scope: !536, inlinedAt: !541)
!541 = distinct !DILocation(line: 255, column: 12, scope: !542)
!542 = distinct !DILexicalBlock(scope: !533, file: !147, line: 254, column: 5)
!543 = !DILocation(line: 996, column: 17, scope: !544, inlinedAt: !541)
!544 = distinct !DILexicalBlock(scope: !536, file: !147, line: 996, column: 7)
!545 = !DILocation(line: 996, column: 23, scope: !544, inlinedAt: !541)
!546 = !DILocation(line: 996, column: 7, scope: !536, inlinedAt: !541)
!547 = !DILocation(line: 997, column: 12, scope: !544, inlinedAt: !541)
!548 = !DILocation(line: 997, column: 5, scope: !544, inlinedAt: !541)
!549 = !DILocation(line: 998, column: 20, scope: !536, inlinedAt: !541)
!550 = !DILocation(line: 256, column: 16, scope: !551)
!551 = distinct !DILexicalBlock(scope: !542, file: !147, line: 256, column: 11)
!552 = !DILocation(line: 256, column: 11, scope: !542)
!553 = distinct !{!553, !534, !554, !309, !310}
!554 = !DILocation(line: 258, column: 5, scope: !527)
!555 = !DILocation(line: 261, column: 33, scope: !484)
!556 = !DILocation(line: 261, column: 19, scope: !484)
!557 = !DILocation(line: 261, column: 18, scope: !484)
!558 = !DILocation(line: 243, column: 47, scope: !478)
!559 = distinct !{!559, !482, !560, !309, !310}
!560 = !DILocation(line: 262, column: 3, scope: !479)
!561 = !DILocation(line: 263, column: 25, scope: !562)
!562 = distinct !DILexicalBlock(scope: !563, file: !147, line: 263, column: 3)
!563 = distinct !DILexicalBlock(scope: !446, file: !147, line: 263, column: 3)
!564 = !DILocation(line: 263, column: 13, scope: !562)
!565 = !DILocation(line: 263, column: 3, scope: !563)
!566 = !DILocation(line: 264, column: 33, scope: !562)
!567 = !DILocation(line: 264, column: 19, scope: !562)
!568 = !DILocation(line: 264, column: 18, scope: !562)
!569 = !DILocation(line: 263, column: 45, scope: !562)
!570 = distinct !{!570, !565, !571, !309, !310}
!571 = !DILocation(line: 264, column: 46, scope: !563)
!572 = !DILocation(line: 265, column: 24, scope: !446)
!573 = !DILocation(line: 266, column: 3, scope: !446)
!574 = !DILocation(line: 267, column: 1, scope: !446)
!575 = !DISubprogram(name: "LogMagickEvent", scope: !12, file: !12, line: 83, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!576 = !DISubroutineType(types: !577)
!577 = !{!165, !578, !186, !186, !230, !186, null}
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogEventType", file: !12, line: 58, baseType: !11)
!580 = !DISubprogram(name: "GetPathComponents", scope: !37, file: !37, line: 40, type: !581, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!581 = !DISubroutineType(types: !582)
!582 = !{!153, !186, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!584 = !DISubprogram(name: "GetPathComponent", scope: !37, file: !37, line: 68, type: !585, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !186, !587, !150}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathType", file: !37, line: 36, baseType: !36)
!588 = !DILocation(line: 0, scope: !489)
!589 = !DILocation(line: 927, column: 17, scope: !498)
!590 = !DILocation(line: 927, column: 23, scope: !498)
!591 = !DILocation(line: 927, column: 7, scope: !489)
!592 = !DILocation(line: 928, column: 12, scope: !498)
!593 = !DILocation(line: 928, column: 5, scope: !498)
!594 = !DILocation(line: 929, column: 19, scope: !489)
!595 = !DILocation(line: 930, column: 11, scope: !506)
!596 = !DILocation(line: 930, column: 7, scope: !489)
!597 = !DILocation(line: 931, column: 62, scope: !506)
!598 = !DILocation(line: 931, column: 48, scope: !506)
!599 = !DILocation(line: 931, column: 71, scope: !506)
!600 = !DILocation(line: 931, column: 5, scope: !506)
!601 = !DILocation(line: 932, column: 20, scope: !506)
!602 = !DILocation(line: 931, column: 19, scope: !506)
!603 = !DILocation(line: 931, column: 44, scope: !506)
!604 = !DILocation(line: 933, column: 3, scope: !489)
!605 = !DILocation(line: 0, scope: !536)
!606 = !DILocation(line: 996, column: 17, scope: !544)
!607 = !DILocation(line: 996, column: 23, scope: !544)
!608 = !DILocation(line: 996, column: 7, scope: !536)
!609 = !DILocation(line: 997, column: 12, scope: !544)
!610 = !DILocation(line: 997, column: 5, scope: !544)
!611 = !DILocation(line: 998, column: 20, scope: !536)
!612 = !DILocation(line: 998, column: 3, scope: !536)
!613 = !DISubprogram(name: "DestroyString", scope: !372, file: !372, line: 46, type: !614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!614 = !DISubroutineType(types: !615)
!615 = !{!150, !150}
!616 = !DISubprogram(name: "RelinquishMagickMemory", scope: !364, file: !364, line: 51, type: !617, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!617 = !DISubroutineType(types: !618)
!618 = !{!172, !172}
!619 = distinct !DISubprogram(name: "CanonicalXMLContent", scope: !147, file: !147, line: 298, type: !620, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !623)
!620 = !DISubroutineType(types: !621)
!621 = !{!150, !186, !622}
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632}
!624 = !DILocalVariable(name: "content", arg: 1, scope: !619, file: !147, line: 298, type: !186)
!625 = !DILocalVariable(name: "pedantic", arg: 2, scope: !619, file: !147, line: 299, type: !622)
!626 = !DILocalVariable(name: "base64", scope: !619, file: !147, line: 302, type: !150)
!627 = !DILocalVariable(name: "canonical_content", scope: !619, file: !147, line: 303, type: !150)
!628 = !DILocalVariable(name: "p", scope: !619, file: !147, line: 306, type: !178)
!629 = !DILocalVariable(name: "i", scope: !619, file: !147, line: 309, type: !173)
!630 = !DILocalVariable(name: "extent", scope: !619, file: !147, line: 312, type: !156)
!631 = !DILocalVariable(name: "length", scope: !619, file: !147, line: 313, type: !156)
!632 = !DILocalVariable(name: "utf8", scope: !619, file: !147, line: 316, type: !181)
!633 = !DILocation(line: 0, scope: !619)
!634 = !DILocation(line: 301, column: 3, scope: !619)
!635 = !DILocation(line: 311, column: 3, scope: !619)
!636 = !DILocalVariable(name: "content", arg: 1, scope: !637, file: !638, line: 51, type: !178)
!637 = distinct !DISubprogram(name: "ConvertLatin1ToUTF8", scope: !638, file: !638, line: 51, type: !639, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !641)
!638 = !DIFile(filename: "apps/538.imagick_r/src/magick/token-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a46756b24cd287baa0681a9d976f3bd8")
!639 = !DISubroutineType(types: !640)
!640 = !{!181, !178}
!641 = !{!636, !642, !643, !644, !645, !646}
!642 = !DILocalVariable(name: "p", scope: !637, file: !638, line: 54, type: !178)
!643 = !DILocalVariable(name: "q", scope: !637, file: !638, line: 57, type: !181)
!644 = !DILocalVariable(name: "length", scope: !637, file: !638, line: 60, type: !156)
!645 = !DILocalVariable(name: "utf8", scope: !637, file: !638, line: 63, type: !181)
!646 = !DILocalVariable(name: "c", scope: !637, file: !638, line: 66, type: !7)
!647 = !DILocation(line: 0, scope: !637, inlinedAt: !648)
!648 = distinct !DILocation(line: 318, column: 8, scope: !619)
!649 = !DILocation(line: 69, column: 19, scope: !650, inlinedAt: !648)
!650 = distinct !DILexicalBlock(scope: !651, file: !638, line: 69, column: 3)
!651 = distinct !DILexicalBlock(scope: !637, file: !638, line: 69, column: 3)
!652 = !{!250, !250, i64 0}
!653 = !DILocation(line: 69, column: 22, scope: !650, inlinedAt: !648)
!654 = !DILocation(line: 69, column: 3, scope: !651, inlinedAt: !648)
!655 = !DILocation(line: 70, column: 25, scope: !650, inlinedAt: !648)
!656 = !DILocation(line: 70, column: 13, scope: !650, inlinedAt: !648)
!657 = !DILocation(line: 70, column: 11, scope: !650, inlinedAt: !648)
!658 = !DILocation(line: 69, column: 32, scope: !650, inlinedAt: !648)
!659 = distinct !{!659, !654, !660, !309, !310}
!660 = !DILocation(line: 70, column: 36, scope: !651, inlinedAt: !648)
!661 = !DILocation(line: 72, column: 15, scope: !662, inlinedAt: !648)
!662 = distinct !DILexicalBlock(scope: !637, file: !638, line: 72, column: 7)
!663 = !DILocation(line: 72, column: 7, scope: !637, inlinedAt: !648)
!664 = !DILocation(line: 73, column: 55, scope: !662, inlinedAt: !648)
!665 = !DILocation(line: 73, column: 28, scope: !662, inlinedAt: !648)
!666 = !DILocation(line: 74, column: 12, scope: !667, inlinedAt: !648)
!667 = distinct !DILexicalBlock(scope: !637, file: !638, line: 74, column: 7)
!668 = !DILocation(line: 74, column: 7, scope: !637, inlinedAt: !648)
!669 = !DILocation(line: 77, column: 19, scope: !670, inlinedAt: !648)
!670 = distinct !DILexicalBlock(scope: !671, file: !638, line: 77, column: 3)
!671 = distinct !DILexicalBlock(scope: !637, file: !638, line: 77, column: 3)
!672 = !DILocation(line: 77, column: 22, scope: !670, inlinedAt: !648)
!673 = !DILocation(line: 77, column: 3, scope: !671, inlinedAt: !648)
!674 = !DILocation(line: 80, column: 20, scope: !675, inlinedAt: !648)
!675 = distinct !DILexicalBlock(scope: !676, file: !638, line: 80, column: 9)
!676 = distinct !DILexicalBlock(scope: !670, file: !638, line: 78, column: 3)
!677 = !DILocation(line: 80, column: 9, scope: !676, inlinedAt: !648)
!678 = !DILocation(line: 81, column: 9, scope: !675, inlinedAt: !648)
!679 = !DILocation(line: 81, column: 11, scope: !675, inlinedAt: !648)
!680 = !DILocation(line: 81, column: 7, scope: !675, inlinedAt: !648)
!681 = !DILocation(line: 84, column: 25, scope: !682, inlinedAt: !648)
!682 = distinct !DILexicalBlock(scope: !675, file: !638, line: 83, column: 7)
!683 = !DILocation(line: 84, column: 19, scope: !682, inlinedAt: !648)
!684 = !DILocation(line: 84, column: 11, scope: !682, inlinedAt: !648)
!685 = !DILocation(line: 84, column: 13, scope: !682, inlinedAt: !648)
!686 = !DILocation(line: 85, column: 24, scope: !682, inlinedAt: !648)
!687 = !DILocation(line: 85, column: 19, scope: !682, inlinedAt: !648)
!688 = !DILocation(line: 85, column: 11, scope: !682, inlinedAt: !648)
!689 = !DILocation(line: 85, column: 13, scope: !682, inlinedAt: !648)
!690 = !DILocation(line: 0, scope: !675, inlinedAt: !648)
!691 = !DILocation(line: 77, column: 32, scope: !670, inlinedAt: !648)
!692 = distinct !{!692, !673, !693, !309, !310}
!693 = !DILocation(line: 87, column: 3, scope: !671, inlinedAt: !648)
!694 = !DILocation(line: 88, column: 5, scope: !637, inlinedAt: !648)
!695 = !DILocation(line: 321, column: 16, scope: !696)
!696 = distinct !DILexicalBlock(scope: !697, file: !147, line: 321, column: 3)
!697 = distinct !DILexicalBlock(scope: !619, file: !147, line: 321, column: 3)
!698 = !DILocation(line: 321, column: 19, scope: !696)
!699 = !DILocation(line: 321, column: 3, scope: !697)
!700 = !DILocation(line: 322, column: 13, scope: !701)
!701 = distinct !DILexicalBlock(scope: !696, file: !147, line: 322, column: 9)
!702 = !DILocation(line: 322, column: 21, scope: !701)
!703 = !DILocation(line: 321, column: 29, scope: !696)
!704 = distinct !{!704, !699, !705, !309, !310}
!705 = !DILocation(line: 323, column: 7, scope: !697)
!706 = !DILocation(line: 329, column: 32, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !147, line: 325, column: 5)
!708 = distinct !DILexicalBlock(scope: !619, file: !147, line: 324, column: 7)
!709 = !DILocation(line: 329, column: 14, scope: !707)
!710 = !DILocation(line: 330, column: 30, scope: !707)
!711 = !DILocation(line: 331, column: 18, scope: !712)
!712 = distinct !DILexicalBlock(scope: !707, file: !147, line: 331, column: 11)
!713 = !DILocation(line: 331, column: 11, scope: !707)
!714 = !DILocation(line: 333, column: 25, scope: !707)
!715 = !DILocation(line: 333, column: 24, scope: !707)
!716 = !DILocation(line: 334, column: 14, scope: !707)
!717 = !DILocation(line: 335, column: 14, scope: !707)
!718 = !DILocation(line: 336, column: 14, scope: !707)
!719 = !DILocation(line: 337, column: 14, scope: !707)
!720 = !DILocation(line: 337, column: 7, scope: !707)
!721 = !DILocation(line: 343, column: 21, scope: !619)
!722 = !DILocation(line: 343, column: 20, scope: !619)
!723 = !DILocation(line: 345, column: 16, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !147, line: 345, column: 3)
!725 = distinct !DILexicalBlock(scope: !619, file: !147, line: 345, column: 3)
!726 = !DILocation(line: 345, column: 19, scope: !724)
!727 = !DILocation(line: 345, column: 3, scope: !725)
!728 = !DILocation(line: 347, column: 11, scope: !729)
!729 = distinct !DILexicalBlock(scope: !730, file: !147, line: 347, column: 9)
!730 = distinct !DILexicalBlock(scope: !724, file: !147, line: 346, column: 3)
!731 = !DILocation(line: 347, column: 27, scope: !729)
!732 = !DILocation(line: 347, column: 9, scope: !730)
!733 = !DILocation(line: 349, column: 15, scope: !734)
!734 = distinct !DILexicalBlock(scope: !729, file: !147, line: 348, column: 7)
!735 = !DILocation(line: 350, column: 56, scope: !734)
!736 = !DILocation(line: 350, column: 36, scope: !734)
!737 = !DILocation(line: 350, column: 26, scope: !734)
!738 = !DILocation(line: 352, column: 31, scope: !739)
!739 = distinct !DILexicalBlock(scope: !734, file: !147, line: 352, column: 13)
!740 = !DILocation(line: 352, column: 13, scope: !734)
!741 = !DILocation(line: 355, column: 13, scope: !730)
!742 = !DILocation(line: 355, column: 5, scope: !730)
!743 = !DILocation(line: 359, column: 31, scope: !744)
!744 = distinct !DILexicalBlock(scope: !745, file: !147, line: 358, column: 7)
!745 = distinct !DILexicalBlock(scope: !730, file: !147, line: 356, column: 5)
!746 = !DILocation(line: 359, column: 48, scope: !744)
!747 = !DILocation(line: 359, column: 12, scope: !744)
!748 = !DILocation(line: 359, column: 10, scope: !744)
!749 = !DILocation(line: 360, column: 9, scope: !744)
!750 = !DILocation(line: 364, column: 31, scope: !751)
!751 = distinct !DILexicalBlock(scope: !745, file: !147, line: 363, column: 7)
!752 = !DILocation(line: 364, column: 48, scope: !751)
!753 = !DILocation(line: 364, column: 12, scope: !751)
!754 = !DILocation(line: 364, column: 10, scope: !751)
!755 = !DILocation(line: 365, column: 9, scope: !751)
!756 = !DILocation(line: 369, column: 31, scope: !757)
!757 = distinct !DILexicalBlock(scope: !745, file: !147, line: 368, column: 7)
!758 = !DILocation(line: 369, column: 48, scope: !757)
!759 = !DILocation(line: 369, column: 12, scope: !757)
!760 = !DILocation(line: 369, column: 10, scope: !757)
!761 = !DILocation(line: 370, column: 9, scope: !757)
!762 = !DILocation(line: 374, column: 31, scope: !763)
!763 = distinct !DILexicalBlock(scope: !745, file: !147, line: 373, column: 7)
!764 = !DILocation(line: 374, column: 48, scope: !763)
!765 = !DILocation(line: 374, column: 12, scope: !763)
!766 = !DILocation(line: 374, column: 10, scope: !763)
!767 = !DILocation(line: 375, column: 9, scope: !763)
!768 = !DILocation(line: 0, scope: !769)
!769 = distinct !DILexicalBlock(scope: !745, file: !147, line: 378, column: 7)
!770 = !DILocation(line: 379, column: 13, scope: !769)
!771 = !DILocation(line: 381, column: 32, scope: !772)
!772 = distinct !DILexicalBlock(scope: !773, file: !147, line: 380, column: 11)
!773 = distinct !DILexicalBlock(scope: !769, file: !147, line: 379, column: 13)
!774 = !DILocation(line: 381, column: 13, scope: !772)
!775 = !DILocation(line: 381, column: 35, scope: !772)
!776 = !DILocation(line: 382, column: 13, scope: !772)
!777 = !DILocation(line: 384, column: 48, scope: !769)
!778 = !DILocation(line: 384, column: 12, scope: !769)
!779 = !DILocation(line: 384, column: 10, scope: !769)
!780 = !DILocation(line: 385, column: 9, scope: !769)
!781 = !DILocation(line: 0, scope: !782)
!782 = distinct !DILexicalBlock(scope: !745, file: !147, line: 388, column: 7)
!783 = !DILocation(line: 389, column: 13, scope: !782)
!784 = !DILocation(line: 391, column: 32, scope: !785)
!785 = distinct !DILexicalBlock(scope: !786, file: !147, line: 390, column: 11)
!786 = distinct !DILexicalBlock(scope: !782, file: !147, line: 389, column: 13)
!787 = !DILocation(line: 391, column: 13, scope: !785)
!788 = !DILocation(line: 391, column: 35, scope: !785)
!789 = !DILocation(line: 392, column: 13, scope: !785)
!790 = !DILocation(line: 394, column: 48, scope: !782)
!791 = !DILocation(line: 394, column: 12, scope: !782)
!792 = !DILocation(line: 394, column: 10, scope: !782)
!793 = !DILocation(line: 395, column: 9, scope: !782)
!794 = !DILocation(line: 399, column: 31, scope: !795)
!795 = distinct !DILexicalBlock(scope: !745, file: !147, line: 398, column: 7)
!796 = !DILocation(line: 399, column: 48, scope: !795)
!797 = !DILocation(line: 399, column: 12, scope: !795)
!798 = !DILocation(line: 399, column: 10, scope: !795)
!799 = !DILocation(line: 400, column: 9, scope: !795)
!800 = !DILocation(line: 404, column: 9, scope: !801)
!801 = distinct !DILexicalBlock(scope: !745, file: !147, line: 403, column: 7)
!802 = !DILocation(line: 404, column: 28, scope: !801)
!803 = !DILocation(line: 404, column: 31, scope: !801)
!804 = !DILocation(line: 405, column: 9, scope: !801)
!805 = !DILocation(line: 0, scope: !745)
!806 = !DILocation(line: 345, column: 29, scope: !724)
!807 = distinct !{!807, !727, !808, !309, !310}
!808 = !DILocation(line: 408, column: 3, scope: !725)
!809 = !DILocation(line: 409, column: 3, scope: !619)
!810 = !DILocation(line: 409, column: 23, scope: !619)
!811 = !DILocation(line: 410, column: 26, scope: !619)
!812 = !DILocation(line: 411, column: 10, scope: !619)
!813 = !DILocation(line: 411, column: 3, scope: !619)
!814 = !DILocation(line: 412, column: 1, scope: !619)
!815 = !DISubprogram(name: "Base64Encode", scope: !37, file: !37, line: 39, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!816 = !DISubroutineType(types: !817)
!817 = !{!150, !178, !230, !583}
!818 = !DISubprogram(name: "AcquireString", scope: !372, file: !372, line: 43, type: !373, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!819 = !DISubprogram(name: "ConcatenateString", scope: !372, file: !372, line: 70, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!820 = !DISubroutineType(types: !821)
!821 = !{!165, !153, !186}
!822 = !DISubprogram(name: "ResizeQuantumMemory", scope: !364, file: !364, line: 55, type: !823, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!823 = !DISubroutineType(types: !824)
!824 = !{!172, !172, !230, !230}
!825 = !DISubprogram(name: "FormatLocaleString", scope: !826, file: !826, line: 71, type: !827, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!826 = !DIFile(filename: "apps/538.imagick_r/src/magick/locale_.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "156c27c5fb4b55284e5f6c924766571a")
!827 = !DISubroutineType(types: !828)
!828 = !{!173, !829, !230, !523, null}
!829 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !150)
!830 = distinct !DISubprogram(name: "DestroyXMLTree", scope: !147, file: !147, line: 570, type: !537, scopeLine: 571, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !831)
!831 = !{!832}
!832 = !DILocalVariable(name: "xml_info", arg: 1, scope: !830, file: !147, line: 570, type: !143)
!833 = !DILocation(line: 0, scope: !830)
!834 = !DILocation(line: 575, column: 17, scope: !835)
!835 = distinct !DILexicalBlock(scope: !830, file: !147, line: 575, column: 7)
!836 = !DILocation(line: 575, column: 23, scope: !835)
!837 = !DILocation(line: 575, column: 7, scope: !830)
!838 = !DILocation(line: 576, column: 12, scope: !835)
!839 = !DILocation(line: 576, column: 5, scope: !835)
!840 = !DILocalVariable(name: "xml_info", arg: 1, scope: !841, file: !147, line: 461, type: !143)
!841 = distinct !DISubprogram(name: "DestroyXMLTreeChild", scope: !147, file: !147, line: 461, type: !842, scopeLine: 462, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !844)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !143}
!844 = !{!840, !845, !846}
!845 = !DILocalVariable(name: "node", scope: !841, file: !147, line: 464, type: !143)
!846 = !DILocalVariable(name: "prev", scope: !841, file: !147, line: 465, type: !143)
!847 = !DILocation(line: 0, scope: !841, inlinedAt: !848)
!848 = distinct !DILocation(line: 577, column: 3, scope: !830)
!849 = !DILocation(line: 467, column: 18, scope: !841, inlinedAt: !848)
!850 = !DILocation(line: 468, column: 14, scope: !841, inlinedAt: !848)
!851 = !DILocation(line: 468, column: 3, scope: !841, inlinedAt: !848)
!852 = !DILocation(line: 0, scope: !853, inlinedAt: !848)
!853 = distinct !DILexicalBlock(scope: !841, file: !147, line: 469, column: 3)
!854 = !DILocation(line: 471, column: 17, scope: !853, inlinedAt: !848)
!855 = !DILocation(line: 471, column: 23, scope: !853, inlinedAt: !848)
!856 = !DILocation(line: 471, column: 5, scope: !853, inlinedAt: !848)
!857 = distinct !{!857, !856, !858, !309, !310}
!858 = !DILocation(line: 475, column: 5, scope: !853, inlinedAt: !848)
!859 = !DILocation(line: 476, column: 12, scope: !853, inlinedAt: !848)
!860 = !DILocation(line: 477, column: 9, scope: !853, inlinedAt: !848)
!861 = !DILocation(line: 478, column: 13, scope: !862, inlinedAt: !848)
!862 = distinct !DILexicalBlock(scope: !853, file: !147, line: 477, column: 9)
!863 = !DILocation(line: 478, column: 18, scope: !862, inlinedAt: !848)
!864 = !DILocation(line: 481, column: 18, scope: !841, inlinedAt: !848)
!865 = !DILocalVariable(name: "xml_info", arg: 1, scope: !866, file: !147, line: 484, type: !143)
!866 = distinct !DISubprogram(name: "DestroyXMLTreeOrdered", scope: !147, file: !147, line: 484, type: !842, scopeLine: 485, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !867)
!867 = !{!865, !868, !869}
!868 = !DILocalVariable(name: "node", scope: !866, file: !147, line: 487, type: !143)
!869 = !DILocalVariable(name: "prev", scope: !866, file: !147, line: 488, type: !143)
!870 = !DILocation(line: 0, scope: !866, inlinedAt: !871)
!871 = distinct !DILocation(line: 578, column: 3, scope: !830)
!872 = !DILocation(line: 490, column: 18, scope: !866, inlinedAt: !871)
!873 = !DILocation(line: 491, column: 14, scope: !866, inlinedAt: !871)
!874 = !DILocation(line: 491, column: 3, scope: !866, inlinedAt: !871)
!875 = !DILocation(line: 0, scope: !876, inlinedAt: !871)
!876 = distinct !DILexicalBlock(scope: !866, file: !147, line: 492, column: 3)
!877 = !DILocation(line: 494, column: 17, scope: !876, inlinedAt: !871)
!878 = !DILocation(line: 494, column: 25, scope: !876, inlinedAt: !871)
!879 = !DILocation(line: 494, column: 5, scope: !876, inlinedAt: !871)
!880 = distinct !{!880, !879, !881, !309, !310}
!881 = !DILocation(line: 498, column: 5, scope: !876, inlinedAt: !871)
!882 = !DILocation(line: 499, column: 12, scope: !876, inlinedAt: !871)
!883 = !DILocation(line: 500, column: 9, scope: !876, inlinedAt: !871)
!884 = !DILocation(line: 501, column: 13, scope: !885, inlinedAt: !871)
!885 = distinct !DILexicalBlock(scope: !876, file: !147, line: 500, column: 9)
!886 = !DILocation(line: 501, column: 20, scope: !885, inlinedAt: !871)
!887 = !DILocation(line: 504, column: 20, scope: !866, inlinedAt: !871)
!888 = !DILocalVariable(name: "xml_info", arg: 1, scope: !889, file: !147, line: 507, type: !143)
!889 = distinct !DISubprogram(name: "DestroyXMLTreeRoot", scope: !147, file: !147, line: 507, type: !842, scopeLine: 508, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !890)
!890 = !{!888, !891, !892, !893, !894}
!891 = !DILocalVariable(name: "attributes", scope: !889, file: !147, line: 510, type: !153)
!892 = !DILocalVariable(name: "i", scope: !889, file: !147, line: 513, type: !173)
!893 = !DILocalVariable(name: "j", scope: !889, file: !147, line: 516, type: !173)
!894 = !DILocalVariable(name: "root", scope: !889, file: !147, line: 519, type: !188)
!895 = !DILocation(line: 0, scope: !889, inlinedAt: !896)
!896 = distinct !DILocation(line: 579, column: 3, scope: !830)
!897 = !DILocation(line: 524, column: 17, scope: !898, inlinedAt: !896)
!898 = distinct !DILexicalBlock(scope: !889, file: !147, line: 524, column: 7)
!899 = !DILocation(line: 524, column: 23, scope: !898, inlinedAt: !896)
!900 = !DILocation(line: 524, column: 7, scope: !889, inlinedAt: !896)
!901 = !DILocation(line: 525, column: 12, scope: !898, inlinedAt: !896)
!902 = !DILocation(line: 525, column: 5, scope: !898, inlinedAt: !896)
!903 = !DILocation(line: 526, column: 17, scope: !904, inlinedAt: !896)
!904 = distinct !DILexicalBlock(scope: !889, file: !147, line: 526, column: 7)
!905 = !DILocation(line: 526, column: 24, scope: !904, inlinedAt: !896)
!906 = !DILocation(line: 526, column: 7, scope: !889, inlinedAt: !896)
!907 = !DILocation(line: 532, column: 42, scope: !908, inlinedAt: !896)
!908 = distinct !DILexicalBlock(scope: !909, file: !147, line: 532, column: 3)
!909 = distinct !DILexicalBlock(scope: !889, file: !147, line: 532, column: 3)
!910 = !{!911, !249, i64 120}
!911 = !{!"_XMLTreeRoot", !248, i64 0, !249, i64 96, !250, i64 104, !249, i64 112, !249, i64 120, !249, i64 128, !250, i64 136, !249, i64 144, !252, i64 152}
!912 = !DILocation(line: 532, column: 36, scope: !908, inlinedAt: !896)
!913 = !DILocation(line: 532, column: 54, scope: !908, inlinedAt: !896)
!914 = !DILocation(line: 532, column: 3, scope: !909, inlinedAt: !896)
!915 = !DILocation(line: 533, column: 55, scope: !908, inlinedAt: !896)
!916 = !DILocation(line: 533, column: 39, scope: !908, inlinedAt: !896)
!917 = !DILocation(line: 533, column: 25, scope: !908, inlinedAt: !896)
!918 = !DILocation(line: 533, column: 11, scope: !908, inlinedAt: !896)
!919 = !DILocation(line: 533, column: 5, scope: !908, inlinedAt: !896)
!920 = !DILocation(line: 533, column: 24, scope: !908, inlinedAt: !896)
!921 = !DILocation(line: 532, column: 73, scope: !908, inlinedAt: !896)
!922 = distinct !{!922, !914, !923, !309, !310}
!923 = !DILocation(line: 533, column: 58, scope: !909, inlinedAt: !896)
!924 = !DILocation(line: 534, column: 28, scope: !889, inlinedAt: !896)
!925 = !DILocation(line: 534, column: 17, scope: !889, inlinedAt: !896)
!926 = !DILocation(line: 535, column: 19, scope: !927, inlinedAt: !896)
!927 = distinct !DILexicalBlock(scope: !928, file: !147, line: 535, column: 3)
!928 = distinct !DILexicalBlock(scope: !889, file: !147, line: 535, column: 3)
!929 = !{!911, !249, i64 128}
!930 = !DILocation(line: 535, column: 13, scope: !927, inlinedAt: !896)
!931 = !DILocation(line: 535, column: 33, scope: !927, inlinedAt: !896)
!932 = !DILocation(line: 535, column: 3, scope: !928, inlinedAt: !896)
!933 = !DILocation(line: 538, column: 9, scope: !934, inlinedAt: !896)
!934 = distinct !DILexicalBlock(scope: !935, file: !147, line: 538, column: 9)
!935 = distinct !DILexicalBlock(scope: !927, file: !147, line: 536, column: 3)
!936 = !DILocation(line: 538, column: 23, scope: !934, inlinedAt: !896)
!937 = !DILocation(line: 538, column: 9, scope: !935, inlinedAt: !896)
!938 = !DILocation(line: 539, column: 21, scope: !934, inlinedAt: !896)
!939 = !DILocation(line: 539, column: 20, scope: !934, inlinedAt: !896)
!940 = !DILocation(line: 539, column: 7, scope: !934, inlinedAt: !896)
!941 = !DILocation(line: 540, column: 15, scope: !942, inlinedAt: !896)
!942 = distinct !DILexicalBlock(scope: !943, file: !147, line: 540, column: 5)
!943 = distinct !DILexicalBlock(scope: !935, file: !147, line: 540, column: 5)
!944 = !DILocation(line: 540, column: 29, scope: !942, inlinedAt: !896)
!945 = !DILocation(line: 540, column: 5, scope: !943, inlinedAt: !896)
!946 = !DILocation(line: 543, column: 23, scope: !947, inlinedAt: !896)
!947 = distinct !DILexicalBlock(scope: !948, file: !147, line: 542, column: 11)
!948 = distinct !DILexicalBlock(scope: !942, file: !147, line: 541, column: 5)
!949 = !DILocation(line: 543, column: 22, scope: !947, inlinedAt: !896)
!950 = !DILocation(line: 544, column: 23, scope: !951, inlinedAt: !896)
!951 = distinct !DILexicalBlock(scope: !948, file: !147, line: 544, column: 11)
!952 = !DILocation(line: 544, column: 11, scope: !951, inlinedAt: !896)
!953 = !DILocation(line: 544, column: 27, scope: !951, inlinedAt: !896)
!954 = !DILocation(line: 544, column: 11, scope: !948, inlinedAt: !896)
!955 = !DILocation(line: 545, column: 25, scope: !951, inlinedAt: !896)
!956 = !DILocation(line: 545, column: 24, scope: !951, inlinedAt: !896)
!957 = !DILocation(line: 545, column: 9, scope: !951, inlinedAt: !896)
!958 = !DILocation(line: 546, column: 23, scope: !959, inlinedAt: !896)
!959 = distinct !DILexicalBlock(scope: !948, file: !147, line: 546, column: 11)
!960 = !DILocation(line: 546, column: 11, scope: !959, inlinedAt: !896)
!961 = !DILocation(line: 546, column: 27, scope: !959, inlinedAt: !896)
!962 = !DILocation(line: 546, column: 11, scope: !948, inlinedAt: !896)
!963 = !DILocation(line: 547, column: 25, scope: !959, inlinedAt: !896)
!964 = !DILocation(line: 547, column: 24, scope: !959, inlinedAt: !896)
!965 = !DILocation(line: 547, column: 9, scope: !959, inlinedAt: !896)
!966 = !DILocation(line: 540, column: 48, scope: !942, inlinedAt: !896)
!967 = distinct !{!967, !945, !968, !309, !310}
!968 = !DILocation(line: 548, column: 5, scope: !943, inlinedAt: !896)
!969 = !DILocation(line: 549, column: 26, scope: !935, inlinedAt: !896)
!970 = !DILocation(line: 535, column: 53, scope: !927, inlinedAt: !896)
!971 = distinct !{!971, !932, !972, !309, !310}
!972 = !DILocation(line: 550, column: 3, scope: !928, inlinedAt: !896)
!973 = !DILocation(line: 551, column: 7, scope: !974, inlinedAt: !896)
!974 = distinct !DILexicalBlock(scope: !889, file: !147, line: 551, column: 7)
!975 = !DILocation(line: 551, column: 7, scope: !889, inlinedAt: !896)
!976 = !DILocation(line: 552, column: 33, scope: !974, inlinedAt: !896)
!977 = !DILocation(line: 552, column: 21, scope: !974, inlinedAt: !896)
!978 = !DILocation(line: 552, column: 5, scope: !974, inlinedAt: !896)
!979 = !DILocation(line: 553, column: 13, scope: !980, inlinedAt: !896)
!980 = distinct !DILexicalBlock(scope: !889, file: !147, line: 553, column: 7)
!981 = !{!911, !249, i64 112}
!982 = !DILocation(line: 553, column: 7, scope: !980, inlinedAt: !896)
!983 = !DILocation(line: 553, column: 40, scope: !980, inlinedAt: !896)
!984 = !DILocation(line: 553, column: 7, scope: !889, inlinedAt: !896)
!985 = !DILocation(line: 557, column: 19, scope: !986, inlinedAt: !896)
!986 = distinct !DILexicalBlock(scope: !987, file: !147, line: 557, column: 9)
!987 = distinct !DILexicalBlock(scope: !988, file: !147, line: 557, column: 9)
!988 = distinct !DILexicalBlock(scope: !989, file: !147, line: 556, column: 7)
!989 = distinct !DILexicalBlock(scope: !990, file: !147, line: 555, column: 7)
!990 = distinct !DILexicalBlock(scope: !991, file: !147, line: 555, column: 7)
!991 = distinct !DILexicalBlock(scope: !980, file: !147, line: 554, column: 5)
!992 = !DILocation(line: 557, column: 55, scope: !986, inlinedAt: !896)
!993 = !DILocation(line: 557, column: 9, scope: !987, inlinedAt: !896)
!994 = !DILocation(line: 558, column: 47, scope: !986, inlinedAt: !896)
!995 = !DILocation(line: 558, column: 17, scope: !986, inlinedAt: !896)
!996 = !DILocation(line: 558, column: 11, scope: !986, inlinedAt: !896)
!997 = !DILocation(line: 558, column: 46, scope: !986, inlinedAt: !896)
!998 = !DILocation(line: 557, column: 74, scope: !986, inlinedAt: !896)
!999 = !DILocation(line: 557, column: 25, scope: !986, inlinedAt: !896)
!1000 = distinct !{!1000, !993, !1001, !309, !310}
!1001 = !DILocation(line: 559, column: 48, scope: !987, inlinedAt: !896)
!1002 = !DILocation(line: 0, scope: !987, inlinedAt: !896)
!1003 = !DILocation(line: 561, column: 45, scope: !988, inlinedAt: !896)
!1004 = !DILocation(line: 561, column: 11, scope: !988, inlinedAt: !896)
!1005 = !DILocation(line: 560, column: 47, scope: !988, inlinedAt: !896)
!1006 = !DILocation(line: 560, column: 15, scope: !988, inlinedAt: !896)
!1007 = !DILocation(line: 560, column: 9, scope: !988, inlinedAt: !896)
!1008 = !DILocation(line: 560, column: 46, scope: !988, inlinedAt: !896)
!1009 = !DILocation(line: 563, column: 17, scope: !988, inlinedAt: !896)
!1010 = !DILocation(line: 563, column: 11, scope: !988, inlinedAt: !896)
!1011 = !DILocation(line: 562, column: 52, scope: !988, inlinedAt: !896)
!1012 = !DILocation(line: 562, column: 15, scope: !988, inlinedAt: !896)
!1013 = !DILocation(line: 562, column: 9, scope: !988, inlinedAt: !896)
!1014 = !DILocation(line: 562, column: 41, scope: !988, inlinedAt: !896)
!1015 = !DILocation(line: 555, column: 70, scope: !989, inlinedAt: !896)
!1016 = !DILocation(line: 555, column: 23, scope: !989, inlinedAt: !896)
!1017 = !DILocation(line: 555, column: 17, scope: !989, inlinedAt: !896)
!1018 = !DILocation(line: 555, column: 50, scope: !989, inlinedAt: !896)
!1019 = !DILocation(line: 555, column: 7, scope: !990, inlinedAt: !896)
!1020 = distinct !{!1020, !1019, !1021, !309, !310}
!1021 = !DILocation(line: 564, column: 7, scope: !990, inlinedAt: !896)
!1022 = !DILocation(line: 565, column: 48, scope: !991, inlinedAt: !896)
!1023 = !DILocation(line: 565, column: 36, scope: !991, inlinedAt: !896)
!1024 = !DILocation(line: 567, column: 5, scope: !991, inlinedAt: !896)
!1025 = !DILocation(line: 580, column: 59, scope: !830)
!1026 = !DILocalVariable(name: "attributes", arg: 1, scope: !1027, file: !147, line: 437, type: !153)
!1027 = distinct !DISubprogram(name: "DestroyXMLTreeAttributes", scope: !147, file: !147, line: 437, type: !1028, scopeLine: 438, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1030)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!153, !153}
!1030 = !{!1026, !1031}
!1031 = !DILocalVariable(name: "i", scope: !1027, file: !147, line: 440, type: !173)
!1032 = !DILocation(line: 0, scope: !1027, inlinedAt: !1033)
!1033 = distinct !DILocation(line: 580, column: 24, scope: !830)
!1034 = !DILocation(line: 445, column: 19, scope: !1035, inlinedAt: !1033)
!1035 = distinct !DILexicalBlock(scope: !1027, file: !147, line: 445, column: 7)
!1036 = !DILocation(line: 445, column: 38, scope: !1035, inlinedAt: !1033)
!1037 = !DILocation(line: 447, column: 13, scope: !1038, inlinedAt: !1033)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !147, line: 447, column: 3)
!1039 = distinct !DILexicalBlock(scope: !1027, file: !147, line: 447, column: 3)
!1040 = !DILocation(line: 447, column: 27, scope: !1038, inlinedAt: !1033)
!1041 = !DILocation(line: 447, column: 3, scope: !1039, inlinedAt: !1033)
!1042 = !DILocation(line: 453, column: 21, scope: !1043, inlinedAt: !1033)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !147, line: 452, column: 9)
!1044 = distinct !DILexicalBlock(scope: !1038, file: !147, line: 448, column: 3)
!1045 = !DILocation(line: 453, column: 20, scope: !1043, inlinedAt: !1033)
!1046 = !DILocation(line: 454, column: 21, scope: !1047, inlinedAt: !1033)
!1047 = distinct !DILexicalBlock(scope: !1044, file: !147, line: 454, column: 9)
!1048 = !DILocation(line: 454, column: 9, scope: !1047, inlinedAt: !1033)
!1049 = !DILocation(line: 454, column: 25, scope: !1047, inlinedAt: !1033)
!1050 = !DILocation(line: 454, column: 9, scope: !1044, inlinedAt: !1033)
!1051 = !DILocation(line: 455, column: 23, scope: !1047, inlinedAt: !1033)
!1052 = !DILocation(line: 455, column: 22, scope: !1047, inlinedAt: !1033)
!1053 = !DILocation(line: 455, column: 7, scope: !1047, inlinedAt: !1033)
!1054 = !DILocation(line: 447, column: 46, scope: !1038, inlinedAt: !1033)
!1055 = distinct !{!1055, !1041, !1056, !309, !310}
!1056 = !DILocation(line: 456, column: 3, scope: !1039, inlinedAt: !1033)
!1057 = !DILocation(line: 457, column: 24, scope: !1027, inlinedAt: !1033)
!1058 = !DILocation(line: 458, column: 3, scope: !1027, inlinedAt: !1033)
!1059 = !DILocation(line: 580, column: 23, scope: !830)
!1060 = !DILocation(line: 581, column: 45, scope: !830)
!1061 = !DILocation(line: 581, column: 21, scope: !830)
!1062 = !DILocation(line: 581, column: 20, scope: !830)
!1063 = !DILocation(line: 582, column: 41, scope: !830)
!1064 = !DILocation(line: 582, column: 17, scope: !830)
!1065 = !DILocation(line: 582, column: 16, scope: !830)
!1066 = !DILocation(line: 583, column: 28, scope: !830)
!1067 = !DILocation(line: 584, column: 3, scope: !830)
!1068 = !DILocation(line: 0, scope: !1027)
!1069 = !DILocation(line: 445, column: 19, scope: !1035)
!1070 = !DILocation(line: 445, column: 38, scope: !1035)
!1071 = !DILocation(line: 447, column: 13, scope: !1038)
!1072 = !DILocation(line: 447, column: 27, scope: !1038)
!1073 = !DILocation(line: 447, column: 3, scope: !1039)
!1074 = !DILocation(line: 453, column: 21, scope: !1043)
!1075 = !DILocation(line: 453, column: 20, scope: !1043)
!1076 = !DILocation(line: 454, column: 21, scope: !1047)
!1077 = !DILocation(line: 454, column: 9, scope: !1047)
!1078 = !DILocation(line: 454, column: 25, scope: !1047)
!1079 = !DILocation(line: 454, column: 9, scope: !1044)
!1080 = !DILocation(line: 455, column: 23, scope: !1047)
!1081 = !DILocation(line: 455, column: 22, scope: !1047)
!1082 = !DILocation(line: 455, column: 7, scope: !1047)
!1083 = !DILocation(line: 447, column: 46, scope: !1038)
!1084 = distinct !{!1084, !1073, !1085, !309, !310}
!1085 = !DILocation(line: 456, column: 3, scope: !1039)
!1086 = !DILocation(line: 457, column: 24, scope: !1027)
!1087 = !DILocation(line: 458, column: 3, scope: !1027)
!1088 = !DILocation(line: 459, column: 1, scope: !1027)
!1089 = distinct !DISubprogram(name: "FileToXML", scope: !147, file: !147, line: 620, type: !1090, scopeLine: 621, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1092)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!150, !186, !230}
!1092 = !{!1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1105}
!1093 = !DILocalVariable(name: "filename", arg: 1, scope: !1089, file: !147, line: 620, type: !186)
!1094 = !DILocalVariable(name: "extent", arg: 2, scope: !1089, file: !147, line: 620, type: !230)
!1095 = !DILocalVariable(name: "xml", scope: !1089, file: !147, line: 623, type: !150)
!1096 = !DILocalVariable(name: "file", scope: !1089, file: !147, line: 626, type: !203)
!1097 = !DILocalVariable(name: "offset", scope: !1089, file: !147, line: 629, type: !182)
!1098 = !DILocalVariable(name: "i", scope: !1089, file: !147, line: 632, type: !156)
!1099 = !DILocalVariable(name: "length", scope: !1089, file: !147, line: 635, type: !156)
!1100 = !DILocalVariable(name: "count", scope: !1089, file: !147, line: 638, type: !173)
!1101 = !DILocalVariable(name: "map", scope: !1089, file: !147, line: 641, type: !172)
!1102 = !DILocalVariable(name: "quantum", scope: !1103, file: !147, line: 656, type: !156)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !147, line: 654, column: 5)
!1104 = distinct !DILexicalBlock(scope: !1089, file: !147, line: 652, column: 7)
!1105 = !DILocalVariable(name: "file_stats", scope: !1103, file: !147, line: 659, type: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1107, line: 46, size: 1152, elements: !1108)
!1107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "f8d5b541c4f89219f8e8ff8c3e2940d9")
!1108 = !{!1109, !1111, !1113, !1115, !1117, !1119, !1121, !1122, !1123, !1125, !1127, !1129, !1137, !1138, !1139}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1106, file: !1107, line: 48, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !176, line: 145, baseType: !158)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1106, file: !1107, line: 53, baseType: !1112, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !176, line: 148, baseType: !158)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1106, file: !1107, line: 61, baseType: !1114, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !176, line: 151, baseType: !158)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1106, file: !1107, line: 62, baseType: !1116, size: 32, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !176, line: 150, baseType: !7)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1106, file: !1107, line: 64, baseType: !1118, size: 32, offset: 224)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !176, line: 146, baseType: !7)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1106, file: !1107, line: 65, baseType: !1120, size: 32, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !176, line: 147, baseType: !7)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1106, file: !1107, line: 67, baseType: !203, size: 32, offset: 288)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1106, file: !1107, line: 69, baseType: !1110, size: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1106, file: !1107, line: 74, baseType: !1124, size: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !176, line: 152, baseType: !177)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1106, file: !1107, line: 78, baseType: !1126, size: 64, offset: 448)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !176, line: 174, baseType: !177)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1106, file: !1107, line: 80, baseType: !1128, size: 64, offset: 512)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !176, line: 179, baseType: !177)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1106, file: !1107, line: 91, baseType: !1130, size: 128, offset: 576)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1131, line: 10, size: 128, elements: !1132)
!1131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!1132 = !{!1133, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1130, file: !1131, line: 12, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !176, line: 160, baseType: !177)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1130, file: !1131, line: 16, baseType: !1136, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !176, line: 196, baseType: !177)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1106, file: !1107, line: 92, baseType: !1130, size: 128, offset: 704)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1106, file: !1107, line: 93, baseType: !1130, size: 128, offset: 832)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1106, file: !1107, line: 106, baseType: !1140, size: 192, offset: 960)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 192, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 3)
!1143 = !DILocation(line: 0, scope: !1089)
!1144 = !DILocation(line: 645, column: 15, scope: !1089)
!1145 = !DILocation(line: 645, column: 8, scope: !1089)
!1146 = !DILocation(line: 646, column: 7, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1089, file: !147, line: 646, column: 7)
!1148 = !DILocation(line: 646, column: 35, scope: !1147)
!1149 = !DILocation(line: 646, column: 7, scope: !1089)
!1150 = !DILocalVariable(name: "path", arg: 1, scope: !1151, file: !1152, line: 136, type: !186)
!1151 = distinct !DISubprogram(name: "open_utf8", scope: !1152, file: !1152, line: 136, type: !1153, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1157)
!1152 = !DIFile(filename: "apps/538.imagick_r/src/magick/utility-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f0938b0b9be15949da14cdcfd7e813d9")
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!203, !186, !203, !1155}
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !1156, line: 59, baseType: !1116)
!1156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "461013b06495e219438a7cca03a67307")
!1157 = !{!1150, !1158, !1159}
!1158 = !DILocalVariable(name: "flags", arg: 2, scope: !1151, file: !1152, line: 136, type: !203)
!1159 = !DILocalVariable(name: "mode", arg: 3, scope: !1151, file: !1152, line: 136, type: !1155)
!1160 = !DILocation(line: 0, scope: !1151, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 647, column: 10, scope: !1147)
!1162 = !DILocation(line: 139, column: 10, scope: !1151, inlinedAt: !1161)
!1163 = !DILocation(line: 647, column: 5, scope: !1147)
!1164 = !DILocation(line: 648, column: 12, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1089, file: !147, line: 648, column: 7)
!1166 = !DILocation(line: 648, column: 7, scope: !1089)
!1167 = !DILocation(line: 650, column: 29, scope: !1089)
!1168 = !DILocation(line: 652, column: 23, scope: !1104)
!1169 = !DILocation(line: 652, column: 16, scope: !1104)
!1170 = !DILocation(line: 652, column: 13, scope: !1104)
!1171 = !DILocation(line: 652, column: 31, scope: !1104)
!1172 = !DILocation(line: 658, column: 7, scope: !1103)
!1173 = !DILocation(line: 659, column: 9, scope: !1103)
!1174 = !DILocation(line: 664, column: 33, scope: !1103)
!1175 = !DILocation(line: 0, scope: !1103)
!1176 = !DILocalVariable(name: "__fd", arg: 1, scope: !1177, file: !1156, line: 467, type: !203)
!1177 = distinct !DISubprogram(name: "fstat", scope: !1156, file: !1156, line: 467, type: !1178, scopeLine: 468, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1181)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!203, !203, !1180}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1181 = !{!1176, !1182}
!1182 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1177, file: !1156, line: 467, type: !1180)
!1183 = !DILocation(line: 0, scope: !1177, inlinedAt: !1184)
!1184 = distinct !DILocation(line: 666, column: 12, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1103, file: !147, line: 666, column: 11)
!1186 = !DILocation(line: 469, column: 10, scope: !1177, inlinedAt: !1184)
!1187 = !DILocation(line: 666, column: 36, scope: !1185)
!1188 = !DILocation(line: 666, column: 42, scope: !1185)
!1189 = !DILocation(line: 669, column: 20, scope: !1103)
!1190 = !DILocation(line: 670, column: 21, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !147, line: 670, column: 7)
!1192 = distinct !DILexicalBlock(scope: !1103, file: !147, line: 670, column: 7)
!1193 = !DILocation(line: 670, column: 7, scope: !1192)
!1194 = distinct !{!1194, !1193, !1195, !309, !310}
!1195 = !DILocation(line: 687, column: 7, scope: !1192)
!1196 = !DILocation(line: 672, column: 28, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1191, file: !147, line: 671, column: 7)
!1198 = !DILocation(line: 672, column: 15, scope: !1197)
!1199 = !DILocation(line: 673, column: 19, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1197, file: !147, line: 673, column: 13)
!1201 = !DILocation(line: 673, column: 13, scope: !1197)
!1202 = !DILocation(line: 676, column: 17, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !147, line: 676, column: 17)
!1204 = distinct !DILexicalBlock(scope: !1200, file: !147, line: 674, column: 11)
!1205 = !{!1206, !1206, i64 0}
!1206 = !{!"int", !250, i64 0}
!1207 = !DILocation(line: 676, column: 23, scope: !1203)
!1208 = !DILocation(line: 676, column: 17, scope: !1204)
!1209 = !DILocation(line: 0, scope: !1197)
!1210 = !DILocation(line: 679, column: 13, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1197, file: !147, line: 679, column: 13)
!1212 = !DILocation(line: 679, column: 27, scope: !1211)
!1213 = !DILocation(line: 679, column: 13, scope: !1197)
!1214 = !DILocation(line: 681, column: 26, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1211, file: !147, line: 680, column: 11)
!1216 = !DILocation(line: 682, column: 13, scope: !1215)
!1217 = !DILocation(line: 684, column: 55, scope: !1197)
!1218 = !DILocation(line: 684, column: 22, scope: !1197)
!1219 = !DILocation(line: 685, column: 24, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1197, file: !147, line: 685, column: 13)
!1221 = !DILocation(line: 685, column: 32, scope: !1220)
!1222 = !DILocation(line: 685, column: 13, scope: !1197)
!1223 = !DILocation(line: 688, column: 11, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1103, file: !147, line: 688, column: 11)
!1225 = !DILocation(line: 688, column: 39, scope: !1224)
!1226 = !DILocation(line: 688, column: 11, scope: !1103)
!1227 = !DILocation(line: 689, column: 14, scope: !1224)
!1228 = !DILocation(line: 689, column: 9, scope: !1224)
!1229 = !DILocation(line: 690, column: 15, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1103, file: !147, line: 690, column: 11)
!1231 = !DILocation(line: 690, column: 11, scope: !1103)
!1232 = !DILocation(line: 692, column: 16, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1103, file: !147, line: 692, column: 11)
!1234 = !DILocation(line: 692, column: 11, scope: !1103)
!1235 = !DILocation(line: 694, column: 24, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1233, file: !147, line: 693, column: 9)
!1237 = !DILocation(line: 695, column: 11, scope: !1236)
!1238 = !DILocation(line: 697, column: 34, scope: !1103)
!1239 = !DILocalVariable(name: "x", arg: 1, scope: !1240, file: !147, line: 612, type: !1243)
!1240 = distinct !DISubprogram(name: "MagickMin", scope: !147, file: !147, line: 612, type: !1241, scopeLine: 614, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1244)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!184, !1243, !1243}
!1243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!1244 = !{!1239, !1245}
!1245 = !DILocalVariable(name: "y", arg: 2, scope: !1240, file: !147, line: 613, type: !1243)
!1246 = !DILocation(line: 0, scope: !1240, inlinedAt: !1247)
!1247 = distinct !DILocation(line: 697, column: 23, scope: !1103)
!1248 = !DILocation(line: 698, column: 7, scope: !1103)
!1249 = !DILocation(line: 698, column: 18, scope: !1103)
!1250 = !DILocation(line: 699, column: 7, scope: !1103)
!1251 = !DILocation(line: 700, column: 5, scope: !1104)
!1252 = !DILocation(line: 0, scope: !1240, inlinedAt: !1253)
!1253 = distinct !DILocation(line: 701, column: 19, scope: !1089)
!1254 = !DILocation(line: 704, column: 45, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1089, file: !147, line: 703, column: 7)
!1256 = !DILocation(line: 704, column: 18, scope: !1255)
!1257 = !DILocation(line: 705, column: 11, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1089, file: !147, line: 705, column: 7)
!1259 = !DILocation(line: 705, column: 7, scope: !1089)
!1260 = !DILocation(line: 707, column: 12, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1258, file: !147, line: 706, column: 5)
!1262 = !DILocation(line: 708, column: 7, scope: !1261)
!1263 = !DILocation(line: 710, column: 7, scope: !1089)
!1264 = !DILocation(line: 711, column: 11, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1089, file: !147, line: 711, column: 7)
!1266 = !DILocation(line: 711, column: 7, scope: !1089)
!1267 = !DILocation(line: 713, column: 14, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1265, file: !147, line: 712, column: 5)
!1269 = !DILocation(line: 714, column: 14, scope: !1268)
!1270 = !DILocation(line: 715, column: 5, scope: !1268)
!1271 = !DILocation(line: 718, column: 14, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1265, file: !147, line: 717, column: 5)
!1273 = !DILocation(line: 719, column: 19, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1275, file: !147, line: 719, column: 7)
!1275 = distinct !DILexicalBlock(scope: !1272, file: !147, line: 719, column: 7)
!1276 = !DILocation(line: 719, column: 7, scope: !1275)
!1277 = !DILocation(line: 721, column: 28, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1274, file: !147, line: 720, column: 7)
!1279 = !DILocation(line: 721, column: 56, scope: !1278)
!1280 = !DILocation(line: 0, scope: !1240, inlinedAt: !1281)
!1281 = distinct !DILocation(line: 721, column: 40, scope: !1278)
!1282 = !DILocation(line: 721, column: 15, scope: !1278)
!1283 = !DILocation(line: 723, column: 19, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1278, file: !147, line: 723, column: 13)
!1285 = !DILocation(line: 723, column: 13, scope: !1278)
!1286 = !DILocation(line: 726, column: 17, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1288, file: !147, line: 726, column: 17)
!1288 = distinct !DILexicalBlock(scope: !1284, file: !147, line: 724, column: 11)
!1289 = !DILocation(line: 726, column: 23, scope: !1287)
!1290 = !DILocation(line: 726, column: 17, scope: !1288)
!1291 = !DILocation(line: 0, scope: !1278)
!1292 = !DILocation(line: 719, column: 30, scope: !1274)
!1293 = distinct !{!1293, !1276, !1294, !309, !310}
!1294 = !DILocation(line: 729, column: 7, scope: !1275)
!1295 = !DILocation(line: 732, column: 16, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1297, file: !147, line: 731, column: 9)
!1297 = distinct !DILexicalBlock(scope: !1272, file: !147, line: 730, column: 11)
!1298 = !DILocation(line: 733, column: 24, scope: !1296)
!1299 = !DILocation(line: 734, column: 11, scope: !1296)
!1300 = !DILocation(line: 737, column: 3, scope: !1089)
!1301 = !DILocation(line: 737, column: 14, scope: !1089)
!1302 = !DILocation(line: 738, column: 7, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1089, file: !147, line: 738, column: 7)
!1304 = !DILocation(line: 738, column: 35, scope: !1303)
!1305 = !DILocation(line: 738, column: 7, scope: !1089)
!1306 = !DILocation(line: 739, column: 10, scope: !1303)
!1307 = !DILocation(line: 739, column: 5, scope: !1303)
!1308 = !DILocation(line: 740, column: 12, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1089, file: !147, line: 740, column: 7)
!1310 = !DILocation(line: 740, column: 7, scope: !1089)
!1311 = !DILocation(line: 741, column: 18, scope: !1309)
!1312 = !DILocation(line: 741, column: 5, scope: !1309)
!1313 = !DILocation(line: 743, column: 1, scope: !1089)
!1314 = !DISubprogram(name: "fileno", scope: !174, file: !174, line: 786, type: !1315, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!203, !1317}
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1319, line: 7, baseType: !1320)
!1319 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1321, line: 49, size: 1728, elements: !1322)
!1321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1322 = !{!1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1338, !1340, !1341, !1342, !1343, !1344, !1346, !1348, !1351, !1353, !1356, !1359, !1360, !1361, !1362, !1363}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1320, file: !1321, line: 51, baseType: !203, size: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1320, file: !1321, line: 54, baseType: !150, size: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1320, file: !1321, line: 55, baseType: !150, size: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1320, file: !1321, line: 56, baseType: !150, size: 64, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1320, file: !1321, line: 57, baseType: !150, size: 64, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1320, file: !1321, line: 58, baseType: !150, size: 64, offset: 320)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1320, file: !1321, line: 59, baseType: !150, size: 64, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1320, file: !1321, line: 60, baseType: !150, size: 64, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1320, file: !1321, line: 61, baseType: !150, size: 64, offset: 512)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1320, file: !1321, line: 64, baseType: !150, size: 64, offset: 576)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1320, file: !1321, line: 65, baseType: !150, size: 64, offset: 640)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1320, file: !1321, line: 66, baseType: !150, size: 64, offset: 704)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1320, file: !1321, line: 68, baseType: !1336, size: 64, offset: 768)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1321, line: 36, flags: DIFlagFwdDecl)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1320, file: !1321, line: 70, baseType: !1339, size: 64, offset: 832)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1320, file: !1321, line: 72, baseType: !203, size: 32, offset: 896)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1320, file: !1321, line: 73, baseType: !203, size: 32, offset: 928)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1320, file: !1321, line: 74, baseType: !1124, size: 64, offset: 960)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1320, file: !1321, line: 77, baseType: !204, size: 16, offset: 1024)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1320, file: !1321, line: 78, baseType: !1345, size: 8, offset: 1040)
!1345 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1320, file: !1321, line: 79, baseType: !1347, size: 8, offset: 1048)
!1347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 8, elements: !218)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1320, file: !1321, line: 81, baseType: !1349, size: 64, offset: 1088)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1321, line: 43, baseType: null)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1320, file: !1321, line: 89, baseType: !1352, size: 64, offset: 1152)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !176, line: 153, baseType: !177)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1320, file: !1321, line: 91, baseType: !1354, size: 64, offset: 1216)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1321, line: 37, flags: DIFlagFwdDecl)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1320, file: !1321, line: 92, baseType: !1357, size: 64, offset: 1280)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1321, line: 38, flags: DIFlagFwdDecl)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1320, file: !1321, line: 93, baseType: !1339, size: 64, offset: 1344)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1320, file: !1321, line: 94, baseType: !172, size: 64, offset: 1408)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1320, file: !1321, line: 95, baseType: !156, size: 64, offset: 1472)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1320, file: !1321, line: 96, baseType: !203, size: 32, offset: 1536)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1320, file: !1321, line: 98, baseType: !1364, size: 160, offset: 1568)
!1364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 160, elements: !1365)
!1365 = !{!1366}
!1366 = !DISubrange(count: 20)
!1367 = !DISubprogram(name: "LocaleCompare", scope: !372, file: !372, line: 66, type: !1368, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!203, !186, !186}
!1370 = !DISubprogram(name: "lseek", scope: !1371, file: !1371, line: 334, type: !1372, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!1371 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "29bea3f2d65ec3bb874f389bfdfa2266")
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!1124, !203, !1124, !203}
!1374 = !DISubprogram(name: "AcquireQuantumMemory", scope: !364, file: !364, line: 42, type: !1375, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!172, !230, !230}
!1377 = !DISubprogram(name: "read", scope: !1371, file: !1371, line: 360, type: !1378, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{!173, !203, !172, !156}
!1380 = !DISubprogram(name: "close", scope: !1371, file: !1371, line: 353, type: !1381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!203, !203}
!1383 = !DISubprogram(name: "MapBlob", scope: !1384, file: !1384, line: 112, type: !1385, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!1384 = !DIFile(filename: "apps/538.imagick_r/src/magick/blob-private.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "a66ea2eabdd36512a199f3a0075ea4ad")
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!181, !203, !1387, !1389, !230}
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1388)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "MapMode", file: !49, line: 35, baseType: !48)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!1390 = !DISubprogram(name: "UnmapBlob", scope: !1384, file: !1384, line: 86, type: !1391, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !367)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!165, !172, !230}
