; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r/llvm-ir/525.x264_r_bc/input/y4m.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/input/y4m.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_input_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.y4m_hnd_t = type { ptr, i32, i32, i32, i32, i32, i32 }
%struct.video_info_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.x264_picture_t = type { i32, i32, i32, i32, i64, i64, ptr, %struct.x264_image_t, %struct.x264_hrd_t, ptr }
%struct.x264_image_t = type { i32, i32, [4 x i32], [4 x ptr] }
%struct.x264_hrd_t = type { double, double, double, double }

@y4m_input = dso_local local_unnamed_addr constant %struct.cli_input_t { ptr @open_file, ptr @get_frame_total, ptr @x264_picture_alloc, ptr @read_frame, ptr null, ptr @x264_picture_clean, ptr @close_file }, align 8, !dbg !0
@.str = private unnamed_addr constant [2 x i8] c"-\00", align 1
@stdin = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"YUV4MPEG2\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"420\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"%u:%u\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "y4m_input", scope: !2, file: !36, line: 265, type: !37, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !35, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/525.x264_r/src/x264_src/input/y4m.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/525.x264_r", checksumkind: CSK_MD5, checksum: "bd4a78066023f04fd68f7bcf30d32bbf")
!4 = !{!5, !6, !7, !12}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !8, line: 27, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !10, line: 45, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!11 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !14, line: 89, baseType: !15)
!14 = !DIFile(filename: "apps/525.x264_r/src/x264_src/common/common.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!15 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !14, line: 89, size: 32, elements: !16)
!16 = !{!17, !21, !28}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !15, file: !14, line: 89, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 26, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 42, baseType: !20)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !15, file: !14, line: 89, baseType: !22, size: 32)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !26)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 25, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 40, baseType: !25)
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !{!27}
!27 = !DISubrange(count: 2)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !15, file: !14, line: 89, baseType: !29, size: 32)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32, elements: !33)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 24, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 38, baseType: !32)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34}
!34 = !DISubrange(count: 4)
!35 = !{!0}
!36 = !DIFile(filename: "apps/525.x264_r/src/x264_src/input/y4m.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bd4a78066023f04fd68f7bcf30d32bbf")
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_t", file: !39, line: 63, baseType: !40)
!39 = !DIFile(filename: "apps/525.x264_r/src/x264_src/input/input.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f28c863d273681dfcaca9779e9fcbd53")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 54, size: 448, elements: !41)
!41 = !{!42, !75, !79, !286, !290, !294, !298}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !40, file: !39, line: 56, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!6, !46, !48, !51, !67}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !50, line: 30, baseType: !5)
!50 = !DIFile(filename: "apps/525.x264_r/src/x264_src/muxers.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "bcea0820748b2dc47392b7f6393a96ff")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_info_t", file: !39, line: 52, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 38, size: 384, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "csp", scope: !53, file: !39, line: 40, baseType: !6, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fps_num", scope: !53, file: !39, line: 41, baseType: !18, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "fps_den", scope: !53, file: !39, line: 42, baseType: !18, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !53, file: !39, line: 43, baseType: !6, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !53, file: !39, line: 44, baseType: !6, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !53, file: !39, line: 45, baseType: !18, size: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !53, file: !39, line: 46, baseType: !18, size: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tff", scope: !53, file: !39, line: 47, baseType: !6, size: 32, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !53, file: !39, line: 48, baseType: !18, size: 32, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !53, file: !39, line: 49, baseType: !18, size: 32, offset: 288)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "vfr", scope: !53, file: !39, line: 50, baseType: !6, size: 32, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !53, file: !39, line: 51, baseType: !6, size: 32, offset: 352)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_opt_t", file: !39, line: 35, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 29, size: 256, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !69, file: !39, line: 31, baseType: !46, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !69, file: !39, line: 32, baseType: !46, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "timebase", scope: !69, file: !39, line: 33, baseType: !46, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !69, file: !39, line: 34, baseType: !6, size: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "get_frame_total", scope: !40, file: !39, line: 57, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!6, !49}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "picture_alloc", scope: !40, file: !39, line: 58, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!6, !83, !6, !6, !6}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !85, line: 549, baseType: !86)
!85 = !DIFile(filename: "apps/525.x264_r/src/x264_src/x264.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 513, size: 1088, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !97, !98, !265, !276, !285}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !86, file: !85, line: 521, baseType: !6, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !86, file: !85, line: 523, baseType: !6, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !86, file: !85, line: 526, baseType: !6, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !86, file: !85, line: 529, baseType: !6, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !86, file: !85, line: 531, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !94, line: 27, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 44, baseType: !96)
!96 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !86, file: !85, line: 534, baseType: !93, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !86, file: !85, line: 541, baseType: !99, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !85, line: 376, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !85, line: 176, size: 5632, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !148, !149, !150, !151, !155, !156, !170, !171, !172, !173, !174, !203, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !101, file: !85, line: 179, baseType: !20, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !101, file: !85, line: 180, baseType: !6, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !101, file: !85, line: 181, baseType: !6, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !101, file: !85, line: 182, baseType: !6, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !101, file: !85, line: 183, baseType: !6, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !101, file: !85, line: 186, baseType: !6, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !101, file: !85, line: 187, baseType: !6, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !101, file: !85, line: 188, baseType: !6, size: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !101, file: !85, line: 189, baseType: !6, size: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !101, file: !85, line: 190, baseType: !6, size: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !101, file: !85, line: 198, baseType: !6, size: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !101, file: !85, line: 215, baseType: !115, size: 288, offset: 352)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !85, line: 200, size: 288, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !115, file: !85, line: 203, baseType: !6, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !115, file: !85, line: 204, baseType: !6, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !115, file: !85, line: 206, baseType: !6, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !115, file: !85, line: 209, baseType: !6, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !115, file: !85, line: 210, baseType: !6, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !115, file: !85, line: 211, baseType: !6, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !115, file: !85, line: 212, baseType: !6, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !115, file: !85, line: 213, baseType: !6, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !115, file: !85, line: 214, baseType: !6, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !101, file: !85, line: 218, baseType: !6, size: 32, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !101, file: !85, line: 219, baseType: !6, size: 32, offset: 672)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !101, file: !85, line: 220, baseType: !6, size: 32, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !101, file: !85, line: 221, baseType: !6, size: 32, offset: 736)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !101, file: !85, line: 222, baseType: !6, size: 32, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !101, file: !85, line: 224, baseType: !6, size: 32, offset: 800)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !101, file: !85, line: 225, baseType: !6, size: 32, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !101, file: !85, line: 226, baseType: !6, size: 32, offset: 864)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !101, file: !85, line: 227, baseType: !6, size: 32, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !101, file: !85, line: 229, baseType: !6, size: 32, offset: 928)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !101, file: !85, line: 230, baseType: !6, size: 32, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !101, file: !85, line: 231, baseType: !6, size: 32, offset: 992)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !101, file: !85, line: 233, baseType: !6, size: 32, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !101, file: !85, line: 234, baseType: !6, size: 32, offset: 1056)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !101, file: !85, line: 236, baseType: !6, size: 32, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !101, file: !85, line: 237, baseType: !6, size: 32, offset: 1120)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !101, file: !85, line: 239, baseType: !6, size: 32, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !101, file: !85, line: 240, baseType: !46, size: 64, offset: 1216)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !101, file: !85, line: 241, baseType: !145, size: 128, offset: 1280)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !101, file: !85, line: 242, baseType: !145, size: 128, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !101, file: !85, line: 243, baseType: !145, size: 128, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !101, file: !85, line: 244, baseType: !145, size: 128, offset: 1664)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !101, file: !85, line: 245, baseType: !152, size: 512, offset: 1792)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !101, file: !85, line: 246, baseType: !152, size: 512, offset: 2304)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !101, file: !85, line: 249, baseType: !157, size: 64, offset: 2816)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !5, !6, !160, !162}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !164)
!164 = !{!165, !167, !168, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !163, file: !166, line: 265, baseType: !20, size: 32)
!166 = !DIFile(filename: "apps/525.x264_r/src/x264_src/input/y4m.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !163, file: !166, line: 265, baseType: !20, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !163, file: !166, line: 265, baseType: !5, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !163, file: !166, line: 265, baseType: !5, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !101, file: !85, line: 250, baseType: !5, size: 64, offset: 2880)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !101, file: !85, line: 251, baseType: !6, size: 32, offset: 2944)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !101, file: !85, line: 252, baseType: !6, size: 32, offset: 2976)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !101, file: !85, line: 253, baseType: !46, size: 64, offset: 3008)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !101, file: !85, line: 287, baseType: !175, size: 800, offset: 3072)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !85, line: 256, size: 800, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !197, !198, !199, !201, !202}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !175, file: !85, line: 258, baseType: !20, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !175, file: !85, line: 259, baseType: !20, size: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !175, file: !85, line: 261, baseType: !6, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !175, file: !85, line: 262, baseType: !6, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !175, file: !85, line: 263, baseType: !6, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !175, file: !85, line: 264, baseType: !6, size: 32, offset: 160)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !175, file: !85, line: 265, baseType: !6, size: 32, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !175, file: !85, line: 267, baseType: !6, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !175, file: !85, line: 268, baseType: !6, size: 32, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !175, file: !85, line: 269, baseType: !6, size: 32, offset: 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !175, file: !85, line: 270, baseType: !6, size: 32, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !175, file: !85, line: 271, baseType: !6, size: 32, offset: 352)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !175, file: !85, line: 272, baseType: !6, size: 32, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !175, file: !85, line: 273, baseType: !6, size: 32, offset: 416)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !175, file: !85, line: 274, baseType: !6, size: 32, offset: 448)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !175, file: !85, line: 275, baseType: !6, size: 32, offset: 480)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !175, file: !85, line: 276, baseType: !6, size: 32, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !175, file: !85, line: 277, baseType: !6, size: 32, offset: 544)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !175, file: !85, line: 278, baseType: !196, size: 32, offset: 576)
!196 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !175, file: !85, line: 279, baseType: !196, size: 32, offset: 608)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !175, file: !85, line: 280, baseType: !6, size: 32, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !175, file: !85, line: 283, baseType: !200, size: 64, offset: 672)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !26)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !175, file: !85, line: 285, baseType: !6, size: 32, offset: 736)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !175, file: !85, line: 286, baseType: !6, size: 32, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !101, file: !85, line: 327, baseType: !204, size: 1152, offset: 3904)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !85, line: 290, size: 1152, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !243, !244}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !204, file: !85, line: 292, baseType: !6, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !204, file: !85, line: 294, baseType: !6, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !204, file: !85, line: 295, baseType: !6, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !204, file: !85, line: 296, baseType: !6, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !204, file: !85, line: 297, baseType: !6, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !204, file: !85, line: 299, baseType: !6, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !204, file: !85, line: 300, baseType: !196, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !204, file: !85, line: 301, baseType: !196, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !204, file: !85, line: 302, baseType: !196, size: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !204, file: !85, line: 303, baseType: !6, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !204, file: !85, line: 304, baseType: !6, size: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !204, file: !85, line: 305, baseType: !196, size: 32, offset: 352)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !204, file: !85, line: 306, baseType: !196, size: 32, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !204, file: !85, line: 307, baseType: !196, size: 32, offset: 416)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !204, file: !85, line: 309, baseType: !6, size: 32, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !204, file: !85, line: 310, baseType: !196, size: 32, offset: 480)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !204, file: !85, line: 311, baseType: !6, size: 32, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !204, file: !85, line: 312, baseType: !6, size: 32, offset: 544)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !204, file: !85, line: 315, baseType: !6, size: 32, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !204, file: !85, line: 316, baseType: !46, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !204, file: !85, line: 317, baseType: !6, size: 32, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !204, file: !85, line: 318, baseType: !46, size: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !204, file: !85, line: 321, baseType: !196, size: 32, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !204, file: !85, line: 322, baseType: !196, size: 32, offset: 864)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !204, file: !85, line: 323, baseType: !196, size: 32, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !204, file: !85, line: 324, baseType: !232, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !85, line: 174, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 167, size: 256, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !234, file: !85, line: 169, baseType: !6, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !234, file: !85, line: 169, baseType: !6, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !234, file: !85, line: 170, baseType: !6, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !234, file: !85, line: 171, baseType: !6, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !234, file: !85, line: 172, baseType: !196, size: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !234, file: !85, line: 173, baseType: !242, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !204, file: !85, line: 325, baseType: !6, size: 32, offset: 1024)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !204, file: !85, line: 326, baseType: !46, size: 64, offset: 1088)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !101, file: !85, line: 330, baseType: !6, size: 32, offset: 5056)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !101, file: !85, line: 331, baseType: !6, size: 32, offset: 5088)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !101, file: !85, line: 332, baseType: !6, size: 32, offset: 5120)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !101, file: !85, line: 334, baseType: !6, size: 32, offset: 5152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !101, file: !85, line: 335, baseType: !6, size: 32, offset: 5184)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !101, file: !85, line: 336, baseType: !18, size: 32, offset: 5216)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !101, file: !85, line: 337, baseType: !18, size: 32, offset: 5248)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !101, file: !85, line: 338, baseType: !18, size: 32, offset: 5280)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !101, file: !85, line: 339, baseType: !18, size: 32, offset: 5312)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !101, file: !85, line: 340, baseType: !6, size: 32, offset: 5344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !101, file: !85, line: 344, baseType: !6, size: 32, offset: 5376)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !101, file: !85, line: 356, baseType: !6, size: 32, offset: 5408)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !101, file: !85, line: 364, baseType: !6, size: 32, offset: 5440)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !101, file: !85, line: 367, baseType: !6, size: 32, offset: 5472)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !101, file: !85, line: 368, baseType: !6, size: 32, offset: 5504)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !101, file: !85, line: 369, baseType: !6, size: 32, offset: 5536)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !101, file: !85, line: 375, baseType: !262, size: 64, offset: 5568)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !5}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !86, file: !85, line: 543, baseType: !266, size: 448, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !85, line: 511, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 505, size: 448, elements: !268)
!268 = !{!269, !270, !271, !273}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !267, file: !85, line: 507, baseType: !6, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !267, file: !85, line: 508, baseType: !6, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !267, file: !85, line: 509, baseType: !272, size: 128, offset: 64)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !33)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !267, file: !85, line: 510, baseType: !274, size: 256, offset: 192)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 256, elements: !33)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !86, file: !85, line: 545, baseType: !277, size: 256, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !85, line: 503, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 496, size: 256, elements: !279)
!279 = !{!280, !282, !283, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !278, file: !85, line: 498, baseType: !281, size: 64)
!281 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !278, file: !85, line: 499, baseType: !281, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !278, file: !85, line: 500, baseType: !281, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !278, file: !85, line: 502, baseType: !281, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !86, file: !85, line: 548, baseType: !5, size: 64, offset: 1024)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "read_frame", scope: !40, file: !39, line: 59, baseType: !287, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!6, !83, !49, !6}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "release_frame", scope: !40, file: !39, line: 60, baseType: !291, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!6, !83, !49}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "picture_clean", scope: !40, file: !39, line: 61, baseType: !295, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !83}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !40, file: !39, line: 62, baseType: !76, size: 64, offset: 384)
!299 = !{i32 7, !"Dwarf Version", i32 5}
!300 = !{i32 2, !"Debug Info Version", i32 3}
!301 = !{i32 1, !"wchar_size", i32 4}
!302 = !{i32 7, !"PIC Level", i32 2}
!303 = !{i32 7, !"PIE Level", i32 2}
!304 = !{i32 7, !"uwtable", i32 2}
!305 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!306 = distinct !DISubprogram(name: "open_file", scope: !36, file: !36, line: 40, type: !44, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !307)
!307 = !{!308, !309, !310, !311, !312, !379, !380, !381, !382, !386, !387, !388, !389, !390}
!308 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !306, file: !36, line: 40, type: !46)
!309 = !DILocalVariable(name: "p_handle", arg: 2, scope: !306, file: !36, line: 40, type: !48)
!310 = !DILocalVariable(name: "info", arg: 3, scope: !306, file: !36, line: 40, type: !51)
!311 = !DILocalVariable(name: "opt", arg: 4, scope: !306, file: !36, line: 40, type: !67)
!312 = !DILocalVariable(name: "h", scope: !306, file: !36, line: 42, type: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "y4m_hnd_t", file: !36, line: 33, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 26, size: 256, elements: !316)
!316 = !{!317, !373, !374, !375, !376, !377, !378}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !315, file: !36, line: 28, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !320, line: 7, baseType: !321)
!320 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !322, line: 49, size: 1728, elements: !323)
!322 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !339, !341, !342, !343, !345, !346, !348, !352, !355, !357, !360, !363, !364, !365, !368, !369}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !321, file: !322, line: 51, baseType: !6, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !321, file: !322, line: 54, baseType: !46, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !321, file: !322, line: 55, baseType: !46, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !321, file: !322, line: 56, baseType: !46, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !321, file: !322, line: 57, baseType: !46, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !321, file: !322, line: 58, baseType: !46, size: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !321, file: !322, line: 59, baseType: !46, size: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !321, file: !322, line: 60, baseType: !46, size: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !321, file: !322, line: 61, baseType: !46, size: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !321, file: !322, line: 64, baseType: !46, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !321, file: !322, line: 65, baseType: !46, size: 64, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !321, file: !322, line: 66, baseType: !46, size: 64, offset: 704)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !321, file: !322, line: 68, baseType: !337, size: 64, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !322, line: 36, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !321, file: !322, line: 70, baseType: !340, size: 64, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !321, file: !322, line: 72, baseType: !6, size: 32, offset: 896)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !321, file: !322, line: 73, baseType: !6, size: 32, offset: 928)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !321, file: !322, line: 74, baseType: !344, size: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !10, line: 152, baseType: !96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !321, file: !322, line: 77, baseType: !25, size: 16, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !321, file: !322, line: 78, baseType: !347, size: 8, offset: 1040)
!347 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !321, file: !322, line: 79, baseType: !349, size: 8, offset: 1048)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 1)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !321, file: !322, line: 81, baseType: !353, size: 64, offset: 1088)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !322, line: 43, baseType: null)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !321, file: !322, line: 89, baseType: !356, size: 64, offset: 1152)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !10, line: 153, baseType: !96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !321, file: !322, line: 91, baseType: !358, size: 64, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !322, line: 37, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !321, file: !322, line: 92, baseType: !361, size: 64, offset: 1280)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !322, line: 38, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !321, file: !322, line: 93, baseType: !340, size: 64, offset: 1344)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !321, file: !322, line: 94, baseType: !5, size: 64, offset: 1408)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !321, file: !322, line: 95, baseType: !366, size: 64, offset: 1472)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !367, line: 46, baseType: !11)
!367 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !321, file: !322, line: 96, baseType: !6, size: 32, offset: 1536)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !321, file: !322, line: 98, baseType: !370, size: 160, offset: 1568)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 20)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !315, file: !36, line: 29, baseType: !6, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !315, file: !36, line: 29, baseType: !6, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame", scope: !315, file: !36, line: 30, baseType: !6, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "seq_header_len", scope: !315, file: !36, line: 31, baseType: !6, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_header_len", scope: !315, file: !36, line: 31, baseType: !6, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !315, file: !36, line: 32, baseType: !6, size: 32, offset: 224)
!379 = !DILocalVariable(name: "i", scope: !306, file: !36, line: 43, type: !6)
!380 = !DILocalVariable(name: "n", scope: !306, file: !36, line: 44, type: !18)
!381 = !DILocalVariable(name: "d", scope: !306, file: !36, line: 44, type: !18)
!382 = !DILocalVariable(name: "header", scope: !306, file: !36, line: 45, type: !383)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 720, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 90)
!386 = !DILocalVariable(name: "tokend", scope: !306, file: !36, line: 46, type: !46)
!387 = !DILocalVariable(name: "header_end", scope: !306, file: !36, line: 46, type: !46)
!388 = !DILocalVariable(name: "colorspace", scope: !306, file: !36, line: 47, type: !6)
!389 = !DILocalVariable(name: "alt_colorspace", scope: !306, file: !36, line: 48, type: !6)
!390 = !DILocalVariable(name: "tokstart", scope: !391, file: !36, line: 83, type: !46)
!391 = distinct !DILexicalBlock(scope: !306, file: !36, line: 83, column: 5)
!392 = !DILocation(line: 0, scope: !306)
!393 = !DILocation(line: 42, column: 20, scope: !306)
!394 = !DILocation(line: 44, column: 5, scope: !306)
!395 = !DILocation(line: 45, column: 5, scope: !306)
!396 = !DILocation(line: 45, column: 10, scope: !306)
!397 = !DILocation(line: 46, column: 5, scope: !306)
!398 = !DILocation(line: 49, column: 10, scope: !399)
!399 = distinct !DILexicalBlock(scope: !306, file: !36, line: 49, column: 9)
!400 = !DILocation(line: 49, column: 9, scope: !306)
!401 = !DILocation(line: 52, column: 8, scope: !306)
!402 = !DILocation(line: 52, column: 19, scope: !306)
!403 = !{!404, !408, i64 16}
!404 = !{!"", !405, i64 0, !408, i64 8, !408, i64 12, !408, i64 16, !408, i64 20, !408, i64 24, !408, i64 28}
!405 = !{!"any pointer", !406, i64 0}
!406 = !{!"omnipotent char", !407, i64 0}
!407 = !{!"Simple C/C++ TBAA"}
!408 = !{!"int", !406, i64 0}
!409 = !DILocation(line: 53, column: 11, scope: !306)
!410 = !DILocation(line: 53, column: 15, scope: !306)
!411 = !{!412, !408, i64 40}
!412 = !{!"", !408, i64 0, !408, i64 4, !408, i64 8, !408, i64 12, !408, i64 16, !408, i64 20, !408, i64 24, !408, i64 28, !408, i64 32, !408, i64 36, !408, i64 40, !408, i64 44}
!413 = !DILocation(line: 55, column: 10, scope: !414)
!414 = distinct !DILexicalBlock(scope: !306, file: !36, line: 55, column: 9)
!415 = !DILocation(line: 55, column: 9, scope: !306)
!416 = !DILocation(line: 56, column: 17, scope: !414)
!417 = !{!405, !405, i64 0}
!418 = !DILocation(line: 56, column: 9, scope: !414)
!419 = !DILocation(line: 58, column: 17, scope: !414)
!420 = !DILocation(line: 0, scope: !414)
!421 = !{!404, !405, i64 0}
!422 = !DILocation(line: 59, column: 15, scope: !423)
!423 = distinct !DILexicalBlock(scope: !306, file: !36, line: 59, column: 9)
!424 = !DILocation(line: 59, column: 9, scope: !306)
!425 = !DILocation(line: 62, column: 8, scope: !306)
!426 = !DILocation(line: 62, column: 25, scope: !306)
!427 = !{!404, !408, i64 24}
!428 = !DILocation(line: 67, column: 21, scope: !429)
!429 = distinct !DILexicalBlock(scope: !430, file: !36, line: 66, column: 5)
!430 = distinct !DILexicalBlock(scope: !431, file: !36, line: 65, column: 5)
!431 = distinct !DILexicalBlock(scope: !306, file: !36, line: 65, column: 5)
!432 = !DILocation(line: 67, column: 19, scope: !429)
!433 = !{!406, !406, i64 0}
!434 = !DILocation(line: 68, column: 23, scope: !435)
!435 = distinct !DILexicalBlock(scope: !429, file: !36, line: 68, column: 13)
!436 = !DILocation(line: 68, column: 13, scope: !429)
!437 = !DILocation(line: 65, column: 39, scope: !430)
!438 = !DILocation(line: 65, column: 19, scope: !430)
!439 = !DILocation(line: 65, column: 5, scope: !431)
!440 = distinct !{!440, !439, !441, !442, !443}
!441 = !DILocation(line: 76, column: 5, scope: !431)
!442 = !{!"llvm.loop.mustprogress"}
!443 = !{!"llvm.loop.unroll.disable"}
!444 = !DILocation(line: 67, column: 31, scope: !429)
