; ModuleID = 'adaptive.c'
source_filename = "adaptive.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalMemory = type { i64, [1025 x [256 x i64]], %struct.anon, %struct.anon.3, %union.pthread_mutex_t, %union.pthread_mutex_t, [1025 x %union.pthread_mutex_t] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%struct.anon.3 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

@uout_invvertex = external local_unnamed_addr global [2 x [2 x [2 x [3 x float]]]], align 16
@invjacobian = dso_local local_unnamed_addr global [3 x [3 x float]] zeroinitializer, align 16, !dbg !0
@invinvjacobian = dso_local local_unnamed_addr global [3 x [3 x float]] zeroinitializer, align 16, !dbg !8
@num_rays_traced = dso_local local_unnamed_addr global i64 0, align 8, !dbg !13
@num_traced_rays_hit_volume = dso_local local_unnamed_addr global i64 0, align 8, !dbg !15

!261 = !DILocation(line: 216, column: 2, scope: !259)
!262 = !DILocation(line: 217, column: 1, scope: !259)
!263 = !DILocation(line: 214, column: 14, scope: !254)
!264 = !DILocation(line: 218, column: 44, scope: !265)
!265 = distinct !DILexicalBlock(scope: !254, file: !3, line: 217, column: 8)
!266 = !DILocation(line: 218, column: 2, scope: !265)
!267 = !DILocation(line: 220, column: 25, scope: !247)
!268 = !DILocation(line: 220, column: 33, scope: !247)
!269 = !DILocation(line: 220, column: 1, scope: !247)
!270 = !DILocation(line: 223, column: 5, scope: !227)
!271 = !DILocation(line: 225, column: 32, scope: !272)
!272 = distinct !DILexicalBlock(scope: !227, file: !3, line: 225, column: 5)
!273 = !DILocation(line: 228, column: 23, scope: !274)
!274 = distinct !DILexicalBlock(scope: !227, file: !3, line: 227, column: 5)
!275 = !DILocation(line: 228, column: 31, scope: !274)
!276 = !DILocation(line: 228, column: 1, scope: !274)
!277 = !DILocation(line: 229, column: 2, scope: !274)
!278 = !DILocation(line: 229, column: 23, scope: !274)
!279 = !DILocation(line: 229, column: 33, scope: !274)
!280 = !DILocation(line: 230, column: 5, scope: !281)
!281 = distinct !DILexicalBlock(scope: !274, file: !3, line: 230, column: 5)
!282 = !DILocation(line: 230, column: 42, scope: !281)
!283 = !DILocation(line: 230, column: 38, scope: !281)
!284 = !DILocation(line: 230, column: 5, scope: !274)
!285 = !DILocation(line: 231, column: 35, scope: !286)
!286 = distinct !DILexicalBlock(scope: !281, file: !3, line: 230, column: 54)
!287 = !DILocation(line: 232, column: 49, scope: !286)
!288 = !DILocation(line: 232, column: 2, scope: !286)
!289 = !DILocation(line: 233, column: 1, scope: !286)
!290 = !DILocation(line: 230, column: 14, scope: !281)
!291 = !DILocation(line: 234, column: 44, scope: !292)
!292 = distinct !DILexicalBlock(scope: !281, file: !3, line: 233, column: 8)
!293 = !DILocation(line: 234, column: 2, scope: !292)
!294 = !DILocation(line: 236, column: 25, scope: !274)
!295 = !DILocation(line: 236, column: 33, scope: !274)
!296 = !DILocation(line: 236, column: 1, scope: !274)
!297 = !DILocation(line: 239, column: 5, scope: !227)
!298 = !DILocation(line: 240, column: 15, scope: !227)
!299 = !DILocation(line: 243, column: 27, scope: !300)
!300 = distinct !DILexicalBlock(scope: !28, file: !3, line: 243, column: 5)
!301 = !DILocation(line: 243, column: 35, scope: !300)
!302 = !DILocation(line: 243, column: 6, scope: !300)
!303 = !DILocation(line: 244, column: 65, scope: !28)
!304 = !DILocation(line: 244, column: 71, scope: !28)
!305 = !DILocation(line: 245, column: 5, scope: !28)
!306 = !DILocation(line: 245, column: 15, scope: !28)
!307 = !DILocation(line: 245, column: 31, scope: !28)
!308 = !DILocation(line: 246, column: 5, scope: !28)
!309 = !DILocation(line: 244, column: 5, scope: !28)
!310 = !DILocation(line: 248, column: 29, scope: !311)
!311 = distinct !DILexicalBlock(scope: !28, file: !3, line: 248, column: 5)
!312 = !DILocation(line: 248, column: 37, scope: !311)
!313 = !DILocation(line: 248, column: 6, scope: !311)
!314 = !DILocation(line: 251, column: 23, scope: !315)
!315 = distinct !DILexicalBlock(scope: !28, file: !3, line: 250, column: 3)
!316 = !DILocation(line: 251, column: 31, scope: !315)
!317 = !DILocation(line: 251, column: 1, scope: !315)
!318 = !DILocation(line: 252, column: 2, scope: !315)
!319 = !DILocation(line: 252, column: 23, scope: !315)
!320 = !DILocation(line: 252, column: 33, scope: !315)
!321 = !DILocation(line: 253, column: 5, scope: !322)
!322 = distinct !DILexicalBlock(scope: !315, file: !3, line: 253, column: 5)
!323 = !DILocation(line: 253, column: 42, scope: !322)
!324 = !DILocation(line: 253, column: 38, scope: !322)
!325 = !DILocation(line: 253, column: 5, scope: !315)
!326 = !DILocation(line: 254, column: 35, scope: !327)
!327 = distinct !DILexicalBlock(scope: !322, file: !3, line: 253, column: 54)
!328 = !DILocation(line: 255, column: 49, scope: !327)
!329 = !DILocation(line: 255, column: 2, scope: !327)
!330 = !DILocation(line: 256, column: 1, scope: !327)
!331 = !DILocation(line: 253, column: 14, scope: !322)
!332 = !DILocation(line: 257, column: 44, scope: !333)
!333 = distinct !DILexicalBlock(scope: !322, file: !3, line: 256, column: 8)
!334 = !DILocation(line: 257, column: 2, scope: !333)
!335 = !DILocation(line: 259, column: 25, scope: !315)
!336 = !DILocation(line: 259, column: 33, scope: !315)
!337 = !DILocation(line: 259, column: 1, scope: !315)
!338 = !DILocation(line: 261, column: 1, scope: !28)
!339 = !DISubprogram(name: "pthread_mutex_lock", scope: !340, file: !340, line: 738, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !376)
!340 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!341 = !DISubroutineType(types: !342)
!342 = !{!343, !344}
!343 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !346, line: 72, baseType: !347)
!346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !346, line: 67, size: 320, elements: !348)
!348 = !{!349, !370, !375}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !347, file: !346, line: 69, baseType: !350, size: 320)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !351, line: 22, size: 320, elements: !352)
!351 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!352 = !{!353, !354, !356, !357, !358, !359, !361, !362}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !350, file: !351, line: 24, baseType: !343, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !350, file: !351, line: 25, baseType: !355, size: 32, offset: 32)
!355 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !350, file: !351, line: 26, baseType: !343, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !350, file: !351, line: 28, baseType: !355, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !350, file: !351, line: 32, baseType: !343, size: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !350, file: !351, line: 34, baseType: !360, size: 16, offset: 160)
!360 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !350, file: !351, line: 35, baseType: !360, size: 16, offset: 176)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !350, file: !351, line: 36, baseType: !363, size: 128, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !364, line: 53, baseType: !365)
!364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !364, line: 49, size: 128, elements: !366)
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !365, file: !364, line: 51, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !365, file: !364, line: 52, baseType: !368, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !347, file: !346, line: 70, baseType: !371, size: 320)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 320, elements: !373)
!372 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!373 = !{!374}
!374 = !DISubrange(count: 40)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !347, file: !346, line: 71, baseType: !6, size: 64)
!376 = !{}
!377 = !DISubprogram(name: "pthread_cond_broadcast", scope: !340, file: !340, line: 978, type: !378, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !376)
!378 = !DISubroutineType(types: !379)
!379 = !{!343, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !346, line: 80, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !346, line: 75, size: 384, elements: !383)
!383 = !{!384, !414, !418}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !382, file: !346, line: 77, baseType: !385, size: 384)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !364, line: 92, size: 384, elements: !386)
!386 = !{!387, !397, !406, !410, !411, !412, !413}
!387 = !DIDerivedType(tag: DW_TAG_member, scope: !385, file: !364, line: 94, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !385, file: !364, line: 94, size: 64, elements: !389)
!389 = !{!390, !392}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !388, file: !364, line: 96, baseType: !391, size: 64)
!391 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !388, file: !364, line: 101, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !364, line: 97, size: 64, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !393, file: !364, line: 99, baseType: !355, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !393, file: !364, line: 100, baseType: !355, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !385, file: !364, line: 103, baseType: !398, size: 64, offset: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !385, file: !364, line: 103, size: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !398, file: !364, line: 105, baseType: !391, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !398, file: !364, line: 110, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !398, file: !364, line: 106, size: 64, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !402, file: !364, line: 108, baseType: !355, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !402, file: !364, line: 109, baseType: !355, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !385, file: !364, line: 112, baseType: !407, size: 64, offset: 128)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 64, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 2)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !385, file: !364, line: 113, baseType: !407, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !385, file: !364, line: 114, baseType: !355, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !385, file: !364, line: 115, baseType: !355, size: 32, offset: 288)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !385, file: !364, line: 116, baseType: !407, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !382, file: !346, line: 78, baseType: !415, size: 384)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 384, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 48)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !382, file: !346, line: 79, baseType: !419, size: 64)
!419 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!420 = !DISubprogram(name: "pthread_cond_wait", scope: !340, file: !340, line: 986, type: !421, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !376)
!421 = !DISubroutineType(types: !422)
!422 = !{!343, !423, !424}
!423 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !380)
!424 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !344)
!425 = !DISubprogram(name: "pthread_mutex_unlock", scope: !340, file: !340, line: 756, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !376)
!426 = !DISubprogram(name: "time", scope: !3, file: !3, line: 119, type: !427, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !376)
!427 = !DISubroutineType(types: !428)
!428 = !{!429, !433}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !430, line: 7, baseType: !431)
!430 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !432, line: 160, baseType: !6)
!432 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!434 = !DISubprogram(name: "Pre_Shade", scope: !435, file: !435, line: 234, type: !29, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !376)
!435 = !DIFile(filename: "./global.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/volrend", checksumkind: CSK_MD5, checksum: "f049690031a7f12768b0765e4f4983eb")
!436 = distinct !DISubprogram(name: "Ray_Trace_Adaptively", scope: !3, file: !3, line: 264, type: !29, scopeLine: 265, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!438 = !DILocalVariable(name: "my_node", arg: 1, scope: !436, file: !3, line: 264, type: !6)
!439 = !DILocalVariable(name: "outx", scope: !436, file: !3, line: 266, type: !6)
!440 = !DILocalVariable(name: "outy", scope: !436, file: !3, line: 266, type: !6)
!441 = !DILocalVariable(name: "yindex", scope: !436, file: !3, line: 266, type: !6)
!442 = !DILocalVariable(name: "xindex", scope: !436, file: !3, line: 266, type: !6)
!443 = !DILocalVariable(name: "num_xqueue", scope: !436, file: !3, line: 268, type: !6)
!444 = !DILocalVariable(name: "num_yqueue", scope: !436, file: !3, line: 268, type: !6)
!445 = !DILocalVariable(name: "num_queue", scope: !436, file: !3, line: 268, type: !6)
!446 = !DILocalVariable(name: "lnum_xblocks", scope: !436, file: !3, line: 268, type: !6)
!447 = !DILocalVariable(name: "lnum_yblocks", scope: !436, file: !3, line: 268, type: !6)
!448 = !DILocalVariable(name: "lnum_blocks", scope: !436, file: !3, line: 268, type: !6)
!449 = !DILocalVariable(name: "xstart", scope: !436, file: !3, line: 269, type: !6)
!450 = !DILocalVariable(name: "xstop", scope: !436, file: !3, line: 269, type: !6)
!451 = !DILocalVariable(name: "ystart", scope: !436, file: !3, line: 269, type: !6)
!452 = !DILocalVariable(name: "ystop", scope: !436, file: !3, line: 269, type: !6)
!453 = !DILocalVariable(name: "local_node", scope: !436, file: !3, line: 269, type: !6)
