; ModuleID = 'bfac.c'
source_filename = "bfac.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMatrix = type { i64, ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, i64, i64, ptr, ptr }
%union.Entry = type { ptr }
%struct.Block = type { i64, i64, i64, i64, i64, i64, i64, double, ptr, ptr, ptr, ptr }

@vMiss = dso_local local_unnamed_addr global i64 0, align 8, !dbg !0
@wMiss = dso_local local_unnamed_addr global i64 0, align 8, !dbg !5
@xMiss = dso_local local_unnamed_addr global i64 0, align 8, !dbg !8
@yMiss = dso_local local_unnamed_addr global i64 0, align 8, !dbg !10
@LB = external local_unnamed_addr global %struct.BMatrix, align 8
@BS = external local_unnamed_addr global i64, align 8
@block_start = dso_local local_unnamed_addr global ptr null, align 8, !dbg !12
@all_blocks = dso_local local_unnamed_addr global ptr null, align 8, !dbg !15

; Function Attrs: nofree noinline nounwind uwtable
define dso_local void @BFac(i64 noundef %diag, ptr nocapture noundef readonly %lc) local_unnamed_addr #0 !dbg !24 {
entry:
  call void @llvm.dbg.value(metadata i64 %diag, metadata !74, metadata !DIExpression()), !dbg !84
  call void @llvm.dbg.value(metadata ptr %lc, metadata !75, metadata !DIExpression()), !dbg !84
  %0 = load ptr, ptr getelementptr inbounds (%struct.BMatrix, ptr @LB, i64 0, i32 17), align 8, !dbg !85

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vMiss", scope: !2, file: !3, line: 40, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "bfac.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/cholesky", checksumkind: CSK_MD5, checksum: "02e3443db704ca7a349089ecab4ba4a1")
!4 = !{!0, !5, !8, !10, !12, !15}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "wMiss", scope: !2, file: !3, line: 40, type: !7, isLocal: false, isDefinition: true)
!7 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "xMiss", scope: !2, file: !3, line: 40, type: !7, isLocal: false, isDefinition: true)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "yMiss", scope: !2, file: !3, line: 40, type: !7, isLocal: false, isDefinition: true)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "block_start", scope: !2, file: !3, line: 46, type: !14, isLocal: false, isDefinition: true)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "all_blocks", scope: !2, file: !3, line: 46, type: !14, isLocal: false, isDefinition: true)
!17 = !{i32 7, !"Dwarf Version", i32 5}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{i32 1, !"wchar_size", i32 4}
!20 = !{i32 7, !"PIC Level", i32 2}
!21 = !{i32 7, !"PIE Level", i32 2}
!22 = !{i32 7, !"uwtable", i32 2}
!23 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!24 = distinct !DISubprogram(name: "BFac", scope: !3, file: !3, line: 51, type: !25, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !73)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !7, !27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocalCopies", file: !29, line: 92, size: 1088, elements: !30)
!29 = !DIFile(filename: "./matrix.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/cholesky", checksumkind: CSK_MD5, checksum: "f19fdb19034f8f693c291706633e8f13")
!30 = !{!31, !34, !35, !36, !37, !38, !39, !40, !54, !64, !66, !67, !68, !69, !70, !71, !72}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "blktmp", scope: !28, file: !29, line: 93, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "max_panel", scope: !28, file: !29, line: 94, baseType: !7, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !28, file: !29, line: 95, baseType: !14, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !28, file: !29, line: 96, baseType: !14, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !28, file: !29, line: 97, baseType: !32, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "updatetmp", scope: !28, file: !29, line: 98, baseType: !32, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !28, file: !29, line: 99, baseType: !14, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "freeUpdate", scope: !28, file: !29, line: 100, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Update", file: !29, line: 65, size: 640, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !42, file: !29, line: 66, baseType: !7, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !42, file: !29, line: 66, baseType: !7, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !42, file: !29, line: 66, baseType: !7, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !42, file: !29, line: 66, baseType: !7, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "dimi", scope: !42, file: !29, line: 67, baseType: !7, size: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "dimj", scope: !42, file: !29, line: 67, baseType: !7, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "structi", scope: !42, file: !29, line: 67, baseType: !14, size: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "structj", scope: !42, file: !29, line: 67, baseType: !14, size: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !42, file: !29, line: 68, baseType: !32, size: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !29, line: 69, baseType: !41, size: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "freeTask", scope: !28, file: !29, line: 101, baseType: !55, size: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Task", file: !29, line: 72, size: 384, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !56, file: !29, line: 73, baseType: !7, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "desti", scope: !56, file: !29, line: 73, baseType: !7, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "destj", scope: !56, file: !29, line: 73, baseType: !7, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !56, file: !29, line: 73, baseType: !7, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !56, file: !29, line: 74, baseType: !41, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !56, file: !29, line: 75, baseType: !55, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !28, file: !29, line: 102, baseType: !65, size: 64, offset: 576)
!65 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !28, file: !29, line: 103, baseType: !65, size: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !28, file: !29, line: 104, baseType: !65, size: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "uf", scope: !28, file: !29, line: 105, baseType: !65, size: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !28, file: !29, line: 106, baseType: !65, size: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !28, file: !29, line: 107, baseType: !65, size: 64, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !28, file: !29, line: 108, baseType: !65, size: 64, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "runs", scope: !28, file: !29, line: 109, baseType: !65, size: 64, offset: 1024)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!74 = !DILocalVariable(name: "diag", arg: 1, scope: !24, file: !3, line: 51, type: !7)
!75 = !DILocalVariable(name: "lc", arg: 2, scope: !24, file: !3, line: 51, type: !27)
!76 = !DILocalVariable(name: "n", scope: !24, file: !3, line: 53, type: !7)
!77 = !DILocalVariable(name: "is", scope: !24, file: !3, line: 53, type: !7)
!78 = !DILocalVariable(name: "il", scope: !24, file: !3, line: 53, type: !7)
!79 = !DILocalVariable(name: "js", scope: !24, file: !3, line: 53, type: !7)
!80 = !DILocalVariable(name: "jl", scope: !24, file: !3, line: 53, type: !7)
!81 = !DILocalVariable(name: "ks", scope: !24, file: !3, line: 53, type: !7)
!82 = !DILocalVariable(name: "kl", scope: !24, file: !3, line: 53, type: !7)
!83 = !DILocalVariable(name: "A", scope: !24, file: !3, line: 54, type: !32)
!84 = !DILocation(line: 0, scope: !24)
!85 = !DILocation(line: 56, column: 7, scope: !24)
!86 = !DILocation(line: 56, column: 20, scope: !24)
!87 = !DILocation(line: 57, column: 20, scope: !24)
!88 = !DILocation(line: 59, column: 16, scope: !89)
!89 = distinct !DILexicalBlock(scope: !90, file: !3, line: 59, column: 3)
!90 = distinct !DILexicalBlock(scope: !24, file: !3, line: 59, column: 3)
!91 = !DILocation(line: 59, column: 3, scope: !90)
!92 = !DILocation(line: 60, column: 13, scope: !93)
!93 = distinct !DILexicalBlock(scope: !89, file: !3, line: 59, column: 28)
!94 = !DILocation(line: 60, column: 12, scope: !93)
!95 = !DILocation(line: 60, column: 21, scope: !93)
!96 = !DILocation(line: 62, column: 19, scope: !93)
!97 = !DILocation(line: 62, column: 17, scope: !93)
!98 = !DILocation(line: 62, column: 13, scope: !93)
!99 = !DILocation(line: 62, column: 27, scope: !93)
!100 = !DILocation(line: 62, column: 5, scope: !93)
!101 = !DILocation(line: 64, column: 19, scope: !102)
!102 = distinct !DILexicalBlock(scope: !103, file: !3, line: 64, column: 5)
!103 = distinct !DILexicalBlock(scope: !93, file: !3, line: 64, column: 5)
!104 = !DILocation(line: 0, scope: !89)
!105 = !DILocation(line: 64, column: 5, scope: !103)
!106 = !DILocation(line: 65, column: 15, scope: !107)
!107 = distinct !DILexicalBlock(scope: !102, file: !3, line: 64, column: 31)
!108 = !DILocation(line: 65, column: 14, scope: !107)
!109 = !DILocation(line: 65, column: 23, scope: !107)
!110 = !DILocation(line: 67, column: 24, scope: !107)
!111 = !DILocation(line: 67, column: 7, scope: !107)
!112 = !DILocation(line: 69, column: 31, scope: !107)
!113 = !DILocation(line: 69, column: 48, scope: !107)
!114 = !DILocation(line: 69, column: 7, scope: !107)
!115 = !DILocation(line: 71, column: 28, scope: !107)
!116 = !DILocation(line: 71, column: 7, scope: !107)
!117 = !DILocation(line: 73, column: 21, scope: !118)
!118 = distinct !DILexicalBlock(scope: !119, file: !3, line: 73, column: 7)
!119 = distinct !DILexicalBlock(scope: !107, file: !3, line: 73, column: 7)
!120 = !DILocation(line: 73, column: 7, scope: !119)
!121 = !DILocation(line: 74, column: 17, scope: !122)
!122 = distinct !DILexicalBlock(scope: !118, file: !3, line: 73, column: 34)
!123 = !DILocation(line: 74, column: 16, scope: !122)
!124 = !DILocation(line: 74, column: 25, scope: !122)
!125 = !DILocation(line: 76, column: 16, scope: !122)
!126 = !DILocation(line: 76, column: 29, scope: !122)
!127 = !DILocation(line: 76, column: 25, scope: !122)
!128 = !DILocation(line: 76, column: 44, scope: !122)
!129 = !DILocation(line: 76, column: 42, scope: !122)
!130 = !DILocation(line: 76, column: 38, scope: !122)
!131 = !DILocation(line: 76, column: 52, scope: !122)
!132 = !DILocation(line: 76, column: 2, scope: !122)
!133 = !DILocation(line: 73, column: 30, scope: !118)
!134 = !DILocation(line: 73, column: 28, scope: !118)
!135 = distinct !{!135, !120, !136, !137, !138}
!136 = !DILocation(line: 78, column: 7, scope: !119)
!137 = !{!"llvm.loop.mustprogress"}
