; ModuleID = 'block2.c'
source_filename = "block2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMatrix = type { i64, ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, i64, i64, ptr, ptr }
%struct.SMatrix = type { i64, i64, ptr, ptr, ptr, ptr }
%struct.Block = type { i64, i64, i64, i64, i64, i64, i64, double, ptr, ptr, ptr, ptr }
%union.Entry = type { ptr }

@LB = dso_local global %struct.BMatrix zeroinitializer, align 8, !dbg !0
@domains = external local_unnamed_addr global ptr, align 8
@proc_domains = external local_unnamed_addr global ptr, align 8
@P = external local_unnamed_addr global i64, align 8
@node = external local_unnamed_addr global ptr, align 8
@postpass_partition_size = external local_unnamed_addr global i64, align 8
@.str.1 = private unnamed_addr constant [9 x i8] c"Supers: \00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"Blocks: \00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"%ld partitions\0A\00", align 1
@.str.4 = private unnamed_addr constant [28 x i8] c"%ld partitions, %ld blocks\0A\00", align 1
@.str.5 = private unnamed_addr constant [29 x i8] c"Block %ld has bad structure\0A\00", align 1
@nz = external local_unnamed_addr global ptr, align 8
@.str.9 = private unnamed_addr constant [21 x i8] c"Col %ld: %ld vs %ld\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "LB", scope: !2, file: !3, line: 43, type: !43, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !38, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "block2.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/cholesky", checksumkind: CSK_MD5, checksum: "ff30868f2ad86316aeca3263664443a0")
!4 = !{!5, !8, !10, !16, !6, !9, !7}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Entry", file: !12, line: 49, baseType: !13)
!12 = !DIFile(filename: "./matrix.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/cholesky", checksumkind: CSK_MD5, checksum: "f19fdb19034f8f693c291706633e8f13")
!13 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 46, size: 64, elements: !14)
!14 = !{!15, !37}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !13, file: !12, line: 47, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Block", file: !12, line: 44, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 36, size: 768, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !18, file: !12, line: 37, baseType: !9, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !18, file: !12, line: 37, baseType: !9, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !18, file: !12, line: 37, baseType: !9, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !18, file: !12, line: 37, baseType: !9, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nmod", scope: !18, file: !12, line: 37, baseType: !9, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !18, file: !12, line: 38, baseType: !9, size: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !18, file: !12, line: 39, baseType: !9, size: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !18, file: !12, line: 40, baseType: !7, size: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !18, file: !12, line: 41, baseType: !8, size: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !18, file: !12, line: 41, baseType: !8, size: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !18, file: !12, line: 42, baseType: !6, size: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !18, file: !12, line: 43, baseType: !32, size: 64, offset: 704)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pair", file: !12, line: 31, size: 128, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !33, file: !12, line: 32, baseType: !9, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !33, file: !12, line: 33, baseType: !32, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !13, file: !12, line: 48, baseType: !7, size: 64)
!38 = !{!0, !39, !41}
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "P_dimi", scope: !2, file: !3, line: 45, type: !9, isLocal: false, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "P_dimj", scope: !2, file: !3, line: 45, type: !9, isLocal: false, isDefinition: true)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMatrix", file: !12, line: 58, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 51, size: 1152, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !44, file: !12, line: 52, baseType: !9, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !44, file: !12, line: 52, baseType: !8, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !44, file: !12, line: 52, baseType: !8, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "n_blocks", scope: !44, file: !12, line: 52, baseType: !9, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !44, file: !12, line: 52, baseType: !9, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "entries_allocated", scope: !44, file: !12, line: 52, baseType: !9, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "partition_size", scope: !44, file: !12, line: 53, baseType: !8, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "renumbering", scope: !44, file: !12, line: 53, baseType: !8, size: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mapI", scope: !44, file: !12, line: 53, baseType: !8, size: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "mapJ", scope: !44, file: !12, line: 53, baseType: !8, size: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !44, file: !12, line: 54, baseType: !8, size: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "domains", scope: !44, file: !12, line: 54, baseType: !8, size: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "n_domains", scope: !44, file: !12, line: 54, baseType: !9, size: 64, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "proc_domains", scope: !44, file: !12, line: 54, baseType: !8, size: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "n_partitions", scope: !44, file: !12, line: 55, baseType: !9, size: 64, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "max_partition", scope: !44, file: !12, line: 55, baseType: !9, size: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "proc_domain_storage", scope: !44, file: !12, line: 56, baseType: !5, size: 64, offset: 1024)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !44, file: !12, line: 57, baseType: !10, size: 64, offset: 1088)
!64 = !{i32 7, !"Dwarf Version", i32 5}
!65 = !{i32 2, !"Debug Info Version", i32 3}
!66 = !{i32 1, !"wchar_size", i32 4}
!67 = !{i32 7, !"PIC Level", i32 2}
!68 = !{i32 7, !"PIE Level", i32 2}
!69 = !{i32 7, !"uwtable", i32 2}
!70 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!71 = distinct !DISubprogram(name: "CreateBlockedMatrix2", scope: !3, file: !3, line: 49, type: !72, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !83)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74, !9, !8, !8, !8, !8, !8, !8, !8}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMatrix", file: !12, line: 29, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 26, size: 384, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !75, file: !12, line: 27, baseType: !9, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !75, file: !12, line: 27, baseType: !9, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !75, file: !12, line: 27, baseType: !8, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "startrow", scope: !75, file: !12, line: 27, baseType: !8, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !75, file: !12, line: 27, baseType: !8, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !75, file: !12, line: 28, baseType: !6, size: 64, offset: 320)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!84 = !DILocalVariable(name: "M", arg: 1, scope: !71, file: !3, line: 49, type: !74)
!85 = !DILocalVariable(name: "block_ub", arg: 2, scope: !71, file: !3, line: 49, type: !9)
!86 = !DILocalVariable(name: "T", arg: 3, scope: !71, file: !3, line: 49, type: !8)
!87 = !DILocalVariable(name: "firstchild", arg: 4, scope: !71, file: !3, line: 49, type: !8)
!88 = !DILocalVariable(name: "child", arg: 5, scope: !71, file: !3, line: 49, type: !8)
!89 = !DILocalVariable(name: "PERM", arg: 6, scope: !71, file: !3, line: 49, type: !8)
!90 = !DILocalVariable(name: "INVP", arg: 7, scope: !71, file: !3, line: 49, type: !8)
!91 = !DILocalVariable(name: "domain", arg: 8, scope: !71, file: !3, line: 49, type: !8)
!92 = !DILocalVariable(name: "partition", arg: 9, scope: !71, file: !3, line: 49, type: !8)
!93 = !DILocalVariable(name: "i", scope: !71, file: !3, line: 51, type: !9)
!94 = !DILocalVariable(name: "j", scope: !71, file: !3, line: 51, type: !9)
!95 = !DILocalVariable(name: "k", scope: !71, file: !3, line: 51, type: !9)
!96 = !DILocalVariable(name: "p", scope: !71, file: !3, line: 51, type: !9)
!97 = !DILocalVariable(name: "which", scope: !71, file: !3, line: 51, type: !9)
!98 = !DILocalVariable(name: "super", scope: !71, file: !3, line: 51, type: !9)
!99 = !DILocalVariable(name: "n_nz", scope: !71, file: !3, line: 51, type: !9)
!100 = !DILocalVariable(name: "structure", scope: !71, file: !3, line: 52, type: !8)
!101 = !DILocalVariable(name: "nz", scope: !71, file: !3, line: 52, type: !8)
!102 = !DILocalVariable(name: "blocks", scope: !71, file: !3, line: 53, type: !16)
!103 = !DILocalVariable(name: "num_partitions", scope: !71, file: !3, line: 56, type: !9)
!104 = !DILocalVariable(name: "piece_size", scope: !71, file: !3, line: 56, type: !9)
!105 = !DILocalVariable(name: "piece", scope: !71, file: !3, line: 56, type: !9)
!106 = !DILocalVariable(name: "current", scope: !71, file: !3, line: 56, type: !9)
!107 = !DILocation(line: 49, column: 35, scope: !71)
!108 = !DILocation(line: 0, scope: !71)
!109 = !DILocation(line: 51, column: 3, scope: !71)
!110 = !DILocation(line: 58, column: 12, scope: !71)
!111 = !DILocation(line: 58, column: 8, scope: !71)
!112 = !DILocation(line: 59, column: 13, scope: !71)
!113 = !DILocation(line: 60, column: 16, scope: !71)
!114 = !DILocation(line: 60, column: 14, scope: !71)
!115 = !DILocation(line: 61, column: 21, scope: !71)
!116 = !DILocation(line: 61, column: 19, scope: !71)
!117 = !DILocation(line: 62, column: 31, scope: !71)
!118 = !DILocation(line: 62, column: 18, scope: !71)
!119 = !DILocation(line: 62, column: 16, scope: !71)
!120 = !DILocation(line: 63, column: 34, scope: !71)
!121 = !DILocation(line: 63, column: 24, scope: !71)
!122 = !DILocation(line: 65, column: 61, scope: !71)
!123 = !DILocation(line: 65, column: 40, scope: !71)
!124 = !DILocation(line: 65, column: 26, scope: !71)
!125 = !DILocation(line: 67, column: 18, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !3, line: 67, column: 3)
!127 = distinct !DILexicalBlock(scope: !71, file: !3, line: 67, column: 3)
!128 = !DILocation(line: 67, column: 14, scope: !126)
!129 = !DILocation(line: 67, column: 3, scope: !127)
!130 = !DILocation(line: 68, column: 31, scope: !126)
!131 = distinct !{!131, !129, !132, !133, !134}
!132 = !DILocation(line: 68, column: 33, scope: !127)
!133 = !{!"llvm.loop.mustprogress"}
!134 = !{!"llvm.loop.unroll.disable"}
!135 = !DILocation(line: 68, column: 8, scope: !126)
!136 = !DILocation(line: 68, column: 5, scope: !126)
!137 = !DILocation(line: 67, column: 30, scope: !126)
!138 = !DILocation(line: 71, column: 45, scope: !71)
!139 = !DILocation(line: 71, column: 46, scope: !71)
!140 = !DILocation(line: 71, column: 62, scope: !71)
