; ModuleID = 'code.c'
source_filename = "code.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.local_memory = type { [512 x i64], double, double, i64, i64, i64, [3 x double], [3 x double], i64, i64, i64, ptr, i64, ptr, i64, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, ptr, [3 x double], double, [3 x double], [3 x double], double, ptr, ptr, [3 x i64], double, [3 x double], [3 x [3 x double]], [3 x [3 x double]], [2 x [3 x double]], [3 x double], [512 x i64] }
%struct.GlobalMemory = type { i64, i64, i64, double, [3 x double], [3 x [3 x double]], [3 x [3 x double]], [2 x [3 x double]], [3 x double], ptr, [3 x double], [3 x double], [3 x double], double, %struct.anon.2, %struct.anon.3, %struct.anon.4, %struct.anon.5, %struct.anon.6, %struct.anon.7, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.anon.2 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.0, [2 x i32], [2 x i32], i32, i32, [2 x i32] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__threads__", scope: !2, file: !3, line: 84, type: !73, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !251, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "code.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/barnes", checksumkind: CSK_MD5, checksum: "c71dfd80521f7b3989601dbdde4df9e2")
!4 = !{!5, !8, !9, !10, !100, !39, !15, !21, !205, !241, !242, !243, !244, !225, !19}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !8}
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalMemory", file: !12, line: 56, size: 9856, elements: !13)
!12 = !DIFile(filename: "./code.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/barnes", checksumkind: CSK_MD5, checksum: "2ff2adb21cb5fef024ace023328c5df5")
!13 = !{!14, !16, !17, !18, !22, !26, !31, !32, !37, !38, !115, !116, !117, !118, !119, !153, !159, !165, !171, !177, !183, !184, !185, !186, !187, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "n2bcalc", scope: !11, file: !12, line: 57, baseType: !15, size: 64)
!15 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nbccalc", scope: !11, file: !12, line: 58, baseType: !15, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "selfint", scope: !11, file: !12, line: 59, baseType: !15, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "mtot", scope: !11, file: !12, line: 60, baseType: !19, size: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !20, line: 70, baseType: !21)
!20 = !DIFile(filename: "./stdinc.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/barnes", checksumkind: CSK_MD5, checksum: "7e5b049cdc5bbb3d00ff9fe2a55bf64e")
!21 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "etot", scope: !11, file: !12, line: 61, baseType: !23, size: 192, offset: 256)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 3)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "keten", scope: !11, file: !12, line: 62, baseType: !27, size: 576, offset: 448)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !28, line: 30, baseType: !29)
!28 = !DIFile(filename: "./vectmath.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/barnes", checksumkind: CSK_MD5, checksum: "0ae09f78c47e66d21f2861f9ccfce29c")
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 576, elements: !30)
!30 = !{!25, !25}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "peten", scope: !11, file: !12, line: 63, baseType: !27, size: 576, offset: 1024)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cmphase", scope: !11, file: !12, line: 64, baseType: !33, size: 384, offset: 1600)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 384, elements: !35)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector", file: !28, line: 30, baseType: !23)
!35 = !{!36}
!36 = !DISubrange(count: 2)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "amvec", scope: !11, file: !12, line: 65, baseType: !34, size: 192, offset: 1984)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "G_root", scope: !11, file: !12, line: 66, baseType: !39, size: 64, offset: 2176)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "cellptr", file: !40, line: 83, baseType: !41)
!40 = !DIFile(filename: "./defs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/barnes", checksumkind: CSK_MD5, checksum: "a70fd3172df660c9d5c631c3b06e5de2")
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cell", file: !40, line: 110, size: 1792, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !97, !98}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !40, line: 111, baseType: !15, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !42, file: !40, line: 112, baseType: !19, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !42, file: !40, line: 113, baseType: !34, size: 192, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !42, file: !40, line: 114, baseType: !15, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !42, file: !40, line: 115, baseType: !15, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !42, file: !40, line: 116, baseType: !39, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "child_num", scope: !42, file: !40, line: 117, baseType: !15, size: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !42, file: !40, line: 118, baseType: !15, size: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !40, line: 119, baseType: !41, size: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !42, file: !40, line: 119, baseType: !41, size: 64, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !42, file: !40, line: 120, baseType: !15, size: 64, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "done_cv", scope: !42, file: !40, line: 124, baseType: !56, size: 384, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !57, line: 80, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!58 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !57, line: 75, size: 384, elements: !59)
!59 = !{!60, !90, !95}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !58, file: !57, line: 77, baseType: !61, size: 384)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !62, line: 92, size: 384, elements: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!63 = !{!64, !75, !84, !86, !87, !88, !89}
!64 = !DIDerivedType(tag: DW_TAG_member, scope: !61, file: !62, line: 94, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !61, file: !62, line: 94, size: 64, elements: !66)
!66 = !{!67, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !65, file: !62, line: 96, baseType: !68, size: 64)
!68 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !65, file: !62, line: 101, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !65, file: !62, line: 97, size: 64, elements: !71)
!71 = !{!72, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !70, file: !62, line: 99, baseType: !73, size: 32)
!73 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !70, file: !62, line: 100, baseType: !73, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, scope: !61, file: !62, line: 103, baseType: !76, size: 64, offset: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !61, file: !62, line: 103, size: 64, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !76, file: !62, line: 105, baseType: !68, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !76, file: !62, line: 110, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !62, line: 106, size: 64, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !80, file: !62, line: 108, baseType: !73, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !80, file: !62, line: 109, baseType: !73, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !61, file: !62, line: 112, baseType: !85, size: 64, offset: 128)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !35)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !61, file: !62, line: 113, baseType: !85, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !61, file: !62, line: 114, baseType: !73, size: 32, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !61, file: !62, line: 115, baseType: !73, size: 32, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !61, file: !62, line: 116, baseType: !85, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !58, file: !57, line: 78, baseType: !91, size: 384)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 384, elements: !93)
!92 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!93 = !{!94}
!94 = !DISubrange(count: 48)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !58, file: !57, line: 79, baseType: !96, size: 64)
!96 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !42, file: !40, line: 125, baseType: !15, size: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "subp", scope: !42, file: !40, line: 126, baseType: !99, size: 512, offset: 1280)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 512, elements: !113)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "nodeptr", file: !40, line: 67, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !40, line: 65, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_node", file: !40, line: 56, size: 576, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !112}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !103, file: !40, line: 57, baseType: !15, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !103, file: !40, line: 58, baseType: !19, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !103, file: !40, line: 59, baseType: !34, size: 192, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !103, file: !40, line: 60, baseType: !15, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !103, file: !40, line: 61, baseType: !15, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !103, file: !40, line: 62, baseType: !111, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "child_num", scope: !103, file: !40, line: 63, baseType: !15, size: 64, offset: 512)
!113 = !{!114}
!114 = !DISubrange(count: 8)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rmin", scope: !11, file: !12, line: 67, baseType: !34, size: 192, offset: 2240)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !11, file: !12, line: 68, baseType: !34, size: 192, offset: 2432)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !11, file: !12, line: 69, baseType: !34, size: 192, offset: 2624)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !11, file: !12, line: 70, baseType: !19, size: 64, offset: 2816)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Barstart", scope: !11, file: !12, line: 71, baseType: !120, size: 768, offset: 2880)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !12, line: 71, size: 768, elements: !121)
!121 = !{!122, !151, !152}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !120, file: !12, line: 71, baseType: !123, size: 320)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !57, line: 72, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !57, line: 67, size: 320, elements: !125)
!125 = !{!126, !146, !150}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !124, file: !57, line: 69, baseType: !127, size: 320)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !128, line: 22, size: 320, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!129 = !{!130, !132, !133, !134, !135, !136, !138, !139}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !127, file: !128, line: 24, baseType: !131, size: 32)
!131 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !127, file: !128, line: 25, baseType: !73, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !127, file: !128, line: 26, baseType: !131, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !127, file: !128, line: 28, baseType: !73, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !127, file: !128, line: 32, baseType: !131, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !127, file: !128, line: 34, baseType: !137, size: 16, offset: 160)
!137 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !127, file: !128, line: 35, baseType: !137, size: 16, offset: 176)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !127, file: !128, line: 36, baseType: !140, size: 128, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !62, line: 53, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !62, line: 49, size: 128, elements: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !141, file: !62, line: 51, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !141, file: !62, line: 52, baseType: !144, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !124, file: !57, line: 70, baseType: !147, size: 320)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 320, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 40)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !124, file: !57, line: 71, baseType: !15, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !120, file: !12, line: 71, baseType: !56, size: 384, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !120, file: !12, line: 71, baseType: !73, size: 32, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Bartree", scope: !11, file: !12, line: 72, baseType: !154, size: 768, offset: 3648)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !12, line: 72, size: 768, elements: !155)
!155 = !{!156, !157, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !154, file: !12, line: 72, baseType: !123, size: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !154, file: !12, line: 72, baseType: !56, size: 384, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !154, file: !12, line: 72, baseType: !73, size: 32, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Barcom", scope: !11, file: !12, line: 73, baseType: !160, size: 768, offset: 4416)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !12, line: 73, size: 768, elements: !161)
!161 = !{!162, !163, !164}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !160, file: !12, line: 73, baseType: !123, size: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !160, file: !12, line: 73, baseType: !56, size: 384, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !160, file: !12, line: 73, baseType: !73, size: 32, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Barload", scope: !11, file: !12, line: 74, baseType: !166, size: 768, offset: 5184)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !12, line: 74, size: 768, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !166, file: !12, line: 74, baseType: !123, size: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !166, file: !12, line: 74, baseType: !56, size: 384, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !166, file: !12, line: 74, baseType: !73, size: 32, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Baraccel", scope: !11, file: !12, line: 75, baseType: !172, size: 768, offset: 5952)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !12, line: 75, size: 768, elements: !173)
!173 = !{!174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !172, file: !12, line: 75, baseType: !123, size: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !172, file: !12, line: 75, baseType: !56, size: 384, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !172, file: !12, line: 75, baseType: !73, size: 32, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Barpos", scope: !11, file: !12, line: 76, baseType: !178, size: 768, offset: 6720)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !12, line: 76, size: 768, elements: !179)
!179 = !{!180, !181, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !178, file: !12, line: 76, baseType: !123, size: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !178, file: !12, line: 76, baseType: !56, size: 384, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !178, file: !12, line: 76, baseType: !73, size: 32, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "CountLock", scope: !11, file: !12, line: 77, baseType: !123, size: 320, offset: 7488)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "NcellLock", scope: !11, file: !12, line: 78, baseType: !123, size: 320, offset: 7808)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "NleafLock", scope: !11, file: !12, line: 79, baseType: !123, size: 320, offset: 8128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "io_lock", scope: !11, file: !12, line: 80, baseType: !123, size: 320, offset: 8448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "createstart", scope: !11, file: !12, line: 81, baseType: !188, size: 64, offset: 8768)
!188 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "createend", scope: !11, file: !12, line: 81, baseType: !188, size: 64, offset: 8832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "computestart", scope: !11, file: !12, line: 81, baseType: !188, size: 64, offset: 8896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "computeend", scope: !11, file: !12, line: 81, baseType: !188, size: 64, offset: 8960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "trackstart", scope: !11, file: !12, line: 82, baseType: !188, size: 64, offset: 9024)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "trackend", scope: !11, file: !12, line: 82, baseType: !188, size: 64, offset: 9088)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tracktime", scope: !11, file: !12, line: 82, baseType: !188, size: 64, offset: 9152)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "partitionstart", scope: !11, file: !12, line: 83, baseType: !188, size: 64, offset: 9216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "partitionend", scope: !11, file: !12, line: 83, baseType: !188, size: 64, offset: 9280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "partitiontime", scope: !11, file: !12, line: 83, baseType: !188, size: 64, offset: 9344)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "treebuildstart", scope: !11, file: !12, line: 84, baseType: !188, size: 64, offset: 9408)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "treebuildend", scope: !11, file: !12, line: 84, baseType: !188, size: 64, offset: 9472)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "treebuildtime", scope: !11, file: !12, line: 84, baseType: !188, size: 64, offset: 9536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "forcecalcstart", scope: !11, file: !12, line: 85, baseType: !188, size: 64, offset: 9600)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "forcecalcend", scope: !11, file: !12, line: 85, baseType: !188, size: 64, offset: 9664)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "forcecalctime", scope: !11, file: !12, line: 85, baseType: !188, size: 64, offset: 9728)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "current_id", scope: !11, file: !12, line: 86, baseType: !15, size: 64, offset: 9792)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "leafptr", file: !40, line: 82, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_leaf", file: !40, line: 137, size: 1984, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !40, line: 138, baseType: !15, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !207, file: !40, line: 139, baseType: !19, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !207, file: !40, line: 140, baseType: !34, size: 192, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !207, file: !40, line: 141, baseType: !15, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !207, file: !40, line: 142, baseType: !15, size: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !207, file: !40, line: 143, baseType: !39, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "child_num", scope: !207, file: !40, line: 144, baseType: !15, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !207, file: !40, line: 145, baseType: !15, size: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !40, line: 146, baseType: !206, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !207, file: !40, line: 146, baseType: !206, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !207, file: !40, line: 147, baseType: !15, size: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "done_cv", scope: !207, file: !40, line: 151, baseType: !56, size: 384, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !207, file: !40, line: 152, baseType: !15, size: 64, offset: 1216)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_bodies", scope: !207, file: !40, line: 153, baseType: !15, size: 64, offset: 1280)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bodyp", scope: !207, file: !40, line: 154, baseType: !224, size: 640, offset: 1344)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 640, elements: !239)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "bodyptr", file: !40, line: 81, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_body", file: !40, line: 87, size: 1024, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !227, file: !40, line: 88, baseType: !15, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !227, file: !40, line: 89, baseType: !19, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !227, file: !40, line: 90, baseType: !34, size: 192, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !227, file: !40, line: 91, baseType: !15, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !227, file: !40, line: 92, baseType: !15, size: 64, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !227, file: !40, line: 93, baseType: !205, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "child_num", scope: !227, file: !40, line: 94, baseType: !15, size: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "vel", scope: !227, file: !40, line: 95, baseType: !34, size: 192, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !227, file: !40, line: 96, baseType: !34, size: 192, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !227, file: !40, line: 97, baseType: !19, size: 64, offset: 960)
!239 = !{!240}
!240 = !DISubrange(count: 10)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CellLockType", file: !12, line: 52, size: 655360, elements: !246)
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "CL", scope: !245, file: !12, line: 53, baseType: !248, size: 655360)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 655360, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 2048)
!251 = !{!0, !252, !259, !265, !267, !269, !271, !273, !275, !277, !279, !281, !283, !285, !287, !289, !291, !293, !295, !297, !299, !301, !303, !305, !307, !309, !311, !313, !365, !370}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "defv", scope: !2, file: !3, line: 92, type: !254, isLocal: false, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 768, elements: !257)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", file: !20, line: 64, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!257 = !{!258}
!258 = !DISubrange(count: 12)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "__tid__", scope: !2, file: !3, line: 83, type: !261, isLocal: false, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 16384, elements: !263)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !57, line: 27, baseType: !188)
!263 = !{!264}
!264 = !DISubrange(count: 256)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "__intern__", scope: !2, file: !3, line: 85, type: !123, isLocal: false, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "headline", scope: !2, file: !12, line: 29, type: !255, isLocal: false, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "infile", scope: !2, file: !12, line: 30, type: !255, isLocal: false, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "outfile", scope: !2, file: !12, line: 31, type: !255, isLocal: false, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "dtime", scope: !2, file: !12, line: 32, type: !19, isLocal: false, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "dtout", scope: !2, file: !12, line: 33, type: !19, isLocal: false, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "tstop", scope: !2, file: !12, line: 34, type: !19, isLocal: false, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "nbody", scope: !2, file: !12, line: 35, type: !15, isLocal: false, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "fcells", scope: !2, file: !12, line: 36, type: !19, isLocal: false, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "fleaves", scope: !2, file: !12, line: 37, type: !19, isLocal: false, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "tol", scope: !2, file: !12, line: 38, type: !19, isLocal: false, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "tolsq", scope: !2, file: !12, line: 39, type: !19, isLocal: false, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "eps", scope: !2, file: !12, line: 40, type: !19, isLocal: false, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "epssq", scope: !2, file: !12, line: 41, type: !19, isLocal: false, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "dthf", scope: !2, file: !12, line: 42, type: !19, isLocal: false, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "NPROC", scope: !2, file: !12, line: 43, type: !15, isLocal: false, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "maxcell", scope: !2, file: !12, line: 45, type: !15, isLocal: false, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "maxleaf", scope: !2, file: !12, line: 46, type: !15, isLocal: false, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "maxmybody", scope: !2, file: !12, line: 47, type: !15, isLocal: false, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "maxmycell", scope: !2, file: !12, line: 48, type: !15, isLocal: false, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "maxmyleaf", scope: !2, file: !12, line: 49, type: !15, isLocal: false, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "bodytab", scope: !2, file: !12, line: 50, type: !225, isLocal: false, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "CellLock", scope: !2, file: !12, line: 54, type: !244, isLocal: false, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "Global", scope: !2, file: !12, line: 88, type: !10, isLocal: false, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "Local", scope: !2, file: !12, line: 142, type: !315, isLocal: false, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 72024064, elements: !363)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "local_memory", file: !12, line: 93, size: 70336, elements: !317)
!317 = !{!318, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !346, !347, !348, !349, !350, !351, !352, !353, !354, !356, !357, !358, !359, !360, !361, !362}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pad_begin", scope: !316, file: !12, line: 95, baseType: !319, size: 32768)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32768, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tnow", scope: !316, file: !12, line: 97, baseType: !19, size: 64, offset: 32768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tout", scope: !316, file: !12, line: 98, baseType: !19, size: 64, offset: 32832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nstep", scope: !316, file: !12, line: 99, baseType: !15, size: 64, offset: 32896)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "workMin", scope: !316, file: !12, line: 101, baseType: !15, size: 64, offset: 32960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "workMax", scope: !316, file: !12, line: 101, baseType: !15, size: 64, offset: 33024)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !316, file: !12, line: 103, baseType: !34, size: 192, offset: 33088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !316, file: !12, line: 103, baseType: !34, size: 192, offset: 33280)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mynumcell", scope: !316, file: !12, line: 105, baseType: !15, size: 64, offset: 33472)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mynumleaf", scope: !316, file: !12, line: 106, baseType: !15, size: 64, offset: 33536)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mynbody", scope: !316, file: !12, line: 107, baseType: !15, size: 64, offset: 33600)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mybodytab", scope: !316, file: !12, line: 108, baseType: !241, size: 64, offset: 33664)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "myncell", scope: !316, file: !12, line: 109, baseType: !15, size: 64, offset: 33728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mycelltab", scope: !316, file: !12, line: 110, baseType: !242, size: 64, offset: 33792)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mynleaf", scope: !316, file: !12, line: 111, baseType: !15, size: 64, offset: 33856)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "myleaftab", scope: !316, file: !12, line: 112, baseType: !243, size: 64, offset: 33920)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ctab", scope: !316, file: !12, line: 113, baseType: !39, size: 64, offset: 33984)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ltab", scope: !316, file: !12, line: 114, baseType: !205, size: 64, offset: 34048)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "myn2bcalc", scope: !316, file: !12, line: 116, baseType: !15, size: 64, offset: 34112)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mynbccalc", scope: !316, file: !12, line: 117, baseType: !15, size: 64, offset: 34176)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "myselfint", scope: !316, file: !12, line: 118, baseType: !15, size: 64, offset: 34240)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "myn2bterm", scope: !316, file: !12, line: 119, baseType: !15, size: 64, offset: 34304)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mynbcterm", scope: !316, file: !12, line: 120, baseType: !15, size: 64, offset: 34368)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "skipself", scope: !316, file: !12, line: 121, baseType: !345, size: 64, offset: 34432)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !20, line: 45, baseType: !15)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pskip", scope: !316, file: !12, line: 122, baseType: !225, size: 64, offset: 34496)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !316, file: !12, line: 123, baseType: !34, size: 192, offset: 34560)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "phi0", scope: !316, file: !12, line: 124, baseType: !19, size: 64, offset: 34752)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "acc0", scope: !316, file: !12, line: 125, baseType: !34, size: 192, offset: 34816)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dr", scope: !316, file: !12, line: 126, baseType: !34, size: 192, offset: 35008)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "drsq", scope: !316, file: !12, line: 127, baseType: !19, size: 64, offset: 35200)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pmem", scope: !316, file: !12, line: 128, baseType: !100, size: 64, offset: 35264)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Current_Root", scope: !316, file: !12, line: 130, baseType: !100, size: 64, offset: 35328)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Root_Coords", scope: !316, file: !12, line: 131, baseType: !355, size: 192, offset: 35392)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, elements: !24)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mymtot", scope: !316, file: !12, line: 133, baseType: !19, size: 64, offset: 35584)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "myetot", scope: !316, file: !12, line: 134, baseType: !23, size: 192, offset: 35648)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "myketen", scope: !316, file: !12, line: 135, baseType: !27, size: 576, offset: 35840)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mypeten", scope: !316, file: !12, line: 136, baseType: !27, size: 576, offset: 36416)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mycmphase", scope: !316, file: !12, line: 137, baseType: !33, size: 384, offset: 36992)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "myamvec", scope: !316, file: !12, line: 138, baseType: !34, size: 192, offset: 37376)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pad_end", scope: !316, file: !12, line: 140, baseType: !319, size: 32768, offset: 37568)
!363 = !{!364}
!364 = !DISubrange(count: 1024)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "Child_Sequence", scope: !2, file: !3, line: 150, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 16384, elements: !368)
!368 = !{!369, !114}
!369 = !DISubrange(count: 32)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "Direction_Sequence", scope: !2, file: !3, line: 187, type: !367, isLocal: true, isDefinition: true)
!372 = !{i32 7, !"Dwarf Version", i32 5}
!373 = !{i32 2, !"Debug Info Version", i32 3}
!374 = !{i32 1, !"wchar_size", i32 4}
!375 = !{i32 7, !"PIC Level", i32 2}
!376 = !{i32 7, !"PIE Level", i32 2}
!377 = !{i32 7, !"uwtable", i32 2}
!378 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!379 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 256, type: !380, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !383)
!380 = !DISubroutineType(types: !381)
!381 = !{!131, !131, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!383 = !{!384, !385, !386, !387, !389, !390}
!384 = !DILocalVariable(name: "argc", arg: 1, scope: !379, file: !3, line: 256, type: !131)
!385 = !DILocalVariable(name: "argv", arg: 2, scope: !379, file: !3, line: 256, type: !382)
!386 = !DILocalVariable(name: "c", scope: !379, file: !3, line: 258, type: !15)
!387 = !DILocalVariable(name: "i", scope: !388, file: !3, line: 291, type: !15)
!388 = distinct !DILexicalBlock(scope: !379, file: !3, line: 290, column: 4)
!389 = !DILocalVariable(name: "Error", scope: !388, file: !3, line: 291, type: !15)
!390 = !DILocalVariable(name: "aantal", scope: !391, file: !3, line: 306, type: !131)
!391 = distinct !DILexicalBlock(scope: !379, file: !3, line: 306, column: 4)
!392 = !DILocation(line: 0, scope: !379)
!393 = !DILocation(line: 260, column: 16, scope: !379)
!394 = !DILocation(line: 260, column: 4, scope: !379)
!395 = !DILocation(line: 263, column: 2, scope: !396)
!396 = distinct !DILexicalBlock(scope: !397, file: !3, line: 261, column: 16)
!397 = distinct !DILexicalBlock(scope: !379, file: !3, line: 260, column: 48)
!398 = !DILocation(line: 264, column: 2, scope: !396)
!399 = !DILocation(line: 267, column: 10, scope: !396)
!400 = !DILocation(line: 267, column: 2, scope: !396)
!401 = !DILocation(line: 268, column: 2, scope: !396)
!402 = !DILocation(line: 273, column: 11, scope: !379)
!403 = !DILocation(line: 274, column: 4, scope: !379)
!404 = !DILocation(line: 275, column: 4, scope: !379)
!405 = !DILocation(line: 276, column: 4, scope: !379)
!406 = !DILocation(line: 277, column: 4, scope: !379)
!407 = !DILocation(line: 279, column: 4, scope: !379)
!408 = !DILocation(line: 279, column: 12, scope: !379)
!409 = !DILocation(line: 279, column: 22, scope: !379)
!410 = !DILocation(line: 280, column: 12, scope: !379)
!411 = !DILocation(line: 280, column: 26, scope: !379)
!412 = !DILocation(line: 281, column: 12, scope: !379)
!413 = !DILocation(line: 281, column: 26, scope: !379)
!414 = !DILocation(line: 282, column: 12, scope: !379)
!415 = !DILocation(line: 282, column: 26, scope: !379)
!416 = !DILocation(line: 285, column: 43, scope: !417)
!417 = distinct !DILexicalBlock(scope: !379, file: !3, line: 285, column: 4)
!418 = !DILocation(line: 285, column: 19, scope: !417)
!419 = !DILocation(line: 285, column: 27, scope: !417)
!420 = !DILocation(line: 285, column: 41, scope: !417)
!421 = !DILocation(line: 287, column: 4, scope: !379)
!422 = !DILocation(line: 293, column: 2, scope: !388)
!423 = !DILocation(line: 294, column: 2, scope: !388)
