; ModuleID = 'cr.c'
source_filename = "cr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.grid = type { i64, ptr, ptr, ptr, i64, [3 x i64], i64, [3 x double], [3 x double], i64, ptr, ptr }
%struct.voxel = type { i64, i64, ptr, ptr, i8, [7 x i8] }
%struct.bbox = type { [3 x double], [3 x double] }
%struct.element = type { i64, ptr, ptr, %struct.bbox }
%struct.btnode = type { ptr, [3 x double], i64, [3 x i64], [3 x i64], i64, i64, [2 x ptr] }

@gridlist = dso_local local_unnamed_addr global ptr null, align 8, !dbg !0
@stderr = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [21 x i8] c"    Print Gridlist \0A\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"    End Gridlist \0A\00", align 1
@.str.5 = private unnamed_addr constant [48 x i8] c"    gridsize                             %3ld \0A\00", align 1
@hu_gridsize = external local_unnamed_addr global i64, align 8
@.str.6 = private unnamed_addr constant [48 x i8] c"    hashtable buckets                    %3ld \0A\00", align 1
@hu_numbuckets = external local_unnamed_addr global i64, align 8
@.str.7 = private unnamed_addr constant [48 x i8] c"    maximum subdivision level            %3ld \0A\00", align 1
@hu_max_subdiv_level = external local_unnamed_addr global i64, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "gridlist", scope: !2, file: !3, line: 37, type: !85, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !84, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "cr.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "dcc2bfb76e263c61baccfaec2fd92c4a")
!4 = !{!5, !6, !7, !10, !13, !14, !16}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !8, line: 298, baseType: !9)
!8 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!9 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !8, line: 287, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "R64", file: !8, line: 309, baseType: !6)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !8, line: 297, baseType: !15)
!15 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT", file: !8, line: 481, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "element", file: !8, line: 474, size: 576, elements: !20)
!20 = !{!21, !22, !82, !83}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !19, file: !8, line: 476, baseType: !14, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !19, file: !8, line: 477, baseType: !23, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !8, line: 488, size: 1024, elements: !25)
!25 = !{!26, !27, !31, !41, !42, !43, !67, !81}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !24, file: !8, line: 490, baseType: !14, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !24, file: !8, line: 491, baseType: !28, size: 256, offset: 64)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !24, file: !8, line: 492, baseType: !32, size: 384, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", file: !8, line: 418, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbox", file: !8, line: 413, size: 384, elements: !34)
!34 = !{!35, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "dnear", scope: !33, file: !8, line: 415, baseType: !36, size: 192)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 192, elements: !38)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "REAL", file: !8, line: 310, baseType: !6)
!38 = !{!39}
!39 = !DISubrange(count: 3)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "dfar", scope: !33, file: !8, line: 416, baseType: !36, size: 192, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !24, file: !8, line: 493, baseType: !17, size: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !24, file: !8, line: 494, baseType: !14, size: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !24, file: !8, line: 495, baseType: !44, size: 64, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROCS", file: !8, line: 340, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pprocs", file: !8, line: 327, size: 640, elements: !47)
!47 = !{!48, !52, !56, !57, !58, !59, !63, !64, !65, !66}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !46, file: !8, line: 329, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!10, null}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !46, file: !8, line: 330, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, null}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !46, file: !8, line: 331, baseType: !53, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "binread", scope: !46, file: !8, line: 332, baseType: !53, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !46, file: !8, line: 333, baseType: !53, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "intersect", scope: !46, file: !8, line: 334, baseType: !60, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!14, null}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pe_intersect", scope: !46, file: !8, line: 335, baseType: !60, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !46, file: !8, line: 336, baseType: !53, size: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "normalize", scope: !46, file: !8, line: 337, baseType: !53, size: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !46, file: !8, line: 338, baseType: !53, size: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "surf", scope: !24, file: !8, line: 496, baseType: !68, size: 64, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "SURF", file: !8, line: 357, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "surf", file: !8, line: 347, size: 704, elements: !71)
!71 = !{!72, !75, !76, !77, !78, !79, !80}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "fcolor", scope: !70, file: !8, line: 349, baseType: !73, size: 192)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOR", file: !8, line: 319, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC3", file: !8, line: 314, baseType: !36)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "bcolor", scope: !70, file: !8, line: 350, baseType: !73, size: 192, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "kdiff", scope: !70, file: !8, line: 351, baseType: !37, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kspec", scope: !70, file: !8, line: 352, baseType: !37, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ktran", scope: !70, file: !8, line: 353, baseType: !37, size: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "refrindex", scope: !70, file: !8, line: 354, baseType: !37, size: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "kspecn", scope: !70, file: !8, line: 355, baseType: !37, size: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !8, line: 497, baseType: !23, size: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !8, line: 478, baseType: !10, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !19, file: !8, line: 479, baseType: !32, size: 384, offset: 192)
!84 = !{!0}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRID", file: !8, line: 572, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "grid", file: !8, line: 539, size: 1152, elements: !88)
!88 = !{!89, !90, !106, !108, !109, !110, !112, !113, !114, !115, !116, !133}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !87, file: !8, line: 541, baseType: !14, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !87, file: !8, line: 542, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOXEL", file: !8, line: 405, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "voxel", file: !8, line: 394, size: 320, elements: !95)
!95 = !{!96, !97, !98, !100, !101, !102}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !94, file: !8, line: 396, baseType: !14, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !94, file: !8, line: 397, baseType: !14, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !8, line: 398, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cell", scope: !94, file: !8, line: 399, baseType: !10, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "celltype", scope: !94, file: !8, line: 400, baseType: !11, size: 8, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !94, file: !8, line: 403, baseType: !103, size: 56, offset: 264)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 56, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 7)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "emptycells", scope: !87, file: !8, line: 548, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pepa", scope: !87, file: !8, line: 555, baseType: !16, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "num_prims", scope: !87, file: !8, line: 556, baseType: !14, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc", scope: !87, file: !8, line: 558, baseType: !111, size: 192, offset: 320)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, elements: !38)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !87, file: !8, line: 562, baseType: !14, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !87, file: !8, line: 563, baseType: !36, size: 192, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cellsize", scope: !87, file: !8, line: 564, baseType: !36, size: 192, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv_level", scope: !87, file: !8, line: 566, baseType: !14, size: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bintree", scope: !87, file: !8, line: 569, baseType: !117, size: 64, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "BTNODE", file: !8, line: 535, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btnode", file: !8, line: 522, size: 960, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !119, file: !8, line: 524, baseType: !16, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !119, file: !8, line: 525, baseType: !36, size: 192, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nprims", scope: !119, file: !8, line: 527, baseType: !14, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !119, file: !8, line: 528, baseType: !111, size: 192, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !119, file: !8, line: 529, baseType: !111, size: 192, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !119, file: !8, line: 531, baseType: !14, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "totalPrimsAllocated", scope: !119, file: !8, line: 532, baseType: !14, size: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "btn", scope: !119, file: !8, line: 533, baseType: !129, size: 128, offset: 832)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, elements: !131)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!131 = !{!132}
!132 = !DISubrange(count: 2)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !8, line: 570, baseType: !134, size: 64, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!135 = !{i32 7, !"Dwarf Version", i32 5}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = !{i32 7, !"PIC Level", i32 2}
!139 = !{i32 7, !"PIE Level", i32 2}
!140 = !{i32 7, !"uwtable", i32 2}
!141 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!142 = distinct !DISubprogram(name: "prn_gridlist", scope: !3, file: !3, line: 57, type: !143, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{null}
!145 = !{!146}
!146 = !DILocalVariable(name: "g", scope: !142, file: !3, line: 59, type: !85)
!147 = !DILocation(line: 61, column: 10, scope: !142)
!148 = !DILocation(line: 61, column: 2, scope: !142)
!149 = !DILocation(line: 0, scope: !142)
!150 = !DILocation(line: 64, column: 11, scope: !142)
!151 = !DILocation(line: 64, column: 2, scope: !142)
!152 = !DILocation(line: 66, column: 3, scope: !153)
!153 = distinct !DILexicalBlock(scope: !142, file: !3, line: 65, column: 3)
!154 = !DILocation(line: 67, column: 10, scope: !153)
!155 = distinct !{!155, !151, !156, !157, !158}
!156 = !DILocation(line: 68, column: 3, scope: !142)
!157 = !{!"llvm.loop.mustprogress"}
!158 = !{!"llvm.loop.unroll.disable"}
!159 = !DILocation(line: 70, column: 10, scope: !142)
!160 = !DILocation(line: 70, column: 2, scope: !142)
!161 = !DILocation(line: 71, column: 2, scope: !142)
!162 = !DISubprogram(name: "prn_grid", scope: !8, file: !8, line: 855, type: !163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !85}
!165 = !{}
!166 = distinct !DISubprogram(name: "prn_ds_stats", scope: !3, file: !3, line: 86, type: !143, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !167)
!167 = !{!168, !169}
!168 = !DILocalVariable(name: "leafs", scope: !166, file: !3, line: 88, type: !14)
!169 = !DILocalVariable(name: "voxels", scope: !166, file: !3, line: 89, type: !14)
!170 = !DILocation(line: 91, column: 2, scope: !166)
!171 = !DILocation(line: 92, column: 2, scope: !166)
!172 = !DILocation(line: 94, column: 2, scope: !166)
!173 = !DILocation(line: 96, column: 61, scope: !166)
!174 = !DILocation(line: 96, column: 2, scope: !166)
!175 = !DILocation(line: 97, column: 61, scope: !166)
!176 = !DILocation(line: 97, column: 2, scope: !166)
!177 = !DILocation(line: 98, column: 61, scope: !166)
!178 = !DILocation(line: 98, column: 2, scope: !166)
!179 = !DILocation(line: 99, column: 61, scope: !166)
!180 = !DILocation(line: 99, column: 2, scope: !166)
!181 = !DILocation(line: 100, column: 61, scope: !166)
!182 = !DILocation(line: 100, column: 2, scope: !166)
!183 = !DILocation(line: 102, column: 11, scope: !166)
!184 = !DILocation(line: 102, column: 26, scope: !166)
!185 = !DILocation(line: 102, column: 24, scope: !166)
!186 = !DILocation(line: 0, scope: !166)
!187 = !DILocation(line: 103, column: 26, scope: !166)
!188 = !DILocation(line: 103, column: 24, scope: !166)
!189 = !DILocation(line: 105, column: 96, scope: !166)
!190 = !DILocation(line: 105, column: 109, scope: !166)
!191 = !DILocation(line: 105, column: 2, scope: !166)
!192 = !DILocation(line: 106, column: 76, scope: !166)
!193 = !DILocation(line: 106, column: 96, scope: !166)
!194 = !DILocation(line: 106, column: 112, scope: !166)
!195 = !DILocation(line: 106, column: 2, scope: !166)
!196 = !DILocation(line: 107, column: 76, scope: !166)
!197 = !DILocation(line: 107, column: 96, scope: !166)
!198 = !DILocation(line: 107, column: 109, scope: !166)
!199 = !DILocation(line: 107, column: 2, scope: !166)
