; ModuleID = 'elemman.c'
source_filename = "elemman.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._patch = type { ptr, ptr, ptr, ptr, ptr, ptr, %struct.Vertex, %struct.Vertex, %struct.Vertex, %struct.PlaneEqu, float, %struct.Rgb, %struct.Rgb, ptr, ptr, ptr, ptr, i64 }
%struct.Vertex = type { float, float, float }
%struct.PlaneEqu = type { %struct.Vertex, float }
%struct.Rgb = type { float, float, float }
%struct._element = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, i64, %struct.Rgb, %struct.Rgb, %struct.Rgb, i64, ptr, ptr, ptr, ptr, ptr, ptr, float }
%struct._interact = type { ptr, ptr, float, float, float, float }
%struct.Global = type { i64, %union.pthread_mutex_t, [1024 x %struct.Task_Queue], [3276800 x %struct._task], %union.pthread_mutex_t, ptr, %union.pthread_mutex_t, i64, %struct.Rgb, %struct.Rgb, float, i64, %union.pthread_mutex_t, i64, i64, [1024 x %struct.Patch_Cost], %struct.anon, i64, %union.pthread_mutex_t, i64, %union.pthread_mutex_t, %union.pthread_mutex_t, ptr, i64, i64, [1024 x %struct._patch], %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, i64, ptr, %union.pthread_mutex_t, i64, ptr, [3900 x %struct.Shared_Lock], [1024 x %struct.StatisticalInfo] }
%struct.Task_Queue = type { [4096 x i8], %union.pthread_mutex_t, ptr, ptr, i64, %union.pthread_mutex_t, i64, ptr, [4096 x i8] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "elemman.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "8a25bc0df3d66d40bd0c4a994d632a01")
!2 = !{!3, !4, !11, !53}
!3 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "Interaction", file: !1, line: 442, baseType: !6)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interact", file: !1, line: 435, size: 256, elements: !7)
!7 = !{!8, !10, !135, !136, !137, !138}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !6, file: !1, line: 436, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !6, file: !1, line: 437, baseType: !11, size: 64, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Element", file: !1, line: 414, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !1, line: 389, size: 1536, elements: !14)
!14 = !{!15, !54, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "elem_lock", scope: !13, file: !1, line: 390, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Shared_Lock", file: !1, line: 118, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 115, size: 320, elements: !19)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !18, file: !1, line: 117, baseType: !21, size: 320)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !22, line: 72, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!23 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !22, line: 67, size: 320, elements: !24)
!24 = !{!25, !47, !52}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !23, file: !22, line: 69, baseType: !26, size: 320)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !27, line: 22, size: 320, elements: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!28 = !{!29, !31, !33, !34, !35, !36, !38, !39}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !26, file: !27, line: 24, baseType: !30, size: 32)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !26, file: !27, line: 25, baseType: !32, size: 32, offset: 32)
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !26, file: !27, line: 26, baseType: !30, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !26, file: !27, line: 28, baseType: !32, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !26, file: !27, line: 32, baseType: !30, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !26, file: !27, line: 34, baseType: !37, size: 16, offset: 160)
!37 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !26, file: !27, line: 35, baseType: !37, size: 16, offset: 176)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !26, file: !27, line: 36, baseType: !40, size: 128, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !41, line: 53, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !41, line: 49, size: 128, elements: !43)
!43 = !{!44, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !42, file: !41, line: 51, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !42, file: !41, line: 52, baseType: !45, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !23, file: !22, line: 70, baseType: !48, size: 320)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 320, elements: !50)
!49 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!50 = !{!51}
!51 = !DISubrange(count: 40)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !23, file: !22, line: 71, baseType: !53, size: 64)
!53 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !13, file: !1, line: 391, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "Patch", file: !1, line: 349, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_patch", file: !1, line: 333, size: 1344, elements: !58)
!58 = !{!59, !81, !82, !83, !94, !95, !96, !97, !98, !99, !105, !106, !107, !108, !110, !111, !112, !114}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !57, file: !1, line: 334, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElemVertex", file: !1, line: 257, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_elemvertex", file: !1, line: 252, size: 320, elements: !63)
!63 = !{!64, !72, !79, !80}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !62, file: !1, line: 253, baseType: !65, size: 96)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vertex", file: !66, line: 14, baseType: !67)
!66 = !DIFile(filename: "./glibps/../structs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "127502bb3b1b1ffc96492ea685802424")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 12, size: 96, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !67, file: !66, line: 13, baseType: !3, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !67, file: !66, line: 13, baseType: !3, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !67, file: !66, line: 13, baseType: !3, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !62, file: !1, line: 254, baseType: !73, size: 96, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "Rgb", file: !66, line: 24, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 22, size: 96, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !74, file: !66, line: 23, baseType: !3, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !74, file: !66, line: 23, baseType: !3, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !74, file: !66, line: 23, baseType: !3, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !62, file: !1, line: 255, baseType: !3, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ev_lock", scope: !62, file: !1, line: 256, baseType: !16, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !57, file: !1, line: 334, baseType: !60, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !57, file: !1, line: 334, baseType: !60, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !57, file: !1, line: 335, baseType: !84, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "Edge", file: !1, line: 280, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_edge", file: !1, line: 276, size: 320, elements: !87)
!87 = !{!88, !89, !90, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !86, file: !1, line: 277, baseType: !60, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !86, file: !1, line: 277, baseType: !60, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ea", scope: !86, file: !1, line: 278, baseType: !91, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "eb", scope: !86, file: !1, line: 278, baseType: !91, size: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "edge_lock", scope: !86, file: !1, line: 279, baseType: !16, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !57, file: !1, line: 335, baseType: !84, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !57, file: !1, line: 335, baseType: !84, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !57, file: !1, line: 336, baseType: !65, size: 96, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !57, file: !1, line: 336, baseType: !65, size: 96, offset: 480)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "p3", scope: !57, file: !1, line: 336, baseType: !65, size: 96, offset: 576)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "plane_equ", scope: !57, file: !1, line: 337, baseType: !100, size: 128, offset: 672)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PlaneEqu", file: !1, line: 305, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 301, size: 128, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !101, file: !1, line: 302, baseType: !65, size: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !101, file: !1, line: 303, baseType: !3, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !57, file: !1, line: 338, baseType: !3, size: 32, offset: 800)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !57, file: !1, line: 339, baseType: !73, size: 96, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "emittance", scope: !57, file: !1, line: 341, baseType: !73, size: 96, offset: 928)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_positive", scope: !57, file: !1, line: 343, baseType: !109, size: 64, offset: 1024)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_negative", scope: !57, file: !1, line: 344, baseType: !109, size: 64, offset: 1088)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_parent", scope: !57, file: !1, line: 345, baseType: !109, size: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "el_root", scope: !57, file: !1, line: 347, baseType: !113, size: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "seq_no", scope: !57, file: !1, line: 348, baseType: !53, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !13, file: !1, line: 393, baseType: !113, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !13, file: !1, line: 394, baseType: !113, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !13, file: !1, line: 395, baseType: !113, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !13, file: !1, line: 396, baseType: !113, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !13, file: !1, line: 397, baseType: !113, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "interactions", scope: !13, file: !1, line: 399, baseType: !9, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "n_interactions", scope: !13, file: !1, line: 400, baseType: !53, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "vis_undef_inter", scope: !13, file: !1, line: 401, baseType: !9, size: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "n_vis_undef_inter", scope: !13, file: !1, line: 402, baseType: !53, size: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !13, file: !1, line: 404, baseType: !73, size: 96, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rad_in", scope: !13, file: !1, line: 406, baseType: !73, size: 96, offset: 800)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rad_subtree", scope: !13, file: !1, line: 407, baseType: !73, size: 96, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "join_counter", scope: !13, file: !1, line: 409, baseType: !53, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !13, file: !1, line: 411, baseType: !60, size: 64, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !13, file: !1, line: 411, baseType: !60, size: 64, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !13, file: !1, line: 411, baseType: !60, size: 64, offset: 1216)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !13, file: !1, line: 412, baseType: !84, size: 64, offset: 1280)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !13, file: !1, line: 412, baseType: !84, size: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !13, file: !1, line: 412, baseType: !84, size: 64, offset: 1408)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !13, file: !1, line: 413, baseType: !3, size: 32, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_out", scope: !6, file: !1, line: 438, baseType: !3, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_err", scope: !6, file: !1, line: 439, baseType: !3, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "area_ratio", scope: !6, file: !1, line: 440, baseType: !3, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !6, file: !1, line: 441, baseType: !3, size: 32, offset: 224)
!139 = !{i32 7, !"Dwarf Version", i32 5}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{i32 1, !"wchar_size", i32 4}
!142 = !{i32 7, !"PIC Level", i32 2}
!143 = !{i32 7, !"PIE Level", i32 2}
!144 = !{i32 7, !"uwtable", i32 2}
!145 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!146 = distinct !DISubprogram(name: "foreach_element_in_patch", scope: !1, file: !1, line: 1202, type: !147, scopeLine: 1203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !152)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !55, !149, !53, !53}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, null}
!152 = !{!153, !154, !155, !156}
!153 = !DILocalVariable(name: "patch", arg: 1, scope: !146, file: !1, line: 1202, type: !55)
!154 = !DILocalVariable(name: "func", arg: 2, scope: !146, file: !1, line: 1202, type: !149)
!155 = !DILocalVariable(name: "arg1", arg: 3, scope: !146, file: !1, line: 1202, type: !53)
!156 = !DILocalVariable(name: "process_id", arg: 4, scope: !146, file: !1, line: 1202, type: !53)
!157 = !DILocation(line: 0, scope: !146)
!158 = !DILocation(line: 1204, column: 30, scope: !146)
!159 = !DILocation(line: 1204, column: 5, scope: !146)
!160 = !DILocation(line: 1205, column: 1, scope: !146)
!161 = distinct !DISubprogram(name: "_foreach_element", scope: !1, file: !1, line: 1208, type: !162, scopeLine: 1209, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !164)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !11, !149, !53, !53}
!164 = !{!165, !166, !167, !168}
!165 = !DILocalVariable(name: "elem", arg: 1, scope: !161, file: !1, line: 1208, type: !11)
!166 = !DILocalVariable(name: "func", arg: 2, scope: !161, file: !1, line: 1208, type: !149)
!167 = !DILocalVariable(name: "arg1", arg: 3, scope: !161, file: !1, line: 1208, type: !53)
!168 = !DILocalVariable(name: "process_id", arg: 4, scope: !161, file: !1, line: 1208, type: !53)
!169 = !DILocation(line: 0, scope: !161)
!170 = !DILocation(line: 1210, column: 14, scope: !171)
!171 = distinct !DILexicalBlock(scope: !161, file: !1, line: 1210, column: 9)
!172 = !DILocation(line: 1210, column: 9, scope: !161)
!173 = !DILocation(line: 1214, column: 11, scope: !174)
!174 = distinct !DILexicalBlock(scope: !161, file: !1, line: 1214, column: 9)
!175 = !DILocation(line: 1214, column: 9, scope: !161)
!176 = !DILocation(line: 1216, column: 13, scope: !177)
!177 = distinct !DILexicalBlock(scope: !174, file: !1, line: 1215, column: 9)
!178 = !DILocation(line: 1217, column: 37, scope: !177)
!179 = !DILocation(line: 1217, column: 13, scope: !177)
!180 = !DILocation(line: 1218, column: 37, scope: !177)
!181 = !DILocation(line: 1218, column: 13, scope: !177)
!182 = !DILocation(line: 1219, column: 37, scope: !177)
!183 = !DILocation(line: 1219, column: 13, scope: !177)
!184 = !DILocation(line: 1220, column: 9, scope: !177)
!185 = !DILocation(line: 1223, column: 5, scope: !161)
!186 = !DILocation(line: 1224, column: 1, scope: !161)
!187 = distinct !DISubprogram(name: "foreach_leaf_element_in_patch", scope: !1, file: !1, line: 1227, type: !147, scopeLine: 1228, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !188)
!188 = !{!189, !190, !191, !192}
!189 = !DILocalVariable(name: "patch", arg: 1, scope: !187, file: !1, line: 1227, type: !55)
!190 = !DILocalVariable(name: "func", arg: 2, scope: !187, file: !1, line: 1227, type: !149)
!191 = !DILocalVariable(name: "arg1", arg: 3, scope: !187, file: !1, line: 1227, type: !53)
