; ModuleID = 'fbuf.c'
source_filename = "fbuf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i8, i8, i8, i8 }
%struct.display = type { i64, i64, i64, i64, double, i64, i64, i64, double, double, double, double, double, double, double, double, ptr }
%struct.pixel = type { float, float, float }

@image = internal unnamed_addr global [1280 x %struct.anon] zeroinitializer, align 16, !dbg !0
@.str = private unnamed_addr constant [9 x i8] c"%c%c%c%c\00", align 1
@Display = external local_unnamed_addr global %struct.display, align 8
@.str.1 = private unnamed_addr constant [7 x i8] c"fbuf.c\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.3 = private unnamed_addr constant [33 x i8] c"Unable to open picture file %s.\0A\00", align 1
@.str.4 = private unnamed_addr constant [17 x i8] c"%c%c%c%c%c%c%c%c\00", align 1

; Function Attrs: nofree noinline nounwind uwtable
define dso_local void @RunLengthEncode(ptr nocapture noundef %pf, ptr nocapture noundef readonly %fb, i64 noundef %xsize) local_unnamed_addr #0 !dbg !28 {
entry:
  call void @llvm.dbg.value(metadata ptr %pf, metadata !102, metadata !DIExpression()), !dbg !111
  call void @llvm.dbg.value(metadata ptr %fb, metadata !103, metadata !DIExpression()), !dbg !111
  call void @llvm.dbg.value(metadata i64 %xsize, metadata !104, metadata !DIExpression()), !dbg !111

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "image", scope: !2, file: !3, line: 47, type: !12, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !11, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "fbuf.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "c2a348c394e45ae4a9e53dc754334be9")
!4 = !{!5, !8, !10}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "U8", file: !6, line: 290, baseType: !7)
!6 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !6, line: 297, baseType: !9)
!9 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !{!0}
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 40960, elements: !19)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 42, size: 32, elements: !14)
!14 = !{!15, !16, !17, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !13, file: !3, line: 44, baseType: !5, size: 8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !13, file: !3, line: 44, baseType: !5, size: 8, offset: 8)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !13, file: !3, line: 44, baseType: !5, size: 8, offset: 16)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !13, file: !3, line: 45, baseType: !5, size: 8, offset: 24)
!19 = !{!20}
!20 = !DISubrange(count: 1280)
!21 = !{i32 7, !"Dwarf Version", i32 5}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{i32 1, !"wchar_size", i32 4}
!24 = !{i32 7, !"PIC Level", i32 2}
!25 = !{i32 7, !"PIE Level", i32 2}
!26 = !{i32 7, !"uwtable", i32 2}
!27 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!28 = distinct !DISubprogram(name: "RunLengthEncode", scope: !3, file: !3, line: 72, type: !29, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !101)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !92, !8}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !33, line: 7, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !35, line: 49, size: 1728, elements: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!36 = !{!37, !39, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !54, !56, !57, !58, !61, !63, !65, !69, !72, !74, !77, !80, !81, !83, !87, !88}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !34, file: !35, line: 51, baseType: !38, size: 32)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !34, file: !35, line: 54, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !34, file: !35, line: 55, baseType: !40, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !34, file: !35, line: 56, baseType: !40, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !34, file: !35, line: 57, baseType: !40, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !34, file: !35, line: 58, baseType: !40, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !34, file: !35, line: 59, baseType: !40, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !34, file: !35, line: 60, baseType: !40, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !34, file: !35, line: 61, baseType: !40, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !34, file: !35, line: 64, baseType: !40, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !34, file: !35, line: 65, baseType: !40, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !34, file: !35, line: 66, baseType: !40, size: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !34, file: !35, line: 68, baseType: !52, size: 64, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !35, line: 36, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !34, file: !35, line: 70, baseType: !55, size: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !34, file: !35, line: 72, baseType: !38, size: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !34, file: !35, line: 73, baseType: !38, size: 32, offset: 928)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !34, file: !35, line: 74, baseType: !59, size: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !60, line: 152, baseType: !9)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !34, file: !35, line: 77, baseType: !62, size: 16, offset: 1024)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !34, file: !35, line: 78, baseType: !64, size: 8, offset: 1040)
!64 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !34, file: !35, line: 79, baseType: !66, size: 8, offset: 1048)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !34, file: !35, line: 81, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !35, line: 43, baseType: null)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !34, file: !35, line: 89, baseType: !73, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !60, line: 153, baseType: !9)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !34, file: !35, line: 91, baseType: !75, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !35, line: 37, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !34, file: !35, line: 92, baseType: !78, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !35, line: 38, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !34, file: !35, line: 93, baseType: !55, size: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !34, file: !35, line: 94, baseType: !82, size: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !34, file: !35, line: 95, baseType: !84, size: 64, offset: 1472)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!86 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !34, file: !35, line: 96, baseType: !38, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !34, file: !35, line: 98, baseType: !89, size: 160, offset: 1568)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 20)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIXEL", file: !6, line: 386, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pixel", file: !6, line: 380, size: 96, elements: !95)
!95 = !{!96, !99, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !94, file: !6, line: 382, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "R32", file: !6, line: 307, baseType: !98)
!98 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !94, file: !6, line: 383, baseType: !97, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !94, file: !6, line: 384, baseType: !97, size: 32, offset: 64)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110}
!102 = !DILocalVariable(name: "pf", arg: 1, scope: !28, file: !3, line: 72, type: !31)
!103 = !DILocalVariable(name: "fb", arg: 2, scope: !28, file: !3, line: 72, type: !92)
!104 = !DILocalVariable(name: "xsize", arg: 3, scope: !28, file: !3, line: 72, type: !8)
!105 = !DILocalVariable(name: "x", scope: !28, file: !3, line: 74, type: !8)
!106 = !DILocalVariable(name: "rl", scope: !28, file: !3, line: 75, type: !8)
!107 = !DILocalVariable(name: "numpixels", scope: !28, file: !3, line: 76, type: !8)
!108 = !DILocalVariable(name: "red", scope: !28, file: !3, line: 77, type: !5)
!109 = !DILocalVariable(name: "green", scope: !28, file: !3, line: 77, type: !5)
!110 = !DILocalVariable(name: "blue", scope: !28, file: !3, line: 77, type: !5)
!111 = !DILocation(line: 0, scope: !28)
!112 = !DILocation(line: 82, column: 34, scope: !28)
!113 = !DILocation(line: 82, column: 28, scope: !28)
!114 = !DILocation(line: 82, column: 36, scope: !28)
!115 = !DILocation(line: 82, column: 21, scope: !28)
!116 = !DILocation(line: 82, column: 15, scope: !28)
!117 = !DILocation(line: 82, column: 13, scope: !28)
!118 = !DILocation(line: 83, column: 34, scope: !28)
!119 = !DILocation(line: 83, column: 28, scope: !28)
!120 = !DILocation(line: 83, column: 36, scope: !28)
!121 = !DILocation(line: 83, column: 21, scope: !28)
!122 = !DILocation(line: 83, column: 15, scope: !28)
!123 = !DILocation(line: 83, column: 13, scope: !28)
!124 = !DILocation(line: 84, column: 34, scope: !28)
!125 = !DILocation(line: 84, column: 28, scope: !28)
!126 = !DILocation(line: 84, column: 36, scope: !28)
!127 = !DILocation(line: 84, column: 21, scope: !28)
!128 = !DILocation(line: 84, column: 15, scope: !28)
!129 = !DILocation(line: 84, column: 13, scope: !28)
!130 = !DILocation(line: 86, column: 16, scope: !131)
!131 = distinct !DILexicalBlock(scope: !132, file: !3, line: 86, column: 2)
!132 = distinct !DILexicalBlock(scope: !28, file: !3, line: 86, column: 2)
!133 = !DILocation(line: 86, column: 2, scope: !132)
!134 = !DILocation(line: 110, column: 18, scope: !28)
!135 = !DILocation(line: 112, column: 2, scope: !136)
!136 = distinct !DILexicalBlock(scope: !28, file: !3, line: 112, column: 2)
!137 = !DILocation(line: 88, column: 24, scope: !138)
!138 = distinct !DILexicalBlock(scope: !131, file: !3, line: 87, column: 3)
!139 = !DILocation(line: 88, column: 30, scope: !138)
!140 = !DILocation(line: 88, column: 32, scope: !138)
!141 = !DILocation(line: 88, column: 17, scope: !138)
!142 = !DILocation(line: 88, column: 11, scope: !138)
!143 = !DILocation(line: 89, column: 30, scope: !138)
!144 = !DILocation(line: 89, column: 24, scope: !138)
!145 = !DILocation(line: 89, column: 32, scope: !138)
!146 = !DILocation(line: 89, column: 17, scope: !138)
!147 = !DILocation(line: 89, column: 11, scope: !138)
!148 = !DILocation(line: 90, column: 30, scope: !138)
!149 = !DILocation(line: 90, column: 24, scope: !138)
!150 = !DILocation(line: 90, column: 32, scope: !138)
!151 = !DILocation(line: 90, column: 17, scope: !138)
!152 = !DILocation(line: 90, column: 11, scope: !138)
!153 = !DILocation(line: 93, column: 13, scope: !154)
!154 = distinct !DILexicalBlock(scope: !138, file: !3, line: 93, column: 7)
!155 = !DILocation(line: 93, column: 29, scope: !154)
!156 = !DILocation(line: 94, column: 26, scope: !154)
!157 = !DILocation(line: 94, column: 13, scope: !154)
!158 = !DILocation(line: 94, column: 29, scope: !154)
!159 = !DILocation(line: 95, column: 26, scope: !154)
!160 = !DILocation(line: 95, column: 13, scope: !154)
!161 = !DILocation(line: 95, column: 29, scope: !154)
!162 = !DILocation(line: 97, column: 13, scope: !154)
!163 = !DILocation(line: 97, column: 4, scope: !154)
!164 = !DILocation(line: 100, column: 22, scope: !165)
!165 = distinct !DILexicalBlock(scope: !154, file: !3, line: 99, column: 4)
