; ModuleID = 'geo.c'
source_filename = "geo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.view = type { [4 x double], [4 x double], [4 x [4 x double]], [4 x [4 x double]], [4 x [4 x double]], [3 x double], i64, double, [3 x double], i64, i64 }
%struct.pprocs = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.gmem = type { i64, i64, i64, ptr, ptr, ptr, [4096 x [256 x ptr]], %struct.anon, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, [4096 x %union.pthread_mutex_t], i64, [4096 x i64] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.object = type { i64, [32 x i8], %struct.bbox, ptr, i64, ptr, ptr, ptr }
%struct.bbox = type { [3 x double], [3 x double] }
%struct.element = type { i64, ptr, ptr, %struct.bbox }
%struct.surf = type { [3 x double], [3 x double], double, double, double, double, double }

@gm = external local_unnamed_addr global ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "SphProcs", scope: !2, file: !3, line: 44, type: !9, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !6, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "geo.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "b085855529092886b55c23692a957480")
!4 = !{!5}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !{!0, !7, !37}
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "PolyProcs", scope: !2, file: !3, line: 62, type: !9, isLocal: true, isDefinition: true)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROCS", file: !10, line: 340, baseType: !11)
!10 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pprocs", file: !10, line: 327, size: 640, elements: !12)
!12 = !{!13, !20, !24, !25, !26, !27, !33, !34, !35, !36}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !11, file: !10, line: 329, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, null}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !10, line: 287, baseType: !19)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !11, file: !10, line: 330, baseType: !21, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{null, null}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !11, file: !10, line: 331, baseType: !21, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "binread", scope: !11, file: !10, line: 332, baseType: !21, size: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !11, file: !10, line: 333, baseType: !21, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "intersect", scope: !11, file: !10, line: 334, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, null}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !10, line: 297, baseType: !32)
!32 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pe_intersect", scope: !11, file: !10, line: 335, baseType: !28, size: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !11, file: !10, line: 336, baseType: !21, size: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "normalize", scope: !11, file: !10, line: 337, baseType: !21, size: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !11, file: !10, line: 338, baseType: !21, size: 64, offset: 576)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "TriProcs", scope: !2, file: !3, line: 82, type: !9, isLocal: true, isDefinition: true)
!39 = !{i32 7, !"Dwarf Version", i32 5}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 4}
!42 = !{i32 7, !"PIC Level", i32 2}
!43 = !{i32 7, !"PIE Level", i32 2}
!44 = !{i32 7, !"uwtable", i32 2}
!45 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!46 = distinct !DISubprogram(name: "MakeElementArray", scope: !3, file: !3, line: 111, type: !47, scopeLine: 112, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !97)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !96}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT", file: !10, line: 481, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "element", file: !10, line: 474, size: 576, elements: !53)
!53 = !{!54, !55, !94, !95}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !52, file: !10, line: 476, baseType: !31, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !52, file: !10, line: 477, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !10, line: 488, size: 1024, elements: !58)
!58 = !{!59, !60, !64, !75, !76, !77, !79, !93}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !57, file: !10, line: 490, baseType: !31, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !10, line: 491, baseType: !61, size: 256, offset: 64)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 256, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !57, file: !10, line: 492, baseType: !65, size: 384, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", file: !10, line: 418, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbox", file: !10, line: 413, size: 384, elements: !67)
!67 = !{!68, !74}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "dnear", scope: !66, file: !10, line: 415, baseType: !69, size: 192)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 192, elements: !72)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "REAL", file: !10, line: 310, baseType: !71)
!71 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!72 = !{!73}
!73 = !DISubrange(count: 3)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "dfar", scope: !66, file: !10, line: 416, baseType: !69, size: 192, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !57, file: !10, line: 493, baseType: !50, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !57, file: !10, line: 494, baseType: !31, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !57, file: !10, line: 495, baseType: !78, size: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "surf", scope: !57, file: !10, line: 496, baseType: !80, size: 64, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "SURF", file: !10, line: 357, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "surf", file: !10, line: 347, size: 704, elements: !83)
!83 = !{!84, !87, !88, !89, !90, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fcolor", scope: !82, file: !10, line: 349, baseType: !85, size: 192)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOR", file: !10, line: 319, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC3", file: !10, line: 314, baseType: !69)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bcolor", scope: !82, file: !10, line: 350, baseType: !85, size: 192, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "kdiff", scope: !82, file: !10, line: 351, baseType: !70, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "kspec", scope: !82, file: !10, line: 352, baseType: !70, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ktran", scope: !82, file: !10, line: 353, baseType: !70, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "refrindex", scope: !82, file: !10, line: 354, baseType: !70, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "kspecn", scope: !82, file: !10, line: 355, baseType: !70, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !57, file: !10, line: 497, baseType: !56, size: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !52, file: !10, line: 478, baseType: !17, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !52, file: !10, line: 479, baseType: !65, size: 384, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!97 = !{!98, !99, !100, !103, !104}
!98 = !DILocalVariable(name: "totalElements", arg: 1, scope: !46, file: !3, line: 111, type: !96)
!99 = !DILocalVariable(name: "i", scope: !46, file: !3, line: 113, type: !31)
!100 = !DILocalVariable(name: "po", scope: !46, file: !3, line: 114, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", file: !10, line: 499, baseType: !57)
!103 = !DILocalVariable(name: "currArrayPosition", scope: !46, file: !3, line: 115, type: !31)
!104 = !DILocalVariable(name: "npepa", scope: !46, file: !3, line: 116, type: !49)
!105 = !DILocation(line: 0, scope: !46)
!106 = !DILocation(line: 118, column: 7, scope: !46)
!107 = !DILocation(line: 118, column: 11, scope: !46)
!108 = !DILocation(line: 119, column: 17, scope: !46)
!109 = !DILocation(line: 121, column: 2, scope: !46)
!110 = !DILocation(line: 123, column: 20, scope: !111)
!111 = distinct !DILexicalBlock(scope: !46, file: !3, line: 122, column: 3)
!112 = !DILocation(line: 123, column: 27, scope: !111)
!113 = !DILocation(line: 124, column: 12, scope: !111)
!114 = distinct !{!114, !109, !115, !116, !117}
!115 = !DILocation(line: 125, column: 3, scope: !46)
!116 = !{!"llvm.loop.mustprogress"}
!117 = !{!"llvm.loop.unroll.disable"}
!118 = !DILocation(line: 128, column: 36, scope: !46)
!119 = !DILocation(line: 127, column: 10, scope: !46)
!120 = !DILocation(line: 127, column: 14, scope: !46)
!121 = !DILocation(line: 128, column: 10, scope: !46)
!122 = !DILocation(line: 130, column: 2, scope: !46)
!123 = !DILocation(line: 132, column: 23, scope: !124)
!124 = distinct !DILexicalBlock(scope: !125, file: !3, line: 132, column: 3)
!125 = distinct !DILexicalBlock(scope: !126, file: !3, line: 132, column: 3)
!126 = distinct !DILexicalBlock(scope: !46, file: !3, line: 131, column: 3)
!127 = !DILocation(line: 132, column: 17, scope: !124)
!128 = !DILocation(line: 132, column: 3, scope: !125)
!129 = !DILocation(line: 133, column: 37, scope: !124)
!130 = !DILocation(line: 133, column: 43, scope: !124)
!131 = !DILocation(line: 133, column: 27, scope: !124)
!132 = !DILocation(line: 133, column: 4, scope: !124)
!133 = !DILocation(line: 133, column: 31, scope: !124)
!134 = !DILocation(line: 132, column: 37, scope: !124)
!135 = distinct !{!135, !128, !136, !116, !117}
!136 = !DILocation(line: 133, column: 45, scope: !125)
!137 = !DILocation(line: 135, column: 12, scope: !126)
!138 = distinct !{!138, !122, !139, !116, !117}
!139 = !DILocation(line: 136, column: 3, scope: !46)
!140 = !DILocation(line: 138, column: 2, scope: !46)
!141 = !DISubprogram(name: "ObjectMalloc", scope: !10, file: !10, line: 915, type: !142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{!5, !31, !31}
!144 = !{}
!145 = distinct !DISubprogram(name: "PrintGeo", scope: !3, file: !3, line: 155, type: !146, scopeLine: 156, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !148)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !101}
!148 = !{!149}
!149 = !DILocalVariable(name: "po", arg: 1, scope: !145, file: !3, line: 155, type: !101)
!150 = !DILocation(line: 0, scope: !145)
!151 = !DILocation(line: 157, column: 2, scope: !145)
!152 = !DILocation(line: 159, column: 11, scope: !153)
!153 = distinct !DILexicalBlock(scope: !145, file: !3, line: 158, column: 3)
!154 = !DILocation(line: 159, column: 39, scope: !153)
!155 = !DILocation(line: 159, column: 3, scope: !153)
!156 = !DILocation(line: 160, column: 11, scope: !153)
!157 = !DILocation(line: 161, column: 8, scope: !153)
!158 = !DILocation(line: 161, column: 4, scope: !153)
!159 = !DILocation(line: 161, column: 25, scope: !153)
!160 = !DILocation(line: 162, column: 4, scope: !153)
!161 = !DILocation(line: 162, column: 35, scope: !153)
!162 = !DILocation(line: 162, column: 25, scope: !153)
!163 = !DILocation(line: 163, column: 4, scope: !153)
!164 = !DILocation(line: 163, column: 25, scope: !153)
!165 = !DILocation(line: 160, column: 3, scope: !153)
!166 = !DILocation(line: 165, column: 11, scope: !153)
!167 = !DILocation(line: 166, column: 8, scope: !153)
!168 = !DILocation(line: 166, column: 14, scope: !153)
!169 = !DILocation(line: 166, column: 31, scope: !153)
!170 = !DILocation(line: 166, column: 48, scope: !153)
!171 = !DILocation(line: 167, column: 14, scope: !153)
!172 = !DILocation(line: 167, column: 35, scope: !153)
!173 = !DILocation(line: 165, column: 3, scope: !153)
!174 = !DILocation(line: 169, column: 9, scope: !153)
!175 = !DILocation(line: 169, column: 16, scope: !153)
!176 = !DILocation(line: 169, column: 3, scope: !153)
!177 = !DILocation(line: 170, column: 12, scope: !153)
!178 = distinct !{!178, !151, !179, !116, !117}
!179 = !DILocation(line: 171, column: 3, scope: !145)
!180 = !DILocation(line: 172, column: 2, scope: !145)
!181 = distinct !DISubprogram(name: "NormalizeGeo", scope: !3, file: !3, line: 190, type: !182, scopeLine: 191, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !188)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !101, !184, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 256, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 4)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !207}
!189 = !DILocalVariable(name: "po", arg: 1, scope: !181, file: !3, line: 190, type: !101)
!190 = !DILocalVariable(name: "model", arg: 2, scope: !181, file: !3, line: 190, type: !184)
!191 = !DILocalVariable(name: "modelInvT", arg: 3, scope: !181, file: !3, line: 190, type: !184)
!192 = !DILocalVariable(name: "norm_minx", scope: !181, file: !3, line: 192, type: !70)
!193 = !DILocalVariable(name: "norm_miny", scope: !181, file: !3, line: 193, type: !70)
!194 = !DILocalVariable(name: "norm_minz", scope: !181, file: !3, line: 194, type: !70)
!195 = !DILocalVariable(name: "norm_maxx", scope: !181, file: !3, line: 195, type: !70)
!196 = !DILocalVariable(name: "norm_maxy", scope: !181, file: !3, line: 196, type: !70)
!197 = !DILocalVariable(name: "norm_maxz", scope: !181, file: !3, line: 197, type: !70)
!198 = !DILocalVariable(name: "scale_min", scope: !181, file: !3, line: 198, type: !70)
!199 = !DILocalVariable(name: "scale_max", scope: !181, file: !3, line: 199, type: !70)
!200 = !DILocalVariable(name: "scale", scope: !181, file: !3, line: 200, type: !70)
!201 = !DILocalVariable(name: "trans", scope: !181, file: !3, line: 201, type: !70)
!202 = !DILocalVariable(name: "poHead", scope: !181, file: !3, line: 202, type: !101)
!203 = !DILocalVariable(name: "normMat", scope: !181, file: !3, line: 203, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", file: !10, line: 316, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, elements: !206)
!206 = !{!187, !187}
!207 = !DILocalVariable(name: "tempMat", scope: !181, file: !3, line: 204, type: !204)
!208 = !DILocation(line: 0, scope: !181)
!209 = !DILocation(line: 203, column: 2, scope: !181)
!210 = !DILocation(line: 203, column: 9, scope: !181)
!211 = !DILocation(line: 204, column: 2, scope: !181)
!212 = !DILocation(line: 204, column: 9, scope: !181)
!213 = !DILocation(line: 209, column: 9, scope: !214)
!214 = distinct !DILexicalBlock(scope: !181, file: !3, line: 209, column: 6)
!215 = !DILocation(line: 209, column: 23, scope: !214)
!216 = !DILocation(line: 209, column: 34, scope: !214)
!217 = !DILocation(line: 216, column: 3, scope: !218)
!218 = distinct !DILexicalBlock(scope: !214, file: !3, line: 210, column: 3)
!219 = !DILocation(line: 218, column: 16, scope: !220)
!220 = distinct !DILexicalBlock(scope: !218, file: !3, line: 217, column: 4)
!221 = !DILocation(line: 219, column: 16, scope: !220)
!222 = !DILocation(line: 220, column: 16, scope: !220)
!223 = !DILocation(line: 221, column: 16, scope: !220)
!224 = !DILocation(line: 222, column: 16, scope: !220)
!225 = !DILocation(line: 223, column: 16, scope: !220)
!226 = !DILocation(line: 225, column: 13, scope: !220)
!227 = distinct !{!227, !217, !228, !116, !117}
!228 = !DILocation(line: 226, column: 4, scope: !218)
!229 = !DILocation(line: 0, scope: !218)
!230 = !DILocation(line: 231, column: 15, scope: !218)
!231 = !DILocation(line: 232, column: 15, scope: !218)
!232 = !DILocation(line: 233, column: 15, scope: !218)
!233 = !DILocation(line: 234, column: 15, scope: !218)
!234 = !DILocation(line: 236, column: 26, scope: !218)
!235 = !DILocation(line: 236, column: 14, scope: !218)
!236 = !DILocation(line: 237, column: 12, scope: !218)
!237 = !DILocation(line: 237, column: 22, scope: !218)
!238 = !DILocation(line: 239, column: 3, scope: !218)
!239 = !DILocation(line: 240, column: 3, scope: !218)
!240 = !DILocation(line: 241, column: 3, scope: !218)
!241 = !DILocation(line: 248, column: 3, scope: !218)
!242 = !DILocation(line: 250, column: 10, scope: !243)
!243 = distinct !DILexicalBlock(scope: !218, file: !3, line: 249, column: 4)
!244 = !DILocation(line: 250, column: 17, scope: !243)
!245 = !DILocation(line: 250, column: 4, scope: !243)
!246 = !DILocation(line: 251, column: 13, scope: !243)
!247 = distinct !{!247, !241, !248, !116, !117}
!248 = !DILocation(line: 252, column: 4, scope: !218)
!249 = !DILocation(line: 254, column: 2, scope: !181)
!250 = !DISubprogram(name: "Scale", scope: !10, file: !10, line: 901, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !144)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !184, !70, !70, !70}
!253 = !DISubprogram(name: "Translate", scope: !10, file: !10, line: 900, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !144)
!254 = !DISubprogram(name: "MatrixMult", scope: !10, file: !10, line: 898, type: !255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !144)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !184, !184, !184}
!257 = distinct !DISubprogram(name: "ReadGeoFile", scope: !3, file: !3, line: 279, type: !258, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !17}
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !330, !331, !332, !333, !334, !335, !336}
!261 = !DILocalVariable(name: "GeoFileName", arg: 1, scope: !257, file: !3, line: 279, type: !17)
!262 = !DILocalVariable(name: "i", scope: !257, file: !3, line: 281, type: !31)
!263 = !DILocalVariable(name: "dummy", scope: !257, file: !3, line: 282, type: !31)
!264 = !DILocalVariable(name: "stat", scope: !257, file: !3, line: 283, type: !31)
!265 = !DILocalVariable(name: "comchar", scope: !257, file: !3, line: 284, type: !18)
!266 = !DILocalVariable(name: "primop", scope: !257, file: !3, line: 285, type: !18)
!267 = !DILocalVariable(name: "objstr", scope: !257, file: !3, line: 286, type: !61)
!268 = !DILocalVariable(name: "objname", scope: !257, file: !3, line: 287, type: !61)
!269 = !DILocalVariable(name: "pf", scope: !257, file: !3, line: 288, type: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !272, line: 7, baseType: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !274, line: 49, size: 1728, elements: !275)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!275 = !{!276, !278, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !293, !295, !296, !297, !300, !302, !304, !308, !311, !313, !316, !319, !320, !321, !325, !326}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !273, file: !274, line: 51, baseType: !277, size: 32)
!277 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !273, file: !274, line: 54, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !273, file: !274, line: 55, baseType: !279, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !273, file: !274, line: 56, baseType: !279, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !273, file: !274, line: 57, baseType: !279, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !273, file: !274, line: 58, baseType: !279, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !273, file: !274, line: 59, baseType: !279, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !273, file: !274, line: 60, baseType: !279, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !273, file: !274, line: 61, baseType: !279, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !273, file: !274, line: 64, baseType: !279, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !273, file: !274, line: 65, baseType: !279, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !273, file: !274, line: 66, baseType: !279, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !273, file: !274, line: 68, baseType: !291, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !274, line: 36, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !273, file: !274, line: 70, baseType: !294, size: 64, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !273, file: !274, line: 72, baseType: !277, size: 32, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !273, file: !274, line: 73, baseType: !277, size: 32, offset: 928)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !273, file: !274, line: 74, baseType: !298, size: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !299, line: 152, baseType: !32)
!299 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !273, file: !274, line: 77, baseType: !301, size: 16, offset: 1024)
!301 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !273, file: !274, line: 78, baseType: !303, size: 8, offset: 1040)
!303 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !273, file: !274, line: 79, baseType: !305, size: 8, offset: 1048)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 1)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !273, file: !274, line: 81, baseType: !309, size: 64, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !274, line: 43, baseType: null)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !273, file: !274, line: 89, baseType: !312, size: 64, offset: 1152)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !299, line: 153, baseType: !32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !273, file: !274, line: 91, baseType: !314, size: 64, offset: 1216)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !274, line: 37, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !273, file: !274, line: 92, baseType: !317, size: 64, offset: 1280)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !274, line: 38, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !273, file: !274, line: 93, baseType: !294, size: 64, offset: 1344)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !273, file: !274, line: 94, baseType: !5, size: 64, offset: 1408)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !273, file: !274, line: 95, baseType: !322, size: 64, offset: 1472)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !323, line: 46, baseType: !324)
!323 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!324 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !273, file: !274, line: 96, baseType: !277, size: 32, offset: 1536)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !273, file: !274, line: 98, baseType: !327, size: 160, offset: 1568)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 20)
!330 = !DILocalVariable(name: "ps", scope: !257, file: !3, line: 289, type: !80)
!331 = !DILocalVariable(name: "model", scope: !257, file: !3, line: 290, type: !204)
!332 = !DILocalVariable(name: "modelInv", scope: !257, file: !3, line: 291, type: !204)
!333 = !DILocalVariable(name: "modelInvT", scope: !257, file: !3, line: 292, type: !204)
!334 = !DILocalVariable(name: "prev", scope: !257, file: !3, line: 293, type: !101)
!335 = !DILocalVariable(name: "curr", scope: !257, file: !3, line: 294, type: !101)
!336 = !DILocalVariable(name: "pe", scope: !257, file: !3, line: 295, type: !50)
!337 = !DILocation(line: 0, scope: !257)
!338 = !DILocation(line: 282, column: 2, scope: !257)
!339 = !DILocation(line: 285, column: 2, scope: !257)
!340 = !DILocation(line: 286, column: 2, scope: !257)
!341 = !DILocation(line: 286, column: 8, scope: !257)
!342 = !DILocation(line: 287, column: 2, scope: !257)
!343 = !DILocation(line: 287, column: 8, scope: !257)
!344 = !DILocation(line: 290, column: 2, scope: !257)
!345 = !DILocation(line: 290, column: 10, scope: !257)
!346 = !DILocation(line: 291, column: 2, scope: !257)
!347 = !DILocation(line: 291, column: 10, scope: !257)
!348 = !DILocation(line: 292, column: 2, scope: !257)
!349 = !DILocation(line: 292, column: 10, scope: !257)
!350 = !DILocation(line: 300, column: 7, scope: !257)
!351 = !DILocation(line: 301, column: 7, scope: !352)
!352 = distinct !DILexicalBlock(scope: !257, file: !3, line: 301, column: 6)
!353 = !DILocation(line: 301, column: 6, scope: !257)
!354 = !DILocation(line: 303, column: 3, scope: !355)
!355 = distinct !DILexicalBlock(scope: !352, file: !3, line: 302, column: 3)
!356 = !DILocation(line: 304, column: 3, scope: !355)
!357 = !DILocation(line: 312, column: 2, scope: !257)
!358 = !DILocation(line: 312, column: 6, scope: !257)
!359 = !DILocation(line: 312, column: 16, scope: !257)
!360 = !DILocation(line: 313, column: 16, scope: !257)
!361 = !DILocation(line: 314, column: 16, scope: !257)
!362 = !DILocation(line: 319, column: 2, scope: !257)
!363 = !DILocation(line: 320, column: 2, scope: !257)
!364 = !DILocation(line: 321, column: 2, scope: !257)
!365 = !DILocation(line: 326, column: 17, scope: !366)
!366 = distinct !DILexicalBlock(scope: !257, file: !3, line: 326, column: 6)
!367 = !DILocation(line: 326, column: 6, scope: !366)
!368 = !DILocation(line: 326, column: 27, scope: !366)
!369 = !DILocation(line: 326, column: 6, scope: !257)
!370 = !DILocation(line: 327, column: 3, scope: !366)
!371 = !DILocation(line: 343, column: 2, scope: !257)
!372 = !DILocation(line: 0, scope: !373)
!373 = distinct !DILexicalBlock(scope: !366, file: !3, line: 329, column: 3)
!374 = !DILocation(line: 332, column: 18, scope: !373)
!375 = !DILocation(line: 332, column: 3, scope: !373)
!376 = !DILocation(line: 333, column: 19, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !3, line: 333, column: 8)
!378 = !DILocation(line: 333, column: 29, scope: !377)
!379 = !DILocation(line: 333, column: 8, scope: !373)
!380 = distinct !{!380, !375, !381, !116, !117}
!381 = !DILocation(line: 337, column: 5, scope: !373)
!382 = !DILocation(line: 335, column: 13, scope: !383)
!383 = distinct !DILexicalBlock(scope: !377, file: !3, line: 334, column: 5)
!384 = !DILocation(line: 335, column: 5, scope: !383)
!385 = !DILocation(line: 336, column: 5, scope: !383)
!386 = !DILocation(line: 343, column: 17, scope: !257)
!387 = !DILocation(line: 345, column: 20, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 345, column: 7)
!389 = distinct !DILexicalBlock(scope: !257, file: !3, line: 344, column: 3)
!390 = !DILocation(line: 345, column: 45, scope: !388)
!391 = !DILocation(line: 345, column: 7, scope: !389)
