; ModuleID = 'getparam.c'
source_filename = "getparam.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@defaults = internal unnamed_addr global ptr null, align 8, !dbg !0
@.str.1 = private unnamed_addr constant [22 x i8] c"getparam: %s unknown\0A\00", align 1
@stdin = external local_unnamed_addr global ptr, align 8
@.str.3 = private unnamed_addr constant [6 x i8] c"tTyY1\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"fFnN0\00", align 1
@.str.5 = private unnamed_addr constant [27 x i8] c"getbparam: %s=%s not bool\0A\00", align 1
@str = private unnamed_addr constant [34 x i8] c"getparam: called before initparam\00", align 1

; Function Attrs: mustprogress nofree noinline norecurse nosync nounwind willreturn writeonly uwtable
define dso_local void @initparam(ptr noundef %defv) local_unnamed_addr #0 !dbg !19 {
entry:
  call void @llvm.dbg.value(metadata ptr %defv, metadata !23, metadata !DIExpression()), !dbg !24
  store ptr %defv, ptr @defaults, align 8, !dbg !25
  ret void, !dbg !26
}

; Function Attrs: mustprogress nocallback nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nofree noinline nounwind uwtable
define dso_local ptr @getparam(ptr noundef %name) local_unnamed_addr #2 !dbg !27 {
entry:
  %buf = alloca [128 x i8], align 16

!32 = !DILocalVariable(name: "i", scope: !27, file: !3, line: 60, type: !33)
!33 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!34 = !DILocalVariable(name: "leng", scope: !27, file: !3, line: 60, type: !33)
!35 = !DILocalVariable(name: "def", scope: !27, file: !3, line: 61, type: !8)
!36 = !DILocalVariable(name: "buf", scope: !27, file: !3, line: 62, type: !37)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 128)
!40 = !DILocation(line: 0, scope: !27)
!41 = !DILocation(line: 62, column: 4, scope: !27)
!42 = !DILocation(line: 62, column: 9, scope: !27)
!43 = !DILocation(line: 64, column: 8, scope: !44)
!44 = distinct !DILexicalBlock(scope: !27, file: !3, line: 64, column: 8)
!45 = !DILocation(line: 64, column: 17, scope: !44)
!46 = !DILocation(line: 64, column: 8, scope: !27)
!47 = !DILocation(line: 65, column: 7, scope: !44)
!48 = !DILocation(line: 66, column: 17, scope: !27)
!49 = !DILocation(line: 66, column: 8, scope: !27)
!50 = !DILocation(line: 67, column: 10, scope: !51)
!51 = distinct !DILexicalBlock(scope: !27, file: !3, line: 67, column: 8)
!52 = !DILocation(line: 67, column: 8, scope: !27)
!53 = !DILocation(line: 68, column: 7, scope: !51)
!54 = !DILocation(line: 69, column: 20, scope: !27)
!55 = !DILocation(line: 69, column: 10, scope: !27)
!56 = !DILocation(line: 70, column: 20, scope: !27)
!57 = !DILocation(line: 70, column: 4, scope: !27)
!58 = !DILocation(line: 71, column: 11, scope: !27)
!59 = !DILocation(line: 72, column: 4, scope: !27)
!60 = !DILocation(line: 72, column: 16, scope: !27)
!61 = !DILocation(line: 74, column: 13, scope: !62)
!62 = distinct !DILexicalBlock(scope: !27, file: !3, line: 74, column: 8)
!63 = !DILocation(line: 74, column: 8, scope: !27)
!64 = !DILocation(line: 75, column: 22, scope: !65)
!65 = distinct !DILexicalBlock(scope: !62, file: !3, line: 74, column: 18)
!66 = !DILocation(line: 75, column: 15, scope: !65)
!67 = !DILocation(line: 75, column: 7, scope: !65)
!68 = !DILocation(line: 0, scope: !62)
!69 = !DILocation(line: 80, column: 1, scope: !27)
!70 = distinct !DISubprogram(name: "scanbind", scope: !3, file: !3, line: 136, type: !71, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !73)
!71 = !DISubroutineType(types: !72)
!72 = !{!33, !11, !8}
!73 = !{!74, !75, !76}
!74 = !DILocalVariable(name: "bvec", arg: 1, scope: !70, file: !3, line: 136, type: !11)
!75 = !DILocalVariable(name: "name", arg: 2, scope: !70, file: !3, line: 136, type: !8)
!76 = !DILocalVariable(name: "i", scope: !70, file: !3, line: 138, type: !33)
!77 = !DILocation(line: 0, scope: !70)
!78 = !DILocation(line: 140, column: 16, scope: !79)
!79 = distinct !DILexicalBlock(scope: !80, file: !3, line: 140, column: 4)
!80 = distinct !DILexicalBlock(scope: !70, file: !3, line: 140, column: 4)
!81 = !DILocation(line: 140, column: 24, scope: !79)
!82 = !DILocation(line: 140, column: 4, scope: !80)
!83 = !DILocation(line: 141, column: 11, scope: !84)
!84 = distinct !DILexicalBlock(scope: !79, file: !3, line: 141, column: 11)
!85 = !DILocation(line: 141, column: 11, scope: !79)
!86 = !DILocation(line: 140, column: 34, scope: !79)
!87 = distinct !{!87, !82, !88, !89, !90}
!88 = !DILocation(line: 142, column: 12, scope: !80)
!89 = !{!"llvm.loop.mustprogress"}
!90 = !{!"llvm.loop.unroll.disable"}
!91 = !DILocation(line: 144, column: 1, scope: !70)
!92 = distinct !DISubprogram(name: "extrvalue", scope: !3, file: !3, line: 167, type: !28, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !93)
!93 = !{!94, !95}
!94 = !DILocalVariable(name: "arg", arg: 1, scope: !92, file: !3, line: 167, type: !8)
!95 = !DILocalVariable(name: "ap", scope: !92, file: !3, line: 169, type: !6)
!96 = !DILocation(line: 0, scope: !92)
!97 = !DILocation(line: 172, column: 4, scope: !92)
!98 = !DILocation(line: 172, column: 11, scope: !92)
!99 = !DILocation(line: 172, column: 15, scope: !92)
!100 = !DILocation(line: 173, column: 14, scope: !101)
!101 = distinct !DILexicalBlock(scope: !92, file: !3, line: 173, column: 11)
!102 = !DILocation(line: 173, column: 17, scope: !101)
!103 = !DILocation(line: 173, column: 11, scope: !92)
!104 = distinct !{!104, !97, !105, !89, !90}
!105 = !DILocation(line: 174, column: 22, scope: !92)
!106 = !DILocation(line: 176, column: 1, scope: !92)
!107 = !DISubprogram(name: "fgets", scope: !108, file: !108, line: 564, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !172)
!108 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!109 = !DISubroutineType(types: !110)
!110 = !{!6, !111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!112 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !116, line: 7, baseType: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !118, line: 49, size: 1728, elements: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !135, !137, !138, !139, !142, !144, !146, !150, !153, !155, !158, !161, !162, !163, !167, !168}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !117, file: !118, line: 51, baseType: !112, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !117, file: !118, line: 54, baseType: !6, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !117, file: !118, line: 55, baseType: !6, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !117, file: !118, line: 56, baseType: !6, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !117, file: !118, line: 57, baseType: !6, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !117, file: !118, line: 58, baseType: !6, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !117, file: !118, line: 59, baseType: !6, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !117, file: !118, line: 60, baseType: !6, size: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !117, file: !118, line: 61, baseType: !6, size: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !117, file: !118, line: 64, baseType: !6, size: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !117, file: !118, line: 65, baseType: !6, size: 64, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !117, file: !118, line: 66, baseType: !6, size: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !117, file: !118, line: 68, baseType: !133, size: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !118, line: 36, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !117, file: !118, line: 70, baseType: !136, size: 64, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !117, file: !118, line: 72, baseType: !112, size: 32, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !117, file: !118, line: 73, baseType: !112, size: 32, offset: 928)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !117, file: !118, line: 74, baseType: !140, size: 64, offset: 960)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !141, line: 152, baseType: !33)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !117, file: !118, line: 77, baseType: !143, size: 16, offset: 1024)
!143 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !117, file: !118, line: 78, baseType: !145, size: 8, offset: 1040)
!145 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !117, file: !118, line: 79, baseType: !147, size: 8, offset: 1048)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 1)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !117, file: !118, line: 81, baseType: !151, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !118, line: 43, baseType: null)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !117, file: !118, line: 89, baseType: !154, size: 64, offset: 1152)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !141, line: 153, baseType: !33)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !117, file: !118, line: 91, baseType: !156, size: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !118, line: 37, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !117, file: !118, line: 92, baseType: !159, size: 64, offset: 1280)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !118, line: 38, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !117, file: !118, line: 93, baseType: !136, size: 64, offset: 1344)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !117, file: !118, line: 94, baseType: !5, size: 64, offset: 1408)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !117, file: !118, line: 95, baseType: !164, size: 64, offset: 1472)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 46, baseType: !166)
!165 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!166 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !117, file: !118, line: 96, baseType: !112, size: 32, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !117, file: !118, line: 98, baseType: !169, size: 160, offset: 1568)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 20)
!172 = !{}
!173 = distinct !DISubprogram(name: "getiparam", scope: !3, file: !3, line: 86, type: !174, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !176)
!174 = !DISubroutineType(types: !175)
!175 = !{!33, !8}
!176 = !{!177, !178}
!177 = !DILocalVariable(name: "name", arg: 1, scope: !173, file: !3, line: 86, type: !8)
!178 = !DILocalVariable(name: "val", scope: !173, file: !3, line: 88, type: !8)
!179 = !DILocation(line: 0, scope: !173)
!180 = !DILocation(line: 90, column: 4, scope: !181)
!181 = distinct !DILexicalBlock(scope: !173, file: !3, line: 90, column: 4)
!182 = !DILocation(line: 91, column: 13, scope: !183)
!183 = distinct !DILexicalBlock(scope: !184, file: !3, line: 90, column: 34)
!184 = distinct !DILexicalBlock(scope: !181, file: !3, line: 90, column: 4)
!185 = !DILocation(line: 90, column: 19, scope: !184)
!186 = !DILocation(line: 90, column: 24, scope: !184)
!187 = distinct !{!187, !180, !188, !89, !90}
!188 = !DILocation(line: 92, column: 4, scope: !181)
!189 = !DILocation(line: 93, column: 12, scope: !173)
!190 = !DILocation(line: 93, column: 11, scope: !173)
!191 = !DILocation(line: 93, column: 4, scope: !173)
!192 = !DISubprogram(name: "atoi", scope: !193, file: !193, line: 104, type: !194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !172)
!193 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!194 = !DISubroutineType(types: !195)
!195 = !{!112, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!198 = distinct !DISubprogram(name: "getlparam", scope: !3, file: !3, line: 96, type: !174, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !199)
!199 = !{!200, !201}
!200 = !DILocalVariable(name: "name", arg: 1, scope: !198, file: !3, line: 96, type: !8)
!201 = !DILocalVariable(name: "val", scope: !198, file: !3, line: 98, type: !8)
!202 = !DILocation(line: 0, scope: !198)
!203 = !DILocation(line: 100, column: 4, scope: !204)
!204 = distinct !DILexicalBlock(scope: !198, file: !3, line: 100, column: 4)
!205 = !DILocation(line: 101, column: 13, scope: !206)
!206 = distinct !DILexicalBlock(scope: !204, file: !3, line: 100, column: 4)
!207 = !DILocation(line: 100, column: 19, scope: !206)
!208 = !DILocation(line: 100, column: 24, scope: !206)
!209 = distinct !{!209, !203, !210, !89, !90}
!210 = !DILocation(line: 101, column: 26, scope: !204)
!211 = !DILocation(line: 102, column: 12, scope: !198)
!212 = !DILocation(line: 102, column: 4, scope: !198)
!213 = !DISubprogram(name: "atol", scope: !193, file: !193, line: 107, type: !214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !172)
!214 = !DISubroutineType(types: !215)
!215 = !{!33, !196}
!216 = distinct !DISubprogram(name: "getbparam", scope: !3, file: !3, line: 105, type: !217, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !220)
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !8}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !9, line: 45, baseType: !33)
!220 = !{!221, !222}
!221 = !DILocalVariable(name: "name", arg: 1, scope: !216, file: !3, line: 105, type: !8)
!222 = !DILocalVariable(name: "val", scope: !216, file: !3, line: 107, type: !8)
!223 = !DILocation(line: 0, scope: !216)
!224 = !DILocation(line: 109, column: 4, scope: !225)
!225 = distinct !DILexicalBlock(scope: !216, file: !3, line: 109, column: 4)
