; ModuleID = 'grav.c'
source_filename = "grav.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.local_memory = type { [512 x i64], double, double, i64, i64, i64, [3 x double], [3 x double], i64, i64, i64, ptr, i64, ptr, i64, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, ptr, [3 x double], double, [3 x double], [3 x double], double, ptr, ptr, [3 x i64], double, [3 x double], [3 x [3 x double]], [3 x [3 x double]], [2 x [3 x double]], [3 x double], [512 x i64] }
%struct._node = type { i64, double, [3 x double], i64, i64, ptr, i64 }
%struct._body = type { i64, double, [3 x double], i64, i64, ptr, i64, [3 x double], [3 x double], double }
%struct.GlobalMemory = type { i64, i64, i64, double, [3 x double], [3 x [3 x double]], [3 x [3 x double]], [2 x [3 x double]], [3 x double], ptr, [3 x double], [3 x double], [3 x double], double, %struct.anon.2, %struct.anon.3, %struct.anon.4, %struct.anon.5, %struct.anon.6, %struct.anon.7, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.anon.2 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.0, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "grav.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/barnes", checksumkind: CSK_MD5, checksum: "cd6a3aafa1476bb57cdd44f1007ff38a")
!2 = !{!3, !26, !14, !46, !126, !36}
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "nodeptr", file: !4, line: 67, baseType: !5)
!4 = !DIFile(filename: "./defs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/barnes", checksumkind: CSK_MD5, checksum: "a70fd3172df660c9d5c631c3b06e5de2")
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !4, line: 65, baseType: !7)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_node", file: !4, line: 56, size: 576, elements: !8)
!8 = !{!9, !11, !15, !21, !22, !23, !25}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !7, file: !4, line: 57, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !7, file: !4, line: 58, baseType: !12, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !13, line: 70, baseType: !14)
!13 = !DIFile(filename: "./stdinc.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/barnes", checksumkind: CSK_MD5, checksum: "7e5b049cdc5bbb3d00ff9fe2a55bf64e")
!14 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !7, file: !4, line: 59, baseType: !16, size: 192, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector", file: !17, line: 30, baseType: !18)
!17 = !DIFile(filename: "./vectmath.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/barnes", checksumkind: CSK_MD5, checksum: "0ae09f78c47e66d21f2861f9ccfce29c")
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 3)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !7, file: !4, line: 60, baseType: !10, size: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !7, file: !4, line: 61, baseType: !10, size: 64, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !7, file: !4, line: 62, baseType: !24, size: 64, offset: 448)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "child_num", scope: !7, file: !4, line: 63, baseType: !10, size: 64, offset: 512)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "bodyptr", file: !4, line: 81, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_body", file: !4, line: 87, size: 1024, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !122, !123, !124, !125}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !4, line: 88, baseType: !10, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !28, file: !4, line: 89, baseType: !12, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !28, file: !4, line: 90, baseType: !16, size: 192, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !28, file: !4, line: 91, baseType: !10, size: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !28, file: !4, line: 92, baseType: !10, size: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !28, file: !4, line: 93, baseType: !36, size: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "leafptr", file: !4, line: 82, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_leaf", file: !4, line: 137, size: 1984, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !45, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !38, file: !4, line: 138, baseType: !10, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !38, file: !4, line: 139, baseType: !12, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !38, file: !4, line: 140, baseType: !16, size: 192, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !38, file: !4, line: 141, baseType: !10, size: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !38, file: !4, line: 142, baseType: !10, size: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !38, file: !4, line: 143, baseType: !46, size: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "cellptr", file: !4, line: 83, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cell", file: !4, line: 110, size: 1792, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !105, !106}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !48, file: !4, line: 111, baseType: !10, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !48, file: !4, line: 112, baseType: !12, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !48, file: !4, line: 113, baseType: !16, size: 192, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !48, file: !4, line: 114, baseType: !10, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !48, file: !4, line: 115, baseType: !10, size: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !48, file: !4, line: 116, baseType: !46, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "child_num", scope: !48, file: !4, line: 117, baseType: !10, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !48, file: !4, line: 118, baseType: !10, size: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !4, line: 119, baseType: !47, size: 64, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !48, file: !4, line: 119, baseType: !47, size: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !48, file: !4, line: 120, baseType: !10, size: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "done_cv", scope: !48, file: !4, line: 124, baseType: !62, size: 384, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !63, line: 80, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !63, line: 75, size: 384, elements: !65)
!65 = !{!66, !98, !103}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !64, file: !63, line: 77, baseType: !67, size: 384)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !68, line: 92, size: 384, elements: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!69 = !{!70, !81, !90, !94, !95, !96, !97}
!70 = !DIDerivedType(tag: DW_TAG_member, scope: !67, file: !68, line: 94, baseType: !71, size: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !67, file: !68, line: 94, size: 64, elements: !72)
!72 = !{!73, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !71, file: !68, line: 96, baseType: !74, size: 64)
!74 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !71, file: !68, line: 101, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !68, line: 97, size: 64, elements: !77)
!77 = !{!78, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !76, file: !68, line: 99, baseType: !79, size: 32)
!79 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !76, file: !68, line: 100, baseType: !79, size: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, scope: !67, file: !68, line: 103, baseType: !82, size: 64, offset: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !67, file: !68, line: 103, size: 64, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !82, file: !68, line: 105, baseType: !74, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !82, file: !68, line: 110, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !68, line: 106, size: 64, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !86, file: !68, line: 108, baseType: !79, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !86, file: !68, line: 109, baseType: !79, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !67, file: !68, line: 112, baseType: !91, size: 64, offset: 128)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 64, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 2)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !67, file: !68, line: 113, baseType: !91, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !67, file: !68, line: 114, baseType: !79, size: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !67, file: !68, line: 115, baseType: !79, size: 32, offset: 288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !67, file: !68, line: 116, baseType: !91, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !64, file: !63, line: 78, baseType: !99, size: 384)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 384, elements: !101)
!100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!101 = !{!102}
!102 = !DISubrange(count: 48)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !64, file: !63, line: 79, baseType: !104, size: 64)
!104 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !48, file: !4, line: 125, baseType: !10, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "subp", scope: !48, file: !4, line: 126, baseType: !107, size: 512, offset: 1280)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 512, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "child_num", scope: !38, file: !4, line: 144, baseType: !10, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !38, file: !4, line: 145, baseType: !10, size: 64, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !38, file: !4, line: 146, baseType: !37, size: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !38, file: !4, line: 146, baseType: !37, size: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !38, file: !4, line: 147, baseType: !10, size: 64, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "done_cv", scope: !38, file: !4, line: 151, baseType: !62, size: 384, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !38, file: !4, line: 152, baseType: !10, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "num_bodies", scope: !38, file: !4, line: 153, baseType: !10, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "bodyp", scope: !38, file: !4, line: 154, baseType: !119, size: 640, offset: 1344)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 640, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 10)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "child_num", scope: !28, file: !4, line: 94, baseType: !10, size: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "vel", scope: !28, file: !4, line: 95, baseType: !16, size: 192, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !28, file: !4, line: 96, baseType: !16, size: 192, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !28, file: !4, line: 97, baseType: !12, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !{i32 7, !"Dwarf Version", i32 5}
!128 = !{i32 2, !"Debug Info Version", i32 3}
!129 = !{i32 1, !"wchar_size", i32 4}
!130 = !{i32 7, !"PIC Level", i32 2}
!131 = !{i32 7, !"PIE Level", i32 2}
!132 = !{i32 7, !"uwtable", i32 2}
!133 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!134 = distinct !DISubprogram(name: "hackgrav", scope: !1, file: !1, line: 48, type: !135, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !137)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !26, !10}
!137 = !{!138, !139, !140, !142, !144}
!138 = !DILocalVariable(name: "p", arg: 1, scope: !134, file: !1, line: 48, type: !26)
!139 = !DILocalVariable(name: "ProcessId", arg: 2, scope: !134, file: !1, line: 48, type: !10)
!140 = !DILocalVariable(name: "_i", scope: !141, file: !1, line: 51, type: !10)
!141 = distinct !DILexicalBlock(scope: !134, file: !1, line: 51, column: 4)
!142 = !DILocalVariable(name: "_i", scope: !143, file: !1, line: 53, type: !10)
!143 = distinct !DILexicalBlock(scope: !134, file: !1, line: 53, column: 4)
!144 = !DILocalVariable(name: "_i", scope: !145, file: !1, line: 59, type: !10)
!145 = distinct !DILexicalBlock(scope: !134, file: !1, line: 59, column: 4)
!146 = !DILocation(line: 0, scope: !134)
!147 = !DILocation(line: 50, column: 21, scope: !134)
!148 = !DILocation(line: 50, column: 27, scope: !134)
!149 = !DILocation(line: 0, scope: !141)
!150 = !DILocation(line: 51, column: 4, scope: !151)
!151 = distinct !DILexicalBlock(scope: !141, file: !1, line: 51, column: 4)
!152 = !DILocation(line: 51, column: 4, scope: !153)
!153 = distinct !DILexicalBlock(scope: !151, file: !1, line: 51, column: 4)
!154 = distinct !{!154, !150, !150, !155, !156}
!155 = !{!"llvm.loop.mustprogress"}
!156 = !{!"llvm.loop.unroll.disable"}
!157 = !DILocation(line: 52, column: 21, scope: !134)
!158 = !DILocation(line: 52, column: 26, scope: !134)
!159 = !DILocation(line: 0, scope: !143)
!160 = !DILocation(line: 53, column: 4, scope: !161)
!161 = distinct !DILexicalBlock(scope: !143, file: !1, line: 53, column: 4)
!162 = !DILocation(line: 53, column: 4, scope: !163)
!163 = distinct !DILexicalBlock(scope: !161, file: !1, line: 53, column: 4)
!164 = !DILocation(line: 54, column: 21, scope: !134)
!165 = !DILocation(line: 55, column: 31, scope: !134)
!166 = !DILocation(line: 57, column: 4, scope: !134)
!167 = !DILocation(line: 58, column: 30, scope: !134)
!168 = !DILocation(line: 58, column: 4, scope: !134)
!169 = !DILocation(line: 58, column: 11, scope: !134)
!170 = !DILocation(line: 0, scope: !145)
!171 = !DILocation(line: 59, column: 4, scope: !172)
!172 = distinct !DILexicalBlock(scope: !145, file: !1, line: 59, column: 4)
!173 = !DILocation(line: 59, column: 4, scope: !174)
!174 = distinct !DILexicalBlock(scope: !172, file: !1, line: 59, column: 4)
!175 = distinct !{!175, !171, !171, !155, !156}
!176 = !DILocation(line: 55, column: 21, scope: !134)
!177 = !DILocation(line: 63, column: 31, scope: !134)
!178 = !DILocation(line: 63, column: 60, scope: !134)
!179 = !DILocation(line: 63, column: 41, scope: !134)
!180 = !DILocation(line: 63, column: 4, scope: !134)
!181 = !DILocation(line: 63, column: 12, scope: !134)
!182 = !DILocation(line: 65, column: 1, scope: !134)
!183 = distinct !DISubprogram(name: "hackwalk", scope: !1, file: !1, line: 120, type: !184, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !186)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !10}
!186 = !{!187}
!187 = !DILocalVariable(name: "ProcessId", arg: 1, scope: !183, file: !1, line: 120, type: !10)
!188 = !DILocation(line: 0, scope: !183)
!189 = !DILocation(line: 122, column: 22, scope: !183)
!190 = !DILocation(line: 122, column: 30, scope: !183)
!191 = !DILocation(line: 122, column: 46, scope: !183)
!192 = !DILocation(line: 122, column: 52, scope: !183)
!193 = !DILocation(line: 122, column: 5, scope: !183)
!194 = !DILocation(line: 123, column: 1, scope: !183)
!195 = distinct !DISubprogram(name: "gravsub", scope: !1, file: !1, line: 73, type: !196, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !198)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !3, !10}
!198 = !{!199, !200, !201, !202, !203, !204, !205, !210, !211, !212, !214, !215, !217, !218, !220, !221}
!199 = !DILocalVariable(name: "p", arg: 1, scope: !195, file: !1, line: 73, type: !3)
!200 = !DILocalVariable(name: "ProcessId", arg: 2, scope: !195, file: !1, line: 73, type: !10)
!201 = !DILocalVariable(name: "drabs", scope: !195, file: !1, line: 75, type: !12)
!202 = !DILocalVariable(name: "phii", scope: !195, file: !1, line: 75, type: !12)
!203 = !DILocalVariable(name: "mor3", scope: !195, file: !1, line: 75, type: !12)
!204 = !DILocalVariable(name: "ai", scope: !195, file: !1, line: 76, type: !16)
!205 = !DILocalVariable(name: "_vp", scope: !206, file: !1, line: 82, type: !209)
!206 = distinct !DILexicalBlock(scope: !207, file: !1, line: 82, column: 9)
!207 = distinct !DILexicalBlock(scope: !208, file: !1, line: 78, column: 37)
!208 = distinct !DILexicalBlock(scope: !195, file: !1, line: 78, column: 9)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!210 = !DILocalVariable(name: "_up", scope: !206, file: !1, line: 82, type: !209)
!211 = !DILocalVariable(name: "_wp", scope: !206, file: !1, line: 82, type: !209)
!212 = !DILocalVariable(name: "_vp", scope: !213, file: !1, line: 86, type: !209)
!213 = distinct !DILexicalBlock(scope: !207, file: !1, line: 86, column: 9)
!214 = !DILocalVariable(name: "_up", scope: !213, file: !1, line: 86, type: !209)
!215 = !DILocalVariable(name: "_vp", scope: !216, file: !1, line: 94, type: !209)
!216 = distinct !DILexicalBlock(scope: !195, file: !1, line: 94, column: 5)
!217 = !DILocalVariable(name: "_up", scope: !216, file: !1, line: 94, type: !209)
!218 = !DILocalVariable(name: "_vp", scope: !219, file: !1, line: 95, type: !209)
!219 = distinct !DILexicalBlock(scope: !195, file: !1, line: 95, column: 5)
!220 = !DILocalVariable(name: "_up", scope: !219, file: !1, line: 95, type: !209)
!221 = !DILocalVariable(name: "_wp", scope: !219, file: !1, line: 95, type: !209)
!222 = !DILocation(line: 0, scope: !195)
!223 = !DILocation(line: 78, column: 31, scope: !208)
!224 = !DILocation(line: 78, column: 11, scope: !208)
!225 = !DILocation(line: 78, column: 9, scope: !195)
!226 = !DILocation(line: 89, column: 27, scope: !195)
!227 = !DILocation(line: 80, column: 26, scope: !228)
!228 = distinct !DILexicalBlock(scope: !207, file: !1, line: 80, column: 3)
!229 = !DILocation(line: 80, column: 56, scope: !228)
!230 = !DILocation(line: 80, column: 64, scope: !228)
!231 = !DILocation(line: 80, column: 71, scope: !228)
!232 = !DILocation(line: 80, column: 25, scope: !228)
!233 = !DILocation(line: 80, column: 4, scope: !228)
!234 = !DILocation(line: 82, column: 9, scope: !206)
!235 = !DILocation(line: 0, scope: !206)
!236 = !DILocation(line: 84, column: 28, scope: !237)
!237 = distinct !DILexicalBlock(scope: !207, file: !1, line: 84, column: 3)
!238 = !DILocation(line: 84, column: 58, scope: !237)
!239 = !DILocation(line: 84, column: 66, scope: !237)
!240 = !DILocation(line: 84, column: 73, scope: !237)
!241 = !DILocation(line: 84, column: 27, scope: !237)
!242 = !DILocation(line: 84, column: 4, scope: !237)
!243 = !DILocation(line: 0, scope: !213)
!244 = !DILocation(line: 86, column: 9, scope: !213)
!245 = !DILocation(line: 87, column: 5, scope: !207)
!246 = !DILocation(line: 89, column: 30, scope: !195)
!247 = !DILocation(line: 89, column: 22, scope: !195)
!248 = !DILocation(line: 90, column: 13, scope: !195)
!249 = !DILocation(line: 91, column: 12, scope: !195)
!250 = !DILocation(line: 91, column: 20, scope: !195)
!251 = !DILocation(line: 92, column: 22, scope: !195)
!252 = !DILocation(line: 92, column: 27, scope: !195)
!253 = !DILocation(line: 93, column: 36, scope: !195)
!254 = !DILocation(line: 93, column: 17, scope: !195)
!255 = !DILocation(line: 0, scope: !216)
!256 = !DILocation(line: 94, column: 5, scope: !216)
!257 = !DILocation(line: 95, column: 5, scope: !219)
!258 = !DILocation(line: 0, scope: !219)
!259 = !DILocation(line: 96, column: 8, scope: !260)
!260 = distinct !DILexicalBlock(scope: !195, file: !1, line: 96, column: 8)
!261 = !DILocation(line: 96, column: 16, scope: !260)
!262 = !DILocation(line: 96, column: 8, scope: !195)
!263 = !DILocation(line: 97, column: 25, scope: !264)
!264 = distinct !DILexicalBlock(scope: !260, file: !1, line: 96, column: 25)
!265 = !DILocation(line: 110, column: 5, scope: !264)
!266 = !DILocation(line: 112, column: 25, scope: !267)
!267 = distinct !DILexicalBlock(scope: !260, file: !1, line: 111, column: 10)
!268 = !DILocation(line: 0, scope: !260)
!269 = !DILocation(line: 114, column: 1, scope: !195)
!270 = !DISubprogram(name: "pthread_mutex_lock", scope: !271, file: !271, line: 738, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !303)
!271 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !275}
!274 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !63, line: 72, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !63, line: 67, size: 320, elements: !278)
!278 = !{!279, !298, !302}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !277, file: !63, line: 69, baseType: !280, size: 320)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !281, line: 22, size: 320, elements: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!282 = !{!283, !284, !285, !286, !287, !288, !290, !291}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !280, file: !281, line: 24, baseType: !274, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !280, file: !281, line: 25, baseType: !79, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !280, file: !281, line: 26, baseType: !274, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !280, file: !281, line: 28, baseType: !79, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !280, file: !281, line: 32, baseType: !274, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !280, file: !281, line: 34, baseType: !289, size: 16, offset: 160)
!289 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !280, file: !281, line: 35, baseType: !289, size: 16, offset: 176)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !280, file: !281, line: 36, baseType: !292, size: 128, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !68, line: 53, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !68, line: 49, size: 128, elements: !294)
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !293, file: !68, line: 51, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !293, file: !68, line: 52, baseType: !296, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !277, file: !63, line: 70, baseType: !299, size: 320)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 320, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 40)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !277, file: !63, line: 71, baseType: !10, size: 64)
!303 = !{}
!304 = !DISubprogram(name: "pthread_mutex_unlock", scope: !271, file: !271, line: 756, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !303)
!305 = distinct !DISubprogram(name: "walksub", scope: !1, file: !1, line: 129, type: !306, scopeLine: 130, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !3, !12, !10}
!308 = !{!309, !310, !311, !312, !314, !315, !316}
!309 = !DILocalVariable(name: "n", arg: 1, scope: !305, file: !1, line: 129, type: !3)
!310 = !DILocalVariable(name: "dsq", arg: 2, scope: !305, file: !1, line: 129, type: !12)
!311 = !DILocalVariable(name: "ProcessId", arg: 3, scope: !305, file: !1, line: 129, type: !10)
!312 = !DILocalVariable(name: "nn", scope: !305, file: !1, line: 131, type: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!314 = !DILocalVariable(name: "l", scope: !305, file: !1, line: 132, type: !36)
!315 = !DILocalVariable(name: "p", scope: !305, file: !1, line: 133, type: !26)
!316 = !DILocalVariable(name: "i", scope: !305, file: !1, line: 134, type: !10)
!317 = !DILocation(line: 0, scope: !305)
!318 = !DILocation(line: 136, column: 8, scope: !319)
!319 = distinct !DILexicalBlock(scope: !305, file: !1, line: 136, column: 8)
!320 = !DILocation(line: 136, column: 8, scope: !305)
!321 = !DILocation(line: 137, column: 11, scope: !322)
!322 = distinct !DILexicalBlock(scope: !323, file: !1, line: 137, column: 11)
!323 = distinct !DILexicalBlock(scope: !319, file: !1, line: 136, column: 36)
!324 = !DILocation(line: 137, column: 19, scope: !322)
!325 = !DILocation(line: 137, column: 11, scope: !323)
!326 = !DILocation(line: 146, column: 22, scope: !327)
!327 = distinct !DILexicalBlock(scope: !328, file: !1, line: 146, column: 3)
!328 = distinct !DILexicalBlock(scope: !329, file: !1, line: 146, column: 3)
!329 = distinct !DILexicalBlock(scope: !322, file: !1, line: 144, column: 12)
!330 = !DILocation(line: 146, column: 17, scope: !327)
!331 = !DILocation(line: 146, column: 3, scope: !328)
!332 = !DILocation(line: 138, column: 13, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !1, line: 138, column: 3)
!334 = distinct !DILexicalBlock(scope: !322, file: !1, line: 137, column: 28)
!335 = !DILocation(line: 138, column: 3, scope: !333)
!336 = !DILocation(line: 139, column: 10, scope: !337)
!337 = distinct !DILexicalBlock(scope: !338, file: !1, line: 139, column: 10)
!338 = distinct !DILexicalBlock(scope: !339, file: !1, line: 138, column: 49)
!339 = distinct !DILexicalBlock(scope: !333, file: !1, line: 138, column: 3)
!340 = !DILocation(line: 139, column: 14, scope: !337)
!341 = !DILocation(line: 139, column: 10, scope: !338)
!342 = !DILocation(line: 140, column: 9, scope: !343)
!343 = distinct !DILexicalBlock(scope: !337, file: !1, line: 139, column: 23)
!344 = !DILocation(line: 141, column: 6, scope: !343)
!345 = !DILocation(line: 138, column: 45, scope: !339)
!346 = !DILocation(line: 138, column: 25, scope: !339)
!347 = distinct !{!347, !335, !348, !155, !156}
!348 = !DILocation(line: 142, column: 3, scope: !333)
!349 = !DILocation(line: 147, column: 10, scope: !350)
!350 = distinct !DILexicalBlock(scope: !327, file: !1, line: 146, column: 39)
!351 = !DILocation(line: 148, column: 32, scope: !352)
!352 = distinct !DILexicalBlock(scope: !350, file: !1, line: 148, column: 10)
