; ModuleID = 'huprn.c'
source_filename = "huprn.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.voxel = type { i64, i64, ptr, ptr, i8, [7 x i8] }
%struct.grid = type { i64, ptr, ptr, ptr, i64, [3 x i64], i64, [3 x double], [3 x double], i64, ptr, ptr }
%struct.ray = type { i64, i64, i64, [3 x double], [3 x double], i64, ptr, i64, [3 x i64], [5 x %struct.rayinfo], float, float }
%struct.rayinfo = type { ptr, [3 x double], i64, double, i64, double, [3 x double], [3 x i64], i64, [3 x i64], ptr }
%struct.element = type { i64, ptr, ptr, %struct.bbox }
%struct.bbox = type { [3 x double], [3 x double] }
%struct.btnode = type { ptr, [3 x double], i64, [3 x i64], [3 x i64], i64, i64, [2 x ptr] }

@stderr = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [28 x i8] c"    Print Voxel  id = %ld \0A\00", align 1
@.str.1 = private unnamed_addr constant [22 x i8] c"        celltype %d \0A\00", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"        gsm_voxel \0A\00", align 1
@.str.3 = private unnamed_addr constant [33 x i8] c"        primElement index list:\0A\00", align 1
@.str.4 = private unnamed_addr constant [18 x i8] c"            %ld \0A\00", align 1
@.str.5 = private unnamed_addr constant [26 x i8] c"        gsm_grid id %ld \0A\00", align 1
@.str.6 = private unnamed_addr constant [16 x i8] c"    End Voxel \0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "huprn.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "f3d1cf0964ad9d55f199fd84398d1b33")
!2 = !{!3, !78, !130}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT", file: !6, line: 481, baseType: !7)
!6 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "element", file: !6, line: 474, size: 576, elements: !8)
!8 = !{!9, !12, !76, !77}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !7, file: !6, line: 476, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !6, line: 297, baseType: !11)
!11 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !7, file: !6, line: 477, baseType: !13, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !6, line: 488, size: 1024, elements: !15)
!15 = !{!16, !17, !23, !34, !35, !36, !61, !75}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !14, file: !6, line: 490, baseType: !10, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !6, line: 491, baseType: !18, size: 256, offset: 64)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, elements: !21)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !6, line: 287, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !{!22}
!22 = !DISubrange(count: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !14, file: !6, line: 492, baseType: !24, size: 384, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", file: !6, line: 418, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbox", file: !6, line: 413, size: 384, elements: !26)
!26 = !{!27, !33}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "dnear", scope: !25, file: !6, line: 415, baseType: !28, size: 192)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 192, elements: !31)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "REAL", file: !6, line: 310, baseType: !30)
!30 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!31 = !{!32}
!32 = !DISubrange(count: 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dfar", scope: !25, file: !6, line: 416, baseType: !28, size: 192, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !14, file: !6, line: 493, baseType: !4, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !14, file: !6, line: 494, baseType: !10, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !14, file: !6, line: 495, baseType: !37, size: 64, offset: 832)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROCS", file: !6, line: 340, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pprocs", file: !6, line: 327, size: 640, elements: !40)
!40 = !{!41, !46, !50, !51, !52, !53, !57, !58, !59, !60}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !6, line: 329, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, null}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !39, file: !6, line: 330, baseType: !47, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, null}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !39, file: !6, line: 331, baseType: !47, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "binread", scope: !39, file: !6, line: 332, baseType: !47, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !39, file: !6, line: 333, baseType: !47, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "intersect", scope: !39, file: !6, line: 334, baseType: !54, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!10, null}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pe_intersect", scope: !39, file: !6, line: 335, baseType: !54, size: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !39, file: !6, line: 336, baseType: !47, size: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "normalize", scope: !39, file: !6, line: 337, baseType: !47, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !39, file: !6, line: 338, baseType: !47, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "surf", scope: !14, file: !6, line: 496, baseType: !62, size: 64, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "SURF", file: !6, line: 357, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "surf", file: !6, line: 347, size: 704, elements: !65)
!65 = !{!66, !69, !70, !71, !72, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fcolor", scope: !64, file: !6, line: 349, baseType: !67, size: 192)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOR", file: !6, line: 319, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC3", file: !6, line: 314, baseType: !28)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bcolor", scope: !64, file: !6, line: 350, baseType: !67, size: 192, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "kdiff", scope: !64, file: !6, line: 351, baseType: !29, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "kspec", scope: !64, file: !6, line: 352, baseType: !29, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ktran", scope: !64, file: !6, line: 353, baseType: !29, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "refrindex", scope: !64, file: !6, line: 354, baseType: !29, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "kspecn", scope: !64, file: !6, line: 355, baseType: !29, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !6, line: 497, baseType: !13, size: 64, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !7, file: !6, line: 478, baseType: !45, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !7, file: !6, line: 479, baseType: !24, size: 384, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRID", file: !6, line: 572, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "grid", file: !6, line: 539, size: 1152, elements: !81)
!81 = !{!82, !83, !99, !103, !104, !105, !107, !108, !109, !110, !111, !128}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !80, file: !6, line: 541, baseType: !10, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !80, file: !6, line: 542, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOXEL", file: !6, line: 405, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "voxel", file: !6, line: 394, size: 320, elements: !88)
!88 = !{!89, !90, !91, !93, !94, !95}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !87, file: !6, line: 396, baseType: !10, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !87, file: !6, line: 397, baseType: !10, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !6, line: 398, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cell", scope: !87, file: !6, line: 399, baseType: !45, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "celltype", scope: !87, file: !6, line: 400, baseType: !19, size: 8, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !87, file: !6, line: 403, baseType: !96, size: 56, offset: 264)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 56, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 7)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "emptycells", scope: !80, file: !6, line: 548, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !6, line: 298, baseType: !102)
!102 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pepa", scope: !80, file: !6, line: 555, baseType: !3, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "num_prims", scope: !80, file: !6, line: 556, baseType: !10, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc", scope: !80, file: !6, line: 558, baseType: !106, size: 192, offset: 320)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !31)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !80, file: !6, line: 562, baseType: !10, size: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !80, file: !6, line: 563, baseType: !28, size: 192, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cellsize", scope: !80, file: !6, line: 564, baseType: !28, size: 192, offset: 768)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv_level", scope: !80, file: !6, line: 566, baseType: !10, size: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bintree", scope: !80, file: !6, line: 569, baseType: !112, size: 64, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "BTNODE", file: !6, line: 535, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btnode", file: !6, line: 522, size: 960, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !114, file: !6, line: 524, baseType: !3, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !114, file: !6, line: 525, baseType: !28, size: 192, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nprims", scope: !114, file: !6, line: 527, baseType: !10, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !114, file: !6, line: 528, baseType: !106, size: 192, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !114, file: !6, line: 529, baseType: !106, size: 192, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !114, file: !6, line: 531, baseType: !10, size: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "totalPrimsAllocated", scope: !114, file: !6, line: 532, baseType: !10, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "btn", scope: !114, file: !6, line: 533, baseType: !124, size: 128, offset: 832)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, elements: !126)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!126 = !{!127}
!127 = !DISubrange(count: 2)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !80, file: !6, line: 570, baseType: !129, size: 64, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !{i32 7, !"Dwarf Version", i32 5}
!132 = !{i32 2, !"Debug Info Version", i32 3}
!133 = !{i32 1, !"wchar_size", i32 4}
!134 = !{i32 7, !"PIC Level", i32 2}
!135 = !{i32 7, !"PIE Level", i32 2}
!136 = !{i32 7, !"uwtable", i32 2}
!137 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!138 = distinct !DISubprogram(name: "prn_voxel", scope: !1, file: !1, line: 34, type: !139, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !141)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !85}
!141 = !{!142, !143, !144, !145, !146}
!142 = !DILocalVariable(name: "v", arg: 1, scope: !138, file: !1, line: 34, type: !85)
!143 = !DILocalVariable(name: "pe", scope: !138, file: !1, line: 36, type: !4)
!144 = !DILocalVariable(name: "pepa", scope: !138, file: !1, line: 36, type: !3)
!145 = !DILocalVariable(name: "g", scope: !138, file: !1, line: 37, type: !78)
!146 = !DILocalVariable(name: "i", scope: !138, file: !1, line: 38, type: !10)
!147 = !DILocation(line: 0, scope: !138)
!148 = !DILocation(line: 40, column: 10, scope: !138)
!149 = !DILocation(line: 40, column: 53, scope: !138)
!150 = !DILocation(line: 40, column: 2, scope: !138)
!151 = !DILocation(line: 41, column: 10, scope: !138)
!152 = !DILocation(line: 41, column: 47, scope: !138)
!153 = !DILocation(line: 41, column: 44, scope: !138)
!154 = !DILocation(line: 41, column: 2, scope: !138)
!155 = !DILocation(line: 43, column: 9, scope: !156)
!156 = distinct !DILexicalBlock(scope: !138, file: !1, line: 43, column: 6)
!157 = !DILocation(line: 43, column: 18, scope: !156)
!158 = !DILocation(line: 43, column: 6, scope: !138)
!159 = !DILocation(line: 45, column: 11, scope: !160)
!160 = distinct !DILexicalBlock(scope: !156, file: !1, line: 44, column: 3)
!161 = !DILocation(line: 45, column: 3, scope: !160)
!162 = !DILocation(line: 46, column: 11, scope: !160)
!163 = !DILocation(line: 46, column: 3, scope: !160)
!164 = !DILocation(line: 48, column: 24, scope: !160)
!165 = !DILocation(line: 51, column: 20, scope: !166)
!166 = distinct !DILexicalBlock(scope: !167, file: !1, line: 51, column: 3)
!167 = distinct !DILexicalBlock(scope: !160, file: !1, line: 51, column: 3)
!168 = !DILocation(line: 51, column: 15, scope: !166)
!169 = !DILocation(line: 51, column: 3, scope: !167)
!170 = !DILocation(line: 53, column: 9, scope: !171)
!171 = distinct !DILexicalBlock(scope: !166, file: !1, line: 52, column: 4)
!172 = !DILocation(line: 54, column: 12, scope: !171)
!173 = !DILocation(line: 54, column: 46, scope: !171)
!174 = !DILocation(line: 54, column: 4, scope: !171)
!175 = !DILocation(line: 51, column: 34, scope: !166)
!176 = distinct !{!176, !169, !177, !178, !179}
!177 = !DILocation(line: 55, column: 4, scope: !167)
!178 = !{!"llvm.loop.mustprogress"}
!179 = !{!"llvm.loop.unroll.disable"}
!180 = !DILocation(line: 58, column: 9, scope: !181)
!181 = distinct !DILexicalBlock(scope: !138, file: !1, line: 58, column: 6)
!182 = !DILocation(line: 58, column: 18, scope: !181)
!183 = !DILocation(line: 58, column: 6, scope: !138)
!184 = !DILocation(line: 60, column: 18, scope: !185)
!185 = distinct !DILexicalBlock(scope: !181, file: !1, line: 59, column: 3)
!186 = !DILocation(line: 61, column: 3, scope: !185)
!187 = !DILocation(line: 62, column: 11, scope: !185)
!188 = !DILocation(line: 62, column: 52, scope: !185)
!189 = !DILocation(line: 62, column: 3, scope: !185)
!190 = !DILocation(line: 63, column: 3, scope: !185)
!191 = !DILocation(line: 65, column: 10, scope: !138)
!192 = !DILocation(line: 65, column: 2, scope: !138)
!193 = !DILocation(line: 66, column: 2, scope: !138)
!194 = distinct !DISubprogram(name: "prn_grid", scope: !1, file: !1, line: 70, type: !195, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !197)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !78}
!197 = !{!198, !199, !200, !201, !202}
!198 = !DILocalVariable(name: "g", arg: 1, scope: !194, file: !1, line: 70, type: !78)
!199 = !DILocalVariable(name: "i", scope: !194, file: !1, line: 72, type: !10)
!200 = !DILocalVariable(name: "n", scope: !194, file: !1, line: 73, type: !10)
!201 = !DILocalVariable(name: "ng", scope: !194, file: !1, line: 74, type: !78)
!202 = !DILocalVariable(name: "v", scope: !194, file: !1, line: 75, type: !85)
!203 = !DILocation(line: 0, scope: !194)
!204 = !DILocation(line: 77, column: 10, scope: !194)
!205 = !DILocation(line: 77, column: 68, scope: !194)
!206 = !DILocation(line: 77, column: 2, scope: !194)
!207 = !DILocation(line: 78, column: 10, scope: !194)
!208 = !DILocation(line: 78, column: 68, scope: !194)
!209 = !DILocation(line: 78, column: 2, scope: !194)
!210 = !DILocation(line: 79, column: 10, scope: !194)
!211 = !DILocation(line: 79, column: 68, scope: !194)
!212 = !DILocation(line: 79, column: 65, scope: !194)
!213 = !DILocation(line: 79, column: 81, scope: !194)
!214 = !DILocation(line: 79, column: 97, scope: !194)
!215 = !DILocation(line: 79, column: 2, scope: !194)
!216 = !DILocation(line: 80, column: 10, scope: !194)
!217 = !DILocation(line: 80, column: 68, scope: !194)
!218 = !DILocation(line: 80, column: 2, scope: !194)
!219 = !DILocation(line: 81, column: 10, scope: !194)
!220 = !DILocation(line: 81, column: 68, scope: !194)
!221 = !DILocation(line: 81, column: 65, scope: !194)
!222 = !DILocation(line: 81, column: 76, scope: !194)
!223 = !DILocation(line: 81, column: 87, scope: !194)
!224 = !DILocation(line: 81, column: 2, scope: !194)
!225 = !DILocation(line: 82, column: 10, scope: !194)
!226 = !DILocation(line: 82, column: 68, scope: !194)
!227 = !DILocation(line: 82, column: 65, scope: !194)
!228 = !DILocation(line: 82, column: 81, scope: !194)
!229 = !DILocation(line: 82, column: 97, scope: !194)
!230 = !DILocation(line: 82, column: 2, scope: !194)
!231 = !DILocation(line: 83, column: 10, scope: !194)
!232 = !DILocation(line: 83, column: 68, scope: !194)
!233 = !DILocation(line: 83, column: 2, scope: !194)
!234 = !DILocation(line: 85, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !194, file: !1, line: 85, column: 6)
!236 = !DILocation(line: 85, column: 14, scope: !235)
!237 = !DILocation(line: 0, scope: !235)
!238 = !DILocation(line: 85, column: 6, scope: !194)
!239 = !DILocation(line: 88, column: 54, scope: !240)
!240 = distinct !DILexicalBlock(scope: !235, file: !1, line: 86, column: 3)
!241 = !DILocation(line: 88, column: 3, scope: !240)
!242 = !DILocation(line: 89, column: 3, scope: !240)
!243 = !DILocation(line: 91, column: 3, scope: !235)
!244 = !DILocation(line: 93, column: 10, scope: !194)
!245 = !DILocation(line: 93, column: 2, scope: !194)
!246 = !DILocation(line: 95, column: 6, scope: !194)
!247 = !DILocation(line: 95, column: 23, scope: !194)
!248 = !DILocation(line: 95, column: 21, scope: !194)
!249 = !DILocation(line: 97, column: 16, scope: !250)
!250 = distinct !DILexicalBlock(scope: !251, file: !1, line: 97, column: 2)
!251 = distinct !DILexicalBlock(scope: !194, file: !1, line: 97, column: 2)
!252 = !DILocation(line: 97, column: 2, scope: !251)
!253 = !DILocation(line: 99, column: 7, scope: !254)
!254 = distinct !DILexicalBlock(scope: !255, file: !1, line: 99, column: 7)
!255 = distinct !DILexicalBlock(scope: !250, file: !1, line: 98, column: 3)
!256 = !DILocation(line: 99, column: 31, scope: !254)
!257 = !DILocation(line: 99, column: 7, scope: !255)
!258 = !DILocation(line: 100, column: 12, scope: !254)
!259 = !DILocation(line: 100, column: 4, scope: !254)
!260 = !DILocation(line: 103, column: 8, scope: !261)
!261 = distinct !DILexicalBlock(scope: !254, file: !1, line: 102, column: 4)
!262 = !DILocation(line: 104, column: 4, scope: !261)
!263 = !DILocation(line: 97, column: 22, scope: !250)
!264 = distinct !{!264, !252, !265, !178, !179}
!265 = !DILocation(line: 106, column: 3, scope: !251)
!266 = !DILocation(line: 109, column: 10, scope: !194)
!267 = !DILocation(line: 109, column: 2, scope: !194)
!268 = !DILocation(line: 110, column: 2, scope: !194)
!269 = !DISubprogram(name: "lookup_emptycells", scope: !6, file: !6, line: 873, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !272)
!270 = !DISubroutineType(types: !271)
!271 = !{!10, !10, !78}
!272 = !{}
!273 = !DISubprogram(name: "lookup_hashtable", scope: !6, file: !6, line: 872, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !272)
!274 = !DISubroutineType(types: !275)
!275 = !{!85, !10, !78}
!276 = distinct !DISubprogram(name: "prn_ray", scope: !1, file: !1, line: 114, type: !277, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !317)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", file: !6, line: 625, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ray", file: !6, line: 611, size: 7104, elements: !282)
!282 = !{!283, !285, !286, !287, !288, !289, !290, !307, !308, !309, !313, !316}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !281, file: !6, line: 613, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !6, line: 301, baseType: !11)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !281, file: !6, line: 614, baseType: !10, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !281, file: !6, line: 614, baseType: !10, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !281, file: !6, line: 615, baseType: !68, size: 192, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !281, file: !6, line: 616, baseType: !68, size: 192, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !281, file: !6, line: 617, baseType: !10, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !281, file: !6, line: 618, baseType: !291, size: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAYINFO", file: !6, line: 603, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rayinfo", file: !6, line: 582, size: 1216, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "grid", scope: !293, file: !6, line: 584, baseType: !78, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !293, file: !6, line: 585, baseType: !28, size: 192, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "entry_plane", scope: !293, file: !6, line: 587, baseType: !10, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "t_in", scope: !293, file: !6, line: 589, baseType: !29, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "exit_plane", scope: !293, file: !6, line: 591, baseType: !10, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "t_out", scope: !293, file: !6, line: 593, baseType: !29, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !293, file: !6, line: 595, baseType: !28, size: 192, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "index3D", scope: !293, file: !6, line: 596, baseType: !106, size: 192, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "index1D", scope: !293, file: !6, line: 597, baseType: !10, size: 64, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc1D", scope: !293, file: !6, line: 600, baseType: !106, size: 192, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !6, line: 601, baseType: !306, size: 64, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ri_indx", scope: !281, file: !6, line: 619, baseType: !10, size: 64, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc3D", scope: !281, file: !6, line: 620, baseType: !106, size: 192, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rinfo", scope: !281, file: !6, line: 621, baseType: !310, size: 6080, offset: 960)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 6080, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 5)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !281, file: !6, line: 622, baseType: !314, size: 32, offset: 7040)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "R32", file: !6, line: 307, baseType: !315)
!315 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !281, file: !6, line: 623, baseType: !314, size: 32, offset: 7072)
!317 = !{!318, !319, !320}
!318 = !DILocalVariable(name: "r", arg: 1, scope: !276, file: !1, line: 114, type: !279)
!319 = !DILocalVariable(name: "ri", scope: !276, file: !1, line: 116, type: !291)
!320 = !DILocalVariable(name: "g", scope: !276, file: !1, line: 117, type: !78)
!321 = !DILocation(line: 0, scope: !276)
!322 = !DILocation(line: 119, column: 10, scope: !276)
!323 = !DILocation(line: 119, column: 77, scope: !276)
!324 = !DILocation(line: 119, column: 2, scope: !276)
!325 = !DILocation(line: 120, column: 10, scope: !276)
!326 = !DILocation(line: 120, column: 77, scope: !276)
!327 = !DILocation(line: 120, column: 74, scope: !276)
!328 = !DILocation(line: 120, column: 83, scope: !276)
!329 = !DILocation(line: 120, column: 92, scope: !276)
!330 = !DILocation(line: 120, column: 2, scope: !276)
!331 = !DILocation(line: 121, column: 10, scope: !276)
!332 = !DILocation(line: 121, column: 77, scope: !276)
!333 = !DILocation(line: 121, column: 74, scope: !276)
!334 = !DILocation(line: 121, column: 83, scope: !276)
!335 = !DILocation(line: 121, column: 92, scope: !276)
!336 = !DILocation(line: 121, column: 2, scope: !276)
!337 = !DILocation(line: 122, column: 10, scope: !276)
!338 = !DILocation(line: 122, column: 77, scope: !276)
!339 = !DILocation(line: 122, column: 74, scope: !276)
!340 = !DILocation(line: 122, column: 91, scope: !276)
!341 = !DILocation(line: 122, column: 108, scope: !276)
!342 = !DILocation(line: 122, column: 2, scope: !276)
!343 = !DILocation(line: 123, column: 10, scope: !276)
!344 = !DILocation(line: 123, column: 77, scope: !276)
!345 = !DILocation(line: 123, column: 2, scope: !276)
!346 = !DILocation(line: 124, column: 10, scope: !276)
!347 = !DILocation(line: 124, column: 2, scope: !276)
!348 = !DILocation(line: 126, column: 10, scope: !276)
!349 = !DILocation(line: 127, column: 11, scope: !276)
!350 = !DILocation(line: 129, column: 10, scope: !276)
!351 = !DILocation(line: 129, column: 77, scope: !276)
!352 = !DILocation(line: 129, column: 2, scope: !276)
!353 = !DILocation(line: 130, column: 10, scope: !276)
!354 = !DILocation(line: 130, column: 78, scope: !276)
!355 = !DILocation(line: 130, column: 74, scope: !276)
!356 = !DILocation(line: 130, column: 84, scope: !276)
!357 = !DILocation(line: 130, column: 94, scope: !276)
!358 = !DILocation(line: 130, column: 2, scope: !276)
!359 = !DILocation(line: 131, column: 10, scope: !276)
!360 = !DILocation(line: 131, column: 78, scope: !276)
!361 = !DILocation(line: 131, column: 2, scope: !276)
!362 = !DILocation(line: 132, column: 10, scope: !276)
!363 = !DILocation(line: 132, column: 78, scope: !276)
!364 = !DILocation(line: 132, column: 2, scope: !276)
!365 = !DILocation(line: 133, column: 10, scope: !276)
!366 = !DILocation(line: 133, column: 78, scope: !276)
!367 = !DILocation(line: 133, column: 2, scope: !276)
!368 = !DILocation(line: 134, column: 10, scope: !276)
!369 = !DILocation(line: 134, column: 78, scope: !276)
!370 = !DILocation(line: 134, column: 2, scope: !276)
!371 = !DILocation(line: 135, column: 10, scope: !276)
!372 = !DILocation(line: 135, column: 78, scope: !276)
!373 = !DILocation(line: 135, column: 74, scope: !276)
!374 = !DILocation(line: 135, column: 88, scope: !276)
!375 = !DILocation(line: 135, column: 102, scope: !276)
!376 = !DILocation(line: 135, column: 2, scope: !276)
!377 = !DILocation(line: 136, column: 10, scope: !276)
!378 = !DILocation(line: 136, column: 78, scope: !276)
!379 = !DILocation(line: 136, column: 74, scope: !276)
!380 = !DILocation(line: 136, column: 90, scope: !276)
!381 = !DILocation(line: 136, column: 106, scope: !276)
!382 = !DILocation(line: 136, column: 2, scope: !276)
!383 = !DILocation(line: 137, column: 10, scope: !276)
!384 = !DILocation(line: 137, column: 78, scope: !276)
!385 = !DILocation(line: 137, column: 2, scope: !276)
!386 = !DILocation(line: 138, column: 10, scope: !276)
