; ModuleID = 'husetup.c'
source_filename = "husetup.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gmem = type { i64, i64, i64, ptr, ptr, ptr, [4096 x [256 x ptr]], %struct.anon, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, [4096 x %union.pthread_mutex_t], i64, [4096 x i64] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.irecord = type { double, ptr, double, double, double }
%struct.ray = type { i64, i64, i64, [3 x double], [3 x double], i64, ptr, i64, [3 x i64], [5 x %struct.rayinfo], float, float }
%struct.rayinfo = type { ptr, [3 x double], i64, double, i64, double, [3 x double], [3 x i64], i64, [3 x i64], ptr }
%struct.voxel = type { i64, i64, ptr, ptr, i8, [7 x i8] }
%struct.element = type { i64, ptr, ptr, %struct.bbox }
%struct.bbox = type { [3 x double], [3 x double] }
%struct.object = type { i64, [32 x i8], %struct.bbox, ptr, i64, ptr, ptr, ptr }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "husetup.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "60a02213b2e2b16886f08d2269b51a6c")
!2 = !{!3, !78}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT", file: !6, line: 481, baseType: !7)
!6 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "element", file: !6, line: 474, size: 576, elements: !8)
!8 = !{!9, !12, !76, !77}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !7, file: !6, line: 476, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !6, line: 297, baseType: !11)
!11 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !7, file: !6, line: 477, baseType: !13, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !6, line: 488, size: 1024, elements: !15)
!15 = !{!16, !17, !23, !34, !35, !36, !61, !75}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !14, file: !6, line: 490, baseType: !10, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !6, line: 491, baseType: !18, size: 256, offset: 64)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, elements: !21)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !6, line: 287, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !{!22}
!22 = !DISubrange(count: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !14, file: !6, line: 492, baseType: !24, size: 384, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", file: !6, line: 418, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbox", file: !6, line: 413, size: 384, elements: !26)
!26 = !{!27, !33}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "dnear", scope: !25, file: !6, line: 415, baseType: !28, size: 192)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 192, elements: !31)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "REAL", file: !6, line: 310, baseType: !30)
!30 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!31 = !{!32}
!32 = !DISubrange(count: 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dfar", scope: !25, file: !6, line: 416, baseType: !28, size: 192, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !14, file: !6, line: 493, baseType: !4, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !14, file: !6, line: 494, baseType: !10, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !14, file: !6, line: 495, baseType: !37, size: 64, offset: 832)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROCS", file: !6, line: 340, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pprocs", file: !6, line: 327, size: 640, elements: !40)
!40 = !{!41, !46, !50, !51, !52, !53, !57, !58, !59, !60}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !6, line: 329, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, null}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !39, file: !6, line: 330, baseType: !47, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, null}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !39, file: !6, line: 331, baseType: !47, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "binread", scope: !39, file: !6, line: 332, baseType: !47, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !39, file: !6, line: 333, baseType: !47, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "intersect", scope: !39, file: !6, line: 334, baseType: !54, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!10, null}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pe_intersect", scope: !39, file: !6, line: 335, baseType: !54, size: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !39, file: !6, line: 336, baseType: !47, size: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "normalize", scope: !39, file: !6, line: 337, baseType: !47, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !39, file: !6, line: 338, baseType: !47, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "surf", scope: !14, file: !6, line: 496, baseType: !62, size: 64, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "SURF", file: !6, line: 357, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "surf", file: !6, line: 347, size: 704, elements: !65)
!65 = !{!66, !69, !70, !71, !72, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fcolor", scope: !64, file: !6, line: 349, baseType: !67, size: 192)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOR", file: !6, line: 319, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC3", file: !6, line: 314, baseType: !28)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bcolor", scope: !64, file: !6, line: 350, baseType: !67, size: 192, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "kdiff", scope: !64, file: !6, line: 351, baseType: !29, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "kspec", scope: !64, file: !6, line: 352, baseType: !29, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ktran", scope: !64, file: !6, line: 353, baseType: !29, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "refrindex", scope: !64, file: !6, line: 354, baseType: !29, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "kspecn", scope: !64, file: !6, line: 355, baseType: !29, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !6, line: 497, baseType: !13, size: 64, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !7, file: !6, line: 478, baseType: !45, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !7, file: !6, line: 479, baseType: !24, size: 384, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !{i32 7, !"Dwarf Version", i32 5}
!80 = !{i32 2, !"Debug Info Version", i32 3}
!81 = !{i32 1, !"wchar_size", i32 4}
!82 = !{i32 7, !"PIC Level", i32 2}
!83 = !{i32 7, !"PIE Level", i32 2}
!84 = !{i32 7, !"uwtable", i32 2}
!85 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!86 = distinct !DISubprogram(name: "Huniform_defaults", scope: !1, file: !1, line: 48, type: !87, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !89)
!87 = !DISubroutineType(types: !88)
!88 = !{null}
!89 = !{}
!90 = !DILocation(line: 50, column: 22, scope: !86)
!91 = !DILocation(line: 51, column: 18, scope: !86)
!92 = !DILocation(line: 52, column: 20, scope: !86)
!93 = !DILocation(line: 53, column: 22, scope: !86)
!94 = !DILocation(line: 54, column: 15, scope: !86)
!95 = !DILocation(line: 55, column: 2, scope: !86)
!96 = distinct !DISubprogram(name: "BuildHierarchy_Uniform", scope: !1, file: !1, line: 71, type: !87, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !97)
!97 = !{!98, !99, !152, !153, !154}
!98 = !DILocalVariable(name: "num_pe", scope: !96, file: !1, line: 73, type: !10)
!99 = !DILocalVariable(name: "g", scope: !96, file: !1, line: 74, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRID", file: !6, line: 572, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "grid", file: !6, line: 539, size: 1152, elements: !103)
!103 = !{!104, !105, !121, !125, !126, !127, !129, !130, !131, !132, !133, !150}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !102, file: !6, line: 541, baseType: !10, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !102, file: !6, line: 542, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOXEL", file: !6, line: 405, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "voxel", file: !6, line: 394, size: 320, elements: !110)
!110 = !{!111, !112, !113, !115, !116, !117}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !6, line: 396, baseType: !10, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !109, file: !6, line: 397, baseType: !10, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !6, line: 398, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cell", scope: !109, file: !6, line: 399, baseType: !45, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "celltype", scope: !109, file: !6, line: 400, baseType: !19, size: 8, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !109, file: !6, line: 403, baseType: !118, size: 56, offset: 264)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 56, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 7)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "emptycells", scope: !102, file: !6, line: 548, baseType: !122, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !6, line: 298, baseType: !124)
!124 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pepa", scope: !102, file: !6, line: 555, baseType: !3, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "num_prims", scope: !102, file: !6, line: 556, baseType: !10, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc", scope: !102, file: !6, line: 558, baseType: !128, size: 192, offset: 320)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !31)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !102, file: !6, line: 562, baseType: !10, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !102, file: !6, line: 563, baseType: !28, size: 192, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cellsize", scope: !102, file: !6, line: 564, baseType: !28, size: 192, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv_level", scope: !102, file: !6, line: 566, baseType: !10, size: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "bintree", scope: !102, file: !6, line: 569, baseType: !134, size: 64, offset: 1024)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "BTNODE", file: !6, line: 535, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btnode", file: !6, line: 522, size: 960, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !136, file: !6, line: 524, baseType: !3, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !136, file: !6, line: 525, baseType: !28, size: 192, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nprims", scope: !136, file: !6, line: 527, baseType: !10, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !136, file: !6, line: 528, baseType: !128, size: 192, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !136, file: !6, line: 529, baseType: !128, size: 192, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !136, file: !6, line: 531, baseType: !10, size: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "totalPrimsAllocated", scope: !136, file: !6, line: 532, baseType: !10, size: 64, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "btn", scope: !136, file: !6, line: 533, baseType: !146, size: 128, offset: 832)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, elements: !148)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!148 = !{!149}
!149 = !DISubrange(count: 2)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !6, line: 570, baseType: !151, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!152 = !DILocalVariable(name: "ng", scope: !96, file: !1, line: 75, type: !100)
!153 = !DILocalVariable(name: "v", scope: !96, file: !1, line: 76, type: !107)
!154 = !DILocalVariable(name: "pepa", scope: !96, file: !1, line: 77, type: !3)
!155 = !DILocation(line: 73, column: 2, scope: !96)
!156 = !DILocation(line: 79, column: 2, scope: !96)
!157 = !DILocation(line: 0, scope: !96)
!158 = !DILocation(line: 82, column: 9, scope: !96)
!159 = !DILocation(line: 84, column: 28, scope: !96)
!160 = !DILocation(line: 84, column: 6, scope: !96)
!161 = !DILocation(line: 86, column: 50, scope: !96)
!162 = !DILocation(line: 86, column: 25, scope: !96)
!163 = !DILocation(line: 86, column: 2, scope: !96)
!164 = !DILocation(line: 86, column: 6, scope: !96)
!165 = !DILocation(line: 86, column: 23, scope: !96)
!166 = !DILocation(line: 89, column: 25, scope: !96)
!167 = !DILocation(line: 89, column: 7, scope: !96)
!168 = !DILocation(line: 91, column: 10, scope: !96)
!169 = !DILocation(line: 91, column: 2, scope: !96)
!170 = !DILocation(line: 92, column: 2, scope: !96)
!171 = !DISubprogram(name: "init_masks", scope: !6, file: !6, line: 813, type: !87, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!172 = !DISubprogram(name: "MakeElementArray", scope: !6, file: !6, line: 848, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!173 = !DISubroutineType(types: !174)
!174 = !{!3, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!176 = !DISubprogram(name: "init_world_voxel", scope: !6, file: !6, line: 815, type: !177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!177 = !DISubroutineType(types: !178)
!178 = !{!107, !3, !10}
!179 = !DISubprogram(name: "init_world_grid", scope: !6, file: !6, line: 814, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!180 = !DISubroutineType(types: !181)
!181 = !{!100, !107, !3, !10}
!182 = !DISubprogram(name: "create_grid", scope: !6, file: !6, line: 825, type: !183, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!183 = !DISubroutineType(types: !184)
!184 = !{!100, !107, !100, !10}
!185 = distinct !DISubprogram(name: "IntersectHuniformPrimlist", scope: !1, file: !1, line: 113, type: !186, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !235)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !175, !188, !107, !197, !10}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRECORD", file: !6, line: 514, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "irecord", file: !6, line: 506, size: 320, elements: !191)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !190, file: !6, line: 508, baseType: !29, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !190, file: !6, line: 509, baseType: !4, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "b1", scope: !190, file: !6, line: 510, baseType: !29, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "b2", scope: !190, file: !6, line: 511, baseType: !29, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b3", scope: !190, file: !6, line: 512, baseType: !29, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", file: !6, line: 625, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ray", file: !6, line: 611, size: 7104, elements: !200)
!200 = !{!201, !203, !204, !205, !206, !207, !208, !225, !226, !227, !231, !234}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !199, file: !6, line: 613, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !6, line: 301, baseType: !11)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !199, file: !6, line: 614, baseType: !10, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !199, file: !6, line: 614, baseType: !10, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !199, file: !6, line: 615, baseType: !68, size: 192, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !199, file: !6, line: 616, baseType: !68, size: 192, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !199, file: !6, line: 617, baseType: !10, size: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !199, file: !6, line: 618, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAYINFO", file: !6, line: 603, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rayinfo", file: !6, line: 582, size: 1216, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "grid", scope: !211, file: !6, line: 584, baseType: !100, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !211, file: !6, line: 585, baseType: !28, size: 192, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "entry_plane", scope: !211, file: !6, line: 587, baseType: !10, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "t_in", scope: !211, file: !6, line: 589, baseType: !29, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "exit_plane", scope: !211, file: !6, line: 591, baseType: !10, size: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "t_out", scope: !211, file: !6, line: 593, baseType: !29, size: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !211, file: !6, line: 595, baseType: !28, size: 192, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "index3D", scope: !211, file: !6, line: 596, baseType: !128, size: 192, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "index1D", scope: !211, file: !6, line: 597, baseType: !10, size: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc1D", scope: !211, file: !6, line: 600, baseType: !128, size: 192, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !6, line: 601, baseType: !224, size: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ri_indx", scope: !199, file: !6, line: 619, baseType: !10, size: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc3D", scope: !199, file: !6, line: 620, baseType: !128, size: 192, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rinfo", scope: !199, file: !6, line: 621, baseType: !228, size: 6080, offset: 960)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 6080, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 5)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !199, file: !6, line: 622, baseType: !232, size: 32, offset: 7040)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "R32", file: !6, line: 307, baseType: !233)
!233 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !199, file: !6, line: 623, baseType: !232, size: 32, offset: 7072)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !245, !246, !248, !249, !250}
!236 = !DILocalVariable(name: "intersectPrim", arg: 1, scope: !185, file: !1, line: 113, type: !175)
!237 = !DILocalVariable(name: "hit", arg: 2, scope: !185, file: !1, line: 113, type: !188)
!238 = !DILocalVariable(name: "v", arg: 3, scope: !185, file: !1, line: 113, type: !107)
!239 = !DILocalVariable(name: "r", arg: 4, scope: !185, file: !1, line: 113, type: !197)
!240 = !DILocalVariable(name: "pid", arg: 5, scope: !185, file: !1, line: 113, type: !10)
!241 = !DILocalVariable(name: "pptr", scope: !185, file: !1, line: 115, type: !3)
!242 = !DILocalVariable(name: "peParent", scope: !185, file: !1, line: 116, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", file: !6, line: 499, baseType: !14)
!245 = !DILocalVariable(name: "pe", scope: !185, file: !1, line: 117, type: !4)
!246 = !DILocalVariable(name: "newhit", scope: !185, file: !1, line: 118, type: !247)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 640, elements: !148)
!248 = !DILocalVariable(name: "hitcode", scope: !185, file: !1, line: 119, type: !10)
!249 = !DILocalVariable(name: "i", scope: !185, file: !1, line: 119, type: !10)
!250 = !DILocalVariable(name: "t_out", scope: !185, file: !1, line: 120, type: !29)
!251 = !DILocation(line: 0, scope: !185)
!252 = !DILocation(line: 118, column: 2, scope: !185)
!253 = !DILocation(line: 118, column: 10, scope: !185)
!254 = !DILocation(line: 122, column: 13, scope: !185)
!255 = !DILocation(line: 122, column: 17, scope: !185)
!256 = !DILocation(line: 123, column: 11, scope: !185)
!257 = !DILocation(line: 124, column: 23, scope: !185)
!258 = !DILocation(line: 126, column: 21, scope: !259)
!259 = distinct !DILexicalBlock(scope: !260, file: !1, line: 126, column: 2)
!260 = distinct !DILexicalBlock(scope: !185, file: !1, line: 126, column: 2)
!261 = !DILocation(line: 126, column: 16, scope: !259)
!262 = !DILocation(line: 126, column: 2, scope: !260)
!263 = !DILocation(line: 128, column: 9, scope: !264)
!264 = distinct !DILexicalBlock(scope: !259, file: !1, line: 127, column: 3)
!265 = !DILocation(line: 129, column: 18, scope: !264)
!266 = !DILocation(line: 130, column: 26, scope: !264)
!267 = !DILocation(line: 130, column: 33, scope: !264)
!268 = !DILocation(line: 130, column: 14, scope: !264)
!269 = !DILocation(line: 132, column: 7, scope: !270)
!270 = distinct !DILexicalBlock(scope: !264, file: !1, line: 132, column: 7)
!271 = !DILocation(line: 132, column: 7, scope: !264)
!272 = !DILocation(line: 133, column: 18, scope: !273)
!273 = distinct !DILexicalBlock(scope: !270, file: !1, line: 133, column: 8)
!274 = !DILocation(line: 133, column: 29, scope: !273)
!275 = !DILocation(line: 133, column: 20, scope: !273)
!276 = !DILocation(line: 133, column: 31, scope: !273)
!277 = !DILocation(line: 134, column: 14, scope: !273)
!278 = !DILocation(line: 134, column: 5, scope: !273)
!279 = !DILocation(line: 126, column: 35, scope: !259)
!280 = distinct !{!280, !262, !281, !282, !283}
!281 = !DILocation(line: 135, column: 3, scope: !260)
!282 = !{!"llvm.loop.mustprogress"}
!283 = !{!"llvm.loop.unroll.disable"}
!284 = !DILocation(line: 137, column: 13, scope: !285)
!285 = distinct !DILexicalBlock(scope: !185, file: !1, line: 137, column: 6)
!286 = !DILocation(line: 0, scope: !285)
!287 = !DILocation(line: 141, column: 2, scope: !185)
!288 = distinct !DISubprogram(name: "HuniformShadowIntersect", scope: !1, file: !1, line: 161, type: !289, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !291)
!289 = !DISubroutineType(types: !290)
!290 = !{!29, !197, !29, !4, !10}
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
