; ModuleID = 'hutv.c'
source_filename = "hutv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.grid = type { i64, ptr, ptr, ptr, i64, [3 x i64], i64, [3 x double], [3 x double], i64, ptr, ptr }
%struct.voxel = type { i64, i64, ptr, ptr, i8, [7 x i8] }
%struct.ray = type { i64, i64, i64, [3 x double], [3 x double], i64, ptr, i64, [3 x i64], [5 x %struct.rayinfo], float, float }
%struct.rayinfo = type { ptr, [3 x double], i64, double, i64, double, [3 x double], [3 x i64], i64, [3 x i64], ptr }

@eps_t = dso_local local_unnamed_addr global double 1.000000e-10, align 8, !dbg !0
@stderr = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [18 x i8] c"hashtable error \0A\00", align 1
@.str.1 = private unnamed_addr constant [42 x i8] c"push_down_grid: Ray origin not in voxel \0A\00", align 1

; Function Attrs: mustprogress nofree noinline norecurse nosync nounwind readnone willreturn uwtable
define dso_local void @prn_tv_stats() local_unnamed_addr #0 !dbg !141 {
entry:
  ret void, !dbg !145
}

; Function Attrs: mustprogress nofree noinline norecurse nosync nounwind readnone willreturn uwtable
define dso_local i64 @send_ray(ptr nocapture readnone %r, ptr nocapture readnone %v) local_unnamed_addr #0 !dbg !146 {
entry:
  call void @llvm.dbg.value(metadata ptr undef, metadata !188, metadata !DIExpression()), !dbg !190

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "eps_t", scope: !2, file: !3, line: 37, type: !59, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !133, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "hutv.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "217ce87ce8845e9ee8a23301865b3d65")
!4 = !{!5, !6, !9, !14, !60}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !7, line: 298, baseType: !8)
!7 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!8 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRID", file: !7, line: 572, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "grid", file: !7, line: 539, size: 1152, elements: !12)
!12 = !{!13, !16, !35, !37, !107, !108, !110, !111, !112, !113, !114, !131}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !11, file: !7, line: 541, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !7, line: 297, baseType: !15)
!15 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !11, file: !7, line: 542, baseType: !17, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOXEL", file: !7, line: 405, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "voxel", file: !7, line: 394, size: 320, elements: !21)
!21 = !{!22, !23, !24, !26, !30, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !20, file: !7, line: 396, baseType: !14, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !20, file: !7, line: 397, baseType: !14, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !7, line: 398, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cell", scope: !20, file: !7, line: 399, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !7, line: 287, baseType: !29)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "celltype", scope: !20, file: !7, line: 400, baseType: !28, size: 8, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !20, file: !7, line: 403, baseType: !32, size: 56, offset: 264)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 56, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 7)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "emptycells", scope: !11, file: !7, line: 548, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "pepa", scope: !11, file: !7, line: 555, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT", file: !7, line: 481, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "element", file: !7, line: 474, size: 576, elements: !42)
!42 = !{!43, !44, !105, !106}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !41, file: !7, line: 476, baseType: !14, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !41, file: !7, line: 477, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !7, line: 488, size: 1024, elements: !47)
!47 = !{!48, !49, !53, !64, !65, !66, !90, !104}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !46, file: !7, line: 490, baseType: !14, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !46, file: !7, line: 491, baseType: !50, size: 256, offset: 64)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !46, file: !7, line: 492, baseType: !54, size: 384, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", file: !7, line: 418, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbox", file: !7, line: 413, size: 384, elements: !56)
!56 = !{!57, !63}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "dnear", scope: !55, file: !7, line: 415, baseType: !58, size: 192)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 192, elements: !61)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "REAL", file: !7, line: 310, baseType: !60)
!60 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!61 = !{!62}
!62 = !DISubrange(count: 3)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "dfar", scope: !55, file: !7, line: 416, baseType: !58, size: 192, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !46, file: !7, line: 493, baseType: !39, size: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !46, file: !7, line: 494, baseType: !14, size: 64, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !46, file: !7, line: 495, baseType: !67, size: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROCS", file: !7, line: 340, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pprocs", file: !7, line: 327, size: 640, elements: !70)
!70 = !{!71, !75, !79, !80, !81, !82, !86, !87, !88, !89}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !7, line: 329, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!27, null}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !69, file: !7, line: 330, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, null}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !69, file: !7, line: 331, baseType: !76, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "binread", scope: !69, file: !7, line: 332, baseType: !76, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !69, file: !7, line: 333, baseType: !76, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "intersect", scope: !69, file: !7, line: 334, baseType: !83, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!14, null}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pe_intersect", scope: !69, file: !7, line: 335, baseType: !83, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !69, file: !7, line: 336, baseType: !76, size: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "normalize", scope: !69, file: !7, line: 337, baseType: !76, size: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !69, file: !7, line: 338, baseType: !76, size: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "surf", scope: !46, file: !7, line: 496, baseType: !91, size: 64, offset: 896)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "SURF", file: !7, line: 357, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "surf", file: !7, line: 347, size: 704, elements: !94)
!94 = !{!95, !98, !99, !100, !101, !102, !103}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fcolor", scope: !93, file: !7, line: 349, baseType: !96, size: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOR", file: !7, line: 319, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC3", file: !7, line: 314, baseType: !58)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "bcolor", scope: !93, file: !7, line: 350, baseType: !96, size: 192, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "kdiff", scope: !93, file: !7, line: 351, baseType: !59, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "kspec", scope: !93, file: !7, line: 352, baseType: !59, size: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ktran", scope: !93, file: !7, line: 353, baseType: !59, size: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "refrindex", scope: !93, file: !7, line: 354, baseType: !59, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "kspecn", scope: !93, file: !7, line: 355, baseType: !59, size: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !46, file: !7, line: 497, baseType: !45, size: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !7, line: 478, baseType: !27, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !41, file: !7, line: 479, baseType: !54, size: 384, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "num_prims", scope: !11, file: !7, line: 556, baseType: !14, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc", scope: !11, file: !7, line: 558, baseType: !109, size: 192, offset: 320)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, elements: !61)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !11, file: !7, line: 562, baseType: !14, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !11, file: !7, line: 563, baseType: !58, size: 192, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cellsize", scope: !11, file: !7, line: 564, baseType: !58, size: 192, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv_level", scope: !11, file: !7, line: 566, baseType: !14, size: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "bintree", scope: !11, file: !7, line: 569, baseType: !115, size: 64, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "BTNODE", file: !7, line: 535, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btnode", file: !7, line: 522, size: 960, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !117, file: !7, line: 524, baseType: !38, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !117, file: !7, line: 525, baseType: !58, size: 192, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nprims", scope: !117, file: !7, line: 527, baseType: !14, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !117, file: !7, line: 528, baseType: !109, size: 192, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !117, file: !7, line: 529, baseType: !109, size: 192, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !117, file: !7, line: 531, baseType: !14, size: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "totalPrimsAllocated", scope: !117, file: !7, line: 532, baseType: !14, size: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "btn", scope: !117, file: !7, line: 533, baseType: !127, size: 128, offset: 832)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 128, elements: !129)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!129 = !{!130}
!130 = !DISubrange(count: 2)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !7, line: 570, baseType: !132, size: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!133 = !{!0}
!134 = !{i32 7, !"Dwarf Version", i32 5}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = !{i32 1, !"wchar_size", i32 4}
!137 = !{i32 7, !"PIC Level", i32 2}
!138 = !{i32 7, !"PIE Level", i32 2}
!139 = !{i32 7, !"uwtable", i32 2}
!140 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!141 = distinct !DISubprogram(name: "prn_tv_stats", scope: !3, file: !3, line: 54, type: !142, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{null}
!144 = !{}
!145 = !DILocation(line: 56, column: 2, scope: !141)
!146 = distinct !DISubprogram(name: "send_ray", scope: !3, file: !3, line: 76, type: !147, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !187)
!147 = !DISubroutineType(types: !148)
!148 = !{!14, !149, !18}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", file: !7, line: 625, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ray", file: !7, line: 611, size: 7104, elements: !152)
!152 = !{!153, !155, !156, !157, !158, !159, !160, !177, !178, !179, !183, !186}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !7, line: 613, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !7, line: 301, baseType: !15)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !151, file: !7, line: 614, baseType: !14, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !151, file: !7, line: 614, baseType: !14, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !151, file: !7, line: 615, baseType: !97, size: 192, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !151, file: !7, line: 616, baseType: !97, size: 192, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !151, file: !7, line: 617, baseType: !14, size: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !151, file: !7, line: 618, baseType: !161, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAYINFO", file: !7, line: 603, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rayinfo", file: !7, line: 582, size: 1216, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "grid", scope: !163, file: !7, line: 584, baseType: !9, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !163, file: !7, line: 585, baseType: !58, size: 192, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "entry_plane", scope: !163, file: !7, line: 587, baseType: !14, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "t_in", scope: !163, file: !7, line: 589, baseType: !59, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "exit_plane", scope: !163, file: !7, line: 591, baseType: !14, size: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "t_out", scope: !163, file: !7, line: 593, baseType: !59, size: 64, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !163, file: !7, line: 595, baseType: !58, size: 192, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "index3D", scope: !163, file: !7, line: 596, baseType: !109, size: 192, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "index1D", scope: !163, file: !7, line: 597, baseType: !14, size: 64, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc1D", scope: !163, file: !7, line: 600, baseType: !109, size: 192, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !7, line: 601, baseType: !176, size: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ri_indx", scope: !151, file: !7, line: 619, baseType: !14, size: 64, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc3D", scope: !151, file: !7, line: 620, baseType: !109, size: 192, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "rinfo", scope: !151, file: !7, line: 621, baseType: !180, size: 6080, offset: 960)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 6080, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 5)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !151, file: !7, line: 622, baseType: !184, size: 32, offset: 7040)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "R32", file: !7, line: 307, baseType: !185)
!185 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !151, file: !7, line: 623, baseType: !184, size: 32, offset: 7072)
!187 = !{!188, !189}
!188 = !DILocalVariable(name: "r", arg: 1, scope: !146, file: !3, line: 76, type: !149)
!189 = !DILocalVariable(name: "v", arg: 2, scope: !146, file: !3, line: 76, type: !18)
!190 = !DILocation(line: 0, scope: !146)
!191 = !DILocation(line: 78, column: 3, scope: !146)
!192 = distinct !DISubprogram(name: "lookup_hashtable", scope: !3, file: !3, line: 103, type: !193, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !195)
!193 = !DISubroutineType(types: !194)
!194 = !{!18, !14, !9}
!195 = !{!196, !197, !198, !199}
!196 = !DILocalVariable(name: "indx", arg: 1, scope: !192, file: !3, line: 103, type: !14)
!197 = !DILocalVariable(name: "g", arg: 2, scope: !192, file: !3, line: 103, type: !9)
!198 = !DILocalVariable(name: "i", scope: !192, file: !3, line: 105, type: !14)
!199 = !DILocalVariable(name: "v", scope: !192, file: !3, line: 106, type: !18)
!200 = !DILocation(line: 0, scope: !192)
!201 = !DILocation(line: 108, column: 25, scope: !192)
!202 = !DILocation(line: 108, column: 38, scope: !192)
!203 = !DILocation(line: 109, column: 9, scope: !192)
!204 = !DILocation(line: 109, column: 6, scope: !192)
!205 = !DILocation(line: 111, column: 2, scope: !192)
!206 = !DILocation(line: 111, column: 12, scope: !192)
!207 = !DILocation(line: 111, column: 15, scope: !192)
!208 = !DILocation(line: 113, column: 10, scope: !209)
!209 = distinct !DILexicalBlock(scope: !192, file: !3, line: 112, column: 3)
!210 = !DILocation(line: 114, column: 9, scope: !211)
!211 = distinct !DILexicalBlock(scope: !209, file: !3, line: 114, column: 7)
!212 = !DILocation(line: 114, column: 7, scope: !209)
!213 = distinct !{!213, !205, !214, !215, !216}
!214 = !DILocation(line: 119, column: 3, scope: !192)
!215 = !{!"llvm.loop.mustprogress"}
!216 = !{!"llvm.loop.unroll.disable"}
!217 = !DILocation(line: 116, column: 12, scope: !218)
!218 = distinct !DILexicalBlock(scope: !211, file: !3, line: 115, column: 4)
!219 = !DILocation(line: 116, column: 4, scope: !218)
!220 = !DILocation(line: 117, column: 4, scope: !218)
!221 = !DILocation(line: 121, column: 2, scope: !192)
!222 = distinct !DISubprogram(name: "lookup_emptycells", scope: !3, file: !3, line: 144, type: !223, scopeLine: 145, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{!14, !14, !9}
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233}
!226 = !DILocalVariable(name: "indx", arg: 1, scope: !222, file: !3, line: 144, type: !14)
!227 = !DILocalVariable(name: "g", arg: 2, scope: !222, file: !3, line: 144, type: !9)
!228 = !DILocalVariable(name: "i", scope: !222, file: !3, line: 146, type: !14)
!229 = !DILocalVariable(name: "w", scope: !222, file: !3, line: 146, type: !14)
!230 = !DILocalVariable(name: "r", scope: !222, file: !3, line: 146, type: !14)
!231 = !DILocalVariable(name: "num_bits", scope: !222, file: !3, line: 146, type: !14)
!232 = !DILocalVariable(name: "p", scope: !222, file: !3, line: 147, type: !6)
!233 = !DILocalVariable(name: "b", scope: !222, file: !3, line: 147, type: !6)
!234 = !DILocation(line: 0, scope: !222)
!235 = !DILocation(line: 151, column: 11, scope: !222)
!236 = !DILocation(line: 152, column: 15, scope: !222)
!237 = !DILocation(line: 152, column: 11, scope: !222)
!238 = !DILocation(line: 153, column: 9, scope: !222)
!239 = !DILocation(line: 153, column: 6, scope: !222)
!240 = !DILocation(line: 154, column: 15, scope: !222)
!241 = !DILocation(line: 154, column: 8, scope: !222)
!242 = !DILocation(line: 155, column: 8, scope: !222)
!243 = !DILocation(line: 157, column: 2, scope: !222)
