; ModuleID = 'initia.c'
source_filename = "initia.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.link = type { %struct.mol_dummy, ptr }
%struct.mol_dummy = type { [3 x double], [9 x [3 x [3 x double]]] }
%struct.box_dummy = type { ptr, %union.pthread_mutex_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

@.str = private unnamed_addr constant [10 x i8] c"random.in\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@stderr = external local_unnamed_addr global ptr, align 8
@.str.2 = private unnamed_addr constant [33 x i8] c"Error in opening file random.in\0A\00", align 1
@OMAS = external local_unnamed_addr global double, align 8
@HMAS = external local_unnamed_addr global double, align 8
@NMOL = external local_unnamed_addr global i64, align 8
@BOXL = external local_unnamed_addr global double, align 8
@ROH = external local_unnamed_addr global double, align 8
@ANGLE = external local_unnamed_addr global double, align 8
@.str.3 = private unnamed_addr constant [13 x i8] c"\0ANS = %.16f\0A\00", align 1
@.str.4 = private unnamed_addr constant [13 x i8] c"BOXL = %10f\0A\00", align 1
@.str.5 = private unnamed_addr constant [15 x i8] c"CUTOFF = %10f\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "initia.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/water-spatial", checksumkind: CSK_MD5, checksum: "f032a373d685c5e73fb0de0c9875f870")
!2 = !{!3, !4, !5, !23}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link", file: !7, line: 30, size: 5440, elements: !8)
!7 = !DIFile(filename: "./mddata.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/water-spatial", checksumkind: CSK_MD5, checksum: "5eef464d675810165298663b2382575d")
!8 = !{!9, !22}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "mol", scope: !6, file: !7, line: 31, baseType: !10, size: 5376)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "molecule_type", file: !7, line: 28, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mol_dummy", file: !7, line: 25, size: 5376, elements: !12)
!12 = !{!13, !18}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "VM", scope: !11, file: !7, line: 26, baseType: !14, size: 192)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "vm_type", file: !7, line: 23, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !16)
!16 = !{!17}
!17 = !DISubrange(count: 3)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "F", scope: !11, file: !7, line: 27, baseType: !19, size: 5184, offset: 192)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 5184, elements: !20)
!20 = !{!21, !17, !17}
!21 = !DISubrange(count: 9)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next_mol", scope: !6, file: !7, line: 32, baseType: !5, size: 64, offset: 5376)
!23 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!24 = !{i32 7, !"Dwarf Version", i32 5}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 4}
!27 = !{i32 7, !"PIC Level", i32 2}
!28 = !{i32 7, !"PIE Level", i32 2}
!29 = !{i32 7, !"uwtable", i32 2}
!30 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!31 = distinct !DISubprogram(name: "INITIA", scope: !1, file: !1, line: 48, type: !32, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !34)
!32 = !DISubroutineType(types: !33)
!33 = !{null}
!34 = !{!35, !97, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !121, !122, !123, !125, !126, !127, !128, !129}
!35 = !DILocalVariable(name: "random_numbers", scope: !31, file: !1, line: 56, type: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 7, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !40, line: 49, size: 1728, elements: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!41 = !{!42, !44, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !60, !62, !63, !64, !67, !69, !71, !75, !78, !80, !83, !86, !87, !88, !92, !93}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !39, file: !40, line: 51, baseType: !43, size: 32)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !39, file: !40, line: 54, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !39, file: !40, line: 55, baseType: !45, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !39, file: !40, line: 56, baseType: !45, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !39, file: !40, line: 57, baseType: !45, size: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !39, file: !40, line: 58, baseType: !45, size: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !39, file: !40, line: 59, baseType: !45, size: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !39, file: !40, line: 60, baseType: !45, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !39, file: !40, line: 61, baseType: !45, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !39, file: !40, line: 64, baseType: !45, size: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !39, file: !40, line: 65, baseType: !45, size: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !39, file: !40, line: 66, baseType: !45, size: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !39, file: !40, line: 68, baseType: !58, size: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !40, line: 36, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !39, file: !40, line: 70, baseType: !61, size: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !39, file: !40, line: 72, baseType: !43, size: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !39, file: !40, line: 73, baseType: !43, size: 32, offset: 928)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !39, file: !40, line: 74, baseType: !65, size: 64, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 152, baseType: !23)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !39, file: !40, line: 77, baseType: !68, size: 16, offset: 1024)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !39, file: !40, line: 78, baseType: !70, size: 8, offset: 1040)
!70 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !39, file: !40, line: 79, baseType: !72, size: 8, offset: 1048)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !39, file: !40, line: 81, baseType: !76, size: 64, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !40, line: 43, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !39, file: !40, line: 89, baseType: !79, size: 64, offset: 1152)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !66, line: 153, baseType: !23)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !39, file: !40, line: 91, baseType: !81, size: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !40, line: 37, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !39, file: !40, line: 92, baseType: !84, size: 64, offset: 1280)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !40, line: 38, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !39, file: !40, line: 93, baseType: !61, size: 64, offset: 1344)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !39, file: !40, line: 94, baseType: !3, size: 64, offset: 1408)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !39, file: !40, line: 95, baseType: !89, size: 64, offset: 1472)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !90, line: 46, baseType: !91)
!90 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!91 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !39, file: !40, line: 96, baseType: !43, size: 32, offset: 1536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !39, file: !40, line: 98, baseType: !94, size: 160, offset: 1568)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 20)
!97 = !DILocalVariable(name: "XMAS", scope: !31, file: !1, line: 59, type: !98)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 4)
!101 = !DILocalVariable(name: "SUX", scope: !31, file: !1, line: 60, type: !4)
!102 = !DILocalVariable(name: "SUY", scope: !31, file: !1, line: 60, type: !4)
!103 = !DILocalVariable(name: "SUZ", scope: !31, file: !1, line: 60, type: !4)
!104 = !DILocalVariable(name: "SUMX", scope: !31, file: !1, line: 60, type: !4)
!105 = !DILocalVariable(name: "SUMY", scope: !31, file: !1, line: 60, type: !4)
!106 = !DILocalVariable(name: "SUMZ", scope: !31, file: !1, line: 60, type: !4)
!107 = !DILocalVariable(name: "FAC", scope: !31, file: !1, line: 60, type: !4)
!108 = !DILocalVariable(name: "X_INDEX", scope: !31, file: !1, line: 61, type: !23)
!109 = !DILocalVariable(name: "Y_INDEX", scope: !31, file: !1, line: 61, type: !23)
!110 = !DILocalVariable(name: "Z_INDEX", scope: !31, file: !1, line: 61, type: !23)
!111 = !DILocalVariable(name: "atom", scope: !31, file: !1, line: 62, type: !23)
!112 = !DILocalVariable(name: "i", scope: !31, file: !1, line: 63, type: !23)
!113 = !DILocalVariable(name: "j", scope: !31, file: !1, line: 63, type: !23)
!114 = !DILocalVariable(name: "k", scope: !31, file: !1, line: 63, type: !23)
!115 = !DILocalVariable(name: "link_ptr", scope: !31, file: !1, line: 64, type: !5)
!116 = !DILocalVariable(name: "curr_ptr", scope: !31, file: !1, line: 64, type: !5)
!117 = !DILocalVariable(name: "last_ptr", scope: !31, file: !1, line: 64, type: !5)
!118 = !DILocalVariable(name: "mol", scope: !31, file: !1, line: 68, type: !23)
!119 = !DILocalVariable(name: "XT", scope: !31, file: !1, line: 68, type: !120)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 256, elements: !99)
!121 = !DILocalVariable(name: "YT", scope: !31, file: !1, line: 68, type: !120)
!122 = !DILocalVariable(name: "Z", scope: !31, file: !1, line: 68, type: !23)
!123 = !DILocalVariable(name: "deriv", scope: !124, file: !1, line: 85, type: !23)
!124 = distinct !DILexicalBlock(scope: !31, file: !1, line: 84, column: 5)
!125 = !DILocalVariable(name: "NS", scope: !124, file: !1, line: 87, type: !4)
!126 = !DILocalVariable(name: "XS", scope: !124, file: !1, line: 88, type: !4)
!127 = !DILocalVariable(name: "ZERO", scope: !124, file: !1, line: 89, type: !4)
!128 = !DILocalVariable(name: "WCOS", scope: !124, file: !1, line: 90, type: !4)
!129 = !DILocalVariable(name: "WSIN", scope: !124, file: !1, line: 91, type: !4)
!130 = !DILocation(line: 59, column: 5, scope: !31)
!131 = !DILocation(line: 59, column: 12, scope: !31)
!132 = !DILocation(line: 60, column: 5, scope: !31)
!133 = !DILocation(line: 0, scope: !31)
!134 = !DILocation(line: 68, column: 5, scope: !31)
!135 = !DILocation(line: 68, column: 19, scope: !31)
!136 = !DILocation(line: 68, column: 26, scope: !31)
!137 = !DILocation(line: 71, column: 22, scope: !31)
!138 = !DILocation(line: 72, column: 24, scope: !139)
!139 = distinct !DILexicalBlock(scope: !31, file: !1, line: 72, column: 9)
!140 = !DILocation(line: 72, column: 9, scope: !31)
!141 = !DILocation(line: 73, column: 17, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !1, line: 72, column: 33)
!143 = !DILocation(line: 73, column: 9, scope: !142)
!144 = !DILocation(line: 74, column: 16, scope: !142)
!145 = !DILocation(line: 74, column: 9, scope: !142)
!146 = !DILocation(line: 75, column: 9, scope: !142)
!147 = !DILocation(line: 78, column: 18, scope: !31)
!148 = !DILocation(line: 78, column: 23, scope: !31)
!149 = !DILocation(line: 78, column: 22, scope: !31)
!150 = !DILocation(line: 78, column: 13, scope: !31)
!151 = !DILocation(line: 78, column: 5, scope: !31)
