; ModuleID = 'lu.c'
source_filename = "lu.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.GlobalMemory = type { ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, %struct.anon, %union.pthread_mutex_t }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%struct.LocalCopies = type { double, double, double, double }

@__threads__ = dso_local local_unnamed_addr global i32 0, align 4, !dbg !0
@n = dso_local local_unnamed_addr global i64 128, align 8, !dbg !112
@P = dso_local local_unnamed_addr global i64 1, align 8, !dbg !114
@block_size = dso_local local_unnamed_addr global i64 16, align 8, !dbg !116
@test_result = dso_local local_unnamed_addr global i64 0, align 8, !dbg !118
@doprint = dso_local local_unnamed_addr global i64 0, align 8, !dbg !120
@dostats = dso_local local_unnamed_addr global i64 0, align 8, !dbg !122
@.str = private unnamed_addr constant [12 x i8] c"n:p:b:cstoh\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__threads__", scope: !2, file: !3, line: 59, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !111, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "lu.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/lu/non_contiguous_blocks", checksumkind: CSK_MD5, checksum: "16becf0d90fbf5eb3d66cf4e663c64d5")
!4 = !{!5, !6, !7, !8, !9, !101, !104}
!5 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalMemory", file: !3, line: 70, size: 1728, elements: !11)
!11 = !{!12, !13, !14, !15, !16, !17, !19, !20, !21, !22, !23, !100}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "t_in_fac", scope: !10, file: !3, line: 71, baseType: !7, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "t_in_solve", scope: !10, file: !3, line: 72, baseType: !7, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "t_in_mod", scope: !10, file: !3, line: 73, baseType: !7, size: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "t_in_bar", scope: !10, file: !3, line: 74, baseType: !7, size: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "completion", scope: !10, file: !3, line: 75, baseType: !7, size: 64, offset: 256)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !10, file: !3, line: 76, baseType: !18, size: 64, offset: 320)
!18 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !10, file: !3, line: 77, baseType: !18, size: 64, offset: 384)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !10, file: !3, line: 78, baseType: !18, size: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !10, file: !3, line: 79, baseType: !18, size: 64, offset: 512)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !10, file: !3, line: 80, baseType: !5, size: 64, offset: 576)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !10, file: !3, line: 81, baseType: !24, size: 768, offset: 640)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !10, file: !3, line: 81, size: 768, elements: !25)
!25 = !{!26, !59, !99}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !24, file: !3, line: 81, baseType: !27, size: 320)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !28, line: 72, baseType: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 67, size: 320, elements: !30)
!30 = !{!31, !53, !58}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !29, file: !28, line: 69, baseType: !32, size: 320)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !33, line: 22, size: 320, elements: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!34 = !{!35, !37, !39, !40, !41, !42, !44, !45}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !32, file: !33, line: 24, baseType: !36, size: 32)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !32, file: !33, line: 25, baseType: !38, size: 32, offset: 32)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !32, file: !33, line: 26, baseType: !36, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !32, file: !33, line: 28, baseType: !38, size: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !32, file: !33, line: 32, baseType: !36, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !32, file: !33, line: 34, baseType: !43, size: 16, offset: 160)
!43 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !32, file: !33, line: 35, baseType: !43, size: 16, offset: 176)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !32, file: !33, line: 36, baseType: !46, size: 128, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !47, line: 53, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !47, line: 49, size: 128, elements: !49)
!49 = !{!50, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !48, file: !47, line: 51, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !48, file: !47, line: 52, baseType: !51, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !29, file: !28, line: 70, baseType: !54, size: 320)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 320, elements: !56)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!56 = !{!57}
!57 = !DISubrange(count: 40)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !29, file: !28, line: 71, baseType: !5, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !24, file: !3, line: 81, baseType: !60, size: 384, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !28, line: 80, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 75, size: 384, elements: !62)
!62 = !{!63, !93, !97}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !61, file: !28, line: 77, baseType: !64, size: 384)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !47, line: 92, size: 384, elements: !65)
!65 = !{!66, !76, !85, !89, !90, !91, !92}
!66 = !DIDerivedType(tag: DW_TAG_member, scope: !64, file: !47, line: 94, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !64, file: !47, line: 94, size: 64, elements: !68)
!68 = !{!69, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !67, file: !47, line: 96, baseType: !70, size: 64)
!70 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !67, file: !47, line: 101, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !47, line: 97, size: 64, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !72, file: !47, line: 99, baseType: !38, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !72, file: !47, line: 100, baseType: !38, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, scope: !64, file: !47, line: 103, baseType: !77, size: 64, offset: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !64, file: !47, line: 103, size: 64, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !77, file: !47, line: 105, baseType: !70, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !77, file: !47, line: 110, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !47, line: 106, size: 64, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !81, file: !47, line: 108, baseType: !38, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !81, file: !47, line: 109, baseType: !38, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !64, file: !47, line: 112, baseType: !86, size: 64, offset: 128)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 2)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !64, file: !47, line: 113, baseType: !86, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !64, file: !47, line: 114, baseType: !38, size: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !64, file: !47, line: 115, baseType: !38, size: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !64, file: !47, line: 116, baseType: !86, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !61, file: !28, line: 78, baseType: !94, size: 384)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 384, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 48)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !61, file: !28, line: 79, baseType: !98, size: 64)
!98 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !24, file: !3, line: 81, baseType: !38, size: 32, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "idlock", scope: !10, file: !3, line: 82, baseType: !27, size: 320, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!8, !8}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocalCopies", file: !3, line: 85, size: 256, elements: !106)
!106 = !{!107, !108, !109, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "t_in_fac", scope: !105, file: !3, line: 86, baseType: !6, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "t_in_solve", scope: !105, file: !3, line: 87, baseType: !6, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "t_in_mod", scope: !105, file: !3, line: 88, baseType: !6, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "t_in_bar", scope: !105, file: !3, line: 89, baseType: !6, size: 64, offset: 192)
!111 = !{!0, !112, !114, !116, !118, !120, !122, !124, !130, !132, !134, !136, !138, !140, !142, !144}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "n", scope: !2, file: !3, line: 92, type: !5, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "P", scope: !2, file: !3, line: 93, type: !5, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "block_size", scope: !2, file: !3, line: 94, type: !5, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "test_result", scope: !2, file: !3, line: 101, type: !5, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "doprint", scope: !2, file: !3, line: 102, type: !5, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "dostats", scope: !2, file: !3, line: 103, type: !5, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "__tid__", scope: !2, file: !3, line: 58, type: !126, isLocal: false, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 16384, elements: !128)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !28, line: 27, baseType: !18)
!128 = !{!129}
!129 = !DISubrange(count: 256)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "__intern__", scope: !2, file: !3, line: 60, type: !27, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "Global", scope: !2, file: !3, line: 83, type: !9, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "nblocks", scope: !2, file: !3, line: 95, type: !5, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "num_rows", scope: !2, file: !3, line: 96, type: !5, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "num_cols", scope: !2, file: !3, line: 97, type: !5, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "a", scope: !2, file: !3, line: 98, type: !7, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "rhs", scope: !2, file: !3, line: 99, type: !7, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "proc_bytes", scope: !2, file: !3, line: 100, type: !146, isLocal: false, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!147 = !{i32 7, !"Dwarf Version", i32 5}
!148 = !{i32 2, !"Debug Info Version", i32 3}
!149 = !{i32 1, !"wchar_size", i32 4}
!150 = !{i32 7, !"PIC Level", i32 2}
!151 = !{i32 7, !"PIE Level", i32 2}
!152 = !{i32 7, !"uwtable", i32 2}
!153 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
