; ModuleID = 'malloc.c'
source_filename = "malloc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MemPool = type { %union.pthread_mutex_t, ptr, i64, i64, i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.GlobalMemory = type { %struct.anon, %union.pthread_mutex_t, %union.pthread_mutex_t, [1024 x i64] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }

@mallocP = dso_local local_unnamed_addr global i64 1, align 8, !dbg !0
@machineP = dso_local local_unnamed_addr global i64 1, align 8, !dbg !50
@mem_pool = dso_local local_unnamed_addr global ptr null, align 8, !dbg !52
@.str = private unnamed_addr constant [13 x i8] c"Malloc max: \00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"%ld* \00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"%ld \00", align 1
@Global = external local_unnamed_addr global ptr, align 8
@.str.4 = private unnamed_addr constant [35 x i8] c"*** Bad size from malloc %ld, %ld\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mallocP", scope: !2, file: !3, line: 56, type: !41, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !49, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "malloc.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/cholesky", checksumkind: CSK_MD5, checksum: "8fff5d5ce2dcd1f7fba02d35cf5351a8")
!4 = !{!5, !43, !44, !48}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemPool", file: !3, line: 50, size: 576, elements: !7)
!7 = !{!8, !42, !45, !46, !47}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "memoryLock", scope: !6, file: !3, line: 51, baseType: !9, size: 320)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !10, line: 72, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!11 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !10, line: 67, size: 320, elements: !12)
!12 = !{!13, !35, !40}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !11, file: !10, line: 69, baseType: !14, size: 320)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !15, line: 22, size: 320, elements: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!16 = !{!17, !19, !21, !22, !23, !24, !26, !27}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !14, file: !15, line: 24, baseType: !18, size: 32)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !14, file: !15, line: 25, baseType: !20, size: 32, offset: 32)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !14, file: !15, line: 26, baseType: !18, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !14, file: !15, line: 28, baseType: !20, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !14, file: !15, line: 32, baseType: !18, size: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !14, file: !15, line: 34, baseType: !25, size: 16, offset: 160)
!25 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !14, file: !15, line: 35, baseType: !25, size: 16, offset: 176)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !14, file: !15, line: 36, baseType: !28, size: 128, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !29, line: 53, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !29, line: 49, size: 128, elements: !31)
!31 = !{!32, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !30, file: !29, line: 51, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !30, file: !29, line: 52, baseType: !33, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !11, file: !10, line: 70, baseType: !36, size: 320)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 320, elements: !38)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !{!39}
!39 = !DISubrange(count: 40)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !11, file: !10, line: 71, baseType: !41, size: 64)
!41 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "freeBlock", scope: !6, file: !3, line: 52, baseType: !43, size: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tally", scope: !6, file: !3, line: 53, baseType: !41, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "touched", scope: !6, file: !3, line: 53, baseType: !41, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "maxm", scope: !6, file: !3, line: 53, baseType: !41, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!49 = !{!0, !50, !52}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "machineP", scope: !2, file: !3, line: 56, type: !41, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "mem_pool", scope: !2, file: !3, line: 54, type: !5, isLocal: false, isDefinition: true)
!54 = !{i32 7, !"Dwarf Version", i32 5}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{i32 1, !"wchar_size", i32 4}
!57 = !{i32 7, !"PIC Level", i32 2}
!58 = !{i32 7, !"PIE Level", i32 2}
!59 = !{i32 7, !"uwtable", i32 2}
!60 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!61 = distinct !DISubprogram(name: "MallocInit", scope: !3, file: !3, line: 61, type: !62, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !41}
!64 = !{!65, !66}
!65 = !DILocalVariable(name: "P", arg: 1, scope: !61, file: !3, line: 61, type: !41)
!66 = !DILocalVariable(name: "p", scope: !61, file: !3, line: 63, type: !41)
!67 = !DILocation(line: 0, scope: !61)
!68 = !DILocation(line: 65, column: 11, scope: !61)
!69 = !DILocation(line: 68, column: 23, scope: !61)
!70 = !DILocation(line: 68, column: 5, scope: !61)
!71 = !DILocation(line: 69, column: 11, scope: !61)
!72 = !DILocation(line: 72, column: 17, scope: !73)
!73 = distinct !DILexicalBlock(scope: !74, file: !3, line: 72, column: 3)
!74 = distinct !DILexicalBlock(scope: !61, file: !3, line: 72, column: 3)
!75 = !DILocation(line: 72, column: 3, scope: !74)
!76 = !DILocation(line: 73, column: 5, scope: !73)
!77 = !DILocation(line: 72, column: 28, scope: !73)
!78 = !DILocation(line: 72, column: 18, scope: !73)
!79 = distinct !{!79, !75, !80, !81, !82}
!80 = !DILocation(line: 73, column: 22, scope: !74)
!81 = !{!"llvm.loop.mustprogress"}
!82 = !{!"llvm.loop.unroll.disable"}
!83 = !DILocation(line: 74, column: 1, scope: !61)
!84 = distinct !DISubprogram(name: "InitOneFreeList", scope: !3, file: !3, line: 77, type: !62, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !85)
!85 = !{!86, !87}
!86 = !DILocalVariable(name: "p", arg: 1, scope: !84, file: !3, line: 77, type: !41)
!87 = !DILocalVariable(name: "j", scope: !84, file: !3, line: 79, type: !41)
!88 = !DILocation(line: 0, scope: !84)
!89 = !DILocation(line: 81, column: 25, scope: !90)
!90 = distinct !DILexicalBlock(scope: !84, file: !3, line: 81, column: 3)
!91 = !DILocation(line: 81, column: 4, scope: !90)
!92 = !DILocation(line: 0, scope: !93)
!93 = distinct !DILexicalBlock(scope: !84, file: !3, line: 82, column: 7)
!94 = !DILocation(line: 93, column: 3, scope: !95)
!95 = distinct !DILexicalBlock(scope: !84, file: !3, line: 93, column: 3)
!96 = !DILocation(line: 94, column: 5, scope: !97)
!97 = distinct !DILexicalBlock(scope: !95, file: !3, line: 93, column: 3)
!98 = !DILocation(line: 94, column: 17, scope: !97)
!99 = !DILocation(line: 94, column: 30, scope: !97)
!100 = !DILocation(line: 93, column: 26, scope: !97)
!101 = !DILocation(line: 93, column: 14, scope: !97)
!102 = distinct !{!102, !94, !103, !81, !82}
!103 = !DILocation(line: 94, column: 32, scope: !95)
!104 = !DILocation(line: 95, column: 42, scope: !84)
!105 = !DILocation(line: 95, column: 54, scope: !84)
!106 = !DILocation(line: 95, column: 62, scope: !84)
!107 = !DILocation(line: 95, column: 23, scope: !84)
!108 = !DILocation(line: 95, column: 35, scope: !84)
!109 = !DILocation(line: 95, column: 40, scope: !84)
!110 = !DILocation(line: 95, column: 3, scope: !84)
