; ModuleID = 'memory.c'
source_filename = "memory.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gmem = type { i64, i64, i64, ptr, ptr, ptr, [4096 x [256 x ptr]], %struct.anon, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, [4096 x %union.pthread_mutex_t], i64, [4096 x i64] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.node = type { ptr, i64, i64, i64 }
%struct.ray = type { i64, i64, i64, [3 x double], [3 x double], i64, ptr, i64, [3 x i64], [5 x %struct.rayinfo], float, float }
%struct.rayinfo = type { ptr, [3 x double], i64, double, i64, double, [3 x double], [3 x i64], i64, [3 x i64], ptr }

@.str = private unnamed_addr constant [38 x i8] c"%s: %s cannot allocate local memory.\0A\00", align 1
@ProgName = external local_unnamed_addr global ptr, align 8
@gm = external local_unnamed_addr global ptr, align 8
@begmem = dso_local local_unnamed_addr global ptr null, align 8, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "begmem", scope: !2, file: !3, line: 54, type: !9, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !163, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "memory.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "189d7c17c8bc707c8d84aea3159c2e64")
!4 = !{!5, !6, !9, !20, !23, !24}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "U32", file: !7, line: 304, baseType: !8)
!7 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!8 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "NODE", file: !7, line: 668, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 661, size: 256, elements: !12)
!12 = !{!13, !15, !17, !19}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !7, line: 663, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !11, file: !7, line: 664, baseType: !16, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !7, line: 298, baseType: !8)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !11, file: !7, line: 665, baseType: !18, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !7, line: 299, baseType: !8)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cksm", scope: !11, file: !7, line: 666, baseType: !16, size: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "U8", file: !7, line: 290, baseType: !22)
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAYINFO", file: !7, line: 603, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rayinfo", file: !7, line: 582, size: 1216, elements: !27)
!27 = !{!28, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "grid", scope: !26, file: !7, line: 584, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRID", file: !7, line: 572, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "grid", file: !7, line: 539, size: 1152, elements: !32)
!32 = !{!33, !36, !55, !56, !126, !127, !129, !130, !131, !132, !133, !150}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !31, file: !7, line: 541, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !7, line: 297, baseType: !35)
!35 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !31, file: !7, line: 542, baseType: !37, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOXEL", file: !7, line: 405, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "voxel", file: !7, line: 394, size: 320, elements: !41)
!41 = !{!42, !43, !44, !46, !50, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !7, line: 396, baseType: !34, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !40, file: !7, line: 397, baseType: !34, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !7, line: 398, baseType: !45, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cell", scope: !40, file: !7, line: 399, baseType: !47, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !7, line: 287, baseType: !49)
!49 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "celltype", scope: !40, file: !7, line: 400, baseType: !48, size: 8, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !40, file: !7, line: 403, baseType: !52, size: 56, offset: 264)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 56, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 7)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "emptycells", scope: !31, file: !7, line: 548, baseType: !23, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pepa", scope: !31, file: !7, line: 555, baseType: !57, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT", file: !7, line: 481, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "element", file: !7, line: 474, size: 576, elements: !61)
!61 = !{!62, !63, !124, !125}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !60, file: !7, line: 476, baseType: !34, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !60, file: !7, line: 477, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !7, line: 488, size: 1024, elements: !66)
!66 = !{!67, !68, !72, !83, !84, !85, !109, !123}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !65, file: !7, line: 490, baseType: !34, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !7, line: 491, baseType: !69, size: 256, offset: 64)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !65, file: !7, line: 492, baseType: !73, size: 384, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", file: !7, line: 418, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbox", file: !7, line: 413, size: 384, elements: !75)
!75 = !{!76, !82}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "dnear", scope: !74, file: !7, line: 415, baseType: !77, size: 192)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 192, elements: !80)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "REAL", file: !7, line: 310, baseType: !79)
!79 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!80 = !{!81}
!81 = !DISubrange(count: 3)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "dfar", scope: !74, file: !7, line: 416, baseType: !77, size: 192, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !65, file: !7, line: 493, baseType: !58, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !65, file: !7, line: 494, baseType: !34, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !65, file: !7, line: 495, baseType: !86, size: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROCS", file: !7, line: 340, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pprocs", file: !7, line: 327, size: 640, elements: !89)
!89 = !{!90, !94, !98, !99, !100, !101, !105, !106, !107, !108}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !7, line: 329, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!47, null}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !88, file: !7, line: 330, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, null}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !88, file: !7, line: 331, baseType: !95, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "binread", scope: !88, file: !7, line: 332, baseType: !95, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !88, file: !7, line: 333, baseType: !95, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "intersect", scope: !88, file: !7, line: 334, baseType: !102, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!34, null}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pe_intersect", scope: !88, file: !7, line: 335, baseType: !102, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !88, file: !7, line: 336, baseType: !95, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "normalize", scope: !88, file: !7, line: 337, baseType: !95, size: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !88, file: !7, line: 338, baseType: !95, size: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "surf", scope: !65, file: !7, line: 496, baseType: !110, size: 64, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "SURF", file: !7, line: 357, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "surf", file: !7, line: 347, size: 704, elements: !113)
!113 = !{!114, !117, !118, !119, !120, !121, !122}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "fcolor", scope: !112, file: !7, line: 349, baseType: !115, size: 192)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOR", file: !7, line: 319, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC3", file: !7, line: 314, baseType: !77)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "bcolor", scope: !112, file: !7, line: 350, baseType: !115, size: 192, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "kdiff", scope: !112, file: !7, line: 351, baseType: !78, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "kspec", scope: !112, file: !7, line: 352, baseType: !78, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ktran", scope: !112, file: !7, line: 353, baseType: !78, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "refrindex", scope: !112, file: !7, line: 354, baseType: !78, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "kspecn", scope: !112, file: !7, line: 355, baseType: !78, size: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !7, line: 497, baseType: !64, size: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !60, file: !7, line: 478, baseType: !47, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !60, file: !7, line: 479, baseType: !73, size: 384, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "num_prims", scope: !31, file: !7, line: 556, baseType: !34, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc", scope: !31, file: !7, line: 558, baseType: !128, size: 192, offset: 320)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 192, elements: !80)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !31, file: !7, line: 562, baseType: !34, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !31, file: !7, line: 563, baseType: !77, size: 192, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cellsize", scope: !31, file: !7, line: 564, baseType: !77, size: 192, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv_level", scope: !31, file: !7, line: 566, baseType: !34, size: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "bintree", scope: !31, file: !7, line: 569, baseType: !134, size: 64, offset: 1024)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "BTNODE", file: !7, line: 535, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btnode", file: !7, line: 522, size: 960, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !136, file: !7, line: 524, baseType: !57, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !136, file: !7, line: 525, baseType: !77, size: 192, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nprims", scope: !136, file: !7, line: 527, baseType: !34, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !136, file: !7, line: 528, baseType: !128, size: 192, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !136, file: !7, line: 529, baseType: !128, size: 192, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !136, file: !7, line: 531, baseType: !34, size: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "totalPrimsAllocated", scope: !136, file: !7, line: 532, baseType: !34, size: 64, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "btn", scope: !136, file: !7, line: 533, baseType: !146, size: 128, offset: 832)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, elements: !148)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!148 = !{!149}
!149 = !DISubrange(count: 2)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !7, line: 570, baseType: !151, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !26, file: !7, line: 585, baseType: !77, size: 192, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "entry_plane", scope: !26, file: !7, line: 587, baseType: !34, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "t_in", scope: !26, file: !7, line: 589, baseType: !78, size: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "exit_plane", scope: !26, file: !7, line: 591, baseType: !34, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "t_out", scope: !26, file: !7, line: 593, baseType: !78, size: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !26, file: !7, line: 595, baseType: !77, size: 192, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "index3D", scope: !26, file: !7, line: 596, baseType: !128, size: 192, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "index1D", scope: !26, file: !7, line: 597, baseType: !34, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc1D", scope: !26, file: !7, line: 600, baseType: !128, size: 192, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !7, line: 601, baseType: !162, size: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!163 = !{!164, !0, !166, !168, !170, !172, !174, !176, !178, !180, !182, !184, !186, !188, !190}
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "nodesize", scope: !2, file: !3, line: 53, type: !16, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "endmem", scope: !2, file: !3, line: 55, type: !9, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "mem_grid", scope: !2, file: !3, line: 63, type: !34, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "maxmem_grid", scope: !2, file: !3, line: 64, type: !34, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "mem_voxel", scope: !2, file: !3, line: 66, type: !34, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "maxmem_voxel", scope: !2, file: !3, line: 67, type: !34, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "mem_hashtable", scope: !2, file: !3, line: 69, type: !34, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "maxmem_hashtable", scope: !2, file: !3, line: 70, type: !34, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "mem_emptycells", scope: !2, file: !3, line: 72, type: !34, isLocal: false, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "maxmem_emptycells", scope: !2, file: !3, line: 73, type: !34, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "mem_bintree", scope: !2, file: !3, line: 75, type: !34, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "maxmem_bintree", scope: !2, file: !3, line: 76, type: !34, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "mem_pepArray", scope: !2, file: !3, line: 78, type: !34, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "maxmem_pepArray", scope: !2, file: !3, line: 79, type: !34, isLocal: false, isDefinition: true)
!192 = !{i32 7, !"Dwarf Version", i32 5}
!193 = !{i32 2, !"Debug Info Version", i32 3}
!194 = !{i32 1, !"wchar_size", i32 4}
!195 = !{i32 7, !"PIC Level", i32 2}
!196 = !{i32 7, !"PIE Level", i32 2}
!197 = !{i32 7, !"uwtable", i32 2}
!198 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!199 = distinct !DISubprogram(name: "LocalMalloc", scope: !3, file: !3, line: 105, type: !200, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !202)
!200 = !DISubroutineType(types: !201)
!201 = !{!5, !16, !47}
!202 = !{!203, !204, !205}
!203 = !DILocalVariable(name: "n", arg: 1, scope: !199, file: !3, line: 105, type: !16)
!204 = !DILocalVariable(name: "msg", arg: 2, scope: !199, file: !3, line: 105, type: !47)
!205 = !DILocalVariable(name: "p", scope: !199, file: !3, line: 107, type: !5)
!206 = !DILocation(line: 0, scope: !199)
!207 = !DILocation(line: 109, column: 25, scope: !199)
!208 = !DILocation(line: 110, column: 7, scope: !209)
!209 = distinct !DILexicalBlock(scope: !199, file: !3, line: 110, column: 6)
!210 = !DILocation(line: 110, column: 6, scope: !199)
!211 = !DILocation(line: 112, column: 52, scope: !212)
!212 = distinct !DILexicalBlock(scope: !209, file: !3, line: 111, column: 3)
!213 = !DILocation(line: 112, column: 3, scope: !212)
!214 = !DILocation(line: 113, column: 3, scope: !212)
!215 = !DILocation(line: 116, column: 2, scope: !199)
!216 = distinct !DISubprogram(name: "LocalFree", scope: !3, file: !3, line: 139, type: !217, scopeLine: 140, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !219)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !5}
!219 = !{!220}
!220 = !DILocalVariable(name: "p", arg: 1, scope: !216, file: !3, line: 139, type: !5)
!221 = !DILocation(line: 0, scope: !216)
!222 = !DILocation(line: 141, column: 2, scope: !216)
!223 = !DILocation(line: 143, column: 2, scope: !216)
!224 = distinct !DISubprogram(name: "GlobalHeapWalk", scope: !3, file: !3, line: 161, type: !225, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !227)
!225 = !DISubroutineType(types: !226)
!226 = !{null}
!227 = !{!228}
!228 = !DILocalVariable(name: "curr", scope: !224, file: !3, line: 163, type: !9)
!229 = !DILocation(line: 165, column: 24, scope: !230)
!230 = distinct !DILexicalBlock(scope: !224, file: !3, line: 165, column: 2)
!231 = !DILocation(line: 165, column: 28, scope: !230)
!232 = !DILocation(line: 165, column: 3, scope: !230)
!233 = !DILocation(line: 166, column: 9, scope: !224)
!234 = !DILocation(line: 0, scope: !224)
!235 = !DILocation(line: 168, column: 42, scope: !224)
!236 = !DILocation(line: 168, column: 46, scope: !224)
!237 = !DILocation(line: 168, column: 37, scope: !224)
!238 = !DILocation(line: 168, column: 2, scope: !224)
!239 = !DILocation(line: 170, column: 2, scope: !224)
!240 = !DILocation(line: 171, column: 2, scope: !224)
!241 = !DILocation(line: 173, column: 16, scope: !224)
!242 = !DILocation(line: 173, column: 14, scope: !224)
!243 = !DILocation(line: 173, column: 2, scope: !224)
!244 = !DILocation(line: 176, column: 4, scope: !245)
!245 = distinct !DILexicalBlock(scope: !224, file: !3, line: 174, column: 3)
!246 = !DILocation(line: 176, column: 26, scope: !245)
!247 = !DILocation(line: 176, column: 15, scope: !245)
!248 = !DILocation(line: 176, column: 38, scope: !245)
!249 = !DILocation(line: 177, column: 11, scope: !245)
!250 = !DILocation(line: 177, column: 5, scope: !245)
!251 = !DILocation(line: 177, column: 42, scope: !245)
!252 = !DILocation(line: 175, column: 3, scope: !245)
!253 = !DILocation(line: 179, column: 13, scope: !254)
!254 = distinct !DILexicalBlock(scope: !245, file: !3, line: 179, column: 7)
!255 = !DILocation(line: 179, column: 18, scope: !254)
!256 = !DILocation(line: 179, column: 7, scope: !245)
!257 = !DILocation(line: 181, column: 12, scope: !258)
!258 = distinct !DILexicalBlock(scope: !254, file: !3, line: 180, column: 4)
!259 = !DILocation(line: 181, column: 4, scope: !258)
!260 = !DILocation(line: 182, column: 4, scope: !258)
!261 = !DILocation(line: 185, column: 10, scope: !245)
!262 = distinct !{!262, !243, !263, !264, !265}
!263 = !DILocation(line: 186, column: 3, scope: !224)
!264 = !{!"llvm.loop.mustprogress"}
!265 = !{!"llvm.loop.unroll.disable"}
!266 = !DILocation(line: 188, column: 26, scope: !267)
!267 = distinct !DILexicalBlock(scope: !224, file: !3, line: 188, column: 2)
!268 = !DILocation(line: 188, column: 30, scope: !267)
!269 = !DILocation(line: 188, column: 3, scope: !267)
!270 = !DILocation(line: 189, column: 2, scope: !224)
!271 = !DISubprogram(name: "pthread_mutex_lock", scope: !272, file: !272, line: 738, type: !273, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !307)
!272 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!273 = !DISubroutineType(types: !274)
!274 = !{!275, !276}
!275 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !278, line: 72, baseType: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 67, size: 320, elements: !280)
!280 = !{!281, !302, !306}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !279, file: !278, line: 69, baseType: !282, size: 320)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !283, line: 22, size: 320, elements: !284)
!283 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!284 = !{!285, !286, !288, !289, !290, !291, !293, !294}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !282, file: !283, line: 24, baseType: !275, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !282, file: !283, line: 25, baseType: !287, size: 32, offset: 32)
!287 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !282, file: !283, line: 26, baseType: !275, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !282, file: !283, line: 28, baseType: !287, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !282, file: !283, line: 32, baseType: !275, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !282, file: !283, line: 34, baseType: !292, size: 16, offset: 160)
!292 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !282, file: !283, line: 35, baseType: !292, size: 16, offset: 176)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !282, file: !283, line: 36, baseType: !295, size: 128, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !296, line: 53, baseType: !297)
!296 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !296, line: 49, size: 128, elements: !298)
!298 = !{!299, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !297, file: !296, line: 51, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !297, file: !296, line: 52, baseType: !300, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !279, file: !278, line: 70, baseType: !303, size: 320)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 320, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 40)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !279, file: !278, line: 71, baseType: !35, size: 64)
!307 = !{}
!308 = !DISubprogram(name: "pthread_mutex_unlock", scope: !272, file: !272, line: 756, type: !273, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !307)
!309 = distinct !DISubprogram(name: "GlobalHeapInit", scope: !3, file: !3, line: 217, type: !310, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !312)
!310 = !DISubroutineType(types: !311)
!311 = !{!18, !16}
!312 = !{!313}
!313 = !DILocalVariable(name: "size", arg: 1, scope: !309, file: !3, line: 217, type: !16)
!314 = !DILocation(line: 0, scope: !309)
!315 = !DILocation(line: 219, column: 14, scope: !309)
!316 = !DILocation(line: 220, column: 30, scope: !309)
!317 = !DILocation(line: 220, column: 2, scope: !309)
!318 = !DILocation(line: 220, column: 6, scope: !309)
!319 = !DILocation(line: 220, column: 15, scope: !309)
!320 = !DILocation(line: 222, column: 7, scope: !321)
!321 = distinct !DILexicalBlock(scope: !309, file: !3, line: 222, column: 6)
!322 = !DILocation(line: 222, column: 6, scope: !309)
!323 = !DILocation(line: 225, column: 11, scope: !309)
!324 = !DILocation(line: 226, column: 10, scope: !309)
!325 = !DILocation(line: 227, column: 12, scope: !309)
!326 = !DILocation(line: 227, column: 10, scope: !309)
!327 = !DILocation(line: 229, column: 28, scope: !309)
!328 = !DILocation(line: 229, column: 16, scope: !309)
!329 = !DILocation(line: 229, column: 21, scope: !309)
!330 = !DILocation(line: 230, column: 6, scope: !309)
!331 = !DILocation(line: 230, column: 21, scope: !309)
!332 = !DILocation(line: 231, column: 2, scope: !309)
!333 = !DILocation(line: 231, column: 6, scope: !309)
!334 = !DILocation(line: 231, column: 16, scope: !309)
!335 = !DILocation(line: 231, column: 21, scope: !309)
!336 = !DILocation(line: 232, column: 6, scope: !309)
!337 = !DILocation(line: 232, column: 16, scope: !309)
!338 = !DILocation(line: 232, column: 21, scope: !309)
!339 = !DILocation(line: 237, column: 2, scope: !309)
!340 = !DILocation(line: 238, column: 2, scope: !309)
!341 = distinct !DISubprogram(name: "GlobalMalloc", scope: !3, file: !3, line: 270, type: !200, scopeLine: 271, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !342)
!342 = !{!343, !344, !345, !346, !347}
!343 = !DILocalVariable(name: "size", arg: 1, scope: !341, file: !3, line: 270, type: !16)
!344 = !DILocalVariable(name: "msg", arg: 2, scope: !341, file: !3, line: 270, type: !47)
!345 = !DILocalVariable(name: "prev", scope: !341, file: !3, line: 272, type: !9)
!346 = !DILocalVariable(name: "curr", scope: !341, file: !3, line: 273, type: !9)
!347 = !DILocalVariable(name: "next", scope: !341, file: !3, line: 274, type: !9)
!348 = !DILocation(line: 0, scope: !341)
!349 = !DILocation(line: 276, column: 7, scope: !350)
!350 = distinct !DILexicalBlock(scope: !341, file: !3, line: 276, column: 6)
!351 = !DILocation(line: 276, column: 6, scope: !341)
!352 = !DILocation(line: 279, column: 24, scope: !353)
!353 = distinct !DILexicalBlock(scope: !341, file: !3, line: 279, column: 2)
!354 = !DILocation(line: 279, column: 28, scope: !353)
!355 = !DILocation(line: 279, column: 3, scope: !353)
!356 = !DILocation(line: 282, column: 9, scope: !341)
!357 = !DILocation(line: 282, column: 13, scope: !341)
!358 = !DILocation(line: 283, column: 9, scope: !341)
!359 = !DILocation(line: 289, column: 2, scope: !341)
!360 = !DILocation(line: 289, column: 9, scope: !341)
!361 = !DILocation(line: 289, column: 14, scope: !341)
!362 = !DILocation(line: 289, column: 23, scope: !341)
!363 = !DILocation(line: 289, column: 28, scope: !341)
!364 = !DILocation(line: 291, column: 13, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 291, column: 7)
!366 = distinct !DILexicalBlock(scope: !341, file: !3, line: 290, column: 3)
!367 = !DILocation(line: 291, column: 18, scope: !365)
!368 = !DILocation(line: 291, column: 7, scope: !366)
!369 = !DILocation(line: 293, column: 12, scope: !370)
!370 = distinct !DILexicalBlock(scope: !365, file: !3, line: 292, column: 4)
!371 = !DILocation(line: 293, column: 4, scope: !370)
!372 = !DILocation(line: 294, column: 4, scope: !370)
!373 = !DILocation(line: 297, column: 13, scope: !374)
!374 = distinct !DILexicalBlock(scope: !366, file: !3, line: 297, column: 7)
!375 = !DILocation(line: 297, column: 18, scope: !374)
!376 = !DILocation(line: 297, column: 7, scope: !366)
!377 = distinct !{!377, !359, !378, !264, !265}
!378 = !DILocation(line: 305, column: 3, scope: !341)
!379 = !DILocation(line: 299, column: 12, scope: !380)
!380 = distinct !DILexicalBlock(scope: !374, file: !3, line: 298, column: 4)
!381 = !DILocation(line: 299, column: 4, scope: !380)
!382 = !DILocation(line: 300, column: 4, scope: !380)
!383 = !DILocation(line: 310, column: 11, scope: !384)
!384 = distinct !DILexicalBlock(scope: !385, file: !3, line: 309, column: 3)
!385 = distinct !DILexicalBlock(scope: !341, file: !3, line: 308, column: 6)
!386 = !DILocation(line: 310, column: 62, scope: !384)
!387 = !DILocation(line: 310, column: 3, scope: !384)
!388 = !DILocation(line: 311, column: 3, scope: !384)
!389 = !DILocation(line: 320, column: 17, scope: !390)
!390 = distinct !DILexicalBlock(scope: !341, file: !3, line: 320, column: 6)
!391 = !DILocation(line: 320, column: 24, scope: !390)
!392 = !DILocation(line: 320, column: 6, scope: !341)
!393 = !DILocation(line: 322, column: 14, scope: !394)
!394 = distinct !DILexicalBlock(scope: !390, file: !3, line: 321, column: 3)
!395 = !DILocation(line: 323, column: 39, scope: !394)
!396 = !DILocation(line: 323, column: 9, scope: !394)
!397 = !DILocation(line: 323, column: 15, scope: !394)
!398 = !DILocation(line: 324, column: 23, scope: !394)
!399 = !DILocation(line: 324, column: 15, scope: !394)
!400 = !DILocation(line: 325, column: 9, scope: !394)
!401 = !DILocation(line: 325, column: 15, scope: !394)
!402 = !DILocation(line: 326, column: 9, scope: !394)
!403 = !DILocation(line: 326, column: 15, scope: !394)
!404 = !DILocation(line: 327, column: 15, scope: !394)
!405 = !DILocation(line: 328, column: 3, scope: !394)
!406 = !DILocation(line: 330, column: 16, scope: !390)
!407 = !DILocation(line: 0, scope: !390)
!408 = !DILocation(line: 333, column: 7, scope: !409)
!409 = distinct !DILexicalBlock(scope: !341, file: !3, line: 333, column: 6)
!410 = !DILocation(line: 333, column: 6, scope: !341)
!411 = !DILocation(line: 334, column: 3, scope: !409)
!412 = !DILocation(line: 334, column: 7, scope: !409)
!413 = !DILocation(line: 334, column: 16, scope: !409)
!414 = !DILocation(line: 336, column: 16, scope: !409)
!415 = !DILocation(line: 339, column: 26, scope: !416)
!416 = distinct !DILexicalBlock(scope: !341, file: !3, line: 339, column: 2)
!417 = !DILocation(line: 339, column: 30, scope: !416)
!418 = !DILocation(line: 339, column: 3, scope: !416)
!419 = !DILocation(line: 340, column: 13, scope: !341)
!420 = !DILocation(line: 341, column: 8, scope: !341)
!421 = !DILocation(line: 341, column: 13, scope: !341)
!422 = !DILocation(line: 342, column: 12, scope: !341)
!423 = !DILocation(line: 344, column: 2, scope: !341)
!424 = !DILocation(line: 345, column: 2, scope: !341)
!425 = distinct !DISubprogram(name: "GlobalCalloc", scope: !3, file: !3, line: 371, type: !426, scopeLine: 372, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !428)
!426 = !DISubroutineType(types: !427)
!427 = !{!5, !16, !16}
!428 = !{!429, !430, !431, !432, !433}
!429 = !DILocalVariable(name: "n", arg: 1, scope: !425, file: !3, line: 371, type: !16)
!430 = !DILocalVariable(name: "size", arg: 2, scope: !425, file: !3, line: 371, type: !16)
!431 = !DILocalVariable(name: "nbytes", scope: !425, file: !3, line: 373, type: !16)
!432 = !DILocalVariable(name: "p", scope: !425, file: !3, line: 374, type: !23)
!433 = !DILocalVariable(name: "q", scope: !425, file: !3, line: 375, type: !5)
!434 = !DILocation(line: 0, scope: !425)
!435 = !DILocation(line: 377, column: 11, scope: !425)
!436 = !DILocation(line: 379, column: 10, scope: !425)
!437 = !DILocation(line: 382, column: 2, scope: !425)
!438 = !DILocation(line: 383, column: 8, scope: !425)
!439 = !DILocation(line: 385, column: 2, scope: !425)
!440 = distinct !DISubprogram(name: "GlobalRealloc", scope: !3, file: !3, line: 446, type: !441, scopeLine: 447, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{!5, !5, !16}
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!444 = !DILocalVariable(name: "p", arg: 1, scope: !440, file: !3, line: 446, type: !5)
!445 = !DILocalVariable(name: "size", arg: 2, scope: !440, file: !3, line: 446, type: !16)
!446 = !DILocalVariable(name: "oldsize", scope: !440, file: !3, line: 448, type: !16)
!447 = !DILocalVariable(name: "newsize", scope: !440, file: !3, line: 449, type: !16)
!448 = !DILocalVariable(name: "totsize", scope: !440, file: !3, line: 450, type: !16)
!449 = !DILocalVariable(name: "q", scope: !440, file: !3, line: 451, type: !5)
!450 = !DILocalVariable(name: "r", scope: !440, file: !3, line: 452, type: !23)
!451 = !DILocalVariable(name: "s", scope: !440, file: !3, line: 453, type: !23)
!452 = !DILocalVariable(name: "pn", scope: !440, file: !3, line: 454, type: !9)
!453 = !DILocalVariable(name: "prev", scope: !440, file: !3, line: 455, type: !9)
!454 = !DILocalVariable(name: "curr", scope: !440, file: !3, line: 456, type: !9)
!455 = !DILocalVariable(name: "next", scope: !440, file: !3, line: 457, type: !9)
!456 = !DILocalVariable(name: "node", scope: !440, file: !3, line: 458, type: !9)
!457 = !DILocation(line: 0, scope: !440)
!458 = !DILocation(line: 460, column: 7, scope: !459)
!459 = distinct !DILexicalBlock(scope: !440, file: !3, line: 460, column: 6)
!460 = !DILocation(line: 460, column: 6, scope: !440)
!461 = !DILocation(line: 462, column: 3, scope: !462)
!462 = distinct !DILexicalBlock(scope: !459, file: !3, line: 461, column: 3)
!463 = !DILocation(line: 463, column: 3, scope: !462)
!464 = !DILocation(line: 466, column: 7, scope: !465)
!465 = distinct !DILexicalBlock(scope: !440, file: !3, line: 466, column: 6)
!466 = !DILocation(line: 466, column: 6, scope: !440)
!467 = !DILocation(line: 467, column: 11, scope: !465)
!468 = !DILocation(line: 467, column: 3, scope: !465)
!469 = !DILocation(line: 470, column: 7, scope: !440)
!470 = !DILocation(line: 472, column: 10, scope: !471)
!471 = distinct !DILexicalBlock(scope: !440, file: !3, line: 472, column: 6)
!472 = !DILocation(line: 472, column: 15, scope: !471)
!473 = !DILocation(line: 472, column: 6, scope: !440)
!474 = !DILocation(line: 474, column: 11, scope: !475)
!475 = distinct !DILexicalBlock(scope: !471, file: !3, line: 473, column: 3)
!476 = !DILocation(line: 474, column: 3, scope: !475)
!477 = !DILocation(line: 475, column: 3, scope: !475)
!478 = !DILocation(line: 478, column: 10, scope: !479)
!479 = distinct !DILexicalBlock(scope: !440, file: !3, line: 478, column: 6)
!480 = !DILocation(line: 478, column: 6, scope: !479)
!481 = !DILocation(line: 478, column: 6, scope: !440)
!482 = !DILocation(line: 480, column: 11, scope: !483)
!483 = distinct !DILexicalBlock(scope: !479, file: !3, line: 479, column: 3)
!484 = !DILocation(line: 480, column: 3, scope: !483)
!485 = !DILocation(line: 481, column: 3, scope: !483)
!486 = !DILocation(line: 485, column: 12, scope: !440)
!487 = !DILocation(line: 486, column: 16, scope: !440)
!488 = !DILocation(line: 494, column: 14, scope: !489)
!489 = distinct !DILexicalBlock(scope: !440, file: !3, line: 494, column: 6)
!490 = !DILocation(line: 494, column: 6, scope: !440)
!491 = !DILocation(line: 496, column: 15, scope: !492)
!492 = distinct !DILexicalBlock(scope: !493, file: !3, line: 496, column: 7)
!493 = distinct !DILexicalBlock(scope: !489, file: !3, line: 495, column: 3)
!494 = !DILocation(line: 496, column: 25, scope: !492)
!495 = !DILocation(line: 496, column: 7, scope: !493)
!496 = !DILocation(line: 499, column: 15, scope: !493)
!497 = !DILocation(line: 501, column: 14, scope: !493)
!498 = !DILocation(line: 502, column: 27, scope: !493)
!499 = !DILocation(line: 502, column: 36, scope: !493)
!500 = !DILocation(line: 502, column: 9, scope: !493)
!501 = !DILocation(line: 502, column: 15, scope: !493)
!502 = !DILocation(line: 503, column: 15, scope: !493)
!503 = !DILocation(line: 504, column: 9, scope: !493)
!504 = !DILocation(line: 504, column: 15, scope: !493)
!505 = !DILocation(line: 505, column: 9, scope: !493)
!506 = !DILocation(line: 505, column: 15, scope: !493)
!507 = !DILocation(line: 506, column: 14, scope: !493)
!508 = !DILocation(line: 508, column: 3, scope: !493)
!509 = !DILocation(line: 509, column: 3, scope: !493)
!510 = !DILocation(line: 518, column: 9, scope: !440)
!511 = !DILocation(line: 519, column: 20, scope: !440)
!512 = !DILocation(line: 519, column: 39, scope: !440)
!513 = !DILocation(line: 519, column: 31, scope: !440)
!514 = !DILocation(line: 521, column: 24, scope: !515)
!515 = distinct !DILexicalBlock(scope: !440, file: !3, line: 521, column: 2)
!516 = !DILocation(line: 521, column: 28, scope: !515)
!517 = !DILocation(line: 521, column: 3, scope: !515)
!518 = !DILocation(line: 522, column: 13, scope: !519)
!519 = distinct !DILexicalBlock(scope: !440, file: !3, line: 522, column: 6)
!520 = !DILocation(line: 522, column: 11, scope: !519)
!521 = !DILocation(line: 522, column: 20, scope: !519)
!522 = !DILocation(line: 522, column: 29, scope: !519)
!523 = !DILocation(line: 522, column: 23, scope: !519)
!524 = !DILocation(line: 522, column: 34, scope: !519)
!525 = !DILocation(line: 527, column: 10, scope: !526)
!526 = distinct !DILexicalBlock(scope: !519, file: !3, line: 523, column: 3)
!527 = !DILocation(line: 527, column: 14, scope: !526)
!528 = !DILocation(line: 529, column: 3, scope: !526)
!529 = !DILocation(line: 0, scope: !526)
!530 = !DILocation(line: 529, column: 10, scope: !526)
!531 = !DILocation(line: 529, column: 15, scope: !526)
!532 = distinct !{!532, !528, !533, !264, !265}
!533 = !DILocation(line: 533, column: 4, scope: !526)
!534 = !DILocation(line: 535, column: 12, scope: !535)
!535 = distinct !DILexicalBlock(scope: !526, file: !3, line: 535, column: 7)
!536 = !DILocation(line: 535, column: 7, scope: !526)
!537 = !DILocation(line: 537, column: 12, scope: !538)
!538 = distinct !DILexicalBlock(scope: !535, file: !3, line: 536, column: 4)
!539 = !DILocation(line: 537, column: 4, scope: !538)
!540 = !DILocation(line: 538, column: 4, scope: !538)
!541 = !DILocation(line: 541, column: 15, scope: !542)
!542 = distinct !DILexicalBlock(scope: !526, file: !3, line: 541, column: 7)
!543 = !DILocation(line: 541, column: 25, scope: !542)
!544 = !DILocation(line: 541, column: 7, scope: !526)
!545 = !DILocation(line: 545, column: 9, scope: !546)
!546 = distinct !DILexicalBlock(scope: !547, file: !3, line: 545, column: 8)
!547 = distinct !DILexicalBlock(scope: !542, file: !3, line: 542, column: 4)
!548 = !DILocation(line: 0, scope: !546)
!549 = !DILocation(line: 550, column: 15, scope: !547)
!550 = !DILocation(line: 551, column: 15, scope: !547)
!551 = !DILocation(line: 552, column: 15, scope: !547)
!552 = !DILocation(line: 554, column: 28, scope: !553)
!553 = distinct !DILexicalBlock(scope: !547, file: !3, line: 554, column: 4)
!554 = !DILocation(line: 554, column: 32, scope: !553)
!555 = !DILocation(line: 554, column: 5, scope: !553)
!556 = !DILocation(line: 555, column: 4, scope: !547)
!557 = !DILocation(line: 561, column: 14, scope: !558)
!558 = distinct !DILexicalBlock(scope: !542, file: !3, line: 558, column: 4)
!559 = !DILocation(line: 562, column: 23, scope: !558)
!560 = !DILocation(line: 562, column: 15, scope: !558)
!561 = !DILocation(line: 563, column: 27, scope: !558)
!562 = !DILocation(line: 563, column: 36, scope: !558)
!563 = !DILocation(line: 563, column: 10, scope: !558)
!564 = !DILocation(line: 563, column: 15, scope: !558)
!565 = !DILocation(line: 564, column: 10, scope: !558)
!566 = !DILocation(line: 564, column: 15, scope: !558)
!567 = !DILocation(line: 565, column: 10, scope: !558)
!568 = !DILocation(line: 565, column: 15, scope: !558)
!569 = !DILocation(line: 567, column: 9, scope: !570)
!570 = distinct !DILexicalBlock(scope: !558, file: !3, line: 567, column: 8)
!571 = !DILocation(line: 567, column: 8, scope: !558)
!572 = !DILocation(line: 568, column: 5, scope: !570)
!573 = !DILocation(line: 568, column: 9, scope: !570)
!574 = !DILocation(line: 0, scope: !570)
!575 = !DILocation(line: 572, column: 15, scope: !558)
!576 = !DILocation(line: 573, column: 15, scope: !558)
!577 = !DILocation(line: 574, column: 15, scope: !558)
!578 = !DILocation(line: 576, column: 28, scope: !579)
!579 = distinct !DILexicalBlock(scope: !558, file: !3, line: 576, column: 4)
!580 = !DILocation(line: 576, column: 32, scope: !579)
!581 = !DILocation(line: 576, column: 5, scope: !579)
!582 = !DILocation(line: 577, column: 4, scope: !558)
!583 = !DILocation(line: 588, column: 26, scope: !584)
!584 = distinct !DILexicalBlock(scope: !440, file: !3, line: 588, column: 2)
!585 = !DILocation(line: 588, column: 30, scope: !584)
!586 = !DILocation(line: 588, column: 3, scope: !584)
!587 = !DILocation(line: 590, column: 10, scope: !440)
!588 = !DILocation(line: 591, column: 7, scope: !589)
!589 = distinct !DILexicalBlock(scope: !440, file: !3, line: 591, column: 6)
!590 = !DILocation(line: 591, column: 6, scope: !440)
!591 = !DILocation(line: 597, column: 2, scope: !440)
!592 = !DILocation(line: 595, column: 10, scope: !440)
!593 = !DILocation(line: 597, column: 16, scope: !440)
!594 = !DILocation(line: 598, column: 12, scope: !440)
!595 = !DILocation(line: 598, column: 10, scope: !440)
!596 = !DILocation(line: 598, column: 5, scope: !440)
!597 = !DILocation(line: 598, column: 8, scope: !440)
!598 = distinct !{!598, !591, !594, !264, !265}
!599 = !DILocation(line: 600, column: 2, scope: !440)
!600 = !DILocation(line: 601, column: 2, scope: !440)
!601 = !DILocation(line: 602, column: 2, scope: !440)
!602 = distinct !DISubprogram(name: "GlobalFree", scope: !3, file: !3, line: 624, type: !217, scopeLine: 625, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610}
!604 = !DILocalVariable(name: "p", arg: 1, scope: !602, file: !3, line: 624, type: !5)
!605 = !DILocalVariable(name: "pcom", scope: !602, file: !3, line: 626, type: !18)
!606 = !DILocalVariable(name: "ncom", scope: !602, file: !3, line: 627, type: !18)
!607 = !DILocalVariable(name: "pn", scope: !602, file: !3, line: 628, type: !9)
!608 = !DILocalVariable(name: "prev", scope: !602, file: !3, line: 629, type: !9)
!609 = !DILocalVariable(name: "curr", scope: !602, file: !3, line: 630, type: !9)
!610 = !DILocalVariable(name: "next", scope: !602, file: !3, line: 631, type: !9)
!611 = !DILocation(line: 0, scope: !602)
!612 = !DILocation(line: 633, column: 7, scope: !613)
!613 = distinct !DILexicalBlock(scope: !602, file: !3, line: 633, column: 6)
!614 = !DILocation(line: 633, column: 6, scope: !602)
!615 = !DILocation(line: 637, column: 7, scope: !602)
!616 = !DILocation(line: 639, column: 10, scope: !617)
!617 = distinct !DILexicalBlock(scope: !602, file: !3, line: 639, column: 6)
!618 = !DILocation(line: 639, column: 15, scope: !617)
!619 = !DILocation(line: 639, column: 6, scope: !602)
!620 = !DILocation(line: 641, column: 11, scope: !621)
!621 = distinct !DILexicalBlock(scope: !617, file: !3, line: 640, column: 3)
!622 = !DILocation(line: 641, column: 3, scope: !621)
!623 = !DILocation(line: 642, column: 3, scope: !621)
!624 = !DILocation(line: 645, column: 10, scope: !625)
!625 = distinct !DILexicalBlock(scope: !602, file: !3, line: 645, column: 6)
!626 = !DILocation(line: 645, column: 6, scope: !625)
!627 = !DILocation(line: 645, column: 6, scope: !602)
!628 = !DILocation(line: 647, column: 11, scope: !629)
!629 = distinct !DILexicalBlock(scope: !625, file: !3, line: 646, column: 3)
!630 = !DILocation(line: 647, column: 3, scope: !629)
!631 = !DILocation(line: 648, column: 3, scope: !629)
!632 = !DILocation(line: 655, column: 24, scope: !633)
!633 = distinct !DILexicalBlock(scope: !602, file: !3, line: 655, column: 2)
!634 = !DILocation(line: 655, column: 28, scope: !633)
!635 = !DILocation(line: 655, column: 3, scope: !633)
!636 = !DILocation(line: 656, column: 6, scope: !637)
!637 = distinct !DILexicalBlock(scope: !602, file: !3, line: 656, column: 6)
!638 = !DILocation(line: 656, column: 10, scope: !637)
!639 = !DILocation(line: 656, column: 6, scope: !602)
!640 = !DILocation(line: 664, column: 15, scope: !641)
!641 = distinct !DILexicalBlock(scope: !637, file: !3, line: 657, column: 3)
!642 = !DILocation(line: 664, column: 20, scope: !641)
!643 = !DILocation(line: 666, column: 14, scope: !644)
!644 = distinct !DILexicalBlock(scope: !645, file: !3, line: 666, column: 8)
!645 = distinct !DILexicalBlock(scope: !641, file: !3, line: 665, column: 4)
!646 = !DILocation(line: 666, column: 19, scope: !644)
!647 = !DILocation(line: 666, column: 8, scope: !645)
!648 = !DILocation(line: 668, column: 13, scope: !649)
!649 = distinct !DILexicalBlock(scope: !644, file: !3, line: 667, column: 5)
!650 = !DILocation(line: 668, column: 5, scope: !649)
!651 = !DILocation(line: 669, column: 5, scope: !649)
!652 = !DILocation(line: 672, column: 14, scope: !653)
!653 = distinct !DILexicalBlock(scope: !645, file: !3, line: 672, column: 8)
!654 = !DILocation(line: 672, column: 8, scope: !653)
!655 = !DILocation(line: 680, column: 11, scope: !645)
!656 = distinct !{!656, !657, !658, !264, !265}
!657 = !DILocation(line: 664, column: 3, scope: !641)
!658 = !DILocation(line: 681, column: 4, scope: !641)
!659 = !DILocation(line: 688, column: 7, scope: !641)
!660 = !DILocation(line: 690, column: 12, scope: !661)
!661 = distinct !DILexicalBlock(scope: !662, file: !3, line: 689, column: 4)
!662 = distinct !DILexicalBlock(scope: !641, file: !3, line: 688, column: 7)
!663 = !DILocation(line: 690, column: 110, scope: !661)
!664 = !DILocation(line: 690, column: 4, scope: !661)
!665 = !DILocation(line: 691, column: 12, scope: !661)
!666 = !DILocation(line: 691, column: 4, scope: !661)
!667 = !DILocation(line: 692, column: 4, scope: !661)
!668 = !DILocation(line: 652, column: 7, scope: !602)
!669 = !DILocation(line: 653, column: 7, scope: !602)
!670 = !DILocation(line: 703, column: 9, scope: !602)
!671 = !DILocation(line: 705, column: 15, scope: !602)
!672 = !DILocation(line: 707, column: 13, scope: !673)
!673 = distinct !DILexicalBlock(scope: !674, file: !3, line: 707, column: 7)
!674 = distinct !DILexicalBlock(scope: !602, file: !3, line: 706, column: 3)
!675 = !DILocation(line: 707, column: 18, scope: !673)
!676 = !DILocation(line: 707, column: 7, scope: !674)
!677 = !DILocation(line: 709, column: 12, scope: !678)
!678 = distinct !DILexicalBlock(scope: !673, file: !3, line: 708, column: 4)
!679 = !DILocation(line: 709, column: 4, scope: !678)
!680 = !DILocation(line: 710, column: 4, scope: !678)
!681 = !DILocation(line: 713, column: 13, scope: !682)
!682 = distinct !DILexicalBlock(scope: !674, file: !3, line: 713, column: 7)
!683 = !DILocation(line: 713, column: 7, scope: !682)
!684 = !DILocation(line: 718, column: 10, scope: !674)
!685 = !DILocation(line: 705, column: 10, scope: !602)
!686 = distinct !{!686, !687, !688, !264, !265}
!687 = !DILocation(line: 705, column: 2, scope: !602)
!688 = !DILocation(line: 719, column: 3, scope: !602)
!689 = !DILocation(line: 722, column: 6, scope: !602)
!690 = !DILocation(line: 726, column: 13, scope: !602)
!691 = !DILocation(line: 735, column: 6, scope: !692)
!692 = distinct !DILexicalBlock(scope: !602, file: !3, line: 735, column: 6)
!693 = !DILocation(line: 735, column: 11, scope: !692)
!694 = !DILocation(line: 737, column: 15, scope: !695)
!695 = distinct !DILexicalBlock(scope: !692, file: !3, line: 736, column: 3)
!696 = !DILocation(line: 738, column: 23, scope: !695)
!697 = !DILocation(line: 738, column: 30, scope: !695)
!698 = !DILocation(line: 738, column: 28, scope: !695)
!699 = !DILocation(line: 738, column: 9, scope: !695)
!700 = !DILocation(line: 738, column: 14, scope: !695)
!701 = !DILocation(line: 739, column: 3, scope: !695)
!702 = !DILocation(line: 741, column: 11, scope: !703)
!703 = distinct !DILexicalBlock(scope: !692, file: !3, line: 741, column: 6)
!704 = !DILocation(line: 743, column: 15, scope: !705)
!705 = distinct !DILexicalBlock(scope: !703, file: !3, line: 742, column: 3)
!706 = !DILocation(line: 744, column: 15, scope: !705)
!707 = !DILocation(line: 745, column: 3, scope: !705)
!708 = !DILocation(line: 747, column: 11, scope: !709)
!709 = distinct !DILexicalBlock(scope: !703, file: !3, line: 747, column: 6)
!710 = !DILocation(line: 749, column: 3, scope: !711)
!711 = distinct !DILexicalBlock(scope: !709, file: !3, line: 748, column: 3)
!712 = !DILocation(line: 749, column: 7, scope: !711)
!713 = !DILocation(line: 749, column: 16, scope: !711)
!714 = !DILocation(line: 750, column: 16, scope: !711)
!715 = !DILocation(line: 751, column: 3, scope: !711)
!716 = !DILocation(line: 753, column: 11, scope: !717)
!717 = distinct !DILexicalBlock(scope: !709, file: !3, line: 753, column: 6)
!718 = !DILocation(line: 755, column: 23, scope: !719)
!719 = distinct !DILexicalBlock(scope: !717, file: !3, line: 754, column: 3)
!720 = !DILocation(line: 755, column: 15, scope: !719)
!721 = !DILocation(line: 756, column: 23, scope: !719)
!722 = !DILocation(line: 756, column: 36, scope: !719)
!723 = !DILocation(line: 756, column: 28, scope: !719)
!724 = !DILocation(line: 756, column: 45, scope: !719)
!725 = !DILocation(line: 756, column: 44, scope: !719)
!726 = !DILocation(line: 756, column: 41, scope: !719)
!727 = !DILocation(line: 756, column: 9, scope: !719)
!728 = !DILocation(line: 756, column: 14, scope: !719)
!729 = !DILocation(line: 757, column: 3, scope: !719)
!730 = !DILocation(line: 759, column: 11, scope: !731)
!731 = distinct !DILexicalBlock(scope: !717, file: !3, line: 759, column: 6)
!732 = !DILocation(line: 761, column: 15, scope: !733)
!733 = distinct !DILexicalBlock(scope: !731, file: !3, line: 760, column: 3)
!734 = !DILocation(line: 762, column: 23, scope: !733)
!735 = !DILocation(line: 762, column: 15, scope: !733)
!736 = !DILocation(line: 763, column: 23, scope: !733)
!737 = !DILocation(line: 763, column: 30, scope: !733)
!738 = !DILocation(line: 763, column: 28, scope: !733)
!739 = !DILocation(line: 763, column: 14, scope: !733)
!740 = !DILocation(line: 764, column: 3, scope: !733)
!741 = !DILocation(line: 766, column: 6, scope: !742)
!742 = distinct !DILexicalBlock(scope: !731, file: !3, line: 766, column: 6)
!743 = !DILocation(line: 766, column: 11, scope: !742)
!744 = !DILocation(line: 768, column: 3, scope: !745)
!745 = distinct !DILexicalBlock(scope: !742, file: !3, line: 767, column: 3)
!746 = !DILocation(line: 768, column: 7, scope: !745)
!747 = !DILocation(line: 768, column: 16, scope: !745)
!748 = !DILocation(line: 769, column: 24, scope: !745)
!749 = !DILocation(line: 769, column: 16, scope: !745)
!750 = !DILocation(line: 770, column: 24, scope: !745)
!751 = !DILocation(line: 770, column: 31, scope: !745)
!752 = !DILocation(line: 770, column: 29, scope: !745)
!753 = !DILocation(line: 770, column: 15, scope: !745)
!754 = !DILocation(line: 771, column: 3, scope: !745)
!755 = !DILocation(line: 773, column: 12, scope: !756)
!756 = distinct !DILexicalBlock(scope: !742, file: !3, line: 773, column: 6)
!757 = !DILocation(line: 775, column: 15, scope: !758)
!758 = distinct !DILexicalBlock(scope: !756, file: !3, line: 774, column: 3)
!759 = !DILocation(line: 776, column: 23, scope: !758)
!760 = !DILocation(line: 776, column: 30, scope: !758)
!761 = !DILocation(line: 776, column: 28, scope: !758)
!762 = !DILocation(line: 776, column: 9, scope: !758)
!763 = !DILocation(line: 776, column: 14, scope: !758)
!764 = !DILocation(line: 777, column: 3, scope: !758)
!765 = !DILocation(line: 779, column: 12, scope: !766)
!766 = distinct !DILexicalBlock(scope: !756, file: !3, line: 779, column: 6)
!767 = !DILocation(line: 781, column: 15, scope: !768)
!768 = distinct !DILexicalBlock(scope: !766, file: !3, line: 780, column: 3)
!769 = !DILocation(line: 782, column: 15, scope: !768)
!770 = !DILocation(line: 783, column: 3, scope: !768)
!771 = !DILocation(line: 785, column: 12, scope: !772)
!772 = distinct !DILexicalBlock(scope: !766, file: !3, line: 785, column: 6)
!773 = !DILocation(line: 787, column: 3, scope: !774)
!774 = distinct !DILexicalBlock(scope: !772, file: !3, line: 786, column: 3)
!775 = !DILocation(line: 787, column: 7, scope: !774)
!776 = !DILocation(line: 787, column: 16, scope: !774)
!777 = !DILocation(line: 788, column: 16, scope: !774)
!778 = !DILocation(line: 789, column: 3, scope: !774)
!779 = !DILocation(line: 791, column: 26, scope: !780)
!780 = distinct !DILexicalBlock(scope: !602, file: !3, line: 791, column: 2)
!781 = !DILocation(line: 791, column: 30, scope: !780)
!782 = !DILocation(line: 791, column: 3, scope: !780)
!783 = !DILocation(line: 792, column: 2, scope: !602)
!784 = !DILocation(line: 793, column: 2, scope: !602)
!785 = distinct !DISubprogram(name: "GlobalMemAvl", scope: !3, file: !3, line: 812, type: !786, scopeLine: 813, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !788)
!786 = !DISubroutineType(types: !787)
!787 = !{!16}
!788 = !{!789, !790}
!789 = !DILocalVariable(name: "total", scope: !785, file: !3, line: 814, type: !16)
!790 = !DILocalVariable(name: "curr", scope: !785, file: !3, line: 815, type: !9)
!791 = !DILocation(line: 817, column: 24, scope: !792)
!792 = distinct !DILexicalBlock(scope: !785, file: !3, line: 817, column: 2)
!793 = !DILocation(line: 817, column: 28, scope: !792)
!794 = !DILocation(line: 817, column: 3, scope: !792)
!795 = !DILocation(line: 0, scope: !785)
!796 = !DILocation(line: 819, column: 10, scope: !785)
!797 = !DILocation(line: 819, column: 14, scope: !785)
!798 = !DILocation(line: 821, column: 2, scope: !785)
!799 = !DILocation(line: 823, column: 18, scope: !800)
!800 = distinct !DILexicalBlock(scope: !785, file: !3, line: 822, column: 3)
!801 = !DILocation(line: 823, column: 9, scope: !800)
!802 = distinct !{!802, !798, !803, !264, !265}
!803 = !DILocation(line: 825, column: 3, scope: !785)
!804 = !DILocation(line: 827, column: 10, scope: !785)
!805 = !DILocation(line: 829, column: 30, scope: !806)
!806 = distinct !DILexicalBlock(scope: !785, file: !3, line: 829, column: 2)
!807 = !DILocation(line: 829, column: 3, scope: !806)
!808 = !DILocation(line: 830, column: 2, scope: !785)
!809 = distinct !DISubprogram(name: "GlobalMemMax", scope: !3, file: !3, line: 851, type: !786, scopeLine: 852, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !810)
!810 = !{!811, !812}
!811 = !DILocalVariable(name: "max", scope: !809, file: !3, line: 853, type: !16)
!812 = !DILocalVariable(name: "curr", scope: !809, file: !3, line: 854, type: !9)
!813 = !DILocation(line: 856, column: 24, scope: !814)
!814 = distinct !DILexicalBlock(scope: !809, file: !3, line: 856, column: 2)
!815 = !DILocation(line: 856, column: 28, scope: !814)
!816 = !DILocation(line: 856, column: 3, scope: !814)
!817 = !DILocation(line: 0, scope: !809)
!818 = !DILocation(line: 858, column: 9, scope: !809)
!819 = !DILocation(line: 858, column: 13, scope: !809)
!820 = !DILocation(line: 860, column: 2, scope: !809)
!821 = !DILocation(line: 862, column: 17, scope: !822)
!822 = distinct !DILexicalBlock(scope: !809, file: !3, line: 861, column: 3)
!823 = !DILocation(line: 862, column: 11, scope: !822)
!824 = distinct !{!824, !820, !825, !264, !265}
!825 = !DILocation(line: 864, column: 3, scope: !809)
!826 = !DILocation(line: 866, column: 8, scope: !809)
!827 = !DILocation(line: 868, column: 30, scope: !828)
!828 = distinct !DILexicalBlock(scope: !809, file: !3, line: 868, column: 2)
!829 = !DILocation(line: 868, column: 3, scope: !828)
!830 = !DILocation(line: 869, column: 2, scope: !809)
!831 = distinct !DISubprogram(name: "ObjectMalloc", scope: !3, file: !3, line: 894, type: !832, scopeLine: 895, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !834)
!832 = !DISubroutineType(types: !833)
!833 = !{!5, !34, !34}
!834 = !{!835, !836, !837, !838, !839, !842, !843, !845, !846}
!835 = !DILocalVariable(name: "ObjectType", arg: 1, scope: !831, file: !3, line: 894, type: !34)
!836 = !DILocalVariable(name: "count", arg: 2, scope: !831, file: !3, line: 894, type: !34)
!837 = !DILocalVariable(name: "n", scope: !831, file: !3, line: 896, type: !34)
!838 = !DILocalVariable(name: "p", scope: !831, file: !3, line: 897, type: !5)
!839 = !DILocalVariable(name: "i", scope: !840, file: !3, line: 919, type: !34)
!840 = distinct !DILexicalBlock(scope: !841, file: !3, line: 918, column: 4)
!841 = distinct !DILexicalBlock(scope: !831, file: !3, line: 900, column: 3)
!842 = !DILocalVariable(name: "x", scope: !840, file: !3, line: 920, type: !37)
!843 = !DILocalVariable(name: "i", scope: !844, file: !3, line: 936, type: !34)
!844 = distinct !DILexicalBlock(scope: !841, file: !3, line: 935, column: 4)
!845 = !DILocalVariable(name: "w", scope: !844, file: !3, line: 936, type: !34)
!846 = !DILocalVariable(name: "x", scope: !844, file: !3, line: 937, type: !23)
!847 = !DILocation(line: 0, scope: !831)
!848 = !DILocation(line: 899, column: 2, scope: !831)
!849 = !DILocation(line: 902, column: 13, scope: !841)
!850 = !DILocation(line: 903, column: 8, scope: !841)
!851 = !DILocation(line: 905, column: 13, scope: !841)
!852 = !DILocation(line: 907, column: 4, scope: !841)
!853 = !DILocation(line: 910, column: 13, scope: !841)
!854 = !DILocation(line: 911, column: 8, scope: !841)
!855 = !DILocation(line: 913, column: 14, scope: !841)
!856 = !DILocation(line: 915, column: 4, scope: !841)
!857 = !DILocation(line: 922, column: 13, scope: !840)
!858 = !DILocation(line: 923, column: 8, scope: !840)
!859 = !DILocation(line: 0, scope: !840)
!860 = !DILocation(line: 926, column: 18, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 926, column: 4)
!862 = distinct !DILexicalBlock(scope: !840, file: !3, line: 926, column: 4)
!863 = !DILocation(line: 926, column: 4, scope: !862)
!864 = !DILocation(line: 927, column: 10, scope: !861)
!865 = !DILocation(line: 929, column: 18, scope: !840)
!866 = !DILocation(line: 932, column: 4, scope: !841)
!867 = !DILocation(line: 0, scope: !844)
!868 = !DILocation(line: 940, column: 9, scope: !844)
!869 = !DILocation(line: 941, column: 8, scope: !844)
!870 = !DILocation(line: 945, column: 10, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 944, column: 4)
!872 = distinct !DILexicalBlock(scope: !844, file: !3, line: 944, column: 4)
!873 = !DILocation(line: 947, column: 19, scope: !844)
!874 = !DILocation(line: 950, column: 4, scope: !841)
!875 = !DILocation(line: 953, column: 13, scope: !841)
!876 = !DILocation(line: 954, column: 8, scope: !841)
!877 = !DILocation(line: 956, column: 16, scope: !841)
!878 = !DILocation(line: 958, column: 4, scope: !841)
!879 = !DILocation(line: 961, column: 13, scope: !841)
!880 = !DILocation(line: 962, column: 8, scope: !841)
!881 = !DILocation(line: 964, column: 17, scope: !841)
!882 = !DILocation(line: 966, column: 4, scope: !841)
!883 = !DILocation(line: 969, column: 4, scope: !841)
!884 = !DILocation(line: 970, column: 4, scope: !841)
!885 = !DILocation(line: 0, scope: !841)
!886 = !DILocation(line: 973, column: 2, scope: !831)
!887 = distinct !DISubprogram(name: "ObjectFree", scope: !3, file: !3, line: 996, type: !888, scopeLine: 997, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !890)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !34, !34, !5}
!890 = !{!891, !892, !893, !894}
!891 = !DILocalVariable(name: "ObjectType", arg: 1, scope: !887, file: !3, line: 996, type: !34)
!892 = !DILocalVariable(name: "count", arg: 2, scope: !887, file: !3, line: 996, type: !34)
!893 = !DILocalVariable(name: "p", arg: 3, scope: !887, file: !3, line: 996, type: !5)
!894 = !DILocalVariable(name: "n", scope: !887, file: !3, line: 998, type: !34)
!895 = !DILocation(line: 0, scope: !887)
!896 = !DILocation(line: 1000, column: 2, scope: !887)
!897 = !DILocation(line: 1002, column: 2, scope: !887)
!898 = !DILocation(line: 1005, column: 13, scope: !899)
!899 = distinct !DILexicalBlock(scope: !887, file: !3, line: 1003, column: 3)
!900 = !DILocation(line: 1006, column: 13, scope: !899)
!901 = !DILocation(line: 1007, column: 4, scope: !899)
!902 = !DILocation(line: 1010, column: 13, scope: !899)
!903 = !DILocation(line: 1011, column: 14, scope: !899)
!904 = !DILocation(line: 1012, column: 4, scope: !899)
!905 = !DILocation(line: 1015, column: 13, scope: !899)
!906 = !DILocation(line: 1016, column: 18, scope: !899)
!907 = !DILocation(line: 1017, column: 4, scope: !899)
!908 = !DILocation(line: 1021, column: 9, scope: !899)
!909 = !DILocation(line: 1022, column: 19, scope: !899)
!910 = !DILocation(line: 1023, column: 4, scope: !899)
!911 = !DILocation(line: 1026, column: 13, scope: !899)
!912 = !DILocation(line: 1027, column: 16, scope: !899)
!913 = !DILocation(line: 1028, column: 4, scope: !899)
!914 = !DILocation(line: 1031, column: 13, scope: !899)
!915 = !DILocation(line: 1032, column: 17, scope: !899)
!916 = !DILocation(line: 1033, column: 4, scope: !899)
!917 = !DILocation(line: 1036, column: 4, scope: !899)
!918 = !DILocation(line: 1037, column: 4, scope: !899)
!919 = !DILocation(line: 1039, column: 2, scope: !887)
!920 = distinct !DISubprogram(name: "ma_rayinfo", scope: !3, file: !3, line: 1044, type: !921, scopeLine: 1045, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !945)
!921 = !DISubroutineType(types: !922)
!922 = !{!24, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", file: !7, line: 625, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ray", file: !7, line: 611, size: 7104, elements: !926)
!926 = !{!927, !929, !930, !931, !932, !933, !934, !935, !936, !937, !941, !944}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !925, file: !7, line: 613, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !7, line: 301, baseType: !35)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !925, file: !7, line: 614, baseType: !34, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !925, file: !7, line: 614, baseType: !34, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !925, file: !7, line: 615, baseType: !116, size: 192, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !925, file: !7, line: 616, baseType: !116, size: 192, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !925, file: !7, line: 617, baseType: !34, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !925, file: !7, line: 618, baseType: !24, size: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ri_indx", scope: !925, file: !7, line: 619, baseType: !34, size: 64, offset: 704)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc3D", scope: !925, file: !7, line: 620, baseType: !128, size: 192, offset: 768)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rinfo", scope: !925, file: !7, line: 621, baseType: !938, size: 6080, offset: 960)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 6080, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 5)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !925, file: !7, line: 622, baseType: !942, size: 32, offset: 7040)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "R32", file: !7, line: 307, baseType: !943)
!943 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !925, file: !7, line: 623, baseType: !942, size: 32, offset: 7072)
!945 = !{!946, !947}
!946 = !DILocalVariable(name: "r", arg: 1, scope: !920, file: !3, line: 1044, type: !923)
!947 = !DILocalVariable(name: "p", scope: !920, file: !3, line: 1046, type: !24)
!948 = !DILocation(line: 0, scope: !920)
!949 = !DILocation(line: 1048, column: 9, scope: !950)
!950 = distinct !DILexicalBlock(scope: !920, file: !3, line: 1048, column: 6)
!951 = !DILocation(line: 1048, column: 21, scope: !950)
!952 = !DILocation(line: 1048, column: 6, scope: !920)
!953 = !DILocation(line: 1050, column: 11, scope: !954)
!954 = distinct !DILexicalBlock(scope: !950, file: !3, line: 1049, column: 3)
!955 = !DILocation(line: 1050, column: 3, scope: !954)
!956 = !DILocation(line: 1051, column: 3, scope: !954)
!957 = !DILocation(line: 1048, column: 17, scope: !950)
!958 = !DILocation(line: 1054, column: 20, scope: !920)
!959 = !DILocation(line: 1062, column: 13, scope: !920)
!960 = !DILocation(line: 1064, column: 2, scope: !920)
!961 = distinct !DISubprogram(name: "free_rayinfo", scope: !3, file: !3, line: 1069, type: !962, scopeLine: 1070, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !964)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !923}
!964 = !{!965}
!965 = !DILocalVariable(name: "r", arg: 1, scope: !961, file: !3, line: 1069, type: !923)
!966 = !DILocation(line: 0, scope: !961)
!967 = !DILocation(line: 1071, column: 5, scope: !961)
!968 = !DILocation(line: 1071, column: 13, scope: !961)
!969 = !DILocation(line: 1072, column: 2, scope: !961)
!970 = distinct !DISubprogram(name: "reset_rayinfo", scope: !3, file: !3, line: 1076, type: !962, scopeLine: 1077, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !971)
!971 = !{!972}
!972 = !DILocalVariable(name: "r", arg: 1, scope: !970, file: !3, line: 1076, type: !923)
!973 = !DILocation(line: 0, scope: !970)
!974 = !DILocation(line: 1078, column: 5, scope: !970)
!975 = !DILocation(line: 1078, column: 13, scope: !970)
!976 = !DILocation(line: 1079, column: 2, scope: !970)
!977 = distinct !DISubprogram(name: "ma_print", scope: !3, file: !3, line: 1083, type: !225, scopeLine: 1084, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !978)
!978 = !{!979, !980}
!979 = !DILocalVariable(name: "mem_total", scope: !977, file: !3, line: 1085, type: !34)
!980 = !DILocalVariable(name: "maxmem_total", scope: !977, file: !3, line: 1086, type: !34)
!981 = !DILocation(line: 1088, column: 18, scope: !977)
!982 = !DILocation(line: 1088, column: 29, scope: !977)
!983 = !DILocation(line: 1088, column: 45, scope: !977)
!984 = !DILocation(line: 0, scope: !977)
!985 = !DILocation(line: 1089, column: 18, scope: !977)
!986 = !DILocation(line: 1089, column: 30, scope: !977)
!987 = !DILocation(line: 1089, column: 28, scope: !977)
!988 = !DILocation(line: 1088, column: 27, scope: !977)
!989 = !DILocation(line: 1088, column: 43, scope: !977)
!990 = !DILocation(line: 1089, column: 15, scope: !977)
!991 = !DILocation(line: 1091, column: 18, scope: !977)
!992 = !DILocation(line: 1091, column: 32, scope: !977)
!993 = !DILocation(line: 1091, column: 51, scope: !977)
!994 = !DILocation(line: 1092, column: 18, scope: !977)
!995 = !DILocation(line: 1092, column: 33, scope: !977)
!996 = !DILocation(line: 1092, column: 31, scope: !977)
!997 = !DILocation(line: 1091, column: 30, scope: !977)
!998 = !DILocation(line: 1091, column: 49, scope: !977)
!999 = !DILocation(line: 1092, column: 15, scope: !977)
!1000 = !DILocation(line: 1094, column: 10, scope: !977)
!1001 = !DILocation(line: 1094, column: 2, scope: !977)
!1002 = !DILocation(line: 1095, column: 10, scope: !977)
!1003 = !DILocation(line: 1095, column: 2, scope: !977)
!1004 = !DILocation(line: 1096, column: 10, scope: !977)
