; ModuleID = 'multi.c'
source_filename = "multi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.multi_struct = type { [14 x [8194 x [8194 x double]]], [14 x [8194 x [8194 x double]]], double, i64, [1024 x i64] }
%struct.bars_struct = type { %struct.anon, %struct.anon.3, %struct.anon.4, %struct.anon.5, %struct.anon.6, %struct.anon.7, %struct.anon.8, %struct.anon.9, %struct.anon.10, %struct.anon.11, %struct.anon.12, %struct.anon.13, %struct.anon.14, %struct.anon.15, %struct.anon.16, %struct.anon.17, %struct.anon.18, %struct.anon.19, %struct.anon.20, %struct.anon.21 }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%struct.anon.3 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%struct.anon.4 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%struct.anon.5 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%struct.anon.6 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }

!142 = !DILocation(line: 131, column: 31, scope: !121)
!143 = !DILocation(line: 131, column: 1, scope: !121)
!144 = !DILocation(line: 134, column: 16, scope: !40)
!145 = !DILocation(line: 134, column: 23, scope: !40)
!146 = !DILocation(line: 140, column: 23, scope: !147)
!147 = distinct !DILexicalBlock(scope: !40, file: !1, line: 139, column: 6)
!148 = !DILocation(line: 140, column: 29, scope: !147)
!149 = !DILocation(line: 140, column: 1, scope: !147)
!150 = !DILocation(line: 141, column: 2, scope: !147)
!151 = !DILocation(line: 141, column: 23, scope: !147)
!152 = !DILocation(line: 141, column: 33, scope: !147)
!153 = !DILocation(line: 142, column: 5, scope: !154)
!154 = distinct !DILexicalBlock(scope: !147, file: !1, line: 142, column: 5)
!155 = !DILocation(line: 142, column: 42, scope: !154)
!156 = !DILocation(line: 142, column: 38, scope: !154)
!157 = !DILocation(line: 142, column: 5, scope: !147)
!158 = !DILocation(line: 143, column: 35, scope: !159)
!159 = distinct !DILexicalBlock(scope: !154, file: !1, line: 142, column: 51)
!160 = !DILocation(line: 144, column: 49, scope: !159)
!161 = !DILocation(line: 144, column: 2, scope: !159)
!162 = !DILocation(line: 145, column: 1, scope: !159)
!163 = !DILocation(line: 142, column: 12, scope: !154)
!164 = !DILocation(line: 146, column: 44, scope: !165)
!165 = distinct !DILexicalBlock(scope: !154, file: !1, line: 145, column: 8)
!166 = !DILocation(line: 146, column: 2, scope: !165)
!167 = !DILocation(line: 148, column: 25, scope: !147)
!168 = !DILocation(line: 148, column: 31, scope: !147)
!169 = !DILocation(line: 148, column: 1, scope: !147)
!170 = !DILocation(line: 151, column: 21, scope: !171)
!171 = distinct !DILexicalBlock(scope: !40, file: !1, line: 151, column: 10)
!172 = !DILocation(line: 151, column: 18, scope: !171)
!173 = !DILocation(line: 151, column: 10, scope: !40)
!174 = !DILocation(line: 152, column: 15, scope: !175)
!175 = distinct !DILexicalBlock(scope: !176, file: !1, line: 152, column: 12)
!176 = distinct !DILexicalBlock(scope: !171, file: !1, line: 151, column: 33)
!177 = !DILocation(line: 152, column: 12, scope: !176)
!178 = !DILocation(line: 155, column: 18, scope: !179)
!179 = distinct !DILexicalBlock(scope: !175, file: !1, line: 152, column: 23)
!180 = !DILocation(line: 155, column: 10, scope: !179)
!181 = !DILocation(line: 156, column: 10, scope: !179)
!182 = !DILocation(line: 159, column: 23, scope: !183)
!183 = distinct !DILexicalBlock(scope: !184, file: !1, line: 159, column: 14)
!184 = distinct !DILexicalBlock(scope: !175, file: !1, line: 157, column: 15)
!185 = distinct !{!185, !38, !186, !187, !188}
!186 = !DILocation(line: 182, column: 4, scope: !11)
!187 = !{!"llvm.loop.mustprogress"}
!188 = !{!"llvm.loop.unroll.disable"}
!189 = !DILocation(line: 159, column: 34, scope: !183)
!190 = !DILocation(line: 159, column: 40, scope: !183)
!191 = !DILocation(line: 159, column: 48, scope: !183)
!192 = !DILocation(line: 161, column: 12, scope: !193)
!193 = distinct !DILexicalBlock(scope: !183, file: !1, line: 159, column: 67)
!194 = !DILocation(line: 163, column: 31, scope: !193)
!195 = !DILocation(line: 163, column: 21, scope: !193)
!196 = !DILocation(line: 163, column: 12, scope: !193)
!197 = !DILocation(line: 163, column: 25, scope: !193)
!198 = !DILocation(line: 165, column: 12, scope: !193)
!199 = !DILocation(line: 168, column: 10, scope: !193)
!200 = !DILocation(line: 172, column: 14, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !1, line: 172, column: 12)
!202 = distinct !DILexicalBlock(scope: !171, file: !1, line: 170, column: 13)
!203 = !DILocation(line: 172, column: 12, scope: !202)
!204 = !DILocation(line: 177, column: 10, scope: !205)
!205 = distinct !DILexicalBlock(scope: !201, file: !1, line: 175, column: 15)
!206 = !DILocation(line: 178, column: 11, scope: !205)
!207 = !DILocation(line: 183, column: 8, scope: !208)
!208 = distinct !DILexicalBlock(scope: !11, file: !1, line: 183, column: 8)
!209 = !DILocation(line: 183, column: 8, scope: !11)
!210 = !DILocation(line: 185, column: 83, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !1, line: 184, column: 28)
!212 = distinct !DILexicalBlock(scope: !213, file: !1, line: 184, column: 10)
!213 = distinct !DILexicalBlock(scope: !208, file: !1, line: 183, column: 19)
!214 = !DILocation(line: 185, column: 90, scope: !211)
!215 = !DILocation(line: 185, column: 8, scope: !211)
!216 = !DILocation(line: 186, column: 6, scope: !211)
!217 = !DILocation(line: 188, column: 1, scope: !11)
!218 = !DISubprogram(name: "pthread_mutex_lock", scope: !219, file: !219, line: 738, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !255)
!219 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!220 = !DISubroutineType(types: !221)
!221 = !{!222, !223}
!222 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !225, line: 72, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !225, line: 67, size: 320, elements: !227)
!227 = !{!228, !249, !254}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !226, file: !225, line: 69, baseType: !229, size: 320)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !230, line: 22, size: 320, elements: !231)
!230 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!231 = !{!232, !233, !235, !236, !237, !238, !240, !241}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !229, file: !230, line: 24, baseType: !222, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !229, file: !230, line: 25, baseType: !234, size: 32, offset: 32)
!234 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !229, file: !230, line: 26, baseType: !222, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !229, file: !230, line: 28, baseType: !234, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !229, file: !230, line: 32, baseType: !222, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !229, file: !230, line: 34, baseType: !239, size: 16, offset: 160)
!239 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !229, file: !230, line: 35, baseType: !239, size: 16, offset: 176)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !229, file: !230, line: 36, baseType: !242, size: 128, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !243, line: 53, baseType: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !243, line: 49, size: 128, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !244, file: !243, line: 51, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !244, file: !243, line: 52, baseType: !247, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !226, file: !225, line: 70, baseType: !250, size: 320)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 320, elements: !252)
!251 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!252 = !{!253}
!253 = !DISubrange(count: 40)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !226, file: !225, line: 71, baseType: !14, size: 64)
!255 = !{}
!256 = !DISubprogram(name: "pthread_cond_broadcast", scope: !219, file: !219, line: 978, type: !257, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !255)
!257 = !DISubroutineType(types: !258)
!258 = !{!222, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !225, line: 80, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !225, line: 75, size: 384, elements: !262)
!262 = !{!263, !293, !297}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !261, file: !225, line: 77, baseType: !264, size: 384)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !243, line: 92, size: 384, elements: !265)
!265 = !{!266, !276, !285, !289, !290, !291, !292}
!266 = !DIDerivedType(tag: DW_TAG_member, scope: !264, file: !243, line: 94, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !264, file: !243, line: 94, size: 64, elements: !268)
!268 = !{!269, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !267, file: !243, line: 96, baseType: !270, size: 64)
!270 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !267, file: !243, line: 101, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !267, file: !243, line: 97, size: 64, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !272, file: !243, line: 99, baseType: !234, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !272, file: !243, line: 100, baseType: !234, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !264, file: !243, line: 103, baseType: !277, size: 64, offset: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !264, file: !243, line: 103, size: 64, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !277, file: !243, line: 105, baseType: !270, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !277, file: !243, line: 110, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !277, file: !243, line: 106, size: 64, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !281, file: !243, line: 108, baseType: !234, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !281, file: !243, line: 109, baseType: !234, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !264, file: !243, line: 112, baseType: !286, size: 64, offset: 128)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 64, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 2)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !264, file: !243, line: 113, baseType: !286, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !264, file: !243, line: 114, baseType: !234, size: 32, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !264, file: !243, line: 115, baseType: !234, size: 32, offset: 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !264, file: !243, line: 116, baseType: !286, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !261, file: !225, line: 78, baseType: !294, size: 384)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 384, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 48)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !261, file: !225, line: 79, baseType: !298, size: 64)
!298 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!299 = !DISubprogram(name: "pthread_cond_wait", scope: !219, file: !219, line: 986, type: !300, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !255)
!300 = !DISubroutineType(types: !301)
!301 = !{!222, !302, !303}
!302 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !259)
!303 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !223)
!304 = !DISubprogram(name: "pthread_mutex_unlock", scope: !219, file: !219, line: 756, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !255)
!305 = distinct !DISubprogram(name: "relax", scope: !1, file: !1, line: 191, type: !306, scopeLine: 192, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !309)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !14, !308, !14, !14}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!310 = !DILocalVariable(name: "k", arg: 1, scope: !305, file: !1, line: 191, type: !14)
!311 = !DILocalVariable(name: "err", arg: 2, scope: !305, file: !1, line: 191, type: !308)
!312 = !DILocalVariable(name: "color", arg: 3, scope: !305, file: !1, line: 191, type: !14)
!313 = !DILocalVariable(name: "my_num", arg: 4, scope: !305, file: !1, line: 191, type: !14)
!314 = !DILocalVariable(name: "i", scope: !305, file: !1, line: 193, type: !14)
!315 = !DILocalVariable(name: "j", scope: !305, file: !1, line: 194, type: !14)
!316 = !DILocalVariable(name: "iend", scope: !305, file: !1, line: 195, type: !14)
!317 = !DILocalVariable(name: "jend", scope: !305, file: !1, line: 196, type: !14)
!318 = !DILocalVariable(name: "oddistart", scope: !305, file: !1, line: 197, type: !14)
!319 = !DILocalVariable(name: "oddjstart", scope: !305, file: !1, line: 198, type: !14)
!320 = !DILocalVariable(name: "evenistart", scope: !305, file: !1, line: 199, type: !14)
!321 = !DILocalVariable(name: "evenjstart", scope: !305, file: !1, line: 200, type: !14)
!322 = !DILocalVariable(name: "oddiendst", scope: !305, file: !1, line: 201, type: !14)
!323 = !DILocalVariable(name: "eveniendst", scope: !305, file: !1, line: 202, type: !14)
!324 = !DILocalVariable(name: "oddjendst", scope: !305, file: !1, line: 203, type: !14)
!325 = !DILocalVariable(name: "evenjendst", scope: !305, file: !1, line: 204, type: !14)
!326 = !DILocalVariable(name: "a", scope: !305, file: !1, line: 205, type: !3)
!327 = !DILocalVariable(name: "h", scope: !305, file: !1, line: 206, type: !3)
!328 = !DILocalVariable(name: "factor", scope: !305, file: !1, line: 207, type: !3)
!329 = !DILocalVariable(name: "maxerr", scope: !305, file: !1, line: 208, type: !3)
!330 = !DILocalVariable(name: "newerr", scope: !305, file: !1, line: 209, type: !3)
!331 = !DILocalVariable(name: "oldval", scope: !305, file: !1, line: 210, type: !3)
!332 = !DILocalVariable(name: "newval", scope: !305, file: !1, line: 211, type: !3)
!333 = !DILocation(line: 0, scope: !305)
!334 = !DILocation(line: 216, column: 9, scope: !305)
!335 = !DILocation(line: 217, column: 8, scope: !305)
!336 = !DILocation(line: 222, column: 17, scope: !305)
!337 = !DILocation(line: 223, column: 17, scope: !305)
!338 = !DILocation(line: 224, column: 16, scope: !305)
!339 = !DILocation(line: 225, column: 16, scope: !305)
