; ModuleID = 'normal.c'
source_filename = "normal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalMemory = type { i64, [1025 x [256 x i64]], %struct.anon, %struct.anon.3, %union.pthread_mutex_t, %union.pthread_mutex_t, [1025 x %union.pthread_mutex_t] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%struct.anon.3 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

@map_len = external local_unnamed_addr global [3 x i16], align 2
@norm_len = dso_local global [3 x i16] zeroinitializer, align 2, !dbg !0
@norm_length = dso_local global i32 0, align 4, !dbg !18
@norm_address = dso_local global ptr null, align 8, !dbg !21
@Global = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [43 x i8] c"    Allocating normal map of %ld bytes...\0A\00", align 1
@.str.2 = private unnamed_addr constant [33 x i8] c"    No space available for map.\0A\00", align 1

!137 = !DILocation(line: 153, column: 18, scope: !96)
!138 = !DILocation(line: 153, column: 16, scope: !96)
!139 = !DILocation(line: 155, column: 16, scope: !96)
!140 = !DILocation(line: 156, column: 16, scope: !96)
!141 = !DILocation(line: 157, column: 16, scope: !96)
!142 = !DILocation(line: 162, column: 11, scope: !96)
!143 = !DILocation(line: 164, column: 11, scope: !96)
!144 = !DILocation(line: 172, column: 11, scope: !96)
!145 = !DILocation(line: 175, column: 25, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !3, line: 175, column: 3)
!147 = distinct !DILexicalBlock(scope: !96, file: !3, line: 175, column: 3)
!148 = !DILocation(line: 175, column: 3, scope: !147)
!149 = !DILocation(line: 176, column: 5, scope: !150)
!150 = distinct !DILexicalBlock(scope: !151, file: !3, line: 176, column: 5)
!151 = distinct !DILexicalBlock(scope: !146, file: !3, line: 175, column: 41)
!152 = !DILocation(line: 177, column: 7, scope: !153)
!153 = distinct !DILexicalBlock(scope: !154, file: !3, line: 177, column: 7)
!154 = distinct !DILexicalBlock(scope: !155, file: !3, line: 176, column: 43)
!155 = distinct !DILexicalBlock(scope: !150, file: !3, line: 176, column: 5)
!156 = !DILocation(line: 179, column: 14, scope: !157)
!157 = distinct !DILexicalBlock(scope: !158, file: !3, line: 177, column: 45)
!158 = distinct !DILexicalBlock(scope: !153, file: !3, line: 177, column: 7)
!159 = !DILocation(line: 184, column: 25, scope: !157)
!160 = !DILocation(line: 184, column: 19, scope: !157)
!161 = !DILocation(line: 184, column: 52, scope: !157)
!162 = !DILocation(line: 184, column: 46, scope: !157)
!163 = !DILocation(line: 184, column: 44, scope: !157)
!164 = !DILocation(line: 184, column: 10, scope: !157)
!165 = !DILocation(line: 185, column: 25, scope: !157)
!166 = !DILocation(line: 185, column: 19, scope: !157)
!167 = !DILocation(line: 185, column: 52, scope: !157)
!168 = !DILocation(line: 185, column: 46, scope: !157)
!169 = !DILocation(line: 185, column: 44, scope: !157)
!170 = !DILocation(line: 185, column: 10, scope: !157)
!171 = !DILocation(line: 186, column: 25, scope: !157)
!172 = !DILocation(line: 186, column: 19, scope: !157)
!173 = !DILocation(line: 186, column: 52, scope: !157)
!174 = !DILocation(line: 186, column: 46, scope: !157)
!175 = !DILocation(line: 186, column: 44, scope: !157)
!176 = !DILocation(line: 186, column: 10, scope: !157)
!177 = !DILocation(line: 191, column: 31, scope: !157)
!178 = !DILocation(line: 191, column: 25, scope: !157)
!179 = !DILocation(line: 191, column: 37, scope: !157)
!180 = !DILocation(line: 193, column: 23, scope: !157)
!181 = !DILocation(line: 194, column: 16, scope: !182)
!182 = distinct !DILexicalBlock(scope: !157, file: !3, line: 194, column: 6)
!183 = !DILocation(line: 194, column: 6, scope: !157)
!184 = !DILocation(line: 195, column: 32, scope: !185)
!185 = distinct !DILexicalBlock(scope: !182, file: !3, line: 194, column: 25)
!186 = !DILocation(line: 195, column: 31, scope: !185)
!187 = !DILocation(line: 196, column: 13, scope: !188)
!188 = distinct !DILexicalBlock(scope: !185, file: !3, line: 196, column: 8)
!189 = !DILocation(line: 196, column: 28, scope: !188)
!190 = !DILocation(line: 198, column: 24, scope: !185)
!191 = !DILocation(line: 198, column: 12, scope: !185)
!192 = !DILocation(line: 199, column: 24, scope: !185)
!193 = !DILocation(line: 199, column: 12, scope: !185)
!194 = !DILocation(line: 200, column: 26, scope: !185)
!195 = !DILocation(line: 201, column: 2, scope: !185)
!196 = !DILocation(line: 0, scope: !182)
!197 = !DILocation(line: 177, column: 29, scope: !158)
!198 = distinct !{!198, !152, !199, !53, !54}
!199 = !DILocation(line: 205, column: 7, scope: !153)
!200 = !DILocation(line: 176, column: 27, scope: !155)
!201 = distinct !{!201, !149, !202, !53, !54}
!202 = !DILocation(line: 206, column: 5, scope: !150)
!203 = distinct !{!203, !148, !204, !53, !54}
!204 = !DILocation(line: 207, column: 3, scope: !147)
!205 = !DILocation(line: 222, column: 1, scope: !96)
!206 = !DISubprogram(name: "Error", scope: !207, file: !207, line: 187, type: !208, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!207 = !DIFile(filename: "./global.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/volrend", checksumkind: CSK_MD5, checksum: "f049690031a7f12768b0765e4f4983eb")
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210, null}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!212 = !{}
!213 = !DISubprogram(name: "pthread_mutex_lock", scope: !214, file: !214, line: 738, type: !215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!214 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!215 = !DISubroutineType(types: !216)
!216 = !{!20, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !219, line: 72, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!220 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !219, line: 67, size: 320, elements: !221)
!221 = !{!222, !242, !246}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !220, file: !219, line: 69, baseType: !223, size: 320)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !224, line: 22, size: 320, elements: !225)
!224 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!225 = !{!226, !227, !229, !230, !231, !232, !233, !234}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !223, file: !224, line: 24, baseType: !20, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !223, file: !224, line: 25, baseType: !228, size: 32, offset: 32)
!228 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !223, file: !224, line: 26, baseType: !20, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !223, file: !224, line: 28, baseType: !228, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !223, file: !224, line: 32, baseType: !20, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !223, file: !224, line: 34, baseType: !8, size: 16, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !223, file: !224, line: 35, baseType: !8, size: 16, offset: 176)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !223, file: !224, line: 36, baseType: !235, size: 128, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !236, line: 53, baseType: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !236, line: 49, size: 128, elements: !238)
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !237, file: !236, line: 51, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !237, file: !236, line: 52, baseType: !240, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !220, file: !219, line: 70, baseType: !243, size: 320)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 320, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 40)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !220, file: !219, line: 71, baseType: !10, size: 64)
!247 = !DISubprogram(name: "pthread_mutex_unlock", scope: !214, file: !214, line: 756, type: !215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!248 = distinct !DISubprogram(name: "Load_Normal", scope: !3, file: !3, line: 225, type: !249, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !251)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !210}
!251 = !{!252, !253, !257}
!252 = !DILocalVariable(name: "filename", arg: 1, scope: !248, file: !3, line: 226, type: !210)
!253 = !DILocalVariable(name: "local_filename", scope: !248, file: !3, line: 228, type: !254)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 1608, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 201)
!257 = !DILocalVariable(name: "fd", scope: !248, file: !3, line: 229, type: !20)
!258 = !DILocation(line: 0, scope: !248)
!259 = !DILocation(line: 228, column: 3, scope: !248)
!260 = !DILocation(line: 228, column: 8, scope: !248)
!261 = !DILocation(line: 231, column: 3, scope: !248)
!262 = !DILocation(line: 232, column: 3, scope: !248)
!263 = !DILocation(line: 233, column: 8, scope: !248)
!264 = !DILocation(line: 235, column: 3, scope: !248)
!265 = !DILocation(line: 236, column: 7, scope: !266)
!266 = distinct !DILexicalBlock(scope: !248, file: !3, line: 236, column: 7)
!267 = !DILocation(line: 236, column: 20, scope: !266)
!268 = !DILocation(line: 236, column: 7, scope: !248)
!269 = !DILocation(line: 237, column: 5, scope: !266)
!270 = !DILocation(line: 239, column: 3, scope: !248)
!271 = !DILocation(line: 241, column: 3, scope: !248)
!272 = !DILocation(line: 243, column: 33, scope: !248)
!273 = !DILocation(line: 243, column: 3, scope: !248)
!274 = !DILocation(line: 245, column: 3, scope: !248)
!275 = !DILocation(line: 246, column: 35, scope: !248)
!276 = !DILocation(line: 246, column: 55, scope: !248)
!277 = !DILocation(line: 246, column: 66, scope: !248)
!278 = !DILocation(line: 246, column: 3, scope: !248)
!279 = !DILocation(line: 247, column: 10, scope: !248)
!280 = !DILocation(line: 247, column: 3, scope: !248)
!281 = !DILocation(line: 248, column: 3, scope: !248)
!282 = !DILocation(line: 249, column: 1, scope: !248)
!283 = !DISubprogram(name: "Open_File", scope: !207, file: !207, line: 174, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!284 = !DISubroutineType(types: !285)
!285 = !{!20, !210}
!286 = !DISubprogram(name: "Read_Shorts", scope: !207, file: !207, line: 179, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !20, !13, !10}
!289 = !DISubprogram(name: "Read_Longs", scope: !207, file: !207, line: 180, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!290 = !DISubprogram(name: "fflush", scope: !291, file: !291, line: 218, type: !292, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!291 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!292 = !DISubroutineType(types: !293)
!293 = !{!20, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !296, line: 7, baseType: !297)
!296 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !298, line: 49, size: 1728, elements: !299)
!298 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !315, !317, !318, !319, !322, !324, !326, !330, !333, !335, !338, !341, !342, !343, !347, !348}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !297, file: !298, line: 51, baseType: !20, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !297, file: !298, line: 54, baseType: !210, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !297, file: !298, line: 55, baseType: !210, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !297, file: !298, line: 56, baseType: !210, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !297, file: !298, line: 57, baseType: !210, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !297, file: !298, line: 58, baseType: !210, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !297, file: !298, line: 59, baseType: !210, size: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !297, file: !298, line: 60, baseType: !210, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !297, file: !298, line: 61, baseType: !210, size: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !297, file: !298, line: 64, baseType: !210, size: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !297, file: !298, line: 65, baseType: !210, size: 64, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !297, file: !298, line: 66, baseType: !210, size: 64, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !297, file: !298, line: 68, baseType: !313, size: 64, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !298, line: 36, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !297, file: !298, line: 70, baseType: !316, size: 64, offset: 832)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !297, file: !298, line: 72, baseType: !20, size: 32, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !297, file: !298, line: 73, baseType: !20, size: 32, offset: 928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !297, file: !298, line: 74, baseType: !320, size: 64, offset: 960)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !321, line: 152, baseType: !10)
!321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !297, file: !298, line: 77, baseType: !323, size: 16, offset: 1024)
!323 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !297, file: !298, line: 78, baseType: !325, size: 8, offset: 1040)
!325 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !297, file: !298, line: 79, baseType: !327, size: 8, offset: 1048)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 8, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 1)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !297, file: !298, line: 81, baseType: !331, size: 64, offset: 1088)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !298, line: 43, baseType: null)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !297, file: !298, line: 89, baseType: !334, size: 64, offset: 1152)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !321, line: 153, baseType: !10)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !297, file: !298, line: 91, baseType: !336, size: 64, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !298, line: 37, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !297, file: !298, line: 92, baseType: !339, size: 64, offset: 1280)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !298, line: 38, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !297, file: !298, line: 93, baseType: !316, size: 64, offset: 1344)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !297, file: !298, line: 94, baseType: !9, size: 64, offset: 1408)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !297, file: !298, line: 95, baseType: !344, size: 64, offset: 1472)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !345, line: 46, baseType: !346)
!345 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!346 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !297, file: !298, line: 96, baseType: !20, size: 32, offset: 1536)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !297, file: !298, line: 98, baseType: !349, size: 160, offset: 1568)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 160, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 20)
!352 = !DISubprogram(name: "Close_File", scope: !207, file: !207, line: 181, type: !353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !20}
!355 = distinct !DISubprogram(name: "Store_Normal", scope: !3, file: !3, line: 252, type: !249, scopeLine: 254, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !356)
!356 = !{!357, !358, !359}
!357 = !DILocalVariable(name: "filename", arg: 1, scope: !355, file: !3, line: 253, type: !210)
!358 = !DILocalVariable(name: "local_filename", scope: !355, file: !3, line: 255, type: !254)
!359 = !DILocalVariable(name: "fd", scope: !355, file: !3, line: 256, type: !20)
!360 = !DILocation(line: 0, scope: !355)
!361 = !DILocation(line: 255, column: 3, scope: !355)
!362 = !DILocation(line: 255, column: 8, scope: !355)
!363 = !DILocation(line: 258, column: 3, scope: !355)
!364 = !DILocation(line: 259, column: 3, scope: !355)
!365 = !DILocation(line: 260, column: 8, scope: !355)
!366 = !DILocation(line: 262, column: 16, scope: !355)
!367 = !DILocation(line: 263, column: 3, scope: !355)
!368 = !DILocation(line: 264, column: 3, scope: !355)
!369 = !DILocation(line: 265, column: 8, scope: !355)
!370 = !DILocation(line: 266, column: 3, scope: !355)
!371 = !DILocation(line: 268, column: 3, scope: !355)
!372 = !DILocation(line: 269, column: 3, scope: !355)
!373 = !DILocation(line: 271, column: 3, scope: !355)
!374 = !DILocation(line: 272, column: 36, scope: !355)
!375 = !DILocation(line: 272, column: 56, scope: !355)
!376 = !DILocation(line: 272, column: 67, scope: !355)
!377 = !DILocation(line: 272, column: 3, scope: !355)
!378 = !DILocation(line: 273, column: 3, scope: !355)
!379 = !DILocation(line: 274, column: 1, scope: !355)
!380 = !DISubprogram(name: "Create_File", scope: !207, file: !207, line: 173, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!381 = !DISubprogram(name: "Write_Shorts", scope: !207, file: !207, line: 176, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!382 = !DISubprogram(name: "Write_Longs", scope: !207, file: !207, line: 177, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !212)
!383 = distinct !DISubprogram(name: "Deallocate_Normal", scope: !3, file: !3, line: 277, type: !384, scopeLine: 279, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !71}
!386 = !{!387}
!387 = !DILocalVariable(name: "address", arg: 1, scope: !383, file: !3, line: 278, type: !71)
!388 = !DILocation(line: 0, scope: !383)
!389 = !DILocation(line: 280, column: 3, scope: !383)
!390 = !DILocation(line: 284, column: 12, scope: !383)
!391 = !DILocation(line: 285, column: 1, scope: !383)
