; ModuleID = 'numLL.c'
source_filename = "numLL.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMatrix = type { i64, ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, i64, i64, ptr, ptr }
%struct.LocalCopies = type { ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%union.Entry = type { ptr }

@LB = external local_unnamed_addr global %struct.BMatrix, align 8
@firstchild = external local_unnamed_addr global ptr, align 8
@child = external local_unnamed_addr global ptr, align 8
@node = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [29 x i8] c"Negative pivot, d[%ld] = %f\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @FactorLLDomain(i64 noundef %which_domain, i64 noundef %MyNum, ptr noundef %lc) local_unnamed_addr #0 !dbg !14 {
entry:
  call void @llvm.dbg.value(metadata i64 %which_domain, metadata !62, metadata !DIExpression()), !dbg !94
  call void @llvm.dbg.value(metadata i64 %MyNum, metadata !63, metadata !DIExpression()), !dbg !94
  call void @llvm.dbg.value(metadata ptr %lc, metadata !64, metadata !DIExpression()), !dbg !94
  %0 = load i64, ptr @LB, align 8, !dbg !95
  %mul = shl i64 %0, 3, !dbg !96
  %call = tail call ptr @MyMalloc(i64 noundef %mul, i64 noundef %MyNum) #10, !dbg !97

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "numLL.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/cholesky", checksumkind: CSK_MD5, checksum: "4a9c988baf84b240e97a6c099b3ee712")
!2 = !{!3, !5}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!7 = !{i32 7, !"Dwarf Version", i32 5}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 1, !"wchar_size", i32 4}
!10 = !{i32 7, !"PIC Level", i32 2}
!11 = !{i32 7, !"PIE Level", i32 2}
!12 = !{i32 7, !"uwtable", i32 2}
!13 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!14 = distinct !DISubprogram(name: "FactorLLDomain", scope: !1, file: !1, line: 48, type: !15, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !61)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !4, !4, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocalCopies", file: !19, line: 92, size: 1088, elements: !20)
!19 = !DIFile(filename: "./matrix.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/cholesky", checksumkind: CSK_MD5, checksum: "f19fdb19034f8f693c291706633e8f13")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !42, !52, !54, !55, !56, !57, !58, !59, !60}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "blktmp", scope: !18, file: !19, line: 93, baseType: !5, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "max_panel", scope: !18, file: !19, line: 94, baseType: !4, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !18, file: !19, line: 95, baseType: !3, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !18, file: !19, line: 96, baseType: !3, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !18, file: !19, line: 97, baseType: !5, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "updatetmp", scope: !18, file: !19, line: 98, baseType: !5, size: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !18, file: !19, line: 99, baseType: !3, size: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "freeUpdate", scope: !18, file: !19, line: 100, baseType: !29, size: 64, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Update", file: !19, line: 65, size: 640, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !30, file: !19, line: 66, baseType: !4, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !30, file: !19, line: 66, baseType: !4, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !30, file: !19, line: 66, baseType: !4, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !30, file: !19, line: 66, baseType: !4, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "dimi", scope: !30, file: !19, line: 67, baseType: !4, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "dimj", scope: !30, file: !19, line: 67, baseType: !4, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "structi", scope: !30, file: !19, line: 67, baseType: !3, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "structj", scope: !30, file: !19, line: 67, baseType: !3, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !30, file: !19, line: 68, baseType: !5, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !19, line: 69, baseType: !29, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "freeTask", scope: !18, file: !19, line: 101, baseType: !43, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Task", file: !19, line: 72, size: 384, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !44, file: !19, line: 73, baseType: !4, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "desti", scope: !44, file: !19, line: 73, baseType: !4, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "destj", scope: !44, file: !19, line: 73, baseType: !4, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !44, file: !19, line: 73, baseType: !4, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !44, file: !19, line: 74, baseType: !29, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !19, line: 75, baseType: !43, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !18, file: !19, line: 102, baseType: !53, size: 64, offset: 576)
!53 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !18, file: !19, line: 103, baseType: !53, size: 64, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !18, file: !19, line: 104, baseType: !53, size: 64, offset: 704)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "uf", scope: !18, file: !19, line: 105, baseType: !53, size: 64, offset: 768)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !18, file: !19, line: 106, baseType: !53, size: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !18, file: !19, line: 107, baseType: !53, size: 64, offset: 896)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !18, file: !19, line: 108, baseType: !53, size: 64, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "runs", scope: !18, file: !19, line: 109, baseType: !53, size: 64, offset: 1024)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !88, !89, !93}
!62 = !DILocalVariable(name: "which_domain", arg: 1, scope: !14, file: !1, line: 48, type: !4)
!63 = !DILocalVariable(name: "MyNum", arg: 2, scope: !14, file: !1, line: 48, type: !4)
!64 = !DILocalVariable(name: "lc", arg: 3, scope: !14, file: !1, line: 48, type: !17)
!65 = !DILocalVariable(name: "i", scope: !14, file: !1, line: 50, type: !4)
!66 = !DILocalVariable(name: "start", scope: !14, file: !1, line: 50, type: !4)
!67 = !DILocalVariable(name: "root", scope: !14, file: !1, line: 50, type: !4)
!68 = !DILocalVariable(name: "j", scope: !14, file: !1, line: 51, type: !4)
!69 = !DILocalVariable(name: "j_last", scope: !14, file: !1, line: 51, type: !4)
!70 = !DILocalVariable(name: "j_len", scope: !14, file: !1, line: 51, type: !4)
!71 = !DILocalVariable(name: "dest_super", scope: !14, file: !1, line: 51, type: !4)
!72 = !DILocalVariable(name: "k", scope: !14, file: !1, line: 52, type: !4)
!73 = !DILocalVariable(name: "k_length", scope: !14, file: !1, line: 52, type: !4)
!74 = !DILocalVariable(name: "update_size", scope: !14, file: !1, line: 52, type: !4)
!75 = !DILocalVariable(name: "theFirst", scope: !14, file: !1, line: 53, type: !4)
!76 = !DILocalVariable(name: "theLast", scope: !14, file: !1, line: 53, type: !4)
!77 = !DILocalVariable(name: "relative", scope: !14, file: !1, line: 54, type: !3)
!78 = !DILocalVariable(name: "indices", scope: !14, file: !1, line: 54, type: !3)
!79 = !DILocalVariable(name: "domain_update", scope: !14, file: !1, line: 55, type: !5)
!80 = !DILocalVariable(name: "s", scope: !81, file: !1, line: 118, type: !4)
!81 = distinct !DILexicalBlock(scope: !82, file: !1, line: 118, column: 2)
!82 = distinct !DILexicalBlock(scope: !83, file: !1, line: 112, column: 31)
!83 = distinct !DILexicalBlock(scope: !84, file: !1, line: 112, column: 11)
!84 = distinct !DILexicalBlock(scope: !85, file: !1, line: 78, column: 31)
!85 = distinct !DILexicalBlock(scope: !86, file: !1, line: 71, column: 38)
!86 = distinct !DILexicalBlock(scope: !87, file: !1, line: 71, column: 3)
!87 = distinct !DILexicalBlock(scope: !14, file: !1, line: 71, column: 3)
!88 = !DILocalVariable(name: "n", scope: !81, file: !1, line: 118, type: !4)
!89 = !DILocalVariable(name: "s", scope: !90, file: !1, line: 131, type: !4)
!90 = distinct !DILexicalBlock(scope: !91, file: !1, line: 131, column: 7)
!91 = distinct !DILexicalBlock(scope: !92, file: !1, line: 125, column: 31)
!92 = distinct !DILexicalBlock(scope: !85, file: !1, line: 125, column: 9)
!93 = !DILocalVariable(name: "n", scope: !90, file: !1, line: 131, type: !4)
!94 = !DILocation(line: 0, scope: !14)
!95 = !DILocation(line: 58, column: 35, scope: !14)
!96 = !DILocation(line: 58, column: 36, scope: !14)
!97 = !DILocation(line: 58, column: 23, scope: !14)
!98 = !DILocation(line: 59, column: 34, scope: !14)
!99 = !DILocation(line: 59, column: 35, scope: !14)
!100 = !DILocation(line: 59, column: 22, scope: !14)
!101 = !DILocation(line: 61, column: 13, scope: !14)
!102 = !DILocation(line: 61, column: 10, scope: !14)
!103 = !DILocation(line: 64, column: 10, scope: !14)
!104 = !DILocation(line: 64, column: 47, scope: !14)
!105 = !DILocation(line: 64, column: 31, scope: !14)
!106 = !DILocation(line: 64, column: 28, scope: !14)
!107 = !DILocation(line: 64, column: 3, scope: !14)
!108 = !DILocation(line: 67, column: 7, scope: !14)
!109 = !DILocation(line: 67, column: 3, scope: !14)
!110 = !DILocation(line: 67, column: 20, scope: !14)
!111 = !DILocation(line: 71, column: 3, scope: !87)
!112 = !DILocation(line: 65, column: 13, scope: !14)
!113 = distinct !{!113, !107, !114, !115, !116}
!114 = !DILocation(line: 65, column: 36, scope: !14)
!115 = !{!"llvm.loop.mustprogress"}
!116 = !{!"llvm.loop.unroll.disable"}
!117 = !DILocation(line: 71, column: 18, scope: !86)
