; ModuleID = 'octree.c'
source_filename = "octree.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalMemory = type { i64, [1025 x [256 x i64]], %struct.anon, %struct.anon.3, %union.pthread_mutex_t, %union.pthread_mutex_t, [1025 x %union.pthread_mutex_t] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%struct.anon.3 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

@opc_len = external local_unnamed_addr global [3 x i16], align 2
@pyr_levels = dso_local global i16 0, align 2, !dbg !0
@.str = private unnamed_addr constant [46 x i8] c"    Computing binary pyramid of %d levels...\0A\00", align 1
@pyr_len = dso_local global [10 x [3 x i16]] zeroinitializer, align 16, !dbg !18
@pyr_voxlen = dso_local global [10 x [3 x i16]] zeroinitializer, align 16, !dbg !24
@pyr_length = dso_local global [10 x i32] zeroinitializer, align 16, !dbg !26

!312 = !DILocation(line: 0, scope: !277)
!313 = distinct !{!313, !293, !314, !64, !65}
!314 = !DILocation(line: 315, column: 7, scope: !287)
!315 = !DILocation(line: 337, column: 1, scope: !244)
!316 = distinct !DISubprogram(name: "Compute_Pyramid_Level", scope: !3, file: !3, line: 367, type: !317, scopeLine: 369, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !319)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !6}
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!320 = !DILocalVariable(name: "level", arg: 1, scope: !316, file: !3, line: 368, type: !6)
!321 = !DILocalVariable(name: "outx", scope: !316, file: !3, line: 370, type: !6)
!322 = !DILocalVariable(name: "outy", scope: !316, file: !3, line: 370, type: !6)
!323 = !DILocalVariable(name: "outz", scope: !316, file: !3, line: 370, type: !6)
!324 = !DILocalVariable(name: "inx", scope: !316, file: !3, line: 371, type: !6)
!325 = !DILocalVariable(name: "iny", scope: !316, file: !3, line: 371, type: !6)
!326 = !DILocalVariable(name: "inz", scope: !316, file: !3, line: 371, type: !6)
!327 = !DILocalVariable(name: "inx_plus_one", scope: !316, file: !3, line: 372, type: !6)
!328 = !DILocalVariable(name: "iny_plus_one", scope: !316, file: !3, line: 372, type: !6)
!329 = !DILocalVariable(name: "inz_plus_one", scope: !316, file: !3, line: 372, type: !6)
!330 = !DILocalVariable(name: "bit", scope: !316, file: !3, line: 373, type: !253)
!331 = !DILocation(line: 0, scope: !316)
!332 = !DILocation(line: 376, column: 14, scope: !316)
!333 = !DILocation(line: 375, column: 3, scope: !316)
!334 = !DILocation(line: 377, column: 21, scope: !335)
!335 = distinct !DILexicalBlock(scope: !336, file: !3, line: 377, column: 3)
!336 = distinct !DILexicalBlock(scope: !316, file: !3, line: 377, column: 3)
!337 = !DILocation(line: 377, column: 20, scope: !335)
!338 = !DILocation(line: 377, column: 3, scope: !336)
!339 = !DILocation(line: 380, column: 23, scope: !340)
!340 = distinct !DILexicalBlock(scope: !341, file: !3, line: 380, column: 5)
!341 = distinct !DILexicalBlock(scope: !342, file: !3, line: 380, column: 5)
!342 = distinct !DILexicalBlock(scope: !335, file: !3, line: 377, column: 48)
!343 = !DILocation(line: 378, column: 15, scope: !342)
!344 = !DILocation(line: 379, column: 20, scope: !342)
!345 = !DILocation(line: 380, column: 22, scope: !340)
!346 = !DILocation(line: 380, column: 5, scope: !341)
!347 = !DILocation(line: 383, column: 25, scope: !348)
!348 = distinct !DILexicalBlock(scope: !349, file: !3, line: 383, column: 7)
!349 = distinct !DILexicalBlock(scope: !350, file: !3, line: 383, column: 7)
!350 = distinct !DILexicalBlock(scope: !340, file: !3, line: 380, column: 50)
!351 = !DILocation(line: 381, column: 17, scope: !350)
!352 = !DILocation(line: 382, column: 22, scope: !350)
!353 = !DILocation(line: 383, column: 24, scope: !348)
!354 = !DILocation(line: 383, column: 7, scope: !349)
!355 = !DILocation(line: 387, column: 8, scope: !356)
!356 = distinct !DILexicalBlock(scope: !348, file: !3, line: 383, column: 52)
!357 = !DILocation(line: 384, column: 12, scope: !356)
!358 = !DILocation(line: 385, column: 17, scope: !356)
!359 = !DILocation(line: 388, column: 9, scope: !356)
!360 = !DILocation(line: 388, column: 6, scope: !356)
!361 = !DILocation(line: 389, column: 9, scope: !356)
!362 = !DILocation(line: 389, column: 6, scope: !356)
!363 = !DILocation(line: 390, column: 9, scope: !356)
!364 = !DILocation(line: 390, column: 6, scope: !356)
!365 = !DILocation(line: 391, column: 9, scope: !356)
!366 = !DILocation(line: 391, column: 6, scope: !356)
!367 = !DILocation(line: 392, column: 9, scope: !356)
!368 = !DILocation(line: 392, column: 6, scope: !356)
!369 = !DILocation(line: 393, column: 9, scope: !356)
!370 = !DILocation(line: 393, column: 6, scope: !356)
!371 = !DILocation(line: 394, column: 9, scope: !356)
!372 = !DILocation(line: 394, column: 6, scope: !356)
!373 = !DILocation(line: 396, column: 2, scope: !356)
!374 = !DILocation(line: 383, column: 48, scope: !348)
!375 = distinct !{!375, !354, !376, !64, !65}
!376 = !DILocation(line: 397, column: 7, scope: !349)
!377 = !DILocation(line: 380, column: 46, scope: !340)
!378 = distinct !{!378, !346, !379, !64, !65}
!379 = !DILocation(line: 398, column: 5, scope: !341)
!380 = !DILocation(line: 377, column: 44, scope: !335)
!381 = distinct !{!381, !338, !382, !64, !65}
!382 = !DILocation(line: 399, column: 3, scope: !336)
!383 = !DILocation(line: 400, column: 1, scope: !316)
!384 = !DISubprogram(name: "pthread_mutex_lock", scope: !385, file: !385, line: 738, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !419)
!385 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!386 = !DISubroutineType(types: !387)
!387 = !{!29, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !390, line: 72, baseType: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !390, line: 67, size: 320, elements: !392)
!392 = !{!393, !413, !418}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !391, file: !390, line: 69, baseType: !394, size: 320)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !395, line: 22, size: 320, elements: !396)
!395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!396 = !{!397, !398, !400, !401, !402, !403, !404, !405}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !394, file: !395, line: 24, baseType: !29, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !394, file: !395, line: 25, baseType: !399, size: 32, offset: 32)
!399 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !394, file: !395, line: 26, baseType: !29, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !394, file: !395, line: 28, baseType: !399, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !394, file: !395, line: 32, baseType: !29, size: 32, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !394, file: !395, line: 34, baseType: !17, size: 16, offset: 160)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !394, file: !395, line: 35, baseType: !17, size: 16, offset: 176)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !394, file: !395, line: 36, baseType: !406, size: 128, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !407, line: 53, baseType: !408)
!407 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !407, line: 49, size: 128, elements: !409)
!409 = !{!410, !412}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !408, file: !407, line: 51, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !408, file: !407, line: 52, baseType: !411, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !391, file: !390, line: 70, baseType: !414, size: 320)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 320, elements: !416)
!415 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!416 = !{!417}
!417 = !DISubrange(count: 40)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !391, file: !390, line: 71, baseType: !6, size: 64)
!419 = !{}
!420 = !DISubprogram(name: "pthread_mutex_unlock", scope: !385, file: !385, line: 756, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !419)
!421 = !DISubprogram(name: "Error", scope: !422, file: !422, line: 187, type: !423, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !419)
!422 = !DIFile(filename: "./global.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/volrend", checksumkind: CSK_MD5, checksum: "f049690031a7f12768b0765e4f4983eb")
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425, null}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!426 = distinct !DISubprogram(name: "Load_Octree", scope: !3, file: !3, line: 403, type: !427, scopeLine: 405, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !429)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !425}
!429 = !{!430, !431, !435, !436}
!430 = !DILocalVariable(name: "filename", arg: 1, scope: !426, file: !3, line: 404, type: !425)
!431 = !DILocalVariable(name: "local_filename", scope: !426, file: !3, line: 406, type: !432)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 1608, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 201)
!435 = !DILocalVariable(name: "fd", scope: !426, file: !3, line: 407, type: !29)
!436 = !DILocalVariable(name: "level", scope: !426, file: !3, line: 408, type: !6)
!437 = !DILocation(line: 0, scope: !426)
!438 = !DILocation(line: 406, column: 3, scope: !426)
!439 = !DILocation(line: 406, column: 8, scope: !426)
!440 = !DILocation(line: 410, column: 3, scope: !426)
!441 = !DILocation(line: 411, column: 3, scope: !426)
!442 = !DILocation(line: 412, column: 8, scope: !426)
!443 = !DILocation(line: 414, column: 3, scope: !426)
!444 = !DILocation(line: 415, column: 7, scope: !445)
!445 = distinct !DILexicalBlock(scope: !426, file: !3, line: 415, column: 7)
!446 = !DILocation(line: 415, column: 19, scope: !445)
!447 = !DILocation(line: 415, column: 7, scope: !426)
!448 = !DILocation(line: 416, column: 5, scope: !445)
!449 = !DILocation(line: 418, column: 3, scope: !426)
!450 = !DILocation(line: 419, column: 50, scope: !426)
!451 = !DILocation(line: 419, column: 63, scope: !426)
!452 = !DILocation(line: 419, column: 3, scope: !426)
!453 = !DILocation(line: 420, column: 53, scope: !426)
!454 = !DILocation(line: 420, column: 66, scope: !426)
!455 = !DILocation(line: 420, column: 3, scope: !426)
!456 = !DILocation(line: 421, column: 52, scope: !426)
!457 = !DILocation(line: 421, column: 62, scope: !426)
!458 = !DILocation(line: 421, column: 3, scope: !426)
!459 = !DILocation(line: 423, column: 57, scope: !426)
!460 = !DILocation(line: 423, column: 3, scope: !426)
!461 = !DILocation(line: 424, column: 23, scope: !462)
!462 = distinct !DILexicalBlock(scope: !463, file: !3, line: 424, column: 3)
!463 = distinct !DILexicalBlock(scope: !426, file: !3, line: 424, column: 3)
!464 = !DILocation(line: 424, column: 22, scope: !462)
!465 = !DILocation(line: 424, column: 3, scope: !463)
!466 = !DILocation(line: 425, column: 29, scope: !467)
!467 = distinct !DILexicalBlock(scope: !462, file: !3, line: 424, column: 44)
!468 = !DILocation(line: 425, column: 48, scope: !467)
!469 = !DILocation(line: 425, column: 5, scope: !467)
!470 = !DILocation(line: 426, column: 5, scope: !467)
