; ModuleID = 'opacity.c'
source_filename = "opacity.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalMemory = type { i64, [1025 x [256 x i64]], %struct.anon, %struct.anon.3, %union.pthread_mutex_t, %union.pthread_mutex_t, [1025 x %union.pthread_mutex_t] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%struct.anon.3 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

@map_len = external local_unnamed_addr global [3 x i16], align 2
@opc_len = dso_local global [3 x i16] zeroinitializer, align 2, !dbg !0
@opc_length = dso_local global i32 0, align 4, !dbg !17
@opc_address = dso_local global ptr null, align 8, !dbg !20
@Global = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [44 x i8] c"    Allocating opacity map of %ld bytes...\0A\00", align 1
@.str.2 = private unnamed_addr constant [33 x i8] c"    No space available for map.\0A\00", align 1

!136 = distinct !DILexicalBlock(scope: !92, file: !3, line: 169, column: 3)
!137 = !DILocation(line: 169, column: 3, scope: !136)
!138 = !DILocation(line: 170, column: 5, scope: !139)
!139 = distinct !DILexicalBlock(scope: !140, file: !3, line: 170, column: 5)
!140 = distinct !DILexicalBlock(scope: !135, file: !3, line: 169, column: 41)
!141 = !DILocation(line: 171, column: 7, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !3, line: 171, column: 7)
!143 = distinct !DILexicalBlock(scope: !144, file: !3, line: 170, column: 43)
!144 = distinct !DILexicalBlock(scope: !139, file: !3, line: 170, column: 5)
!145 = !DILocation(line: 173, column: 14, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !3, line: 171, column: 45)
!147 = distinct !DILexicalBlock(scope: !142, file: !3, line: 171, column: 7)
!148 = !DILocation(line: 177, column: 12, scope: !146)
!149 = !DILocation(line: 178, column: 16, scope: !150)
!150 = distinct !DILexicalBlock(scope: !146, file: !3, line: 178, column: 6)
!151 = !DILocation(line: 178, column: 14, scope: !150)
!152 = !DILocation(line: 178, column: 6, scope: !146)
!153 = !DILocation(line: 180, column: 26, scope: !154)
!154 = distinct !DILexicalBlock(scope: !150, file: !3, line: 178, column: 33)
!155 = !DILocation(line: 180, column: 20, scope: !154)
!156 = !DILocation(line: 180, column: 53, scope: !154)
!157 = !DILocation(line: 180, column: 47, scope: !154)
!158 = !DILocation(line: 180, column: 45, scope: !154)
!159 = !DILocation(line: 180, column: 12, scope: !154)
!160 = !DILocation(line: 181, column: 26, scope: !154)
!161 = !DILocation(line: 181, column: 20, scope: !154)
!162 = !DILocation(line: 181, column: 53, scope: !154)
!163 = !DILocation(line: 181, column: 47, scope: !154)
!164 = !DILocation(line: 181, column: 45, scope: !154)
!165 = !DILocation(line: 181, column: 12, scope: !154)
!166 = !DILocation(line: 182, column: 26, scope: !154)
!167 = !DILocation(line: 182, column: 20, scope: !154)
!168 = !DILocation(line: 182, column: 53, scope: !154)
!169 = !DILocation(line: 182, column: 47, scope: !154)
!170 = !DILocation(line: 182, column: 45, scope: !154)
!171 = !DILocation(line: 182, column: 12, scope: !154)
!172 = !DILocation(line: 183, column: 33, scope: !154)
!173 = !DILocation(line: 183, column: 27, scope: !154)
!174 = !DILocation(line: 183, column: 39, scope: !154)
!175 = !DILocation(line: 186, column: 20, scope: !176)
!176 = distinct !DILexicalBlock(scope: !154, file: !3, line: 186, column: 8)
!177 = !DILocation(line: 186, column: 18, scope: !176)
!178 = !DILocation(line: 186, column: 8, scope: !154)
!179 = !DILocation(line: 187, column: 26, scope: !180)
!180 = distinct !DILexicalBlock(scope: !176, file: !3, line: 186, column: 34)
!181 = !DILocation(line: 187, column: 21, scope: !180)
!182 = !DILocation(line: 187, column: 20, scope: !180)
!183 = !DILocation(line: 187, column: 18, scope: !180)
!184 = !DILocation(line: 192, column: 16, scope: !180)
!185 = !DILocation(line: 193, column: 26, scope: !180)
!186 = !DILocation(line: 193, column: 8, scope: !180)
!187 = !DILocation(line: 192, column: 41, scope: !180)
!188 = !DILocation(line: 195, column: 20, scope: !189)
!189 = distinct !DILexicalBlock(scope: !180, file: !3, line: 195, column: 10)
!190 = !DILocation(line: 195, column: 18, scope: !189)
!191 = !DILocation(line: 195, column: 10, scope: !180)
!192 = !DILocation(line: 196, column: 30, scope: !189)
!193 = !DILocation(line: 196, column: 8, scope: !189)
!194 = !DILocation(line: 0, scope: !150)
!195 = !DILocation(line: 171, column: 29, scope: !147)
!196 = distinct !{!196, !141, !197, !50, !51}
!197 = !DILocation(line: 201, column: 7, scope: !142)
!198 = !DILocation(line: 170, column: 27, scope: !144)
!199 = distinct !{!199, !138, !200, !50, !51}
!200 = !DILocation(line: 202, column: 5, scope: !139)
!201 = distinct !{!201, !137, !202, !50, !51}
!202 = !DILocation(line: 203, column: 3, scope: !136)
!203 = !DILocation(line: 217, column: 1, scope: !92)
!204 = !DISubprogram(name: "Error", scope: !205, file: !205, line: 187, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!205 = !DIFile(filename: "./global.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/volrend", checksumkind: CSK_MD5, checksum: "f049690031a7f12768b0765e4f4983eb")
!206 = !DISubroutineType(types: !207)
!207 = !{null, !208, null}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!210 = !{}
!211 = !DISubprogram(name: "pthread_mutex_lock", scope: !212, file: !212, line: 738, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!212 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!213 = !DISubroutineType(types: !214)
!214 = !{!19, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !217, line: 72, baseType: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !217, line: 67, size: 320, elements: !219)
!219 = !{!220, !240, !244}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !218, file: !217, line: 69, baseType: !221, size: 320)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !222, line: 22, size: 320, elements: !223)
!222 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!223 = !{!224, !225, !227, !228, !229, !230, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !221, file: !222, line: 24, baseType: !19, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !221, file: !222, line: 25, baseType: !226, size: 32, offset: 32)
!226 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !221, file: !222, line: 26, baseType: !19, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !221, file: !222, line: 28, baseType: !226, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !221, file: !222, line: 32, baseType: !19, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !221, file: !222, line: 34, baseType: !16, size: 16, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !221, file: !222, line: 35, baseType: !16, size: 16, offset: 176)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !221, file: !222, line: 36, baseType: !233, size: 128, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !234, line: 53, baseType: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !234, line: 49, size: 128, elements: !236)
!236 = !{!237, !239}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !235, file: !234, line: 51, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !235, file: !234, line: 52, baseType: !238, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !218, file: !217, line: 70, baseType: !241, size: 320)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 320, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 40)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !218, file: !217, line: 71, baseType: !11, size: 64)
!245 = !DISubprogram(name: "pthread_mutex_unlock", scope: !212, file: !212, line: 756, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!246 = distinct !DISubprogram(name: "Load_Opacity", scope: !3, file: !3, line: 220, type: !247, scopeLine: 222, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !208}
!249 = !{!250, !251, !255}
!250 = !DILocalVariable(name: "filename", arg: 1, scope: !246, file: !3, line: 221, type: !208)
!251 = !DILocalVariable(name: "local_filename", scope: !246, file: !3, line: 223, type: !252)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 1608, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 201)
!255 = !DILocalVariable(name: "fd", scope: !246, file: !3, line: 224, type: !19)
!256 = !DILocation(line: 0, scope: !246)
!257 = !DILocation(line: 223, column: 3, scope: !246)
!258 = !DILocation(line: 223, column: 8, scope: !246)
!259 = !DILocation(line: 226, column: 3, scope: !246)
!260 = !DILocation(line: 227, column: 3, scope: !246)
!261 = !DILocation(line: 228, column: 8, scope: !246)
!262 = !DILocation(line: 230, column: 3, scope: !246)
!263 = !DILocation(line: 231, column: 7, scope: !264)
!264 = distinct !DILexicalBlock(scope: !246, file: !3, line: 231, column: 7)
!265 = !DILocation(line: 231, column: 19, scope: !264)
!266 = !DILocation(line: 231, column: 7, scope: !246)
!267 = !DILocation(line: 232, column: 5, scope: !264)
!268 = !DILocation(line: 234, column: 3, scope: !246)
!269 = !DILocation(line: 236, column: 3, scope: !246)
!270 = !DILocation(line: 238, column: 33, scope: !246)
!271 = !DILocation(line: 238, column: 3, scope: !246)
!272 = !DILocation(line: 240, column: 3, scope: !246)
!273 = !DILocation(line: 241, column: 34, scope: !246)
!274 = !DILocation(line: 241, column: 53, scope: !246)
!275 = !DILocation(line: 241, column: 3, scope: !246)
!276 = !DILocation(line: 242, column: 3, scope: !246)
!277 = !DILocation(line: 243, column: 1, scope: !246)
!278 = !DISubprogram(name: "Open_File", scope: !205, file: !205, line: 174, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!279 = !DISubroutineType(types: !280)
!280 = !{!19, !208}
!281 = !DISubprogram(name: "Read_Shorts", scope: !205, file: !205, line: 179, type: !282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !19, !12, !11}
!284 = !DISubprogram(name: "Read_Longs", scope: !205, file: !205, line: 180, type: !282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!285 = !DISubprogram(name: "Read_Bytes", scope: !205, file: !205, line: 178, type: !282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!286 = !DISubprogram(name: "Close_File", scope: !205, file: !205, line: 181, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !19}
!289 = distinct !DISubprogram(name: "Store_Opacity", scope: !3, file: !3, line: 246, type: !247, scopeLine: 248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !290)
!290 = !{!291, !292, !293}
!291 = !DILocalVariable(name: "filename", arg: 1, scope: !289, file: !3, line: 247, type: !208)
