; ModuleID = 'parts.c'
source_filename = "parts.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SMatrix = type { i64, i64, ptr, ptr, ptr, ptr }
%struct.Chunk = type { i64, i64, i64, ptr }

@chunks_head = dso_local local_unnamed_addr global ptr null, align 8, !dbg !0
@chunks_tail = dso_local local_unnamed_addr global ptr null, align 8, !dbg !17
@tolerance = dso_local local_unnamed_addr global i64 20, align 8, !dbg !19
@divide_lo = dso_local local_unnamed_addr global ptr null, align 8, !dbg !21
@work_tree = external local_unnamed_addr global ptr, align 8
@domain_ops = dso_local local_unnamed_addr global double 0.000000e+00, align 8, !dbg !24
@.str = private unnamed_addr constant [32 x i8] c"Divide for %ld P, %ld domains, \00", align 1
@.str.1 = private unnamed_addr constant [22 x i8] c"%.2f of work static, \00", align 1
@.str.2 = private unnamed_addr constant [26 x i8] c"%.2f eff, (%.2f overall)\0A\00", align 1
@firstchild = external local_unnamed_addr global ptr, align 8
@child = external local_unnamed_addr global ptr, align 8
@node = external local_unnamed_addr global ptr, align 8
@divide_hi = dso_local local_unnamed_addr global ptr null, align 8, !dbg !26

; Function Attrs: noinline nounwind uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "chunks_head", scope: !2, file: !3, line: 44, type: !8, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !16, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "parts.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/cholesky", checksumkind: CSK_MD5, checksum: "b5c7f429b97ca506745a90a306dcd09a")
!4 = !{!5, !6, !8, !15}
!5 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chunk", file: !3, line: 41, size: 256, elements: !10)
!10 = !{!11, !12, !13, !14}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !9, file: !3, line: 42, baseType: !7, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !9, file: !3, line: 42, baseType: !7, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "assign", scope: !9, file: !3, line: 42, baseType: !7, size: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !3, line: 43, baseType: !8, size: 64, offset: 192)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !{!0, !17, !19, !21, !24, !26}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "chunks_tail", scope: !2, file: !3, line: 44, type: !8, isLocal: false, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "tolerance", scope: !2, file: !3, line: 46, type: !7, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "divide_lo", scope: !2, file: !3, line: 50, type: !23, isLocal: false, isDefinition: true)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "domain_ops", scope: !2, file: !3, line: 48, type: !5, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "divide_hi", scope: !2, file: !3, line: 50, type: !23, isLocal: false, isDefinition: true)
!28 = !{i32 7, !"Dwarf Version", i32 5}
!29 = !{i32 2, !"Debug Info Version", i32 3}
!30 = !{i32 1, !"wchar_size", i32 4}
!31 = !{i32 7, !"PIC Level", i32 2}
!32 = !{i32 7, !"PIE Level", i32 2}
!33 = !{i32 7, !"uwtable", i32 2}
!34 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!35 = distinct !DISubprogram(name: "Partition", scope: !3, file: !3, line: 58, type: !36, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !7, !6, !6, !6, !6, !6}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMatrix", file: !39, line: 29, baseType: !40)
!39 = !DIFile(filename: "./matrix.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/cholesky", checksumkind: CSK_MD5, checksum: "f19fdb19034f8f693c291706633e8f13")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 26, size: 384, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !40, file: !39, line: 27, baseType: !7, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !40, file: !39, line: 27, baseType: !7, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !40, file: !39, line: 27, baseType: !6, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "startrow", scope: !40, file: !39, line: 27, baseType: !6, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !40, file: !39, line: 27, baseType: !6, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !40, file: !39, line: 28, baseType: !23, size: 64, offset: 320)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!49 = !DILocalVariable(name: "M", arg: 1, scope: !35, file: !3, line: 58, type: !38)
!50 = !DILocalVariable(name: "parts", arg: 2, scope: !35, file: !3, line: 58, type: !7)
!51 = !DILocalVariable(name: "T", arg: 3, scope: !35, file: !3, line: 58, type: !6)
!52 = !DILocalVariable(name: "assigned_ops", arg: 4, scope: !35, file: !3, line: 58, type: !6)
!53 = !DILocalVariable(name: "domain", arg: 5, scope: !35, file: !3, line: 58, type: !6)
!54 = !DILocalVariable(name: "domains", arg: 6, scope: !35, file: !3, line: 58, type: !6)
!55 = !DILocalVariable(name: "proc_domains", arg: 7, scope: !35, file: !3, line: 58, type: !6)
!56 = !DILocalVariable(name: "i", scope: !35, file: !3, line: 60, type: !7)
!57 = !DILocalVariable(name: "p", scope: !35, file: !3, line: 60, type: !7)
!58 = !DILocalVariable(name: "start", scope: !35, file: !3, line: 60, type: !7)
!59 = !DILocalVariable(name: "minm", scope: !35, file: !3, line: 60, type: !7)
!60 = !DILocalVariable(name: "maxm", scope: !35, file: !3, line: 60, type: !7)
!61 = !DILocalVariable(name: "ops", scope: !35, file: !3, line: 60, type: !7)
!62 = !DILocalVariable(name: "change", scope: !35, file: !3, line: 60, type: !7)
!63 = !DILocalVariable(name: "which", scope: !35, file: !3, line: 61, type: !7)
!64 = !DILocalVariable(name: "depth", scope: !35, file: !3, line: 62, type: !6)
!65 = !DILocalVariable(name: "ave", scope: !35, file: !3, line: 63, type: !5)
!66 = !DILocalVariable(name: "maxo", scope: !35, file: !3, line: 63, type: !5)
!67 = !DILocalVariable(name: "maxd", scope: !35, file: !3, line: 63, type: !5)
!68 = !DILocalVariable(name: "t", scope: !35, file: !3, line: 64, type: !8)
!69 = !DILocation(line: 58, column: 24, scope: !35)
!70 = !DILocation(line: 0, scope: !35)
!71 = !DILocation(line: 67, column: 14, scope: !72)
!72 = distinct !DILexicalBlock(scope: !73, file: !3, line: 67, column: 3)
!73 = distinct !DILexicalBlock(scope: !35, file: !3, line: 67, column: 3)
!74 = !DILocation(line: 67, column: 3, scope: !73)
!75 = !DILocation(line: 68, column: 9, scope: !76)
!76 = distinct !DILexicalBlock(scope: !72, file: !3, line: 68, column: 9)
!77 = !DILocation(line: 68, column: 14, scope: !76)
!78 = !DILocation(line: 68, column: 9, scope: !72)
!79 = !DILocation(line: 67, column: 21, scope: !72)
!80 = !DILocation(line: 69, column: 11, scope: !81)
!81 = distinct !DILexicalBlock(scope: !76, file: !3, line: 68, column: 22)
!82 = !DILocation(line: 70, column: 16, scope: !81)
!83 = !DILocation(line: 70, column: 36, scope: !81)
!84 = !DILocation(line: 70, column: 28, scope: !81)
!85 = !DILocation(line: 70, column: 33, scope: !81)
!86 = !DILocation(line: 71, column: 7, scope: !81)
!87 = !DILocation(line: 73, column: 5, scope: !81)
!88 = distinct !{!88, !74, !89, !90, !91}
!89 = !DILocation(line: 73, column: 5, scope: !73)
!90 = !{!"llvm.loop.mustprogress"}
!91 = !{!"llvm.loop.unroll.disable"}
!92 = !DILocation(line: 75, column: 5, scope: !35)
!93 = !DILocation(line: 83, column: 9, scope: !94)
!94 = distinct !DILexicalBlock(scope: !95, file: !3, line: 81, column: 11)
!95 = distinct !DILexicalBlock(scope: !96, file: !3, line: 77, column: 14)
!96 = distinct !DILexicalBlock(scope: !97, file: !3, line: 77, column: 5)
!97 = distinct !DILexicalBlock(scope: !35, file: !3, line: 77, column: 5)
!98 = !DILocation(line: 78, column: 27, scope: !95)
!99 = !DILocation(line: 79, column: 27, scope: !95)
!100 = !DILocation(line: 79, column: 14, scope: !95)
!101 = !DILocation(line: 81, column: 16, scope: !94)
!102 = !DILocation(line: 81, column: 21, scope: !94)
!103 = !DILocation(line: 78, column: 14, scope: !95)
!104 = !DILocation(line: 82, column: 17, scope: !94)
!105 = !DILocation(line: 82, column: 11, scope: !94)
!106 = !DILocation(line: 82, column: 10, scope: !94)
