; ModuleID = 'patchman.c'
source_filename = "patchman.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { i64, %union.pthread_mutex_t, [1024 x %struct.Task_Queue], [3276800 x %struct._task], %union.pthread_mutex_t, ptr, %union.pthread_mutex_t, i64, %struct.Rgb, %struct.Rgb, float, i64, %union.pthread_mutex_t, i64, i64, [1024 x %struct.Patch_Cost], %struct.anon, i64, %union.pthread_mutex_t, i64, %union.pthread_mutex_t, %union.pthread_mutex_t, ptr, i64, i64, [1024 x %struct._patch], %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, i64, ptr, %union.pthread_mutex_t, i64, ptr, [3900 x %struct.Shared_Lock], [1024 x %struct.StatisticalInfo] }
%struct.Task_Queue = type { [4096 x i8], %union.pthread_mutex_t, ptr, ptr, i64, %union.pthread_mutex_t, i64, ptr, [4096 x i8] }
%struct._task = type { i64, ptr, %union.anon }
%union.anon = type { %struct.Refinement_Task }
%struct.Refinement_Task = type { ptr, ptr, float, i64 }
%struct.Rgb = type { float, float, float }
%struct.Patch_Cost = type { ptr, ptr, i64, i64, i64, [11 x i64] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon.0, %union.anon.2, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon.0 = type { i64 }
%union.anon.2 = type { i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "patchman.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "2df0dd0c9755ba4d0853616d0fa5c202")
!2 = !{!3, !4, !19}
!3 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "Patch", file: !1, line: 349, baseType: !6)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_patch", file: !1, line: 333, size: 1344, elements: !7)
!7 = !{!8, !68, !69, !70, !81, !82, !83, !84, !85, !86, !92, !93, !94, !95, !97, !98, !99, !136}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !6, file: !1, line: 334, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElemVertex", file: !1, line: 257, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_elemvertex", file: !1, line: 252, size: 320, elements: !12)
!12 = !{!13, !22, !29, !30}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !11, file: !1, line: 253, baseType: !14, size: 96)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vertex", file: !15, line: 14, baseType: !16)
!15 = !DIFile(filename: "./glibps/../structs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "127502bb3b1b1ffc96492ea685802424")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 12, size: 96, elements: !17)
!17 = !{!18, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !15, line: 13, baseType: !19, size: 32)
!19 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !15, line: 13, baseType: !19, size: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !15, line: 13, baseType: !19, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !11, file: !1, line: 254, baseType: !23, size: 96, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "Rgb", file: !15, line: 24, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 22, size: 96, elements: !25)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !24, file: !15, line: 23, baseType: !19, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !24, file: !15, line: 23, baseType: !19, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !24, file: !15, line: 23, baseType: !19, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !11, file: !1, line: 255, baseType: !19, size: 32, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ev_lock", scope: !11, file: !1, line: 256, baseType: !31, size: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Shared_Lock", file: !1, line: 118, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 115, size: 320, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !33, file: !1, line: 117, baseType: !36, size: 320)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !37, line: 72, baseType: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!38 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !37, line: 67, size: 320, elements: !39)
!39 = !{!40, !62, !67}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !38, file: !37, line: 69, baseType: !41, size: 320)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !42, line: 22, size: 320, elements: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!43 = !{!44, !46, !48, !49, !50, !51, !53, !54}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !41, file: !42, line: 24, baseType: !45, size: 32)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !41, file: !42, line: 25, baseType: !47, size: 32, offset: 32)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !41, file: !42, line: 26, baseType: !45, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !41, file: !42, line: 28, baseType: !47, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !41, file: !42, line: 32, baseType: !45, size: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !41, file: !42, line: 34, baseType: !52, size: 16, offset: 160)
!52 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !41, file: !42, line: 35, baseType: !52, size: 16, offset: 176)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !41, file: !42, line: 36, baseType: !55, size: 128, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !56, line: 53, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !56, line: 49, size: 128, elements: !58)
!58 = !{!59, !61}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !57, file: !56, line: 51, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !57, file: !56, line: 52, baseType: !60, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !38, file: !37, line: 70, baseType: !63, size: 320)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 320, elements: !65)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !{!66}
!66 = !DISubrange(count: 40)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !38, file: !37, line: 71, baseType: !3, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !6, file: !1, line: 334, baseType: !9, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !6, file: !1, line: 334, baseType: !9, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !6, file: !1, line: 335, baseType: !71, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "Edge", file: !1, line: 280, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_edge", file: !1, line: 276, size: 320, elements: !74)
!74 = !{!75, !76, !77, !79, !80}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !73, file: !1, line: 277, baseType: !9, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !73, file: !1, line: 277, baseType: !9, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ea", scope: !73, file: !1, line: 278, baseType: !78, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "eb", scope: !73, file: !1, line: 278, baseType: !78, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "edge_lock", scope: !73, file: !1, line: 279, baseType: !31, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !6, file: !1, line: 335, baseType: !71, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !6, file: !1, line: 335, baseType: !71, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !6, file: !1, line: 336, baseType: !14, size: 96, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !6, file: !1, line: 336, baseType: !14, size: 96, offset: 480)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "p3", scope: !6, file: !1, line: 336, baseType: !14, size: 96, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "plane_equ", scope: !6, file: !1, line: 337, baseType: !87, size: 128, offset: 672)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PlaneEqu", file: !1, line: 305, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 301, size: 128, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !88, file: !1, line: 302, baseType: !14, size: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !88, file: !1, line: 303, baseType: !19, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !6, file: !1, line: 338, baseType: !19, size: 32, offset: 800)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !6, file: !1, line: 339, baseType: !23, size: 96, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "emittance", scope: !6, file: !1, line: 341, baseType: !23, size: 96, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_positive", scope: !6, file: !1, line: 343, baseType: !96, size: 64, offset: 1024)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_negative", scope: !6, file: !1, line: 344, baseType: !96, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_parent", scope: !6, file: !1, line: 345, baseType: !96, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "el_root", scope: !6, file: !1, line: 347, baseType: !100, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !1, line: 389, size: 1536, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "elem_lock", scope: !101, file: !1, line: 390, baseType: !31, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !101, file: !1, line: 391, baseType: !4, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !101, file: !1, line: 393, baseType: !100, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !101, file: !1, line: 394, baseType: !100, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !101, file: !1, line: 395, baseType: !100, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !101, file: !1, line: 396, baseType: !100, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !101, file: !1, line: 397, baseType: !100, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "interactions", scope: !101, file: !1, line: 399, baseType: !111, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interact", file: !1, line: 435, size: 256, elements: !113)
!113 = !{!114, !115, !118, !119, !120, !121}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !1, line: 436, baseType: !111, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !112, file: !1, line: 437, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "Element", file: !1, line: 414, baseType: !101)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_out", scope: !112, file: !1, line: 438, baseType: !19, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_err", scope: !112, file: !1, line: 439, baseType: !19, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "area_ratio", scope: !112, file: !1, line: 440, baseType: !19, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !112, file: !1, line: 441, baseType: !19, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "n_interactions", scope: !101, file: !1, line: 400, baseType: !3, size: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "vis_undef_inter", scope: !101, file: !1, line: 401, baseType: !111, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "n_vis_undef_inter", scope: !101, file: !1, line: 402, baseType: !3, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !101, file: !1, line: 404, baseType: !23, size: 96, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rad_in", scope: !101, file: !1, line: 406, baseType: !23, size: 96, offset: 800)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rad_subtree", scope: !101, file: !1, line: 407, baseType: !23, size: 96, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "join_counter", scope: !101, file: !1, line: 409, baseType: !3, size: 64, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !101, file: !1, line: 411, baseType: !9, size: 64, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !101, file: !1, line: 411, baseType: !9, size: 64, offset: 1152)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !101, file: !1, line: 411, baseType: !9, size: 64, offset: 1216)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !101, file: !1, line: 412, baseType: !71, size: 64, offset: 1280)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !101, file: !1, line: 412, baseType: !71, size: 64, offset: 1344)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !101, file: !1, line: 412, baseType: !71, size: 64, offset: 1408)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !101, file: !1, line: 413, baseType: !19, size: 32, offset: 1472)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "seq_no", scope: !6, file: !1, line: 348, baseType: !3, size: 64, offset: 1280)
!137 = !{i32 7, !"Dwarf Version", i32 5}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = !{i32 7, !"PIC Level", i32 2}
!141 = !{i32 7, !"PIE Level", i32 2}
!142 = !{i32 7, !"uwtable", i32 2}
!143 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!144 = distinct !DISubprogram(name: "foreach_patch_in_bsp", scope: !1, file: !1, line: 1196, type: !145, scopeLine: 1197, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !150)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147, !3, !3}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, null}
!150 = !{!151, !152, !153}
!151 = !DILocalVariable(name: "func", arg: 1, scope: !144, file: !1, line: 1196, type: !147)
!152 = !DILocalVariable(name: "arg1", arg: 2, scope: !144, file: !1, line: 1196, type: !3)
!153 = !DILocalVariable(name: "process_id", arg: 3, scope: !144, file: !1, line: 1196, type: !3)
!154 = !DILocation(line: 0, scope: !144)
!155 = !DILocation(line: 1198, column: 21, scope: !144)
!156 = !DILocation(line: 1198, column: 29, scope: !144)
!157 = !DILocation(line: 1198, column: 5, scope: !144)
!158 = !DILocation(line: 1199, column: 1, scope: !144)
!159 = distinct !DISubprogram(name: "_foreach_patch", scope: !1, file: !1, line: 1202, type: !160, scopeLine: 1203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !162)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !4, !147, !3, !3}
!162 = !{!163, !164, !165, !166}
!163 = !DILocalVariable(name: "node", arg: 1, scope: !159, file: !1, line: 1202, type: !4)
!164 = !DILocalVariable(name: "func", arg: 2, scope: !159, file: !1, line: 1202, type: !147)
!165 = !DILocalVariable(name: "arg1", arg: 3, scope: !159, file: !1, line: 1202, type: !3)
!166 = !DILocalVariable(name: "process_id", arg: 4, scope: !159, file: !1, line: 1202, type: !3)
!167 = !DILocation(line: 1216, column: 9, scope: !168)
!168 = distinct !DILexicalBlock(scope: !159, file: !1, line: 1215, column: 9)
!169 = !DILocation(line: 0, scope: !159)
!170 = !DILocation(line: 1204, column: 14, scope: !171)
!171 = distinct !DILexicalBlock(scope: !159, file: !1, line: 1204, column: 9)
!172 = !DILocation(line: 1204, column: 9, scope: !159)
!173 = !DILocation(line: 1208, column: 15, scope: !174)
!174 = distinct !DILexicalBlock(scope: !159, file: !1, line: 1208, column: 9)
!175 = !DILocation(line: 1208, column: 9, scope: !174)
!176 = !DILocation(line: 1208, column: 9, scope: !159)
!177 = !DILocation(line: 1209, column: 9, scope: !174)
!178 = !DILocation(line: 1212, column: 5, scope: !159)
!179 = !DILocation(line: 1215, column: 15, scope: !168)
!180 = !DILocation(line: 1215, column: 9, scope: !168)
!181 = !DILocation(line: 1215, column: 9, scope: !159)
!182 = !DILocation(line: 1217, column: 1, scope: !159)
!183 = distinct !DISubprogram(name: "foreach_depth_sorted_patch", scope: !1, file: !1, line: 1233, type: !184, scopeLine: 1234, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !187)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !186, !147, !3, !3}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!187 = !{!188, !189, !190, !191}
!188 = !DILocalVariable(name: "sort_vec", arg: 1, scope: !183, file: !1, line: 1233, type: !186)
!189 = !DILocalVariable(name: "func", arg: 2, scope: !183, file: !1, line: 1233, type: !147)
!190 = !DILocalVariable(name: "arg1", arg: 3, scope: !183, file: !1, line: 1233, type: !3)
!191 = !DILocalVariable(name: "process_id", arg: 4, scope: !183, file: !1, line: 1233, type: !3)
