; ModuleID = 'poly.c'
source_filename = "poly.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.object = type { i64, [32 x i8], %struct.bbox, ptr, i64, ptr, ptr, ptr }
%struct.bbox = type { [3 x double], [3 x double] }
%struct.element = type { i64, ptr, ptr, %struct.bbox }
%struct.poly = type { i64, [3 x double], double, ptr, ptr, i64 }
%struct.irecord = type { double, ptr, double, double, double }
%struct.ray = type { i64, i64, i64, [3 x double], [3 x double], i64, ptr, i64, [3 x i64], [5 x %struct.rayinfo], float, float }
%struct.rayinfo = type { ptr, [3 x double], i64, double, i64, double, [3 x double], [3 x i64], i64, [3 x i64], ptr }

@.str = private unnamed_addr constant [5 x i8] c"poly\00", align 1
@stderr = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [25 x i8] c"\09polygon: %ld polygons.\0A\00", align 1
@.str.2 = private unnamed_addr constant [40 x i8] c"\09\09Vertices: %ld  Plane eq: %f %f %f %f\0A\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"\09\09%f %f %f \0A\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%ld\00", align 1
@.str.6 = private unnamed_addr constant [7 x i8] c"poly.c\00", align 1
@.str.7 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.9 = private unnamed_addr constant [12 x i8] c"%lf %lf %lf\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "poly.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "43dbdcb5d63fe13aca6b58714a4c8df7")
!2 = !{!3, !24}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLY", file: !5, line: 713, baseType: !6)
!5 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "poly", file: !5, line: 704, size: 512, elements: !7)
!7 = !{!8, !11, !18, !19, !21, !23}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "nverts", scope: !6, file: !5, line: 706, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !5, line: 297, baseType: !10)
!10 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !6, file: !5, line: 707, baseType: !12, size: 192, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC3", file: !5, line: 314, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, elements: !16)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "REAL", file: !5, line: 310, baseType: !15)
!15 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!16 = !{!17}
!17 = !DISubrange(count: 3)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !6, file: !5, line: 708, baseType: !14, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "vptr", scope: !6, file: !5, line: 709, baseType: !20, size: 64, offset: 320)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !6, file: !5, line: 710, baseType: !22, size: 64, offset: 384)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "axis_proj", scope: !6, file: !5, line: 711, baseType: !9, size: 64, offset: 448)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !5, line: 287, baseType: !26)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !{i32 7, !"Dwarf Version", i32 5}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 1, !"wchar_size", i32 4}
!30 = !{i32 7, !"PIC Level", i32 2}
!31 = !{i32 7, !"PIE Level", i32 2}
!32 = !{i32 7, !"uwtable", i32 2}
!33 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!34 = distinct !DISubprogram(name: "PolyName", scope: !1, file: !1, line: 47, type: !35, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !37)
!35 = !DISubroutineType(types: !36)
!36 = !{!24}
!37 = !{}
!38 = !DILocation(line: 49, column: 2, scope: !34)
!39 = distinct !DISubprogram(name: "PolyPrint", scope: !1, file: !1, line: 66, type: !40, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !106)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", file: !5, line: 499, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !5, line: 488, size: 1024, elements: !45)
!45 = !{!46, !47, !51, !57, !67, !68, !92, !105}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !44, file: !5, line: 490, baseType: !9, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !5, line: 491, baseType: !48, size: 256, offset: 64)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !44, file: !5, line: 492, baseType: !52, size: 384, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", file: !5, line: 418, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbox", file: !5, line: 413, size: 384, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dnear", scope: !53, file: !5, line: 415, baseType: !13, size: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "dfar", scope: !53, file: !5, line: 416, baseType: !13, size: 192, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !44, file: !5, line: 493, baseType: !58, size: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT", file: !5, line: 481, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "element", file: !5, line: 474, size: 576, elements: !61)
!61 = !{!62, !63, !65, !66}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !60, file: !5, line: 476, baseType: !9, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !60, file: !5, line: 477, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !60, file: !5, line: 478, baseType: !24, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !60, file: !5, line: 479, baseType: !52, size: 384, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !44, file: !5, line: 494, baseType: !9, size: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !44, file: !5, line: 495, baseType: !69, size: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROCS", file: !5, line: 340, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pprocs", file: !5, line: 327, size: 640, elements: !72)
!72 = !{!73, !77, !81, !82, !83, !84, !88, !89, !90, !91}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !5, line: 329, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!24, null}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !71, file: !5, line: 330, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, null}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !71, file: !5, line: 331, baseType: !78, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "binread", scope: !71, file: !5, line: 332, baseType: !78, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !71, file: !5, line: 333, baseType: !78, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "intersect", scope: !71, file: !5, line: 334, baseType: !85, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!9, null}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pe_intersect", scope: !71, file: !5, line: 335, baseType: !85, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !71, file: !5, line: 336, baseType: !78, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "normalize", scope: !71, file: !5, line: 337, baseType: !78, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !71, file: !5, line: 338, baseType: !78, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "surf", scope: !44, file: !5, line: 496, baseType: !93, size: 64, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "SURF", file: !5, line: 357, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "surf", file: !5, line: 347, size: 704, elements: !96)
!96 = !{!97, !99, !100, !101, !102, !103, !104}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "fcolor", scope: !95, file: !5, line: 349, baseType: !98, size: 192)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOR", file: !5, line: 319, baseType: !12)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bcolor", scope: !95, file: !5, line: 350, baseType: !98, size: 192, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "kdiff", scope: !95, file: !5, line: 351, baseType: !14, size: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "kspec", scope: !95, file: !5, line: 352, baseType: !14, size: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ktran", scope: !95, file: !5, line: 353, baseType: !14, size: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "refrindex", scope: !95, file: !5, line: 354, baseType: !14, size: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "kspecn", scope: !95, file: !5, line: 355, baseType: !14, size: 64, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !5, line: 497, baseType: !64, size: 64, offset: 960)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114}
!107 = !DILocalVariable(name: "po", arg: 1, scope: !39, file: !1, line: 66, type: !42)
!108 = !DILocalVariable(name: "i", scope: !39, file: !1, line: 68, type: !9)
!109 = !DILocalVariable(name: "j", scope: !39, file: !1, line: 68, type: !9)
!110 = !DILocalVariable(name: "vindex", scope: !39, file: !1, line: 69, type: !22)
!111 = !DILocalVariable(name: "vlist", scope: !39, file: !1, line: 70, type: !20)
!112 = !DILocalVariable(name: "vptr", scope: !39, file: !1, line: 70, type: !20)
!113 = !DILocalVariable(name: "pp", scope: !39, file: !1, line: 71, type: !3)
!114 = !DILocalVariable(name: "pe", scope: !39, file: !1, line: 72, type: !58)
!115 = !DILocation(line: 0, scope: !39)
!116 = !DILocation(line: 74, column: 11, scope: !39)
!117 = !DILocation(line: 75, column: 10, scope: !39)
!118 = !DILocation(line: 75, column: 52, scope: !39)
!119 = !DILocation(line: 75, column: 2, scope: !39)
!120 = !DILocation(line: 77, column: 22, scope: !121)
!121 = distinct !DILexicalBlock(scope: !122, file: !1, line: 77, column: 2)
!122 = distinct !DILexicalBlock(scope: !39, file: !1, line: 77, column: 2)
!123 = !DILocation(line: 77, column: 16, scope: !121)
!124 = !DILocation(line: 77, column: 2, scope: !122)
!125 = !DILocation(line: 79, column: 20, scope: !126)
!126 = distinct !DILexicalBlock(scope: !121, file: !1, line: 78, column: 3)
!127 = !DILocation(line: 81, column: 11, scope: !126)
!128 = !DILocation(line: 81, column: 69, scope: !126)
!129 = !DILocation(line: 81, column: 81, scope: !126)
!130 = !DILocation(line: 81, column: 77, scope: !126)
!131 = !DILocation(line: 81, column: 90, scope: !126)
!132 = !DILocation(line: 81, column: 103, scope: !126)
!133 = !DILocation(line: 81, column: 120, scope: !126)
!134 = !DILocation(line: 81, column: 3, scope: !126)
!135 = !DILocation(line: 83, column: 16, scope: !126)
!136 = !DILocation(line: 86, column: 23, scope: !137)
!137 = distinct !DILexicalBlock(scope: !138, file: !1, line: 86, column: 3)
!138 = distinct !DILexicalBlock(scope: !126, file: !1, line: 86, column: 3)
!139 = !DILocation(line: 86, column: 17, scope: !137)
!140 = !DILocation(line: 86, column: 3, scope: !138)
!141 = !DILocation(line: 84, column: 16, scope: !126)
!142 = !DILocation(line: 88, column: 20, scope: !143)
!143 = distinct !DILexicalBlock(scope: !137, file: !1, line: 87, column: 4)
!144 = !DILocation(line: 88, column: 17, scope: !143)
!145 = !DILocation(line: 89, column: 12, scope: !143)
!146 = !DILocation(line: 89, column: 39, scope: !143)
!147 = !DILocation(line: 89, column: 51, scope: !143)
!148 = !DILocation(line: 89, column: 63, scope: !143)
!149 = !DILocation(line: 89, column: 4, scope: !143)
!150 = !DILocation(line: 90, column: 10, scope: !143)
!151 = !DILocation(line: 86, column: 32, scope: !137)
!152 = distinct !{!152, !140, !153, !154, !155}
!153 = !DILocation(line: 91, column: 4, scope: !138)
!154 = !{!"llvm.loop.mustprogress"}
!155 = !{!"llvm.loop.unroll.disable"}
!156 = !DILocation(line: 93, column: 5, scope: !126)
!157 = !DILocation(line: 77, column: 36, scope: !121)
!158 = distinct !{!158, !124, !159, !154, !155}
!159 = !DILocation(line: 94, column: 3, scope: !122)
!160 = !DILocation(line: 95, column: 2, scope: !39)
!161 = distinct !DISubprogram(name: "PolyElementBoundBox", scope: !1, file: !1, line: 112, type: !162, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !164)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !58, !3}
!164 = !{!165, !166, !167, !168, !169, !171, !172, !173, !174, !175, !176, !177, !178}
!165 = !DILocalVariable(name: "pe", arg: 1, scope: !161, file: !1, line: 112, type: !58)
!166 = !DILocalVariable(name: "pp", arg: 2, scope: !161, file: !1, line: 112, type: !3)
!167 = !DILocalVariable(name: "i", scope: !161, file: !1, line: 114, type: !9)
!168 = !DILocalVariable(name: "vindex", scope: !161, file: !1, line: 115, type: !22)
!169 = !DILocalVariable(name: "pbb", scope: !161, file: !1, line: 116, type: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!171 = !DILocalVariable(name: "vlist", scope: !161, file: !1, line: 117, type: !20)
!172 = !DILocalVariable(name: "vptr", scope: !161, file: !1, line: 117, type: !20)
!173 = !DILocalVariable(name: "minx", scope: !161, file: !1, line: 118, type: !14)
!174 = !DILocalVariable(name: "maxx", scope: !161, file: !1, line: 118, type: !14)
!175 = !DILocalVariable(name: "miny", scope: !161, file: !1, line: 119, type: !14)
!176 = !DILocalVariable(name: "maxy", scope: !161, file: !1, line: 119, type: !14)
!177 = !DILocalVariable(name: "minz", scope: !161, file: !1, line: 120, type: !14)
!178 = !DILocalVariable(name: "maxz", scope: !161, file: !1, line: 120, type: !14)
!179 = !DILocation(line: 0, scope: !161)
!180 = !DILocation(line: 127, column: 15, scope: !161)
!181 = !DILocation(line: 130, column: 16, scope: !182)
!182 = distinct !DILexicalBlock(scope: !183, file: !1, line: 130, column: 2)
!183 = distinct !DILexicalBlock(scope: !161, file: !1, line: 130, column: 2)
!184 = !DILocation(line: 130, column: 2, scope: !183)
!185 = !DILocation(line: 128, column: 15, scope: !161)
!186 = !DILocation(line: 132, column: 19, scope: !187)
!187 = distinct !DILexicalBlock(scope: !182, file: !1, line: 131, column: 3)
!188 = !DILocation(line: 132, column: 16, scope: !187)
!189 = !DILocation(line: 134, column: 10, scope: !187)
!190 = !DILocation(line: 135, column: 10, scope: !187)
!191 = !DILocation(line: 136, column: 10, scope: !187)
!192 = !DILocation(line: 138, column: 10, scope: !187)
!193 = !DILocation(line: 139, column: 10, scope: !187)
!194 = !DILocation(line: 140, column: 10, scope: !187)
!195 = !DILocation(line: 142, column: 9, scope: !187)
!196 = !DILocation(line: 130, column: 31, scope: !182)
!197 = distinct !{!197, !184, !198, !154, !155}
!198 = !DILocation(line: 143, column: 3, scope: !183)
!199 = !DILocation(line: 122, column: 14, scope: !161)
!200 = !DILocation(line: 145, column: 16, scope: !161)
!201 = !DILocation(line: 146, column: 2, scope: !161)
!202 = !DILocation(line: 146, column: 16, scope: !161)
!203 = !DILocation(line: 147, column: 2, scope: !161)
!204 = !DILocation(line: 147, column: 16, scope: !161)
!205 = !DILocation(line: 149, column: 7, scope: !161)
!206 = !DILocation(line: 149, column: 16, scope: !161)
!207 = !DILocation(line: 150, column: 2, scope: !161)
!208 = !DILocation(line: 150, column: 16, scope: !161)
!209 = !DILocation(line: 151, column: 2, scope: !161)
!210 = !DILocation(line: 151, column: 16, scope: !161)
!211 = !DILocation(line: 152, column: 2, scope: !161)
!212 = distinct !DISubprogram(name: "PolyBoundBox", scope: !1, file: !1, line: 168, type: !40, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!214 = !DILocalVariable(name: "po", arg: 1, scope: !212, file: !1, line: 168, type: !42)
!215 = !DILocalVariable(name: "i", scope: !212, file: !1, line: 170, type: !9)
!216 = !DILocalVariable(name: "pp", scope: !212, file: !1, line: 171, type: !3)
!217 = !DILocalVariable(name: "pe", scope: !212, file: !1, line: 172, type: !58)
!218 = !DILocalVariable(name: "pbb", scope: !212, file: !1, line: 173, type: !170)
!219 = !DILocalVariable(name: "minx", scope: !212, file: !1, line: 174, type: !14)
!220 = !DILocalVariable(name: "maxx", scope: !212, file: !1, line: 174, type: !14)
!221 = !DILocalVariable(name: "miny", scope: !212, file: !1, line: 175, type: !14)
!222 = !DILocalVariable(name: "maxy", scope: !212, file: !1, line: 175, type: !14)
!223 = !DILocalVariable(name: "minz", scope: !212, file: !1, line: 176, type: !14)
!224 = !DILocalVariable(name: "maxz", scope: !212, file: !1, line: 176, type: !14)
!225 = !DILocation(line: 0, scope: !212)
!226 = !DILocation(line: 184, column: 22, scope: !227)
!227 = distinct !DILexicalBlock(scope: !228, file: !1, line: 184, column: 2)
!228 = distinct !DILexicalBlock(scope: !212, file: !1, line: 184, column: 2)
!229 = !DILocation(line: 184, column: 16, scope: !227)
!230 = !DILocation(line: 184, column: 2, scope: !228)
!231 = !DILocation(line: 178, column: 13, scope: !212)
!232 = !DILocation(line: 186, column: 20, scope: !233)
!233 = distinct !DILexicalBlock(scope: !227, file: !1, line: 185, column: 3)
!234 = !DILocation(line: 187, column: 3, scope: !233)
!235 = !DILocation(line: 189, column: 10, scope: !233)
!236 = !DILocation(line: 190, column: 10, scope: !233)
!237 = !DILocation(line: 191, column: 10, scope: !233)
!238 = !DILocation(line: 193, column: 10, scope: !233)
!239 = !DILocation(line: 194, column: 10, scope: !233)
!240 = !DILocation(line: 195, column: 10, scope: !233)
!241 = !DILocation(line: 197, column: 5, scope: !233)
!242 = !DILocation(line: 184, column: 36, scope: !227)
!243 = distinct !{!243, !230, !244, !154, !155}
!244 = !DILocation(line: 198, column: 3, scope: !228)
!245 = !DILocation(line: 179, column: 15, scope: !212)
!246 = !DILocation(line: 200, column: 16, scope: !212)
!247 = !DILocation(line: 201, column: 2, scope: !212)
!248 = !DILocation(line: 201, column: 16, scope: !212)
!249 = !DILocation(line: 202, column: 2, scope: !212)
!250 = !DILocation(line: 202, column: 16, scope: !212)
!251 = !DILocation(line: 204, column: 7, scope: !212)
!252 = !DILocation(line: 204, column: 16, scope: !212)
!253 = !DILocation(line: 205, column: 2, scope: !212)
!254 = !DILocation(line: 205, column: 16, scope: !212)
!255 = !DILocation(line: 206, column: 2, scope: !212)
!256 = !DILocation(line: 206, column: 16, scope: !212)
!257 = !DILocation(line: 207, column: 2, scope: !212)
!258 = distinct !DISubprogram(name: "PolyNormal", scope: !1, file: !1, line: 229, type: !259, scopeLine: 230, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !271)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !261, !270, !270}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRECORD", file: !5, line: 514, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "irecord", file: !5, line: 506, size: 320, elements: !264)
!264 = !{!265, !266, !267, !268, !269}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !263, file: !5, line: 508, baseType: !14, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !263, file: !5, line: 509, baseType: !58, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "b1", scope: !263, file: !5, line: 510, baseType: !14, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "b2", scope: !263, file: !5, line: 511, baseType: !14, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "b3", scope: !263, file: !5, line: 512, baseType: !14, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!271 = !{!272, !273, !274, !275, !276}
!272 = !DILocalVariable(name: "hit", arg: 1, scope: !258, file: !1, line: 229, type: !261)
!273 = !DILocalVariable(name: "Pi", arg: 2, scope: !258, file: !1, line: 229, type: !270)
!274 = !DILocalVariable(name: "Ni", arg: 3, scope: !258, file: !1, line: 229, type: !270)
!275 = !DILocalVariable(name: "pe", scope: !258, file: !1, line: 231, type: !58)
!276 = !DILocalVariable(name: "pp", scope: !258, file: !1, line: 232, type: !3)
!277 = !DILocation(line: 0, scope: !258)
!278 = !DILocation(line: 236, column: 12, scope: !258)
!279 = !DILocation(line: 237, column: 19, scope: !258)
!280 = !DILocation(line: 238, column: 2, scope: !281)
!281 = distinct !DILexicalBlock(scope: !258, file: !1, line: 238, column: 2)
!282 = !DILocation(line: 239, column: 2, scope: !258)
!283 = distinct !DISubprogram(name: "PolyDataNormalize", scope: !1, file: !1, line: 256, type: !284, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !290)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !42, !286}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 4)
!290 = !{!291, !292, !293, !294, !297, !298, !299}
!291 = !DILocalVariable(name: "po", arg: 1, scope: !283, file: !1, line: 256, type: !42)
!292 = !DILocalVariable(name: "normMat", arg: 2, scope: !283, file: !1, line: 256, type: !286)
!293 = !DILocalVariable(name: "i", scope: !283, file: !1, line: 258, type: !9)
!294 = !DILocalVariable(name: "coord", scope: !283, file: !1, line: 259, type: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT", file: !5, line: 318, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC4", file: !5, line: 315, baseType: !287)
!297 = !DILocalVariable(name: "pv", scope: !283, file: !1, line: 260, type: !20)
!298 = !DILocalVariable(name: "pp", scope: !283, file: !1, line: 261, type: !3)
!299 = !DILocalVariable(name: "pe", scope: !283, file: !1, line: 262, type: !58)
!300 = !DILocation(line: 0, scope: !283)
!301 = !DILocation(line: 259, column: 2, scope: !283)
!302 = !DILocation(line: 259, column: 8, scope: !283)
!303 = !DILocation(line: 267, column: 11, scope: !283)
!304 = !DILocation(line: 268, column: 25, scope: !283)
!305 = !DILocation(line: 268, column: 2, scope: !283)
!306 = !DILocation(line: 273, column: 19, scope: !283)
!307 = !DILocation(line: 274, column: 11, scope: !283)
!308 = !DILocation(line: 276, column: 13, scope: !283)
!309 = !DILocation(line: 276, column: 11, scope: !283)
!310 = !DILocation(line: 277, column: 13, scope: !283)
!311 = !DILocation(line: 277, column: 2, scope: !283)
!312 = !DILocation(line: 277, column: 11, scope: !283)
!313 = !DILocation(line: 278, column: 13, scope: !283)
!314 = !DILocation(line: 278, column: 2, scope: !283)
!315 = !DILocation(line: 278, column: 11, scope: !283)
!316 = !DILocation(line: 279, column: 2, scope: !283)
!317 = !DILocation(line: 284, column: 18, scope: !283)
!318 = !DILocation(line: 284, column: 31, scope: !283)
!319 = !DILocation(line: 303, column: 22, scope: !320)
!320 = distinct !DILexicalBlock(scope: !321, file: !1, line: 303, column: 2)
!321 = distinct !DILexicalBlock(scope: !283, file: !1, line: 303, column: 2)
!322 = !DILocation(line: 303, column: 16, scope: !320)
!323 = !DILocation(line: 303, column: 2, scope: !321)
!324 = !DILocation(line: 286, column: 3, scope: !325)
!325 = distinct !DILexicalBlock(scope: !283, file: !1, line: 285, column: 3)
!326 = !DILocation(line: 288, column: 14, scope: !325)
!327 = !DILocation(line: 288, column: 12, scope: !325)
!328 = !DILocation(line: 289, column: 14, scope: !325)
!329 = !DILocation(line: 289, column: 3, scope: !325)
!330 = !DILocation(line: 289, column: 12, scope: !325)
!331 = !DILocation(line: 290, column: 14, scope: !325)
!332 = !DILocation(line: 290, column: 3, scope: !325)
!333 = !DILocation(line: 290, column: 12, scope: !325)
!334 = !DILocation(line: 292, column: 5, scope: !325)
!335 = !DILocation(line: 294, column: 14, scope: !325)
!336 = !DILocation(line: 294, column: 12, scope: !325)
!337 = !DILocation(line: 295, column: 14, scope: !325)
!338 = !DILocation(line: 295, column: 12, scope: !325)
!339 = !DILocation(line: 296, column: 14, scope: !325)
!340 = !DILocation(line: 296, column: 12, scope: !325)
!341 = distinct !{!341, !342, !343, !154, !155}
!342 = !DILocation(line: 284, column: 2, scope: !283)
!343 = !DILocation(line: 298, column: 3, scope: !283)
!344 = !DILocation(line: 305, column: 20, scope: !345)
!345 = distinct !DILexicalBlock(scope: !320, file: !1, line: 304, column: 3)
!346 = !DILocation(line: 306, column: 26, scope: !345)
!347 = !DILocation(line: 306, column: 3, scope: !345)
!348 = !DILocation(line: 310, column: 17, scope: !345)
!349 = !DILocation(line: 310, column: 31, scope: !345)
!350 = !DILocation(line: 310, column: 25, scope: !345)
!351 = !DILocation(line: 310, column: 22, scope: !345)
!352 = !DILocation(line: 311, column: 17, scope: !345)
!353 = !DILocation(line: 311, column: 13, scope: !345)
!354 = !DILocation(line: 311, column: 25, scope: !345)
!355 = !DILocation(line: 311, column: 36, scope: !345)
!356 = !DILocation(line: 311, column: 48, scope: !345)
!357 = !DILocation(line: 311, column: 47, scope: !345)
!358 = !DILocation(line: 311, column: 34, scope: !345)
!359 = !DILocation(line: 311, column: 59, scope: !345)
!360 = !DILocation(line: 311, column: 71, scope: !345)
!361 = !DILocation(line: 311, column: 57, scope: !345)
!362 = !DILocation(line: 311, column: 11, scope: !345)
!363 = !DILocation(line: 311, column: 7, scope: !345)
!364 = !DILocation(line: 311, column: 9, scope: !345)
!365 = !DILocation(line: 313, column: 5, scope: !345)
!366 = !DILocation(line: 303, column: 36, scope: !320)
!367 = distinct !{!367, !323, !368, !154, !155}
!368 = !DILocation(line: 314, column: 3, scope: !321)
!369 = !DILocation(line: 315, column: 2, scope: !283)
!370 = !DISubprogram(name: "NormalizeBoundBox", scope: !5, file: !5, line: 808, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !170, !286}
!373 = !DISubprogram(name: "VecMatMult", scope: !5, file: !5, line: 893, type: !374, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !270, !286, !270}
!376 = distinct !DISubprogram(name: "PolyPeIntersect", scope: !1, file: !1, line: 343, type: !377, scopeLine: 344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !470)
!377 = !DISubroutineType(types: !378)
!378 = !{!9, !379, !58, !261}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", file: !5, line: 625, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ray", file: !5, line: 611, size: 7104, elements: !382)
!382 = !{!383, !385, !386, !387, !388, !389, !390, !460, !461, !462, !466, !469}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !381, file: !5, line: 613, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !5, line: 301, baseType: !10)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !381, file: !5, line: 614, baseType: !9, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !381, file: !5, line: 614, baseType: !9, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !381, file: !5, line: 615, baseType: !12, size: 192, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !381, file: !5, line: 616, baseType: !12, size: 192, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !381, file: !5, line: 617, baseType: !9, size: 64, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !381, file: !5, line: 618, baseType: !391, size: 64, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAYINFO", file: !5, line: 603, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rayinfo", file: !5, line: 582, size: 1216, elements: !394)
!394 = !{!395, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "grid", scope: !393, file: !5, line: 584, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRID", file: !5, line: 572, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "grid", file: !5, line: 539, size: 1152, elements: !399)
!399 = !{!400, !401, !417, !421, !423, !424, !426, !427, !428, !429, !430, !447}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !398, file: !5, line: 541, baseType: !9, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !398, file: !5, line: 542, baseType: !402, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOXEL", file: !5, line: 405, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "voxel", file: !5, line: 394, size: 320, elements: !406)
!406 = !{!407, !408, !409, !411, !412, !413}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !405, file: !5, line: 396, baseType: !9, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !405, file: !5, line: 397, baseType: !9, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !405, file: !5, line: 398, baseType: !410, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cell", scope: !405, file: !5, line: 399, baseType: !24, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "celltype", scope: !405, file: !5, line: 400, baseType: !25, size: 8, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !405, file: !5, line: 403, baseType: !414, size: 56, offset: 264)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 56, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 7)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "emptycells", scope: !398, file: !5, line: 548, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !5, line: 298, baseType: !420)
!420 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pepa", scope: !398, file: !5, line: 555, baseType: !422, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "num_prims", scope: !398, file: !5, line: 556, baseType: !9, size: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc", scope: !398, file: !5, line: 558, baseType: !425, size: 192, offset: 320)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, elements: !16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !398, file: !5, line: 562, baseType: !9, size: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !398, file: !5, line: 563, baseType: !13, size: 192, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cellsize", scope: !398, file: !5, line: 564, baseType: !13, size: 192, offset: 768)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv_level", scope: !398, file: !5, line: 566, baseType: !9, size: 64, offset: 960)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bintree", scope: !398, file: !5, line: 569, baseType: !431, size: 64, offset: 1024)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "BTNODE", file: !5, line: 535, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btnode", file: !5, line: 522, size: 960, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !433, file: !5, line: 524, baseType: !422, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !433, file: !5, line: 525, baseType: !13, size: 192, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nprims", scope: !433, file: !5, line: 527, baseType: !9, size: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !433, file: !5, line: 528, baseType: !425, size: 192, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !433, file: !5, line: 529, baseType: !425, size: 192, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !433, file: !5, line: 531, baseType: !9, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "totalPrimsAllocated", scope: !433, file: !5, line: 532, baseType: !9, size: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "btn", scope: !433, file: !5, line: 533, baseType: !443, size: 128, offset: 832)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 128, elements: !445)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!445 = !{!446}
!446 = !DISubrange(count: 2)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !5, line: 570, baseType: !448, size: 64, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !393, file: !5, line: 585, baseType: !13, size: 192, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "entry_plane", scope: !393, file: !5, line: 587, baseType: !9, size: 64, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "t_in", scope: !393, file: !5, line: 589, baseType: !14, size: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "exit_plane", scope: !393, file: !5, line: 591, baseType: !9, size: 64, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "t_out", scope: !393, file: !5, line: 593, baseType: !14, size: 64, offset: 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !393, file: !5, line: 595, baseType: !13, size: 192, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "index3D", scope: !393, file: !5, line: 596, baseType: !425, size: 192, offset: 704)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "index1D", scope: !393, file: !5, line: 597, baseType: !9, size: 64, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc1D", scope: !393, file: !5, line: 600, baseType: !425, size: 192, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !393, file: !5, line: 601, baseType: !459, size: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ri_indx", scope: !381, file: !5, line: 619, baseType: !9, size: 64, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc3D", scope: !381, file: !5, line: 620, baseType: !425, size: 192, offset: 768)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rinfo", scope: !381, file: !5, line: 621, baseType: !463, size: 6080, offset: 960)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 6080, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 5)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !381, file: !5, line: 622, baseType: !467, size: 32, offset: 7040)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "R32", file: !5, line: 307, baseType: !468)
!468 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !381, file: !5, line: 623, baseType: !467, size: 32, offset: 7072)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!471 = !DILocalVariable(name: "pr", arg: 1, scope: !376, file: !1, line: 343, type: !379)
!472 = !DILocalVariable(name: "pe", arg: 2, scope: !376, file: !1, line: 343, type: !58)
!473 = !DILocalVariable(name: "hit", arg: 3, scope: !376, file: !1, line: 343, type: !261)
!474 = !DILocalVariable(name: "i", scope: !376, file: !1, line: 345, type: !9)
!475 = !DILocalVariable(name: "vindex", scope: !376, file: !1, line: 346, type: !22)
!476 = !DILocalVariable(name: "toright", scope: !376, file: !1, line: 347, type: !9)
!477 = !DILocalVariable(name: "sh", scope: !376, file: !1, line: 348, type: !9)
!478 = !DILocalVariable(name: "nsh", scope: !376, file: !1, line: 348, type: !9)
!479 = !DILocalVariable(name: "Rd_dot_Pn", scope: !376, file: !1, line: 349, type: !14)
!480 = !DILocalVariable(name: "Ro_dot_Pn", scope: !376, file: !1, line: 350, type: !14)
!481 = !DILocalVariable(name: "tval", scope: !376, file: !1, line: 351, type: !14)
!482 = !DILocalVariable(name: "x", scope: !376, file: !1, line: 352, type: !483)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 6464, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 101)
!486 = !DILocalVariable(name: "y", scope: !376, file: !1, line: 353, type: !483)
!487 = !DILocalVariable(name: "ix", scope: !376, file: !1, line: 354, type: !14)
!488 = !DILocalVariable(name: "iy", scope: !376, file: !1, line: 354, type: !14)
!489 = !DILocalVariable(name: "dx", scope: !376, file: !1, line: 355, type: !14)
!490 = !DILocalVariable(name: "dy", scope: !376, file: !1, line: 355, type: !14)
!491 = !DILocalVariable(name: "xint", scope: !376, file: !1, line: 356, type: !14)
!492 = !DILocalVariable(name: "I", scope: !376, file: !1, line: 357, type: !12)
!493 = !DILocalVariable(name: "vlist", scope: !376, file: !1, line: 358, type: !20)
!494 = !DILocalVariable(name: "vpos", scope: !376, file: !1, line: 358, type: !20)
!495 = !DILocalVariable(name: "pp", scope: !376, file: !1, line: 359, type: !3)
!496 = !DILocation(line: 0, scope: !376)
!497 = !DILocation(line: 352, column: 2, scope: !376)
!498 = !DILocation(line: 352, column: 7, scope: !376)
!499 = !DILocation(line: 353, column: 2, scope: !376)
!500 = !DILocation(line: 353, column: 7, scope: !376)
!501 = !DILocation(line: 361, column: 19, scope: !376)
!502 = !DILocation(line: 363, column: 14, scope: !376)
!503 = !DILocation(line: 365, column: 6, scope: !504)
!504 = distinct !DILexicalBlock(scope: !376, file: !1, line: 365, column: 6)
!505 = !DILocation(line: 365, column: 21, scope: !504)
!506 = !DILocation(line: 365, column: 6, scope: !376)
!507 = !DILocation(line: 368, column: 14, scope: !376)
!508 = !DILocation(line: 370, column: 15, scope: !376)
!509 = !DILocation(line: 370, column: 17, scope: !376)
!510 = !DILocation(line: 370, column: 9, scope: !376)
!511 = !DILocation(line: 370, column: 29, scope: !376)
!512 = !DILocation(line: 371, column: 11, scope: !513)
!513 = distinct !DILexicalBlock(scope: !376, file: !1, line: 371, column: 6)
!514 = !DILocation(line: 371, column: 6, scope: !376)
!515 = !DILocation(line: 374, column: 2, scope: !516)
!516 = distinct !DILexicalBlock(scope: !376, file: !1, line: 374, column: 2)
!517 = !DILocation(line: 381, column: 15, scope: !376)
!518 = !DILocation(line: 382, column: 15, scope: !376)
!519 = !DILocation(line: 384, column: 14, scope: !376)
!520 = !DILocation(line: 384, column: 2, scope: !376)
!521 = !DILocation(line: 413, column: 18, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !1, line: 413, column: 4)
!523 = distinct !DILexicalBlock(scope: !524, file: !1, line: 413, column: 4)
!524 = distinct !DILexicalBlock(scope: !376, file: !1, line: 385, column: 3)
!525 = !DILocation(line: 413, column: 4, scope: !523)
!526 = !DILocation(line: 400, column: 18, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !1, line: 400, column: 4)
!528 = distinct !DILexicalBlock(scope: !524, file: !1, line: 400, column: 4)
!529 = !DILocation(line: 400, column: 4, scope: !528)
!530 = !DILocation(line: 387, column: 18, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 387, column: 4)
!532 = distinct !DILexicalBlock(scope: !524, file: !1, line: 387, column: 4)
!533 = !DILocation(line: 387, column: 4, scope: !532)
!534 = !DILocation(line: 389, column: 21, scope: !535)
!535 = distinct !DILexicalBlock(scope: !531, file: !1, line: 388, column: 5)
!536 = !DILocation(line: 390, column: 12, scope: !535)
!537 = !DILocation(line: 390, column: 5, scope: !535)
!538 = !DILocation(line: 390, column: 10, scope: !535)
!539 = !DILocation(line: 391, column: 12, scope: !535)
!540 = !DILocation(line: 391, column: 5, scope: !535)
!541 = !DILocation(line: 391, column: 10, scope: !535)
!542 = !DILocation(line: 392, column: 11, scope: !535)
!543 = !DILocation(line: 387, column: 33, scope: !531)
!544 = distinct !{!544, !533, !545, !154, !155}
!545 = !DILocation(line: 393, column: 5, scope: !532)
!546 = !DILocation(line: 402, column: 21, scope: !547)
!547 = distinct !DILexicalBlock(scope: !527, file: !1, line: 401, column: 5)
!548 = !DILocation(line: 402, column: 18, scope: !547)
!549 = !DILocation(line: 403, column: 12, scope: !547)
!550 = !DILocation(line: 403, column: 5, scope: !547)
!551 = !DILocation(line: 403, column: 10, scope: !547)
!552 = !DILocation(line: 404, column: 12, scope: !547)
!553 = !DILocation(line: 404, column: 5, scope: !547)
!554 = !DILocation(line: 404, column: 10, scope: !547)
!555 = !DILocation(line: 405, column: 11, scope: !547)
!556 = !DILocation(line: 400, column: 33, scope: !527)
!557 = distinct !{!557, !529, !558, !154, !155}
!558 = !DILocation(line: 406, column: 5, scope: !528)
!559 = !DILocation(line: 415, column: 21, scope: !560)
!560 = distinct !DILexicalBlock(scope: !522, file: !1, line: 414, column: 5)
!561 = !DILocation(line: 415, column: 18, scope: !560)
!562 = !DILocation(line: 416, column: 12, scope: !560)
!563 = !DILocation(line: 416, column: 5, scope: !560)
!564 = !DILocation(line: 416, column: 10, scope: !560)
!565 = !DILocation(line: 417, column: 12, scope: !560)
!566 = !DILocation(line: 417, column: 5, scope: !560)
!567 = !DILocation(line: 417, column: 10, scope: !560)
!568 = !DILocation(line: 418, column: 11, scope: !560)
!569 = !DILocation(line: 413, column: 33, scope: !522)
!570 = distinct !{!570, !525, !571, !154, !155}
!571 = !DILocation(line: 419, column: 5, scope: !523)
!572 = !DILocation(line: 438, column: 18, scope: !376)
!573 = !DILocation(line: 438, column: 2, scope: !376)
!574 = !DILocation(line: 438, column: 16, scope: !376)
!575 = !DILocation(line: 439, column: 18, scope: !376)
!576 = !DILocation(line: 439, column: 2, scope: !376)
!577 = !DILocation(line: 439, column: 16, scope: !376)
!578 = !DILocation(line: 455, column: 2, scope: !579)
!579 = distinct !DILexicalBlock(scope: !376, file: !1, line: 455, column: 2)
!580 = !DILocation(line: 429, column: 16, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !1, line: 429, column: 2)
!582 = distinct !DILexicalBlock(scope: !376, file: !1, line: 429, column: 2)
!583 = !DILocation(line: 429, column: 2, scope: !582)
!584 = !DILocation(line: 431, column: 3, scope: !585)
!585 = distinct !DILexicalBlock(scope: !581, file: !1, line: 430, column: 3)
!586 = !DILocation(line: 431, column: 8, scope: !585)
!587 = !DILocation(line: 432, column: 3, scope: !585)
!588 = !DILocation(line: 432, column: 8, scope: !585)
!589 = !DILocation(line: 434, column: 7, scope: !590)
!590 = distinct !DILexicalBlock(scope: !585, file: !1, line: 434, column: 7)
!591 = !DILocation(line: 434, column: 17, scope: !590)
!592 = !DILocation(line: 434, column: 7, scope: !585)
!593 = !DILocation(line: 435, column: 9, scope: !590)
!594 = !DILocation(line: 435, column: 4, scope: !590)
!595 = !DILocation(line: 429, column: 31, scope: !581)
!596 = distinct !{!596, !583, !597, !154, !155}
!597 = !DILocation(line: 436, column: 3, scope: !582)
!598 = !DILocation(line: 448, column: 6, scope: !599)
!599 = distinct !DILexicalBlock(scope: !376, file: !1, line: 448, column: 6)
!600 = !DILocation(line: 448, column: 11, scope: !599)
!601 = !DILocation(line: 459, column: 11, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !1, line: 459, column: 7)
!603 = distinct !DILexicalBlock(scope: !604, file: !1, line: 456, column: 3)
!604 = distinct !DILexicalBlock(scope: !579, file: !1, line: 455, column: 2)
!605 = !DILocation(line: 459, column: 7, scope: !602)
!606 = !DILocation(line: 459, column: 16, scope: !602)
!607 = !DILocation(line: 464, column: 11, scope: !608)
!608 = distinct !DILexicalBlock(scope: !603, file: !1, line: 464, column: 7)
!609 = !DILocation(line: 464, column: 7, scope: !603)
!610 = !DILocation(line: 466, column: 20, scope: !611)
!611 = distinct !DILexicalBlock(scope: !608, file: !1, line: 465, column: 4)
!612 = !DILocation(line: 466, column: 18, scope: !611)
!613 = !DILocation(line: 468, column: 8, scope: !614)
!614 = distinct !DILexicalBlock(scope: !611, file: !1, line: 468, column: 8)
!615 = !DILocation(line: 468, column: 16, scope: !614)
!616 = !DILocation(line: 468, column: 8, scope: !611)
!617 = !DILocation(line: 470, column: 12, scope: !618)
!618 = distinct !DILexicalBlock(scope: !614, file: !1, line: 469, column: 5)
!619 = !DILocation(line: 470, column: 23, scope: !618)
!620 = !DILocation(line: 470, column: 21, scope: !618)
!621 = !DILocation(line: 471, column: 23, scope: !618)
!622 = !DILocation(line: 471, column: 27, scope: !618)
!623 = !DILocation(line: 471, column: 17, scope: !618)
!624 = !DILocation(line: 473, column: 14, scope: !625)
!625 = distinct !DILexicalBlock(scope: !618, file: !1, line: 473, column: 9)
!626 = !DILocation(line: 473, column: 9, scope: !618)
!627 = !DILocation(line: 474, column: 13, scope: !625)
!628 = !DILocation(line: 474, column: 6, scope: !625)
!629 = !DILocation(line: 455, column: 16, scope: !604)
!630 = distinct !{!630, !578, !631, !154, !155}
!631 = !DILocation(line: 479, column: 3, scope: !579)
!632 = !DILocation(line: 481, column: 16, scope: !633)
!633 = distinct !DILexicalBlock(scope: !376, file: !1, line: 481, column: 6)
!634 = !DILocation(line: 481, column: 6, scope: !376)
!635 = !DILocation(line: 483, column: 3, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !1, line: 483, column: 3)
!637 = distinct !DILexicalBlock(scope: !633, file: !1, line: 482, column: 3)
!638 = !DILocation(line: 484, column: 3, scope: !637)
!639 = !DILocation(line: 488, column: 2, scope: !376)
!640 = distinct !DISubprogram(name: "PolyIntersect", scope: !1, file: !1, line: 506, type: !641, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{!9, !379, !42, !261}
!643 = !{!644, !645, !646, !647, !648, !649, !650}
!644 = !DILocalVariable(name: "pr", arg: 1, scope: !640, file: !1, line: 506, type: !379)
!645 = !DILocalVariable(name: "po", arg: 2, scope: !640, file: !1, line: 506, type: !42)
!646 = !DILocalVariable(name: "hit", arg: 3, scope: !640, file: !1, line: 506, type: !261)
!647 = !DILocalVariable(name: "i", scope: !640, file: !1, line: 508, type: !9)
!648 = !DILocalVariable(name: "nhits", scope: !640, file: !1, line: 509, type: !9)
!649 = !DILocalVariable(name: "pe", scope: !640, file: !1, line: 510, type: !58)
!650 = !DILocalVariable(name: "newhit", scope: !640, file: !1, line: 511, type: !262)
!651 = !DILocation(line: 0, scope: !640)
!652 = !DILocation(line: 511, column: 2, scope: !640)
!653 = !DILocation(line: 511, column: 10, scope: !640)
!654 = !DILocation(line: 516, column: 12, scope: !640)
!655 = !DILocation(line: 517, column: 11, scope: !640)
!656 = !DILocation(line: 519, column: 22, scope: !657)
!657 = distinct !DILexicalBlock(scope: !658, file: !1, line: 519, column: 2)
!658 = distinct !DILexicalBlock(scope: !640, file: !1, line: 519, column: 2)
!659 = !DILocation(line: 519, column: 16, scope: !657)
!660 = !DILocation(line: 519, column: 2, scope: !658)
!661 = !DILocation(line: 521, column: 7, scope: !662)
!662 = distinct !DILexicalBlock(scope: !663, file: !1, line: 521, column: 7)
!663 = distinct !DILexicalBlock(scope: !657, file: !1, line: 520, column: 3)
!664 = !DILocation(line: 521, column: 7, scope: !663)
!665 = !DILocation(line: 523, column: 9, scope: !666)
!666 = distinct !DILexicalBlock(scope: !662, file: !1, line: 522, column: 4)
!667 = !DILocation(line: 524, column: 15, scope: !668)
!668 = distinct !DILexicalBlock(scope: !666, file: !1, line: 524, column: 8)
!669 = !DILocation(line: 524, column: 26, scope: !668)
!670 = !DILocation(line: 524, column: 17, scope: !668)
!671 = !DILocation(line: 524, column: 8, scope: !666)
!672 = !DILocation(line: 526, column: 18, scope: !673)
!673 = distinct !DILexicalBlock(scope: !668, file: !1, line: 525, column: 5)
!674 = !DILocation(line: 527, column: 27, scope: !673)
!675 = !DILocation(line: 527, column: 18, scope: !673)
!676 = !DILocation(line: 528, column: 5, scope: !673)
!677 = !DILocation(line: 531, column: 5, scope: !663)
!678 = !DILocation(line: 519, column: 36, scope: !657)
!679 = distinct !{!679, !660, !680, !154, !155}
!680 = !DILocation(line: 532, column: 3, scope: !658)
!681 = !DILocation(line: 535, column: 2, scope: !640)
!682 = !DILocation(line: 534, column: 2, scope: !640)
!683 = distinct !DISubprogram(name: "PolyTransform", scope: !1, file: !1, line: 559, type: !684, scopeLine: 560, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !686)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !42, !286, !286}
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!687 = !DILocalVariable(name: "po", arg: 1, scope: !683, file: !1, line: 559, type: !42)
!688 = !DILocalVariable(name: "xtrans", arg: 2, scope: !683, file: !1, line: 559, type: !286)
!689 = !DILocalVariable(name: "xinvT", arg: 3, scope: !683, file: !1, line: 559, type: !286)
!690 = !DILocalVariable(name: "i", scope: !683, file: !1, line: 561, type: !9)
!691 = !DILocalVariable(name: "numelems", scope: !683, file: !1, line: 562, type: !9)
!692 = !DILocalVariable(name: "vptr", scope: !683, file: !1, line: 563, type: !20)
!693 = !DILocalVariable(name: "vp", scope: !683, file: !1, line: 563, type: !20)
!694 = !DILocalVariable(name: "norm", scope: !683, file: !1, line: 564, type: !296)
!695 = !DILocalVariable(name: "coord", scope: !683, file: !1, line: 564, type: !296)
!696 = !DILocalVariable(name: "pp", scope: !683, file: !1, line: 565, type: !3)
!697 = !DILocalVariable(name: "pe", scope: !683, file: !1, line: 566, type: !58)
!698 = !DILocation(line: 0, scope: !683)
!699 = !DILocation(line: 564, column: 2, scope: !683)
!700 = !DILocation(line: 564, column: 7, scope: !683)
!701 = !DILocation(line: 564, column: 13, scope: !683)
!702 = !DILocation(line: 569, column: 11, scope: !683)
!703 = !DILocation(line: 570, column: 17, scope: !683)
!704 = !DILocation(line: 574, column: 21, scope: !683)
!705 = !DILocation(line: 575, column: 13, scope: !683)
!706 = !DILocation(line: 577, column: 13, scope: !683)
!707 = !DILocation(line: 577, column: 11, scope: !683)
!708 = !DILocation(line: 578, column: 13, scope: !683)
!709 = !DILocation(line: 578, column: 2, scope: !683)
!710 = !DILocation(line: 578, column: 11, scope: !683)
!711 = !DILocation(line: 579, column: 13, scope: !683)
!712 = !DILocation(line: 579, column: 2, scope: !683)
!713 = !DILocation(line: 579, column: 11, scope: !683)
!714 = !DILocation(line: 580, column: 2, scope: !683)
!715 = !DILocation(line: 582, column: 18, scope: !683)
!716 = !DILocation(line: 582, column: 31, scope: !683)
!717 = !DILocation(line: 603, column: 16, scope: !718)
!718 = distinct !DILexicalBlock(scope: !719, file: !1, line: 603, column: 2)
!719 = distinct !DILexicalBlock(scope: !683, file: !1, line: 603, column: 2)
!720 = !DILocation(line: 603, column: 2, scope: !719)
!721 = !DILocation(line: 586, column: 3, scope: !722)
!722 = distinct !DILexicalBlock(scope: !683, file: !1, line: 583, column: 3)
!723 = !DILocation(line: 588, column: 16, scope: !722)
!724 = !DILocation(line: 588, column: 14, scope: !722)
!725 = !DILocation(line: 589, column: 16, scope: !722)
!726 = !DILocation(line: 589, column: 3, scope: !722)
!727 = !DILocation(line: 589, column: 14, scope: !722)
!728 = !DILocation(line: 590, column: 16, scope: !722)
!729 = !DILocation(line: 590, column: 3, scope: !722)
!730 = !DILocation(line: 590, column: 14, scope: !722)
!731 = !DILocation(line: 592, column: 7, scope: !722)
!732 = !DILocation(line: 594, column: 14, scope: !722)
!733 = !DILocation(line: 594, column: 12, scope: !722)
!734 = !DILocation(line: 595, column: 14, scope: !722)
!735 = !DILocation(line: 595, column: 12, scope: !722)
!736 = !DILocation(line: 596, column: 14, scope: !722)
!737 = !DILocation(line: 596, column: 12, scope: !722)
!738 = distinct !{!738, !739, !740, !154, !155}
!739 = !DILocation(line: 582, column: 2, scope: !683)
!740 = !DILocation(line: 598, column: 3, scope: !683)
!741 = !DILocation(line: 605, column: 20, scope: !742)
!742 = distinct !DILexicalBlock(scope: !718, file: !1, line: 604, column: 3)
!743 = !DILocation(line: 609, column: 17, scope: !742)
!744 = !DILocation(line: 609, column: 13, scope: !742)
!745 = !DILocation(line: 609, column: 11, scope: !742)
!746 = !DILocation(line: 610, column: 13, scope: !742)
!747 = !DILocation(line: 610, column: 11, scope: !742)
!748 = !DILocation(line: 611, column: 13, scope: !742)
!749 = !DILocation(line: 611, column: 11, scope: !742)
!750 = !DILocation(line: 612, column: 11, scope: !742)
!751 = !DILocation(line: 614, column: 3, scope: !742)
!752 = !DILocation(line: 615, column: 3, scope: !742)
!753 = !DILocation(line: 617, column: 17, scope: !742)
!754 = !DILocation(line: 617, column: 15, scope: !742)
!755 = !DILocation(line: 618, column: 17, scope: !742)
!756 = !DILocation(line: 618, column: 15, scope: !742)
!757 = !DILocation(line: 619, column: 17, scope: !742)
!758 = !DILocation(line: 619, column: 15, scope: !742)
!759 = !DILocation(line: 624, column: 12, scope: !742)
!760 = !DILocation(line: 624, column: 25, scope: !742)
!761 = !DILocation(line: 624, column: 19, scope: !742)
!762 = !DILocation(line: 624, column: 17, scope: !742)
!763 = !DILocation(line: 625, column: 25, scope: !742)
!764 = !DILocation(line: 625, column: 48, scope: !742)
!765 = !DILocation(line: 625, column: 47, scope: !742)
!766 = !DILocation(line: 625, column: 34, scope: !742)
!767 = !DILocation(line: 625, column: 71, scope: !742)
!768 = !DILocation(line: 625, column: 57, scope: !742)
!769 = !DILocation(line: 625, column: 11, scope: !742)
!770 = !DILocation(line: 625, column: 7, scope: !742)
!771 = !DILocation(line: 625, column: 9, scope: !742)
!772 = !DILocation(line: 630, column: 13, scope: !742)
!773 = !DILocation(line: 630, column: 11, scope: !742)
!774 = !DILocation(line: 631, column: 13, scope: !742)
!775 = !DILocation(line: 631, column: 11, scope: !742)
!776 = !DILocation(line: 632, column: 13, scope: !742)
!777 = !DILocation(line: 632, column: 11, scope: !742)
!778 = !DILocation(line: 634, column: 15, scope: !779)
!779 = distinct !DILexicalBlock(scope: !742, file: !1, line: 634, column: 7)
!780 = !DILocation(line: 634, column: 26, scope: !779)
!781 = !DILocation(line: 635, column: 8, scope: !779)
!782 = !DILocation(line: 635, column: 18, scope: !779)
!783 = !DILocation(line: 635, column: 4, scope: !779)
!784 = !DILocation(line: 637, column: 15, scope: !785)
!785 = distinct !DILexicalBlock(scope: !779, file: !1, line: 637, column: 7)
!786 = !DILocation(line: 637, column: 26, scope: !785)
!787 = !DILocation(line: 0, scope: !785)
!788 = !DILocation(line: 638, column: 18, scope: !785)
!789 = !DILocation(line: 638, column: 4, scope: !785)
!790 = !DILocation(line: 640, column: 18, scope: !785)
!791 = !DILocation(line: 642, column: 5, scope: !742)
!792 = !DILocation(line: 603, column: 29, scope: !718)
!793 = distinct !{!793, !720, !794, !154, !155}
!794 = !DILocation(line: 643, column: 3, scope: !719)
!795 = !DILocation(line: 644, column: 2, scope: !683)
!796 = !DISubprogram(name: "VecNorm", scope: !5, file: !5, line: 892, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !270}
!799 = distinct !DISubprogram(name: "PolyRead", scope: !1, file: !1, line: 661, type: !800, scopeLine: 662, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !862)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !42, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !804, line: 7, baseType: !805)
!804 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !806, line: 49, size: 1728, elements: !807)
!806 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!807 = !{!808, !810, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !825, !827, !828, !829, !832, !834, !836, !840, !843, !845, !848, !851, !852, !854, !857, !858}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !805, file: !806, line: 51, baseType: !809, size: 32)
!809 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !805, file: !806, line: 54, baseType: !811, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !805, file: !806, line: 55, baseType: !811, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !805, file: !806, line: 56, baseType: !811, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !805, file: !806, line: 57, baseType: !811, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !805, file: !806, line: 58, baseType: !811, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !805, file: !806, line: 59, baseType: !811, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !805, file: !806, line: 60, baseType: !811, size: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !805, file: !806, line: 61, baseType: !811, size: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !805, file: !806, line: 64, baseType: !811, size: 64, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !805, file: !806, line: 65, baseType: !811, size: 64, offset: 640)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !805, file: !806, line: 66, baseType: !811, size: 64, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !805, file: !806, line: 68, baseType: !823, size: 64, offset: 768)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !806, line: 36, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !805, file: !806, line: 70, baseType: !826, size: 64, offset: 832)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !805, file: !806, line: 72, baseType: !809, size: 32, offset: 896)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !805, file: !806, line: 73, baseType: !809, size: 32, offset: 928)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !805, file: !806, line: 74, baseType: !830, size: 64, offset: 960)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !831, line: 152, baseType: !10)
!831 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !805, file: !806, line: 77, baseType: !833, size: 16, offset: 1024)
!833 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !805, file: !806, line: 78, baseType: !835, size: 8, offset: 1040)
!835 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !805, file: !806, line: 79, baseType: !837, size: 8, offset: 1048)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 1)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !805, file: !806, line: 81, baseType: !841, size: 64, offset: 1088)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !806, line: 43, baseType: null)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !805, file: !806, line: 89, baseType: !844, size: 64, offset: 1152)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !831, line: 153, baseType: !10)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !805, file: !806, line: 91, baseType: !846, size: 64, offset: 1216)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !806, line: 37, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !805, file: !806, line: 92, baseType: !849, size: 64, offset: 1280)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !806, line: 38, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !805, file: !806, line: 93, baseType: !826, size: 64, offset: 1344)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !805, file: !806, line: 94, baseType: !853, size: 64, offset: 1408)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !805, file: !806, line: 95, baseType: !855, size: 64, offset: 1472)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !856, line: 46, baseType: !420)
!856 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !805, file: !806, line: 96, baseType: !809, size: 32, offset: 1536)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !805, file: !806, line: 98, baseType: !859, size: 160, offset: 1568)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 20)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !872, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!863 = !DILocalVariable(name: "po", arg: 1, scope: !799, file: !1, line: 661, type: !42)
!864 = !DILocalVariable(name: "pf", arg: 2, scope: !799, file: !1, line: 661, type: !802)
!865 = !DILocalVariable(name: "i", scope: !799, file: !1, line: 663, type: !9)
!866 = !DILocalVariable(name: "j", scope: !799, file: !1, line: 663, type: !9)
!867 = !DILocalVariable(name: "instat", scope: !799, file: !1, line: 664, type: !9)
!868 = !DILocalVariable(name: "vindex", scope: !799, file: !1, line: 665, type: !22)
!869 = !DILocalVariable(name: "totalverts", scope: !799, file: !1, line: 666, type: !9)
!870 = !DILocalVariable(name: "normstr", scope: !799, file: !1, line: 667, type: !871)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 40, elements: !464)
!872 = !DILocalVariable(name: "pnormals", scope: !799, file: !1, line: 668, type: !873)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !5, line: 299, baseType: !420)
!874 = !DILocalVariable(name: "pnorm", scope: !799, file: !1, line: 669, type: !12)
!875 = !DILocalVariable(name: "vlist", scope: !799, file: !1, line: 670, type: !20)
!876 = !DILocalVariable(name: "vptr", scope: !799, file: !1, line: 670, type: !20)
!877 = !DILocalVariable(name: "vp", scope: !799, file: !1, line: 670, type: !20)
!878 = !DILocalVariable(name: "vptmp", scope: !799, file: !1, line: 671, type: !20)
!879 = !DILocalVariable(name: "vptmp2", scope: !799, file: !1, line: 671, type: !20)
!880 = !DILocalVariable(name: "tmppnt", scope: !799, file: !1, line: 672, type: !12)
!881 = !DILocalVariable(name: "tmppnt2", scope: !799, file: !1, line: 672, type: !12)
!882 = !DILocalVariable(name: "cross", scope: !799, file: !1, line: 672, type: !12)
!883 = !DILocalVariable(name: "pp", scope: !799, file: !1, line: 673, type: !3)
!884 = !DILocalVariable(name: "pe", scope: !799, file: !1, line: 674, type: !58)
!885 = !DILocation(line: 0, scope: !799)
!886 = !DILocation(line: 666, column: 2, scope: !799)
!887 = !DILocation(line: 667, column: 2, scope: !799)
!888 = !DILocation(line: 667, column: 7, scope: !799)
!889 = !DILocation(line: 677, column: 11, scope: !799)
!890 = !DILocation(line: 681, column: 11, scope: !799)
!891 = !DILocation(line: 683, column: 13, scope: !892)
!892 = distinct !DILexicalBlock(scope: !799, file: !1, line: 683, column: 6)
!893 = !DILocation(line: 683, column: 6, scope: !799)
!894 = !DILocation(line: 685, column: 3, scope: !895)
!895 = distinct !DILexicalBlock(scope: !892, file: !1, line: 684, column: 3)
!896 = !DILocation(line: 686, column: 3, scope: !895)
!897 = !DILocation(line: 689, column: 40, scope: !799)
!898 = !DILocation(line: 689, column: 35, scope: !799)
!899 = !DILocation(line: 689, column: 10, scope: !799)
!900 = !DILocation(line: 690, column: 37, scope: !799)
!901 = !DILocation(line: 690, column: 35, scope: !799)
!902 = !DILocation(line: 690, column: 10, scope: !799)
!903 = !DILocation(line: 696, column: 11, scope: !799)
!904 = !DILocation(line: 698, column: 13, scope: !905)
!905 = distinct !DILexicalBlock(scope: !799, file: !1, line: 698, column: 6)
!906 = !DILocation(line: 698, column: 6, scope: !799)
!907 = !DILocation(line: 700, column: 3, scope: !908)
!908 = distinct !DILexicalBlock(scope: !905, file: !1, line: 699, column: 3)
!909 = !DILocation(line: 701, column: 3, scope: !908)
!910 = !DILocation(line: 704, column: 14, scope: !799)
!911 = !DILocation(line: 704, column: 25, scope: !799)
!912 = !DILocation(line: 709, column: 18, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !1, line: 709, column: 2)
