; ModuleID = 'rad_main.c'
source_filename = "rad_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.slider = type { ptr, i64, i64, i64, i64, ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.Timing = type { i64, i64, i64, i64, i64 }
%struct.Global = type { i64, %union.pthread_mutex_t, [1024 x %struct.Task_Queue], [3276800 x %struct._task], %union.pthread_mutex_t, ptr, %union.pthread_mutex_t, i64, %struct.Rgb, %struct.Rgb, float, i64, %union.pthread_mutex_t, i64, i64, [1024 x %struct.Patch_Cost], %struct.anon, i64, %union.pthread_mutex_t, i64, %union.pthread_mutex_t, %union.pthread_mutex_t, ptr, i64, i64, [1024 x %struct._patch], %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, i64, ptr, %union.pthread_mutex_t, i64, ptr, [3900 x %struct.Shared_Lock], [1024 x %struct.StatisticalInfo] }
%struct.Task_Queue = type { [4096 x i8], %union.pthread_mutex_t, ptr, ptr, i64, %union.pthread_mutex_t, i64, ptr, [4096 x i8] }
%struct._task = type { i64, ptr, %union.anon }
%union.anon = type { %struct.Refinement_Task }
%struct.Refinement_Task = type { ptr, ptr, float, i64 }
%struct.Rgb = type { float, float, float }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__threads__", scope: !2, file: !3, line: 52, type: !23, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !381, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "rad_main.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "ff6cff6222bb49dd444d654ae16832a8")
!4 = !{!5, !366, !367, !376, !379, !10, !380, !81}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "Global", file: !3, line: 1017, baseType: !7)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 950, size: 1404379648, elements: !8)
!8 = !{!9, !11, !44, !230, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !259, !304, !305, !306, !307, !308, !309, !310, !311, !312, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !332}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !7, file: !3, line: 954, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "index_lock", scope: !7, file: !3, line: 955, baseType: !12, size: 320, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !13, line: 72, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!14 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !13, line: 67, size: 320, elements: !15)
!15 = !{!16, !38, !43}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !14, file: !13, line: 69, baseType: !17, size: 320)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !18, line: 22, size: 320, elements: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!19 = !{!20, !22, !24, !25, !26, !27, !29, !30}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !17, file: !18, line: 24, baseType: !21, size: 32)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !17, file: !18, line: 25, baseType: !23, size: 32, offset: 32)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !17, file: !18, line: 26, baseType: !21, size: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !17, file: !18, line: 28, baseType: !23, size: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !17, file: !18, line: 32, baseType: !21, size: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !17, file: !18, line: 34, baseType: !28, size: 16, offset: 160)
!28 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !17, file: !18, line: 35, baseType: !28, size: 16, offset: 176)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !17, file: !18, line: 36, baseType: !31, size: 128, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !32, line: 53, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !32, line: 49, size: 128, elements: !34)
!34 = !{!35, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !33, file: !32, line: 51, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !33, file: !32, line: 52, baseType: !36, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !14, file: !13, line: 70, baseType: !39, size: 320)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 320, elements: !41)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !{!42}
!42 = !DISubrange(count: 40)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !14, file: !13, line: 71, baseType: !10, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "task_queue", scope: !7, file: !3, line: 956, baseType: !45, size: 68091904, offset: 384)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 68091904, elements: !228)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "Task_Queue", file: !3, line: 686, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 675, size: 66496, elements: !48)
!48 = !{!49, !53, !54, !222, !223, !224, !225, !226, !227}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !47, file: !3, line: 676, baseType: !50, size: 32768)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32768, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 4096)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "q_lock", scope: !47, file: !3, line: 678, baseType: !12, size: 320, offset: 32768)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !47, file: !3, line: 679, baseType: !55, size: 64, offset: 33088)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "Task", file: !3, line: 672, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_task", file: !3, line: 661, size: 384, elements: !58)
!58 = !{!59, !60, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "task_type", scope: !57, file: !3, line: 662, baseType: !10, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !57, file: !3, line: 663, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !57, file: !3, line: 671, baseType: !63, size: 256, offset: 128)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !57, file: !3, line: 664, size: 256, elements: !64)
!64 = !{!65, !95, !188, !196, !202, !215}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !63, file: !3, line: 665, baseType: !66, size: 128)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "Modeling_Task", file: !3, line: 610, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 607, size: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !3, line: 608, baseType: !10, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !67, file: !3, line: 609, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "Model", file: !3, line: 521, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 517, size: 576, elements: !74)
!74 = !{!75, !84, !85}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !73, file: !3, line: 518, baseType: !76, size: 96)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "Rgb", file: !77, line: 24, baseType: !78)
!77 = !DIFile(filename: "./glibps/../structs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "127502bb3b1b1ffc96492ea685802424")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 22, size: 96, elements: !79)
!79 = !{!80, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !78, file: !77, line: 23, baseType: !81, size: 32)
!81 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !78, file: !77, line: 23, baseType: !81, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !78, file: !77, line: 23, baseType: !81, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "emittance", scope: !73, file: !3, line: 519, baseType: !76, size: 96, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy", scope: !73, file: !3, line: 520, baseType: !86, size: 384, offset: 192)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 384, elements: !93)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vertex", file: !77, line: 14, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 12, size: 96, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !88, file: !77, line: 13, baseType: !81, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !88, file: !77, line: 13, baseType: !81, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !88, file: !77, line: 13, baseType: !81, size: 32, offset: 64)
!93 = !{!94}
!94 = !DISubrange(count: 4)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bsp", scope: !63, file: !3, line: 666, baseType: !96, size: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "BSP_Task", file: !3, line: 617, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 614, size: 128, elements: !98)
!98 = !{!99, !187}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !97, file: !3, line: 615, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "Patch", file: !3, line: 356, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_patch", file: !3, line: 340, size: 1344, elements: !103)
!103 = !{!104, !118, !119, !120, !131, !132, !133, !134, !135, !136, !142, !143, !144, !145, !147, !148, !149, !186}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !102, file: !3, line: 341, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElemVertex", file: !3, line: 264, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_elemvertex", file: !3, line: 259, size: 320, elements: !108)
!108 = !{!109, !110, !111, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !107, file: !3, line: 260, baseType: !87, size: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !107, file: !3, line: 261, baseType: !76, size: 96, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !107, file: !3, line: 262, baseType: !81, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ev_lock", scope: !107, file: !3, line: 263, baseType: !113, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "Shared_Lock", file: !3, line: 125, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 122, size: 320, elements: !116)
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !115, file: !3, line: 124, baseType: !12, size: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !102, file: !3, line: 341, baseType: !105, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !102, file: !3, line: 341, baseType: !105, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !102, file: !3, line: 342, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "Edge", file: !3, line: 287, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_edge", file: !3, line: 283, size: 320, elements: !124)
!124 = !{!125, !126, !127, !129, !130}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !123, file: !3, line: 284, baseType: !105, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !123, file: !3, line: 284, baseType: !105, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ea", scope: !123, file: !3, line: 285, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "eb", scope: !123, file: !3, line: 285, baseType: !128, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "edge_lock", scope: !123, file: !3, line: 286, baseType: !113, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !102, file: !3, line: 342, baseType: !121, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !102, file: !3, line: 342, baseType: !121, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !102, file: !3, line: 343, baseType: !87, size: 96, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !102, file: !3, line: 343, baseType: !87, size: 96, offset: 480)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "p3", scope: !102, file: !3, line: 343, baseType: !87, size: 96, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "plane_equ", scope: !102, file: !3, line: 344, baseType: !137, size: 128, offset: 672)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PlaneEqu", file: !3, line: 312, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 308, size: 128, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !138, file: !3, line: 309, baseType: !87, size: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !138, file: !3, line: 310, baseType: !81, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !102, file: !3, line: 345, baseType: !81, size: 32, offset: 800)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !102, file: !3, line: 346, baseType: !76, size: 96, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "emittance", scope: !102, file: !3, line: 348, baseType: !76, size: 96, offset: 928)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_positive", scope: !102, file: !3, line: 350, baseType: !146, size: 64, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_negative", scope: !102, file: !3, line: 351, baseType: !146, size: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_parent", scope: !102, file: !3, line: 352, baseType: !146, size: 64, offset: 1152)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "el_root", scope: !102, file: !3, line: 354, baseType: !150, size: 64, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !3, line: 396, size: 1536, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "elem_lock", scope: !151, file: !3, line: 397, baseType: !113, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !151, file: !3, line: 398, baseType: !100, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !151, file: !3, line: 400, baseType: !150, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !151, file: !3, line: 401, baseType: !150, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !151, file: !3, line: 402, baseType: !150, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !151, file: !3, line: 403, baseType: !150, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !151, file: !3, line: 404, baseType: !150, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "interactions", scope: !151, file: !3, line: 406, baseType: !161, size: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interact", file: !3, line: 442, size: 256, elements: !163)
!163 = !{!164, !165, !168, !169, !170, !171}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !3, line: 443, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !162, file: !3, line: 444, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "Element", file: !3, line: 421, baseType: !151)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_out", scope: !162, file: !3, line: 445, baseType: !81, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_err", scope: !162, file: !3, line: 446, baseType: !81, size: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "area_ratio", scope: !162, file: !3, line: 447, baseType: !81, size: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !162, file: !3, line: 448, baseType: !81, size: 32, offset: 224)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "n_interactions", scope: !151, file: !3, line: 407, baseType: !10, size: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "vis_undef_inter", scope: !151, file: !3, line: 408, baseType: !161, size: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "n_vis_undef_inter", scope: !151, file: !3, line: 409, baseType: !10, size: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !151, file: !3, line: 411, baseType: !76, size: 96, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "rad_in", scope: !151, file: !3, line: 413, baseType: !76, size: 96, offset: 800)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rad_subtree", scope: !151, file: !3, line: 414, baseType: !76, size: 96, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "join_counter", scope: !151, file: !3, line: 416, baseType: !10, size: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !151, file: !3, line: 418, baseType: !105, size: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !151, file: !3, line: 418, baseType: !105, size: 64, offset: 1152)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !151, file: !3, line: 418, baseType: !105, size: 64, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !151, file: !3, line: 419, baseType: !121, size: 64, offset: 1280)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !151, file: !3, line: 419, baseType: !121, size: 64, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !151, file: !3, line: 419, baseType: !121, size: 64, offset: 1408)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !151, file: !3, line: 420, baseType: !81, size: 32, offset: 1472)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "seq_no", scope: !102, file: !3, line: 355, baseType: !10, size: 64, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !97, file: !3, line: 616, baseType: !100, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !63, file: !3, line: 667, baseType: !189, size: 256)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "Refinement_Task", file: !3, line: 625, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 621, size: 256, elements: !191)
!191 = !{!192, !193, !194, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "e1", scope: !190, file: !3, line: 622, baseType: !166, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "e2", scope: !190, file: !3, line: 622, baseType: !166, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !190, file: !3, line: 623, baseType: !81, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !190, file: !3, line: 624, baseType: !10, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ray", scope: !63, file: !3, line: 668, baseType: !197, size: 128)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ray_Task", file: !3, line: 631, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 628, size: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ray_type", scope: !198, file: !3, line: 629, baseType: !10, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !198, file: !3, line: 630, baseType: !166, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "vis", scope: !63, file: !3, line: 669, baseType: !203, size: 256)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visibility_Task", file: !3, line: 639, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 634, size: 256, elements: !205)
!205 = !{!206, !207, !210, !211}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !204, file: !3, line: 635, baseType: !166, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !204, file: !3, line: 636, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "Interaction", file: !3, line: 449, baseType: !162)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "n_inter", scope: !204, file: !3, line: 637, baseType: !10, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !204, file: !3, line: 638, baseType: !212, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, null}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !63, file: !3, line: 670, baseType: !216, size: 192)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "RadAvg_Task", file: !3, line: 650, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 646, size: 192, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !217, file: !3, line: 647, baseType: !166, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !217, file: !3, line: 648, baseType: !10, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !217, file: !3, line: 649, baseType: !10, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !47, file: !3, line: 679, baseType: !55, size: 64, offset: 33152)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "n_tasks", scope: !47, file: !3, line: 680, baseType: !10, size: 64, offset: 33216)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f_lock", scope: !47, file: !3, line: 681, baseType: !12, size: 320, offset: 33280)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "n_free", scope: !47, file: !3, line: 682, baseType: !10, size: 64, offset: 33600)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !47, file: !3, line: 683, baseType: !55, size: 64, offset: 33664)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !47, file: !3, line: 684, baseType: !50, size: 32768, offset: 33728)
!228 = !{!229}
!229 = !DISubrange(count: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "task_buf", scope: !7, file: !3, line: 957, baseType: !231, size: 1258291200, offset: 68092288)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 1258291200, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 3276800)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_tree_lock", scope: !7, file: !3, line: 960, baseType: !12, size: 320, offset: 1326383488)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_root", scope: !7, file: !3, line: 961, baseType: !100, size: 64, offset: 1326383808)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "avg_radiosity_lock", scope: !7, file: !3, line: 964, baseType: !12, size: 320, offset: 1326383872)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !7, file: !3, line: 965, baseType: !10, size: 64, offset: 1326384192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prev_total_energy", scope: !7, file: !3, line: 966, baseType: !76, size: 96, offset: 1326384256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "total_energy", scope: !7, file: !3, line: 967, baseType: !76, size: 96, offset: 1326384352)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "total_patch_area", scope: !7, file: !3, line: 968, baseType: !81, size: 32, offset: 1326384448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "iteration_count", scope: !7, file: !3, line: 969, baseType: !10, size: 64, offset: 1326384512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cost_sum_lock", scope: !7, file: !3, line: 972, baseType: !12, size: 320, offset: 1326384576)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cost_sum", scope: !7, file: !3, line: 973, baseType: !10, size: 64, offset: 1326384896)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cost_estimate_sum", scope: !7, file: !3, line: 974, baseType: !10, size: 64, offset: 1326384960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "patch_cost", scope: !7, file: !3, line: 975, baseType: !246, size: 1048576, offset: 1326385024)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 1048576, elements: !228)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "Patch_Cost", file: !3, line: 366, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 359, size: 1024, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !248, file: !3, line: 360, baseType: !100, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cost_lock", scope: !248, file: !3, line: 361, baseType: !113, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "n_bsp_node", scope: !248, file: !3, line: 362, baseType: !10, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "n_total_inter", scope: !248, file: !3, line: 363, baseType: !10, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cost_estimate", scope: !248, file: !3, line: 364, baseType: !10, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cost_history", scope: !248, file: !3, line: 365, baseType: !256, size: 704, offset: 320)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 704, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 11)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "barrier", scope: !7, file: !3, line: 978, baseType: !260, size: 768, offset: 1327433600)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !7, file: !3, line: 978, size: 768, elements: !261)
!261 = !{!262, !263, !303}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !260, file: !3, line: 978, baseType: !12, size: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !260, file: !3, line: 978, baseType: !264, size: 384, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !13, line: 80, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !13, line: 75, size: 384, elements: !266)
!266 = !{!267, !297, !301}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !265, file: !13, line: 77, baseType: !268, size: 384)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !32, line: 92, size: 384, elements: !269)
!269 = !{!270, !280, !289, !293, !294, !295, !296}
!270 = !DIDerivedType(tag: DW_TAG_member, scope: !268, file: !32, line: 94, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !268, file: !32, line: 94, size: 64, elements: !272)
!272 = !{!273, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !271, file: !32, line: 96, baseType: !274, size: 64)
!274 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !271, file: !32, line: 101, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !271, file: !32, line: 97, size: 64, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !276, file: !32, line: 99, baseType: !23, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !276, file: !32, line: 100, baseType: !23, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, scope: !268, file: !32, line: 103, baseType: !281, size: 64, offset: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !268, file: !32, line: 103, size: 64, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !281, file: !32, line: 105, baseType: !274, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !281, file: !32, line: 110, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !32, line: 106, size: 64, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !285, file: !32, line: 108, baseType: !23, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !285, file: !32, line: 109, baseType: !23, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !268, file: !32, line: 112, baseType: !290, size: 64, offset: 128)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 64, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 2)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !268, file: !32, line: 113, baseType: !290, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !268, file: !32, line: 114, baseType: !23, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !268, file: !32, line: 115, baseType: !23, size: 32, offset: 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !268, file: !32, line: 116, baseType: !290, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !265, file: !13, line: 78, baseType: !298, size: 384)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 384, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 48)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !265, file: !13, line: 79, baseType: !302, size: 64)
!302 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !260, file: !3, line: 978, baseType: !23, size: 32, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pbar_count", scope: !7, file: !3, line: 981, baseType: !10, size: 64, offset: 1327434368)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pbar_lock", scope: !7, file: !3, line: 982, baseType: !12, size: 320, offset: 1327434432)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "task_counter", scope: !7, file: !3, line: 985, baseType: !10, size: 64, offset: 1327434752)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "task_counter_lock", scope: !7, file: !3, line: 986, baseType: !12, size: 320, offset: 1327434816)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "free_patch_lock", scope: !7, file: !3, line: 989, baseType: !12, size: 320, offset: 1327435136)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "free_patch", scope: !7, file: !3, line: 990, baseType: !100, size: 64, offset: 1327435456)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "n_total_patches", scope: !7, file: !3, line: 991, baseType: !10, size: 64, offset: 1327435520)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "n_free_patches", scope: !7, file: !3, line: 992, baseType: !10, size: 64, offset: 1327435584)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "patch_buf", scope: !7, file: !3, line: 993, baseType: !313, size: 1376256, offset: 1327435648)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 1376256, elements: !228)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "free_element_lock", scope: !7, file: !3, line: 995, baseType: !12, size: 320, offset: 1328811904)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "free_element", scope: !7, file: !3, line: 996, baseType: !166, size: 64, offset: 1328812224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "n_free_elements", scope: !7, file: !3, line: 997, baseType: !10, size: 64, offset: 1328812288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "element_buf", scope: !7, file: !3, line: 998, baseType: !166, size: 64, offset: 1328812352)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "free_interaction_lock", scope: !7, file: !3, line: 1000, baseType: !12, size: 320, offset: 1328812416)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "free_interaction", scope: !7, file: !3, line: 1001, baseType: !208, size: 64, offset: 1328812736)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "n_free_interactions", scope: !7, file: !3, line: 1002, baseType: !10, size: 64, offset: 1328812800)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "interaction_buf", scope: !7, file: !3, line: 1003, baseType: !208, size: 64, offset: 1328812864)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "free_elemvertex_lock", scope: !7, file: !3, line: 1005, baseType: !12, size: 320, offset: 1328812928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "free_elemvertex", scope: !7, file: !3, line: 1006, baseType: !10, size: 64, offset: 1328813248)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "elemvertex_buf", scope: !7, file: !3, line: 1007, baseType: !105, size: 64, offset: 1328813312)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "free_edge_lock", scope: !7, file: !3, line: 1009, baseType: !12, size: 320, offset: 1328813376)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "free_edge", scope: !7, file: !3, line: 1010, baseType: !10, size: 64, offset: 1328813696)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "edge_buf", scope: !7, file: !3, line: 1011, baseType: !121, size: 64, offset: 1328813760)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sh_lock", scope: !7, file: !3, line: 1013, baseType: !329, size: 1248000, offset: 1328813824)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 1248000, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 3900)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "stat_info", scope: !7, file: !3, line: 1015, baseType: !333, size: 74317824, offset: 1330061824)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 74317824, elements: !228)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "StatisticalInfo", file: !3, line: 937, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 917, size: 72576, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !352, !365}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !335, file: !3, line: 919, baseType: !50, size: 32768)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "total_modeling_tasks", scope: !335, file: !3, line: 921, baseType: !10, size: 64, offset: 32768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "total_def_patch_tasks", scope: !335, file: !3, line: 922, baseType: !10, size: 64, offset: 32832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "total_ff_ref_tasks", scope: !335, file: !3, line: 923, baseType: !10, size: 64, offset: 32896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "total_ray_tasks", scope: !335, file: !3, line: 924, baseType: !10, size: 64, offset: 32960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "total_radavg_tasks", scope: !335, file: !3, line: 925, baseType: !10, size: 64, offset: 33024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "total_direct_radavg_tasks", scope: !335, file: !3, line: 926, baseType: !10, size: 64, offset: 33088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "total_interaction_comp", scope: !335, file: !3, line: 927, baseType: !10, size: 64, offset: 33152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "total_visibility_comp", scope: !335, file: !3, line: 928, baseType: !10, size: 64, offset: 33216)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "partially_visible", scope: !335, file: !3, line: 929, baseType: !10, size: 64, offset: 33280)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "total_ray_intersect_test", scope: !335, file: !3, line: 930, baseType: !10, size: 64, offset: 33344)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "total_patch_cache_check", scope: !335, file: !3, line: 931, baseType: !10, size: 64, offset: 33408)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "total_patch_cache_hit", scope: !335, file: !3, line: 932, baseType: !10, size: 64, offset: 33472)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "patch_cache_hit", scope: !335, file: !3, line: 933, baseType: !351, size: 128, offset: 33536)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, elements: !291)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "per_iteration", scope: !335, file: !3, line: 934, baseType: !353, size: 6144, offset: 33664)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 6144, elements: !363)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerIterationInfo", file: !3, line: 914, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 906, size: 384, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_comp", scope: !355, file: !3, line: 908, baseType: !10, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ray_intersect_test", scope: !355, file: !3, line: 909, baseType: !10, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tasks_from_myq", scope: !355, file: !3, line: 910, baseType: !10, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tasks_from_otherq", scope: !355, file: !3, line: 911, baseType: !10, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "process_tasks_wait", scope: !355, file: !3, line: 912, baseType: !10, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "last_pr_task", scope: !355, file: !3, line: 913, baseType: !150, size: 64, offset: 320)
!363 = !{!364}
!364 = !DISubrange(count: 16)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !335, file: !3, line: 935, baseType: !50, size: 32768, offset: 39808)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timing", file: !3, line: 948, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 945, size: 320, elements: !370)
!370 = !{!371, !372, !373, !374, !375}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "rad_start", scope: !369, file: !3, line: 947, baseType: !10, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rad_time", scope: !369, file: !3, line: 947, baseType: !10, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "refine_time", scope: !369, file: !3, line: 947, baseType: !10, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !369, file: !3, line: 947, baseType: !10, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_time", scope: !369, file: !3, line: 947, baseType: !10, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!379, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!380 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!381 = !{!0, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !406, !408, !410, !426, !439, !474, !481, !483, !485, !487, !490, !492, !494, !496, !498, !500, !502, !504, !506, !508, !510, !512, !514}
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "MAX_ELEMENTS", scope: !2, file: !3, line: 1192, type: !10, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "MAX_INTERACTIONS", scope: !2, file: !3, line: 1193, type: !10, isLocal: false, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "MAX_ELEMVERTICES", scope: !2, file: !3, line: 1194, type: !10, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "MAX_EDGES", scope: !2, file: !3, line: 1195, type: !10, isLocal: false, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "n_processors", scope: !2, file: !3, line: 1203, type: !10, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "n_taskqueues", scope: !2, file: !3, line: 1204, type: !10, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "n_tasks_per_queue", scope: !2, file: !3, line: 1205, type: !10, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "N_inter_parallel_bf_refine", scope: !2, file: !3, line: 1206, type: !10, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "N_visibility_per_task", scope: !2, file: !3, line: 1207, type: !10, isLocal: false, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "Area_epsilon", scope: !2, file: !3, line: 1208, type: !81, isLocal: false, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "Energy_epsilon", scope: !2, file: !3, line: 1209, type: !81, isLocal: false, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "BFepsilon", scope: !2, file: !3, line: 1210, type: !81, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "batch_mode", scope: !2, file: !3, line: 1212, type: !10, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "verbose_mode", scope: !2, file: !3, line: 1213, type: !10, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "sliders", scope: !2, file: !3, line: 1235, type: !412, isLocal: false, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 1920, elements: !424)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "slider", file: !414, line: 49, baseType: !415)
!414 = !DIFile(filename: "./glibdumb/glib.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "91b54e106f52da85fe06b27d69797b77")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 43, size: 384, elements: !416)
!416 = !{!417, !419, !420, !421, !422, !423}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !414, line: 44, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !415, file: !414, line: 45, baseType: !10, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !415, file: !414, line: 45, baseType: !10, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "init_value", scope: !415, file: !414, line: 46, baseType: !10, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !415, file: !414, line: 47, baseType: !10, size: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !415, file: !414, line: 48, baseType: !212, size: 64, offset: 320)
!424 = !{!425}
!425 = !DISubrange(count: 5)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "choices", scope: !2, file: !3, line: 1262, type: !428, isLocal: false, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 8960, elements: !93)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "choice", file: !414, line: 59, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 54, size: 2240, elements: !431)
!431 = !{!432, !433, !437, !438}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !430, file: !414, line: 55, baseType: !418, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "possibilities", scope: !430, file: !414, line: 56, baseType: !434, size: 2048, offset: 64)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 2048, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "init_value", scope: !430, file: !414, line: 57, baseType: !10, size: 64, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !430, file: !414, line: 58, baseType: !212, size: 64, offset: 2176)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "state", scope: !441, file: !3, line: 1516, type: !10, isLocal: true, isDefinition: true)
!441 = distinct !DISubprogram(name: "start_radiosity", scope: !3, file: !3, line: 1513, type: !442, scopeLine: 1515, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !10}
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !463, !464, !466, !471, !472}
!445 = !DILocalVariable(name: "val", arg: 1, scope: !441, file: !3, line: 1513, type: !10)
!446 = !DILocalVariable(name: "i", scope: !441, file: !3, line: 1517, type: !10)
!447 = !DILocalVariable(name: "total_rad_time", scope: !441, file: !3, line: 1518, type: !10)
!448 = !DILocalVariable(name: "max_rad_time", scope: !441, file: !3, line: 1518, type: !10)
!449 = !DILocalVariable(name: "min_rad_time", scope: !441, file: !3, line: 1518, type: !10)
!450 = !DILocalVariable(name: "total_refine_time", scope: !441, file: !3, line: 1519, type: !10)
!451 = !DILocalVariable(name: "max_refine_time", scope: !441, file: !3, line: 1519, type: !10)
!452 = !DILocalVariable(name: "min_refine_time", scope: !441, file: !3, line: 1519, type: !10)
!453 = !DILocalVariable(name: "total_wait_time", scope: !441, file: !3, line: 1520, type: !10)
!454 = !DILocalVariable(name: "max_wait_time", scope: !441, file: !3, line: 1520, type: !10)
!455 = !DILocalVariable(name: "min_wait_time", scope: !441, file: !3, line: 1520, type: !10)
!456 = !DILocalVariable(name: "total_vertex_time", scope: !441, file: !3, line: 1521, type: !10)
!457 = !DILocalVariable(name: "max_vertex_time", scope: !441, file: !3, line: 1521, type: !10)
!458 = !DILocalVariable(name: "min_vertex_time", scope: !441, file: !3, line: 1521, type: !10)
!459 = !DILocalVariable(name: "i", scope: !460, file: !3, line: 1551, type: !10)
!460 = distinct !DILexicalBlock(scope: !461, file: !3, line: 1550, column: 13)
!461 = distinct !DILexicalBlock(scope: !462, file: !3, line: 1530, column: 9)
!462 = distinct !DILexicalBlock(scope: !441, file: !3, line: 1529, column: 9)
!463 = !DILocalVariable(name: "Error", scope: !460, file: !3, line: 1551, type: !10)
!464 = !DILocalVariable(name: "aantal", scope: !465, file: !3, line: 1566, type: !21)
!465 = distinct !DILexicalBlock(scope: !461, file: !3, line: 1566, column: 13)
!466 = !DILocalVariable(name: "i", scope: !467, file: !3, line: 1668, type: !10)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 1667, column: 21)
!468 = distinct !DILexicalBlock(scope: !469, file: !3, line: 1656, column: 17)
!469 = distinct !DILexicalBlock(scope: !470, file: !3, line: 1647, column: 9)
!470 = distinct !DILexicalBlock(scope: !462, file: !3, line: 1646, column: 14)
!471 = !DILocalVariable(name: "Error", scope: !467, file: !3, line: 1668, type: !10)
!472 = !DILocalVariable(name: "aantal", scope: !473, file: !3, line: 1728, type: !21)
!473 = distinct !DILexicalBlock(scope: !468, file: !3, line: 1728, column: 21)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "__tid__", scope: !2, file: !3, line: 51, type: !476, isLocal: false, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 16384, elements: !479)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !13, line: 27, baseType: !478)
!478 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!479 = !{!480}
!480 = !DISubrange(count: 256)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "__intern__", scope: !2, file: !3, line: 53, type: !12, isLocal: false, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "global", scope: !2, file: !3, line: 1189, type: !5, isLocal: false, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "timing", scope: !2, file: !3, line: 1190, type: !366, isLocal: false, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "taskqueue_id", scope: !2, file: !3, line: 1223, type: !489, isLocal: false, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 65536, elements: !228)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "time_rad_start", scope: !2, file: !3, line: 1224, type: !10, isLocal: false, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "time_rad_end", scope: !2, file: !3, line: 1224, type: !10, isLocal: false, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "time_process_start", scope: !2, file: !3, line: 1224, type: !489, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "dostats", scope: !2, file: !3, line: 1290, type: !10, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "disp_fill_mode", scope: !2, file: !3, line: 1501, type: !10, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "disp_patch_switch", scope: !2, file: !3, line: 1502, type: !10, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "disp_mesh_switch", scope: !2, file: !3, line: 1503, type: !10, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "disp_interaction_switch", scope: !2, file: !3, line: 1504, type: !10, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "disp_fill_switch", scope: !2, file: !3, line: 1499, type: !10, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "disp_shade_switch", scope: !2, file: !3, line: 1500, type: !10, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "disp_crnt_view_x", scope: !2, file: !3, line: 1505, type: !10, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "disp_crnt_view_y", scope: !2, file: !3, line: 1506, type: !10, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "disp_crnt_zoom", scope: !2, file: !3, line: 1507, type: !81, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!517 = !{i32 7, !"Dwarf Version", i32 5}
!518 = !{i32 2, !"Debug Info Version", i32 3}
!519 = !{i32 1, !"wchar_size", i32 4}
!520 = !{i32 7, !"PIC Level", i32 2}
!521 = !{i32 7, !"PIE Level", i32 2}
!522 = !{i32 7, !"uwtable", i32 2}
!523 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!524 = distinct !DISubprogram(name: "change_view_x", scope: !3, file: !3, line: 1832, type: !442, scopeLine: 1834, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !525)
!525 = !{!526}
!526 = !DILocalVariable(name: "val", arg: 1, scope: !524, file: !3, line: 1832, type: !10)
!527 = !DILocation(line: 0, scope: !524)
!528 = !DILocation(line: 1840, column: 22, scope: !524)
!529 = !DILocation(line: 1841, column: 5, scope: !524)
!530 = !DILocation(line: 1842, column: 1, scope: !524)
!531 = distinct !DISubprogram(name: "change_view_y", scope: !3, file: !3, line: 1848, type: !442, scopeLine: 1850, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !532)
!532 = !{!533}
!533 = !DILocalVariable(name: "val", arg: 1, scope: !531, file: !3, line: 1848, type: !10)
!534 = !DILocation(line: 0, scope: !531)
!535 = !DILocation(line: 1856, column: 22, scope: !531)
!536 = !DILocation(line: 1857, column: 5, scope: !531)
!537 = !DILocation(line: 1858, column: 1, scope: !531)
!538 = distinct !DISubprogram(name: "change_view_zoom", scope: !3, file: !3, line: 1864, type: !442, scopeLine: 1866, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !539)
!539 = !{!540}
!540 = !DILocalVariable(name: "val", arg: 1, scope: !538, file: !3, line: 1864, type: !10)
!541 = !DILocation(line: 0, scope: !538)
!542 = !DILocation(line: 1872, column: 22, scope: !538)
!543 = !DILocation(line: 1872, column: 20, scope: !538)
!544 = !DILocation(line: 1873, column: 5, scope: !538)
!545 = !DILocation(line: 1874, column: 1, scope: !538)
!546 = distinct !DISubprogram(name: "change_BFepsilon", scope: !3, file: !3, line: 1880, type: !442, scopeLine: 1882, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !547)
!547 = !{!548}
!548 = !DILocalVariable(name: "val", arg: 1, scope: !546, file: !3, line: 1880, type: !10)
!549 = !DILocation(line: 0, scope: !546)
!550 = !DILocation(line: 1886, column: 17, scope: !546)
!551 = !DILocation(line: 1886, column: 15, scope: !546)
!552 = !DILocation(line: 1887, column: 1, scope: !546)
!553 = distinct !DISubprogram(name: "change_area_epsilon", scope: !3, file: !3, line: 1894, type: !442, scopeLine: 1896, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !554)
!554 = !{!555}
!555 = !DILocalVariable(name: "val", arg: 1, scope: !553, file: !3, line: 1894, type: !10)
!556 = !DILocation(line: 0, scope: !553)
!557 = !DILocation(line: 1900, column: 20, scope: !553)
!558 = !DILocation(line: 1900, column: 18, scope: !553)
!559 = !DILocation(line: 1901, column: 1, scope: !553)
!560 = !DILocation(line: 0, scope: !441)
!561 = !DILocation(line: 1529, column: 9, scope: !441)
!562 = !DILocation(line: 1531, column: 17, scope: !563)
!563 = distinct !DILexicalBlock(scope: !461, file: !3, line: 1531, column: 17)
!564 = !DILocation(line: 1531, column: 23, scope: !563)
!565 = !DILocation(line: 1531, column: 17, scope: !461)
!566 = !DILocation(line: 1533, column: 21, scope: !567)
!567 = distinct !DILexicalBlock(scope: !563, file: !3, line: 1532, column: 17)
!568 = !DILocation(line: 1534, column: 21, scope: !567)
!569 = !DILocation(line: 1538, column: 47, scope: !570)
!570 = distinct !DILexicalBlock(scope: !461, file: !3, line: 1538, column: 13)
!571 = !DILocation(line: 1538, column: 45, scope: !570)
!572 = !DILocation(line: 1541, column: 13, scope: !461)
!573 = !DILocation(line: 1541, column: 27, scope: !461)
!574 = !DILocation(line: 1544, column: 30, scope: !575)
!575 = distinct !DILexicalBlock(scope: !576, file: !3, line: 1544, column: 13)
!576 = distinct !DILexicalBlock(scope: !461, file: !3, line: 1544, column: 13)
!577 = !DILocation(line: 1544, column: 28, scope: !575)
!578 = !DILocation(line: 1544, column: 13, scope: !576)
!579 = !DILocation(line: 1546, column: 39, scope: !580)
!580 = distinct !DILexicalBlock(scope: !575, file: !3, line: 1545, column: 17)
!581 = !DILocation(line: 1546, column: 21, scope: !580)
!582 = !DILocation(line: 1546, column: 37, scope: !580)
!583 = !DILocation(line: 1544, column: 46, scope: !575)
!584 = distinct !{!584, !578, !585, !586, !587}
!585 = !DILocation(line: 1547, column: 17, scope: !576)
!586 = !{!"llvm.loop.mustprogress"}
!587 = !{!"llvm.loop.unroll.disable"}
!588 = !DILocation(line: 1553, column: 2, scope: !460)
!589 = !DILocation(line: 1554, column: 2, scope: !460)
!590 = !DILocation(line: 0, scope: !460)
!591 = !DILocation(line: 1555, column: 19, scope: !592)
!592 = distinct !DILexicalBlock(scope: !593, file: !3, line: 1555, column: 2)
!593 = distinct !DILexicalBlock(scope: !460, file: !3, line: 1555, column: 2)
!594 = !DILocation(line: 1555, column: 16, scope: !592)
!595 = !DILocation(line: 1555, column: 2, scope: !593)
!596 = !DILocation(line: 1555, column: 39, scope: !592)
!597 = !DILocation(line: 1555, column: 33, scope: !592)
!598 = distinct !{!598, !595, !599, !586, !587}
!599 = !DILocation(line: 1561, column: 2, scope: !593)
!600 = !DILocation(line: 1556, column: 46, scope: !601)
!601 = distinct !DILexicalBlock(scope: !592, file: !3, line: 1555, column: 43)
!602 = !DILocation(line: 1556, column: 27, scope: !601)
!603 = !DILocation(line: 1556, column: 11, scope: !601)
!604 = !DILocation(line: 1557, column: 13, scope: !605)
!605 = distinct !DILexicalBlock(scope: !601, file: !3, line: 1557, column: 7)
!606 = !DILocation(line: 1557, column: 7, scope: !601)
!607 = !DILocation(line: 1558, column: 4, scope: !608)
!608 = distinct !DILexicalBlock(scope: !605, file: !3, line: 1557, column: 19)
!609 = !DILocation(line: 1559, column: 4, scope: !608)
!610 = !DILocation(line: 1562, column: 2, scope: !460)
!611 = !DILocation(line: 1564, column: 2, scope: !460)
!612 = !DILocation(line: 1566, column: 25, scope: !465)
!613 = !DILocation(line: 0, scope: !465)
!614 = !DILocation(line: 1566, column: 39, scope: !465)
!615 = !DILocation(line: 1566, column: 52, scope: !465)
!616 = !DILocation(line: 1566, column: 69, scope: !465)
!617 = !DILocation(line: 1566, column: 56, scope: !465)
!618 = distinct !{!618, !614, !619, !586, !587}
!619 = !DILocation(line: 1566, column: 90, scope: !465)
!620 = !DILocation(line: 1568, column: 45, scope: !621)
!621 = distinct !DILexicalBlock(scope: !461, file: !3, line: 1568, column: 13)
!622 = !DILocation(line: 1568, column: 43, scope: !621)
!623 = !DILocation(line: 1572, column: 13, scope: !461)
!624 = !DILocation(line: 1574, column: 13, scope: !461)
!625 = !DILocation(line: 1576, column: 17, scope: !626)
!626 = distinct !DILexicalBlock(scope: !461, file: !3, line: 1576, column: 17)
!627 = !DILocation(line: 1576, column: 17, scope: !461)
!628 = !DILocation(line: 1577, column: 17, scope: !629)
!629 = distinct !DILexicalBlock(scope: !626, file: !3, line: 1576, column: 26)
!630 = !DILocation(line: 1579, column: 17, scope: !629)
!631 = !DILocation(line: 1580, column: 17, scope: !629)
!632 = !DILocation(line: 1582, column: 33, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !3, line: 1582, column: 17)
!634 = distinct !DILexicalBlock(scope: !629, file: !3, line: 1582, column: 17)
!635 = !DILocation(line: 1582, column: 31, scope: !633)
!636 = !DILocation(line: 1582, column: 17, scope: !634)
!637 = !DILocation(line: 1583, column: 59, scope: !633)
!638 = !DILocation(line: 1583, column: 70, scope: !633)
!639 = !DILocation(line: 1583, column: 91, scope: !633)
!640 = !DILocation(line: 1583, column: 115, scope: !633)
!641 = !DILocation(line: 1583, column: 137, scope: !633)
!642 = !DILocation(line: 1583, column: 21, scope: !633)
!643 = !DILocation(line: 1582, column: 48, scope: !633)
!644 = distinct !{!644, !636, !645, !586, !587}
!645 = !DILocation(line: 1583, column: 148, scope: !634)
!646 = !DILocation(line: 1585, column: 34, scope: !629)
!647 = !DILocation(line: 1585, column: 45, scope: !629)
!648 = !DILocation(line: 1589, column: 48, scope: !629)
!649 = !DILocation(line: 1593, column: 46, scope: !629)
!650 = !DILocation(line: 1597, column: 48, scope: !629)
!651 = !DILocation(line: 1601, column: 31, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !3, line: 1601, column: 17)
!653 = distinct !DILexicalBlock(scope: !629, file: !3, line: 1601, column: 17)
!654 = !DILocation(line: 1601, column: 17, scope: !653)
!655 = !DILocation(line: 1602, column: 39, scope: !656)
!656 = distinct !DILexicalBlock(scope: !652, file: !3, line: 1601, column: 52)
!657 = !DILocation(line: 1602, column: 50, scope: !656)
!658 = !DILocation(line: 1602, column: 36, scope: !656)
!659 = !DILocation(line: 1603, column: 25, scope: !656)
!660 = !DILocation(line: 1605, column: 25, scope: !656)
!661 = !DILocation(line: 1608, column: 53, scope: !656)
!662 = !DILocation(line: 1608, column: 39, scope: !656)
!663 = !DILocation(line: 1609, column: 25, scope: !656)
!664 = !DILocation(line: 1611, column: 25, scope: !656)
!665 = !DILocation(line: 1614, column: 51, scope: !656)
!666 = !DILocation(line: 1614, column: 37, scope: !656)
!667 = !DILocation(line: 1615, column: 25, scope: !656)
!668 = !DILocation(line: 1617, column: 25, scope: !656)
!669 = !DILocation(line: 1620, column: 53, scope: !656)
!670 = !DILocation(line: 1620, column: 39, scope: !656)
!671 = !DILocation(line: 1621, column: 25, scope: !656)
!672 = !DILocation(line: 1623, column: 25, scope: !656)
!673 = !DILocation(line: 1601, column: 48, scope: !652)
!674 = distinct !{!674, !654, !675, !586, !587}
!675 = !DILocation(line: 1625, column: 17, scope: !653)
!676 = !DILocation(line: 0, scope: !629)
!677 = !DILocation(line: 1628, column: 17, scope: !629)
!678 = !DILocation(line: 1629, column: 17, scope: !629)
!679 = !DILocation(line: 1630, column: 70, scope: !629)
!680 = !DILocation(line: 1630, column: 114, scope: !629)
!681 = !DILocation(line: 1630, column: 95, scope: !629)
!682 = !DILocation(line: 1630, column: 61, scope: !629)
!683 = !DILocation(line: 1630, column: 140, scope: !629)
!684 = !DILocation(line: 1630, column: 168, scope: !629)
!685 = !DILocation(line: 1630, column: 131, scope: !629)
!686 = !DILocation(line: 1630, column: 213, scope: !629)
!687 = !DILocation(line: 1630, column: 239, scope: !629)
!688 = !DILocation(line: 1630, column: 204, scope: !629)
!689 = !DILocation(line: 1630, column: 284, scope: !629)
!690 = !DILocation(line: 1630, column: 312, scope: !629)
!691 = !DILocation(line: 1630, column: 275, scope: !629)
!692 = !DILocation(line: 1630, column: 17, scope: !629)
!693 = !DILocation(line: 1631, column: 17, scope: !629)
!694 = !DILocation(line: 1633, column: 13, scope: !629)
!695 = !DILocation(line: 1637, column: 31, scope: !461)
!696 = !DILocation(line: 1637, column: 13, scope: !461)
!697 = !DILocation(line: 1640, column: 28, scope: !461)
!698 = !DILocation(line: 1640, column: 44, scope: !461)
!699 = !DILocation(line: 1641, column: 27, scope: !461)
!700 = !DILocation(line: 1641, column: 45, scope: !461)
!701 = !DILocation(line: 1640, column: 13, scope: !461)
!702 = !DILocation(line: 1643, column: 19, scope: !461)
!703 = !DILocation(line: 1644, column: 9, scope: !461)
!704 = !DILocation(line: 1648, column: 17, scope: !705)
!705 = distinct !DILexicalBlock(scope: !469, file: !3, line: 1648, column: 17)
!706 = !DILocation(line: 1648, column: 17, scope: !469)
!707 = !DILocation(line: 1650, column: 21, scope: !708)
!708 = distinct !DILexicalBlock(scope: !705, file: !3, line: 1649, column: 17)
!709 = !DILocation(line: 1651, column: 21, scope: !708)
!710 = !DILocation(line: 1660, column: 21, scope: !468)
!711 = !DILocation(line: 1660, column: 35, scope: !468)
!712 = !DILocation(line: 1662, column: 39, scope: !713)
!713 = distinct !DILexicalBlock(scope: !714, file: !3, line: 1662, column: 21)
!714 = distinct !DILexicalBlock(scope: !468, file: !3, line: 1662, column: 21)
!715 = !DILocation(line: 1662, column: 37, scope: !713)
!716 = !DILocation(line: 1662, column: 21, scope: !714)
!717 = !DILocation(line: 1664, column: 47, scope: !718)
!718 = distinct !DILexicalBlock(scope: !713, file: !3, line: 1663, column: 25)
!719 = !DILocation(line: 1664, column: 29, scope: !718)
!720 = !DILocation(line: 1664, column: 45, scope: !718)
!721 = !DILocation(line: 1662, column: 55, scope: !713)
!722 = distinct !{!722, !716, !723, !586, !587}
!723 = !DILocation(line: 1665, column: 25, scope: !714)
!724 = !DILocation(line: 1670, column: 2, scope: !467)
!725 = !DILocation(line: 1671, column: 2, scope: !467)
!726 = !DILocation(line: 0, scope: !467)
!727 = !DILocation(line: 1672, column: 19, scope: !728)
!728 = distinct !DILexicalBlock(scope: !729, file: !3, line: 1672, column: 2)
!729 = distinct !DILexicalBlock(scope: !467, file: !3, line: 1672, column: 2)
!730 = !DILocation(line: 1672, column: 16, scope: !728)
!731 = !DILocation(line: 1672, column: 2, scope: !729)
!732 = !DILocation(line: 1672, column: 47, scope: !728)
!733 = !DILocation(line: 1672, column: 41, scope: !728)
!734 = distinct !{!734, !731, !735, !586, !587}
!735 = !DILocation(line: 1678, column: 2, scope: !729)
!736 = !DILocation(line: 1673, column: 46, scope: !737)
!737 = distinct !DILexicalBlock(scope: !728, file: !3, line: 1672, column: 51)
!738 = !DILocation(line: 1673, column: 27, scope: !737)
!739 = !DILocation(line: 1673, column: 11, scope: !737)
!740 = !DILocation(line: 1674, column: 13, scope: !741)
!741 = distinct !DILexicalBlock(scope: !737, file: !3, line: 1674, column: 7)
!742 = !DILocation(line: 1674, column: 7, scope: !737)
!743 = !DILocation(line: 1675, column: 4, scope: !744)
!744 = distinct !DILexicalBlock(scope: !741, file: !3, line: 1674, column: 19)
!745 = !DILocation(line: 1676, column: 4, scope: !744)
!746 = !DILocation(line: 1679, column: 2, scope: !467)
!747 = !DILocation(line: 1681, column: 2, scope: !467)
!748 = !DILocation(line: 1687, column: 21, scope: !468)
!749 = !DILocation(line: 1688, column: 21, scope: !468)
!750 = !DILocation(line: 1689, column: 27, scope: !468)
!751 = !DILocation(line: 1690, column: 21, scope: !468)
!752 = !DILocation(line: 1693, column: 25, scope: !753)
!753 = distinct !DILexicalBlock(scope: !468, file: !3, line: 1693, column: 25)
!754 = !DILocation(line: 1693, column: 25, scope: !468)
!755 = !DILocation(line: 1696, column: 23, scope: !756)
!756 = distinct !DILexicalBlock(scope: !757, file: !3, line: 1695, column: 29)
!757 = distinct !DILexicalBlock(scope: !753, file: !3, line: 1694, column: 25)
!758 = !DILocation(line: 1696, column: 31, scope: !756)
!759 = !DILocation(line: 1696, column: 1, scope: !756)
!760 = !DILocation(line: 1697, column: 2, scope: !756)
!761 = !DILocation(line: 1697, column: 19, scope: !756)
!762 = !DILocation(line: 1697, column: 29, scope: !756)
!763 = !DILocation(line: 1698, column: 5, scope: !764)
!764 = distinct !DILexicalBlock(scope: !756, file: !3, line: 1698, column: 5)
!765 = !DILocation(line: 1698, column: 38, scope: !764)
!766 = !DILocation(line: 1698, column: 34, scope: !764)
!767 = !DILocation(line: 1698, column: 5, scope: !756)
!768 = !DILocation(line: 1699, column: 31, scope: !769)
!769 = distinct !DILexicalBlock(scope: !764, file: !3, line: 1698, column: 53)
!770 = !DILocation(line: 1700, column: 45, scope: !769)
!771 = !DILocation(line: 1700, column: 2, scope: !769)
!772 = !DILocation(line: 1701, column: 1, scope: !769)
!773 = !DILocation(line: 1698, column: 14, scope: !764)
!774 = !DILocation(line: 1702, column: 40, scope: !775)
!775 = distinct !DILexicalBlock(scope: !764, file: !3, line: 1701, column: 8)
!776 = !DILocation(line: 1702, column: 2, scope: !775)
!777 = !DILocation(line: 1704, column: 25, scope: !756)
!778 = !DILocation(line: 1704, column: 33, scope: !756)
!779 = !DILocation(line: 1704, column: 1, scope: !756)
!780 = !DILocation(line: 1706, column: 29, scope: !757)
!781 = !DILocation(line: 1707, column: 25, scope: !757)
!782 = !DILocation(line: 1709, column: 30, scope: !753)
!783 = !DILocation(line: 1713, column: 23, scope: !784)
!784 = distinct !DILexicalBlock(scope: !468, file: !3, line: 1712, column: 21)
!785 = !DILocation(line: 1713, column: 31, scope: !784)
!786 = !DILocation(line: 1713, column: 1, scope: !784)
!787 = !DILocation(line: 1714, column: 2, scope: !784)
!788 = !DILocation(line: 1714, column: 19, scope: !784)
!789 = !DILocation(line: 1714, column: 29, scope: !784)
!790 = !DILocation(line: 1715, column: 5, scope: !791)
!791 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1715, column: 5)
!792 = !DILocation(line: 1715, column: 38, scope: !791)
!793 = !DILocation(line: 1715, column: 34, scope: !791)
!794 = !DILocation(line: 1715, column: 5, scope: !784)
!795 = !DILocation(line: 1716, column: 31, scope: !796)
!796 = distinct !DILexicalBlock(scope: !791, file: !3, line: 1715, column: 53)
!797 = !DILocation(line: 1717, column: 45, scope: !796)
!798 = !DILocation(line: 1717, column: 2, scope: !796)
!799 = !DILocation(line: 1718, column: 1, scope: !796)
!800 = !DILocation(line: 1715, column: 14, scope: !791)
!801 = !DILocation(line: 1719, column: 40, scope: !802)
!802 = distinct !DILexicalBlock(scope: !791, file: !3, line: 1718, column: 8)
!803 = !DILocation(line: 1719, column: 2, scope: !802)
!804 = !DILocation(line: 1721, column: 25, scope: !784)
!805 = !DILocation(line: 1721, column: 33, scope: !784)
!806 = !DILocation(line: 1721, column: 1, scope: !784)
!807 = !DILocation(line: 1723, column: 21, scope: !468)
!808 = !DILocation(line: 1724, column: 21, scope: !468)
!809 = !DILocation(line: 1725, column: 21, scope: !468)
!810 = !DILocation(line: 1726, column: 21, scope: !468)
!811 = !DILocation(line: 1728, column: 33, scope: !473)
!812 = !DILocation(line: 0, scope: !473)
!813 = !DILocation(line: 1728, column: 55, scope: !473)
!814 = !DILocation(line: 1728, column: 68, scope: !473)
!815 = !DILocation(line: 1728, column: 85, scope: !473)
!816 = !DILocation(line: 1728, column: 72, scope: !473)
!817 = distinct !{!817, !813, !818, !586, !587}
!818 = !DILocation(line: 1728, column: 106, scope: !473)
!819 = !DILocation(line: 1729, column: 31, scope: !468)
!820 = !DILocation(line: 1730, column: 17, scope: !468)
!821 = !DILocation(line: 1733, column: 28, scope: !469)
!822 = !DILocation(line: 1733, column: 44, scope: !469)
!823 = !DILocation(line: 1734, column: 27, scope: !469)
!824 = !DILocation(line: 1734, column: 45, scope: !469)
!825 = !DILocation(line: 1733, column: 13, scope: !469)
!826 = !DILocation(line: 1735, column: 9, scope: !469)
!827 = !DILocation(line: 1740, column: 13, scope: !828)
!828 = distinct !DILexicalBlock(scope: !829, file: !3, line: 1738, column: 9)
!829 = distinct !DILexicalBlock(scope: !470, file: !3, line: 1737, column: 14)
!830 = !DILocation(line: 1741, column: 13, scope: !828)
!831 = !DILocation(line: 1742, column: 13, scope: !828)
!832 = !DILocation(line: 1743, column: 19, scope: !828)
!833 = !DILocation(line: 1744, column: 9, scope: !828)
!834 = !DILocation(line: 1745, column: 1, scope: !441)
!835 = distinct !DISubprogram(name: "change_display", scope: !3, file: !3, line: 1760, type: !442, scopeLine: 1762, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !836)
!836 = !{!837}
!837 = !DILocalVariable(name: "val", arg: 1, scope: !835, file: !3, line: 1760, type: !10)
!838 = !DILocation(line: 0, scope: !835)
!839 = !DILocation(line: 1770, column: 5, scope: !835)
!840 = !DILocation(line: 1773, column: 35, scope: !841)
!841 = distinct !DILexicalBlock(scope: !835, file: !3, line: 1771, column: 9)
!842 = !DILocation(line: 1773, column: 33, scope: !841)
!843 = !DILocation(line: 1773, column: 30, scope: !841)
!844 = !DILocation(line: 1774, column: 13, scope: !841)
!845 = !DILocation(line: 1780, column: 13, scope: !841)
!846 = !DILocation(line: 1783, column: 13, scope: !841)
!847 = !DILocation(line: 1786, column: 13, scope: !841)
!848 = !DILocation(line: 0, scope: !841)
!849 = !DILocation(line: 1791, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !835, file: !3, line: 1791, column: 9)
!851 = !DILocation(line: 1791, column: 26, scope: !850)
!852 = !DILocation(line: 1791, column: 9, scope: !835)
!853 = !DILocation(line: 1795, column: 17, scope: !854)
!854 = distinct !DILexicalBlock(scope: !855, file: !3, line: 1795, column: 17)
!855 = distinct !DILexicalBlock(scope: !850, file: !3, line: 1794, column: 9)
!856 = !DILocation(line: 1795, column: 35, scope: !854)
!857 = !DILocation(line: 0, scope: !850)
!858 = !DILocation(line: 1802, column: 36, scope: !835)
!859 = !DILocation(line: 1803, column: 19, scope: !835)
!860 = !DILocation(line: 1803, column: 37, scope: !835)
!861 = !DILocation(line: 1802, column: 5, scope: !835)
!862 = !DILocation(line: 1804, column: 1, scope: !835)
!863 = distinct !DISubprogram(name: "select_model", scope: !3, file: !3, line: 1915, type: !442, scopeLine: 1917, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !864)
!864 = !{!865}
!865 = !DILocalVariable(name: "val", arg: 1, scope: !863, file: !3, line: 1915, type: !10)
!866 = !DILocation(line: 0, scope: !863)
!867 = !DILocation(line: 1921, column: 5, scope: !863)
!868 = !DILocation(line: 0, scope: !869)
!869 = distinct !DILexicalBlock(scope: !863, file: !3, line: 1922, column: 9)
!870 = !DILocation(line: 1933, column: 1, scope: !863)
!871 = distinct !DISubprogram(name: "utility_tools", scope: !3, file: !3, line: 1949, type: !442, scopeLine: 1951, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !872)
!872 = !{!873, !874}
!873 = !DILocalVariable(name: "val", arg: 1, scope: !871, file: !3, line: 1949, type: !10)
!874 = !DILocalVariable(name: "fd", scope: !871, file: !3, line: 1952, type: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !877, line: 7, baseType: !878)
!877 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !879, line: 49, size: 1728, elements: !880)
!879 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !896, !898, !899, !900, !903, !905, !907, !911, !914, !916, !919, !922, !923, !924, !927, !928}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !878, file: !879, line: 51, baseType: !21, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !878, file: !879, line: 54, baseType: !418, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !878, file: !879, line: 55, baseType: !418, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !878, file: !879, line: 56, baseType: !418, size: 64, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !878, file: !879, line: 57, baseType: !418, size: 64, offset: 256)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !878, file: !879, line: 58, baseType: !418, size: 64, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !878, file: !879, line: 59, baseType: !418, size: 64, offset: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !878, file: !879, line: 60, baseType: !418, size: 64, offset: 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !878, file: !879, line: 61, baseType: !418, size: 64, offset: 512)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !878, file: !879, line: 64, baseType: !418, size: 64, offset: 576)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !878, file: !879, line: 65, baseType: !418, size: 64, offset: 640)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !878, file: !879, line: 66, baseType: !418, size: 64, offset: 704)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !878, file: !879, line: 68, baseType: !894, size: 64, offset: 768)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !879, line: 36, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !878, file: !879, line: 70, baseType: !897, size: 64, offset: 832)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !878, file: !879, line: 72, baseType: !21, size: 32, offset: 896)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !878, file: !879, line: 73, baseType: !21, size: 32, offset: 928)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !878, file: !879, line: 74, baseType: !901, size: 64, offset: 960)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !902, line: 152, baseType: !10)
!902 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !878, file: !879, line: 77, baseType: !904, size: 16, offset: 1024)
!904 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !878, file: !879, line: 78, baseType: !906, size: 8, offset: 1040)
!906 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !878, file: !879, line: 79, baseType: !908, size: 8, offset: 1048)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 1)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !878, file: !879, line: 81, baseType: !912, size: 64, offset: 1088)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !879, line: 43, baseType: null)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !878, file: !879, line: 89, baseType: !915, size: 64, offset: 1152)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !902, line: 153, baseType: !10)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !878, file: !879, line: 91, baseType: !917, size: 64, offset: 1216)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !879, line: 37, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !878, file: !879, line: 92, baseType: !920, size: 64, offset: 1280)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !879, line: 38, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !878, file: !879, line: 93, baseType: !897, size: 64, offset: 1344)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !878, file: !879, line: 94, baseType: !379, size: 64, offset: 1408)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !878, file: !879, line: 95, baseType: !925, size: 64, offset: 1472)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !926, line: 46, baseType: !478)
!926 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !878, file: !879, line: 96, baseType: !21, size: 32, offset: 1536)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !878, file: !879, line: 98, baseType: !929, size: 160, offset: 1568)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 20)
!932 = !DILocation(line: 0, scope: !871)
!933 = !DILocation(line: 1957, column: 5, scope: !871)
!934 = !DILocation(line: 1961, column: 13, scope: !935)
!935 = distinct !DILexicalBlock(scope: !871, file: !3, line: 1958, column: 9)
!936 = !DILocation(line: 1964, column: 52, scope: !935)
!937 = !DILocation(line: 1964, column: 45, scope: !935)
!938 = !DILocation(line: 1964, column: 13, scope: !935)
!939 = !DILocation(line: 1968, column: 31, scope: !935)
!940 = !DILocation(line: 1968, column: 47, scope: !935)
!941 = !DILocation(line: 1969, column: 30, scope: !935)
!942 = !DILocation(line: 1969, column: 48, scope: !935)
!943 = !DILocation(line: 1968, column: 13, scope: !935)
!944 = !DILocation(line: 1972, column: 13, scope: !935)
!945 = !DILocation(line: 1973, column: 13, scope: !935)
!946 = !DILocation(line: 1975, column: 31, scope: !935)
!947 = !DILocation(line: 1975, column: 13, scope: !935)
!948 = !DILocation(line: 1976, column: 13, scope: !935)
!949 = !DILocation(line: 1978, column: 23, scope: !950)
!950 = distinct !DILexicalBlock(scope: !935, file: !3, line: 1978, column: 17)
!951 = !DILocation(line: 1978, column: 55, scope: !950)
!952 = !DILocation(line: 1978, column: 17, scope: !935)
!953 = !DILocation(line: 1980, column: 21, scope: !954)
!954 = distinct !DILexicalBlock(scope: !950, file: !3, line: 1979, column: 17)
!955 = !DILocation(line: 1981, column: 21, scope: !954)
!956 = !DILocation(line: 1983, column: 13, scope: !935)
!957 = !DILocation(line: 1984, column: 13, scope: !935)
!958 = !DILocation(line: 1985, column: 13, scope: !935)
!959 = !DILocation(line: 1987, column: 13, scope: !935)
!960 = !DILocation(line: 1988, column: 9, scope: !935)
!961 = !DILocation(line: 1989, column: 1, scope: !871)
!962 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1292, type: !963, scopeLine: 1293, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !966)
!963 = !DISubroutineType(types: !964)
!964 = !{!21, !21, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!966 = !{!967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !986, !987}
!967 = !DILocalVariable(name: "argc", arg: 1, scope: !962, file: !3, line: 1292, type: !21)
!968 = !DILocalVariable(name: "argv", arg: 2, scope: !962, file: !3, line: 1292, type: !965)
!969 = !DILocalVariable(name: "i", scope: !962, file: !3, line: 1294, type: !10)
!970 = !DILocalVariable(name: "total_rad_time", scope: !962, file: !3, line: 1295, type: !10)
!971 = !DILocalVariable(name: "max_rad_time", scope: !962, file: !3, line: 1295, type: !10)
!972 = !DILocalVariable(name: "min_rad_time", scope: !962, file: !3, line: 1295, type: !10)
!973 = !DILocalVariable(name: "total_refine_time", scope: !962, file: !3, line: 1296, type: !10)
!974 = !DILocalVariable(name: "max_refine_time", scope: !962, file: !3, line: 1296, type: !10)
!975 = !DILocalVariable(name: "min_refine_time", scope: !962, file: !3, line: 1296, type: !10)
!976 = !DILocalVariable(name: "total_wait_time", scope: !962, file: !3, line: 1297, type: !10)
!977 = !DILocalVariable(name: "max_wait_time", scope: !962, file: !3, line: 1297, type: !10)
!978 = !DILocalVariable(name: "min_wait_time", scope: !962, file: !3, line: 1297, type: !10)
!979 = !DILocalVariable(name: "total_vertex_time", scope: !962, file: !3, line: 1298, type: !10)
!980 = !DILocalVariable(name: "max_vertex_time", scope: !962, file: !3, line: 1298, type: !10)
!981 = !DILocalVariable(name: "min_vertex_time", scope: !962, file: !3, line: 1298, type: !10)
!982 = !DILocalVariable(name: "i", scope: !983, file: !3, line: 1389, type: !10)
