; ModuleID = 'rad_tools.c'
source_filename = "rad_tools.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Elem_Interaction = type { i64, float }
%struct.Global = type { i64, %union.pthread_mutex_t, [1024 x %struct.Task_Queue], [3276800 x %struct._task], %union.pthread_mutex_t, ptr, %union.pthread_mutex_t, i64, %struct.Rgb, %struct.Rgb, float, i64, %union.pthread_mutex_t, i64, i64, [1024 x %struct.Patch_Cost], %struct.anon, i64, %union.pthread_mutex_t, i64, %union.pthread_mutex_t, %union.pthread_mutex_t, ptr, i64, i64, [1024 x %struct._patch], %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, i64, ptr, %union.pthread_mutex_t, i64, ptr, [3900 x %struct.Shared_Lock], [1024 x %struct.StatisticalInfo] }
%struct.Task_Queue = type { [4096 x i8], %union.pthread_mutex_t, ptr, ptr, i64, %union.pthread_mutex_t, i64, ptr, [4096 x i8] }
%struct._task = type { i64, ptr, %union.anon }
%union.anon = type { %struct.Refinement_Task }
%struct.Refinement_Task = type { ptr, ptr, float, i64 }
%struct.Rgb = type { float, float, float }
%struct.Patch_Cost = type { ptr, ptr, i64, i64, i64, [11 x i64] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon.0, %union.anon.2, [2 x i32], [2 x i32], i32, i32, [2 x i32] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "total_patches", scope: !2, file: !3, line: 1180, type: !9, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !6, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "rad_tools.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "828c53ebc4433ea5d576304ed732e5e6")
!4 = !{!5}
!5 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!6 = !{!0, !7, !10, !12, !14, !16, !18, !20, !22, !24, !26, !36, !38, !40, !42, !44, !46, !48}
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "total_elements", scope: !2, file: !3, line: 1181, type: !9, isLocal: false, isDefinition: true)
!9 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "total_equiv_elements", scope: !2, file: !3, line: 1182, type: !9, isLocal: false, isDefinition: true)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "total_interactions", scope: !2, file: !3, line: 1183, type: !9, isLocal: false, isDefinition: true)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "total_comp_visible_interactions", scope: !2, file: !3, line: 1184, type: !9, isLocal: false, isDefinition: true)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "total_invisible_interactions", scope: !2, file: !3, line: 1185, type: !9, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "total_match3", scope: !2, file: !3, line: 1186, type: !9, isLocal: false, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "total_match2", scope: !2, file: !3, line: 1186, type: !9, isLocal: false, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "total_match1", scope: !2, file: !3, line: 1186, type: !9, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "total_match0", scope: !2, file: !3, line: 1186, type: !9, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "elem_interaction", scope: !2, file: !3, line: 1195, type: !28, isLocal: false, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 12928, elements: !34)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elem_Interaction", file: !3, line: 1193, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 1189, size: 128, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !30, file: !3, line: 1191, baseType: !9, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !30, file: !3, line: 1192, baseType: !5, size: 32, offset: 64)
!34 = !{!35}
!35 = !DISubrange(count: 101)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "many_interaction", scope: !2, file: !3, line: 1196, type: !29, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "n_elements_in_patch", scope: !2, file: !3, line: 1403, type: !9, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "n_equiv_elem_in_patch", scope: !2, file: !3, line: 1404, type: !9, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "min_elem_area", scope: !2, file: !3, line: 1405, type: !5, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "n_interactions_in_patch", scope: !2, file: !3, line: 1406, type: !9, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "n_comp_visible_interactions", scope: !2, file: !3, line: 1407, type: !9, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "n_invisible_interactions", scope: !2, file: !3, line: 1408, type: !9, isLocal: false, isDefinition: true)
!50 = !{i32 7, !"Dwarf Version", i32 5}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{i32 1, !"wchar_size", i32 4}
!53 = !{i32 7, !"PIC Level", i32 2}
!54 = !{i32 7, !"PIE Level", i32 2}
!55 = !{i32 7, !"uwtable", i32 2}
!56 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!57 = distinct !DISubprogram(name: "print_statistics", scope: !3, file: !3, line: 1205, type: !58, scopeLine: 1206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !122)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !9}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 7, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 49, size: 1728, elements: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!65 = !{!66, !68, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !84, !86, !87, !88, !91, !93, !95, !99, !102, !104, !107, !110, !111, !113, !117, !118}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !64, line: 51, baseType: !67, size: 32)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !63, file: !64, line: 54, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !63, file: !64, line: 55, baseType: !69, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !63, file: !64, line: 56, baseType: !69, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !63, file: !64, line: 57, baseType: !69, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !63, file: !64, line: 58, baseType: !69, size: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !63, file: !64, line: 59, baseType: !69, size: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !63, file: !64, line: 60, baseType: !69, size: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !63, file: !64, line: 61, baseType: !69, size: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !63, file: !64, line: 64, baseType: !69, size: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !63, file: !64, line: 65, baseType: !69, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !63, file: !64, line: 66, baseType: !69, size: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !63, file: !64, line: 68, baseType: !82, size: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !64, line: 36, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !63, file: !64, line: 70, baseType: !85, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !63, file: !64, line: 72, baseType: !67, size: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !63, file: !64, line: 73, baseType: !67, size: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !63, file: !64, line: 74, baseType: !89, size: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !9)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !63, file: !64, line: 77, baseType: !92, size: 16, offset: 1024)
!92 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !63, file: !64, line: 78, baseType: !94, size: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !63, file: !64, line: 79, baseType: !96, size: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !63, file: !64, line: 81, baseType: !100, size: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !64, line: 43, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !64, line: 89, baseType: !103, size: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 153, baseType: !9)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !63, file: !64, line: 91, baseType: !105, size: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !64, line: 37, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !63, file: !64, line: 92, baseType: !108, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !64, line: 38, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !63, file: !64, line: 93, baseType: !85, size: 64, offset: 1344)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !63, file: !64, line: 94, baseType: !112, size: 64, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !63, file: !64, line: 95, baseType: !114, size: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 46, baseType: !116)
!115 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!116 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !63, file: !64, line: 96, baseType: !67, size: 32, offset: 1536)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !63, file: !64, line: 98, baseType: !119, size: 160, offset: 1568)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 160, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 20)
!122 = !{!123, !124, !125}
!123 = !DILocalVariable(name: "fd", arg: 1, scope: !57, file: !3, line: 1205, type: !60)
!124 = !DILocalVariable(name: "process_id", arg: 2, scope: !57, file: !3, line: 1205, type: !9)
!125 = !DILocalVariable(name: "i", scope: !57, file: !3, line: 1207, type: !9)
!126 = !DILocation(line: 0, scope: !57)
!127 = !DILocation(line: 1210, column: 19, scope: !57)
!128 = !DILocation(line: 1211, column: 20, scope: !57)
!129 = !DILocation(line: 1212, column: 26, scope: !57)
!130 = !DILocation(line: 1213, column: 24, scope: !57)
!131 = !DILocation(line: 1214, column: 37, scope: !57)
!132 = !DILocation(line: 1215, column: 34, scope: !57)
!133 = !DILocation(line: 1216, column: 18, scope: !57)
!134 = !DILocation(line: 1217, column: 18, scope: !57)
!135 = !DILocation(line: 1218, column: 18, scope: !57)
!136 = !DILocation(line: 1219, column: 18, scope: !57)
!137 = !DILocation(line: 1221, column: 5, scope: !138)
!138 = distinct !DILexicalBlock(scope: !57, file: !3, line: 1221, column: 5)
!139 = !DILocation(line: 1223, column: 13, scope: !140)
!140 = distinct !DILexicalBlock(scope: !141, file: !3, line: 1222, column: 9)
!141 = distinct !DILexicalBlock(scope: !138, file: !3, line: 1221, column: 5)
!142 = !DILocation(line: 1223, column: 39, scope: !140)
!143 = !DILocation(line: 1224, column: 33, scope: !140)
!144 = !DILocation(line: 1224, column: 38, scope: !140)
!145 = !DILocation(line: 1221, column: 53, scope: !141)
!146 = !DILocation(line: 1221, column: 20, scope: !141)
!147 = distinct !{!147, !137, !148, !149, !150}
!148 = !DILocation(line: 1225, column: 9, scope: !138)
!149 = !{!"llvm.loop.mustprogress"}
!150 = !{!"llvm.loop.unroll.disable"}
!151 = !DILocation(line: 1226, column: 28, scope: !57)
!152 = !DILocation(line: 1227, column: 28, scope: !57)
!153 = !DILocation(line: 1229, column: 5, scope: !57)
!154 = !DILocation(line: 1231, column: 5, scope: !57)
!155 = !DILocation(line: 1233, column: 5, scope: !57)
!156 = !DILocation(line: 1234, column: 5, scope: !57)
!157 = !DILocation(line: 1235, column: 5, scope: !57)
!158 = !DILocation(line: 1236, column: 26, scope: !159)
!159 = distinct !DILexicalBlock(scope: !57, file: !3, line: 1236, column: 9)
!160 = !DILocation(line: 1236, column: 32, scope: !159)
!161 = !DILocation(line: 1236, column: 9, scope: !57)
!162 = !DILocation(line: 1241, column: 38, scope: !163)
!163 = distinct !DILexicalBlock(scope: !159, file: !3, line: 1237, column: 9)
!164 = !DILocation(line: 1241, column: 45, scope: !163)
!165 = !DILocation(line: 1241, column: 43, scope: !163)
!166 = !DILocation(line: 1241, column: 21, scope: !163)
!167 = !DILocation(line: 1238, column: 13, scope: !163)
!168 = !DILocation(line: 1242, column: 9, scope: !163)
!169 = !DILocation(line: 1243, column: 5, scope: !170)
!170 = distinct !DILexicalBlock(scope: !57, file: !3, line: 1243, column: 5)
!171 = !DILocation(line: 0, scope: !170)
!172 = !DILocation(line: 1244, column: 9, scope: !173)
!173 = distinct !DILexicalBlock(scope: !170, file: !3, line: 1243, column: 5)
!174 = !DILocation(line: 1244, column: 29, scope: !173)
!175 = !DILocation(line: 1244, column: 35, scope: !173)
!176 = !DILocation(line: 1244, column: 43, scope: !173)
!177 = distinct !{!177, !169, !178, !149, !150}
!178 = !DILocation(line: 1244, column: 48, scope: !170)
!179 = !DILocation(line: 1245, column: 14, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !3, line: 1245, column: 5)
!181 = distinct !DILexicalBlock(scope: !57, file: !3, line: 1245, column: 5)
!182 = !DILocation(line: 1245, column: 5, scope: !181)
!183 = !DILocation(line: 1247, column: 37, scope: !184)
!184 = distinct !DILexicalBlock(scope: !185, file: !3, line: 1247, column: 17)
!185 = distinct !DILexicalBlock(scope: !180, file: !3, line: 1246, column: 9)
!186 = !DILocation(line: 1247, column: 43, scope: !184)
!187 = !DILocation(line: 1247, column: 17, scope: !185)
!188 = !DILocation(line: 1257, column: 45, scope: !189)
!189 = distinct !DILexicalBlock(scope: !185, file: !3, line: 1250, column: 17)
!190 = !DILocation(line: 1257, column: 52, scope: !189)
!191 = !DILocation(line: 1257, column: 50, scope: !189)
!192 = !DILocation(line: 1257, column: 25, scope: !189)
!193 = !DILocation(line: 1255, column: 17, scope: !189)
!194 = distinct !{!194, !182, !195, !149, !150}
!195 = !DILocation(line: 1258, column: 9, scope: !181)
!196 = !DILocation(line: 1245, column: 22, scope: !180)
!197 = !DILocation(line: 1260, column: 5, scope: !57)
!198 = !DILocation(line: 1266, column: 5, scope: !57)
!199 = !DILocation(line: 1269, column: 5, scope: !57)
!200 = !DILocation(line: 1270, column: 5, scope: !57)
!201 = !DILocation(line: 1271, column: 5, scope: !57)
!202 = !DILocation(line: 1272, column: 5, scope: !57)
!203 = !DILocation(line: 1275, column: 5, scope: !57)
!204 = !DILocation(line: 1276, column: 54, scope: !57)
!205 = !DILocation(line: 1276, column: 5, scope: !57)
!206 = !DILocation(line: 1277, column: 54, scope: !57)
!207 = !DILocation(line: 1277, column: 5, scope: !57)
!208 = !DILocation(line: 1278, column: 54, scope: !57)
!209 = !DILocation(line: 1278, column: 5, scope: !57)
!210 = !DILocation(line: 1279, column: 53, scope: !57)
!211 = !DILocation(line: 1279, column: 5, scope: !57)
!212 = !DILocation(line: 1281, column: 13, scope: !57)
!213 = !DILocation(line: 1280, column: 5, scope: !57)
!214 = !DILocation(line: 1282, column: 54, scope: !57)
!215 = !DILocation(line: 1282, column: 5, scope: !57)
!216 = !DILocation(line: 1283, column: 53, scope: !57)
!217 = !DILocation(line: 1283, column: 5, scope: !57)
!218 = !DILocation(line: 1284, column: 53, scope: !57)
!219 = !DILocation(line: 1284, column: 5, scope: !57)
!220 = !DILocation(line: 1287, column: 13, scope: !57)
!221 = !DILocation(line: 1287, column: 21, scope: !57)
!222 = !DILocation(line: 1286, column: 5, scope: !57)
!223 = !DILocation(line: 1289, column: 5, scope: !57)
!224 = !DILocation(line: 1290, column: 59, scope: !57)
!225 = !DILocation(line: 1290, column: 5, scope: !57)
!226 = !DILocation(line: 1291, column: 59, scope: !57)
!227 = !DILocation(line: 1291, column: 5, scope: !57)
!228 = !DILocation(line: 1292, column: 59, scope: !57)
!229 = !DILocation(line: 1292, column: 5, scope: !57)
!230 = !DILocation(line: 1294, column: 13, scope: !57)
!231 = !DILocation(line: 1293, column: 5, scope: !57)
!232 = !DILocation(line: 1296, column: 13, scope: !57)
!233 = !DILocation(line: 1295, column: 5, scope: !57)
!234 = !DILocation(line: 1298, column: 13, scope: !57)
!235 = !DILocation(line: 1298, column: 34, scope: !57)
!236 = !DILocation(line: 1299, column: 15, scope: !57)
!237 = !DILocation(line: 1299, column: 13, scope: !57)
!238 = !DILocation(line: 1297, column: 5, scope: !57)
!239 = !DILocation(line: 1300, column: 5, scope: !57)
!240 = !DILocation(line: 1301, column: 59, scope: !57)
!241 = !DILocation(line: 1301, column: 5, scope: !57)
!242 = !DILocation(line: 1302, column: 59, scope: !57)
!243 = !DILocation(line: 1302, column: 5, scope: !57)
!244 = !DILocation(line: 1303, column: 59, scope: !57)
!245 = !DILocation(line: 1303, column: 5, scope: !57)
!246 = !DILocation(line: 1304, column: 59, scope: !57)
!247 = !DILocation(line: 1304, column: 5, scope: !57)
!248 = !DILocation(line: 1306, column: 20, scope: !57)
!249 = !DILocation(line: 1306, column: 13, scope: !57)
!250 = !DILocation(line: 1306, column: 44, scope: !57)
!251 = !DILocation(line: 1306, column: 37, scope: !57)
!252 = !DILocation(line: 1306, column: 35, scope: !57)
!253 = !DILocation(line: 1305, column: 5, scope: !57)
!254 = !DILocation(line: 1308, column: 20, scope: !57)
!255 = !DILocation(line: 1308, column: 13, scope: !57)
!256 = !DILocation(line: 1308, column: 48, scope: !57)
!257 = !DILocation(line: 1308, column: 41, scope: !57)
!258 = !DILocation(line: 1308, column: 39, scope: !57)
!259 = !DILocation(line: 1307, column: 5, scope: !57)
!260 = !DILocation(line: 1310, column: 20, scope: !57)
!261 = !DILocation(line: 1310, column: 13, scope: !57)
!262 = !DILocation(line: 1310, column: 48, scope: !57)
!263 = !DILocation(line: 1310, column: 41, scope: !57)
!264 = !DILocation(line: 1310, column: 39, scope: !57)
!265 = !DILocation(line: 1309, column: 5, scope: !57)
!266 = !DILocation(line: 1312, column: 13, scope: !57)
!267 = !DILocation(line: 1311, column: 5, scope: !57)
!268 = !DILocation(line: 1314, column: 20, scope: !57)
!269 = !DILocation(line: 1314, column: 13, scope: !57)
!270 = !DILocation(line: 1314, column: 44, scope: !57)
!271 = !DILocation(line: 1314, column: 37, scope: !57)
!272 = !DILocation(line: 1314, column: 35, scope: !57)
!273 = !DILocation(line: 1314, column: 65, scope: !57)
!274 = !DILocation(line: 1313, column: 5, scope: !57)
!275 = !DILocation(line: 1315, column: 1, scope: !57)
!276 = !DISubprogram(name: "foreach_patch_in_bsp", scope: !3, file: !3, line: 441, type: !277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !282)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !9, !9}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null, null}
!282 = !{}
!283 = distinct !DISubprogram(name: "get_patch_stat", scope: !3, file: !3, line: 1411, type: !284, scopeLine: 1412, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !416)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !286, !9, !9}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "Patch", file: !3, line: 345, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_patch", file: !3, line: 329, size: 1344, elements: !289)
!289 = !{!290, !347, !348, !349, !360, !361, !362, !363, !364, !365, !371, !372, !373, !374, !376, !377, !378, !415}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !288, file: !3, line: 330, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElemVertex", file: !3, line: 253, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_elemvertex", file: !3, line: 248, size: 320, elements: !294)
!294 = !{!295, !303, !310, !311}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !293, file: !3, line: 249, baseType: !296, size: 96)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vertex", file: !297, line: 14, baseType: !298)
!297 = !DIFile(filename: "./glibps/../structs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "127502bb3b1b1ffc96492ea685802424")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 12, size: 96, elements: !299)
!299 = !{!300, !301, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !298, file: !297, line: 13, baseType: !5, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !298, file: !297, line: 13, baseType: !5, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !298, file: !297, line: 13, baseType: !5, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !293, file: !3, line: 250, baseType: !304, size: 96, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "Rgb", file: !297, line: 24, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 22, size: 96, elements: !306)
!306 = !{!307, !308, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !305, file: !297, line: 23, baseType: !5, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !305, file: !297, line: 23, baseType: !5, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !305, file: !297, line: 23, baseType: !5, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !293, file: !3, line: 251, baseType: !5, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ev_lock", scope: !293, file: !3, line: 252, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "Shared_Lock", file: !3, line: 114, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 111, size: 320, elements: !315)
!315 = !{!316}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !314, file: !3, line: 113, baseType: !317, size: 320)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !318, line: 72, baseType: !319)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !318, line: 67, size: 320, elements: !320)
!320 = !{!321, !342, !346}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !319, file: !318, line: 69, baseType: !322, size: 320)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !323, line: 22, size: 320, elements: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!324 = !{!325, !326, !328, !329, !330, !331, !333, !334}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !322, file: !323, line: 24, baseType: !67, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !322, file: !323, line: 25, baseType: !327, size: 32, offset: 32)
!327 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !322, file: !323, line: 26, baseType: !67, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !322, file: !323, line: 28, baseType: !327, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !322, file: !323, line: 32, baseType: !67, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !322, file: !323, line: 34, baseType: !332, size: 16, offset: 160)
!332 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !322, file: !323, line: 35, baseType: !332, size: 16, offset: 176)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !322, file: !323, line: 36, baseType: !335, size: 128, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !336, line: 53, baseType: !337)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !336, line: 49, size: 128, elements: !338)
!338 = !{!339, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !337, file: !336, line: 51, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !337, file: !336, line: 52, baseType: !340, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !319, file: !318, line: 70, baseType: !343, size: 320)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 320, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 40)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !319, file: !318, line: 71, baseType: !9, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !288, file: !3, line: 330, baseType: !291, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !288, file: !3, line: 330, baseType: !291, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !288, file: !3, line: 331, baseType: !350, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "Edge", file: !3, line: 276, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_edge", file: !3, line: 272, size: 320, elements: !353)
!353 = !{!354, !355, !356, !358, !359}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !352, file: !3, line: 273, baseType: !291, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !352, file: !3, line: 273, baseType: !291, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ea", scope: !352, file: !3, line: 274, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "eb", scope: !352, file: !3, line: 274, baseType: !357, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "edge_lock", scope: !352, file: !3, line: 275, baseType: !312, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !288, file: !3, line: 331, baseType: !350, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !288, file: !3, line: 331, baseType: !350, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !288, file: !3, line: 332, baseType: !296, size: 96, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !288, file: !3, line: 332, baseType: !296, size: 96, offset: 480)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "p3", scope: !288, file: !3, line: 332, baseType: !296, size: 96, offset: 576)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "plane_equ", scope: !288, file: !3, line: 333, baseType: !366, size: 128, offset: 672)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PlaneEqu", file: !3, line: 301, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 297, size: 128, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !367, file: !3, line: 298, baseType: !296, size: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !367, file: !3, line: 299, baseType: !5, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !288, file: !3, line: 334, baseType: !5, size: 32, offset: 800)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !288, file: !3, line: 335, baseType: !304, size: 96, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "emittance", scope: !288, file: !3, line: 337, baseType: !304, size: 96, offset: 928)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_positive", scope: !288, file: !3, line: 339, baseType: !375, size: 64, offset: 1024)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_negative", scope: !288, file: !3, line: 340, baseType: !375, size: 64, offset: 1088)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_parent", scope: !288, file: !3, line: 341, baseType: !375, size: 64, offset: 1152)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "el_root", scope: !288, file: !3, line: 343, baseType: !379, size: 64, offset: 1216)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !3, line: 385, size: 1536, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "elem_lock", scope: !380, file: !3, line: 386, baseType: !312, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !380, file: !3, line: 387, baseType: !286, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !380, file: !3, line: 389, baseType: !379, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !380, file: !3, line: 390, baseType: !379, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !380, file: !3, line: 391, baseType: !379, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !380, file: !3, line: 392, baseType: !379, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !380, file: !3, line: 393, baseType: !379, size: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "interactions", scope: !380, file: !3, line: 395, baseType: !390, size: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interact", file: !3, line: 431, size: 256, elements: !392)
!392 = !{!393, !394, !397, !398, !399, !400}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !3, line: 432, baseType: !390, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !391, file: !3, line: 433, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "Element", file: !3, line: 410, baseType: !380)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_out", scope: !391, file: !3, line: 434, baseType: !5, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_err", scope: !391, file: !3, line: 435, baseType: !5, size: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "area_ratio", scope: !391, file: !3, line: 436, baseType: !5, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !391, file: !3, line: 437, baseType: !5, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "n_interactions", scope: !380, file: !3, line: 396, baseType: !9, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "vis_undef_inter", scope: !380, file: !3, line: 397, baseType: !390, size: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "n_vis_undef_inter", scope: !380, file: !3, line: 398, baseType: !9, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !380, file: !3, line: 400, baseType: !304, size: 96, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rad_in", scope: !380, file: !3, line: 402, baseType: !304, size: 96, offset: 800)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rad_subtree", scope: !380, file: !3, line: 403, baseType: !304, size: 96, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "join_counter", scope: !380, file: !3, line: 405, baseType: !9, size: 64, offset: 1024)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !380, file: !3, line: 407, baseType: !291, size: 64, offset: 1088)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !380, file: !3, line: 407, baseType: !291, size: 64, offset: 1152)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !380, file: !3, line: 407, baseType: !291, size: 64, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !380, file: !3, line: 408, baseType: !350, size: 64, offset: 1280)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !380, file: !3, line: 408, baseType: !350, size: 64, offset: 1344)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !380, file: !3, line: 408, baseType: !350, size: 64, offset: 1408)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !380, file: !3, line: 409, baseType: !5, size: 32, offset: 1472)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "seq_no", scope: !288, file: !3, line: 344, baseType: !9, size: 64, offset: 1280)
!416 = !{!417, !418, !419}
!417 = !DILocalVariable(name: "patch", arg: 1, scope: !283, file: !3, line: 1411, type: !286)
!418 = !DILocalVariable(name: "dummy", arg: 2, scope: !283, file: !3, line: 1411, type: !9)
!419 = !DILocalVariable(name: "process_id", arg: 3, scope: !283, file: !3, line: 1411, type: !9)
!420 = !DILocation(line: 0, scope: !283)
!421 = !DILocation(line: 1414, column: 25, scope: !283)
!422 = !DILocation(line: 1415, column: 27, scope: !283)
!423 = !DILocation(line: 1416, column: 28, scope: !283)
!424 = !DILocation(line: 1416, column: 19, scope: !283)
!425 = !DILocation(line: 1417, column: 29, scope: !283)
!426 = !DILocation(line: 1418, column: 33, scope: !283)
!427 = !DILocation(line: 1419, column: 30, scope: !283)
!428 = !DILocation(line: 1422, column: 5, scope: !283)
!429 = !DILocation(line: 1425, column: 18, scope: !283)
!430 = !DILocation(line: 1426, column: 23, scope: !283)
!431 = !DILocation(line: 1426, column: 20, scope: !283)
!432 = !DILocation(line: 1427, column: 29, scope: !283)
!433 = !DILocation(line: 1427, column: 26, scope: !283)
!434 = !DILocation(line: 1428, column: 27, scope: !283)
!435 = !DILocation(line: 1428, column: 24, scope: !283)
!436 = !DILocation(line: 1429, column: 40, scope: !283)
!437 = !DILocation(line: 1429, column: 37, scope: !283)
!438 = !DILocation(line: 1430, column: 37, scope: !283)
!439 = !DILocation(line: 1430, column: 34, scope: !283)
!440 = !DILocation(line: 1442, column: 1, scope: !283)
!441 = distinct !DISubprogram(name: "print_per_process_info", scope: !3, file: !3, line: 1326, type: !58, scopeLine: 1327, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !442)
!442 = !{!443, !444, !445, !446, !447, !486}
!443 = !DILocalVariable(name: "fd", arg: 1, scope: !441, file: !3, line: 1326, type: !60)
!444 = !DILocalVariable(name: "process", arg: 2, scope: !441, file: !3, line: 1326, type: !9)
!445 = !DILocalVariable(name: "cache_line", scope: !441, file: !3, line: 1328, type: !9)
!446 = !DILocalVariable(name: "iteration", scope: !441, file: !3, line: 1329, type: !9)
!447 = !DILocalVariable(name: "ps", scope: !441, file: !3, line: 1330, type: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "StatisticalInfo", file: !3, line: 926, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 906, size: 72576, elements: !451)
!451 = !{!452, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !472, !485}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !450, file: !3, line: 908, baseType: !453, size: 32768)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32768, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 4096)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "total_modeling_tasks", scope: !450, file: !3, line: 910, baseType: !9, size: 64, offset: 32768)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "total_def_patch_tasks", scope: !450, file: !3, line: 911, baseType: !9, size: 64, offset: 32832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "total_ff_ref_tasks", scope: !450, file: !3, line: 912, baseType: !9, size: 64, offset: 32896)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "total_ray_tasks", scope: !450, file: !3, line: 913, baseType: !9, size: 64, offset: 32960)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "total_radavg_tasks", scope: !450, file: !3, line: 914, baseType: !9, size: 64, offset: 33024)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "total_direct_radavg_tasks", scope: !450, file: !3, line: 915, baseType: !9, size: 64, offset: 33088)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "total_interaction_comp", scope: !450, file: !3, line: 916, baseType: !9, size: 64, offset: 33152)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "total_visibility_comp", scope: !450, file: !3, line: 917, baseType: !9, size: 64, offset: 33216)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "partially_visible", scope: !450, file: !3, line: 918, baseType: !9, size: 64, offset: 33280)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "total_ray_intersect_test", scope: !450, file: !3, line: 919, baseType: !9, size: 64, offset: 33344)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "total_patch_cache_check", scope: !450, file: !3, line: 920, baseType: !9, size: 64, offset: 33408)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "total_patch_cache_hit", scope: !450, file: !3, line: 921, baseType: !9, size: 64, offset: 33472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "patch_cache_hit", scope: !450, file: !3, line: 922, baseType: !469, size: 128, offset: 33536)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 2)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "per_iteration", scope: !450, file: !3, line: 923, baseType: !473, size: 6144, offset: 33664)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 6144, elements: !483)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerIterationInfo", file: !3, line: 903, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 895, size: 384, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_comp", scope: !475, file: !3, line: 897, baseType: !9, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ray_intersect_test", scope: !475, file: !3, line: 898, baseType: !9, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tasks_from_myq", scope: !475, file: !3, line: 899, baseType: !9, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tasks_from_otherq", scope: !475, file: !3, line: 900, baseType: !9, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "process_tasks_wait", scope: !475, file: !3, line: 901, baseType: !9, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "last_pr_task", scope: !475, file: !3, line: 902, baseType: !379, size: 64, offset: 320)
!483 = !{!484}
!484 = !DISubrange(count: 16)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !450, file: !3, line: 924, baseType: !453, size: 32768, offset: 39808)
!486 = !DILocalVariable(name: "e", scope: !441, file: !3, line: 1331, type: !395)
!487 = !DILocation(line: 0, scope: !441)
!488 = !DILocation(line: 1333, column: 11, scope: !441)
!489 = !DILocation(line: 1336, column: 9, scope: !441)
!490 = !DILocation(line: 1335, column: 5, scope: !441)
!491 = !DILocation(line: 1338, column: 9, scope: !441)
!492 = !DILocation(line: 1337, column: 5, scope: !441)
!493 = !DILocation(line: 1340, column: 9, scope: !441)
!494 = !DILocation(line: 1339, column: 5, scope: !441)
!495 = !DILocation(line: 1342, column: 9, scope: !441)
!496 = !DILocation(line: 1341, column: 5, scope: !441)
!497 = !DILocation(line: 1344, column: 9, scope: !441)
!498 = !DILocation(line: 1343, column: 5, scope: !441)
!499 = !DILocation(line: 1346, column: 9, scope: !441)
!500 = !DILocation(line: 1345, column: 5, scope: !441)
!501 = !DILocation(line: 1348, column: 9, scope: !441)
!502 = !DILocation(line: 1347, column: 5, scope: !441)
!503 = !DILocation(line: 1350, column: 9, scope: !441)
!504 = !DILocation(line: 1351, column: 9, scope: !441)
!505 = !DILocation(line: 1349, column: 5, scope: !441)
!506 = !DILocation(line: 1353, column: 9, scope: !441)
!507 = !DILocation(line: 1352, column: 5, scope: !441)
!508 = !DILocation(line: 1355, column: 9, scope: !441)
!509 = !DILocation(line: 1355, column: 31, scope: !441)
!510 = !DILocation(line: 1355, column: 5, scope: !441)
!511 = !DILocation(line: 1356, column: 10, scope: !441)
!512 = !DILocation(line: 1356, column: 6, scope: !441)
!513 = !DILocation(line: 1356, column: 34, scope: !441)
!514 = !DILocation(line: 1355, column: 37, scope: !441)
!515 = !DILocation(line: 1354, column: 5, scope: !441)
!516 = !DILocation(line: 1360, column: 5, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 1357, column: 5)
!518 = distinct !DILexicalBlock(scope: !441, file: !3, line: 1357, column: 5)
!519 = !DILocation(line: 1360, column: 37, scope: !517)
!520 = !DILocation(line: 1361, column: 10, scope: !517)
!521 = !DILocation(line: 1361, column: 6, scope: !517)
!522 = !DILocation(line: 1361, column: 34, scope: !517)
!523 = !DILocation(line: 1360, column: 43, scope: !517)
!524 = !DILocation(line: 1358, column: 5, scope: !517)
!525 = !DILocation(line: 1364, column: 5, scope: !441)
!526 = !DILocation(line: 1365, column: 38, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !3, line: 1365, column: 5)
!528 = distinct !DILexicalBlock(scope: !441, file: !3, line: 1365, column: 5)
!529 = !DILocation(line: 1365, column: 46, scope: !527)
!530 = !DILocation(line: 1365, column: 36, scope: !527)
!531 = !DILocation(line: 1365, column: 5, scope: !528)
!532 = !DILocation(line: 1368, column: 20, scope: !533)
!533 = distinct !DILexicalBlock(scope: !527, file: !3, line: 1366, column: 5)
!534 = !DILocation(line: 1368, column: 49, scope: !533)
!535 = !DILocation(line: 1367, column: 9, scope: !533)
!536 = !DILocation(line: 1370, column: 38, scope: !533)
!537 = !DILocation(line: 1369, column: 9, scope: !533)
!538 = !DILocation(line: 1372, column: 38, scope: !533)
!539 = !DILocation(line: 1371, column: 9, scope: !533)
!540 = !DILocation(line: 1374, column: 38, scope: !533)
!541 = !DILocation(line: 1373, column: 9, scope: !533)
!542 = !DILocation(line: 1376, column: 38, scope: !533)
!543 = !DILocation(line: 1375, column: 9, scope: !533)
!544 = !DILocation(line: 1377, column: 42, scope: !533)
!545 = !DILocation(line: 1378, column: 15, scope: !546)
!546 = distinct !DILexicalBlock(scope: !533, file: !3, line: 1378, column: 13)
!547 = !DILocation(line: 1378, column: 13, scope: !533)
!548 = !DILocation(line: 1380, column: 16, scope: !549)
!549 = distinct !DILexicalBlock(scope: !533, file: !3, line: 1380, column: 13)
!550 = !DILocation(line: 1380, column: 23, scope: !549)
!551 = !DILocation(line: 1380, column: 13, scope: !533)
!552 = !DILocation(line: 1382, column: 13, scope: !553)
