; ModuleID = 'radix.c'
source_filename = "radix.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.global_private = type { [4096 x i8], ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.global_memory = type { i64, %union.pthread_mutex_t, %union.pthread_mutex_t, %struct.anon, %struct.anon.3, ptr, ptr, ptr, i64, i64, i64, i64, [2048 x %struct.prefix_node] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%struct.anon.3 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%struct.prefix_node = type { [4096 x i64], [4096 x i64], %union.sem_t, [4096 x i8] }
%union.sem_t = type { i64, [24 x i8] }

@__threads__ = dso_local local_unnamed_addr global i32 0, align 4, !dbg !0
@number_of_processors = dso_local local_unnamed_addr global i64 1, align 8, !dbg !135
@radix = dso_local local_unnamed_addr global i64 1024, align 8, !dbg !137
@num_keys = dso_local local_unnamed_addr global i64 262144, align 8, !dbg !139

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__threads__", scope: !2, file: !3, line: 72, type: !22, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !134, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "radix.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/radix", checksumkind: CSK_MD5, checksum: "173029c344f4c043dfd3d0757299db48")
!4 = !{!5, !128, !129, !96, !130, !131, !97, !9}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_memory", file: !3, line: 83, size: 1141377664, elements: !7)
!7 = !{!8, !10, !43, !44, !89, !95, !98, !99, !100, !101, !103, !104, !105}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !6, file: !3, line: 84, baseType: !9, size: 64)
!9 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "lock_Index", scope: !6, file: !3, line: 85, baseType: !11, size: 320, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !12, line: 72, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!13 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 67, size: 320, elements: !14)
!14 = !{!15, !37, !42}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !13, file: !12, line: 69, baseType: !16, size: 320)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !17, line: 22, size: 320, elements: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!18 = !{!19, !21, !23, !24, !25, !26, !28, !29}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !16, file: !17, line: 24, baseType: !20, size: 32)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !16, file: !17, line: 25, baseType: !22, size: 32, offset: 32)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !16, file: !17, line: 26, baseType: !20, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !16, file: !17, line: 28, baseType: !22, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !16, file: !17, line: 32, baseType: !20, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !16, file: !17, line: 34, baseType: !27, size: 16, offset: 160)
!27 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !16, file: !17, line: 35, baseType: !27, size: 16, offset: 176)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !16, file: !17, line: 36, baseType: !30, size: 128, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !31, line: 53, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !31, line: 49, size: 128, elements: !33)
!33 = !{!34, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !32, file: !31, line: 51, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !32, file: !31, line: 52, baseType: !35, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !13, file: !12, line: 70, baseType: !38, size: 320)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 320, elements: !40)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !{!41}
!41 = !DISubrange(count: 40)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !13, file: !12, line: 71, baseType: !9, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rank_lock", scope: !6, file: !3, line: 86, baseType: !11, size: 320, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "barrier_rank", scope: !6, file: !3, line: 88, baseType: !45, size: 768, offset: 704)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !6, file: !3, line: 88, size: 768, elements: !46)
!46 = !{!47, !48, !88}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !45, file: !3, line: 88, baseType: !11, size: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !45, file: !3, line: 88, baseType: !49, size: 384, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !12, line: 80, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 75, size: 384, elements: !51)
!51 = !{!52, !82, !86}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !50, file: !12, line: 77, baseType: !53, size: 384)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !31, line: 92, size: 384, elements: !54)
!54 = !{!55, !65, !74, !78, !79, !80, !81}
!55 = !DIDerivedType(tag: DW_TAG_member, scope: !53, file: !31, line: 94, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !53, file: !31, line: 94, size: 64, elements: !57)
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !56, file: !31, line: 96, baseType: !59, size: 64)
!59 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !56, file: !31, line: 101, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !31, line: 97, size: 64, elements: !62)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !61, file: !31, line: 99, baseType: !22, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !61, file: !31, line: 100, baseType: !22, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, scope: !53, file: !31, line: 103, baseType: !66, size: 64, offset: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !53, file: !31, line: 103, size: 64, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !66, file: !31, line: 105, baseType: !59, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !66, file: !31, line: 110, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !66, file: !31, line: 106, size: 64, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !70, file: !31, line: 108, baseType: !22, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !70, file: !31, line: 109, baseType: !22, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !53, file: !31, line: 112, baseType: !75, size: 64, offset: 128)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 2)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !53, file: !31, line: 113, baseType: !75, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !53, file: !31, line: 114, baseType: !22, size: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !53, file: !31, line: 115, baseType: !22, size: 32, offset: 288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !53, file: !31, line: 116, baseType: !75, size: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !50, file: !12, line: 78, baseType: !83, size: 384)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 384, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 48)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !50, file: !12, line: 79, baseType: !87, size: 64)
!87 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !45, file: !3, line: 88, baseType: !22, size: 32, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "barrier_key", scope: !6, file: !3, line: 89, baseType: !90, size: 768, offset: 1472)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !6, file: !3, line: 89, size: 768, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !90, file: !3, line: 89, baseType: !11, size: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !90, file: !3, line: 89, baseType: !49, size: 384, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !90, file: !3, line: 89, baseType: !22, size: 32, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ranktime", scope: !6, file: !3, line: 90, baseType: !96, size: 64, offset: 2240)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "sorttime", scope: !6, file: !3, line: 91, baseType: !96, size: 64, offset: 2304)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "totaltime", scope: !6, file: !3, line: 92, baseType: !96, size: 64, offset: 2368)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !6, file: !3, line: 93, baseType: !9, size: 64, offset: 2432)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !6, file: !3, line: 94, baseType: !102, size: 64, offset: 2496)
!102 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !6, file: !3, line: 95, baseType: !102, size: 64, offset: 2560)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !6, file: !3, line: 96, baseType: !102, size: 64, offset: 2624)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_tree", scope: !6, file: !3, line: 97, baseType: !106, size: 1141374976, offset: 2688)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 1141374976, elements: !126)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prefix_node", file: !3, line: 76, size: 557312, elements: !108)
!108 = !{!109, !113, !114, !124}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "densities", scope: !107, file: !3, line: 77, baseType: !110, size: 262144)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 262144, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 4096)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !107, file: !3, line: 78, baseType: !110, size: 262144, offset: 262144)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !107, file: !3, line: 79, baseType: !115, size: 256, offset: 524288)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !116, line: 40, baseType: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "96899c0315b9f795a6965b6e4408f3b2")
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 36, size: 256, elements: !118)
!118 = !{!119, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !117, file: !116, line: 38, baseType: !120, size: 256)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !117, file: !116, line: 39, baseType: !9, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !107, file: !3, line: 80, baseType: !125, size: 32768, offset: 524544)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32768, elements: !111)
!126 = !{!127}
!127 = !DISubrange(count: 2048)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!128, !128}
!134 = !{!0, !135, !137, !139, !141, !143, !145, !147, !149, !155, !157, !159, !168, !171, !173, !175, !177, !179, !181}
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "number_of_processors", scope: !2, file: !3, line: 110, type: !9, isLocal: false, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "radix", scope: !2, file: !3, line: 112, type: !9, isLocal: false, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "num_keys", scope: !2, file: !3, line: 113, type: !9, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "max_key", scope: !2, file: !3, line: 114, type: !9, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "dostats", scope: !2, file: !3, line: 117, type: !9, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "test_result", scope: !2, file: !3, line: 118, type: !9, isLocal: false, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "doprint", scope: !2, file: !3, line: 119, type: !9, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "__tid__", scope: !2, file: !3, line: 71, type: !151, isLocal: false, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 16384, elements: !153)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !12, line: 27, baseType: !102)
!153 = !{!154}
!154 = !DISubrange(count: 256)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "__intern__", scope: !2, file: !3, line: 73, type: !11, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "global", scope: !2, file: !3, line: 98, type: !5, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "gp", scope: !2, file: !3, line: 103, type: !161, isLocal: false, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 33619968, elements: !166)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_private", file: !3, line: 100, size: 32832, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !162, file: !3, line: 101, baseType: !125, size: 32768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rank_ff", scope: !162, file: !3, line: 102, baseType: !129, size: 64, offset: 32768)
!166 = !{!167}
!167 = !DISubrange(count: 1024)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "key", scope: !2, file: !3, line: 105, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 128, elements: !76)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "rank_me", scope: !2, file: !3, line: 106, type: !130, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "key_partition", scope: !2, file: !3, line: 107, type: !129, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "rank_partition", scope: !2, file: !3, line: 108, type: !129, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "max_num_digits", scope: !2, file: !3, line: 111, type: !9, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "log2_radix", scope: !2, file: !3, line: 115, type: !9, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "log2_keys", scope: !2, file: !3, line: 116, type: !9, isLocal: false, isDefinition: true)
!183 = !{i32 7, !"Dwarf Version", i32 5}
!184 = !{i32 2, !"Debug Info Version", i32 3}
!185 = !{i32 1, !"wchar_size", i32 4}
!186 = !{i32 7, !"PIC Level", i32 2}
!187 = !{i32 7, !"PIE Level", i32 2}
!188 = !{i32 7, !"uwtable", i32 2}
!189 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!190 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 133, type: !191, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !195)
!191 = !DISubroutineType(types: !192)
!192 = !{!20, !20, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !221, !222}
!196 = !DILocalVariable(name: "argc", arg: 1, scope: !190, file: !3, line: 133, type: !20)
!197 = !DILocalVariable(name: "argv", arg: 2, scope: !190, file: !3, line: 133, type: !193)
!198 = !DILocalVariable(name: "i", scope: !190, file: !3, line: 135, type: !9)
!199 = !DILocalVariable(name: "p", scope: !190, file: !3, line: 136, type: !9)
!200 = !DILocalVariable(name: "quotient", scope: !190, file: !3, line: 137, type: !9)
!201 = !DILocalVariable(name: "remainder", scope: !190, file: !3, line: 138, type: !9)
!202 = !DILocalVariable(name: "sum_i", scope: !190, file: !3, line: 139, type: !9)
!203 = !DILocalVariable(name: "sum_f", scope: !190, file: !3, line: 140, type: !9)
!204 = !DILocalVariable(name: "size", scope: !190, file: !3, line: 141, type: !9)
!205 = !DILocalVariable(name: "temp", scope: !190, file: !3, line: 142, type: !130)
!206 = !DILocalVariable(name: "temp2", scope: !190, file: !3, line: 143, type: !130)
!207 = !DILocalVariable(name: "a", scope: !190, file: !3, line: 144, type: !129)
!208 = !DILocalVariable(name: "c", scope: !190, file: !3, line: 145, type: !9)
!209 = !DILocalVariable(name: "mint", scope: !190, file: !3, line: 146, type: !97)
!210 = !DILocalVariable(name: "maxt", scope: !190, file: !3, line: 146, type: !97)
!211 = !DILocalVariable(name: "avgt", scope: !190, file: !3, line: 146, type: !97)
