; ModuleID = 'slave1.c'
source_filename = "slave1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global_Private = type { [4096 x i8], double, double, [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64], [14 x i64] }
%struct.wrk2_struct = type { [8194 x [8194 x double]], [8194 x double] }
%struct.fields2_struct = type { [8194 x [8194 x double]], [8194 x [8194 x double]] }
%struct.bars_struct = type { %struct.anon, %struct.anon.3, %struct.anon.4, %struct.anon.5, %struct.anon.6, %struct.anon.7, %struct.anon.8, %struct.anon.9, %struct.anon.10, %struct.anon.11, %struct.anon.12, %struct.anon.13, %struct.anon.14, %struct.anon.15, %struct.anon.16, %struct.anon.17, %struct.anon.18, %struct.anon.19, %struct.anon.20, %struct.anon.21 }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }

!1596 = !DILocation(line: 637, column: 10, scope: !1311)
!1597 = !DILocation(line: 639, column: 33, scope: !1598)
!1598 = distinct !DILexicalBlock(scope: !1599, file: !1, line: 638, column: 39)
!1599 = distinct !DILexicalBlock(scope: !1600, file: !1, line: 638, column: 8)
!1600 = distinct !DILexicalBlock(scope: !1601, file: !1, line: 638, column: 8)
!1601 = distinct !DILexicalBlock(scope: !1602, file: !1, line: 637, column: 25)
!1602 = distinct !DILexicalBlock(scope: !1311, file: !1, line: 637, column: 10)
!1603 = !DILocation(line: 639, column: 54, scope: !1598)
!1604 = !DILocation(line: 639, column: 53, scope: !1598)
!1605 = !DILocation(line: 639, column: 31, scope: !1598)
!1606 = !DILocation(line: 638, column: 35, scope: !1599)
!1607 = !DILocation(line: 638, column: 24, scope: !1599)
!1608 = !DILocation(line: 638, column: 8, scope: !1600)
!1609 = distinct !{!1609, !1608, !1610, !103, !104}
!1610 = !DILocation(line: 640, column: 8, scope: !1600)
!1611 = !DILocation(line: 642, column: 32, scope: !1612)
!1612 = distinct !DILexicalBlock(scope: !1311, file: !1, line: 642, column: 10)
!1613 = !DILocation(line: 642, column: 34, scope: !1612)
!1614 = !DILocation(line: 642, column: 29, scope: !1612)
!1615 = !DILocation(line: 642, column: 10, scope: !1311)
!1616 = !DILocation(line: 644, column: 36, scope: !1617)
!1617 = distinct !DILexicalBlock(scope: !1618, file: !1, line: 643, column: 39)
!1618 = distinct !DILexicalBlock(scope: !1619, file: !1, line: 643, column: 8)
!1619 = distinct !DILexicalBlock(scope: !1620, file: !1, line: 643, column: 8)
!1620 = distinct !DILexicalBlock(scope: !1612, file: !1, line: 642, column: 38)
!1621 = !DILocation(line: 644, column: 56, scope: !1617)
!1622 = !DILocation(line: 644, column: 60, scope: !1617)
!1623 = !DILocation(line: 644, column: 59, scope: !1617)
!1624 = !DILocation(line: 644, column: 34, scope: !1617)
!1625 = !DILocation(line: 643, column: 8, scope: !1619)
!1626 = distinct !{!1626, !1625, !1627, !103, !104}
!1627 = !DILocation(line: 645, column: 8, scope: !1619)
!1628 = !DILocation(line: 644, column: 54, scope: !1617)
!1629 = !DILocation(line: 643, column: 35, scope: !1618)
!1630 = !DILocation(line: 643, column: 24, scope: !1618)
!1631 = !DILocation(line: 647, column: 6, scope: !1632)
!1632 = distinct !DILexicalBlock(scope: !1311, file: !1, line: 647, column: 6)
!1633 = !DILocation(line: 648, column: 8, scope: !1634)
!1634 = distinct !DILexicalBlock(scope: !1635, file: !1, line: 648, column: 8)
!1635 = distinct !DILexicalBlock(scope: !1636, file: !1, line: 647, column: 37)
!1636 = distinct !DILexicalBlock(scope: !1632, file: !1, line: 647, column: 6)
!1637 = !DILocation(line: 649, column: 38, scope: !1638)
!1638 = distinct !DILexicalBlock(scope: !1639, file: !1, line: 648, column: 54)
!1639 = distinct !DILexicalBlock(scope: !1634, file: !1, line: 648, column: 8)
!1640 = !DILocation(line: 649, column: 64, scope: !1638)
!1641 = !DILocation(line: 649, column: 63, scope: !1638)
!1642 = !DILocation(line: 649, column: 36, scope: !1638)
!1643 = !DILocation(line: 648, column: 50, scope: !1639)
!1644 = !DILocation(line: 648, column: 34, scope: !1639)
!1645 = distinct !{!1645, !1633, !1646, !103, !104}
!1646 = !DILocation(line: 650, column: 8, scope: !1634)
!1647 = !DILocation(line: 647, column: 33, scope: !1636)
!1648 = !DILocation(line: 647, column: 22, scope: !1636)
!1649 = distinct !{!1649, !1631, !1650, !103, !104}
!1650 = !DILocation(line: 651, column: 6, scope: !1632)
!1651 = !DILocation(line: 652, column: 25, scope: !1652)
!1652 = distinct !DILexicalBlock(scope: !1311, file: !1, line: 652, column: 10)
!1653 = !DILocation(line: 652, column: 18, scope: !1652)
!1654 = !DILocation(line: 652, column: 15, scope: !1652)
!1655 = !DILocation(line: 656, column: 26, scope: !1656)
!1656 = distinct !DILexicalBlock(scope: !12, file: !1, line: 656, column: 7)
!1657 = !DILocation(line: 657, column: 26, scope: !1658)
!1658 = distinct !DILexicalBlock(scope: !1659, file: !1, line: 657, column: 5)
!1659 = distinct !DILexicalBlock(scope: !1656, file: !1, line: 656, column: 41)
!1660 = !DILocation(line: 658, column: 29, scope: !1659)
!1661 = !DILocation(line: 658, column: 32, scope: !1659)
!1662 = !DILocation(line: 658, column: 43, scope: !1659)
!1663 = !DILocation(line: 658, column: 31, scope: !1659)
!1664 = !DILocation(line: 658, column: 27, scope: !1659)
!1665 = !DILocation(line: 659, column: 3, scope: !1659)
!1666 = !DILocation(line: 660, column: 1, scope: !12)
!1667 = !DISubprogram(name: "pthread_mutex_lock", scope: !1668, file: !1668, line: 738, type: !1669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1704)
!1668 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!1671, !1672}
!1671 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64)
!1673 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !1674, line: 72, baseType: !1675)
!1674 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!1675 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1674, line: 67, size: 320, elements: !1676)
!1676 = !{!1677, !1698, !1703}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1675, file: !1674, line: 69, baseType: !1678, size: 320)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !1679, line: 22, size: 320, elements: !1680)
!1679 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!1680 = !{!1681, !1682, !1684, !1685, !1686, !1687, !1689, !1690}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !1678, file: !1679, line: 24, baseType: !1671, size: 32)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1678, file: !1679, line: 25, baseType: !1683, size: 32, offset: 32)
!1683 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !1678, file: !1679, line: 26, baseType: !1671, size: 32, offset: 64)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !1678, file: !1679, line: 28, baseType: !1683, size: 32, offset: 96)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !1678, file: !1679, line: 32, baseType: !1671, size: 32, offset: 128)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !1678, file: !1679, line: 34, baseType: !1688, size: 16, offset: 160)
!1688 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !1678, file: !1679, line: 35, baseType: !1688, size: 16, offset: 176)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !1678, file: !1679, line: 36, baseType: !1691, size: 128, offset: 192)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !1692, line: 53, baseType: !1693)
!1692 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !1692, line: 49, size: 128, elements: !1694)
!1694 = !{!1695, !1697}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !1693, file: !1692, line: 51, baseType: !1696, size: 64)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !1693, file: !1692, line: 52, baseType: !1696, size: 64, offset: 64)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1675, file: !1674, line: 70, baseType: !1699, size: 320)
!1699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1700, size: 320, elements: !1701)
!1700 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1701 = !{!1702}
!1702 = !DISubrange(count: 40)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1675, file: !1674, line: 71, baseType: !4, size: 64)
!1704 = !{}
!1705 = !DISubprogram(name: "pthread_mutex_unlock", scope: !1668, file: !1668, line: 756, type: !1669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1704)
!1706 = !DISubprogram(name: "pthread_cond_broadcast", scope: !1668, file: !1668, line: 978, type: !1707, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1704)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!1671, !1709}
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64)
!1710 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !1674, line: 80, baseType: !1711)
!1711 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1674, line: 75, size: 384, elements: !1712)
!1712 = !{!1713, !1743, !1747}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1711, file: !1674, line: 77, baseType: !1714, size: 384)
!1714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !1692, line: 92, size: 384, elements: !1715)
!1715 = !{!1716, !1726, !1735, !1739, !1740, !1741, !1742}
!1716 = !DIDerivedType(tag: DW_TAG_member, scope: !1714, file: !1692, line: 94, baseType: !1717, size: 64)
!1717 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1714, file: !1692, line: 94, size: 64, elements: !1718)
!1718 = !{!1719, !1721}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !1717, file: !1692, line: 96, baseType: !1720, size: 64)
!1720 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !1717, file: !1692, line: 101, baseType: !1722, size: 64)
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1717, file: !1692, line: 97, size: 64, elements: !1723)
!1723 = !{!1724, !1725}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !1722, file: !1692, line: 99, baseType: !1683, size: 32)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !1722, file: !1692, line: 100, baseType: !1683, size: 32, offset: 32)
!1726 = !DIDerivedType(tag: DW_TAG_member, scope: !1714, file: !1692, line: 103, baseType: !1727, size: 64, offset: 64)
!1727 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1714, file: !1692, line: 103, size: 64, elements: !1728)
!1728 = !{!1729, !1730}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !1727, file: !1692, line: 105, baseType: !1720, size: 64)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !1727, file: !1692, line: 110, baseType: !1731, size: 64)
!1731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1727, file: !1692, line: 106, size: 64, elements: !1732)
!1732 = !{!1733, !1734}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !1731, file: !1692, line: 108, baseType: !1683, size: 32)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !1731, file: !1692, line: 109, baseType: !1683, size: 32, offset: 32)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !1714, file: !1692, line: 112, baseType: !1736, size: 64, offset: 128)
!1736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1683, size: 64, elements: !1737)
!1737 = !{!1738}
!1738 = !DISubrange(count: 2)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !1714, file: !1692, line: 113, baseType: !1736, size: 64, offset: 192)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !1714, file: !1692, line: 114, baseType: !1683, size: 32, offset: 256)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !1714, file: !1692, line: 115, baseType: !1683, size: 32, offset: 288)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !1714, file: !1692, line: 116, baseType: !1736, size: 64, offset: 320)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1711, file: !1674, line: 78, baseType: !1744, size: 384)
!1744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1700, size: 384, elements: !1745)
!1745 = !{!1746}
!1746 = !DISubrange(count: 48)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1711, file: !1674, line: 79, baseType: !1748, size: 64)
!1748 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!1749 = !DISubprogram(name: "pthread_cond_wait", scope: !1668, file: !1668, line: 986, type: !1750, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1704)
!1750 = !DISubroutineType(types: !1751)
!1751 = !{!1671, !1752, !1753}
!1752 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1709)
!1753 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1672)
!1754 = !DISubprogram(name: "multig", scope: !1755, file: !1755, line: 267, type: !1756, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1704)
!1755 = !DIFile(filename: "./decs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/ocean/non_contiguous_partitions", checksumkind: CSK_MD5, checksum: "2a5acdb29c04d6050612eaeb99cd08ba")
!1756 = !DISubroutineType(types: !1757)
!1757 = !{null, !4}
!1758 = !DISubprogram(name: "time", scope: !1, file: !1, line: 542, type: !1759, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1704)
!1759 = !DISubroutineType(types: !1760)
!1760 = !{!1761, !1765}
!1761 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1762, line: 7, baseType: !1763)
!1762 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!1763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1764, line: 160, baseType: !4)
!1764 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!1765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!1766 = !DISubprogram(name: "slave2", scope: !1755, file: !1755, line: 281, type: !1767, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1704)
!1767 = !DISubroutineType(types: !1768)
!1768 = !{null, !4, !4, !4, !4, !4, !4, !4}
