; ModuleID = 'slave2.c'
source_filename = "slave2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wrk1_struct = type { [8194 x [8194 x double]], [8194 x [8194 x double]], [8194 x [8194 x double]] }
%struct.wrk3_struct = type { [2 x [8194 x [8194 x double]]], [8194 x [8194 x double]] }
%struct.wrk5_struct = type { [2 x [8194 x [8194 x double]]], [2 x [8194 x [8194 x double]]] }
%struct.bars_struct = type { %struct.anon, %struct.anon.3, %struct.anon.4, %struct.anon.5, %struct.anon.6, %struct.anon.7, %struct.anon.8, %struct.anon.9, %struct.anon.10, %struct.anon.11, %struct.anon.12, %struct.anon.13, %struct.anon.14, %struct.anon.15, %struct.anon.16, %struct.anon.17, %struct.anon.18, %struct.anon.19, %struct.anon.20, %struct.anon.21 }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%struct.anon.3 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }

!3056 = !DILocation(line: 1073, column: 34, scope: !3057)
!3057 = distinct !DILexicalBlock(scope: !3058, file: !1, line: 1072, column: 37)
!3058 = distinct !DILexicalBlock(scope: !3059, file: !1, line: 1072, column: 6)
!3059 = distinct !DILexicalBlock(scope: !3060, file: !1, line: 1072, column: 6)
!3060 = distinct !DILexicalBlock(scope: !3052, file: !1, line: 1071, column: 36)
!3061 = !DILocation(line: 1073, column: 54, scope: !3057)
!3062 = !DILocation(line: 1073, column: 66, scope: !3057)
!3063 = !DILocation(line: 1073, column: 58, scope: !3057)
!3064 = !DILocation(line: 1073, column: 32, scope: !3057)
!3065 = !DILocation(line: 1072, column: 22, scope: !3058)
!3066 = !DILocation(line: 1072, column: 6, scope: !3059)
!3067 = distinct !{!3067, !3066, !3068, !110, !111}
!3068 = !DILocation(line: 1074, column: 6, scope: !3059)
!3069 = !DILocation(line: 1072, column: 33, scope: !3058)
!3070 = !DILocation(line: 1073, column: 52, scope: !3057)
!3071 = !DILocation(line: 1077, column: 4, scope: !3072)
!3072 = distinct !DILexicalBlock(scope: !9, file: !1, line: 1077, column: 4)
!3073 = !DILocation(line: 1078, column: 6, scope: !3074)
!3074 = distinct !DILexicalBlock(scope: !3075, file: !1, line: 1078, column: 6)
!3075 = distinct !DILexicalBlock(scope: !3076, file: !1, line: 1077, column: 35)
!3076 = distinct !DILexicalBlock(scope: !3072, file: !1, line: 1077, column: 4)
!3077 = !DILocation(line: 1079, column: 38, scope: !3078)
!3078 = distinct !DILexicalBlock(scope: !3079, file: !1, line: 1078, column: 52)
!3079 = distinct !DILexicalBlock(scope: !3074, file: !1, line: 1078, column: 6)
!3080 = !DILocation(line: 1079, column: 72, scope: !3078)
!3081 = !DILocation(line: 1079, column: 64, scope: !3078)
!3082 = !DILocation(line: 1079, column: 36, scope: !3078)
!3083 = !DILocation(line: 1078, column: 48, scope: !3079)
!3084 = !DILocation(line: 1078, column: 32, scope: !3079)
!3085 = distinct !{!3085, !3073, !3086, !110, !111}
!3086 = !DILocation(line: 1080, column: 6, scope: !3074)
!3087 = !DILocation(line: 1077, column: 31, scope: !3076)
!3088 = !DILocation(line: 1077, column: 20, scope: !3076)
!3089 = distinct !{!3089, !3071, !3090, !110, !111}
!3090 = !DILocation(line: 1081, column: 4, scope: !3072)
!3091 = !DILocation(line: 1084, column: 23, scope: !3092)
!3092 = distinct !DILexicalBlock(scope: !9, file: !1, line: 1083, column: 4)
!3093 = !DILocation(line: 1084, column: 29, scope: !3092)
!3094 = !DILocation(line: 1084, column: 1, scope: !3092)
!3095 = !DILocation(line: 1085, column: 2, scope: !3092)
!3096 = !DILocation(line: 1085, column: 21, scope: !3092)
!3097 = !DILocation(line: 1085, column: 31, scope: !3092)
!3098 = !DILocation(line: 1086, column: 5, scope: !3099)
!3099 = distinct !DILexicalBlock(scope: !3092, file: !1, line: 1086, column: 5)
!3100 = !DILocation(line: 1086, column: 40, scope: !3099)
!3101 = !DILocation(line: 1086, column: 36, scope: !3099)
!3102 = !DILocation(line: 1086, column: 5, scope: !3092)
!3103 = !DILocation(line: 1087, column: 33, scope: !3104)
!3104 = distinct !DILexicalBlock(scope: !3099, file: !1, line: 1086, column: 49)
!3105 = !DILocation(line: 1088, column: 47, scope: !3104)
!3106 = !DILocation(line: 1088, column: 2, scope: !3104)
!3107 = !DILocation(line: 1089, column: 1, scope: !3104)
!3108 = !DILocation(line: 1086, column: 12, scope: !3099)
!3109 = !DILocation(line: 1090, column: 42, scope: !3110)
!3110 = distinct !DILexicalBlock(scope: !3099, file: !1, line: 1089, column: 8)
!3111 = !DILocation(line: 1090, column: 2, scope: !3110)
!3112 = !DILocation(line: 1092, column: 25, scope: !3092)
!3113 = !DILocation(line: 1092, column: 31, scope: !3092)
!3114 = !DILocation(line: 1092, column: 1, scope: !3092)
!3115 = !DILocation(line: 1094, column: 1, scope: !9)
!3116 = !DISubprogram(name: "laplacalc", scope: !3117, file: !3117, line: 256, type: !3118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !3124)
!3117 = !DIFile(filename: "./decs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/ocean/non_contiguous_partitions", checksumkind: CSK_MD5, checksum: "2a5acdb29c04d6050612eaeb99cd08ba")
!3118 = !DISubroutineType(types: !3119)
!3119 = !{null, !3120, !3120, !12, !12, !12, !12, !12, !12}
!3120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3121, size: 64)
!3121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 524416, elements: !3122)
!3122 = !{!3123}
!3123 = !DISubrange(count: 8194)
!3124 = !{}
!3125 = !DISubprogram(name: "pthread_mutex_lock", scope: !3126, file: !3126, line: 738, type: !3127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !3124)
!3126 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!3127 = !DISubroutineType(types: !3128)
!3128 = !{!3129, !3130}
!3129 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!3130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3131, size: 64)
!3131 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !3132, line: 72, baseType: !3133)
!3132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!3133 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !3132, line: 67, size: 320, elements: !3134)
!3134 = !{!3135, !3156, !3161}
!3135 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !3133, file: !3132, line: 69, baseType: !3136, size: 320)
!3136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !3137, line: 22, size: 320, elements: !3138)
!3137 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!3138 = !{!3139, !3140, !3142, !3143, !3144, !3145, !3147, !3148}
!3139 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !3136, file: !3137, line: 24, baseType: !3129, size: 32)
!3140 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !3136, file: !3137, line: 25, baseType: !3141, size: 32, offset: 32)
!3141 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!3142 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !3136, file: !3137, line: 26, baseType: !3129, size: 32, offset: 64)
!3143 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !3136, file: !3137, line: 28, baseType: !3141, size: 32, offset: 96)
!3144 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !3136, file: !3137, line: 32, baseType: !3129, size: 32, offset: 128)
!3145 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !3136, file: !3137, line: 34, baseType: !3146, size: 16, offset: 160)
!3146 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!3147 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !3136, file: !3137, line: 35, baseType: !3146, size: 16, offset: 176)
!3148 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !3136, file: !3137, line: 36, baseType: !3149, size: 128, offset: 192)
!3149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !3150, line: 53, baseType: !3151)
!3150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!3151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !3150, line: 49, size: 128, elements: !3152)
!3152 = !{!3153, !3155}
!3153 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !3151, file: !3150, line: 51, baseType: !3154, size: 64)
!3154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3151, size: 64)
!3155 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !3151, file: !3150, line: 52, baseType: !3154, size: 64, offset: 64)
!3156 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !3133, file: !3132, line: 70, baseType: !3157, size: 320)
!3157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3158, size: 320, elements: !3159)
!3158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!3159 = !{!3160}
!3160 = !DISubrange(count: 40)
!3161 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !3133, file: !3132, line: 71, baseType: !12, size: 64)
!3162 = !DISubprogram(name: "pthread_cond_broadcast", scope: !3126, file: !3126, line: 978, type: !3163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !3124)
!3163 = !DISubroutineType(types: !3164)
!3164 = !{!3129, !3165}
!3165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3166, size: 64)
!3166 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !3132, line: 80, baseType: !3167)
!3167 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !3132, line: 75, size: 384, elements: !3168)
!3168 = !{!3169, !3199, !3203}
!3169 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !3167, file: !3132, line: 77, baseType: !3170, size: 384)
!3170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !3150, line: 92, size: 384, elements: !3171)
!3171 = !{!3172, !3182, !3191, !3195, !3196, !3197, !3198}
!3172 = !DIDerivedType(tag: DW_TAG_member, scope: !3170, file: !3150, line: 94, baseType: !3173, size: 64)
!3173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !3170, file: !3150, line: 94, size: 64, elements: !3174)
!3174 = !{!3175, !3177}
!3175 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !3173, file: !3150, line: 96, baseType: !3176, size: 64)
!3176 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!3177 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !3173, file: !3150, line: 101, baseType: !3178, size: 64)
!3178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !3173, file: !3150, line: 97, size: 64, elements: !3179)
!3179 = !{!3180, !3181}
!3180 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !3178, file: !3150, line: 99, baseType: !3141, size: 32)
!3181 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !3178, file: !3150, line: 100, baseType: !3141, size: 32, offset: 32)
!3182 = !DIDerivedType(tag: DW_TAG_member, scope: !3170, file: !3150, line: 103, baseType: !3183, size: 64, offset: 64)
!3183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !3170, file: !3150, line: 103, size: 64, elements: !3184)
!3184 = !{!3185, !3186}
!3185 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !3183, file: !3150, line: 105, baseType: !3176, size: 64)
!3186 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !3183, file: !3150, line: 110, baseType: !3187, size: 64)
!3187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !3183, file: !3150, line: 106, size: 64, elements: !3188)
!3188 = !{!3189, !3190}
!3189 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !3187, file: !3150, line: 108, baseType: !3141, size: 32)
!3190 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !3187, file: !3150, line: 109, baseType: !3141, size: 32, offset: 32)
!3191 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !3170, file: !3150, line: 112, baseType: !3192, size: 64, offset: 128)
!3192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3141, size: 64, elements: !3193)
!3193 = !{!3194}
!3194 = !DISubrange(count: 2)
!3195 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !3170, file: !3150, line: 113, baseType: !3192, size: 64, offset: 192)
!3196 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !3170, file: !3150, line: 114, baseType: !3141, size: 32, offset: 256)
!3197 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !3170, file: !3150, line: 115, baseType: !3141, size: 32, offset: 288)
!3198 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !3170, file: !3150, line: 116, baseType: !3192, size: 64, offset: 320)
!3199 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !3167, file: !3132, line: 78, baseType: !3200, size: 384)
!3200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3158, size: 384, elements: !3201)
!3201 = !{!3202}
!3202 = !DISubrange(count: 48)
!3203 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !3167, file: !3132, line: 79, baseType: !3204, size: 64)
!3204 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!3205 = !DISubprogram(name: "pthread_cond_wait", scope: !3126, file: !3126, line: 986, type: !3206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !3124)
!3206 = !DISubroutineType(types: !3207)
!3207 = !{!3129, !3208, !3209}
!3208 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !3165)
!3209 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !3130)
!3210 = !DISubprogram(name: "pthread_mutex_unlock", scope: !3126, file: !3126, line: 756, type: !3127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !3124)
!3211 = !DISubprogram(name: "jacobcalc", scope: !3117, file: !3117, line: 251, type: !3212, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !3124)
!3212 = !DISubroutineType(types: !3213)
!3213 = !{null, !3120, !3120, !3120, !12, !12, !12, !12, !12, !12, !12}
!3214 = !DISubprogram(name: "time", scope: !1, file: !1, line: 691, type: !3215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !3124)
!3215 = !DISubroutineType(types: !3216)
!3216 = !{!3217, !3221}
!3217 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !3218, line: 7, baseType: !3219)
!3218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!3219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !3220, line: 160, baseType: !12)
!3220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!3221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!3222 = !DISubprogram(name: "multig", scope: !3117, file: !3117, line: 267, type: !3223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !3124)
!3223 = !DISubroutineType(types: !3224)
!3224 = !{null, !12}
