; ModuleID = 'smallobj.c'
source_filename = "smallobj.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { [4096 x i8], i64, ptr, i64, ptr, i64, [4096 x i8] }
%struct.Vertex = type { float, float, float }
%struct.Rgb = type { float, float, float }
%struct.Global = type { i64, %union.pthread_mutex_t, [1024 x %struct.Task_Queue], [3276800 x %struct._task], %union.pthread_mutex_t, ptr, %union.pthread_mutex_t, i64, %struct.Rgb, %struct.Rgb, float, i64, %union.pthread_mutex_t, i64, i64, [1024 x %struct.Patch_Cost], %struct.anon.0, i64, %union.pthread_mutex_t, i64, %union.pthread_mutex_t, %union.pthread_mutex_t, ptr, i64, i64, [1024 x %struct._patch], %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, i64, ptr, %union.pthread_mutex_t, i64, ptr, [3900 x %struct.Shared_Lock], [1024 x %struct.StatisticalInfo] }
%struct.Task_Queue = type { [4096 x i8], %union.pthread_mutex_t, ptr, ptr, i64, %union.pthread_mutex_t, i64, ptr, [4096 x i8] }
%struct._task = type { i64, ptr, %union.anon }
%union.anon = type { %struct.Refinement_Task }
%struct.Refinement_Task = type { ptr, ptr, float, i64 }
%struct.Patch_Cost = type { ptr, ptr, i64, i64, i64, [11 x i64] }
%struct.anon.0 = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "sobj_struct", scope: !2, file: !3, line: 1182, type: !76, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !75, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "smallobj.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "f2c559b78bda30a48e1795fb435113f9")
!4 = !{!5, !6, !65}
!5 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElemVertex", file: !3, line: 255, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_elemvertex", file: !3, line: 250, size: 320, elements: !9)
!9 = !{!10, !18, !25, !26}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !8, file: !3, line: 251, baseType: !11, size: 96)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vertex", file: !12, line: 14, baseType: !13)
!12 = !DIFile(filename: "./glibps/../structs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "127502bb3b1b1ffc96492ea685802424")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 12, size: 96, elements: !14)
!14 = !{!15, !16, !17}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !13, file: !12, line: 13, baseType: !5, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !13, file: !12, line: 13, baseType: !5, size: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !13, file: !12, line: 13, baseType: !5, size: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !8, file: !3, line: 252, baseType: !19, size: 96, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Rgb", file: !12, line: 24, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 22, size: 96, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !20, file: !12, line: 23, baseType: !5, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !20, file: !12, line: 23, baseType: !5, size: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !20, file: !12, line: 23, baseType: !5, size: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !8, file: !3, line: 253, baseType: !5, size: 32, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ev_lock", scope: !8, file: !3, line: 254, baseType: !27, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "Shared_Lock", file: !3, line: 116, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 113, size: 320, elements: !30)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !29, file: !3, line: 115, baseType: !32, size: 320)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !33, line: 72, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!34 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !33, line: 67, size: 320, elements: !35)
!35 = !{!36, !58, !63}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !34, file: !33, line: 69, baseType: !37, size: 320)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !38, line: 22, size: 320, elements: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!39 = !{!40, !42, !44, !45, !46, !47, !49, !50}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !37, file: !38, line: 24, baseType: !41, size: 32)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !37, file: !38, line: 25, baseType: !43, size: 32, offset: 32)
!43 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !37, file: !38, line: 26, baseType: !41, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !37, file: !38, line: 28, baseType: !43, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !37, file: !38, line: 32, baseType: !41, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !37, file: !38, line: 34, baseType: !48, size: 16, offset: 160)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !37, file: !38, line: 35, baseType: !48, size: 16, offset: 176)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !37, file: !38, line: 36, baseType: !51, size: 128, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !52, line: 53, baseType: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !52, line: 49, size: 128, elements: !54)
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !53, file: !52, line: 51, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !53, file: !52, line: 52, baseType: !56, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !34, file: !33, line: 70, baseType: !59, size: 320)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 320, elements: !61)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!61 = !{!62}
!62 = !DISubrange(count: 40)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !34, file: !33, line: 71, baseType: !64, size: 64)
!64 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "Edge", file: !3, line: 278, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_edge", file: !3, line: 274, size: 320, elements: !68)
!68 = !{!69, !70, !71, !73, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !67, file: !3, line: 275, baseType: !6, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !67, file: !3, line: 275, baseType: !6, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ea", scope: !67, file: !3, line: 276, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "eb", scope: !67, file: !3, line: 276, baseType: !72, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "edge_lock", scope: !67, file: !3, line: 277, baseType: !27, size: 64, offset: 256)
!75 = !{!0}
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 67436544, elements: !89)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 1172, size: 65856, elements: !78)
!78 = !{!79, !83, !84, !85, !86, !87, !88}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !77, file: !3, line: 1173, baseType: !80, size: 32768)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32768, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 4096)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "n_local_free_elemvertex", scope: !77, file: !3, line: 1175, baseType: !64, size: 64, offset: 32768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "local_free_elemvertex", scope: !77, file: !3, line: 1176, baseType: !6, size: 64, offset: 32832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "n_local_free_edge", scope: !77, file: !3, line: 1177, baseType: !64, size: 64, offset: 32896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "local_free_edge", scope: !77, file: !3, line: 1178, baseType: !65, size: 64, offset: 32960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "lock_alloc_counter", scope: !77, file: !3, line: 1179, baseType: !64, size: 64, offset: 33024)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !77, file: !3, line: 1180, baseType: !80, size: 32768, offset: 33088)
!89 = !{!90}
!90 = !DISubrange(count: 1024)
!91 = !{i32 7, !"Dwarf Version", i32 5}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{i32 1, !"wchar_size", i32 4}
!94 = !{i32 7, !"PIC Level", i32 2}
!95 = !{i32 7, !"PIE Level", i32 2}
!96 = !{i32 7, !"uwtable", i32 2}
!97 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!98 = distinct !DISubprogram(name: "vector_length", scope: !3, file: !3, line: 1202, type: !99, scopeLine: 1203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !102)
!99 = !DISubroutineType(types: !100)
!100 = !{!5, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!102 = !{!103, !104, !106, !107}
!103 = !DILocalVariable(name: "v", arg: 1, scope: !98, file: !3, line: 1202, type: !101)
!104 = !DILocalVariable(name: "t0", scope: !98, file: !3, line: 1204, type: !105)
!105 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!106 = !DILocalVariable(name: "t1", scope: !98, file: !3, line: 1204, type: !105)
!107 = !DILocalVariable(name: "t2", scope: !98, file: !3, line: 1204, type: !105)
!108 = !DILocation(line: 0, scope: !98)
!109 = !DILocation(line: 1206, column: 13, scope: !98)
!110 = !DILocation(line: 1206, column: 15, scope: !98)
!111 = !DILocation(line: 1206, column: 10, scope: !98)
!112 = !DILocation(line: 1207, column: 13, scope: !98)
!113 = !DILocation(line: 1207, column: 15, scope: !98)
!114 = !DILocation(line: 1207, column: 10, scope: !98)
!115 = !DILocation(line: 1208, column: 13, scope: !98)
!116 = !DILocation(line: 1208, column: 15, scope: !98)
!117 = !DILocation(line: 1208, column: 10, scope: !98)
!118 = !DILocation(line: 1210, column: 22, scope: !98)
!119 = !DILocation(line: 1210, column: 27, scope: !98)
!120 = !DILocation(line: 1210, column: 13, scope: !98)
!121 = !DILocation(line: 1210, column: 11, scope: !98)
!122 = !DILocation(line: 1210, column: 5, scope: !98)
!123 = distinct !DISubprogram(name: "distance", scope: !3, file: !3, line: 1223, type: !124, scopeLine: 1224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!5, !101, !101}
!126 = !{!127, !128, !129}
!127 = !DILocalVariable(name: "p1", arg: 1, scope: !123, file: !3, line: 1223, type: !101)
!128 = !DILocalVariable(name: "p2", arg: 2, scope: !123, file: !3, line: 1223, type: !101)
!129 = !DILocalVariable(name: "v12", scope: !123, file: !3, line: 1225, type: !11)
!130 = !DILocation(line: 0, scope: !123)
!131 = !DILocation(line: 1225, column: 5, scope: !123)
!132 = !DILocation(line: 1225, column: 12, scope: !123)
!133 = !DILocation(line: 1227, column: 17, scope: !123)
!134 = !DILocation(line: 1227, column: 25, scope: !123)
!135 = !DILocation(line: 1227, column: 19, scope: !123)
!136 = !DILocation(line: 1227, column: 11, scope: !123)
!137 = !DILocation(line: 1228, column: 17, scope: !123)
!138 = !DILocation(line: 1228, column: 25, scope: !123)
!139 = !DILocation(line: 1228, column: 19, scope: !123)
!140 = !DILocation(line: 1228, column: 9, scope: !123)
!141 = !DILocation(line: 1228, column: 11, scope: !123)
!142 = !DILocation(line: 1229, column: 17, scope: !123)
!143 = !DILocation(line: 1229, column: 25, scope: !123)
!144 = !DILocation(line: 1229, column: 19, scope: !123)
!145 = !DILocation(line: 1229, column: 9, scope: !123)
!146 = !DILocation(line: 1229, column: 11, scope: !123)
!147 = !DILocation(line: 1231, column: 13, scope: !123)
!148 = !DILocation(line: 1232, column: 1, scope: !123)
!149 = !DILocation(line: 1231, column: 5, scope: !123)
