; ModuleID = 'taskman.c'
source_filename = "taskman.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon.4 = type { [4096 x i8], i64, ptr, i64, [4096 x i8] }
%struct.Global = type { i64, %union.pthread_mutex_t, [1024 x %struct.Task_Queue], [3276800 x %struct._task], %union.pthread_mutex_t, ptr, %union.pthread_mutex_t, i64, %struct.Rgb, %struct.Rgb, float, i64, %union.pthread_mutex_t, i64, i64, [1024 x %struct.Patch_Cost], %struct.anon, i64, %union.pthread_mutex_t, i64, %union.pthread_mutex_t, %union.pthread_mutex_t, ptr, i64, i64, [1024 x %struct._patch], %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, ptr, i64, ptr, %union.pthread_mutex_t, i64, ptr, %union.pthread_mutex_t, i64, ptr, [3900 x %struct.Shared_Lock], [1024 x %struct.StatisticalInfo] }
%struct.Task_Queue = type { [4096 x i8], %union.pthread_mutex_t, ptr, ptr, i64, %union.pthread_mutex_t, i64, ptr, [4096 x i8] }
%struct._task = type { i64, ptr, %union.anon }
%union.anon = type { %struct.Refinement_Task }
%struct.Refinement_Task = type { ptr, ptr, float, i64 }
%struct.Rgb = type { float, float, float }
%struct.Patch_Cost = type { ptr, ptr, i64, i64, i64, [11 x i64] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "task_struct", scope: !2, file: !3, line: 1183, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !6, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "taskman.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "5e9dcf901a084608291f14ef23a97307")
!4 = !{!5}
!5 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!6 = !{!0}
!7 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 67305472, elements: !217)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 1175, size: 65728, elements: !9)
!9 = !{!10, !15, !17, !215, !216}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !8, file: !3, line: 1176, baseType: !11, size: 32768)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32768, elements: !13)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!14}
!14 = !DISubrange(count: 4096)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "n_local_free_task", scope: !8, file: !3, line: 1178, baseType: !16, size: 64, offset: 32768)
!16 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "local_free_task", scope: !8, file: !3, line: 1179, baseType: !18, size: 64, offset: 32832)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Task", file: !3, line: 665, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_task", file: !3, line: 654, size: 384, elements: !21)
!21 = !{!22, !23, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "task_type", scope: !20, file: !3, line: 655, baseType: !16, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !3, line: 656, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !20, file: !3, line: 664, baseType: !26, size: 256, offset: 128)
!26 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !20, file: !3, line: 657, size: 256, elements: !27)
!27 = !{!28, !57, !181, !189, !195, !208}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !26, file: !3, line: 658, baseType: !29, size: 128)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Modeling_Task", file: !3, line: 603, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 600, size: 128, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !30, file: !3, line: 601, baseType: !16, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !30, file: !3, line: 602, baseType: !34, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "Model", file: !3, line: 514, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 510, size: 576, elements: !37)
!37 = !{!38, !46, !47}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !36, file: !3, line: 511, baseType: !39, size: 96)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Rgb", file: !40, line: 24, baseType: !41)
!40 = !DIFile(filename: "./glibps/../structs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "127502bb3b1b1ffc96492ea685802424")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 22, size: 96, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !41, file: !40, line: 23, baseType: !5, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !41, file: !40, line: 23, baseType: !5, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !41, file: !40, line: 23, baseType: !5, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "emittance", scope: !36, file: !3, line: 512, baseType: !39, size: 96, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy", scope: !36, file: !3, line: 513, baseType: !48, size: 384, offset: 192)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 384, elements: !55)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vertex", file: !40, line: 14, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 12, size: 96, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !50, file: !40, line: 13, baseType: !5, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !50, file: !40, line: 13, baseType: !5, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !50, file: !40, line: 13, baseType: !5, size: 32, offset: 64)
!55 = !{!56}
!56 = !DISubrange(count: 4)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "bsp", scope: !26, file: !3, line: 659, baseType: !58, size: 128)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "BSP_Task", file: !3, line: 610, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 607, size: 128, elements: !60)
!60 = !{!61, !180}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !59, file: !3, line: 608, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "Patch", file: !3, line: 349, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_patch", file: !3, line: 333, size: 1344, elements: !65)
!65 = !{!66, !111, !112, !113, !124, !125, !126, !127, !128, !129, !135, !136, !137, !138, !140, !141, !142, !179}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !64, file: !3, line: 334, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElemVertex", file: !3, line: 257, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_elemvertex", file: !3, line: 252, size: 320, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !69, file: !3, line: 253, baseType: !49, size: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !69, file: !3, line: 254, baseType: !39, size: 96, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !69, file: !3, line: 255, baseType: !5, size: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ev_lock", scope: !69, file: !3, line: 256, baseType: !75, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "Shared_Lock", file: !3, line: 118, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 115, size: 320, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !77, file: !3, line: 117, baseType: !80, size: 320)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !81, line: 72, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!82 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !81, line: 67, size: 320, elements: !83)
!83 = !{!84, !106, !110}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !82, file: !81, line: 69, baseType: !85, size: 320)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !86, line: 22, size: 320, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!87 = !{!88, !90, !92, !93, !94, !95, !97, !98}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !85, file: !86, line: 24, baseType: !89, size: 32)
!89 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !85, file: !86, line: 25, baseType: !91, size: 32, offset: 32)
!91 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !85, file: !86, line: 26, baseType: !89, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !85, file: !86, line: 28, baseType: !91, size: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !85, file: !86, line: 32, baseType: !89, size: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !85, file: !86, line: 34, baseType: !96, size: 16, offset: 160)
!96 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !85, file: !86, line: 35, baseType: !96, size: 16, offset: 176)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !85, file: !86, line: 36, baseType: !99, size: 128, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !100, line: 53, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !100, line: 49, size: 128, elements: !102)
!102 = !{!103, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !101, file: !100, line: 51, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !101, file: !100, line: 52, baseType: !104, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !82, file: !81, line: 70, baseType: !107, size: 320)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 320, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 40)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !82, file: !81, line: 71, baseType: !16, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !64, file: !3, line: 334, baseType: !67, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !64, file: !3, line: 334, baseType: !67, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !64, file: !3, line: 335, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Edge", file: !3, line: 280, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_edge", file: !3, line: 276, size: 320, elements: !117)
!117 = !{!118, !119, !120, !122, !123}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !116, file: !3, line: 277, baseType: !67, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !116, file: !3, line: 277, baseType: !67, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ea", scope: !116, file: !3, line: 278, baseType: !121, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "eb", scope: !116, file: !3, line: 278, baseType: !121, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "edge_lock", scope: !116, file: !3, line: 279, baseType: !75, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !64, file: !3, line: 335, baseType: !114, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !64, file: !3, line: 335, baseType: !114, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !64, file: !3, line: 336, baseType: !49, size: 96, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !64, file: !3, line: 336, baseType: !49, size: 96, offset: 480)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "p3", scope: !64, file: !3, line: 336, baseType: !49, size: 96, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "plane_equ", scope: !64, file: !3, line: 337, baseType: !130, size: 128, offset: 672)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PlaneEqu", file: !3, line: 305, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 301, size: 128, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !131, file: !3, line: 302, baseType: !49, size: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !131, file: !3, line: 303, baseType: !5, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !64, file: !3, line: 338, baseType: !5, size: 32, offset: 800)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !64, file: !3, line: 339, baseType: !39, size: 96, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "emittance", scope: !64, file: !3, line: 341, baseType: !39, size: 96, offset: 928)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_positive", scope: !64, file: !3, line: 343, baseType: !139, size: 64, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_negative", scope: !64, file: !3, line: 344, baseType: !139, size: 64, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_parent", scope: !64, file: !3, line: 345, baseType: !139, size: 64, offset: 1152)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "el_root", scope: !64, file: !3, line: 347, baseType: !143, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !3, line: 389, size: 1536, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "elem_lock", scope: !144, file: !3, line: 390, baseType: !75, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !144, file: !3, line: 391, baseType: !62, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !144, file: !3, line: 393, baseType: !143, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !144, file: !3, line: 394, baseType: !143, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !144, file: !3, line: 395, baseType: !143, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !144, file: !3, line: 396, baseType: !143, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !144, file: !3, line: 397, baseType: !143, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "interactions", scope: !144, file: !3, line: 399, baseType: !154, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interact", file: !3, line: 435, size: 256, elements: !156)
!156 = !{!157, !158, !161, !162, !163, !164}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !3, line: 436, baseType: !154, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !155, file: !3, line: 437, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "Element", file: !3, line: 414, baseType: !144)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_out", scope: !155, file: !3, line: 438, baseType: !5, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_err", scope: !155, file: !3, line: 439, baseType: !5, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "area_ratio", scope: !155, file: !3, line: 440, baseType: !5, size: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !155, file: !3, line: 441, baseType: !5, size: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "n_interactions", scope: !144, file: !3, line: 400, baseType: !16, size: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "vis_undef_inter", scope: !144, file: !3, line: 401, baseType: !154, size: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "n_vis_undef_inter", scope: !144, file: !3, line: 402, baseType: !16, size: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !144, file: !3, line: 404, baseType: !39, size: 96, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rad_in", scope: !144, file: !3, line: 406, baseType: !39, size: 96, offset: 800)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rad_subtree", scope: !144, file: !3, line: 407, baseType: !39, size: 96, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "join_counter", scope: !144, file: !3, line: 409, baseType: !16, size: 64, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !144, file: !3, line: 411, baseType: !67, size: 64, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !144, file: !3, line: 411, baseType: !67, size: 64, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !144, file: !3, line: 411, baseType: !67, size: 64, offset: 1216)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !144, file: !3, line: 412, baseType: !114, size: 64, offset: 1280)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !144, file: !3, line: 412, baseType: !114, size: 64, offset: 1344)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !144, file: !3, line: 412, baseType: !114, size: 64, offset: 1408)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !144, file: !3, line: 413, baseType: !5, size: 32, offset: 1472)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "seq_no", scope: !64, file: !3, line: 348, baseType: !16, size: 64, offset: 1280)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !59, file: !3, line: 609, baseType: !62, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !26, file: !3, line: 660, baseType: !182, size: 256)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "Refinement_Task", file: !3, line: 618, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 614, size: 256, elements: !184)
!184 = !{!185, !186, !187, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "e1", scope: !183, file: !3, line: 615, baseType: !159, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "e2", scope: !183, file: !3, line: 615, baseType: !159, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !183, file: !3, line: 616, baseType: !5, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !183, file: !3, line: 617, baseType: !16, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ray", scope: !26, file: !3, line: 661, baseType: !190, size: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ray_Task", file: !3, line: 624, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 621, size: 128, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ray_type", scope: !191, file: !3, line: 622, baseType: !16, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !191, file: !3, line: 623, baseType: !159, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "vis", scope: !26, file: !3, line: 662, baseType: !196, size: 256)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visibility_Task", file: !3, line: 632, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 627, size: 256, elements: !198)
!198 = !{!199, !200, !203, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !197, file: !3, line: 628, baseType: !159, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !197, file: !3, line: 629, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "Interaction", file: !3, line: 442, baseType: !155)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "n_inter", scope: !197, file: !3, line: 630, baseType: !16, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !197, file: !3, line: 631, baseType: !205, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, null}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !26, file: !3, line: 663, baseType: !209, size: 192)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "RadAvg_Task", file: !3, line: 643, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 639, size: 192, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !210, file: !3, line: 640, baseType: !159, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !210, file: !3, line: 641, baseType: !16, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !210, file: !3, line: 642, baseType: !16, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "crnt_taskq_id", scope: !8, file: !3, line: 1180, baseType: !16, size: 64, offset: 32896)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !8, file: !3, line: 1181, baseType: !11, size: 32768, offset: 32960)
!217 = !{!218}
!218 = !DISubrange(count: 1024)
!219 = !{i32 7, !"Dwarf Version", i32 5}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{i32 7, !"PIC Level", i32 2}
!223 = !{i32 7, !"PIE Level", i32 2}
!224 = !{i32 7, !"uwtable", i32 2}
!225 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!226 = distinct !DISubprogram(name: "process_tasks", scope: !3, file: !3, line: 1204, type: !227, scopeLine: 1205, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !16}
!229 = !{!230, !231, !232, !233, !235}
!230 = !DILocalVariable(name: "process_id", arg: 1, scope: !226, file: !3, line: 1204, type: !16)
!231 = !DILocalVariable(name: "t", scope: !226, file: !3, line: 1206, type: !18)
!232 = !DILocalVariable(name: "bar_done", scope: !226, file: !3, line: 1258, type: !16)
!233 = !DILocalVariable(name: "has_task", scope: !234, file: !3, line: 1273, type: !89)
!234 = distinct !DILexicalBlock(scope: !226, file: !3, line: 1261, column: 9)
!235 = !DILabel(scope: !226, name: "retry_entry", file: !3, line: 1208)
!236 = !DILocation(line: 0, scope: !226)
!237 = !DILocation(line: 1206, column: 5, scope: !226)
!238 = !DILocation(line: 0, scope: !234)
!239 = !DILocation(line: 1276, column: 39, scope: !240)
!240 = distinct !DILexicalBlock(scope: !241, file: !3, line: 1274, column: 23)
!241 = distinct !DILexicalBlock(scope: !234, file: !3, line: 1274, column: 13)
!242 = !DILocation(line: 1277, column: 53, scope: !243)
!243 = distinct !DILexicalBlock(scope: !240, file: !3, line: 1277, column: 21)
!244 = !DILocation(line: 1277, column: 22, scope: !243)
!245 = !DILocation(line: 1211, column: 5, scope: !226)
!246 = !DILocation(line: 1208, column: 1, scope: !226)
!247 = !DILocation(line: 1209, column: 9, scope: !226)
!248 = !DILocation(line: 1213, column: 24, scope: !249)
!249 = distinct !DILexicalBlock(scope: !226, file: !3, line: 1212, column: 9)
!250 = !DILocation(line: 1213, column: 13, scope: !249)
!251 = !DILocation(line: 1216, column: 39, scope: !252)
!252 = distinct !DILexicalBlock(scope: !249, file: !3, line: 1214, column: 17)
!253 = !DILocation(line: 1216, column: 50, scope: !252)
!254 = !DILocation(line: 1216, column: 71, scope: !252)
!255 = !DILocation(line: 1216, column: 21, scope: !252)
!256 = !DILocation(line: 1217, column: 21, scope: !252)
!257 = !DILocation(line: 1219, column: 38, scope: !252)
!258 = !DILocation(line: 1219, column: 47, scope: !252)
!259 = !DILocation(line: 1219, column: 66, scope: !252)
!260 = !DILocation(line: 1219, column: 21, scope: !252)
!261 = !DILocation(line: 1220, column: 21, scope: !252)
!262 = !DILocation(line: 1222, column: 44, scope: !252)
!263 = !DILocation(line: 1222, column: 53, scope: !252)
!264 = !DILocation(line: 1222, column: 69, scope: !252)
!265 = !DILocation(line: 1222, column: 21, scope: !252)
!266 = !DILocation(line: 1223, column: 21, scope: !252)
!267 = !DILocation(line: 1225, column: 38, scope: !252)
!268 = !DILocation(line: 1225, column: 47, scope: !252)
!269 = !DILocation(line: 1225, column: 21, scope: !252)
!270 = !DILocation(line: 1226, column: 21, scope: !252)
!271 = !DILocation(line: 1228, column: 41, scope: !252)
!272 = !DILocation(line: 1228, column: 50, scope: !252)
!273 = !DILocation(line: 1228, column: 65, scope: !252)
!274 = !DILocation(line: 1229, column: 49, scope: !252)
!275 = !DILocation(line: 1229, column: 70, scope: !252)
!276 = !DILocation(line: 1228, column: 21, scope: !252)
!277 = !DILocation(line: 1230, column: 21, scope: !252)
!278 = !DILocation(line: 1232, column: 45, scope: !252)
!279 = !DILocation(line: 1232, column: 54, scope: !252)
!280 = !DILocation(line: 1232, column: 69, scope: !252)
!281 = !DILocation(line: 1232, column: 21, scope: !252)
!282 = !DILocation(line: 1233, column: 21, scope: !252)
!283 = !DILocation(line: 1235, column: 30, scope: !252)
!284 = !DILocation(line: 1235, column: 21, scope: !252)
!285 = !DILocation(line: 1236, column: 17, scope: !252)
!286 = !DILocation(line: 1239, column: 13, scope: !249)
!287 = !DILocation(line: 1242, column: 17, scope: !249)
!288 = distinct !{!288, !245, !289, !290, !291}
!289 = !DILocation(line: 1243, column: 9, scope: !226)
!290 = !{!"llvm.loop.mustprogress"}
!291 = !{!"llvm.loop.unroll.disable"}
!292 = !DILocation(line: 1249, column: 27, scope: !293)
!293 = distinct !DILexicalBlock(scope: !226, file: !3, line: 1249, column: 5)
!294 = !DILocation(line: 1249, column: 35, scope: !293)
!295 = !DILocation(line: 1249, column: 6, scope: !293)
!296 = !DILocation(line: 1251, column: 9, scope: !297)
!297 = distinct !DILexicalBlock(scope: !226, file: !3, line: 1251, column: 9)
!298 = !DILocation(line: 1251, column: 17, scope: !297)
!299 = !DILocation(line: 1251, column: 31, scope: !297)
!300 = !DILocation(line: 1251, column: 28, scope: !297)
!301 = !DILocation(line: 1255, column: 23, scope: !226)
!302 = !DILocation(line: 1258, column: 42, scope: !226)
!303 = !DILocation(line: 1260, column: 5, scope: !226)
!304 = !DILocation(line: 1263, column: 17, scope: !305)
!305 = distinct !DILexicalBlock(scope: !234, file: !3, line: 1263, column: 17)
!306 = !DILocation(line: 1263, column: 17, scope: !234)
!307 = !DILocation(line: 1273, column: 38, scope: !234)
!308 = !DILocation(line: 1273, column: 64, scope: !234)
!309 = !DILocation(line: 1273, column: 24, scope: !234)
!310 = !DILocation(line: 1274, column: 13, scope: !241)
!311 = !DILocation(line: 1274, column: 13, scope: !234)
!312 = !DILocation(line: 1282, column: 43, scope: !234)
!313 = !DILocation(line: 1282, column: 41, scope: !234)
!314 = !DILocation(line: 1287, column: 23, scope: !315)
!315 = distinct !DILexicalBlock(scope: !226, file: !3, line: 1286, column: 5)
!316 = !DILocation(line: 1287, column: 31, scope: !315)
!317 = !DILocation(line: 1287, column: 1, scope: !315)
!318 = !DILocation(line: 1288, column: 2, scope: !315)
!319 = !DILocation(line: 1288, column: 19, scope: !315)
!320 = !DILocation(line: 1288, column: 29, scope: !315)
!321 = !DILocation(line: 1289, column: 5, scope: !322)
!322 = distinct !DILexicalBlock(scope: !315, file: !3, line: 1289, column: 5)
!323 = !DILocation(line: 1289, column: 38, scope: !322)
!324 = !DILocation(line: 1289, column: 34, scope: !322)
!325 = !DILocation(line: 1289, column: 5, scope: !315)
!326 = !DILocation(line: 1290, column: 31, scope: !327)
!327 = distinct !DILexicalBlock(scope: !322, file: !3, line: 1289, column: 53)
!328 = !DILocation(line: 1291, column: 45, scope: !327)
!329 = !DILocation(line: 1291, column: 2, scope: !327)
!330 = !DILocation(line: 1292, column: 1, scope: !327)
!331 = !DILocation(line: 1289, column: 14, scope: !322)
!332 = !DILocation(line: 1293, column: 40, scope: !333)
!333 = distinct !DILexicalBlock(scope: !322, file: !3, line: 1292, column: 8)
!334 = !DILocation(line: 1293, column: 2, scope: !333)
!335 = !DILocation(line: 1295, column: 25, scope: !315)
!336 = !DILocation(line: 1295, column: 33, scope: !315)
!337 = !DILocation(line: 1295, column: 1, scope: !315)
!338 = !DILocation(line: 1297, column: 1, scope: !226)
!339 = distinct !DISubprogram(name: "dequeue_task", scope: !3, file: !3, line: 1581, type: !340, scopeLine: 1590, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !342)
!340 = !DISubroutineType(types: !341)
!341 = !{!18, !16, !16, !16}
!342 = !{!343, !344, !345, !346, !360, !361, !362, !363, !364}
!343 = !DILocalVariable(name: "qid", arg: 1, scope: !339, file: !3, line: 1581, type: !16)
!344 = !DILocalVariable(name: "max_visit", arg: 2, scope: !339, file: !3, line: 1581, type: !16)
!345 = !DILocalVariable(name: "process_id", arg: 3, scope: !339, file: !3, line: 1581, type: !16)
!346 = !DILocalVariable(name: "tq", scope: !339, file: !3, line: 1591, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "Task_Queue", file: !3, line: 679, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 668, size: 66496, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !349, file: !3, line: 669, baseType: !11, size: 32768)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "q_lock", scope: !349, file: !3, line: 671, baseType: !80, size: 320, offset: 32768)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !349, file: !3, line: 672, baseType: !18, size: 64, offset: 33088)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !349, file: !3, line: 672, baseType: !18, size: 64, offset: 33152)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "n_tasks", scope: !349, file: !3, line: 673, baseType: !16, size: 64, offset: 33216)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "f_lock", scope: !349, file: !3, line: 674, baseType: !80, size: 320, offset: 33280)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "n_free", scope: !349, file: !3, line: 675, baseType: !16, size: 64, offset: 33600)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !349, file: !3, line: 676, baseType: !18, size: 64, offset: 33664)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !349, file: !3, line: 677, baseType: !11, size: 32768, offset: 33728)
!360 = !DILocalVariable(name: "t", scope: !339, file: !3, line: 1592, type: !18)
!361 = !DILocalVariable(name: "prev", scope: !339, file: !3, line: 1593, type: !18)
!362 = !DILocalVariable(name: "visit_count", scope: !339, file: !3, line: 1594, type: !16)
!363 = !DILocalVariable(name: "sign", scope: !339, file: !3, line: 1595, type: !16)
!364 = !DILocalVariable(name: "offset", scope: !339, file: !3, line: 1596, type: !16)
!365 = !DILocation(line: 0, scope: !339)
!366 = !DILocation(line: 1599, column: 21, scope: !367)
!367 = distinct !DILexicalBlock(scope: !339, file: !3, line: 1599, column: 9)
!368 = !DILocation(line: 1599, column: 9, scope: !339)
!369 = !DILocation(line: 1603, column: 24, scope: !339)
!370 = !DILocation(line: 1603, column: 5, scope: !339)
!371 = !DILocation(line: 1606, column: 19, scope: !372)
!372 = distinct !DILexicalBlock(scope: !339, file: !3, line: 1604, column: 9)
!373 = !DILocation(line: 1609, column: 47, scope: !374)
!374 = distinct !DILexicalBlock(scope: !372, file: !3, line: 1609, column: 21)
!375 = !DILocation(line: 1609, column: 22, scope: !374)
!376 = !DILocation(line: 1610, column: 11, scope: !377)
!377 = distinct !DILexicalBlock(scope: !372, file: !3, line: 1610, column: 7)
!378 = !DILocation(line: 1610, column: 19, scope: !377)
!379 = !DILocation(line: 1610, column: 7, scope: !372)
!380 = !DILocation(line: 1612, column: 29, scope: !381)
!381 = distinct !DILexicalBlock(scope: !382, file: !3, line: 1612, column: 25)
!382 = distinct !DILexicalBlock(scope: !377, file: !3, line: 1611, column: 3)
!383 = !DILocation(line: 1612, column: 25, scope: !381)
!384 = !DILocation(line: 1612, column: 25, scope: !382)
!385 = !DILocation(line: 1614, column: 40, scope: !386)
!386 = distinct !DILexicalBlock(scope: !387, file: !3, line: 1614, column: 33)
!387 = distinct !DILexicalBlock(scope: !381, file: !3, line: 1613, column: 25)
!388 = !DILocation(line: 1614, column: 37, scope: !386)
!389 = !DILocation(line: 1614, column: 33, scope: !387)
!390 = !DILocation(line: 1617, column: 50, scope: !391)
!391 = distinct !DILexicalBlock(scope: !386, file: !3, line: 1615, column: 33)
!392 = !DILocation(line: 1617, column: 45, scope: !391)
!393 = !DILocation(line: 1618, column: 49, scope: !394)
!394 = distinct !DILexicalBlock(scope: !391, file: !3, line: 1618, column: 41)
!395 = !DILocation(line: 1618, column: 41, scope: !391)
!396 = !DILocation(line: 0, scope: !397)
!397 = distinct !DILexicalBlock(scope: !398, file: !3, line: 1625, column: 37)
!398 = distinct !DILexicalBlock(scope: !386, file: !3, line: 1623, column: 33)
!399 = !DILocation(line: 1625, column: 69, scope: !400)
!400 = distinct !DILexicalBlock(scope: !397, file: !3, line: 1625, column: 37)
!401 = !DILocation(line: 1625, column: 37, scope: !397)
!402 = distinct !{!402, !401, !403, !290, !291}
!403 = !DILocation(line: 1626, column: 65, scope: !397)
!404 = !DILocation(line: 1628, column: 46, scope: !405)
!405 = distinct !DILexicalBlock(scope: !398, file: !3, line: 1628, column: 41)
!406 = !DILocation(line: 1628, column: 41, scope: !398)
!407 = !DILocation(line: 1629, column: 49, scope: !405)
!408 = !DILocation(line: 1629, column: 41, scope: !405)
!409 = !DILocation(line: 1631, column: 47, scope: !405)
!410 = !DILocation(line: 1631, column: 52, scope: !405)
!411 = !DILocation(line: 1633, column: 48, scope: !398)
!412 = !DILocation(line: 0, scope: !386)
!413 = !DILocation(line: 1637, column: 22, scope: !414)
!414 = distinct !DILexicalBlock(scope: !382, file: !3, line: 1637, column: 21)
!415 = !DILocation(line: 1638, column: 21, scope: !382)
!416 = !DILocation(line: 1641, column: 4, scope: !417)
!417 = distinct !DILexicalBlock(scope: !372, file: !3, line: 1641, column: 3)
!418 = !DILocation(line: 1644, column: 24, scope: !372)
!419 = !DILocation(line: 1647, column: 28, scope: !372)
!420 = !DILocation(line: 1647, column: 22, scope: !372)
!421 = !DILocation(line: 1648, column: 20, scope: !372)
!422 = !DILocation(line: 1650, column: 17, scope: !372)
!423 = !DILocation(line: 1651, column: 21, scope: !424)
!424 = distinct !DILexicalBlock(scope: !372, file: !3, line: 1651, column: 17)
!425 = !DILocation(line: 0, scope: !424)
!426 = !DILocation(line: 1651, column: 17, scope: !372)
!427 = !DILocation(line: 1652, column: 21, scope: !424)
!428 = !DILocation(line: 1652, column: 17, scope: !424)
!429 = !DILocation(line: 1653, column: 26, scope: !430)
!430 = distinct !DILexicalBlock(scope: !424, file: !3, line: 1653, column: 22)
!431 = !DILocation(line: 1653, column: 22, scope: !424)
!432 = !DILocation(line: 0, scope: !372)
!433 = distinct !{!433, !370, !434, !290, !291}
!434 = !DILocation(line: 1655, column: 9, scope: !339)
!435 = !DILocation(line: 1657, column: 5, scope: !339)
!436 = !DISubprogram(name: "process_model", scope: !3, file: !3, line: 535, type: !437, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !34, !16, !16}
!439 = !{}
!440 = !DISubprogram(name: "define_patch", scope: !3, file: !3, line: 447, type: !441, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !62, !62, !16}
!443 = !DISubprogram(name: "ff_refine_elements", scope: !3, file: !3, line: 1072, type: !444, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !159, !159, !16, !16}
!446 = !DISubprogram(name: "process_rays", scope: !3, file: !3, line: 1078, type: !447, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !159, !16}
!449 = !DISubprogram(name: "visibility_task", scope: !3, file: !3, line: 1169, type: !450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !159, !201, !16, !205, !16}
!452 = !DISubprogram(name: "radiosity_averaging", scope: !3, file: !3, line: 1046, type: !453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !159, !16, !16}
!455 = distinct !DISubprogram(name: "free_task", scope: !3, file: !3, line: 1794, type: !456, scopeLine: 1795, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !18, !16}
!458 = !{!459, !460, !461, !462, !463, !464}
!459 = !DILocalVariable(name: "task", arg: 1, scope: !455, file: !3, line: 1794, type: !18)
!460 = !DILocalVariable(name: "process_id", arg: 2, scope: !455, file: !3, line: 1794, type: !16)
!461 = !DILocalVariable(name: "tq", scope: !455, file: !3, line: 1796, type: !347)
!462 = !DILocalVariable(name: "p", scope: !455, file: !3, line: 1797, type: !18)
!463 = !DILocalVariable(name: "top", scope: !455, file: !3, line: 1797, type: !18)
!464 = !DILocalVariable(name: "i", scope: !455, file: !3, line: 1798, type: !16)
!465 = !DILocation(line: 0, scope: !455)
!466 = !DILocation(line: 1801, column: 42, scope: !455)
!467 = !DILocation(line: 1801, column: 11, scope: !455)
!468 = !DILocation(line: 1801, column: 16, scope: !455)
!469 = !DILocation(line: 1802, column: 45, scope: !455)
!470 = !DILocation(line: 1803, column: 29, scope: !455)
!471 = !DILocation(line: 1803, column: 46, scope: !455)
!472 = !DILocation(line: 1806, column: 51, scope: !473)
!473 = distinct !DILexicalBlock(scope: !455, file: !3, line: 1806, column: 9)
!474 = !DILocation(line: 1806, column: 9, scope: !455)
!475 = !DILocation(line: 1808, column: 19, scope: !476)
!476 = distinct !DILexicalBlock(scope: !473, file: !3, line: 1807, column: 9)
!477 = !DILocation(line: 1808, column: 39, scope: !476)
!478 = !DILocation(line: 1810, column: 13, scope: !479)
!479 = distinct !DILexicalBlock(scope: !476, file: !3, line: 1810, column: 13)
!480 = !DILocation(line: 1811, column: 48, scope: !481)
!481 = distinct !DILexicalBlock(scope: !479, file: !3, line: 1810, column: 13)
!482 = !DILocation(line: 1811, column: 59, scope: !481)
!483 = !DILocation(line: 0, scope: !479)
!484 = !DILocation(line: 1811, column: 19, scope: !481)
!485 = distinct !{!485, !478, !486, !290, !291}
!486 = !DILocation(line: 1811, column: 66, scope: !479)
!487 = !DILocation(line: 1815, column: 58, scope: !476)
!488 = !DILocation(line: 1815, column: 53, scope: !476)
!489 = !DILocation(line: 1816, column: 55, scope: !476)
!490 = !DILocation(line: 1819, column: 39, scope: !491)
!491 = distinct !DILexicalBlock(scope: !476, file: !3, line: 1819, column: 13)
!492 = !DILocation(line: 1819, column: 14, scope: !491)
!493 = !DILocation(line: 1820, column: 27, scope: !476)
!494 = !DILocation(line: 1820, column: 21, scope: !476)
!495 = !DILocation(line: 1821, column: 22, scope: !476)
!496 = !DILocation(line: 1822, column: 17, scope: !476)
!497 = !DILocation(line: 1822, column: 24, scope: !476)
!498 = !DILocation(line: 1823, column: 14, scope: !499)
!499 = distinct !DILexicalBlock(scope: !476, file: !3, line: 1823, column: 13)
!500 = !DILocation(line: 1824, column: 9, scope: !476)
!501 = !DILocation(line: 1825, column: 1, scope: !455)
!502 = !DISubprogram(name: "pthread_mutex_lock", scope: !503, file: !503, line: 738, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!503 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!504 = !DISubroutineType(types: !505)
!505 = !{!89, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!507 = !DISubprogram(name: "pthread_mutex_unlock", scope: !503, file: !503, line: 756, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!508 = distinct !DISubprogram(name: "_process_task_wait_loop", scope: !3, file: !3, line: 1299, type: !509, scopeLine: 1300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !511)
!509 = !DISubroutineType(types: !510)
!510 = !{!16}
!511 = !{!512, !513}
!512 = !DILocalVariable(name: "i", scope: !508, file: !3, line: 1301, type: !16)
!513 = !DILocalVariable(name: "finished", scope: !508, file: !3, line: 1302, type: !16)
!514 = !DILocation(line: 0, scope: !508)
!515 = !DILocation(line: 1305, column: 27, scope: !516)
!516 = distinct !DILexicalBlock(scope: !517, file: !3, line: 1305, column: 5)
!517 = distinct !DILexicalBlock(scope: !508, file: !3, line: 1305, column: 5)
!518 = !DILocation(line: 1307, column: 17, scope: !519)
!519 = distinct !DILexicalBlock(scope: !520, file: !3, line: 1307, column: 13)
!520 = distinct !DILexicalBlock(scope: !516, file: !3, line: 1306, column: 9)
!521 = !DILocation(line: 1307, column: 25, scope: !519)
!522 = !DILocation(line: 1307, column: 13, scope: !520)
!523 = !DILocation(line: 1308, column: 26, scope: !524)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 1308, column: 4)
!525 = distinct !DILexicalBlock(scope: !519, file: !3, line: 1307, column: 32)
!526 = !DILocation(line: 1308, column: 34, scope: !524)
!527 = !DILocation(line: 1308, column: 5, scope: !524)
!528 = !DILocation(line: 1309, column: 16, scope: !529)
!529 = distinct !DILexicalBlock(scope: !525, file: !3, line: 1309, column: 16)
!530 = !DILocation(line: 1309, column: 24, scope: !529)
!531 = !DILocation(line: 1309, column: 38, scope: !529)
!532 = !DILocation(line: 1309, column: 35, scope: !529)
!533 = !DILocation(line: 1309, column: 16, scope: !525)
!534 = !DILocation(line: 1311, column: 36, scope: !535)
!535 = distinct !DILexicalBlock(scope: !525, file: !3, line: 1311, column: 4)
!536 = !DILocation(line: 1311, column: 5, scope: !535)
!537 = !DILocation(line: 1312, column: 9, scope: !525)
!538 = !DILocation(line: 1305, column: 44, scope: !516)
!539 = !DILocation(line: 1305, column: 20, scope: !516)
!540 = distinct !{!540, !541, !542, !290, !291}
!541 = !DILocation(line: 1305, column: 5, scope: !517)
!542 = !DILocation(line: 1313, column: 9, scope: !517)
!543 = !DILocation(line: 1315, column: 5, scope: !508)
!544 = distinct !DISubprogram(name: "peek_dequeue", scope: !3, file: !3, line: 1660, type: !545, scopeLine: 1665, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !547)
!545 = !DISubroutineType(types: !546)
!546 = !{!89, !16, !16, !16}
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556}
!548 = !DILocalVariable(name: "qid", arg: 1, scope: !544, file: !3, line: 1660, type: !16)
!549 = !DILocalVariable(name: "max_visit", arg: 2, scope: !544, file: !3, line: 1660, type: !16)
!550 = !DILocalVariable(name: "process_id", arg: 3, scope: !544, file: !3, line: 1660, type: !16)
!551 = !DILocalVariable(name: "tq", scope: !544, file: !3, line: 1666, type: !347)
!552 = !DILocalVariable(name: "task_found", scope: !544, file: !3, line: 1667, type: !89)
!553 = !DILocalVariable(name: "prev", scope: !544, file: !3, line: 1668, type: !18)
!554 = !DILocalVariable(name: "visit_count", scope: !544, file: !3, line: 1669, type: !16)
!555 = !DILocalVariable(name: "sign", scope: !544, file: !3, line: 1670, type: !16)
!556 = !DILocalVariable(name: "offset", scope: !544, file: !3, line: 1671, type: !16)
!557 = !DILocation(line: 0, scope: !544)
!558 = !DILocation(line: 1668, column: 11, scope: !544)
!559 = !DILocation(line: 1674, column: 21, scope: !560)
!560 = distinct !DILexicalBlock(scope: !544, file: !3, line: 1674, column: 9)
!561 = !DILocation(line: 1674, column: 9, scope: !544)
!562 = !DILocation(line: 1678, column: 24, scope: !544)
!563 = !DILocation(line: 1678, column: 5, scope: !544)
!564 = !DILocation(line: 1681, column: 15, scope: !565)
!565 = distinct !DILexicalBlock(scope: !544, file: !3, line: 1679, column: 5)
!566 = !DILocation(line: 1684, column: 35, scope: !567)
!567 = distinct !DILexicalBlock(scope: !565, file: !3, line: 1684, column: 9)
!568 = !DILocation(line: 1684, column: 10, scope: !567)
!569 = !DILocation(line: 1685, column: 11, scope: !570)
!570 = distinct !DILexicalBlock(scope: !565, file: !3, line: 1685, column: 7)
!571 = !DILocation(line: 1685, column: 19, scope: !570)
!572 = !DILocation(line: 1685, column: 7, scope: !565)
!573 = !DILocation(line: 1687, column: 13, scope: !574)
!574 = distinct !DILexicalBlock(scope: !575, file: !3, line: 1687, column: 9)
!575 = distinct !DILexicalBlock(scope: !570, file: !3, line: 1686, column: 3)
!576 = !DILocation(line: 1687, column: 9, scope: !574)
!577 = !DILocation(line: 1687, column: 9, scope: !575)
!578 = !DILocation(line: 1692, column: 5, scope: !579)
!579 = distinct !DILexicalBlock(scope: !575, file: !3, line: 1692, column: 4)
!580 = !DILocation(line: 1693, column: 4, scope: !575)
!581 = !DILocation(line: 1696, column: 4, scope: !582)
!582 = distinct !DILexicalBlock(scope: !565, file: !3, line: 1696, column: 3)
!583 = !DILocation(line: 1699, column: 20, scope: !565)
!584 = !DILocation(line: 1702, column: 24, scope: !565)
!585 = !DILocation(line: 1702, column: 18, scope: !565)
!586 = !DILocation(line: 1703, column: 16, scope: !565)
!587 = !DILocation(line: 1705, column: 13, scope: !565)
!588 = !DILocation(line: 1706, column: 17, scope: !589)
!589 = distinct !DILexicalBlock(scope: !565, file: !3, line: 1706, column: 13)
!590 = !DILocation(line: 0, scope: !589)
!591 = !DILocation(line: 1706, column: 13, scope: !565)
!592 = !DILocation(line: 1707, column: 17, scope: !589)
!593 = !DILocation(line: 1707, column: 13, scope: !589)
!594 = !DILocation(line: 1708, column: 22, scope: !595)
!595 = distinct !DILexicalBlock(scope: !589, file: !3, line: 1708, column: 18)
!596 = !DILocation(line: 1708, column: 18, scope: !589)
!597 = !DILocation(line: 0, scope: !565)
!598 = distinct !{!598, !563, !599, !290, !291}
!599 = !DILocation(line: 1710, column: 5, scope: !544)
!600 = !DILocation(line: 1712, column: 5, scope: !544)
!601 = !DISubprogram(name: "pthread_cond_broadcast", scope: !503, file: !503, line: 978, type: !602, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!602 = !DISubroutineType(types: !603)
!603 = !{!89, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !81, line: 80, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !81, line: 75, size: 384, elements: !607)
!607 = !{!608, !638, !642}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !606, file: !81, line: 77, baseType: !609, size: 384)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !100, line: 92, size: 384, elements: !610)
!610 = !{!611, !621, !630, !634, !635, !636, !637}
!611 = !DIDerivedType(tag: DW_TAG_member, scope: !609, file: !100, line: 94, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !609, file: !100, line: 94, size: 64, elements: !613)
!613 = !{!614, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !612, file: !100, line: 96, baseType: !615, size: 64)
!615 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !612, file: !100, line: 101, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !612, file: !100, line: 97, size: 64, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !617, file: !100, line: 99, baseType: !91, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !617, file: !100, line: 100, baseType: !91, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, scope: !609, file: !100, line: 103, baseType: !622, size: 64, offset: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !609, file: !100, line: 103, size: 64, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !622, file: !100, line: 105, baseType: !615, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !622, file: !100, line: 110, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !622, file: !100, line: 106, size: 64, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !626, file: !100, line: 108, baseType: !91, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !626, file: !100, line: 109, baseType: !91, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !609, file: !100, line: 112, baseType: !631, size: 64, offset: 128)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 64, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 2)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !609, file: !100, line: 113, baseType: !631, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !609, file: !100, line: 114, baseType: !91, size: 32, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !609, file: !100, line: 115, baseType: !91, size: 32, offset: 288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !609, file: !100, line: 116, baseType: !631, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !606, file: !81, line: 78, baseType: !639, size: 384)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 384, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 48)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !606, file: !81, line: 79, baseType: !643, size: 64)
!643 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!644 = !DISubprogram(name: "pthread_cond_wait", scope: !503, file: !503, line: 986, type: !645, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !439)
!645 = !DISubroutineType(types: !646)
!646 = !{!89, !647, !648}
!647 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !604)
!648 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !506)
!649 = distinct !DISubprogram(name: "create_modeling_task", scope: !3, file: !3, line: 1332, type: !437, scopeLine: 1333, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !650)
!650 = !{!651, !652, !653}
!651 = !DILocalVariable(name: "model", arg: 1, scope: !649, file: !3, line: 1332, type: !34)
!652 = !DILocalVariable(name: "type", arg: 2, scope: !649, file: !3, line: 1332, type: !16)
!653 = !DILocalVariable(name: "process_id", arg: 3, scope: !649, file: !3, line: 1332, type: !16)
!654 = !DILocation(line: 0, scope: !649)
!655 = !DILocation(line: 1337, column: 5, scope: !649)
!656 = !DILocation(line: 1338, column: 5, scope: !649)
!657 = distinct !DISubprogram(name: "create_bsp_task", scope: !3, file: !3, line: 1342, type: !441, scopeLine: 1343, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !658)
!658 = !{!659, !660, !661}
!659 = !DILocalVariable(name: "patch", arg: 1, scope: !657, file: !3, line: 1342, type: !62)
!660 = !DILocalVariable(name: "parent", arg: 2, scope: !657, file: !3, line: 1342, type: !62)
!661 = !DILocalVariable(name: "process_id", arg: 3, scope: !657, file: !3, line: 1342, type: !16)
!662 = !DILocation(line: 0, scope: !657)
!663 = !DILocation(line: 1345, column: 5, scope: !657)
!664 = !DILocation(line: 1346, column: 5, scope: !657)
!665 = distinct !DISubprogram(name: "create_ff_refine_task", scope: !3, file: !3, line: 1351, type: !444, scopeLine: 1352, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !666)
!666 = !{!667, !668, !669, !670, !671}
!667 = !DILocalVariable(name: "e1", arg: 1, scope: !665, file: !3, line: 1351, type: !159)
!668 = !DILocalVariable(name: "e2", arg: 2, scope: !665, file: !3, line: 1351, type: !159)
!669 = !DILocalVariable(name: "level", arg: 3, scope: !665, file: !3, line: 1351, type: !16)
!670 = !DILocalVariable(name: "process_id", arg: 4, scope: !665, file: !3, line: 1351, type: !16)
!671 = !DILocalVariable(name: "t", scope: !665, file: !3, line: 1353, type: !18)
!672 = !DILocation(line: 0, scope: !665)
!673 = !DILocation(line: 1356, column: 25, scope: !674)
!674 = distinct !DILexicalBlock(scope: !665, file: !3, line: 1356, column: 9)
!675 = !DILocation(line: 1356, column: 45, scope: !674)
!676 = !DILocation(line: 1356, column: 73, scope: !674)
!677 = !DILocation(line: 1356, column: 9, scope: !674)
!678 = !DILocation(line: 1356, column: 9, scope: !665)
!679 = !DILocation(line: 1359, column: 13, scope: !680)
!680 = distinct !DILexicalBlock(scope: !674, file: !3, line: 1357, column: 9)
!681 = !DILocation(line: 1360, column: 13, scope: !680)
!682 = !DILocation(line: 1364, column: 9, scope: !665)
!683 = !DILocation(line: 1365, column: 18, scope: !665)
!684 = !DILocation(line: 1366, column: 8, scope: !665)
!685 = !DILocation(line: 1366, column: 33, scope: !665)
!686 = !DILocation(line: 1367, column: 17, scope: !665)
