; ModuleID = 'tri.c'
source_filename = "tri.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.object = type { i64, [32 x i8], %struct.bbox, ptr, i64, ptr, ptr, ptr }
%struct.bbox = type { [3 x double], [3 x double] }
%struct.element = type { i64, ptr, ptr, %struct.bbox }
%struct.tri = type { [3 x double], double, ptr, ptr, [3 x i64], i64, i64, i64 }
%struct.irecord = type { double, ptr, double, double, double }
%struct.ray = type { i64, i64, i64, [3 x double], [3 x double], i64, ptr, i64, [3 x i64], [5 x %struct.rayinfo], float, float }
%struct.rayinfo = type { ptr, [3 x double], i64, double, i64, double, [3 x double], [3 x i64], i64, [3 x i64], ptr }

@.str = private unnamed_addr constant [5 x i8] c"poly\00", align 1
@stderr = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [27 x i8] c"\09triangle: %ld triangles.\0A\00", align 1
@.str.2 = private unnamed_addr constant [39 x i8] c"\09\09Vertices: 3   Plane eq: %f %f %f %f\0A\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"\09\09%f %f %f \0A\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%ld\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"tri.c\00", align 1
@.str.7 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.10 = private unnamed_addr constant [12 x i8] c"%lf %lf %lf\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "tri.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "eea632825f418ba2f14690f4baaf4c84")
!2 = !{!3, !28}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRI", file: !5, line: 742, baseType: !6)
!5 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tri", file: !5, line: 731, size: 768, elements: !7)
!7 = !{!8, !15, !16, !18, !19, !23, !24, !27}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !6, file: !5, line: 733, baseType: !9, size: 192)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC3", file: !5, line: 314, baseType: !10)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 192, elements: !13)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "REAL", file: !5, line: 310, baseType: !12)
!12 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!13 = !{!14}
!14 = !DISubrange(count: 3)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !6, file: !5, line: 734, baseType: !11, size: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "vptr", scope: !6, file: !5, line: 735, baseType: !17, size: 64, offset: 256)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nptr", scope: !6, file: !5, line: 736, baseType: !17, size: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !6, file: !5, line: 737, baseType: !20, size: 192, offset: 384)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 192, elements: !13)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !5, line: 297, baseType: !22)
!22 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !6, file: !5, line: 738, baseType: !21, size: 64, offset: 576)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "norminterp", scope: !6, file: !5, line: 739, baseType: !25, size: 64, offset: 640)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !5, line: 299, baseType: !26)
!26 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "vorder", scope: !6, file: !5, line: 740, baseType: !25, size: 64, offset: 704)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !5, line: 287, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!31 = !{i32 7, !"Dwarf Version", i32 5}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{i32 7, !"PIC Level", i32 2}
!35 = !{i32 7, !"PIE Level", i32 2}
!36 = !{i32 7, !"uwtable", i32 2}
!37 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!38 = distinct !DISubprogram(name: "TriName", scope: !1, file: !1, line: 58, type: !39, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !41)
!39 = !DISubroutineType(types: !40)
!40 = !{!28}
!41 = !{}
!42 = !DILocation(line: 60, column: 2, scope: !38)
!43 = distinct !DISubprogram(name: "TriPrint", scope: !1, file: !1, line: 77, type: !44, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !110)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", file: !5, line: 499, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !5, line: 488, size: 1024, elements: !49)
!49 = !{!50, !51, !55, !61, !71, !72, !96, !109}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !48, file: !5, line: 490, baseType: !21, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !5, line: 491, baseType: !52, size: 256, offset: 64)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !48, file: !5, line: 492, baseType: !56, size: 384, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", file: !5, line: 418, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbox", file: !5, line: 413, size: 384, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "dnear", scope: !57, file: !5, line: 415, baseType: !10, size: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "dfar", scope: !57, file: !5, line: 416, baseType: !10, size: 192, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !48, file: !5, line: 493, baseType: !62, size: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT", file: !5, line: 481, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "element", file: !5, line: 474, size: 576, elements: !65)
!65 = !{!66, !67, !69, !70}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !64, file: !5, line: 476, baseType: !21, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !64, file: !5, line: 477, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !64, file: !5, line: 478, baseType: !28, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "bv", scope: !64, file: !5, line: 479, baseType: !56, size: 384, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !48, file: !5, line: 494, baseType: !21, size: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !48, file: !5, line: 495, baseType: !73, size: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROCS", file: !5, line: 340, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pprocs", file: !5, line: 327, size: 640, elements: !76)
!76 = !{!77, !81, !85, !86, !87, !88, !92, !93, !94, !95}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !5, line: 329, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!28, null}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !75, file: !5, line: 330, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, null}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !75, file: !5, line: 331, baseType: !82, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "binread", scope: !75, file: !5, line: 332, baseType: !82, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !75, file: !5, line: 333, baseType: !82, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "intersect", scope: !75, file: !5, line: 334, baseType: !89, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!21, null}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pe_intersect", scope: !75, file: !5, line: 335, baseType: !89, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !75, file: !5, line: 336, baseType: !82, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "normalize", scope: !75, file: !5, line: 337, baseType: !82, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !75, file: !5, line: 338, baseType: !82, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "surf", scope: !48, file: !5, line: 496, baseType: !97, size: 64, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "SURF", file: !5, line: 357, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "surf", file: !5, line: 347, size: 704, elements: !100)
!100 = !{!101, !103, !104, !105, !106, !107, !108}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "fcolor", scope: !99, file: !5, line: 349, baseType: !102, size: 192)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOR", file: !5, line: 319, baseType: !9)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bcolor", scope: !99, file: !5, line: 350, baseType: !102, size: 192, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "kdiff", scope: !99, file: !5, line: 351, baseType: !11, size: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "kspec", scope: !99, file: !5, line: 352, baseType: !11, size: 64, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ktran", scope: !99, file: !5, line: 353, baseType: !11, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "refrindex", scope: !99, file: !5, line: 354, baseType: !11, size: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "kspecn", scope: !99, file: !5, line: 355, baseType: !11, size: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !5, line: 497, baseType: !68, size: 64, offset: 960)
!110 = !{!111, !112, !113, !114, !116, !117, !118, !119}
!111 = !DILocalVariable(name: "po", arg: 1, scope: !43, file: !1, line: 77, type: !46)
!112 = !DILocalVariable(name: "i", scope: !43, file: !1, line: 79, type: !21)
!113 = !DILocalVariable(name: "j", scope: !43, file: !1, line: 79, type: !21)
!114 = !DILocalVariable(name: "vindex", scope: !43, file: !1, line: 80, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!116 = !DILocalVariable(name: "vlist", scope: !43, file: !1, line: 81, type: !17)
!117 = !DILocalVariable(name: "vptr", scope: !43, file: !1, line: 81, type: !17)
!118 = !DILocalVariable(name: "pt", scope: !43, file: !1, line: 82, type: !3)
!119 = !DILocalVariable(name: "pe", scope: !43, file: !1, line: 83, type: !62)
!120 = !DILocation(line: 0, scope: !43)
!121 = !DILocation(line: 85, column: 11, scope: !43)
!122 = !DILocation(line: 86, column: 10, scope: !43)
!123 = !DILocation(line: 86, column: 54, scope: !43)
!124 = !DILocation(line: 86, column: 2, scope: !43)
!125 = !DILocation(line: 88, column: 22, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !1, line: 88, column: 2)
!127 = distinct !DILexicalBlock(scope: !43, file: !1, line: 88, column: 2)
!128 = !DILocation(line: 88, column: 16, scope: !126)
!129 = !DILocation(line: 88, column: 2, scope: !127)
!130 = !DILocation(line: 90, column: 19, scope: !131)
!131 = distinct !DILexicalBlock(scope: !126, file: !1, line: 89, column: 3)
!132 = !DILocation(line: 92, column: 11, scope: !131)
!133 = !DILocation(line: 92, column: 64, scope: !131)
!134 = !DILocation(line: 92, column: 77, scope: !131)
!135 = !DILocation(line: 92, column: 90, scope: !131)
!136 = !DILocation(line: 92, column: 107, scope: !131)
!137 = !DILocation(line: 92, column: 3, scope: !131)
!138 = !DILocation(line: 94, column: 16, scope: !131)
!139 = !DILocation(line: 95, column: 16, scope: !131)
!140 = !DILocation(line: 97, column: 3, scope: !141)
!141 = distinct !DILexicalBlock(scope: !131, file: !1, line: 97, column: 3)
!142 = !DILocation(line: 99, column: 20, scope: !143)
!143 = distinct !DILexicalBlock(scope: !144, file: !1, line: 98, column: 4)
!144 = distinct !DILexicalBlock(scope: !141, file: !1, line: 97, column: 3)
!145 = !DILocation(line: 99, column: 17, scope: !143)
!146 = !DILocation(line: 100, column: 12, scope: !143)
!147 = !DILocation(line: 100, column: 39, scope: !143)
!148 = !DILocation(line: 100, column: 51, scope: !143)
!149 = !DILocation(line: 100, column: 63, scope: !143)
!150 = !DILocation(line: 100, column: 4, scope: !143)
!151 = !DILocation(line: 101, column: 10, scope: !143)
!152 = !DILocation(line: 97, column: 23, scope: !144)
!153 = !DILocation(line: 97, column: 17, scope: !144)
!154 = distinct !{!154, !140, !155, !156, !157}
!155 = !DILocation(line: 102, column: 4, scope: !141)
!156 = !{!"llvm.loop.mustprogress"}
!157 = !{!"llvm.loop.unroll.disable"}
!158 = !DILocation(line: 104, column: 5, scope: !131)
!159 = !DILocation(line: 88, column: 36, scope: !126)
!160 = distinct !{!160, !129, !161, !156, !157}
!161 = !DILocation(line: 105, column: 3, scope: !127)
!162 = !DILocation(line: 106, column: 2, scope: !43)
!163 = distinct !DISubprogram(name: "TriElementBoundBox", scope: !1, file: !1, line: 123, type: !164, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !166)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !62, !3}
!166 = !{!167, !168, !169, !170, !171, !173, !174, !175, !176, !177, !178, !179, !180}
!167 = !DILocalVariable(name: "pe", arg: 1, scope: !163, file: !1, line: 123, type: !62)
!168 = !DILocalVariable(name: "pt", arg: 2, scope: !163, file: !1, line: 123, type: !3)
!169 = !DILocalVariable(name: "i", scope: !163, file: !1, line: 125, type: !21)
!170 = !DILocalVariable(name: "vindex", scope: !163, file: !1, line: 126, type: !115)
!171 = !DILocalVariable(name: "pbb", scope: !163, file: !1, line: 127, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!173 = !DILocalVariable(name: "vlist", scope: !163, file: !1, line: 128, type: !17)
!174 = !DILocalVariable(name: "vptr", scope: !163, file: !1, line: 128, type: !17)
!175 = !DILocalVariable(name: "minx", scope: !163, file: !1, line: 129, type: !11)
!176 = !DILocalVariable(name: "maxx", scope: !163, file: !1, line: 129, type: !11)
!177 = !DILocalVariable(name: "miny", scope: !163, file: !1, line: 130, type: !11)
!178 = !DILocalVariable(name: "maxy", scope: !163, file: !1, line: 130, type: !11)
!179 = !DILocalVariable(name: "minz", scope: !163, file: !1, line: 131, type: !11)
!180 = !DILocalVariable(name: "maxz", scope: !163, file: !1, line: 131, type: !11)
!181 = !DILocation(line: 0, scope: !163)
!182 = !DILocation(line: 138, column: 15, scope: !163)
!183 = !DILocation(line: 139, column: 15, scope: !163)
!184 = !DILocation(line: 141, column: 2, scope: !185)
!185 = distinct !DILexicalBlock(scope: !163, file: !1, line: 141, column: 2)
!186 = !DILocation(line: 143, column: 19, scope: !187)
!187 = distinct !DILexicalBlock(scope: !188, file: !1, line: 142, column: 3)
!188 = distinct !DILexicalBlock(scope: !185, file: !1, line: 141, column: 2)
!189 = !DILocation(line: 143, column: 16, scope: !187)
!190 = !DILocation(line: 145, column: 10, scope: !187)
!191 = !DILocation(line: 146, column: 10, scope: !187)
!192 = !DILocation(line: 147, column: 10, scope: !187)
!193 = !DILocation(line: 149, column: 10, scope: !187)
!194 = !DILocation(line: 150, column: 10, scope: !187)
!195 = !DILocation(line: 151, column: 10, scope: !187)
!196 = !DILocation(line: 153, column: 9, scope: !187)
!197 = !DILocation(line: 141, column: 22, scope: !188)
!198 = !DILocation(line: 141, column: 16, scope: !188)
!199 = distinct !{!199, !184, !200, !156, !157}
!200 = !DILocation(line: 154, column: 3, scope: !185)
!201 = !DILocation(line: 133, column: 14, scope: !163)
!202 = !DILocation(line: 156, column: 16, scope: !163)
!203 = !DILocation(line: 157, column: 2, scope: !163)
!204 = !DILocation(line: 157, column: 16, scope: !163)
!205 = !DILocation(line: 158, column: 2, scope: !163)
!206 = !DILocation(line: 158, column: 16, scope: !163)
!207 = !DILocation(line: 160, column: 7, scope: !163)
!208 = !DILocation(line: 160, column: 16, scope: !163)
!209 = !DILocation(line: 161, column: 2, scope: !163)
!210 = !DILocation(line: 161, column: 16, scope: !163)
!211 = !DILocation(line: 162, column: 2, scope: !163)
!212 = !DILocation(line: 162, column: 16, scope: !163)
!213 = !DILocation(line: 163, column: 2, scope: !163)
!214 = distinct !DISubprogram(name: "TriBoundBox", scope: !1, file: !1, line: 179, type: !44, scopeLine: 180, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!216 = !DILocalVariable(name: "po", arg: 1, scope: !214, file: !1, line: 179, type: !46)
!217 = !DILocalVariable(name: "i", scope: !214, file: !1, line: 181, type: !21)
!218 = !DILocalVariable(name: "pt", scope: !214, file: !1, line: 182, type: !3)
!219 = !DILocalVariable(name: "pe", scope: !214, file: !1, line: 183, type: !62)
!220 = !DILocalVariable(name: "pbb", scope: !214, file: !1, line: 184, type: !172)
!221 = !DILocalVariable(name: "minx", scope: !214, file: !1, line: 185, type: !11)
!222 = !DILocalVariable(name: "maxx", scope: !214, file: !1, line: 185, type: !11)
!223 = !DILocalVariable(name: "miny", scope: !214, file: !1, line: 186, type: !11)
!224 = !DILocalVariable(name: "maxy", scope: !214, file: !1, line: 186, type: !11)
!225 = !DILocalVariable(name: "minz", scope: !214, file: !1, line: 187, type: !11)
!226 = !DILocalVariable(name: "maxz", scope: !214, file: !1, line: 187, type: !11)
!227 = !DILocation(line: 0, scope: !214)
!228 = !DILocation(line: 195, column: 22, scope: !229)
!229 = distinct !DILexicalBlock(scope: !230, file: !1, line: 195, column: 2)
!230 = distinct !DILexicalBlock(scope: !214, file: !1, line: 195, column: 2)
!231 = !DILocation(line: 195, column: 16, scope: !229)
!232 = !DILocation(line: 195, column: 2, scope: !230)
!233 = !DILocation(line: 189, column: 13, scope: !214)
!234 = !DILocation(line: 197, column: 19, scope: !235)
!235 = distinct !DILexicalBlock(scope: !229, file: !1, line: 196, column: 3)
!236 = !DILocation(line: 198, column: 3, scope: !235)
!237 = !DILocation(line: 200, column: 10, scope: !235)
!238 = !DILocation(line: 201, column: 10, scope: !235)
!239 = !DILocation(line: 202, column: 10, scope: !235)
!240 = !DILocation(line: 204, column: 10, scope: !235)
!241 = !DILocation(line: 205, column: 10, scope: !235)
!242 = !DILocation(line: 206, column: 10, scope: !235)
!243 = !DILocation(line: 208, column: 5, scope: !235)
!244 = !DILocation(line: 195, column: 36, scope: !229)
!245 = distinct !{!245, !232, !246, !156, !157}
!246 = !DILocation(line: 209, column: 3, scope: !230)
!247 = !DILocation(line: 190, column: 15, scope: !214)
!248 = !DILocation(line: 211, column: 16, scope: !214)
!249 = !DILocation(line: 212, column: 2, scope: !214)
!250 = !DILocation(line: 212, column: 16, scope: !214)
!251 = !DILocation(line: 213, column: 2, scope: !214)
!252 = !DILocation(line: 213, column: 16, scope: !214)
!253 = !DILocation(line: 215, column: 7, scope: !214)
!254 = !DILocation(line: 215, column: 16, scope: !214)
!255 = !DILocation(line: 216, column: 2, scope: !214)
!256 = !DILocation(line: 216, column: 16, scope: !214)
!257 = !DILocation(line: 217, column: 2, scope: !214)
!258 = !DILocation(line: 217, column: 16, scope: !214)
!259 = !DILocation(line: 218, column: 2, scope: !214)
!260 = distinct !DISubprogram(name: "TriNormal", scope: !1, file: !1, line: 240, type: !261, scopeLine: 241, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !273)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !263, !272, !272}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRECORD", file: !5, line: 514, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "irecord", file: !5, line: 506, size: 320, elements: !266)
!266 = !{!267, !268, !269, !270, !271}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !265, file: !5, line: 508, baseType: !11, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pelem", scope: !265, file: !5, line: 509, baseType: !62, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "b1", scope: !265, file: !5, line: 510, baseType: !11, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "b2", scope: !265, file: !5, line: 511, baseType: !11, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "b3", scope: !265, file: !5, line: 512, baseType: !11, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282}
!274 = !DILocalVariable(name: "hit", arg: 1, scope: !260, file: !1, line: 240, type: !263)
!275 = !DILocalVariable(name: "Pi", arg: 2, scope: !260, file: !1, line: 240, type: !272)
!276 = !DILocalVariable(name: "Ni", arg: 3, scope: !260, file: !1, line: 240, type: !272)
!277 = !DILocalVariable(name: "pe", scope: !260, file: !1, line: 242, type: !62)
!278 = !DILocalVariable(name: "pt", scope: !260, file: !1, line: 243, type: !3)
!279 = !DILocalVariable(name: "pn", scope: !260, file: !1, line: 244, type: !17)
!280 = !DILocalVariable(name: "n0", scope: !260, file: !1, line: 245, type: !17)
!281 = !DILocalVariable(name: "n1", scope: !260, file: !1, line: 245, type: !17)
!282 = !DILocalVariable(name: "n2", scope: !260, file: !1, line: 245, type: !17)
!283 = !DILocation(line: 0, scope: !260)
!284 = !DILocation(line: 249, column: 12, scope: !260)
!285 = !DILocation(line: 250, column: 18, scope: !260)
!286 = !DILocation(line: 251, column: 11, scope: !260)
!287 = !DILocation(line: 253, column: 10, scope: !288)
!288 = distinct !DILexicalBlock(scope: !260, file: !1, line: 253, column: 6)
!289 = !DILocation(line: 253, column: 6, scope: !288)
!290 = !DILocation(line: 253, column: 6, scope: !260)
!291 = !DILocation(line: 255, column: 11, scope: !292)
!292 = distinct !DILexicalBlock(scope: !293, file: !1, line: 255, column: 7)
!293 = distinct !DILexicalBlock(scope: !288, file: !1, line: 254, column: 3)
!294 = !DILocation(line: 255, column: 18, scope: !292)
!295 = !DILocation(line: 255, column: 7, scope: !293)
!296 = !DILocation(line: 258, column: 14, scope: !297)
!297 = distinct !DILexicalBlock(scope: !292, file: !1, line: 256, column: 4)
!298 = !DILocation(line: 259, column: 14, scope: !297)
!299 = !DILocation(line: 260, column: 4, scope: !297)
!300 = !DILocation(line: 264, column: 14, scope: !301)
!301 = distinct !DILexicalBlock(scope: !292, file: !1, line: 262, column: 4)
!302 = !DILocation(line: 265, column: 14, scope: !301)
!303 = !DILocation(line: 0, scope: !292)
!304 = !DILocation(line: 268, column: 15, scope: !293)
!305 = !DILocation(line: 268, column: 3, scope: !293)
!306 = !DILocation(line: 289, column: 16, scope: !293)
!307 = !DILocation(line: 289, column: 37, scope: !293)
!308 = !DILocation(line: 289, column: 58, scope: !293)
!309 = !DILocation(line: 271, column: 16, scope: !310)
!310 = distinct !DILexicalBlock(scope: !293, file: !1, line: 269, column: 4)
!311 = !DILocation(line: 271, column: 10, scope: !310)
!312 = !DILocation(line: 271, column: 13, scope: !310)
!313 = !DILocation(line: 272, column: 16, scope: !310)
!314 = !DILocation(line: 272, column: 10, scope: !310)
!315 = !DILocation(line: 272, column: 13, scope: !310)
!316 = !DILocation(line: 273, column: 16, scope: !310)
!317 = !DILocation(line: 273, column: 10, scope: !310)
!318 = !DILocation(line: 273, column: 13, scope: !310)
!319 = !DILocation(line: 274, column: 5, scope: !310)
!320 = !DILocation(line: 277, column: 16, scope: !310)
!321 = !DILocation(line: 277, column: 10, scope: !310)
!322 = !DILocation(line: 277, column: 13, scope: !310)
!323 = !DILocation(line: 278, column: 16, scope: !310)
!324 = !DILocation(line: 278, column: 10, scope: !310)
!325 = !DILocation(line: 278, column: 13, scope: !310)
!326 = !DILocation(line: 279, column: 16, scope: !310)
!327 = !DILocation(line: 279, column: 10, scope: !310)
!328 = !DILocation(line: 279, column: 13, scope: !310)
!329 = !DILocation(line: 280, column: 5, scope: !310)
!330 = !DILocation(line: 283, column: 16, scope: !310)
!331 = !DILocation(line: 283, column: 10, scope: !310)
!332 = !DILocation(line: 283, column: 13, scope: !310)
!333 = !DILocation(line: 284, column: 16, scope: !310)
!334 = !DILocation(line: 284, column: 10, scope: !310)
!335 = !DILocation(line: 284, column: 13, scope: !310)
!336 = !DILocation(line: 285, column: 16, scope: !310)
!337 = !DILocation(line: 285, column: 10, scope: !310)
!338 = !DILocation(line: 285, column: 13, scope: !310)
!339 = !DILocation(line: 286, column: 5, scope: !310)
!340 = !DILocation(line: 289, column: 21, scope: !293)
!341 = !DILocation(line: 289, column: 42, scope: !293)
!342 = !DILocation(line: 289, column: 40, scope: !293)
!343 = !DILocation(line: 289, column: 30, scope: !293)
!344 = !DILocation(line: 289, column: 63, scope: !293)
!345 = !DILocation(line: 289, column: 51, scope: !293)
!346 = !DILocation(line: 289, column: 9, scope: !293)
!347 = !DILocation(line: 290, column: 16, scope: !293)
!348 = !DILocation(line: 290, column: 21, scope: !293)
!349 = !DILocation(line: 290, column: 37, scope: !293)
!350 = !DILocation(line: 290, column: 42, scope: !293)
!351 = !DILocation(line: 290, column: 40, scope: !293)
!352 = !DILocation(line: 290, column: 30, scope: !293)
!353 = !DILocation(line: 290, column: 58, scope: !293)
!354 = !DILocation(line: 290, column: 63, scope: !293)
!355 = !DILocation(line: 290, column: 51, scope: !293)
!356 = !DILocation(line: 290, column: 3, scope: !293)
!357 = !DILocation(line: 290, column: 9, scope: !293)
!358 = !DILocation(line: 291, column: 16, scope: !293)
!359 = !DILocation(line: 291, column: 21, scope: !293)
!360 = !DILocation(line: 291, column: 37, scope: !293)
!361 = !DILocation(line: 291, column: 42, scope: !293)
!362 = !DILocation(line: 291, column: 40, scope: !293)
!363 = !DILocation(line: 291, column: 30, scope: !293)
!364 = !DILocation(line: 291, column: 58, scope: !293)
!365 = !DILocation(line: 291, column: 63, scope: !293)
!366 = !DILocation(line: 291, column: 51, scope: !293)
!367 = !DILocation(line: 291, column: 3, scope: !293)
!368 = !DILocation(line: 291, column: 9, scope: !293)
!369 = !DILocation(line: 293, column: 3, scope: !293)
!370 = !DILocation(line: 294, column: 3, scope: !293)
!371 = !DILocation(line: 296, column: 3, scope: !372)
!372 = distinct !DILexicalBlock(scope: !288, file: !1, line: 296, column: 3)
!373 = !DILocation(line: 297, column: 2, scope: !260)
!374 = !DISubprogram(name: "VecNorm", scope: !5, file: !5, line: 892, type: !375, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !272}
!377 = distinct !DISubprogram(name: "TriDataNormalize", scope: !1, file: !1, line: 314, type: !378, scopeLine: 315, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !384)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !46, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 4)
!384 = !{!385, !386, !387, !388, !391, !392, !393}
!385 = !DILocalVariable(name: "po", arg: 1, scope: !377, file: !1, line: 314, type: !46)
!386 = !DILocalVariable(name: "normMat", arg: 2, scope: !377, file: !1, line: 314, type: !380)
!387 = !DILocalVariable(name: "i", scope: !377, file: !1, line: 316, type: !21)
!388 = !DILocalVariable(name: "coord", scope: !377, file: !1, line: 317, type: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT", file: !5, line: 318, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC4", file: !5, line: 315, baseType: !381)
!391 = !DILocalVariable(name: "pv", scope: !377, file: !1, line: 318, type: !17)
!392 = !DILocalVariable(name: "pt", scope: !377, file: !1, line: 319, type: !3)
!393 = !DILocalVariable(name: "pe", scope: !377, file: !1, line: 320, type: !62)
!394 = !DILocation(line: 0, scope: !377)
!395 = !DILocation(line: 317, column: 2, scope: !377)
!396 = !DILocation(line: 317, column: 8, scope: !377)
!397 = !DILocation(line: 325, column: 11, scope: !377)
!398 = !DILocation(line: 326, column: 25, scope: !377)
!399 = !DILocation(line: 326, column: 2, scope: !377)
!400 = !DILocation(line: 331, column: 18, scope: !377)
!401 = !DILocation(line: 332, column: 11, scope: !377)
!402 = !DILocation(line: 334, column: 13, scope: !377)
!403 = !DILocation(line: 334, column: 11, scope: !377)
!404 = !DILocation(line: 335, column: 13, scope: !377)
!405 = !DILocation(line: 335, column: 2, scope: !377)
!406 = !DILocation(line: 335, column: 11, scope: !377)
!407 = !DILocation(line: 336, column: 13, scope: !377)
!408 = !DILocation(line: 336, column: 2, scope: !377)
!409 = !DILocation(line: 336, column: 11, scope: !377)
!410 = !DILocation(line: 337, column: 2, scope: !377)
!411 = !DILocation(line: 342, column: 18, scope: !377)
!412 = !DILocation(line: 342, column: 31, scope: !377)
!413 = !DILocation(line: 361, column: 22, scope: !414)
!414 = distinct !DILexicalBlock(scope: !415, file: !1, line: 361, column: 2)
!415 = distinct !DILexicalBlock(scope: !377, file: !1, line: 361, column: 2)
!416 = !DILocation(line: 361, column: 16, scope: !414)
!417 = !DILocation(line: 361, column: 2, scope: !415)
!418 = !DILocation(line: 344, column: 3, scope: !419)
!419 = distinct !DILexicalBlock(scope: !377, file: !1, line: 343, column: 3)
!420 = !DILocation(line: 346, column: 14, scope: !419)
!421 = !DILocation(line: 346, column: 12, scope: !419)
!422 = !DILocation(line: 347, column: 14, scope: !419)
!423 = !DILocation(line: 347, column: 3, scope: !419)
!424 = !DILocation(line: 347, column: 12, scope: !419)
!425 = !DILocation(line: 348, column: 14, scope: !419)
!426 = !DILocation(line: 348, column: 3, scope: !419)
!427 = !DILocation(line: 348, column: 12, scope: !419)
!428 = !DILocation(line: 350, column: 5, scope: !419)
!429 = !DILocation(line: 352, column: 14, scope: !419)
!430 = !DILocation(line: 352, column: 12, scope: !419)
!431 = !DILocation(line: 353, column: 14, scope: !419)
!432 = !DILocation(line: 353, column: 12, scope: !419)
!433 = !DILocation(line: 354, column: 14, scope: !419)
!434 = !DILocation(line: 354, column: 12, scope: !419)
!435 = distinct !{!435, !436, !437, !156, !157}
!436 = !DILocation(line: 342, column: 2, scope: !377)
!437 = !DILocation(line: 356, column: 3, scope: !377)
!438 = !DILocation(line: 363, column: 19, scope: !439)
!439 = distinct !DILexicalBlock(scope: !414, file: !1, line: 362, column: 3)
!440 = !DILocation(line: 364, column: 26, scope: !439)
!441 = !DILocation(line: 364, column: 3, scope: !439)
!442 = !DILocation(line: 368, column: 17, scope: !439)
!443 = !DILocation(line: 368, column: 31, scope: !439)
!444 = !DILocation(line: 368, column: 25, scope: !439)
!445 = !DILocation(line: 368, column: 22, scope: !439)
!446 = !DILocation(line: 369, column: 13, scope: !439)
!447 = !DILocation(line: 369, column: 25, scope: !439)
!448 = !DILocation(line: 369, column: 36, scope: !439)
!449 = !DILocation(line: 369, column: 48, scope: !439)
!450 = !DILocation(line: 369, column: 47, scope: !439)
!451 = !DILocation(line: 369, column: 34, scope: !439)
!452 = !DILocation(line: 369, column: 59, scope: !439)
!453 = !DILocation(line: 369, column: 71, scope: !439)
!454 = !DILocation(line: 369, column: 57, scope: !439)
!455 = !DILocation(line: 369, column: 11, scope: !439)
!456 = !DILocation(line: 369, column: 7, scope: !439)
!457 = !DILocation(line: 369, column: 9, scope: !439)
!458 = !DILocation(line: 371, column: 5, scope: !439)
!459 = !DILocation(line: 361, column: 36, scope: !414)
!460 = distinct !{!460, !417, !461, !156, !157}
!461 = !DILocation(line: 372, column: 3, scope: !415)
!462 = !DILocation(line: 373, column: 2, scope: !377)
!463 = !DISubprogram(name: "NormalizeBoundBox", scope: !5, file: !5, line: 808, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !172, !380}
!466 = !DISubprogram(name: "VecMatMult", scope: !5, file: !5, line: 893, type: !467, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !272, !380, !272}
!469 = distinct !DISubprogram(name: "TriPeIntersect", scope: !1, file: !1, line: 395, type: !470, scopeLine: 396, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !561)
!470 = !DISubroutineType(types: !471)
!471 = !{!21, !472, !62, !263}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", file: !5, line: 625, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ray", file: !5, line: 611, size: 7104, elements: !475)
!475 = !{!476, !478, !479, !480, !481, !482, !483, !551, !552, !553, !557, !560}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !474, file: !5, line: 613, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !5, line: 301, baseType: !22)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !474, file: !5, line: 614, baseType: !21, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !474, file: !5, line: 614, baseType: !21, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !474, file: !5, line: 615, baseType: !9, size: 192, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !474, file: !5, line: 616, baseType: !9, size: 192, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !474, file: !5, line: 617, baseType: !21, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !474, file: !5, line: 618, baseType: !484, size: 64, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAYINFO", file: !5, line: 603, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rayinfo", file: !5, line: 582, size: 1216, elements: !487)
!487 = !{!488, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "grid", scope: !486, file: !5, line: 584, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRID", file: !5, line: 572, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "grid", file: !5, line: 539, size: 1152, elements: !492)
!492 = !{!493, !494, !510, !513, !515, !516, !517, !518, !519, !520, !521, !538}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !491, file: !5, line: 541, baseType: !21, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !491, file: !5, line: 542, baseType: !495, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOXEL", file: !5, line: 405, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "voxel", file: !5, line: 394, size: 320, elements: !499)
!499 = !{!500, !501, !502, !504, !505, !506}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !498, file: !5, line: 396, baseType: !21, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "numelements", scope: !498, file: !5, line: 397, baseType: !21, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !5, line: 398, baseType: !503, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cell", scope: !498, file: !5, line: 399, baseType: !28, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "celltype", scope: !498, file: !5, line: 400, baseType: !29, size: 8, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !498, file: !5, line: 403, baseType: !507, size: 56, offset: 264)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 56, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 7)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "emptycells", scope: !491, file: !5, line: 548, baseType: !511, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !5, line: 298, baseType: !26)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pepa", scope: !491, file: !5, line: 555, baseType: !514, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "num_prims", scope: !491, file: !5, line: 556, baseType: !21, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc", scope: !491, file: !5, line: 558, baseType: !20, size: 192, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !491, file: !5, line: 562, baseType: !21, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !491, file: !5, line: 563, baseType: !10, size: 192, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cellsize", scope: !491, file: !5, line: 564, baseType: !10, size: 192, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv_level", scope: !491, file: !5, line: 566, baseType: !21, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bintree", scope: !491, file: !5, line: 569, baseType: !522, size: 64, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "BTNODE", file: !5, line: 535, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btnode", file: !5, line: 522, size: 960, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !524, file: !5, line: 524, baseType: !514, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !524, file: !5, line: 525, baseType: !10, size: 192, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nprims", scope: !524, file: !5, line: 527, baseType: !21, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !524, file: !5, line: 528, baseType: !20, size: 192, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !524, file: !5, line: 529, baseType: !20, size: 192, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !524, file: !5, line: 531, baseType: !21, size: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "totalPrimsAllocated", scope: !524, file: !5, line: 532, baseType: !21, size: 64, offset: 768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "btn", scope: !524, file: !5, line: 533, baseType: !534, size: 128, offset: 832)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 128, elements: !536)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!536 = !{!537}
!537 = !DISubrange(count: 2)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !491, file: !5, line: 570, baseType: !539, size: 64, offset: 1088)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !486, file: !5, line: 585, baseType: !10, size: 192, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "entry_plane", scope: !486, file: !5, line: 587, baseType: !21, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "t_in", scope: !486, file: !5, line: 589, baseType: !11, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "exit_plane", scope: !486, file: !5, line: 591, baseType: !21, size: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "t_out", scope: !486, file: !5, line: 593, baseType: !11, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !486, file: !5, line: 595, baseType: !10, size: 192, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "index3D", scope: !486, file: !5, line: 596, baseType: !20, size: 192, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "index1D", scope: !486, file: !5, line: 597, baseType: !21, size: 64, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc1D", scope: !486, file: !5, line: 600, baseType: !20, size: 192, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !486, file: !5, line: 601, baseType: !550, size: 64, offset: 1152)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ri_indx", scope: !474, file: !5, line: 619, baseType: !21, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "indx_inc3D", scope: !474, file: !5, line: 620, baseType: !20, size: 192, offset: 768)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rinfo", scope: !474, file: !5, line: 621, baseType: !554, size: 6080, offset: 960)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 6080, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 5)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !474, file: !5, line: 622, baseType: !558, size: 32, offset: 7040)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "R32", file: !5, line: 307, baseType: !559)
!559 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !474, file: !5, line: 623, baseType: !558, size: 32, offset: 7072)
!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!562 = !DILocalVariable(name: "pr", arg: 1, scope: !469, file: !1, line: 395, type: !472)
!563 = !DILocalVariable(name: "pe", arg: 2, scope: !469, file: !1, line: 395, type: !62)
!564 = !DILocalVariable(name: "hit", arg: 3, scope: !469, file: !1, line: 395, type: !263)
!565 = !DILocalVariable(name: "Rd_dot_Pn", scope: !469, file: !1, line: 397, type: !11)
!566 = !DILocalVariable(name: "Ro_dot_Pn", scope: !469, file: !1, line: 398, type: !11)
!567 = !DILocalVariable(name: "q1", scope: !469, file: !1, line: 399, type: !11)
!568 = !DILocalVariable(name: "q2", scope: !469, file: !1, line: 399, type: !11)
!569 = !DILocalVariable(name: "tval", scope: !469, file: !1, line: 400, type: !11)
!570 = !DILocalVariable(name: "v1", scope: !469, file: !1, line: 401, type: !17)
!571 = !DILocalVariable(name: "v2", scope: !469, file: !1, line: 401, type: !17)
!572 = !DILocalVariable(name: "v3", scope: !469, file: !1, line: 401, type: !17)
!573 = !DILocalVariable(name: "e1", scope: !469, file: !1, line: 402, type: !9)
!574 = !DILocalVariable(name: "e2", scope: !469, file: !1, line: 402, type: !9)
!575 = !DILocalVariable(name: "e3", scope: !469, file: !1, line: 402, type: !9)
!576 = !DILocalVariable(name: "pt", scope: !469, file: !1, line: 403, type: !3)
!577 = !DILocation(line: 0, scope: !469)
!578 = !DILocation(line: 406, column: 18, scope: !469)
!579 = !DILocation(line: 408, column: 14, scope: !469)
!580 = !DILocation(line: 410, column: 6, scope: !581)
!581 = distinct !DILexicalBlock(scope: !469, file: !1, line: 410, column: 6)
!582 = !DILocation(line: 410, column: 21, scope: !581)
!583 = !DILocation(line: 410, column: 6, scope: !469)
!584 = !DILocation(line: 413, column: 14, scope: !469)
!585 = !DILocation(line: 415, column: 15, scope: !469)
!586 = !DILocation(line: 415, column: 17, scope: !469)
!587 = !DILocation(line: 415, column: 9, scope: !469)
!588 = !DILocation(line: 415, column: 29, scope: !469)
!589 = !DILocation(line: 416, column: 11, scope: !590)
!590 = distinct !DILexicalBlock(scope: !469, file: !1, line: 416, column: 6)
!591 = !DILocation(line: 416, column: 6, scope: !469)
!592 = !DILocation(line: 425, column: 11, scope: !469)
!593 = !DILocation(line: 425, column: 22, scope: !469)
!594 = !DILocation(line: 425, column: 18, scope: !469)
!595 = !DILocation(line: 425, column: 16, scope: !469)
!596 = !DILocation(line: 427, column: 10, scope: !597)
!597 = distinct !DILexicalBlock(scope: !469, file: !1, line: 427, column: 6)
!598 = !DILocation(line: 427, column: 17, scope: !597)
!599 = !DILocation(line: 427, column: 6, scope: !469)
!600 = !DILocation(line: 429, column: 19, scope: !601)
!601 = distinct !DILexicalBlock(scope: !597, file: !1, line: 428, column: 3)
!602 = !DILocation(line: 430, column: 19, scope: !601)
!603 = !DILocation(line: 431, column: 3, scope: !601)
!604 = !DILocation(line: 434, column: 19, scope: !605)
!605 = distinct !DILexicalBlock(scope: !597, file: !1, line: 433, column: 3)
!606 = !DILocation(line: 435, column: 19, scope: !605)
!607 = !DILocation(line: 0, scope: !597)
!608 = !DILocation(line: 438, column: 10, scope: !469)
!609 = !DILocation(line: 438, column: 21, scope: !469)
!610 = !DILocation(line: 438, column: 19, scope: !469)
!611 = !DILocation(line: 439, column: 10, scope: !469)
!612 = !DILocation(line: 439, column: 21, scope: !469)
!613 = !DILocation(line: 439, column: 19, scope: !469)
!614 = !DILocation(line: 440, column: 10, scope: !469)
!615 = !DILocation(line: 440, column: 21, scope: !469)
!616 = !DILocation(line: 440, column: 19, scope: !469)
!617 = !DILocation(line: 442, column: 10, scope: !469)
!618 = !DILocation(line: 442, column: 19, scope: !469)
!619 = !DILocation(line: 443, column: 10, scope: !469)
!620 = !DILocation(line: 443, column: 19, scope: !469)
!621 = !DILocation(line: 444, column: 10, scope: !469)
!622 = !DILocation(line: 444, column: 19, scope: !469)
!623 = !DILocation(line: 446, column: 19, scope: !469)
!624 = !DILocation(line: 447, column: 19, scope: !469)
!625 = !DILocation(line: 448, column: 19, scope: !469)
!626 = !DILocation(line: 453, column: 14, scope: !469)
!627 = !DILocation(line: 453, column: 2, scope: !469)
!628 = !DILocation(line: 456, column: 18, scope: !629)
!629 = distinct !DILexicalBlock(scope: !469, file: !1, line: 454, column: 3)
!630 = !DILocation(line: 457, column: 18, scope: !629)
!631 = !DILocation(line: 459, column: 26, scope: !629)
!632 = !DILocation(line: 459, column: 52, scope: !629)
!633 = !DILocation(line: 459, column: 38, scope: !629)
!634 = !DILocation(line: 459, column: 9, scope: !629)
!635 = !DILocation(line: 459, column: 12, scope: !629)
!636 = !DILocation(line: 460, column: 9, scope: !637)
!637 = distinct !DILexicalBlock(scope: !629, file: !1, line: 460, column: 8)
!638 = !DILocation(line: 463, column: 28, scope: !629)
!639 = !DILocation(line: 463, column: 26, scope: !629)
!640 = !DILocation(line: 463, column: 54, scope: !629)
!641 = !DILocation(line: 463, column: 52, scope: !629)
!642 = !DILocation(line: 463, column: 38, scope: !629)
!643 = !DILocation(line: 463, column: 9, scope: !629)
!644 = !DILocation(line: 463, column: 12, scope: !629)
!645 = !DILocation(line: 464, column: 9, scope: !646)
!646 = distinct !DILexicalBlock(scope: !629, file: !1, line: 464, column: 8)
!647 = !DILocation(line: 467, column: 28, scope: !629)
!648 = !DILocation(line: 467, column: 26, scope: !629)
!649 = !DILocation(line: 467, column: 54, scope: !629)
!650 = !DILocation(line: 467, column: 52, scope: !629)
!651 = !DILocation(line: 467, column: 38, scope: !629)
!652 = !DILocation(line: 467, column: 9, scope: !629)
!653 = !DILocation(line: 467, column: 12, scope: !629)
!654 = !DILocation(line: 468, column: 9, scope: !655)
!655 = distinct !DILexicalBlock(scope: !629, file: !1, line: 468, column: 8)
!656 = !DILocation(line: 473, column: 18, scope: !629)
!657 = !DILocation(line: 474, column: 18, scope: !629)
!658 = !DILocation(line: 476, column: 26, scope: !629)
!659 = !DILocation(line: 476, column: 52, scope: !629)
!660 = !DILocation(line: 476, column: 38, scope: !629)
!661 = !DILocation(line: 476, column: 9, scope: !629)
!662 = !DILocation(line: 476, column: 12, scope: !629)
!663 = !DILocation(line: 477, column: 9, scope: !664)
!664 = distinct !DILexicalBlock(scope: !629, file: !1, line: 477, column: 8)
!665 = !DILocation(line: 480, column: 28, scope: !629)
!666 = !DILocation(line: 480, column: 26, scope: !629)
!667 = !DILocation(line: 480, column: 54, scope: !629)
!668 = !DILocation(line: 480, column: 52, scope: !629)
!669 = !DILocation(line: 480, column: 38, scope: !629)
!670 = !DILocation(line: 480, column: 9, scope: !629)
!671 = !DILocation(line: 480, column: 12, scope: !629)
!672 = !DILocation(line: 481, column: 9, scope: !673)
!673 = distinct !DILexicalBlock(scope: !629, file: !1, line: 481, column: 8)
!674 = !DILocation(line: 484, column: 28, scope: !629)
!675 = !DILocation(line: 484, column: 26, scope: !629)
!676 = !DILocation(line: 484, column: 54, scope: !629)
!677 = !DILocation(line: 484, column: 52, scope: !629)
!678 = !DILocation(line: 484, column: 38, scope: !629)
!679 = !DILocation(line: 484, column: 9, scope: !629)
!680 = !DILocation(line: 484, column: 12, scope: !629)
!681 = !DILocation(line: 485, column: 9, scope: !682)
!682 = distinct !DILexicalBlock(scope: !629, file: !1, line: 485, column: 8)
!683 = !DILocation(line: 490, column: 18, scope: !629)
!684 = !DILocation(line: 491, column: 18, scope: !629)
!685 = !DILocation(line: 493, column: 26, scope: !629)
!686 = !DILocation(line: 493, column: 52, scope: !629)
!687 = !DILocation(line: 493, column: 38, scope: !629)
!688 = !DILocation(line: 493, column: 9, scope: !629)
!689 = !DILocation(line: 493, column: 12, scope: !629)
!690 = !DILocation(line: 494, column: 9, scope: !691)
!691 = distinct !DILexicalBlock(scope: !629, file: !1, line: 494, column: 8)
!692 = !DILocation(line: 497, column: 28, scope: !629)
!693 = !DILocation(line: 497, column: 26, scope: !629)
!694 = !DILocation(line: 497, column: 54, scope: !629)
!695 = !DILocation(line: 497, column: 52, scope: !629)
!696 = !DILocation(line: 497, column: 38, scope: !629)
!697 = !DILocation(line: 497, column: 9, scope: !629)
!698 = !DILocation(line: 497, column: 12, scope: !629)
!699 = !DILocation(line: 498, column: 9, scope: !700)
!700 = distinct !DILexicalBlock(scope: !629, file: !1, line: 498, column: 8)
!701 = !DILocation(line: 501, column: 28, scope: !629)
!702 = !DILocation(line: 501, column: 26, scope: !629)
!703 = !DILocation(line: 501, column: 54, scope: !629)
!704 = !DILocation(line: 501, column: 52, scope: !629)
!705 = !DILocation(line: 501, column: 38, scope: !629)
!706 = !DILocation(line: 501, column: 9, scope: !629)
!707 = !DILocation(line: 501, column: 12, scope: !629)
!708 = !DILocation(line: 502, column: 9, scope: !709)
!709 = distinct !DILexicalBlock(scope: !629, file: !1, line: 502, column: 8)
!710 = !DILocation(line: 508, column: 2, scope: !711)
!711 = distinct !DILexicalBlock(scope: !469, file: !1, line: 508, column: 2)
!712 = !DILocation(line: 509, column: 2, scope: !469)
!713 = !DILocation(line: 510, column: 2, scope: !469)
!714 = distinct !DISubprogram(name: "TriIntersect", scope: !1, file: !1, line: 528, type: !715, scopeLine: 529, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{!21, !472, !46, !263}
!717 = !{!718, !719, !720, !721, !722, !723, !724}
!718 = !DILocalVariable(name: "pr", arg: 1, scope: !714, file: !1, line: 528, type: !472)
!719 = !DILocalVariable(name: "po", arg: 2, scope: !714, file: !1, line: 528, type: !46)
!720 = !DILocalVariable(name: "hit", arg: 3, scope: !714, file: !1, line: 528, type: !263)
!721 = !DILocalVariable(name: "i", scope: !714, file: !1, line: 530, type: !21)
!722 = !DILocalVariable(name: "nhits", scope: !714, file: !1, line: 531, type: !21)
!723 = !DILocalVariable(name: "pe", scope: !714, file: !1, line: 532, type: !62)
!724 = !DILocalVariable(name: "newhit", scope: !714, file: !1, line: 533, type: !264)
!725 = !DILocation(line: 0, scope: !714)
!726 = !DILocation(line: 533, column: 2, scope: !714)
!727 = !DILocation(line: 533, column: 10, scope: !714)
!728 = !DILocation(line: 538, column: 12, scope: !714)
!729 = !DILocation(line: 539, column: 11, scope: !714)
!730 = !DILocation(line: 541, column: 22, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !1, line: 541, column: 2)
!732 = distinct !DILexicalBlock(scope: !714, file: !1, line: 541, column: 2)
!733 = !DILocation(line: 541, column: 16, scope: !731)
!734 = !DILocation(line: 541, column: 2, scope: !732)
!735 = !DILocation(line: 543, column: 7, scope: !736)
!736 = distinct !DILexicalBlock(scope: !737, file: !1, line: 543, column: 7)
!737 = distinct !DILexicalBlock(scope: !731, file: !1, line: 542, column: 3)
!738 = !DILocation(line: 543, column: 7, scope: !737)
!739 = !DILocation(line: 545, column: 9, scope: !740)
!740 = distinct !DILexicalBlock(scope: !736, file: !1, line: 544, column: 4)
!741 = !DILocation(line: 546, column: 15, scope: !742)
!742 = distinct !DILexicalBlock(scope: !740, file: !1, line: 546, column: 8)
!743 = !DILocation(line: 546, column: 26, scope: !742)
!744 = !DILocation(line: 546, column: 17, scope: !742)
!745 = !DILocation(line: 546, column: 8, scope: !740)
!746 = !DILocation(line: 547, column: 14, scope: !742)
!747 = !DILocation(line: 547, column: 5, scope: !742)
!748 = !DILocation(line: 550, column: 5, scope: !737)
!749 = !DILocation(line: 541, column: 36, scope: !731)
!750 = distinct !{!750, !734, !751, !156, !157}
!751 = !DILocation(line: 551, column: 3, scope: !732)
!752 = !DILocation(line: 554, column: 2, scope: !714)
!753 = !DILocation(line: 553, column: 2, scope: !714)
!754 = distinct !DISubprogram(name: "TriTransform", scope: !1, file: !1, line: 578, type: !755, scopeLine: 579, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !46, !380, !380}
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!758 = !DILocalVariable(name: "po", arg: 1, scope: !754, file: !1, line: 578, type: !46)
!759 = !DILocalVariable(name: "xtrans", arg: 2, scope: !754, file: !1, line: 578, type: !380)
!760 = !DILocalVariable(name: "xinvT", arg: 3, scope: !754, file: !1, line: 578, type: !380)
!761 = !DILocalVariable(name: "i", scope: !754, file: !1, line: 580, type: !21)
!762 = !DILocalVariable(name: "numelems", scope: !754, file: !1, line: 581, type: !21)
!763 = !DILocalVariable(name: "vindex", scope: !754, file: !1, line: 582, type: !115)
!764 = !DILocalVariable(name: "vptr", scope: !754, file: !1, line: 583, type: !17)
!765 = !DILocalVariable(name: "vp", scope: !754, file: !1, line: 583, type: !17)
!766 = !DILocalVariable(name: "nptr", scope: !754, file: !1, line: 584, type: !17)
!767 = !DILocalVariable(name: "np", scope: !754, file: !1, line: 584, type: !17)
!768 = !DILocalVariable(name: "vp1", scope: !754, file: !1, line: 585, type: !17)
!769 = !DILocalVariable(name: "vp2", scope: !754, file: !1, line: 585, type: !17)
!770 = !DILocalVariable(name: "vp3", scope: !754, file: !1, line: 585, type: !17)
!771 = !DILocalVariable(name: "vec1", scope: !754, file: !1, line: 586, type: !9)
!772 = !DILocalVariable(name: "vec2", scope: !754, file: !1, line: 586, type: !9)
!773 = !DILocalVariable(name: "pnorm", scope: !754, file: !1, line: 587, type: !390)
!774 = !DILocalVariable(name: "norm", scope: !754, file: !1, line: 588, type: !390)
!775 = !DILocalVariable(name: "coord", scope: !754, file: !1, line: 588, type: !390)
!776 = !DILocalVariable(name: "pt", scope: !754, file: !1, line: 589, type: !3)
!777 = !DILocalVariable(name: "pe", scope: !754, file: !1, line: 590, type: !62)
!778 = !DILocation(line: 0, scope: !754)
!779 = !DILocation(line: 587, column: 2, scope: !754)
!780 = !DILocation(line: 587, column: 7, scope: !754)
!781 = !DILocation(line: 588, column: 2, scope: !754)
!782 = !DILocation(line: 588, column: 7, scope: !754)
!783 = !DILocation(line: 588, column: 13, scope: !754)
!784 = !DILocation(line: 593, column: 11, scope: !754)
!785 = !DILocation(line: 594, column: 17, scope: !754)
!786 = !DILocation(line: 598, column: 20, scope: !754)
!787 = !DILocation(line: 599, column: 13, scope: !754)
!788 = !DILocation(line: 600, column: 13, scope: !754)
!789 = !DILocation(line: 602, column: 13, scope: !754)
!790 = !DILocation(line: 602, column: 11, scope: !754)
!791 = !DILocation(line: 603, column: 13, scope: !754)
!792 = !DILocation(line: 603, column: 2, scope: !754)
!793 = !DILocation(line: 603, column: 11, scope: !754)
!794 = !DILocation(line: 604, column: 13, scope: !754)
!795 = !DILocation(line: 604, column: 2, scope: !754)
!796 = !DILocation(line: 604, column: 11, scope: !754)
!797 = !DILocation(line: 605, column: 2, scope: !754)
!798 = !DILocation(line: 605, column: 11, scope: !754)
!799 = !DILocation(line: 607, column: 18, scope: !754)
!800 = !DILocation(line: 607, column: 31, scope: !754)
!801 = !DILocation(line: 644, column: 16, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !1, line: 644, column: 2)
!803 = distinct !DILexicalBlock(scope: !754, file: !1, line: 644, column: 2)
!804 = !DILocation(line: 644, column: 2, scope: !803)
!805 = !DILocation(line: 611, column: 3, scope: !806)
!806 = distinct !DILexicalBlock(scope: !754, file: !1, line: 608, column: 3)
!807 = !DILocation(line: 613, column: 16, scope: !806)
!808 = !DILocation(line: 613, column: 14, scope: !806)
!809 = !DILocation(line: 614, column: 16, scope: !806)
!810 = !DILocation(line: 614, column: 3, scope: !806)
!811 = !DILocation(line: 614, column: 14, scope: !806)
!812 = !DILocation(line: 615, column: 16, scope: !806)
!813 = !DILocation(line: 615, column: 3, scope: !806)
!814 = !DILocation(line: 615, column: 14, scope: !806)
!815 = !DILocation(line: 617, column: 7, scope: !806)
!816 = !DILocation(line: 619, column: 14, scope: !806)
!817 = !DILocation(line: 619, column: 12, scope: !806)
!818 = !DILocation(line: 620, column: 14, scope: !806)
!819 = !DILocation(line: 620, column: 12, scope: !806)
!820 = !DILocation(line: 621, column: 14, scope: !806)
!821 = !DILocation(line: 621, column: 12, scope: !806)
!822 = !DILocation(line: 622, column: 12, scope: !806)
!823 = !DILocation(line: 626, column: 13, scope: !806)
!824 = !DILocation(line: 626, column: 11, scope: !806)
!825 = !DILocation(line: 627, column: 13, scope: !806)
!826 = !DILocation(line: 627, column: 11, scope: !806)
!827 = !DILocation(line: 628, column: 13, scope: !806)
!828 = !DILocation(line: 628, column: 11, scope: !806)
!829 = !DILocation(line: 629, column: 11, scope: !806)
!830 = !DILocation(line: 631, column: 3, scope: !806)
!831 = !DILocation(line: 632, column: 3, scope: !806)
!832 = !DILocation(line: 634, column: 16, scope: !806)
!833 = !DILocation(line: 634, column: 14, scope: !806)
!834 = !DILocation(line: 635, column: 16, scope: !806)
!835 = !DILocation(line: 635, column: 14, scope: !806)
!836 = !DILocation(line: 636, column: 16, scope: !806)
!837 = !DILocation(line: 636, column: 14, scope: !806)
!838 = !DILocation(line: 638, column: 7, scope: !806)
!839 = !DILocation(line: 607, column: 9, scope: !754)
!840 = distinct !{!840, !841, !842, !156, !157}
!841 = !DILocation(line: 607, column: 2, scope: !754)
!842 = !DILocation(line: 639, column: 3, scope: !754)
!843 = !DILocation(line: 646, column: 19, scope: !844)
!844 = distinct !DILexicalBlock(scope: !802, file: !1, line: 645, column: 3)
!845 = !DILocation(line: 648, column: 16, scope: !844)
!846 = !DILocation(line: 649, column: 16, scope: !844)
!847 = !DILocation(line: 650, column: 20, scope: !844)
!848 = !DILocation(line: 650, column: 17, scope: !844)
!849 = !DILocation(line: 652, column: 9, scope: !844)
!850 = !DILocation(line: 653, column: 17, scope: !844)
!851 = !DILocation(line: 653, column: 14, scope: !844)
!852 = !DILocation(line: 654, column: 3, scope: !853)
!853 = distinct !DILexicalBlock(scope: !844, file: !1, line: 654, column: 3)
!854 = !DILocation(line: 656, column: 9, scope: !844)
!855 = !DILocation(line: 657, column: 17, scope: !844)
!856 = !DILocation(line: 657, column: 14, scope: !844)
!857 = !DILocation(line: 658, column: 3, scope: !858)
!858 = distinct !DILexicalBlock(scope: !844, file: !1, line: 658, column: 3)
!859 = !DILocation(line: 660, column: 3, scope: !860)
!860 = distinct !DILexicalBlock(scope: !844, file: !1, line: 660, column: 3)
!861 = !DILocation(line: 666, column: 25, scope: !844)
!862 = !DILocation(line: 666, column: 48, scope: !844)
!863 = !DILocation(line: 666, column: 47, scope: !844)
!864 = !DILocation(line: 666, column: 34, scope: !844)
!865 = !DILocation(line: 666, column: 71, scope: !844)
!866 = !DILocation(line: 666, column: 57, scope: !844)
!867 = !DILocation(line: 666, column: 11, scope: !844)
!868 = !DILocation(line: 666, column: 7, scope: !844)
!869 = !DILocation(line: 666, column: 9, scope: !844)
!870 = !DILocation(line: 668, column: 11, scope: !871)
!871 = distinct !DILexicalBlock(scope: !844, file: !1, line: 668, column: 7)
!872 = !DILocation(line: 668, column: 7, scope: !871)
!873 = !DILocation(line: 668, column: 7, scope: !844)
!874 = !DILocation(line: 671, column: 13, scope: !875)
!875 = distinct !DILexicalBlock(scope: !871, file: !1, line: 669, column: 4)
!876 = !DILocation(line: 671, column: 18, scope: !875)
!877 = !DILocation(line: 673, column: 4, scope: !878)
!878 = distinct !DILexicalBlock(scope: !875, file: !1, line: 673, column: 4)
!879 = !DILocation(line: 674, column: 4, scope: !875)
!880 = !DILocation(line: 676, column: 8, scope: !881)
!881 = distinct !DILexicalBlock(scope: !875, file: !1, line: 676, column: 8)
!882 = !DILocation(line: 676, column: 29, scope: !881)
!883 = !DILocation(line: 0, scope: !881)
!884 = !DILocation(line: 676, column: 8, scope: !875)
!885 = !DILocation(line: 677, column: 16, scope: !881)
!886 = !DILocation(line: 689, column: 13, scope: !844)
!887 = !DILocation(line: 677, column: 5, scope: !881)
!888 = !DILocation(line: 680, column: 16, scope: !889)
!889 = distinct !DILexicalBlock(scope: !881, file: !1, line: 679, column: 5)
!890 = !DILocation(line: 681, column: 5, scope: !891)
!891 = distinct !DILexicalBlock(scope: !889, file: !1, line: 681, column: 5)
!892 = !DILocation(line: 682, column: 18, scope: !889)
!893 = !DILocation(line: 682, column: 13, scope: !889)
!894 = !DILocation(line: 682, column: 11, scope: !889)
!895 = !DILocation(line: 689, column: 11, scope: !844)
!896 = !DILocation(line: 690, column: 13, scope: !844)
!897 = !DILocation(line: 690, column: 11, scope: !844)
!898 = !DILocation(line: 691, column: 13, scope: !844)
!899 = !DILocation(line: 691, column: 11, scope: !844)
!900 = !DILocation(line: 693, column: 15, scope: !901)
!901 = distinct !DILexicalBlock(scope: !844, file: !1, line: 693, column: 7)
!902 = !DILocation(line: 693, column: 26, scope: !901)
!903 = !DILocation(line: 694, column: 8, scope: !901)
!904 = !DILocation(line: 694, column: 13, scope: !901)
!905 = !DILocation(line: 694, column: 4, scope: !901)
!906 = !DILocation(line: 696, column: 15, scope: !907)
!907 = distinct !DILexicalBlock(scope: !901, file: !1, line: 696, column: 7)
!908 = !DILocation(line: 696, column: 26, scope: !907)
!909 = !DILocation(line: 0, scope: !907)
!910 = !DILocation(line: 697, column: 13, scope: !907)
!911 = !DILocation(line: 697, column: 4, scope: !907)
!912 = !DILocation(line: 699, column: 13, scope: !907)
!913 = !DILocation(line: 701, column: 5, scope: !844)
!914 = !DILocation(line: 644, column: 29, scope: !802)
!915 = distinct !{!915, !804, !916, !156, !157}
!916 = !DILocation(line: 702, column: 3, scope: !803)
!917 = !DILocation(line: 703, column: 2, scope: !754)
!918 = distinct !DISubprogram(name: "TriRead", scope: !1, file: !1, line: 720, type: !919, scopeLine: 721, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !981)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !46, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !923, line: 7, baseType: !924)
!923 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !925, line: 49, size: 1728, elements: !926)
!925 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!926 = !{!927, !929, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !944, !946, !947, !948, !951, !953, !955, !959, !962, !964, !967, !970, !971, !973, !976, !977}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !924, file: !925, line: 51, baseType: !928, size: 32)
!928 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !924, file: !925, line: 54, baseType: !930, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !924, file: !925, line: 55, baseType: !930, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !924, file: !925, line: 56, baseType: !930, size: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !924, file: !925, line: 57, baseType: !930, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !924, file: !925, line: 58, baseType: !930, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !924, file: !925, line: 59, baseType: !930, size: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !924, file: !925, line: 60, baseType: !930, size: 64, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !924, file: !925, line: 61, baseType: !930, size: 64, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !924, file: !925, line: 64, baseType: !930, size: 64, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !924, file: !925, line: 65, baseType: !930, size: 64, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !924, file: !925, line: 66, baseType: !930, size: 64, offset: 704)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !924, file: !925, line: 68, baseType: !942, size: 64, offset: 768)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !925, line: 36, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !924, file: !925, line: 70, baseType: !945, size: 64, offset: 832)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !924, file: !925, line: 72, baseType: !928, size: 32, offset: 896)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !924, file: !925, line: 73, baseType: !928, size: 32, offset: 928)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !924, file: !925, line: 74, baseType: !949, size: 64, offset: 960)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !950, line: 152, baseType: !22)
!950 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !924, file: !925, line: 77, baseType: !952, size: 16, offset: 1024)
!952 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !924, file: !925, line: 78, baseType: !954, size: 8, offset: 1040)
!954 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !924, file: !925, line: 79, baseType: !956, size: 8, offset: 1048)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 1)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !924, file: !925, line: 81, baseType: !960, size: 64, offset: 1088)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !925, line: 43, baseType: null)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !924, file: !925, line: 89, baseType: !963, size: 64, offset: 1152)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !950, line: 153, baseType: !22)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !924, file: !925, line: 91, baseType: !965, size: 64, offset: 1216)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !925, line: 37, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !924, file: !925, line: 92, baseType: !968, size: 64, offset: 1280)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !925, line: 38, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !924, file: !925, line: 93, baseType: !945, size: 64, offset: 1344)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !924, file: !925, line: 94, baseType: !972, size: 64, offset: 1408)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !924, file: !925, line: 95, baseType: !974, size: 64, offset: 1472)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !975, line: 46, baseType: !26)
!975 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !924, file: !925, line: 96, baseType: !928, size: 32, offset: 1536)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !924, file: !925, line: 98, baseType: !978, size: 160, offset: 1568)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, elements: !979)
!979 = !{!980}
!980 = !DISubrange(count: 20)
!981 = !{!982, !983, !984, !985, !986, !987, !989, !990, !991, !992, !993, !994, !995, !996}
!982 = !DILocalVariable(name: "po", arg: 1, scope: !918, file: !1, line: 720, type: !46)
!983 = !DILocalVariable(name: "pf", arg: 2, scope: !918, file: !1, line: 720, type: !921)
!984 = !DILocalVariable(name: "i", scope: !918, file: !1, line: 722, type: !21)
!985 = !DILocalVariable(name: "instat", scope: !918, file: !1, line: 723, type: !21)
!986 = !DILocalVariable(name: "totalverts", scope: !918, file: !1, line: 724, type: !21)
!987 = !DILocalVariable(name: "normstr", scope: !918, file: !1, line: 725, type: !988)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 40, elements: !555)
!989 = !DILocalVariable(name: "pnormals", scope: !918, file: !1, line: 726, type: !25)
!990 = !DILocalVariable(name: "vnormals", scope: !918, file: !1, line: 727, type: !25)
!991 = !DILocalVariable(name: "vlist", scope: !918, file: !1, line: 728, type: !17)
!992 = !DILocalVariable(name: "vptr", scope: !918, file: !1, line: 728, type: !17)
!993 = !DILocalVariable(name: "nlist", scope: !918, file: !1, line: 729, type: !17)
!994 = !DILocalVariable(name: "nptr", scope: !918, file: !1, line: 729, type: !17)
!995 = !DILocalVariable(name: "pt", scope: !918, file: !1, line: 730, type: !3)
!996 = !DILocalVariable(name: "pe", scope: !918, file: !1, line: 731, type: !62)
!997 = !DILocation(line: 0, scope: !918)
!998 = !DILocation(line: 724, column: 2, scope: !918)
!999 = !DILocation(line: 725, column: 2, scope: !918)
!1000 = !DILocation(line: 725, column: 7, scope: !918)
!1001 = !DILocation(line: 733, column: 11, scope: !918)
!1002 = !DILocation(line: 737, column: 11, scope: !918)
!1003 = !DILocation(line: 739, column: 13, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !918, file: !1, line: 739, column: 6)
!1005 = !DILocation(line: 739, column: 6, scope: !918)
!1006 = !DILocation(line: 741, column: 3, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1004, file: !1, line: 740, column: 3)
!1008 = !DILocation(line: 742, column: 3, scope: !1007)
!1009 = !DILocation(line: 745, column: 40, scope: !918)
!1010 = !DILocation(line: 745, column: 35, scope: !918)
!1011 = !DILocation(line: 745, column: 10, scope: !918)
!1012 = !DILocation(line: 746, column: 37, scope: !918)
!1013 = !DILocation(line: 746, column: 35, scope: !918)
!1014 = !DILocation(line: 746, column: 10, scope: !918)
!1015 = !DILocation(line: 747, column: 36, scope: !918)
!1016 = !DILocation(line: 747, column: 35, scope: !918)
!1017 = !DILocation(line: 747, column: 10, scope: !918)
!1018 = !DILocation(line: 755, column: 11, scope: !918)
!1019 = !DILocation(line: 757, column: 13, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !918, file: !1, line: 757, column: 6)
!1021 = !DILocation(line: 757, column: 6, scope: !918)
!1022 = !DILocation(line: 759, column: 3, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1020, file: !1, line: 758, column: 3)
!1024 = !DILocation(line: 760, column: 3, scope: !1023)
!1025 = !DILocation(line: 763, column: 14, scope: !918)
!1026 = !DILocation(line: 763, column: 25, scope: !918)
!1027 = !DILocation(line: 768, column: 11, scope: !918)
!1028 = !DILocation(line: 769, column: 13, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !918, file: !1, line: 769, column: 6)
!1030 = !DILocation(line: 769, column: 6, scope: !918)
!1031 = !DILocation(line: 771, column: 3, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1029, file: !1, line: 770, column: 3)
!1033 = !DILocation(line: 772, column: 3, scope: !1032)
!1034 = !DILocation(line: 775, column: 14, scope: !918)
!1035 = !DILocation(line: 775, column: 25, scope: !918)
!1036 = !DILocation(line: 780, column: 18, scope: !1037)
