; ModuleID = 'visible.c'
source_filename = "visible.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.v_struct = type { [4096 x i8], ptr, ptr, %struct.Vertex, %struct.Vertex, %struct.Vertex, %struct.Vertex, %struct.Vertex, %struct.Vertex, i64, i64, [16 x %struct.Ray], [16 x %struct.Vertex], i64, [2 x ptr], [4096 x i8] }
%struct.Vertex = type { float, float, float }
%struct.Ray = type { float, float, float }
%struct._patch = type { ptr, ptr, ptr, ptr, ptr, ptr, %struct.Vertex, %struct.Vertex, %struct.Vertex, %struct.PlaneEqu, float, %struct.Rgb, %struct.Rgb, ptr, ptr, ptr, ptr, i64 }
%struct.PlaneEqu = type { %struct.Vertex, float }
%struct.Rgb = type { float, float, float }
%struct._element = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, i64, %struct.Rgb, %struct.Rgb, %struct.Rgb, i64, ptr, ptr, ptr, ptr, ptr, ptr, float }
%struct._interact = type { ptr, ptr, float, float, float, float }

@rand_ray1 = dso_local local_unnamed_addr global [16 x [2 x float]] zeroinitializer, align 16, !dbg !0
@rand_ray2 = dso_local local_unnamed_addr global [16 x [2 x float]] zeroinitializer, align 16, !dbg !15
@vis_struct = dso_local global [1024 x %struct.v_struct] zeroinitializer, align 16, !dbg !21

; Function Attrs: nofree noinline norecurse nosync nounwind writeonly uwtable
define dso_local void @init_visibility_module(i64 noundef %process_id) local_unnamed_addr #0 !dbg !191 {

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rand_ray1", scope: !2, file: !3, line: 1180, type: !17, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !14, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "visible.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "3cb97117406aaa90c6142c6be2d51b41")
!4 = !{!5, !6}
!5 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vertex", file: !8, line: 14, baseType: !9)
!8 = !DIFile(filename: "./glibps/../structs.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/radiosity", checksumkind: CSK_MD5, checksum: "127502bb3b1b1ffc96492ea685802424")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 12, size: 96, elements: !10)
!10 = !{!11, !12, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !9, file: !8, line: 13, baseType: !5, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !9, file: !8, line: 13, baseType: !5, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !9, file: !8, line: 13, baseType: !5, size: 32, offset: 64)
!14 = !{!0, !15, !21}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "rand_ray2", scope: !2, file: !3, line: 1180, type: !17, isLocal: false, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1024, elements: !18)
!18 = !{!19, !20}
!19 = !DISubrange(count: 16)
!20 = !DISubrange(count: 2)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "vis_struct", scope: !2, file: !3, line: 1197, type: !23, isLocal: false, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 71303168, elements: !182)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v_struct", file: !3, line: 1182, size: 69632, elements: !25)
!25 = !{!26, !31, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !175, !177, !178, !181}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !24, file: !3, line: 1183, baseType: !27, size: 32768)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32768, elements: !29)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !{!30}
!30 = !DISubrange(count: 4096)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "v_src_patch", scope: !24, file: !3, line: 1185, baseType: !32, size: 64, offset: 32768)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Patch", file: !3, line: 347, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_patch", file: !3, line: 331, size: 1344, elements: !35)
!35 = !{!36, !88, !89, !90, !101, !102, !103, !104, !105, !106, !112, !113, !114, !115, !117, !118, !119, !156}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !34, file: !3, line: 332, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElemVertex", file: !3, line: 255, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_elemvertex", file: !3, line: 250, size: 320, elements: !40)
!40 = !{!41, !42, !49, !50}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !39, file: !3, line: 251, baseType: !7, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !39, file: !3, line: 252, baseType: !43, size: 96, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "Rgb", file: !8, line: 24, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 22, size: 96, elements: !45)
!45 = !{!46, !47, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !44, file: !8, line: 23, baseType: !5, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !44, file: !8, line: 23, baseType: !5, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !44, file: !8, line: 23, baseType: !5, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !39, file: !3, line: 253, baseType: !5, size: 32, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ev_lock", scope: !39, file: !3, line: 254, baseType: !51, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "Shared_Lock", file: !3, line: 116, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 113, size: 320, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !53, file: !3, line: 115, baseType: !56, size: 320)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !57, line: 72, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!58 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !57, line: 67, size: 320, elements: !59)
!59 = !{!60, !82, !86}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !58, file: !57, line: 69, baseType: !61, size: 320)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !62, line: 22, size: 320, elements: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!63 = !{!64, !66, !68, !69, !70, !71, !73, !74}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !61, file: !62, line: 24, baseType: !65, size: 32)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !61, file: !62, line: 25, baseType: !67, size: 32, offset: 32)
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !61, file: !62, line: 26, baseType: !65, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !61, file: !62, line: 28, baseType: !67, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !61, file: !62, line: 32, baseType: !65, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !61, file: !62, line: 34, baseType: !72, size: 16, offset: 160)
!72 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !61, file: !62, line: 35, baseType: !72, size: 16, offset: 176)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !61, file: !62, line: 36, baseType: !75, size: 128, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !76, line: 53, baseType: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !76, line: 49, size: 128, elements: !78)
!78 = !{!79, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !77, file: !76, line: 51, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !77, file: !76, line: 52, baseType: !80, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !58, file: !57, line: 70, baseType: !83, size: 320)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 320, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 40)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !58, file: !57, line: 71, baseType: !87, size: 64)
!87 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !34, file: !3, line: 332, baseType: !37, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !34, file: !3, line: 332, baseType: !37, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !34, file: !3, line: 333, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "Edge", file: !3, line: 278, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_edge", file: !3, line: 274, size: 320, elements: !94)
!94 = !{!95, !96, !97, !99, !100}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !93, file: !3, line: 275, baseType: !37, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !93, file: !3, line: 275, baseType: !37, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ea", scope: !93, file: !3, line: 276, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "eb", scope: !93, file: !3, line: 276, baseType: !98, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "edge_lock", scope: !93, file: !3, line: 277, baseType: !51, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !34, file: !3, line: 333, baseType: !91, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !34, file: !3, line: 333, baseType: !91, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !34, file: !3, line: 334, baseType: !7, size: 96, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !34, file: !3, line: 334, baseType: !7, size: 96, offset: 480)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "p3", scope: !34, file: !3, line: 334, baseType: !7, size: 96, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "plane_equ", scope: !34, file: !3, line: 335, baseType: !107, size: 128, offset: 672)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PlaneEqu", file: !3, line: 303, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 299, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !108, file: !3, line: 300, baseType: !7, size: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !108, file: !3, line: 301, baseType: !5, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !34, file: !3, line: 336, baseType: !5, size: 32, offset: 800)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !34, file: !3, line: 337, baseType: !43, size: 96, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "emittance", scope: !34, file: !3, line: 339, baseType: !43, size: 96, offset: 928)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_positive", scope: !34, file: !3, line: 341, baseType: !116, size: 64, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_negative", scope: !34, file: !3, line: 342, baseType: !116, size: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_parent", scope: !34, file: !3, line: 343, baseType: !116, size: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "el_root", scope: !34, file: !3, line: 345, baseType: !120, size: 64, offset: 1216)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !3, line: 387, size: 1536, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "elem_lock", scope: !121, file: !3, line: 388, baseType: !51, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !121, file: !3, line: 389, baseType: !32, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !3, line: 391, baseType: !120, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !121, file: !3, line: 392, baseType: !120, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !121, file: !3, line: 393, baseType: !120, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !121, file: !3, line: 394, baseType: !120, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !121, file: !3, line: 395, baseType: !120, size: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "interactions", scope: !121, file: !3, line: 397, baseType: !131, size: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interact", file: !3, line: 433, size: 256, elements: !133)
!133 = !{!134, !135, !138, !139, !140, !141}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !3, line: 434, baseType: !131, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !132, file: !3, line: 435, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "Element", file: !3, line: 412, baseType: !121)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_out", scope: !132, file: !3, line: 436, baseType: !5, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor_err", scope: !132, file: !3, line: 437, baseType: !5, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "area_ratio", scope: !132, file: !3, line: 438, baseType: !5, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !132, file: !3, line: 439, baseType: !5, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "n_interactions", scope: !121, file: !3, line: 398, baseType: !87, size: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vis_undef_inter", scope: !121, file: !3, line: 399, baseType: !131, size: 64, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "n_vis_undef_inter", scope: !121, file: !3, line: 400, baseType: !87, size: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !121, file: !3, line: 402, baseType: !43, size: 96, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rad_in", scope: !121, file: !3, line: 404, baseType: !43, size: 96, offset: 800)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rad_subtree", scope: !121, file: !3, line: 405, baseType: !43, size: 96, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "join_counter", scope: !121, file: !3, line: 407, baseType: !87, size: 64, offset: 1024)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ev1", scope: !121, file: !3, line: 409, baseType: !37, size: 64, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ev2", scope: !121, file: !3, line: 409, baseType: !37, size: 64, offset: 1152)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ev3", scope: !121, file: !3, line: 409, baseType: !37, size: 64, offset: 1216)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "e12", scope: !121, file: !3, line: 410, baseType: !91, size: 64, offset: 1280)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "e23", scope: !121, file: !3, line: 410, baseType: !91, size: 64, offset: 1344)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "e31", scope: !121, file: !3, line: 410, baseType: !91, size: 64, offset: 1408)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !121, file: !3, line: 411, baseType: !5, size: 32, offset: 1472)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "seq_no", scope: !34, file: !3, line: 346, baseType: !87, size: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v_dest_patch", scope: !24, file: !3, line: 1185, baseType: !32, size: 64, offset: 32832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v_src_p1", scope: !24, file: !3, line: 1186, baseType: !7, size: 96, offset: 32896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "v_dest_p1", scope: !24, file: !3, line: 1186, baseType: !7, size: 96, offset: 32992)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "v_src_v12", scope: !24, file: !3, line: 1187, baseType: !7, size: 96, offset: 33088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "v_src_v13", scope: !24, file: !3, line: 1187, baseType: !7, size: 96, offset: 33184)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "v_dest_v12", scope: !24, file: !3, line: 1188, baseType: !7, size: 96, offset: 33280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v_dest_v13", scope: !24, file: !3, line: 1188, baseType: !7, size: 96, offset: 33376)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_nodes_visited", scope: !24, file: !3, line: 1190, baseType: !87, size: 64, offset: 33472)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "total_bsp_nodes_visited", scope: !24, file: !3, line: 1190, baseType: !87, size: 64, offset: 33536)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ray_pool", scope: !24, file: !3, line: 1191, baseType: !167, size: 1536, offset: 33600)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 1536, elements: !174)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ray", file: !8, line: 34, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 32, size: 96, elements: !170)
!170 = !{!171, !172, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !169, file: !8, line: 33, baseType: !5, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !169, file: !8, line: 33, baseType: !5, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !169, file: !8, line: 33, baseType: !5, size: 32, offset: 64)
!174 = !{!19}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "point_pool", scope: !24, file: !3, line: 1192, baseType: !176, size: 1536, offset: 35136)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1536, elements: !174)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pool_dst_hits", scope: !24, file: !3, line: 1193, baseType: !87, size: 64, offset: 36672)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "patch_cache", scope: !24, file: !3, line: 1194, baseType: !179, size: 128, offset: 36736)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !180)
!180 = !{!20}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !24, file: !3, line: 1195, baseType: !27, size: 32768, offset: 36864)
!182 = !{!183}
!183 = !DISubrange(count: 1024)
!184 = !{i32 7, !"Dwarf Version", i32 5}
!185 = !{i32 2, !"Debug Info Version", i32 3}
!186 = !{i32 1, !"wchar_size", i32 4}
!187 = !{i32 7, !"PIC Level", i32 2}
!188 = !{i32 7, !"PIE Level", i32 2}
!189 = !{i32 7, !"uwtable", i32 2}
!190 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!191 = distinct !DISubprogram(name: "init_visibility_module", scope: !3, file: !3, line: 1218, type: !192, scopeLine: 1219, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !194)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !87}
!194 = !{!195}
!195 = !DILocalVariable(name: "process_id", arg: 1, scope: !191, file: !3, line: 1218, type: !87)
!196 = !DILocation(line: 0, scope: !191)
!197 = !DILocation(line: 1223, column: 21, scope: !191)
!198 = !DILocation(line: 1223, column: 52, scope: !191)
!199 = !DILocation(line: 1224, column: 21, scope: !191)
!200 = !DILocation(line: 1224, column: 52, scope: !191)
!201 = !DILocation(line: 1225, column: 21, scope: !191)
!202 = !DILocation(line: 1225, column: 52, scope: !191)
!203 = !DILocation(line: 1226, column: 21, scope: !191)
!204 = !DILocation(line: 1226, column: 52, scope: !191)
!205 = !DILocation(line: 1227, column: 21, scope: !191)
!206 = !DILocation(line: 1227, column: 52, scope: !191)
!207 = !DILocation(line: 1228, column: 21, scope: !191)
!208 = !DILocation(line: 1228, column: 52, scope: !191)
!209 = !DILocation(line: 1231, column: 21, scope: !191)
!210 = !DILocation(line: 1231, column: 52, scope: !191)
!211 = !DILocation(line: 1232, column: 21, scope: !191)
!212 = !DILocation(line: 1232, column: 52, scope: !191)
!213 = !DILocation(line: 1233, column: 21, scope: !191)
!214 = !DILocation(line: 1233, column: 52, scope: !191)
!215 = !DILocation(line: 1234, column: 21, scope: !191)
!216 = !DILocation(line: 1234, column: 52, scope: !191)
!217 = !DILocation(line: 1235, column: 21, scope: !191)
!218 = !DILocation(line: 1235, column: 52, scope: !191)
!219 = !DILocation(line: 1236, column: 21, scope: !191)
!220 = !DILocation(line: 1236, column: 52, scope: !191)
!221 = !DILocation(line: 1239, column: 21, scope: !191)
!222 = !DILocation(line: 1239, column: 52, scope: !191)
!223 = !DILocation(line: 1240, column: 21, scope: !191)
!224 = !DILocation(line: 1240, column: 52, scope: !191)
!225 = !DILocation(line: 1241, column: 21, scope: !191)
!226 = !DILocation(line: 1241, column: 52, scope: !191)
!227 = !DILocation(line: 1242, column: 21, scope: !191)
!228 = !DILocation(line: 1242, column: 52, scope: !191)
!229 = !DILocation(line: 1243, column: 21, scope: !191)
!230 = !DILocation(line: 1243, column: 52, scope: !191)
!231 = !DILocation(line: 1244, column: 21, scope: !191)
!232 = !DILocation(line: 1244, column: 52, scope: !191)
!233 = !DILocation(line: 1247, column: 21, scope: !191)
!234 = !DILocation(line: 1247, column: 52, scope: !191)
!235 = !DILocation(line: 1248, column: 21, scope: !191)
!236 = !DILocation(line: 1248, column: 52, scope: !191)
!237 = !DILocation(line: 1251, column: 22, scope: !191)
!238 = !DILocation(line: 1251, column: 54, scope: !191)
!239 = !DILocation(line: 1252, column: 22, scope: !191)
!240 = !DILocation(line: 1252, column: 54, scope: !191)
!241 = !DILocation(line: 1253, column: 22, scope: !191)
!242 = !DILocation(line: 1253, column: 54, scope: !191)
!243 = !DILocation(line: 1254, column: 22, scope: !191)
!244 = !DILocation(line: 1254, column: 54, scope: !191)
!245 = !DILocation(line: 1255, column: 22, scope: !191)
!246 = !DILocation(line: 1255, column: 54, scope: !191)
!247 = !DILocation(line: 1256, column: 22, scope: !191)
!248 = !DILocation(line: 1256, column: 54, scope: !191)
!249 = !DILocation(line: 1259, column: 22, scope: !191)
!250 = !DILocation(line: 1259, column: 54, scope: !191)
