; ModuleID = 'workpool.c'
source_filename = "workpool.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.display = type { i64, i64, i64, i64, double, i64, i64, i64, double, double, double, double, double, double, double, double, ptr }
%struct.wpjob = type { i64, i64, i64, i64, ptr }
%struct.gmem = type { i64, i64, i64, ptr, ptr, ptr, [4096 x [256 x ptr]], %struct.anon, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, [4096 x %union.pthread_mutex_t], i64, [4096 x i64] }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.rayjob = type { i64, i64, i64, i64, i64, i64 }

@.str = private unnamed_addr constant [11 x i8] c"workpool.c\00", align 1
@gm = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [73 x i8] c"Workpool entry:    pid=%3ld    xs=%3ld    ys=%3ld    xe=%3ld    ye=%3ld\0A\00", align 1
@Display = external local_unnamed_addr global %struct.display, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "workpool.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "76641c369428bd4ffaa2b0965a33c2b0")
!2 = !{i32 7, !"Dwarf Version", i32 5}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{i32 1, !"wchar_size", i32 4}
!5 = !{i32 7, !"PIC Level", i32 2}
!6 = !{i32 7, !"PIE Level", i32 2}
!7 = !{i32 7, !"uwtable", i32 2}
!8 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!9 = distinct !DISubprogram(name: "PutJob", scope: !1, file: !1, line: 79, type: !10, scopeLine: 80, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !15)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12, !12, !12, !12, !12, !12, !12}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT", file: !13, line: 297, baseType: !14)
!13 = !DIFile(filename: "./rt.h", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/apps/raytrace", checksumkind: CSK_MD5, checksum: "79f3f08c304721814d4d4cb3fdd7e4dc")
!14 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!16 = !DILocalVariable(name: "xs", arg: 1, scope: !9, file: !1, line: 79, type: !12)
!17 = !DILocalVariable(name: "ys", arg: 2, scope: !9, file: !1, line: 79, type: !12)
!18 = !DILocalVariable(name: "xe", arg: 3, scope: !9, file: !1, line: 79, type: !12)
!19 = !DILocalVariable(name: "ye", arg: 4, scope: !9, file: !1, line: 79, type: !12)
!20 = !DILocalVariable(name: "xbe", arg: 5, scope: !9, file: !1, line: 79, type: !12)
!21 = !DILocalVariable(name: "ybe", arg: 6, scope: !9, file: !1, line: 79, type: !12)
!22 = !DILocalVariable(name: "pid", arg: 7, scope: !9, file: !1, line: 79, type: !12)
!23 = !DILocalVariable(name: "i", scope: !9, file: !1, line: 81, type: !12)
!24 = !DILocalVariable(name: "j", scope: !9, file: !1, line: 81, type: !12)
!25 = !DILocalVariable(name: "xb_addr", scope: !9, file: !1, line: 82, type: !12)
!26 = !DILocalVariable(name: "yb_addr", scope: !9, file: !1, line: 82, type: !12)
!27 = !DILocalVariable(name: "xb_end", scope: !9, file: !1, line: 83, type: !12)
!28 = !DILocalVariable(name: "yb_end", scope: !9, file: !1, line: 83, type: !12)
!29 = !DILocalVariable(name: "xb_size", scope: !9, file: !1, line: 84, type: !12)
!30 = !DILocalVariable(name: "yb_size", scope: !9, file: !1, line: 84, type: !12)
!31 = !DILocalVariable(name: "wpentry", scope: !9, file: !1, line: 85, type: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "WPJOB", file: !13, line: 653, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wpjob", file: !13, line: 647, size: 320, elements: !35)
!35 = !{!36, !37, !38, !39, !40}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ypix", scope: !34, file: !13, line: 649, baseType: !12, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "xpix", scope: !34, file: !13, line: 649, baseType: !12, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "xdim", scope: !34, file: !13, line: 650, baseType: !12, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ydim", scope: !34, file: !13, line: 650, baseType: !12, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !13, line: 651, baseType: !41, size: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!42 = !DILocation(line: 0, scope: !9)
!43 = !DILocation(line: 94, column: 19, scope: !9)
!44 = !DILocation(line: 95, column: 19, scope: !9)
!45 = !DILocation(line: 97, column: 16, scope: !46)
!46 = distinct !DILexicalBlock(scope: !47, file: !1, line: 97, column: 2)
!47 = distinct !DILexicalBlock(scope: !9, file: !1, line: 97, column: 2)
!48 = !DILocation(line: 97, column: 2, scope: !47)
!49 = !DILocation(line: 99, column: 3, scope: !50)
!50 = distinct !DILexicalBlock(scope: !51, file: !1, line: 99, column: 3)
!51 = distinct !DILexicalBlock(scope: !46, file: !1, line: 98, column: 3)
!52 = !DILocation(line: 103, column: 17, scope: !53)
!53 = distinct !DILexicalBlock(scope: !54, file: !1, line: 103, column: 8)
!54 = distinct !DILexicalBlock(scope: !55, file: !1, line: 100, column: 4)
!55 = distinct !DILexicalBlock(scope: !50, file: !1, line: 99, column: 3)
!56 = !DILocation(line: 103, column: 28, scope: !53)
!57 = !DILocation(line: 103, column: 8, scope: !54)
!58 = !DILocation(line: 116, column: 14, scope: !54)
!59 = !DILocation(line: 118, column: 13, scope: !54)
!60 = !DILocation(line: 118, column: 18, scope: !54)
!61 = !DILocation(line: 119, column: 18, scope: !54)
!62 = !DILocation(line: 120, column: 13, scope: !54)
!63 = !DILocation(line: 120, column: 18, scope: !54)
!64 = !DILocation(line: 121, column: 13, scope: !54)
!65 = !DILocation(line: 121, column: 18, scope: !54)
!66 = !DILocation(line: 126, column: 9, scope: !67)
!67 = distinct !DILexicalBlock(scope: !54, file: !1, line: 126, column: 8)
!68 = !DILocation(line: 127, column: 14, scope: !67)
!69 = !DILocation(line: 127, column: 19, scope: !67)
!70 = !DILocation(line: 131, column: 25, scope: !54)
!71 = !DILocation(line: 99, column: 25, scope: !55)
!72 = !DILocation(line: 99, column: 17, scope: !55)
!73 = distinct !{!73, !49, !74, !75, !76}
!74 = !DILocation(line: 133, column: 4, scope: !50)
!75 = !{!"llvm.loop.mustprogress"}
!76 = !{!"llvm.loop.unroll.disable"}
!77 = !DILocation(line: 97, column: 24, scope: !46)
!78 = distinct !{!78, !48, !79, !75, !76}
!79 = !DILocation(line: 137, column: 3, scope: !47)
!80 = !DILocation(line: 138, column: 2, scope: !9)
!81 = !DISubprogram(name: "GlobalMalloc", scope: !13, file: !13, line: 909, type: !82, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !85, !87}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !13, line: 298, baseType: !86)
!86 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !13, line: 287, baseType: !89)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!90 = !{}
!91 = distinct !DISubprogram(name: "GetJob", scope: !1, file: !1, line: 160, type: !92, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !104)
!92 = !DISubroutineType(types: !93)
!93 = !{!12, !94, !12}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAYJOB", file: !13, line: 639, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rayjob", file: !13, line: 633, size: 384, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !103}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !96, file: !13, line: 635, baseType: !12, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !96, file: !13, line: 635, baseType: !12, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "xlen", scope: !96, file: !13, line: 636, baseType: !12, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ylen", scope: !96, file: !13, line: 636, baseType: !12, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "xcurr", scope: !96, file: !13, line: 637, baseType: !12, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ycurr", scope: !96, file: !13, line: 637, baseType: !12, size: 64, offset: 320)
!104 = !{!105, !106, !107}
!105 = !DILocalVariable(name: "job", arg: 1, scope: !91, file: !1, line: 160, type: !94)
!106 = !DILocalVariable(name: "pid", arg: 2, scope: !91, file: !1, line: 160, type: !12)
!107 = !DILocalVariable(name: "wpentry", scope: !91, file: !1, line: 162, type: !32)
!108 = !DILocation(line: 0, scope: !91)
!109 = !DILocation(line: 164, column: 25, scope: !110)
!110 = distinct !DILexicalBlock(scope: !91, file: !1, line: 164, column: 2)
!111 = !DILocation(line: 164, column: 24, scope: !110)
!112 = !DILocation(line: 164, column: 3, scope: !110)
!113 = !DILocation(line: 165, column: 12, scope: !91)
!114 = !DILocation(line: 167, column: 7, scope: !115)
!115 = distinct !DILexicalBlock(scope: !91, file: !1, line: 167, column: 6)
!116 = !DILocation(line: 167, column: 6, scope: !91)
!117 = !DILocation(line: 169, column: 27, scope: !118)
!118 = distinct !DILexicalBlock(scope: !119, file: !1, line: 169, column: 3)
!119 = distinct !DILexicalBlock(scope: !115, file: !1, line: 168, column: 3)
!120 = !DILocation(line: 169, column: 4, scope: !118)
!121 = !DILocation(line: 170, column: 3, scope: !119)
!122 = !DILocation(line: 173, column: 34, scope: !91)
!123 = !DILocation(line: 173, column: 23, scope: !91)
!124 = !DILocation(line: 174, column: 27, scope: !125)
!125 = distinct !DILexicalBlock(scope: !91, file: !1, line: 174, column: 2)
!126 = !DILocation(line: 174, column: 26, scope: !125)
!127 = !DILocation(line: 174, column: 3, scope: !125)
!128 = !DILocation(line: 178, column: 23, scope: !91)
!129 = !DILocation(line: 178, column: 12, scope: !91)
!130 = !DILocation(line: 179, column: 23, scope: !91)
!131 = !DILocation(line: 179, column: 7, scope: !91)
!132 = !DILocation(line: 179, column: 12, scope: !91)
!133 = !DILocation(line: 180, column: 24, scope: !91)
!134 = !DILocation(line: 180, column: 7, scope: !91)
!135 = !DILocation(line: 180, column: 13, scope: !91)
!136 = !DILocation(line: 181, column: 24, scope: !91)
!137 = !DILocation(line: 181, column: 7, scope: !91)
!138 = !DILocation(line: 181, column: 13, scope: !91)
!139 = !DILocation(line: 182, column: 24, scope: !91)
!140 = !DILocation(line: 182, column: 7, scope: !91)
!141 = !DILocation(line: 182, column: 13, scope: !91)
!142 = !DILocation(line: 183, column: 24, scope: !91)
!143 = !DILocation(line: 183, column: 7, scope: !91)
!144 = !DILocation(line: 183, column: 13, scope: !91)
!145 = !DILocation(line: 185, column: 2, scope: !91)
!146 = !DILocation(line: 186, column: 2, scope: !91)
!147 = !DILocation(line: 187, column: 2, scope: !91)
!148 = !DISubprogram(name: "pthread_mutex_lock", scope: !149, file: !149, line: 738, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!149 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !153}
!152 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !155, line: 72, baseType: !156)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !155, line: 67, size: 320, elements: !157)
!157 = !{!158, !179, !183}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !156, file: !155, line: 69, baseType: !159, size: 320)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !160, line: 22, size: 320, elements: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!161 = !{!162, !163, !165, !166, !167, !168, !170, !171}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !159, file: !160, line: 24, baseType: !152, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !159, file: !160, line: 25, baseType: !164, size: 32, offset: 32)
!164 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !159, file: !160, line: 26, baseType: !152, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !159, file: !160, line: 28, baseType: !164, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !159, file: !160, line: 32, baseType: !152, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !159, file: !160, line: 34, baseType: !169, size: 16, offset: 160)
!169 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !159, file: !160, line: 35, baseType: !169, size: 16, offset: 176)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !159, file: !160, line: 36, baseType: !172, size: 128, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !173, line: 53, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !173, line: 49, size: 128, elements: !175)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !174, file: !173, line: 51, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !174, file: !173, line: 52, baseType: !177, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !156, file: !155, line: 70, baseType: !180, size: 320)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 320, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 40)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !156, file: !155, line: 71, baseType: !14, size: 64)
!184 = !DISubprogram(name: "pthread_mutex_unlock", scope: !149, file: !149, line: 756, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!185 = !DISubprogram(name: "GlobalFree", scope: !13, file: !13, line: 912, type: !186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !84}
!188 = distinct !DISubprogram(name: "GetJobs", scope: !1, file: !1, line: 206, type: !92, scopeLine: 207, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !189)
!189 = !{!190, !191, !192}
!190 = !DILocalVariable(name: "job", arg: 1, scope: !188, file: !1, line: 206, type: !94)
!191 = !DILocalVariable(name: "pid", arg: 2, scope: !188, file: !1, line: 206, type: !12)
!192 = !DILocalVariable(name: "i", scope: !188, file: !1, line: 208, type: !12)
!193 = !DILocation(line: 0, scope: !188)
!194 = !DILocation(line: 214, column: 8, scope: !195)
!195 = distinct !DILexicalBlock(scope: !188, file: !1, line: 214, column: 8)
!196 = !DILocation(line: 214, column: 23, scope: !195)
!197 = !DILocation(line: 214, column: 8, scope: !188)
!198 = !DILocation(line: 225, column: 12, scope: !188)
!199 = !DILocation(line: 225, column: 19, scope: !188)
!200 = !DILocation(line: 225, column: 23, scope: !188)
!201 = !DILocation(line: 225, column: 17, scope: !188)
!202 = !DILocation(line: 227, column: 12, scope: !188)
!203 = !DILocation(line: 227, column: 3, scope: !188)
!204 = !DILocation(line: 229, column: 9, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !1, line: 229, column: 9)
!206 = distinct !DILexicalBlock(scope: !188, file: !1, line: 228, column: 4)
!207 = !DILocation(line: 229, column: 24, scope: !205)
!208 = !DILocation(line: 229, column: 9, scope: !206)
!209 = !DILocation(line: 234, column: 11, scope: !206)
!210 = !DILocation(line: 234, column: 18, scope: !206)
!211 = !DILocation(line: 234, column: 22, scope: !206)
!212 = !DILocation(line: 234, column: 16, scope: !206)
!213 = distinct !{!213, !203, !214, !75, !76}
!214 = !DILocation(line: 235, column: 4, scope: !188)
!215 = !DILocation(line: 238, column: 2, scope: !188)
!216 = distinct !DISubprogram(name: "PrintWorkPool", scope: !1, file: !1, line: 254, type: !217, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !219)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !12}
!219 = !{!220, !221}
!220 = !DILocalVariable(name: "pid", arg: 1, scope: !216, file: !1, line: 254, type: !12)
!221 = !DILocalVariable(name: "j", scope: !216, file: !1, line: 256, type: !32)
!222 = !DILocation(line: 0, scope: !216)
!223 = !DILocation(line: 258, column: 6, scope: !216)
!224 = !DILocation(line: 260, column: 2, scope: !216)
!225 = !DILocation(line: 262, column: 95, scope: !226)
!226 = distinct !DILexicalBlock(scope: !216, file: !1, line: 261, column: 3)
!227 = !DILocation(line: 262, column: 104, scope: !226)
!228 = !DILocation(line: 262, column: 113, scope: !226)
!229 = !DILocation(line: 262, column: 122, scope: !226)
!230 = !DILocation(line: 262, column: 3, scope: !226)
!231 = !DILocation(line: 263, column: 10, scope: !226)
!232 = distinct !{!232, !224, !233, !75, !76}
!233 = !DILocation(line: 264, column: 3, scope: !216)
!234 = !DILocation(line: 265, column: 2, scope: !216)
