; ModuleID = 'scalar_code.ll'
source_filename = "fft.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.GlobalMemory = type { i64, %union.pthread_mutex_t, %struct.anon, ptr, ptr, i64, i64, i64 }
%struct.anon = type { %union.pthread_mutex_t, %union.pthread_cond_t, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.1 = type { i64 }

@__threads__ = dso_local local_unnamed_addr global i32 0, align 4, !dbg !0
@is_output = dso_local local_unnamed_addr global i32 1, align 4, !dbg !104
@P = dso_local local_unnamed_addr global i64 1, align 8, !dbg !106
@M = dso_local local_unnamed_addr global i64 10, align 8, !dbg !108
@test_result = dso_local local_unnamed_addr global i64 0, align 8, !dbg !110
@doprint = dso_local local_unnamed_addr global i64 0, align 8, !dbg !112
@dostats = dso_local local_unnamed_addr global i64 0, align 8, !dbg !114
@transtime = dso_local local_unnamed_addr global i64 0, align 8, !dbg !116
@transtime2 = dso_local local_unnamed_addr global i64 0, align 8, !dbg !118

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__threads__", scope: !2, file: !3, line: 72, type: !22, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !103, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "fft.c", directory: "/home/rouzbeh/Graduate/LLVM/bechmarks/Splash-3/codes/kernels/fft", checksumkind: CSK_MD5, checksum: "290dd06a531fb428d0310d553eb6d260")
!4 = !{!5, !95, !89, !97, !92, !98, !96, !20, !101}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalMemory", file: !3, line: 78, size: 1472, elements: !7)
!7 = !{!8, !10, !43, !88, !90, !91, !93, !94}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !6, file: !3, line: 79, baseType: !9, size: 64)
!9 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "idlock", scope: !6, file: !3, line: 80, baseType: !11, size: 320, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !12, line: 72, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!13 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 67, size: 320, elements: !14)
!14 = !{!15, !37, !42}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !13, file: !12, line: 69, baseType: !16, size: 320)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !17, line: 22, size: 320, elements: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!18 = !{!19, !21, !23, !24, !25, !26, !28, !29}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !16, file: !17, line: 24, baseType: !20, size: 32)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !16, file: !17, line: 25, baseType: !22, size: 32, offset: 32)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !16, file: !17, line: 26, baseType: !20, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !16, file: !17, line: 28, baseType: !22, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !16, file: !17, line: 32, baseType: !20, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !16, file: !17, line: 34, baseType: !27, size: 16, offset: 160)
!27 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !16, file: !17, line: 35, baseType: !27, size: 16, offset: 176)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !16, file: !17, line: 36, baseType: !30, size: 128, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !31, line: 53, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !31, line: 49, size: 128, elements: !33)
!33 = !{!34, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !32, file: !31, line: 51, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !32, file: !31, line: 52, baseType: !35, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !13, file: !12, line: 70, baseType: !38, size: 320)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 320, elements: !40)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !{!41}
!41 = !DISubrange(count: 40)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !13, file: !12, line: 71, baseType: !9, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !6, file: !3, line: 81, baseType: !44, size: 768, offset: 384)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !6, file: !3, line: 81, size: 768, elements: !45)
!45 = !{!46, !47, !87}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "bar_mutex", scope: !44, file: !3, line: 81, baseType: !11, size: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "bar_cond", scope: !44, file: !3, line: 81, baseType: !48, size: 384, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !12, line: 80, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 75, size: 384, elements: !50)
!50 = !{!51, !81, !85}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !49, file: !12, line: 77, baseType: !52, size: 384)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !31, line: 92, size: 384, elements: !53)
!53 = !{!54, !64, !73, !77, !78, !79, !80}
!54 = !DIDerivedType(tag: DW_TAG_member, scope: !52, file: !31, line: 94, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !31, line: 94, size: 64, elements: !56)
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !55, file: !31, line: 96, baseType: !58, size: 64)
!58 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !55, file: !31, line: 101, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !55, file: !31, line: 97, size: 64, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !60, file: !31, line: 99, baseType: !22, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !60, file: !31, line: 100, baseType: !22, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, scope: !52, file: !31, line: 103, baseType: !65, size: 64, offset: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !31, line: 103, size: 64, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !65, file: !31, line: 105, baseType: !58, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !65, file: !31, line: 110, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !65, file: !31, line: 106, size: 64, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !69, file: !31, line: 108, baseType: !22, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !69, file: !31, line: 109, baseType: !22, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !52, file: !31, line: 112, baseType: !74, size: 64, offset: 128)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 2)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !52, file: !31, line: 113, baseType: !74, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !52, file: !31, line: 114, baseType: !22, size: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !52, file: !31, line: 115, baseType: !22, size: 32, offset: 288)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !52, file: !31, line: 116, baseType: !74, size: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !49, file: !12, line: 78, baseType: !82, size: 384)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 384, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 48)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !49, file: !12, line: 79, baseType: !86, size: 64)
!86 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bar_teller", scope: !44, file: !3, line: 81, baseType: !22, size: 32, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "transtimes", scope: !6, file: !3, line: 82, baseType: !89, size: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "totaltimes", scope: !6, file: !3, line: 83, baseType: !89, size: 64, offset: 1216)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !6, file: !3, line: 84, baseType: !92, size: 64, offset: 1280)
!92 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "finishtime", scope: !6, file: !3, line: 85, baseType: !92, size: 64, offset: 1344)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "initdonetime", scope: !6, file: !3, line: 86, baseType: !92, size: 64, offset: 1408)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!97, !97}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!103 = !{!0, !104, !106, !108, !110, !112, !114, !116, !118, !120, !122, !124, !126, !128, !130, !132, !134, !136, !138, !140, !142, !144, !150, !152, !154, !156, !158, !160, !162, !164, !166, !168, !170, !172, !174}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "is_output", scope: !2, file: !3, line: 89, type: !20, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "P", scope: !2, file: !3, line: 90, type: !9, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "M", scope: !2, file: !3, line: 91, type: !9, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "test_result", scope: !2, file: !3, line: 98, type: !9, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "doprint", scope: !2, file: !3, line: 99, type: !9, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "dostats", scope: !2, file: !3, line: 100, type: !9, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "transtime", scope: !2, file: !3, line: 101, type: !9, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "transtime2", scope: !2, file: !3, line: 102, type: !9, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "avgtranstime", scope: !2, file: !3, line: 103, type: !9, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "avgcomptime", scope: !2, file: !3, line: 104, type: !9, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "transstart", scope: !2, file: !3, line: 105, type: !92, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "transend", scope: !2, file: !3, line: 106, type: !92, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "maxtotal", scope: !2, file: !3, line: 107, type: !9, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "mintotal", scope: !2, file: !3, line: 108, type: !9, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "maxfrac", scope: !2, file: !3, line: 109, type: !96, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "minfrac", scope: !2, file: !3, line: 110, type: !96, isLocal: false, isDefinition: true)
