; ModuleID = 'benchmarks/MCF/mcfutil.c.bc.ll'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/mcfutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64 }
%struct.node = type { i64, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i32, i32 }
%struct.arc = type { i32, i64, ptr, ptr, i16, ptr, ptr, i64, i64 }

@.str = private unnamed_addr constant [13 x i8] c"ORG_COST: %f\00", align 1
@.str.1 = private unnamed_addr constant [25 x i8] c"PRIMAL NETWORK SIMPLEX: \00", align 1
@.str.2 = private unnamed_addr constant [49 x i8] c"artificial arc with nonzero flow, node %d (%ld)\0A\00", align 1
@.str.3 = private unnamed_addr constant [31 x i8] c"basis primal infeasible (%ld)\0A\00", align 1
@stderr = external local_unnamed_addr global ptr, align 8
@.str.4 = private unnamed_addr constant [23 x i8] c"DUAL NETWORK SIMPLEX: \00", align 1
@.str.5 = private unnamed_addr constant [23 x i8] c"basis dual infeasible\0A\00", align 1

; Function Attrs: nounwind uwtable
define dso_local void @refresh_neighbour_lists(ptr noundef %net, ptr nocapture noundef readonly %getPos) local_unnamed_addr #0 !dbg !63 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, globals: !50, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/mcfutil.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/505.mcf_r", checksumkind: CSK_MD5, checksum: "9003ab32774b06979eebdca9b83b3489")
!2 = !{!3, !4, !47, !38, !49, !10}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !6, line: 134, baseType: !7)
!6 = !DIFile(filename: "apps/505.mcf_r/src/defines.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "05eeb7bba098b08025cbe048b289d372")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !6, line: 149, size: 832, elements: !8)
!8 = !{!9, !16, !18, !21, !22, !23, !24, !40, !41, !42, !43, !44, !45, !46}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !7, file: !6, line: 151, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !6, line: 98, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !12, line: 27, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !14, line: 44, baseType: !15)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!15 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !7, file: !6, line: 152, baseType: !17, size: 32, offset: 64)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !7, file: !6, line: 153, baseType: !19, size: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !6, line: 135, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !7, file: !6, line: 154, baseType: !19, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !7, file: !6, line: 155, baseType: !19, size: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !7, file: !6, line: 156, baseType: !19, size: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !7, file: !6, line: 157, baseType: !25, size: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !6, line: 138, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !6, line: 168, size: 576, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !35, !36, !37, !39}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !27, file: !6, line: 170, baseType: !17, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !27, file: !6, line: 171, baseType: !10, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !27, file: !6, line: 172, baseType: !19, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !27, file: !6, line: 172, baseType: !19, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !27, file: !6, line: 173, baseType: !34, size: 16, offset: 256)
!34 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !27, file: !6, line: 174, baseType: !25, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !27, file: !6, line: 174, baseType: !25, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !27, file: !6, line: 175, baseType: !38, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !6, line: 97, baseType: !11)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !27, file: !6, line: 176, baseType: !10, size: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !7, file: !6, line: 158, baseType: !25, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !7, file: !6, line: 158, baseType: !25, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !7, file: !6, line: 159, baseType: !25, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !7, file: !6, line: 160, baseType: !38, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !7, file: !6, line: 161, baseType: !11, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !7, file: !6, line: 162, baseType: !17, size: 32, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !7, file: !6, line: 163, baseType: !17, size: 32, offset: 800)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !6, line: 137, baseType: !27)
!49 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!50 = !{!51, !54}
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "old_group", scope: !0, file: !53, line: 121, type: !11, isLocal: true, isDefinition: true)
!53 = !DIFile(filename: "apps/505.mcf_r/src/mcfutil.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9003ab32774b06979eebdca9b83b3489")
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "old_Arc", scope: !0, file: !53, line: 122, type: !11, isLocal: true, isDefinition: true)
!56 = !{i32 7, !"Dwarf Version", i32 5}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{i32 7, !"PIC Level", i32 2}
!60 = !{i32 7, !"PIE Level", i32 2}
!61 = !{i32 7, !"uwtable", i32 2}
!62 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!63 = distinct !DISubprogram(name: "refresh_neighbour_lists", scope: !53, file: !53, line: 27, type: !64, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !110)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !107}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !6, line: 206, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !6, line: 181, size: 5184, elements: !69)
!69 = !{!70, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !68, file: !6, line: 183, baseType: !71, size: 1600)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 1600, elements: !73)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!73 = !{!74}
!74 = !DISubrange(count: 200)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !68, file: !6, line: 184, baseType: !71, size: 1600, offset: 1600)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !68, file: !6, line: 185, baseType: !11, size: 64, offset: 3200)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !68, file: !6, line: 185, baseType: !11, size: 64, offset: 3264)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !68, file: !6, line: 186, baseType: !11, size: 64, offset: 3328)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !68, file: !6, line: 186, baseType: !11, size: 64, offset: 3392)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !68, file: !6, line: 186, baseType: !11, size: 64, offset: 3456)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !68, file: !6, line: 186, baseType: !11, size: 64, offset: 3520)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !68, file: !6, line: 187, baseType: !11, size: 64, offset: 3584)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !68, file: !6, line: 187, baseType: !11, size: 64, offset: 3648)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !68, file: !6, line: 189, baseType: !11, size: 64, offset: 3712)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !68, file: !6, line: 190, baseType: !11, size: 64, offset: 3776)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !68, file: !6, line: 191, baseType: !11, size: 64, offset: 3840)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !68, file: !6, line: 192, baseType: !11, size: 64, offset: 3904)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !68, file: !6, line: 193, baseType: !11, size: 64, offset: 3968)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !68, file: !6, line: 194, baseType: !11, size: 64, offset: 4032)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !68, file: !6, line: 195, baseType: !11, size: 64, offset: 4096)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !68, file: !6, line: 196, baseType: !11, size: 64, offset: 4160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !68, file: !6, line: 197, baseType: !11, size: 64, offset: 4224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !68, file: !6, line: 198, baseType: !49, size: 64, offset: 4288)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !68, file: !6, line: 199, baseType: !10, size: 64, offset: 4352)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !68, file: !6, line: 200, baseType: !19, size: 64, offset: 4416)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !68, file: !6, line: 200, baseType: !19, size: 64, offset: 4480)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !68, file: !6, line: 201, baseType: !25, size: 64, offset: 4544)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !68, file: !6, line: 201, baseType: !25, size: 64, offset: 4608)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !68, file: !6, line: 201, baseType: !25, size: 64, offset: 4672)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !68, file: !6, line: 202, baseType: !25, size: 64, offset: 4736)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !68, file: !6, line: 202, baseType: !25, size: 64, offset: 4800)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !68, file: !6, line: 203, baseType: !11, size: 64, offset: 4864)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !68, file: !6, line: 204, baseType: !11, size: 64, offset: 4928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !68, file: !6, line: 205, baseType: !11, size: 64, offset: 4992)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !68, file: !6, line: 205, baseType: !11, size: 64, offset: 5056)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !68, file: !6, line: 205, baseType: !11, size: 64, offset: 5120)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!11, !66, !11}
!110 = !{!111, !112, !113, !114, !115, !116}
!111 = !DILocalVariable(name: "net", arg: 1, scope: !63, file: !53, line: 27, type: !66)
!112 = !DILocalVariable(name: "getPos", arg: 2, scope: !63, file: !53, line: 27, type: !107)
!113 = !DILocalVariable(name: "node", scope: !63, file: !53, line: 33, type: !4)
!114 = !DILocalVariable(name: "arc", scope: !63, file: !53, line: 34, type: !47)
!115 = !DILocalVariable(name: "stop", scope: !63, file: !53, line: 35, type: !3)
!116 = !DILocalVariable(name: "i", scope: !63, file: !53, line: 36, type: !17)
!117 = !DILocation(line: 0, scope: !63)
!118 = !DILocation(line: 39, column: 17, scope: !63)
!119 = !{!120, !125, i64 552}
!120 = !{!"network", !121, i64 0, !121, i64 200, !123, i64 400, !123, i64 408, !123, i64 416, !123, i64 424, !123, i64 432, !123, i64 440, !123, i64 448, !123, i64 456, !123, i64 464, !123, i64 472, !123, i64 480, !123, i64 488, !123, i64 496, !123, i64 504, !123, i64 512, !123, i64 520, !123, i64 528, !124, i64 536, !123, i64 544, !125, i64 552, !125, i64 560, !125, i64 568, !125, i64 576, !125, i64 584, !125, i64 592, !125, i64 600, !123, i64 608, !123, i64 616, !123, i64 624, !123, i64 632, !123, i64 640}
!121 = !{!"omnipotent char", !122, i64 0}
!122 = !{!"Simple C/C++ TBAA"}
!123 = !{!"long", !121, i64 0}
!124 = !{!"double", !121, i64 0}
!125 = !{!"any pointer", !121, i64 0}
!126 = !DILocation(line: 40, column: 30, scope: !127)
!127 = distinct !DILexicalBlock(scope: !63, file: !53, line: 40, column: 5)
!128 = !{!120, !125, i64 560}
!129 = !DILocation(line: 40, column: 47, scope: !130)
!130 = distinct !DILexicalBlock(scope: !127, file: !53, line: 40, column: 5)
!131 = !DILocation(line: 40, column: 5, scope: !127)
!132 = !DILocation(line: 43, column: 15, scope: !133)
!133 = distinct !DILexicalBlock(scope: !130, file: !53, line: 41, column: 5)
!134 = !DILocation(line: 40, column: 69, scope: !130)
!135 = !DILocation(line: 43, column: 24, scope: !133)
!136 = distinct !{!136, !131, !137, !138, !139}
!137 = !DILocation(line: 44, column: 5, scope: !127)
!138 = !{!"llvm.loop.mustprogress"}
!139 = !{!"llvm.loop.unroll.disable"}
!140 = !DILocation(line: 47, column: 16, scope: !63)
!141 = !DILocation(line: 48, column: 26, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !53, line: 48, column: 5)
!143 = distinct !DILexicalBlock(scope: !63, file: !53, line: 48, column: 5)
!144 = !{!120, !123, i64 424}
!145 = !DILocation(line: 48, column: 19, scope: !142)
!146 = !DILocation(line: 48, column: 5, scope: !143)
!147 = !{!120, !125, i64 568}
!148 = !DILocation(line: 50, column: 29, scope: !149)
!149 = distinct !DILexicalBlock(scope: !142, file: !53, line: 49, column: 5)
!150 = !{!151, !125, i64 16}
!151 = !{!"arc", !152, i64 0, !123, i64 8, !125, i64 16, !125, i64 24, !153, i64 32, !125, i64 40, !125, i64 48, !123, i64 56, !123, i64 64}
!152 = !{!"int", !121, i64 0}
!153 = !{!"short", !121, i64 0}
!154 = !DILocation(line: 50, column: 35, scope: !149)
!155 = !{!156, !125, i64 56}
!156 = !{!"node", !123, i64 0, !152, i64 8, !125, i64 16, !125, i64 24, !125, i64 32, !125, i64 40, !125, i64 48, !125, i64 56, !125, i64 64, !125, i64 72, !123, i64 80, !123, i64 88, !152, i64 96, !152, i64 100}
!157 = !DILocation(line: 50, column: 14, scope: !149)
!158 = !DILocation(line: 50, column: 22, scope: !149)
!159 = !{!151, !125, i64 40}
!160 = !DILocation(line: 51, column: 29, scope: !149)
!161 = !DILocation(line: 52, column: 28, scope: !149)
!162 = !{!151, !125, i64 24}
!163 = !DILocation(line: 52, column: 34, scope: !149)
!164 = !{!156, !125, i64 64}
!165 = !DILocation(line: 52, column: 14, scope: !149)
!166 = !DILocation(line: 52, column: 21, scope: !149)
!167 = !{!151, !125, i64 48}
!168 = !DILocation(line: 53, column: 28, scope: !149)
