; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/500.perlbench_r/llvm-ir/500.perlbench_r_bc/src/numeric.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/500.perlbench_r/src/numeric.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sv = type { ptr, i32, i32, %union.anon }
%union.anon = type { ptr }
%struct.xpvnv = type { ptr, %union._xmgu, i64, %union.anon.16, %union._xivu, %union._xnvu }
%union._xmgu = type { ptr }
%union.anon.16 = type { i64 }
%union._xivu = type { i64 }
%union._xnvu = type { double }
%struct.xpv = type { ptr, %union._xmgu, i64, %union.anon.17 }
%union.anon.17 = type { i64 }

@.str = private unnamed_addr constant [34 x i8] c"Integer overflow in binary number\00", align 1
@.str.1 = private unnamed_addr constant [34 x i8] c"Illegal binary digit '%c' ignored\00", align 1
@.str.2 = private unnamed_addr constant [64 x i8] c"Binary number > 0b11111111111111111111111111111111 non-portable\00", align 1
@PL_charclass = external local_unnamed_addr constant [0 x i32], align 4
@.str.3 = private unnamed_addr constant [39 x i8] c"Integer overflow in hexadecimal number\00", align 1
@.str.4 = private unnamed_addr constant [39 x i8] c"Illegal hexadecimal digit '%c' ignored\00", align 1
@.str.5 = private unnamed_addr constant [45 x i8] c"Hexadecimal number > 0xffffffff non-portable\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, globals: !618, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/500.perlbench_r/src/numeric.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/500.perlbench_r", checksumkind: CSK_MD5, checksum: "d9b7586d9a31cc99d85644c27bc830fa")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 132, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/500.perlbench_r/src/sv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e8ddee5f0a5032210b880c8e95bcea58")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!7 = !DIEnumerator(name: "SVt_NULL", value: 0)
!8 = !DIEnumerator(name: "SVt_IV", value: 1)
!9 = !DIEnumerator(name: "SVt_NV", value: 2)
!10 = !DIEnumerator(name: "SVt_PV", value: 3)
!11 = !DIEnumerator(name: "SVt_INVLIST", value: 4)
!12 = !DIEnumerator(name: "SVt_PVIV", value: 5)
!13 = !DIEnumerator(name: "SVt_PVNV", value: 6)
!14 = !DIEnumerator(name: "SVt_PVMG", value: 7)
!15 = !DIEnumerator(name: "SVt_REGEXP", value: 8)
!16 = !DIEnumerator(name: "SVt_PVGV", value: 9)
!17 = !DIEnumerator(name: "SVt_PVLV", value: 10)
!18 = !DIEnumerator(name: "SVt_PVAV", value: 11)
!19 = !DIEnumerator(name: "SVt_PVHV", value: 12)
!20 = !DIEnumerator(name: "SVt_PVCV", value: 13)
!21 = !DIEnumerator(name: "SVt_PVFM", value: 14)
!22 = !DIEnumerator(name: "SVt_PVIO", value: 15)
!23 = !DIEnumerator(name: "SVt_LAST", value: 16)
!24 = !{!25, !27, !29, !32, !34, !35, !37, !39, !40, !42, !43, !606, !443}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "U32", file: !26, line: 175, baseType: !5)
!26 = !DIFile(filename: "apps/500.perlbench_r/src/handy.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c8309d47b4ac9e3aa493b22b0023a43d")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "I32", file: !26, line: 174, baseType: !28)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV", file: !30, line: 1671, baseType: !31)
!30 = !DIFile(filename: "apps/500.perlbench_r/src/perl.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d6cbd7c2824e8e37adbd28e0286c9085")
!31 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !30, line: 1670, baseType: !33)
!33 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!34 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "NV", file: !30, line: 1877, baseType: !36)
!36 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "U8", file: !26, line: 171, baseType: !38)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "svtype", file: !4, line: 153, baseType: !3)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVNV", file: !30, line: 2662, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvnv", file: !4, line: 517, size: 384, elements: !46)
!46 = !{!47, !597, !598, !599, !604, !605}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !45, file: !4, line: 518, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "HV", file: !30, line: 2649, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hv", file: !4, line: 246, size: 192, elements: !51)
!51 = !{!52, !582, !583, !584}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !50, file: !4, line: 247, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVHV", file: !30, line: 2667, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvhv", file: !56, line: 130, size: 256, elements: !57)
!56 = !DIFile(filename: "apps/500.perlbench_r/src/hv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "27f8e9a41fdec76d9a4a382c2975f411")
!57 = !{!58, !59, !580, !581}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !55, file: !56, line: 131, baseType: !48, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !55, file: !56, line: 132, baseType: !60, size: 64, offset: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xmgu", file: !4, line: 494, size: 64, elements: !61)
!61 = !{!62, !579}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_magic", scope: !60, file: !4, line: 495, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAGIC", file: !30, line: 2658, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "magic", file: !66, line: 23, size: 384, elements: !67)
!66 = !DIFile(filename: "apps/500.perlbench_r/src/mg.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4fa2ae981502c39a9854b719090d263f")
!67 = !{!68, !69, !571, !574, !575, !576, !577, !578}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "mg_moremagic", scope: !65, file: !66, line: 24, baseType: !63, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mg_virtual", scope: !65, file: !66, line: 25, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "MGVTBL", file: !30, line: 2673, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mgvtbl", file: !66, line: 11, size: 512, elements: !73)
!73 = !{!74, !541, !542, !546, !547, !548, !552, !570}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "svt_get", scope: !72, file: !66, line: 12, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!28, !78, !63}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "SV", file: !30, line: 2647, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sv", file: !4, line: 218, size: 192, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !80, file: !4, line: 219, baseType: !39, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !80, file: !4, line: 219, baseType: !25, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !80, file: !4, line: 219, baseType: !25, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !80, file: !4, line: 220, baseType: !86, size: 64, offset: 128)
!86 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !4, line: 220, size: 64, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !537, !538, !539, !540}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !86, file: !4, line: 220, baseType: !40, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !86, file: !4, line: 220, baseType: !32, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !86, file: !4, line: 220, baseType: !29, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !86, file: !4, line: 220, baseType: !35, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !86, file: !4, line: 220, baseType: !78, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !86, file: !4, line: 220, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp", file: !96, line: 140, size: 1536, elements: !97)
!96 = !DIFile(filename: "apps/500.perlbench_r/src/regexp.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "83285f03b848d0cf5e30c9354282eae6")
!97 = !{!98, !99, !100, !104, !109, !493, !494, !495, !496, !497, !498, !499, !515, !516, !517, !518, !519, !520, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !95, file: !96, line: 141, baseType: !48, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !95, file: !96, line: 141, baseType: !60, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !95, file: !96, line: 141, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRLEN", file: !30, line: 2615, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 46, baseType: !31)
!103 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !95, file: !96, line: 141, baseType: !105, size: 64, offset: 192)
!105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !95, file: !96, line: 141, size: 64, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !105, file: !96, line: 141, baseType: !101, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !105, file: !96, line: 141, baseType: !40, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !95, file: !96, line: 142, baseType: !110, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_engine", file: !96, line: 157, size: 768, elements: !113)
!113 = !{!114, !433, !438, !454, !458, !462, !467, !474, !478, !482, !486, !487}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !112, file: !96, line: 158, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !432, !25}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "REGEXP", file: !30, line: 2651, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "p5rx", file: !4, line: 256, size: 192, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !120, file: !4, line: 257, baseType: !94, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !120, file: !4, line: 257, baseType: !25, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !120, file: !4, line: 257, baseType: !25, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !120, file: !4, line: 258, baseType: !126, size: 64, offset: 128)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !120, file: !4, line: 258, size: 64, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !136, !159, !431}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !126, file: !4, line: 258, baseType: !40, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !126, file: !4, line: 258, baseType: !32, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !126, file: !4, line: 258, baseType: !29, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !126, file: !4, line: 258, baseType: !35, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !126, file: !4, line: 258, baseType: !78, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !126, file: !4, line: 258, baseType: !94, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !126, file: !4, line: 258, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !126, file: !4, line: 258, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "HE", file: !4, line: 186, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "he", file: !56, line: 32, size: 192, elements: !141)
!141 = !{!142, !143, !154}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "hent_next", scope: !140, file: !56, line: 36, baseType: !138, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "hent_hek", scope: !140, file: !56, line: 37, baseType: !144, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEK", file: !4, line: 187, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hek", file: !56, line: 45, size: 96, elements: !147)
!147 = !{!148, !149, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "hek_hash", scope: !146, file: !56, line: 46, baseType: !25, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "hek_len", scope: !146, file: !56, line: 47, baseType: !27, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "hek_key", scope: !146, file: !56, line: 48, baseType: !151, size: 8, offset: 64)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 1)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "he_valu", scope: !140, file: !56, line: 41, baseType: !155, size: 64, offset: 128)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !140, file: !56, line: 38, size: 64, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "hent_val", scope: !155, file: !56, line: 39, baseType: !78, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "hent_refcount", scope: !155, file: !56, line: 40, baseType: !102, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !126, file: !4, line: 258, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "GP", file: !30, line: 2652, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gp", file: !163, line: 11, size: 640, elements: !164)
!163 = !DIFile(filename: "apps/500.perlbench_r/src/gv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9bb5d31ae54fd87680f22708385557b3")
!164 = !{!165, !166, !274, !421, !422, !423, !424, !426, !427, !428, !429, !430}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "gp_sv", scope: !162, file: !163, line: 12, baseType: !78, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "gp_io", scope: !162, file: !163, line: 13, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io", file: !4, line: 251, size: 192, elements: !169)
!169 = !{!170, !259, !260, !261}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !168, file: !4, line: 252, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVIO", file: !30, line: 2672, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvio", file: !4, line: 603, size: 1088, elements: !174)
!174 = !{!175, !176, !177, !178, !183, !189, !196, !205, !206, !207, !208, !209, !253, !254, !255, !256, !257, !258}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !173, file: !4, line: 604, baseType: !48, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !173, file: !4, line: 604, baseType: !60, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !173, file: !4, line: 604, baseType: !101, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !173, file: !4, line: 604, baseType: !179, size: 64, offset: 192)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !173, file: !4, line: 604, size: 64, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !179, file: !4, line: 604, baseType: !101, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !179, file: !4, line: 604, baseType: !40, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !173, file: !4, line: 605, baseType: !184, size: 64, offset: 256)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xivu", file: !4, line: 488, size: 64, elements: !185)
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_iv", scope: !184, file: !4, line: 489, baseType: !32, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_uv", scope: !184, file: !4, line: 490, baseType: !29, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_namehek", scope: !184, file: !4, line: 491, baseType: !144, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "xio_ofp", scope: !173, file: !4, line: 607, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIO", file: !192, line: 85, baseType: !193)
!192 = !DIFile(filename: "apps/500.perlbench_r/src/perlio.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "97551467ae05102ac1f9e2f28362d918")
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIOl", file: !192, line: 83, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PerlIO", file: !192, line: 83, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "xio_dirpu", scope: !173, file: !4, line: 620, baseType: !197, size: 64, offset: 384)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !173, file: !4, line: 617, size: 64, elements: !198)
!198 = !{!199, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_dirp", scope: !197, file: !4, line: 618, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !202, line: 127, baseType: !203)
!202 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "33c45a2c20a17fc93667c8d9aa922ab0")
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !202, line: 127, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_any", scope: !197, file: !4, line: 619, baseType: !39, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page", scope: !173, file: !4, line: 622, baseType: !32, size: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page_len", scope: !173, file: !4, line: 623, baseType: !32, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "xio_lines_left", scope: !173, file: !4, line: 624, baseType: !32, size: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_name", scope: !173, file: !4, line: 625, baseType: !40, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_gv", scope: !173, file: !4, line: 626, baseType: !210, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GV", file: !30, line: 2653, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gv", file: !4, line: 231, size: 192, elements: !213)
!213 = !{!214, !238, !239, !240}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !212, file: !4, line: 232, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVGV", file: !30, line: 2668, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvgv", file: !4, line: 561, size: 384, elements: !218)
!218 = !{!219, !220, !221, !222, !227, !228}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !217, file: !4, line: 562, baseType: !48, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !217, file: !4, line: 562, baseType: !60, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !217, file: !4, line: 562, baseType: !101, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !217, file: !4, line: 562, baseType: !223, size: 64, offset: 192)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !4, line: 562, size: 64, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !223, file: !4, line: 562, baseType: !101, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !223, file: !4, line: 562, baseType: !40, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !217, file: !4, line: 563, baseType: !184, size: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !217, file: !4, line: 564, baseType: !229, size: 64, offset: 320)
!229 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xnvu", file: !4, line: 479, size: 64, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_nv", scope: !229, file: !4, line: 480, baseType: !35, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "xgv_stash", scope: !229, file: !4, line: 481, baseType: !48, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "xpad_cop_seq", scope: !229, file: !4, line: 485, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !229, file: !4, line: 482, size: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !234, file: !4, line: 483, baseType: !25, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !234, file: !4, line: 484, baseType: !25, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !212, file: !4, line: 232, baseType: !25, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !212, file: !4, line: 232, baseType: !25, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !212, file: !4, line: 233, baseType: !241, size: 64, offset: 128)
!241 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !212, file: !4, line: 233, size: 64, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !241, file: !4, line: 233, baseType: !40, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !241, file: !4, line: 233, baseType: !32, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !241, file: !4, line: 233, baseType: !29, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !241, file: !4, line: 233, baseType: !35, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !241, file: !4, line: 233, baseType: !78, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !241, file: !4, line: 233, baseType: !94, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !241, file: !4, line: 233, baseType: !135, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !241, file: !4, line: 233, baseType: !137, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !241, file: !4, line: 233, baseType: !160, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !241, file: !4, line: 233, baseType: !190, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_name", scope: !173, file: !4, line: 627, baseType: !40, size: 64, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_gv", scope: !173, file: !4, line: 628, baseType: !210, size: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_name", scope: !173, file: !4, line: 629, baseType: !40, size: 64, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_gv", scope: !173, file: !4, line: 630, baseType: !210, size: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "xio_type", scope: !173, file: !4, line: 631, baseType: !41, size: 8, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "xio_flags", scope: !173, file: !4, line: 632, baseType: !37, size: 8, offset: 1032)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !168, file: !4, line: 252, baseType: !25, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !168, file: !4, line: 252, baseType: !25, size: 32, offset: 96)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !168, file: !4, line: 253, baseType: !262, size: 64, offset: 128)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !4, line: 253, size: 64, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !262, file: !4, line: 253, baseType: !40, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !262, file: !4, line: 253, baseType: !32, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !262, file: !4, line: 253, baseType: !29, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !262, file: !4, line: 253, baseType: !35, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !262, file: !4, line: 253, baseType: !78, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !262, file: !4, line: 253, baseType: !94, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !262, file: !4, line: 253, baseType: !135, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !262, file: !4, line: 253, baseType: !137, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !262, file: !4, line: 253, baseType: !160, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !262, file: !4, line: 253, baseType: !190, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cv", scope: !162, file: !163, line: 14, baseType: !275, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "CV", file: !30, line: 2650, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv", file: !4, line: 236, size: 192, elements: !278)
!278 = !{!279, !406, !407, !408}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !277, file: !4, line: 237, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVCV", file: !30, line: 2669, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvcv", file: !283, line: 13, size: 832, elements: !284)
!283 = !DIFile(filename: "apps/500.perlbench_r/src/cv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b8f33b415055b936fc8991c908273806")
!284 = !{!285, !286, !287, !288, !293, !294, !338, !346, !351, !352, !401, !402, !403, !405}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !282, file: !283, line: 14, baseType: !48, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !282, file: !283, line: 14, baseType: !60, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !282, file: !283, line: 14, baseType: !101, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !282, file: !283, line: 14, baseType: !289, size: 64, offset: 192)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !282, file: !283, line: 14, size: 64, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !289, file: !283, line: 14, baseType: !101, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !289, file: !283, line: 14, baseType: !40, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_stash", scope: !282, file: !283, line: 15, baseType: !48, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start_u", scope: !282, file: !283, line: 15, baseType: !295, size: 64, offset: 320)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !282, file: !283, line: 15, size: 64, elements: !296)
!296 = !{!297, !322}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start", scope: !295, file: !283, line: 15, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "OP", file: !30, line: 2617, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !301, line: 202, size: 320, elements: !302)
!301 = !DIFile(filename: "apps/500.perlbench_r/src/op.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b88d747a6f3149f06a4a1e8e725e6800")
!302 = !{!303, !304, !305, !309, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !300, file: !301, line: 203, baseType: !298, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !300, file: !301, line: 203, baseType: !298, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !300, file: !301, line: 203, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!298}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !300, file: !301, line: 203, baseType: !310, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADOFFSET", file: !311, line: 25, baseType: !31)
!311 = !DIFile(filename: "apps/500.perlbench_r/src/pad.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "07d0fc40568e154e930466504379a358")
!312 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !300, file: !301, line: 203, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !300, file: !301, line: 203, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !300, file: !301, line: 203, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !300, file: !301, line: 203, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !300, file: !301, line: 203, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !300, file: !301, line: 203, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !300, file: !301, line: 203, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !300, file: !301, line: 203, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !300, file: !301, line: 203, baseType: !37, size: 8, offset: 272)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !300, file: !301, line: 203, baseType: !37, size: 8, offset: 280)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsubany", scope: !295, file: !283, line: 15, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ANY", file: !30, line: 2674, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "any", file: !30, line: 3691, size: 64, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !337}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "any_ptr", scope: !324, file: !30, line: 3692, baseType: !39, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "any_i32", scope: !324, file: !30, line: 3693, baseType: !27, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "any_u32", scope: !324, file: !30, line: 3694, baseType: !25, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "any_iv", scope: !324, file: !30, line: 3695, baseType: !32, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "any_uv", scope: !324, file: !30, line: 3696, baseType: !29, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "any_long", scope: !324, file: !30, line: 3697, baseType: !33, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "any_bool", scope: !324, file: !30, line: 3698, baseType: !34, size: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "any_dptr", scope: !324, file: !30, line: 3699, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !39}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "any_dxptr", scope: !324, file: !30, line: 3700, baseType: !334, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root_u", scope: !282, file: !283, line: 15, baseType: !339, size: 64, offset: 384)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !282, file: !283, line: 15, size: 64, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root", scope: !339, file: !283, line: 15, baseType: !298, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsub", scope: !339, file: !283, line: 15, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !275}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv_u", scope: !282, file: !283, line: 15, baseType: !347, size: 64, offset: 448)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !282, file: !283, line: 15, size: 64, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv", scope: !347, file: !283, line: 15, baseType: !210, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hek", scope: !347, file: !283, line: 15, baseType: !144, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_file", scope: !282, file: !283, line: 15, baseType: !40, size: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist_u", scope: !282, file: !283, line: 15, baseType: !353, size: 64, offset: 576)
!353 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !282, file: !283, line: 15, size: 64, elements: !354)
!354 = !{!355, !400}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist", scope: !353, file: !283, line: 15, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADLIST", file: !30, line: 2681, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "padlist", file: !311, line: 34, size: 192, elements: !359)
!359 = !{!360, !365, !398, !399}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_max", scope: !358, file: !311, line: 35, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !362, line: 108, baseType: !363)
!362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !364, line: 193, baseType: !33)
!364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_alloc", scope: !358, file: !311, line: 36, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAD", file: !30, line: 2682, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV", file: !30, line: 2648, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "av", file: !4, line: 241, size: 192, elements: !371)
!371 = !{!372, !383, !384, !385}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !370, file: !4, line: 242, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVAV", file: !30, line: 2666, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvav", file: !376, line: 11, size: 320, elements: !377)
!376 = !DIFile(filename: "apps/500.perlbench_r/src/av.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3a1f05c53eedc93ff5262833cf63fc72")
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !375, file: !376, line: 12, baseType: !48, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !375, file: !376, line: 13, baseType: !60, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "xav_fill", scope: !375, file: !376, line: 14, baseType: !361, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "xav_max", scope: !375, file: !376, line: 15, baseType: !361, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "xav_alloc", scope: !375, file: !376, line: 16, baseType: !135, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !370, file: !4, line: 242, baseType: !25, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !370, file: !4, line: 242, baseType: !25, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !370, file: !4, line: 243, baseType: !386, size: 64, offset: 128)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !370, file: !4, line: 243, size: 64, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !386, file: !4, line: 243, baseType: !40, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !386, file: !4, line: 243, baseType: !32, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !386, file: !4, line: 243, baseType: !29, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !386, file: !4, line: 243, baseType: !35, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !386, file: !4, line: 243, baseType: !78, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !386, file: !4, line: 243, baseType: !94, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !386, file: !4, line: 243, baseType: !135, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !386, file: !4, line: 243, baseType: !137, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !386, file: !4, line: 243, baseType: !160, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !386, file: !4, line: 243, baseType: !190, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_id", scope: !358, file: !311, line: 37, baseType: !25, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_outid", scope: !358, file: !311, line: 38, baseType: !25, size: 32, offset: 160)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hscxt", scope: !353, file: !283, line: 15, baseType: !39, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside", scope: !282, file: !283, line: 15, baseType: !275, size: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside_seq", scope: !282, file: !283, line: 15, baseType: !25, size: 32, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_flags", scope: !282, file: !283, line: 15, baseType: !404, size: 32, offset: 736)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv_flags_t", file: !4, line: 567, baseType: !25)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_depth", scope: !282, file: !283, line: 15, baseType: !27, size: 32, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !277, file: !4, line: 237, baseType: !25, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !277, file: !4, line: 237, baseType: !25, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !277, file: !4, line: 238, baseType: !409, size: 64, offset: 128)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !277, file: !4, line: 238, size: 64, elements: !410)
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !409, file: !4, line: 238, baseType: !40, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !409, file: !4, line: 238, baseType: !32, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !409, file: !4, line: 238, baseType: !29, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !409, file: !4, line: 238, baseType: !35, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !409, file: !4, line: 238, baseType: !78, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !409, file: !4, line: 238, baseType: !94, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !409, file: !4, line: 238, baseType: !135, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !409, file: !4, line: 238, baseType: !137, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !409, file: !4, line: 238, baseType: !160, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !409, file: !4, line: 238, baseType: !190, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cvgen", scope: !162, file: !163, line: 15, baseType: !25, size: 32, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gp_refcnt", scope: !162, file: !163, line: 16, baseType: !25, size: 32, offset: 224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gp_hv", scope: !162, file: !163, line: 17, baseType: !48, size: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gp_av", scope: !162, file: !163, line: 18, baseType: !425, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gp_form", scope: !162, file: !163, line: 19, baseType: !275, size: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gp_egv", scope: !162, file: !163, line: 20, baseType: !210, size: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gp_line", scope: !162, file: !163, line: 21, baseType: !5, size: 31, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gp_flags", scope: !162, file: !163, line: 22, baseType: !5, size: 1, offset: 543, flags: DIFlagBitField, extraData: i64 512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "gp_file_hek", scope: !162, file: !163, line: 23, baseType: !144, size: 64, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !126, file: !4, line: 258, baseType: !190, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !112, file: !96, line: 159, baseType: !434, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!27, !437, !40, !40, !40, !361, !78, !39, !25}
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "intuit", scope: !112, file: !96, line: 162, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!40, !437, !78, !442, !40, !40, !445, !446}
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_scream_pos_data", file: !96, line: 152, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_scream_pos_data_s", file: !96, line: 148, size: 128, elements: !449)
!449 = !{!450, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scream_olds", scope: !448, file: !96, line: 150, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scream_pos", scope: !448, file: !96, line: 151, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "checkstr", scope: !112, file: !96, line: 170, baseType: !455, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!78, !437}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !112, file: !96, line: 171, baseType: !459, size: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !437}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_FETCH", scope: !112, file: !96, line: 172, baseType: !463, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !437, !466, !432}
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_STORE", scope: !112, file: !96, line: 174, baseType: !468, size: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !437, !466, !471}
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_LENGTH", scope: !112, file: !96, line: 176, baseType: !475, size: 64, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!27, !437, !471, !466}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff", scope: !112, file: !96, line: 178, baseType: !479, size: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!78, !437, !432, !432, !445}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff_iter", scope: !112, file: !96, line: 180, baseType: !483, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!78, !437, !471, !445}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "qr_package", scope: !112, file: !96, line: 182, baseType: !455, size: 64, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "op_comp", scope: !112, file: !96, line: 186, baseType: !488, size: 64, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!118, !491, !28, !298, !110, !118, !492, !25, !25}
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mother_re", scope: !95, file: !96, line: 142, baseType: !118, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "paren_names", scope: !95, file: !96, line: 142, baseType: !48, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "extflags", scope: !95, file: !96, line: 142, baseType: !25, size: 32, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "minlen", scope: !95, file: !96, line: 142, baseType: !361, size: 64, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "minlenret", scope: !95, file: !96, line: 142, baseType: !361, size: 64, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gofs", scope: !95, file: !96, line: 142, baseType: !101, size: 64, offset: 640)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "substrs", scope: !95, file: !96, line: 142, baseType: !500, size: 64, offset: 704)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_data", file: !96, line: 45, size: 1024, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "check_ix", scope: !501, file: !96, line: 46, baseType: !37, size: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !501, file: !96, line: 47, baseType: !505, size: 960, offset: 64)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 960, elements: !513)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_datum", file: !96, line: 38, size: 320, elements: !507)
!507 = !{!508, !509, !510, !511, !512}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "min_offset", scope: !506, file: !96, line: 39, baseType: !361, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_offset", scope: !506, file: !96, line: 40, baseType: !361, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "substr", scope: !506, file: !96, line: 41, baseType: !78, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_substr", scope: !506, file: !96, line: 42, baseType: !78, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "end_shift", scope: !506, file: !96, line: 43, baseType: !361, size: 64, offset: 256)
!513 = !{!514}
!514 = !DISubrange(count: 3)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nparens", scope: !95, file: !96, line: 142, baseType: !25, size: 32, offset: 768)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "intflags", scope: !95, file: !96, line: 142, baseType: !25, size: 32, offset: 800)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pprivate", scope: !95, file: !96, line: 142, baseType: !39, size: 64, offset: 832)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !95, file: !96, line: 142, baseType: !25, size: 32, offset: 896)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !95, file: !96, line: 142, baseType: !25, size: 32, offset: 928)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !95, file: !96, line: 142, baseType: !521, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "regexp_paren_pair", file: !96, line: 68, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_paren_pair", file: !96, line: 58, size: 192, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !523, file: !96, line: 59, baseType: !361, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !523, file: !96, line: 60, baseType: !361, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "start_tmp", scope: !523, file: !96, line: 67, baseType: !361, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "subbeg", scope: !95, file: !96, line: 142, baseType: !40, size: 64, offset: 1024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "saved_copy", scope: !95, file: !96, line: 142, baseType: !78, size: 64, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sublen", scope: !95, file: !96, line: 142, baseType: !361, size: 64, offset: 1152)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "suboffset", scope: !95, file: !96, line: 142, baseType: !361, size: 64, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "subcoffset", scope: !95, file: !96, line: 142, baseType: !361, size: 64, offset: 1280)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !95, file: !96, line: 142, baseType: !361, size: 64, offset: 1344)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pre_prefix", scope: !95, file: !96, line: 142, baseType: !5, size: 4, offset: 1408, flags: DIFlagBitField, extraData: i64 1408)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "compflags", scope: !95, file: !96, line: 142, baseType: !5, size: 9, offset: 1412, flags: DIFlagBitField, extraData: i64 1408)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "qr_anoncv", scope: !95, file: !96, line: 142, baseType: !275, size: 64, offset: 1472)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !86, file: !4, line: 220, baseType: !135, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !86, file: !4, line: 220, baseType: !137, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !86, file: !4, line: 220, baseType: !160, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !86, file: !4, line: 220, baseType: !190, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "svt_set", scope: !72, file: !66, line: 13, baseType: !75, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "svt_len", scope: !72, file: !66, line: 14, baseType: !543, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!25, !78, !63}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "svt_clear", scope: !72, file: !66, line: 15, baseType: !75, size: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "svt_free", scope: !72, file: !66, line: 16, baseType: !75, size: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "svt_copy", scope: !72, file: !66, line: 17, baseType: !549, size: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!28, !78, !63, !78, !443, !27}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "svt_dup", scope: !72, file: !66, line: 19, baseType: !553, size: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!28, !63, !556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLONE_PARAMS", file: !30, line: 2677, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clone_params", file: !4, line: 2150, size: 320, elements: !559)
!559 = !{!560, !561, !562, !568, !569}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stashes", scope: !558, file: !4, line: 2151, baseType: !425, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !558, file: !4, line: 2152, baseType: !29, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "proto_perl", scope: !558, file: !4, line: 2153, baseType: !563, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlInterpreter", file: !30, line: 2639, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "interpreter", file: !30, line: 5434, size: 8, elements: !566)
!566 = !{!567}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "broiled", scope: !565, file: !30, line: 5435, baseType: !41, size: 8)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "new_perl", scope: !558, file: !4, line: 2154, baseType: !563, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "unreferenced", scope: !558, file: !4, line: 2155, baseType: !425, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "svt_local", scope: !72, file: !66, line: 20, baseType: !75, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mg_private", scope: !65, file: !66, line: 26, baseType: !572, size: 16, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "U16", file: !26, line: 173, baseType: !573)
!573 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mg_type", scope: !65, file: !66, line: 27, baseType: !41, size: 8, offset: 144)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mg_flags", scope: !65, file: !66, line: 28, baseType: !37, size: 8, offset: 152)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mg_len", scope: !65, file: !66, line: 29, baseType: !361, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mg_obj", scope: !65, file: !66, line: 30, baseType: !78, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mg_ptr", scope: !65, file: !66, line: 31, baseType: !40, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_hash_index", scope: !60, file: !4, line: 496, baseType: !101, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_keys", scope: !55, file: !56, line: 133, baseType: !101, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_max", scope: !55, file: !56, line: 134, baseType: !101, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !50, file: !4, line: 247, baseType: !25, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !50, file: !4, line: 247, baseType: !25, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !50, file: !4, line: 248, baseType: !585, size: 64, offset: 128)
!585 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !50, file: !4, line: 248, size: 64, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !585, file: !4, line: 248, baseType: !40, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !585, file: !4, line: 248, baseType: !32, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !585, file: !4, line: 248, baseType: !29, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !585, file: !4, line: 248, baseType: !35, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !585, file: !4, line: 248, baseType: !78, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !585, file: !4, line: 248, baseType: !94, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !585, file: !4, line: 248, baseType: !135, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !585, file: !4, line: 248, baseType: !137, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !585, file: !4, line: 248, baseType: !160, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !585, file: !4, line: 248, baseType: !190, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !45, file: !4, line: 518, baseType: !60, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !45, file: !4, line: 518, baseType: !101, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !45, file: !4, line: 518, baseType: !600, size: 64, offset: 192)
!600 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !45, file: !4, line: 518, size: 64, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !600, file: !4, line: 518, baseType: !101, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !600, file: !4, line: 518, baseType: !40, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !45, file: !4, line: 519, baseType: !184, size: 64, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !45, file: !4, line: 520, baseType: !229, size: 64, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPV", file: !30, line: 2659, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpv", file: !4, line: 499, size: 256, elements: !609)
!609 = !{!610, !611, !612, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !608, file: !4, line: 500, baseType: !48, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !608, file: !4, line: 500, baseType: !60, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !608, file: !4, line: 500, baseType: !101, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !608, file: !4, line: 500, baseType: !614, size: 64, offset: 192)
!614 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !608, file: !4, line: 500, size: 64, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !614, file: !4, line: 500, baseType: !101, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !614, file: !4, line: 500, baseType: !40, size: 64)
!618 = !{!619, !623}
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression(DW_OP_constu, 1844674407370955161, DW_OP_stack_value))
!620 = distinct !DIGlobalVariable(name: "uv_max_div_10", scope: !0, file: !621, line: 844, type: !622, isLocal: true, isDefinition: true)
!621 = !DIFile(filename: "apps/500.perlbench_r/src/numeric.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d9b7586d9a31cc99d85644c27bc830fa")
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression(DW_OP_constu, 5, DW_OP_stack_value))
!624 = distinct !DIGlobalVariable(name: "uv_max_mod_10", scope: !0, file: !621, line: 845, type: !625, isLocal: true, isDefinition: true)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!626 = !{i32 7, !"Dwarf Version", i32 5}
!627 = !{i32 2, !"Debug Info Version", i32 3}
!628 = !{i32 1, !"wchar_size", i32 4}
!629 = !{i32 7, !"PIC Level", i32 2}
!630 = !{i32 7, !"PIE Level", i32 2}
!631 = !{i32 7, !"uwtable", i32 2}
!632 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!633 = distinct !DISubprogram(name: "Perl_cast_ulong", scope: !621, file: !621, line: 33, type: !634, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !636)
!634 = !DISubroutineType(types: !635)
!635 = !{!25, !35}
!636 = !{!637}
!637 = !DILocalVariable(name: "f", arg: 1, scope: !633, file: !621, line: 33, type: !35)
!638 = !DILocation(line: 0, scope: !633)
!639 = !DILocation(line: 35, column: 9, scope: !640)
!640 = distinct !DILexicalBlock(scope: !633, file: !621, line: 35, column: 7)
!641 = !DILocation(line: 35, column: 7, scope: !633)
!642 = !DILocation(line: 36, column: 14, scope: !640)
!643 = !DILocation(line: 36, column: 12, scope: !640)
!644 = !DILocation(line: 36, column: 47, scope: !640)
!645 = !DILocation(line: 37, column: 9, scope: !646)
!646 = distinct !DILexicalBlock(scope: !633, file: !621, line: 37, column: 7)
!647 = !DILocation(line: 37, column: 7, scope: !633)
!648 = !DILocation(line: 44, column: 12, scope: !649)
!649 = distinct !DILexicalBlock(scope: !646, file: !621, line: 37, column: 23)
!650 = !DILocation(line: 44, column: 5, scope: !649)
!651 = !DILocation(line: 47, column: 12, scope: !633)
!652 = !DILocation(line: 47, column: 10, scope: !633)
!653 = !DILocation(line: 47, column: 3, scope: !633)
!654 = !DILocation(line: 48, column: 1, scope: !633)
!655 = distinct !DISubprogram(name: "Perl_cast_i32", scope: !621, file: !621, line: 51, type: !656, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !658)
!656 = !DISubroutineType(types: !657)
!657 = !{!27, !35}
!658 = !{!659}
!659 = !DILocalVariable(name: "f", arg: 1, scope: !655, file: !621, line: 51, type: !35)
!660 = !DILocation(line: 0, scope: !655)
!661 = !DILocation(line: 53, column: 9, scope: !662)
!662 = distinct !DILexicalBlock(scope: !655, file: !621, line: 53, column: 7)
!663 = !DILocation(line: 53, column: 7, scope: !655)
!664 = !DILocation(line: 54, column: 14, scope: !662)
!665 = !DILocation(line: 54, column: 12, scope: !662)
!666 = !DILocation(line: 54, column: 36, scope: !662)
!667 = !DILocation(line: 55, column: 9, scope: !668)
!668 = distinct !DILexicalBlock(scope: !655, file: !621, line: 55, column: 7)
