; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/500.perlbench_r/llvm-ir/500.perlbench_r_bc/src/pp.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/500.perlbench_r/src/pp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sv = type { ptr, i32, i32, %union.anon }
%union.anon = type { ptr }
%struct.mgvtbl = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.op = type { ptr, ptr, ptr, i64, i16, i8, i8 }
%struct.xpvav = type { ptr, %union._xmgu, i64, i64, ptr }
%union._xmgu = type { ptr }
%struct.av = type { ptr, i32, i32, %union.anon.0 }
%union.anon.0 = type { ptr }
%struct.xpvhv = type { ptr, %union._xmgu, i64, i64 }
%struct.xpvmg = type { ptr, %union._xmgu, i64, %union.anon.16, %union._xivu, %union._xnvu }
%union.anon.16 = type { i64 }
%union._xivu = type { i64 }
%union._xnvu = type { double }
%struct.xpvcv = type { ptr, %union._xmgu, i64, %union.anon.9, ptr, %union.anon.10, %union.anon.11, %union.anon.12, ptr, %union.anon.13, ptr, i32, i32, i32 }
%union.anon.9 = type { i64 }
%union.anon.10 = type { ptr }
%union.anon.11 = type { ptr }
%union.anon.12 = type { ptr }
%union.anon.13 = type { ptr }
%struct.padlist = type { i64, ptr, i32, i32 }
%struct.padnamelist = type { i64, ptr, i64, i64, i32 }
%struct.padname = type { ptr, ptr, %union.anon.17, i32, i32, i32, i32, i8, i8 }
%union.anon.17 = type { ptr }

!507 = !DIEnumerator(name: "REGEX_LOCALE_CHARSET", value: 1)
!508 = !DIEnumerator(name: "REGEX_UNICODE_CHARSET", value: 2)
!509 = !DIEnumerator(name: "REGEX_ASCII_RESTRICTED_CHARSET", value: 3)
!510 = !DIEnumerator(name: "REGEX_ASCII_MORE_RESTRICTED_CHARSET", value: 4)
!511 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !512, line: 46, baseType: !5, size: 32, elements: !513)
!512 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!514 = !DIEnumerator(name: "_ISupper", value: 256)
!515 = !DIEnumerator(name: "_ISlower", value: 512)
!516 = !DIEnumerator(name: "_ISalpha", value: 1024)
!517 = !DIEnumerator(name: "_ISdigit", value: 2048)
!518 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!519 = !DIEnumerator(name: "_ISspace", value: 8192)
!520 = !DIEnumerator(name: "_ISprint", value: 16384)
!521 = !DIEnumerator(name: "_ISgraph", value: 32768)
!522 = !DIEnumerator(name: "_ISblank", value: 1)
!523 = !DIEnumerator(name: "_IScntrl", value: 2)
!524 = !DIEnumerator(name: "_ISpunct", value: 4)
!525 = !DIEnumerator(name: "_ISalnum", value: 8)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !527, line: 867, baseType: !5, size: 32, elements: !528)
!527 = !DIFile(filename: "apps/500.perlbench_r/src/op.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b88d747a6f3149f06a4a1e8e725e6800")
!528 = !{!529, !530, !531, !532, !533}
!529 = !DIEnumerator(name: "XOPe_xop_ptr", value: 0)
!530 = !DIEnumerator(name: "XOPe_xop_name", value: 1)
!531 = !DIEnumerator(name: "XOPe_xop_desc", value: 2)
!532 = !DIEnumerator(name: "XOPe_xop_class", value: 4)
!533 = !DIEnumerator(name: "XOPe_xop_peep", value: 8)
!534 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !535, line: 61, baseType: !5, size: 32, elements: !536)
!535 = !DIFile(filename: "apps/500.perlbench_r/src/mg_vtable.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e447d9af3167273e6abad74e52347050")
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!537 = !DIEnumerator(name: "want_vtbl_arylen", value: 0)
!538 = !DIEnumerator(name: "want_vtbl_arylen_p", value: 1)
!539 = !DIEnumerator(name: "want_vtbl_backref", value: 2)
!540 = !DIEnumerator(name: "want_vtbl_checkcall", value: 3)
!541 = !DIEnumerator(name: "want_vtbl_collxfrm", value: 4)
!542 = !DIEnumerator(name: "want_vtbl_dbline", value: 5)
!543 = !DIEnumerator(name: "want_vtbl_debugvar", value: 6)
!544 = !DIEnumerator(name: "want_vtbl_defelem", value: 7)
!545 = !DIEnumerator(name: "want_vtbl_env", value: 8)
!546 = !DIEnumerator(name: "want_vtbl_envelem", value: 9)
!547 = !DIEnumerator(name: "want_vtbl_hints", value: 10)
!548 = !DIEnumerator(name: "want_vtbl_hintselem", value: 11)
!549 = !DIEnumerator(name: "want_vtbl_isa", value: 12)
!550 = !DIEnumerator(name: "want_vtbl_isaelem", value: 13)
!551 = !DIEnumerator(name: "want_vtbl_lvref", value: 14)
!552 = !DIEnumerator(name: "want_vtbl_mglob", value: 15)
!553 = !DIEnumerator(name: "want_vtbl_nkeys", value: 16)
!554 = !DIEnumerator(name: "want_vtbl_ovrld", value: 17)
!555 = !DIEnumerator(name: "want_vtbl_pack", value: 18)
!556 = !DIEnumerator(name: "want_vtbl_packelem", value: 19)
!557 = !DIEnumerator(name: "want_vtbl_pos", value: 20)
!558 = !DIEnumerator(name: "want_vtbl_regdata", value: 21)
!559 = !DIEnumerator(name: "want_vtbl_regdatum", value: 22)
!560 = !DIEnumerator(name: "want_vtbl_regexp", value: 23)
!561 = !DIEnumerator(name: "want_vtbl_sigelem", value: 24)
!562 = !DIEnumerator(name: "want_vtbl_substr", value: 25)
!563 = !DIEnumerator(name: "want_vtbl_sv", value: 26)
!564 = !DIEnumerator(name: "want_vtbl_taint", value: 27)
!565 = !DIEnumerator(name: "want_vtbl_utf8", value: 28)
!566 = !DIEnumerator(name: "want_vtbl_uvar", value: 29)
!567 = !DIEnumerator(name: "want_vtbl_vec", value: 30)
!568 = !DIEnumerator(name: "magic_vtable_max", value: 31)
!569 = !{!570, !575, !576, !1066, !663, !583, !577, !668, !868, !1135, !614, !1137, !1151, !609, !1153, !839, !834, !767, !1180, !1181, !1193, !1212, !597, !651, !639, !772, !1235, !595, !653, !1277, !1279, !716, !1281, !592, !1282, !1295, !600, !1308, !713, !585, !598, !816, !734, !1322, !1323, !593, !692, !1325, !1358, !968, !1360, !1380, !5, !1399, !1401, !1402}
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !571, line: 108, baseType: !572)
!571 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !573, line: 193, baseType: !574)
!573 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!574 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!575 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "SV", file: !579, line: 2647, baseType: !580)
!579 = !DIFile(filename: "apps/500.perlbench_r/src/perl.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d6cbd7c2824e8e37adbd28e0286c9085")
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sv", file: !405, line: 218, size: 192, elements: !581)
!581 = !{!582, !584, !587, !588}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !580, file: !405, line: 219, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !580, file: !405, line: 219, baseType: !585, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "U32", file: !586, line: 175, baseType: !5)
!586 = !DIFile(filename: "apps/500.perlbench_r/src/handy.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c8309d47b4ac9e3aa493b22b0023a43d")
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !580, file: !405, line: 219, baseType: !585, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !580, file: !405, line: 220, baseType: !589, size: 64, offset: 128)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !580, file: !405, line: 220, size: 64, elements: !590)
!590 = !{!591, !594, !596, !599, !602, !603, !1131, !1132, !1133, !1134}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !589, file: !405, line: 220, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !589, file: !405, line: 220, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !579, line: 1670, baseType: !574)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !589, file: !405, line: 220, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV", file: !579, line: 1671, baseType: !598)
!598 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !589, file: !405, line: 220, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "NV", file: !579, line: 1877, baseType: !601)
!601 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !589, file: !405, line: 220, baseType: !577, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !589, file: !405, line: 220, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp", file: !606, line: 140, size: 1536, elements: !607)
!606 = !DIFile(filename: "apps/500.perlbench_r/src/regexp.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "83285f03b848d0cf5e30c9354282eae6")
!607 = !{!608, !992, !993, !994, !999, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1109, !1110, !1111, !1112, !1113, !1114, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !605, file: !606, line: 141, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "HV", file: !579, line: 2649, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hv", file: !405, line: 246, size: 192, elements: !612)
!612 = !{!613, !977, !978, !979}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !611, file: !405, line: 247, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVHV", file: !579, line: 2667, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvhv", file: !617, line: 130, size: 256, elements: !618)
!617 = !DIFile(filename: "apps/500.perlbench_r/src/hv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "27f8e9a41fdec76d9a4a382c2975f411")
!618 = !{!619, !620, !975, !976}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !616, file: !617, line: 131, baseType: !609, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !616, file: !617, line: 132, baseType: !621, size: 64, offset: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xmgu", file: !405, line: 494, size: 64, elements: !622)
!622 = !{!623, !974}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_magic", scope: !621, file: !405, line: 495, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAGIC", file: !579, line: 2658, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "magic", file: !627, line: 23, size: 384, elements: !628)
!627 = !DIFile(filename: "apps/500.perlbench_r/src/mg.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4fa2ae981502c39a9854b719090d263f")
!628 = !{!629, !630, !966, !969, !970, !971, !972, !973}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mg_moremagic", scope: !626, file: !627, line: 24, baseType: !624, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mg_virtual", scope: !626, file: !627, line: 25, baseType: !631, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "MGVTBL", file: !579, line: 2673, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mgvtbl", file: !627, line: 11, size: 512, elements: !634)
!634 = !{!635, !640, !641, !645, !646, !647, !654, !965}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "svt_get", scope: !633, file: !627, line: 12, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!639, !577, !624}
!639 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "svt_set", scope: !633, file: !627, line: 13, baseType: !636, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "svt_len", scope: !633, file: !627, line: 14, baseType: !642, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!585, !577, !624}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "svt_clear", scope: !633, file: !627, line: 15, baseType: !636, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "svt_free", scope: !633, file: !627, line: 16, baseType: !636, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "svt_copy", scope: !633, file: !627, line: 17, baseType: !648, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!639, !577, !624, !577, !651, !653}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "I32", file: !586, line: 174, baseType: !639)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "svt_dup", scope: !633, file: !627, line: 19, baseType: !655, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!639, !624, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLONE_PARAMS", file: !579, line: 2677, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clone_params", file: !405, line: 2150, size: 320, elements: !661)
!661 = !{!662, !956, !957, !963, !964}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "stashes", scope: !660, file: !405, line: 2151, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV", file: !579, line: 2648, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "av", file: !405, line: 241, size: 192, elements: !666)
!666 = !{!667, !678, !679, !680}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !665, file: !405, line: 242, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVAV", file: !579, line: 2666, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvav", file: !671, line: 11, size: 320, elements: !672)
!671 = !DIFile(filename: "apps/500.perlbench_r/src/av.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3a1f05c53eedc93ff5262833cf63fc72")
!672 = !{!673, !674, !675, !676, !677}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !670, file: !671, line: 12, baseType: !609, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !670, file: !671, line: 13, baseType: !621, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "xav_fill", scope: !670, file: !671, line: 14, baseType: !570, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "xav_max", scope: !670, file: !671, line: 15, baseType: !570, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "xav_alloc", scope: !670, file: !671, line: 16, baseType: !576, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !665, file: !405, line: 242, baseType: !585, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !665, file: !405, line: 242, baseType: !585, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !665, file: !405, line: 243, baseType: !681, size: 64, offset: 128)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !665, file: !405, line: 243, size: 64, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !715, !955}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !681, file: !405, line: 243, baseType: !592, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !681, file: !405, line: 243, baseType: !595, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !681, file: !405, line: 243, baseType: !597, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !681, file: !405, line: 243, baseType: !600, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !681, file: !405, line: 243, baseType: !577, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !681, file: !405, line: 243, baseType: !604, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !681, file: !405, line: 243, baseType: !576, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !681, file: !405, line: 243, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "HE", file: !405, line: 186, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "he", file: !617, line: 32, size: 192, elements: !695)
!695 = !{!696, !697, !708}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "hent_next", scope: !694, file: !617, line: 36, baseType: !692, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "hent_hek", scope: !694, file: !617, line: 37, baseType: !698, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEK", file: !405, line: 187, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hek", file: !617, line: 45, size: 96, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "hek_hash", scope: !700, file: !617, line: 46, baseType: !585, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hek_len", scope: !700, file: !617, line: 47, baseType: !653, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "hek_key", scope: !700, file: !617, line: 48, baseType: !705, size: 8, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 8, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 1)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "he_valu", scope: !694, file: !617, line: 41, baseType: !709, size: 64, offset: 128)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !694, file: !617, line: 38, size: 64, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "hent_val", scope: !709, file: !617, line: 39, baseType: !577, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "hent_refcount", scope: !709, file: !617, line: 40, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !714, line: 46, baseType: !598)
!714 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!715 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !681, file: !405, line: 243, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "GP", file: !579, line: 2652, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gp", file: !719, line: 11, size: 640, elements: !720)
!719 = !DIFile(filename: "apps/500.perlbench_r/src/gv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9bb5d31ae54fd87680f22708385557b3")
!720 = !{!721, !722, !833, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "gp_sv", scope: !718, file: !719, line: 12, baseType: !577, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "gp_io", scope: !718, file: !719, line: 13, baseType: !723, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io", file: !405, line: 251, size: 192, elements: !725)
!725 = !{!726, !818, !819, !820}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !724, file: !405, line: 252, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVIO", file: !579, line: 2672, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvio", file: !405, line: 603, size: 1088, elements: !730)
!730 = !{!731, !732, !733, !735, !740, !746, !753, !762, !763, !764, !765, !766, !810, !811, !812, !813, !814, !815}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !729, file: !405, line: 604, baseType: !609, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !729, file: !405, line: 604, baseType: !621, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !729, file: !405, line: 604, baseType: !734, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRLEN", file: !579, line: 2615, baseType: !713)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !729, file: !405, line: 604, baseType: !736, size: 64, offset: 192)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !729, file: !405, line: 604, size: 64, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !736, file: !405, line: 604, baseType: !734, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !736, file: !405, line: 604, baseType: !592, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !729, file: !405, line: 605, baseType: !741, size: 64, offset: 256)
!741 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xivu", file: !405, line: 488, size: 64, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_iv", scope: !741, file: !405, line: 489, baseType: !595, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_uv", scope: !741, file: !405, line: 490, baseType: !597, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_namehek", scope: !741, file: !405, line: 491, baseType: !698, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "xio_ofp", scope: !729, file: !405, line: 607, baseType: !747, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIO", file: !749, line: 85, baseType: !750)
!749 = !DIFile(filename: "apps/500.perlbench_r/src/perlio.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "97551467ae05102ac1f9e2f28362d918")
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIOl", file: !749, line: 83, baseType: !752)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PerlIO", file: !749, line: 83, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "xio_dirpu", scope: !729, file: !405, line: 620, baseType: !754, size: 64, offset: 384)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !729, file: !405, line: 617, size: 64, elements: !755)
!755 = !{!756, !761}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_dirp", scope: !754, file: !405, line: 618, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !759, line: 127, baseType: !760)
!759 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "33c45a2c20a17fc93667c8d9aa922ab0")
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !759, line: 127, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_any", scope: !754, file: !405, line: 619, baseType: !583, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page", scope: !729, file: !405, line: 622, baseType: !595, size: 64, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page_len", scope: !729, file: !405, line: 623, baseType: !595, size: 64, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "xio_lines_left", scope: !729, file: !405, line: 624, baseType: !595, size: 64, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_name", scope: !729, file: !405, line: 625, baseType: !592, size: 64, offset: 640)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_gv", scope: !729, file: !405, line: 626, baseType: !767, size: 64, offset: 704)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "GV", file: !579, line: 2653, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gv", file: !405, line: 231, size: 192, elements: !770)
!770 = !{!771, !795, !796, !797}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !769, file: !405, line: 232, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVGV", file: !579, line: 2668, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvgv", file: !405, line: 561, size: 384, elements: !775)
!775 = !{!776, !777, !778, !779, !784, !785}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !774, file: !405, line: 562, baseType: !609, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !774, file: !405, line: 562, baseType: !621, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !774, file: !405, line: 562, baseType: !734, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !774, file: !405, line: 562, baseType: !780, size: 64, offset: 192)
!780 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !774, file: !405, line: 562, size: 64, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !780, file: !405, line: 562, baseType: !734, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !780, file: !405, line: 562, baseType: !592, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !774, file: !405, line: 563, baseType: !741, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !774, file: !405, line: 564, baseType: !786, size: 64, offset: 320)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xnvu", file: !405, line: 479, size: 64, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_nv", scope: !786, file: !405, line: 480, baseType: !600, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "xgv_stash", scope: !786, file: !405, line: 481, baseType: !609, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "xpad_cop_seq", scope: !786, file: !405, line: 485, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !786, file: !405, line: 482, size: 64, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !791, file: !405, line: 483, baseType: !585, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !791, file: !405, line: 484, baseType: !585, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !769, file: !405, line: 232, baseType: !585, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !769, file: !405, line: 232, baseType: !585, size: 32, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !769, file: !405, line: 233, baseType: !798, size: 64, offset: 128)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !769, file: !405, line: 233, size: 64, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !798, file: !405, line: 233, baseType: !592, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !798, file: !405, line: 233, baseType: !595, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !798, file: !405, line: 233, baseType: !597, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !798, file: !405, line: 233, baseType: !600, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !798, file: !405, line: 233, baseType: !577, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !798, file: !405, line: 233, baseType: !604, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !798, file: !405, line: 233, baseType: !576, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !798, file: !405, line: 233, baseType: !691, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !798, file: !405, line: 233, baseType: !716, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !798, file: !405, line: 233, baseType: !747, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_name", scope: !729, file: !405, line: 627, baseType: !592, size: 64, offset: 768)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_gv", scope: !729, file: !405, line: 628, baseType: !767, size: 64, offset: 832)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_name", scope: !729, file: !405, line: 629, baseType: !592, size: 64, offset: 896)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_gv", scope: !729, file: !405, line: 630, baseType: !767, size: 64, offset: 960)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "xio_type", scope: !729, file: !405, line: 631, baseType: !593, size: 8, offset: 1024)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "xio_flags", scope: !729, file: !405, line: 632, baseType: !816, size: 8, offset: 1032)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "U8", file: !586, line: 171, baseType: !817)
!817 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !724, file: !405, line: 252, baseType: !585, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !724, file: !405, line: 252, baseType: !585, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !724, file: !405, line: 253, baseType: !821, size: 64, offset: 128)
!821 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !724, file: !405, line: 253, size: 64, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !821, file: !405, line: 253, baseType: !592, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !821, file: !405, line: 253, baseType: !595, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !821, file: !405, line: 253, baseType: !597, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !821, file: !405, line: 253, baseType: !600, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !821, file: !405, line: 253, baseType: !577, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !821, file: !405, line: 253, baseType: !604, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !821, file: !405, line: 253, baseType: !576, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !821, file: !405, line: 253, baseType: !691, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !821, file: !405, line: 253, baseType: !716, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !821, file: !405, line: 253, baseType: !747, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cv", scope: !718, file: !719, line: 14, baseType: !834, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "CV", file: !579, line: 2650, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv", file: !405, line: 236, size: 192, elements: !837)
!837 = !{!838, !931, !932, !933}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !836, file: !405, line: 237, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVCV", file: !579, line: 2669, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvcv", file: !842, line: 13, size: 832, elements: !843)
!842 = !DIFile(filename: "apps/500.perlbench_r/src/cv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b8f33b415055b936fc8991c908273806")
!843 = !{!844, !845, !846, !847, !852, !853, !896, !904, !909, !910, !926, !927, !928, !930}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !841, file: !842, line: 14, baseType: !609, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !841, file: !842, line: 14, baseType: !621, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !841, file: !842, line: 14, baseType: !734, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !841, file: !842, line: 14, baseType: !848, size: 64, offset: 192)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !842, line: 14, size: 64, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !848, file: !842, line: 14, baseType: !734, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !848, file: !842, line: 14, baseType: !592, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_stash", scope: !841, file: !842, line: 15, baseType: !609, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start_u", scope: !841, file: !842, line: 15, baseType: !854, size: 64, offset: 320)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !842, line: 15, size: 64, elements: !855)
!855 = !{!856, !880}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start", scope: !854, file: !842, line: 15, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "OP", file: !579, line: 2617, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !527, line: 202, size: 320, elements: !860)
!860 = !{!861, !862, !863, !867, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !859, file: !527, line: 203, baseType: !857, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !859, file: !527, line: 203, baseType: !857, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !859, file: !527, line: 203, baseType: !864, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!857}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !859, file: !527, line: 203, baseType: !868, size: 64, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADOFFSET", file: !869, line: 25, baseType: !598)
!869 = !DIFile(filename: "apps/500.perlbench_r/src/pad.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "07d0fc40568e154e930466504379a358")
!870 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !859, file: !527, line: 203, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !859, file: !527, line: 203, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !859, file: !527, line: 203, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !859, file: !527, line: 203, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !859, file: !527, line: 203, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !859, file: !527, line: 203, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !859, file: !527, line: 203, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !859, file: !527, line: 203, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !859, file: !527, line: 203, baseType: !816, size: 8, offset: 272)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !859, file: !527, line: 203, baseType: !816, size: 8, offset: 280)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsubany", scope: !854, file: !842, line: 15, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "ANY", file: !579, line: 2674, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "any", file: !579, line: 3691, size: 64, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !895}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "any_ptr", scope: !882, file: !579, line: 3692, baseType: !583, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "any_i32", scope: !882, file: !579, line: 3693, baseType: !653, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "any_u32", scope: !882, file: !579, line: 3694, baseType: !585, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "any_iv", scope: !882, file: !579, line: 3695, baseType: !595, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "any_uv", scope: !882, file: !579, line: 3696, baseType: !597, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "any_long", scope: !882, file: !579, line: 3697, baseType: !574, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "any_bool", scope: !882, file: !579, line: 3698, baseType: !575, size: 8)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "any_dptr", scope: !882, file: !579, line: 3699, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !583}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "any_dxptr", scope: !882, file: !579, line: 3700, baseType: !892, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root_u", scope: !841, file: !842, line: 15, baseType: !897, size: 64, offset: 384)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !842, line: 15, size: 64, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root", scope: !897, file: !842, line: 15, baseType: !857, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsub", scope: !897, file: !842, line: 15, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !834}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv_u", scope: !841, file: !842, line: 15, baseType: !905, size: 64, offset: 448)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !842, line: 15, size: 64, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv", scope: !905, file: !842, line: 15, baseType: !767, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hek", scope: !905, file: !842, line: 15, baseType: !698, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_file", scope: !841, file: !842, line: 15, baseType: !592, size: 64, offset: 512)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist_u", scope: !841, file: !842, line: 15, baseType: !911, size: 64, offset: 576)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !842, line: 15, size: 64, elements: !912)
!912 = !{!913, !925}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist", scope: !911, file: !842, line: 15, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADLIST", file: !579, line: 2681, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "padlist", file: !869, line: 34, size: 192, elements: !917)
!917 = !{!918, !919, !923, !924}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_max", scope: !916, file: !869, line: 35, baseType: !570, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_alloc", scope: !916, file: !869, line: 36, baseType: !920, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAD", file: !579, line: 2682, baseType: !664)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_id", scope: !916, file: !869, line: 37, baseType: !585, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_outid", scope: !916, file: !869, line: 38, baseType: !585, size: 32, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hscxt", scope: !911, file: !842, line: 15, baseType: !583, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside", scope: !841, file: !842, line: 15, baseType: !834, size: 64, offset: 640)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside_seq", scope: !841, file: !842, line: 15, baseType: !585, size: 32, offset: 704)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_flags", scope: !841, file: !842, line: 15, baseType: !929, size: 32, offset: 736)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv_flags_t", file: !405, line: 567, baseType: !585)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_depth", scope: !841, file: !842, line: 15, baseType: !653, size: 32, offset: 768)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !836, file: !405, line: 237, baseType: !585, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !836, file: !405, line: 237, baseType: !585, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !836, file: !405, line: 238, baseType: !934, size: 64, offset: 128)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !836, file: !405, line: 238, size: 64, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943, !944, !945}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !934, file: !405, line: 238, baseType: !592, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !934, file: !405, line: 238, baseType: !595, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !934, file: !405, line: 238, baseType: !597, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !934, file: !405, line: 238, baseType: !600, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !934, file: !405, line: 238, baseType: !577, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !934, file: !405, line: 238, baseType: !604, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !934, file: !405, line: 238, baseType: !576, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !934, file: !405, line: 238, baseType: !691, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !934, file: !405, line: 238, baseType: !716, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !934, file: !405, line: 238, baseType: !747, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cvgen", scope: !718, file: !719, line: 15, baseType: !585, size: 32, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gp_refcnt", scope: !718, file: !719, line: 16, baseType: !585, size: 32, offset: 224)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gp_hv", scope: !718, file: !719, line: 17, baseType: !609, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gp_av", scope: !718, file: !719, line: 18, baseType: !663, size: 64, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gp_form", scope: !718, file: !719, line: 19, baseType: !834, size: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gp_egv", scope: !718, file: !719, line: 20, baseType: !767, size: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gp_line", scope: !718, file: !719, line: 21, baseType: !5, size: 31, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "gp_flags", scope: !718, file: !719, line: 22, baseType: !5, size: 1, offset: 543, flags: DIFlagBitField, extraData: i64 512)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gp_file_hek", scope: !718, file: !719, line: 23, baseType: !698, size: 64, offset: 576)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !681, file: !405, line: 243, baseType: !747, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !660, file: !405, line: 2152, baseType: !597, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "proto_perl", scope: !660, file: !405, line: 2153, baseType: !958, size: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlInterpreter", file: !579, line: 2639, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "interpreter", file: !579, line: 5434, size: 8, elements: !961)
!961 = !{!962}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "broiled", scope: !960, file: !579, line: 5435, baseType: !593, size: 8)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "new_perl", scope: !660, file: !405, line: 2154, baseType: !958, size: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "unreferenced", scope: !660, file: !405, line: 2155, baseType: !663, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "svt_local", scope: !633, file: !627, line: 20, baseType: !636, size: 64, offset: 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "mg_private", scope: !626, file: !627, line: 26, baseType: !967, size: 16, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "U16", file: !586, line: 173, baseType: !968)
!968 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mg_type", scope: !626, file: !627, line: 27, baseType: !593, size: 8, offset: 144)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "mg_flags", scope: !626, file: !627, line: 28, baseType: !816, size: 8, offset: 152)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "mg_len", scope: !626, file: !627, line: 29, baseType: !570, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "mg_obj", scope: !626, file: !627, line: 30, baseType: !577, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "mg_ptr", scope: !626, file: !627, line: 31, baseType: !592, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_hash_index", scope: !621, file: !405, line: 496, baseType: !734, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_keys", scope: !616, file: !617, line: 133, baseType: !734, size: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_max", scope: !616, file: !617, line: 134, baseType: !734, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !611, file: !405, line: 247, baseType: !585, size: 32, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !611, file: !405, line: 247, baseType: !585, size: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !611, file: !405, line: 248, baseType: !980, size: 64, offset: 128)
!980 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !611, file: !405, line: 248, size: 64, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989, !990, !991}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !980, file: !405, line: 248, baseType: !592, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !980, file: !405, line: 248, baseType: !595, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !980, file: !405, line: 248, baseType: !597, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !980, file: !405, line: 248, baseType: !600, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !980, file: !405, line: 248, baseType: !577, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !980, file: !405, line: 248, baseType: !604, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !980, file: !405, line: 248, baseType: !576, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !980, file: !405, line: 248, baseType: !691, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !980, file: !405, line: 248, baseType: !716, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !980, file: !405, line: 248, baseType: !747, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !605, file: !606, line: 141, baseType: !621, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !605, file: !606, line: 141, baseType: !734, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !605, file: !606, line: 141, baseType: !995, size: 64, offset: 192)
!995 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !605, file: !606, line: 141, size: 64, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !995, file: !606, line: 141, baseType: !734, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !995, file: !606, line: 141, baseType: !592, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !605, file: !606, line: 142, baseType: !1000, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_engine", file: !606, line: 157, size: 768, elements: !1003)
!1003 = !{!1004, !1029, !1034, !1048, !1052, !1056, !1061, !1068, !1072, !1076, !1080, !1081}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !1002, file: !606, line: 158, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!1008, !1028, !585}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "REGEXP", file: !579, line: 2651, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "p5rx", file: !405, line: 256, size: 192, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !1010, file: !405, line: 257, baseType: !604, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !1010, file: !405, line: 257, baseType: !585, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !1010, file: !405, line: 257, baseType: !585, size: 32, offset: 96)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !1010, file: !405, line: 258, baseType: !1016, size: 64, offset: 128)
!1016 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1010, file: !405, line: 258, size: 64, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !1016, file: !405, line: 258, baseType: !592, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !1016, file: !405, line: 258, baseType: !595, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !1016, file: !405, line: 258, baseType: !597, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !1016, file: !405, line: 258, baseType: !600, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !1016, file: !405, line: 258, baseType: !577, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !1016, file: !405, line: 258, baseType: !604, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !1016, file: !405, line: 258, baseType: !576, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !1016, file: !405, line: 258, baseType: !691, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !1016, file: !405, line: 258, baseType: !716, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !1016, file: !405, line: 258, baseType: !747, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1002, file: !606, line: 159, baseType: !1030, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!653, !1033, !592, !592, !592, !570, !577, !583, !585}
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "intuit", scope: !1002, file: !606, line: 162, baseType: !1035, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!592, !1033, !577, !1038, !592, !592, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_scream_pos_data", file: !606, line: 152, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_scream_pos_data_s", file: !606, line: 148, size: 128, elements: !1043)
!1043 = !{!1044, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "scream_olds", scope: !1042, file: !606, line: 150, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "scream_pos", scope: !1042, file: !606, line: 151, baseType: !1047, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "checkstr", scope: !1002, file: !606, line: 170, baseType: !1049, size: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!577, !1033}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1002, file: !606, line: 171, baseType: !1053, size: 64, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !1033}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_FETCH", scope: !1002, file: !606, line: 172, baseType: !1057, size: 64, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{null, !1033, !1060, !1028}
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_STORE", scope: !1002, file: !606, line: 174, baseType: !1062, size: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{null, !1033, !1060, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_LENGTH", scope: !1002, file: !606, line: 176, baseType: !1069, size: 64, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!653, !1033, !1065, !1060}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff", scope: !1002, file: !606, line: 178, baseType: !1073, size: 64, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!577, !1033, !1028, !1028, !1039}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff_iter", scope: !1002, file: !606, line: 180, baseType: !1077, size: 64, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!577, !1033, !1065, !1039}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "qr_package", scope: !1002, file: !606, line: 182, baseType: !1049, size: 64, offset: 640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "op_comp", scope: !1002, file: !606, line: 186, baseType: !1082, size: 64, offset: 704)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!1008, !1085, !639, !857, !1000, !1008, !1086, !585, !585}
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "mother_re", scope: !605, file: !606, line: 142, baseType: !1008, size: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "paren_names", scope: !605, file: !606, line: 142, baseType: !609, size: 64, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "extflags", scope: !605, file: !606, line: 142, baseType: !585, size: 32, offset: 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "minlen", scope: !605, file: !606, line: 142, baseType: !570, size: 64, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "minlenret", scope: !605, file: !606, line: 142, baseType: !570, size: 64, offset: 576)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gofs", scope: !605, file: !606, line: 142, baseType: !734, size: 64, offset: 640)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "substrs", scope: !605, file: !606, line: 142, baseType: !1094, size: 64, offset: 704)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_data", file: !606, line: 45, size: 1024, elements: !1096)
!1096 = !{!1097, !1098}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "check_ix", scope: !1095, file: !606, line: 46, baseType: !816, size: 8)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1095, file: !606, line: 47, baseType: !1099, size: 960, offset: 64)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 960, elements: !1107)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_datum", file: !606, line: 38, size: 320, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "min_offset", scope: !1100, file: !606, line: 39, baseType: !570, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "max_offset", scope: !1100, file: !606, line: 40, baseType: !570, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "substr", scope: !1100, file: !606, line: 41, baseType: !577, size: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_substr", scope: !1100, file: !606, line: 42, baseType: !577, size: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "end_shift", scope: !1100, file: !606, line: 43, baseType: !570, size: 64, offset: 256)
!1107 = !{!1108}
!1108 = !DISubrange(count: 3)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nparens", scope: !605, file: !606, line: 142, baseType: !585, size: 32, offset: 768)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "intflags", scope: !605, file: !606, line: 142, baseType: !585, size: 32, offset: 800)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pprivate", scope: !605, file: !606, line: 142, baseType: !583, size: 64, offset: 832)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !605, file: !606, line: 142, baseType: !585, size: 32, offset: 896)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !605, file: !606, line: 142, baseType: !585, size: 32, offset: 928)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !605, file: !606, line: 142, baseType: !1115, size: 64, offset: 960)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "regexp_paren_pair", file: !606, line: 68, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_paren_pair", file: !606, line: 58, size: 192, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1117, file: !606, line: 59, baseType: !570, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1117, file: !606, line: 60, baseType: !570, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "start_tmp", scope: !1117, file: !606, line: 67, baseType: !570, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "subbeg", scope: !605, file: !606, line: 142, baseType: !592, size: 64, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "saved_copy", scope: !605, file: !606, line: 142, baseType: !577, size: 64, offset: 1088)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sublen", scope: !605, file: !606, line: 142, baseType: !570, size: 64, offset: 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "suboffset", scope: !605, file: !606, line: 142, baseType: !570, size: 64, offset: 1216)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "subcoffset", scope: !605, file: !606, line: 142, baseType: !570, size: 64, offset: 1280)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !605, file: !606, line: 142, baseType: !570, size: 64, offset: 1344)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pre_prefix", scope: !605, file: !606, line: 142, baseType: !5, size: 4, offset: 1408, flags: DIFlagBitField, extraData: i64 1408)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "compflags", scope: !605, file: !606, line: 142, baseType: !5, size: 9, offset: 1412, flags: DIFlagBitField, extraData: i64 1408)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "qr_anoncv", scope: !605, file: !606, line: 142, baseType: !834, size: 64, offset: 1472)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !589, file: !405, line: 220, baseType: !576, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !589, file: !405, line: 220, baseType: !691, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !589, file: !405, line: 220, baseType: !716, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !589, file: !405, line: 220, baseType: !747, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVMG", file: !579, line: 2663, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvmg", file: !405, line: 524, size: 384, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144, !1149, !1150}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !1139, file: !405, line: 525, baseType: !609, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !1139, file: !405, line: 525, baseType: !621, size: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !1139, file: !405, line: 525, baseType: !734, size: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !1139, file: !405, line: 525, baseType: !1145, size: 64, offset: 192)
!1145 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1139, file: !405, line: 525, size: 64, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !1145, file: !405, line: 525, baseType: !734, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !1145, file: !405, line: 525, baseType: !592, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !1139, file: !405, line: 526, baseType: !741, size: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !1139, file: !405, line: 527, baseType: !786, size: 64, offset: 320)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADNAMELIST", file: !579, line: 2683, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "padnamelist", file: !869, line: 41, size: 320, elements: !1156)
!1156 = !{!1157, !1158, !1177, !1178, !1179}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "xpadnl_fill", scope: !1155, file: !869, line: 42, baseType: !570, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "xpadnl_alloc", scope: !1155, file: !869, line: 43, baseType: !1159, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADNAME", file: !579, line: 2684, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "padname", file: !869, line: 74, size: 384, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1171, !1172, !1173, !1174, !1175, !1176}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_pv", scope: !1162, file: !869, line: 75, baseType: !592, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_ourstash", scope: !1162, file: !869, line: 75, baseType: !609, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_type_u", scope: !1162, file: !869, line: 75, baseType: !1167, size: 64, offset: 128)
!1167 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1162, file: !869, line: 75, size: 64, elements: !1168)
!1168 = !{!1169, !1170}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_typestash", scope: !1167, file: !869, line: 75, baseType: !609, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_protocv", scope: !1167, file: !869, line: 75, baseType: !834, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_low", scope: !1162, file: !869, line: 75, baseType: !585, size: 32, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_high", scope: !1162, file: !869, line: 75, baseType: !585, size: 32, offset: 224)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_refcnt", scope: !1162, file: !869, line: 75, baseType: !585, size: 32, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_gen", scope: !1162, file: !869, line: 75, baseType: !639, size: 32, offset: 288)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_len", scope: !1162, file: !869, line: 75, baseType: !816, size: 8, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "xpadn_flags", scope: !1162, file: !869, line: 75, baseType: !816, size: 8, offset: 328)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "xpadnl_max", scope: !1155, file: !869, line: 44, baseType: !570, size: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "xpadnl_max_named", scope: !1155, file: !869, line: 45, baseType: !868, size: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "xpadnl_refcnt", scope: !1155, file: !869, line: 46, baseType: !585, size: 32, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "svtype", file: !405, line: 153, baseType: !404)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPV", file: !579, line: 2659, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpv", file: !405, line: 499, size: 256, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !1183, file: !405, line: 500, baseType: !609, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !1183, file: !405, line: 500, baseType: !621, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !1183, file: !405, line: 500, baseType: !734, size: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !1183, file: !405, line: 500, baseType: !1189, size: 64, offset: 192)
!1189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1183, file: !405, line: 500, size: 64, elements: !1190)
!1190 = !{!1191, !1192}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !1189, file: !405, line: 500, baseType: !734, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !1189, file: !405, line: 500, baseType: !592, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "UNOP", file: !579, line: 2619, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unop", file: !527, line: 206, size: 384, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !1195, file: !527, line: 207, baseType: !857, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !1195, file: !527, line: 207, baseType: !857, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !1195, file: !527, line: 207, baseType: !864, size: 64, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !1195, file: !527, line: 207, baseType: !868, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !1195, file: !527, line: 207, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !1195, file: !527, line: 207, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !1195, file: !527, line: 207, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !1195, file: !527, line: 207, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !1195, file: !527, line: 207, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !1195, file: !527, line: 207, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !1195, file: !527, line: 207, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !1195, file: !527, line: 207, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !1195, file: !527, line: 207, baseType: !816, size: 8, offset: 272)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !1195, file: !527, line: 207, baseType: !816, size: 8, offset: 280)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "op_first", scope: !1195, file: !527, line: 208, baseType: !857, size: 64, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVLV", file: !579, line: 2664, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvlv", file: !405, line: 530, size: 640, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1224, !1225, !1226, !1231, !1232, !1233, !1234}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !1214, file: !405, line: 531, baseType: !609, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !1214, file: !405, line: 531, baseType: !621, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !1214, file: !405, line: 531, baseType: !734, size: 64, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !1214, file: !405, line: 531, baseType: !1220, size: 64, offset: 192)
!1220 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1214, file: !405, line: 531, size: 64, elements: !1221)
!1221 = !{!1222, !1223}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !1220, file: !405, line: 531, baseType: !734, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !1220, file: !405, line: 531, baseType: !592, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !1214, file: !405, line: 532, baseType: !741, size: 64, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !1214, file: !405, line: 533, baseType: !786, size: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "xlv_targoff_u", scope: !1214, file: !405, line: 537, baseType: !1227, size: 64, offset: 384)
!1227 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1214, file: !405, line: 534, size: 64, elements: !1228)
!1228 = !{!1229, !1230}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "xlvu_targoff", scope: !1227, file: !405, line: 535, baseType: !734, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "xlvu_stargoff", scope: !1227, file: !405, line: 536, baseType: !570, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "xlv_targlen", scope: !1214, file: !405, line: 538, baseType: !734, size: 64, offset: 448)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "xlv_targ", scope: !1214, file: !405, line: 539, baseType: !577, size: 64, offset: 512)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "xlv_type", scope: !1214, file: !405, line: 540, baseType: !593, size: 8, offset: 576)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "xlv_flags", scope: !1214, file: !405, line: 542, baseType: !593, size: 8, offset: 584)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvhv_aux", file: !617, line: 102, size: 448, elements: !1237)
!1237 = !{!1238, !1244, !1245, !1246, !1247, !1248, !1273, !1274, !1275, !1276}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_name_u", scope: !1236, file: !617, line: 103, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xhvnameu", file: !617, line: 97, size: 64, elements: !1240)
!1240 = !{!1241, !1242}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "xhvnameu_name", scope: !1239, file: !617, line: 98, baseType: !698, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "xhvnameu_names", scope: !1239, file: !617, line: 99, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_backreferences", scope: !1236, file: !617, line: 104, baseType: !663, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_eiter", scope: !1236, file: !617, line: 105, baseType: !692, size: 64, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_riter", scope: !1236, file: !617, line: 106, baseType: !653, size: 32, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_name_count", scope: !1236, file: !617, line: 114, baseType: !653, size: 32, offset: 224)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_mro_meta", scope: !1236, file: !617, line: 115, baseType: !1249, size: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mro_meta", file: !617, line: 72, size: 512, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1255, !1256, !1257, !1270, !1271, !1272}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "mro_linear_all", scope: !1250, file: !617, line: 74, baseType: !609, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "mro_linear_current", scope: !1250, file: !617, line: 78, baseType: !577, size: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "mro_nextmethod", scope: !1250, file: !617, line: 79, baseType: !609, size: 64, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "cache_gen", scope: !1250, file: !617, line: 80, baseType: !585, size: 32, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_gen", scope: !1250, file: !617, line: 81, baseType: !585, size: 32, offset: 224)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "mro_which", scope: !1250, file: !617, line: 82, baseType: !1258, size: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mro_alg", file: !617, line: 64, size: 192, elements: !1261)
!1261 = !{!1262, !1266, !1267, !1268, !1269}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !1260, file: !617, line: 65, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!663, !609, !585}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1260, file: !617, line: 66, baseType: !651, size: 64, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1260, file: !617, line: 67, baseType: !967, size: 16, offset: 128)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "kflags", scope: !1260, file: !617, line: 68, baseType: !967, size: 16, offset: 144)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1260, file: !617, line: 69, baseType: !585, size: 32, offset: 160)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1250, file: !617, line: 83, baseType: !609, size: 64, offset: 320)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "super", scope: !1250, file: !617, line: 84, baseType: !609, size: 64, offset: 384)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_gen", scope: !1250, file: !617, line: 85, baseType: !585, size: 32, offset: 448)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_rand", scope: !1236, file: !617, line: 117, baseType: !585, size: 32, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_last_rand", scope: !1236, file: !617, line: 118, baseType: !585, size: 32, offset: 352)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_fill_lazy", scope: !1236, file: !617, line: 121, baseType: !585, size: 32, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_aux_flags", scope: !1236, file: !617, line: 122, baseType: !585, size: 32, offset: 416)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVIV", file: !579, line: 2660, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpviv", file: !405, line: 503, size: 320, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1294}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !1284, file: !405, line: 504, baseType: !609, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !1284, file: !405, line: 504, baseType: !621, size: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !1284, file: !405, line: 504, baseType: !734, size: 64, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !1284, file: !405, line: 504, baseType: !1290, size: 64, offset: 192)
!1290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1284, file: !405, line: 504, size: 64, elements: !1291)
!1291 = !{!1292, !1293}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !1290, file: !405, line: 504, baseType: !734, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !1290, file: !405, line: 504, baseType: !592, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !1284, file: !405, line: 505, baseType: !741, size: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVUV", file: !579, line: 2661, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvuv", file: !405, line: 510, size: 320, elements: !1298)
!1298 = !{!1299, !1300, !1301, !1302, !1307}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !1297, file: !405, line: 511, baseType: !609, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !1297, file: !405, line: 511, baseType: !621, size: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !1297, file: !405, line: 511, baseType: !734, size: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !1297, file: !405, line: 511, baseType: !1303, size: 64, offset: 192)
!1303 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1297, file: !405, line: 511, size: 64, elements: !1304)
!1304 = !{!1305, !1306}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !1303, file: !405, line: 511, baseType: !734, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !1303, file: !405, line: 511, baseType: !592, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "xuv_u", scope: !1297, file: !405, line: 512, baseType: !741, size: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVNV", file: !579, line: 2662, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvnv", file: !405, line: 517, size: 384, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315, !1320, !1321}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !1310, file: !405, line: 518, baseType: !609, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !1310, file: !405, line: 518, baseType: !621, size: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !1310, file: !405, line: 518, baseType: !734, size: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !1310, file: !405, line: 518, baseType: !1316, size: 64, offset: 192)
!1316 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1310, file: !405, line: 518, size: 64, elements: !1317)
!1317 = !{!1318, !1319}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !1316, file: !405, line: 518, baseType: !734, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !1316, file: !405, line: 518, baseType: !592, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !1310, file: !405, line: 519, baseType: !741, size: 64, offset: 256)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !1310, file: !405, line: 520, baseType: !786, size: 64, offset: 320)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !816)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PMOP", file: !579, line: 2624, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pmop", file: !527, line: 251, size: 768, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1352, !1357}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !1327, file: !527, line: 252, baseType: !857, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !1327, file: !527, line: 252, baseType: !857, size: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !1327, file: !527, line: 252, baseType: !864, size: 64, offset: 128)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !1327, file: !527, line: 252, baseType: !868, size: 64, offset: 192)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !1327, file: !527, line: 252, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !1327, file: !527, line: 252, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !1327, file: !527, line: 252, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !1327, file: !527, line: 252, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !1327, file: !527, line: 252, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !1327, file: !527, line: 252, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !1327, file: !527, line: 252, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !1327, file: !527, line: 252, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !1327, file: !527, line: 252, baseType: !816, size: 8, offset: 272)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !1327, file: !527, line: 252, baseType: !816, size: 8, offset: 280)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "op_first", scope: !1327, file: !527, line: 253, baseType: !857, size: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "op_last", scope: !1327, file: !527, line: 254, baseType: !857, size: 64, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmregexp", scope: !1327, file: !527, line: 258, baseType: !1008, size: 64, offset: 448)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmflags", scope: !1327, file: !527, line: 260, baseType: !585, size: 32, offset: 512)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmreplrootu", scope: !1327, file: !527, line: 268, baseType: !1348, size: 64, offset: 576)
!1348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1327, file: !527, line: 261, size: 64, elements: !1349)
!1349 = !{!1350, !1351}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmreplroot", scope: !1348, file: !527, line: 262, baseType: !857, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmtargetgv", scope: !1348, file: !527, line: 266, baseType: !767, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmstashstartu", scope: !1327, file: !527, line: 276, baseType: !1353, size: 64, offset: 640)
!1353 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1327, file: !527, line: 269, size: 64, elements: !1354)
!1354 = !{!1355, !1356}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmreplstart", scope: !1353, file: !527, line: 270, baseType: !857, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmstash", scope: !1353, file: !527, line: 274, baseType: !609, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "op_code_list", scope: !1327, file: !527, line: 277, baseType: !857, size: 64, offset: 704)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "LOGOP", file: !579, line: 2623, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "logop", file: !527, line: 223, size: 448, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !1362, file: !527, line: 224, baseType: !857, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !1362, file: !527, line: 224, baseType: !857, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !1362, file: !527, line: 224, baseType: !864, size: 64, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !1362, file: !527, line: 224, baseType: !868, size: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !1362, file: !527, line: 224, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !1362, file: !527, line: 224, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !1362, file: !527, line: 224, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !1362, file: !527, line: 224, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !1362, file: !527, line: 224, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !1362, file: !527, line: 224, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !1362, file: !527, line: 224, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !1362, file: !527, line: 224, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !1362, file: !527, line: 224, baseType: !816, size: 8, offset: 272)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !1362, file: !527, line: 224, baseType: !816, size: 8, offset: 280)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "op_first", scope: !1362, file: !527, line: 225, baseType: !857, size: 64, offset: 320)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "op_other", scope: !1362, file: !527, line: 226, baseType: !857, size: 64, offset: 384)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "SVOP", file: !579, line: 2625, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "svop", file: !527, line: 407, size: 384, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !1382, file: !527, line: 408, baseType: !857, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !1382, file: !527, line: 408, baseType: !857, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !1382, file: !527, line: 408, baseType: !864, size: 64, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !1382, file: !527, line: 408, baseType: !868, size: 64, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !1382, file: !527, line: 408, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !1382, file: !527, line: 408, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !1382, file: !527, line: 408, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !1382, file: !527, line: 408, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !1382, file: !527, line: 408, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !1382, file: !527, line: 408, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !1382, file: !527, line: 408, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !1382, file: !527, line: 408, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !1382, file: !527, line: 408, baseType: !816, size: 8, offset: 272)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !1382, file: !527, line: 408, baseType: !816, size: 8, offset: 280)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "op_sv", scope: !1382, file: !527, line: 409, baseType: !577, size: 64, offset: 320)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO", file: !579, line: 2654, baseType: !724)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_charset", file: !504, line: 52, baseType: !503)
!1403 = !{!1404, !1408}
!1404 = !DIGlobalVariableExpression(var: !1405, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!1405 = distinct !DIGlobalVariable(name: "capital_iota_len", scope: !0, file: !1406, line: 55, type: !1407, isLocal: true, isDefinition: true)
!1406 = !DIFile(filename: "apps/500.perlbench_r/src/pp.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d480b9bd13d6cec59b7e4e322f36a0ee")
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!1408 = !DIGlobalVariableExpression(var: !1409, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!1409 = distinct !DIGlobalVariable(name: "small_mu_len", scope: !0, file: !1406, line: 54, type: !1407, isLocal: true, isDefinition: true)
!1410 = !{i32 7, !"Dwarf Version", i32 5}
!1411 = !{i32 2, !"Debug Info Version", i32 3}
!1412 = !{i32 1, !"wchar_size", i32 4}
!1413 = !{i32 7, !"PIC Level", i32 2}
!1414 = !{i32 7, !"PIE Level", i32 2}
!1415 = !{i32 7, !"uwtable", i32 2}
!1416 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
