; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/500.perlbench_r/llvm-ir/500.perlbench_r_bc/src/scope.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/500.perlbench_r/src/scope.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sv = type { ptr, i32, i32, %union.anon }
%union.anon = type { ptr }
%struct.cop = type { ptr, ptr, ptr, i64, i16, i8, i8, i32, ptr, ptr, i32, i32, ptr, ptr }
%struct.av = type { ptr, i32, i32, %union.anon.0 }
%union.anon.0 = type { ptr }
%struct.xpvav = type { ptr, %union._xmgu, i64, i64, ptr }
%union._xmgu = type { ptr }
%struct.stackinfo = type { ptr, ptr, ptr, ptr, i32, i32, i32, i32 }
%struct.context = type { %union.anon.16 }
%union.anon.16 = type { %struct.subst }
%struct.subst = type { i8, i8, i16, i32, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%union.any = type { ptr }
%struct.gv = type { ptr, i32, i32, %union.anon.4 }
%union.anon.4 = type { ptr }
%struct.xpvgv = type { ptr, %union._xmgu, i64, %union.anon.8, %union._xivu, %union._xnvu }
%union.anon.8 = type { i64 }
%union._xivu = type { i64 }
%union._xnvu = type { double }
%struct.hv = type { ptr, i32, i32, %union.anon.5 }
%union.anon.5 = type { ptr }
%struct.xpvhv = type { ptr, %union._xmgu, i64, i64 }
%struct.xpvhv_aux = type { %union._xhvnameu, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32 }
%union._xhvnameu = type { ptr }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/500.perlbench_r/src/scope.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/500.perlbench_r", checksumkind: CSK_MD5, checksum: "3dd6693d494385a3479a373b6b5c2b90")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 132, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "apps/500.perlbench_r/src/sv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e8ddee5f0a5032210b880c8e95bcea58")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!7 = !DIEnumerator(name: "SVt_NULL", value: 0)
!8 = !DIEnumerator(name: "SVt_IV", value: 1)
!9 = !DIEnumerator(name: "SVt_NV", value: 2)
!10 = !DIEnumerator(name: "SVt_PV", value: 3)
!11 = !DIEnumerator(name: "SVt_INVLIST", value: 4)
!12 = !DIEnumerator(name: "SVt_PVIV", value: 5)
!13 = !DIEnumerator(name: "SVt_PVNV", value: 6)
!14 = !DIEnumerator(name: "SVt_PVMG", value: 7)
!15 = !DIEnumerator(name: "SVt_REGEXP", value: 8)
!16 = !DIEnumerator(name: "SVt_PVGV", value: 9)
!17 = !DIEnumerator(name: "SVt_PVLV", value: 10)
!18 = !DIEnumerator(name: "SVt_PVAV", value: 11)
!19 = !DIEnumerator(name: "SVt_PVHV", value: 12)
!20 = !DIEnumerator(name: "SVt_PVCV", value: 13)
!21 = !DIEnumerator(name: "SVt_PVFM", value: 14)
!22 = !DIEnumerator(name: "SVt_PVIO", value: 15)
!23 = !DIEnumerator(name: "SVt_LAST", value: 16)
!24 = !{!25, !109, !31, !79, !37, !598, !88, !267, !343, !830, !831, !142, !74, !94, !157, !223, !832, !48, !179, !874, !876, !73, !81, !91, !432, !890, !424, !640, !453, !92, !218, !902, !43, !903, !108, !638, !473, !904, !905, !168, !906, !308, !290, !285, !923, !145, !378, !320, !928, !929, !930, !932, !933, !935, !936}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "PERL_SI", file: !27, line: 1129, baseType: !28)
!27 = !DIFile(filename: "apps/500.perlbench_r/src/cop.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "64d4f81e93be43c58d053d27101a3a5e")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stackinfo", file: !27, line: 1116, size: 384, elements: !29)
!29 = !{!30, !597, !823, !825, !826, !827, !828, !829}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "si_stack", scope: !28, file: !27, line: 1117, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV", file: !33, line: 2648, baseType: !34)
!33 = !DIFile(filename: "apps/500.perlbench_r/src/perl.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d6cbd7c2824e8e37adbd28e0286c9085")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "av", file: !4, line: 241, size: 192, elements: !35)
!35 = !{!36, !582, !583, !584}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !34, file: !4, line: 242, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVAV", file: !33, line: 2666, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvav", file: !40, line: 11, size: 320, elements: !41)
!40 = !DIFile(filename: "apps/500.perlbench_r/src/av.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3a1f05c53eedc93ff5262833cf63fc72")
!41 = !{!42, !578, !579, !580, !581}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !39, file: !40, line: 12, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "HV", file: !33, line: 2649, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hv", file: !4, line: 246, size: 192, elements: !46)
!46 = !{!47, !563, !564, !565}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !45, file: !4, line: 247, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVHV", file: !33, line: 2667, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvhv", file: !51, line: 130, size: 256, elements: !52)
!51 = !DIFile(filename: "apps/500.perlbench_r/src/hv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "27f8e9a41fdec76d9a4a382c2975f411")
!52 = !{!53, !54, !561, !562}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !50, file: !51, line: 131, baseType: !43, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !50, file: !51, line: 132, baseType: !55, size: 64, offset: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xmgu", file: !4, line: 494, size: 64, elements: !56)
!56 = !{!57, !560}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_magic", scope: !55, file: !4, line: 495, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAGIC", file: !33, line: 2658, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "magic", file: !61, line: 23, size: 384, elements: !62)
!61 = !DIFile(filename: "apps/500.perlbench_r/src/mg.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4fa2ae981502c39a9854b719090d263f")
!62 = !{!63, !64, !552, !555, !556, !557, !558, !559}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "mg_moremagic", scope: !60, file: !61, line: 24, baseType: !58, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mg_virtual", scope: !60, file: !61, line: 25, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "MGVTBL", file: !33, line: 2673, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mgvtbl", file: !61, line: 11, size: 512, elements: !68)
!68 = !{!69, !522, !523, !527, !528, !529, !533, !551}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "svt_get", scope: !67, file: !61, line: 12, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !74, !58}
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "SV", file: !33, line: 2647, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sv", file: !4, line: 218, size: 192, elements: !77)
!77 = !{!78, !80, !83, !84}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !76, file: !4, line: 219, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !76, file: !4, line: 219, baseType: !81, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "U32", file: !82, line: 175, baseType: !5)
!82 = !DIFile(filename: "apps/500.perlbench_r/src/handy.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c8309d47b4ac9e3aa493b22b0023a43d")
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !76, file: !4, line: 219, baseType: !81, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !76, file: !4, line: 220, baseType: !85, size: 64, offset: 128)
!85 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !76, file: !4, line: 220, size: 64, elements: !86)
!86 = !{!87, !90, !93, !96, !99, !100, !518, !519, !520, !521}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !85, file: !4, line: 220, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !85, file: !4, line: 220, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !33, line: 1670, baseType: !92)
!92 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !85, file: !4, line: 220, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV", file: !33, line: 1671, baseType: !95)
!95 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !85, file: !4, line: 220, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "NV", file: !33, line: 1877, baseType: !98)
!98 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !85, file: !4, line: 220, baseType: !74, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !85, file: !4, line: 220, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp", file: !103, line: 140, size: 1536, elements: !104)
!103 = !DIFile(filename: "apps/500.perlbench_r/src/regexp.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "83285f03b848d0cf5e30c9354282eae6")
!104 = !{!105, !106, !107, !111, !116, !474, !475, !476, !477, !478, !479, !480, !496, !497, !498, !499, !500, !501, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !102, file: !103, line: 141, baseType: !43, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !102, file: !103, line: 141, baseType: !55, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !102, file: !103, line: 141, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRLEN", file: !33, line: 2615, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 46, baseType: !95)
!110 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !102, file: !103, line: 141, baseType: !112, size: 64, offset: 192)
!112 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !103, line: 141, size: 64, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !112, file: !103, line: 141, baseType: !108, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !112, file: !103, line: 141, baseType: !88, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !102, file: !103, line: 142, baseType: !117, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_engine", file: !103, line: 157, size: 768, elements: !120)
!120 = !{!121, !414, !419, !435, !439, !443, !448, !455, !459, !463, !467, !468}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !119, file: !103, line: 158, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !413, !81}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "REGEXP", file: !33, line: 2651, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "p5rx", file: !4, line: 256, size: 192, elements: !128)
!128 = !{!129, !130, !131, !132}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !127, file: !4, line: 257, baseType: !101, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !127, file: !4, line: 257, baseType: !81, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !127, file: !4, line: 257, baseType: !81, size: 32, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !127, file: !4, line: 258, baseType: !133, size: 64, offset: 128)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !4, line: 258, size: 64, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !143, !167, !412}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !133, file: !4, line: 258, baseType: !88, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !133, file: !4, line: 258, baseType: !91, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !133, file: !4, line: 258, baseType: !94, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !133, file: !4, line: 258, baseType: !97, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !133, file: !4, line: 258, baseType: !74, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !133, file: !4, line: 258, baseType: !101, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !133, file: !4, line: 258, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !133, file: !4, line: 258, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "HE", file: !4, line: 186, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "he", file: !51, line: 32, size: 192, elements: !148)
!148 = !{!149, !150, !162}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "hent_next", scope: !147, file: !51, line: 36, baseType: !145, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "hent_hek", scope: !147, file: !51, line: 37, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEK", file: !4, line: 187, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hek", file: !51, line: 45, size: 96, elements: !154)
!154 = !{!155, !156, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "hek_hash", scope: !153, file: !51, line: 46, baseType: !81, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "hek_len", scope: !153, file: !51, line: 47, baseType: !157, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "I32", file: !82, line: 174, baseType: !73)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "hek_key", scope: !153, file: !51, line: 48, baseType: !159, size: 8, offset: 64)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 1)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "he_valu", scope: !147, file: !51, line: 41, baseType: !163, size: 64, offset: 128)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !51, line: 38, size: 64, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "hent_val", scope: !163, file: !51, line: 39, baseType: !74, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hent_refcount", scope: !163, file: !51, line: 40, baseType: !109, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !133, file: !4, line: 258, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GP", file: !33, line: 2652, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gp", file: !171, line: 11, size: 640, elements: !172)
!171 = !DIFile(filename: "apps/500.perlbench_r/src/gv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9bb5d31ae54fd87680f22708385557b3")
!172 = !{!173, !174, !284, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "gp_sv", scope: !170, file: !171, line: 12, baseType: !74, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "gp_io", scope: !170, file: !171, line: 13, baseType: !175, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io", file: !4, line: 251, size: 192, elements: !177)
!177 = !{!178, !269, !270, !271}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !176, file: !4, line: 252, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVIO", file: !33, line: 2672, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvio", file: !4, line: 603, size: 1088, elements: !182)
!182 = !{!183, !184, !185, !186, !191, !197, !204, !213, !214, !215, !216, !217, !261, !262, !263, !264, !265, !266}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !181, file: !4, line: 604, baseType: !43, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !181, file: !4, line: 604, baseType: !55, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !181, file: !4, line: 604, baseType: !108, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !181, file: !4, line: 604, baseType: !187, size: 64, offset: 192)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !181, file: !4, line: 604, size: 64, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !187, file: !4, line: 604, baseType: !108, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !187, file: !4, line: 604, baseType: !88, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !181, file: !4, line: 605, baseType: !192, size: 64, offset: 256)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xivu", file: !4, line: 488, size: 64, elements: !193)
!193 = !{!194, !195, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_iv", scope: !192, file: !4, line: 489, baseType: !91, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_uv", scope: !192, file: !4, line: 490, baseType: !94, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_namehek", scope: !192, file: !4, line: 491, baseType: !151, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "xio_ofp", scope: !181, file: !4, line: 607, baseType: !198, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIO", file: !200, line: 85, baseType: !201)
!200 = !DIFile(filename: "apps/500.perlbench_r/src/perlio.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "97551467ae05102ac1f9e2f28362d918")
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIOl", file: !200, line: 83, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PerlIO", file: !200, line: 83, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "xio_dirpu", scope: !181, file: !4, line: 620, baseType: !205, size: 64, offset: 384)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !181, file: !4, line: 617, size: 64, elements: !206)
!206 = !{!207, !212}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_dirp", scope: !205, file: !4, line: 618, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !210, line: 127, baseType: !211)
!210 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "33c45a2c20a17fc93667c8d9aa922ab0")
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !210, line: 127, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_any", scope: !205, file: !4, line: 619, baseType: !79, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page", scope: !181, file: !4, line: 622, baseType: !91, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page_len", scope: !181, file: !4, line: 623, baseType: !91, size: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "xio_lines_left", scope: !181, file: !4, line: 624, baseType: !91, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_name", scope: !181, file: !4, line: 625, baseType: !88, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_gv", scope: !181, file: !4, line: 626, baseType: !218, size: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "GV", file: !33, line: 2653, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gv", file: !4, line: 231, size: 192, elements: !221)
!221 = !{!222, !246, !247, !248}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !220, file: !4, line: 232, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVGV", file: !33, line: 2668, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvgv", file: !4, line: 561, size: 384, elements: !226)
!226 = !{!227, !228, !229, !230, !235, !236}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !225, file: !4, line: 562, baseType: !43, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !225, file: !4, line: 562, baseType: !55, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !225, file: !4, line: 562, baseType: !108, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !225, file: !4, line: 562, baseType: !231, size: 64, offset: 192)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !4, line: 562, size: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !231, file: !4, line: 562, baseType: !108, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !231, file: !4, line: 562, baseType: !88, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !225, file: !4, line: 563, baseType: !192, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !225, file: !4, line: 564, baseType: !237, size: 64, offset: 320)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xnvu", file: !4, line: 479, size: 64, elements: !238)
!238 = !{!239, !240, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_nv", scope: !237, file: !4, line: 480, baseType: !97, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "xgv_stash", scope: !237, file: !4, line: 481, baseType: !43, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "xpad_cop_seq", scope: !237, file: !4, line: 485, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !237, file: !4, line: 482, size: 64, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !242, file: !4, line: 483, baseType: !81, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !242, file: !4, line: 484, baseType: !81, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !220, file: !4, line: 232, baseType: !81, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !220, file: !4, line: 232, baseType: !81, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !220, file: !4, line: 233, baseType: !249, size: 64, offset: 128)
!249 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !220, file: !4, line: 233, size: 64, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !249, file: !4, line: 233, baseType: !88, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !249, file: !4, line: 233, baseType: !91, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !249, file: !4, line: 233, baseType: !94, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !249, file: !4, line: 233, baseType: !97, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !249, file: !4, line: 233, baseType: !74, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !249, file: !4, line: 233, baseType: !101, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !249, file: !4, line: 233, baseType: !142, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !249, file: !4, line: 233, baseType: !144, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !249, file: !4, line: 233, baseType: !168, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !249, file: !4, line: 233, baseType: !198, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_name", scope: !181, file: !4, line: 627, baseType: !88, size: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_gv", scope: !181, file: !4, line: 628, baseType: !218, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_name", scope: !181, file: !4, line: 629, baseType: !88, size: 64, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_gv", scope: !181, file: !4, line: 630, baseType: !218, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "xio_type", scope: !181, file: !4, line: 631, baseType: !89, size: 8, offset: 1024)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "xio_flags", scope: !181, file: !4, line: 632, baseType: !267, size: 8, offset: 1032)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "U8", file: !82, line: 171, baseType: !268)
!268 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !176, file: !4, line: 252, baseType: !81, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !176, file: !4, line: 252, baseType: !81, size: 32, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !176, file: !4, line: 253, baseType: !272, size: 64, offset: 128)
!272 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !176, file: !4, line: 253, size: 64, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !272, file: !4, line: 253, baseType: !88, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !272, file: !4, line: 253, baseType: !91, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !272, file: !4, line: 253, baseType: !94, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !272, file: !4, line: 253, baseType: !97, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !272, file: !4, line: 253, baseType: !74, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !272, file: !4, line: 253, baseType: !101, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !272, file: !4, line: 253, baseType: !142, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !272, file: !4, line: 253, baseType: !144, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !272, file: !4, line: 253, baseType: !168, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !272, file: !4, line: 253, baseType: !198, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cv", scope: !170, file: !171, line: 14, baseType: !285, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "CV", file: !33, line: 2650, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv", file: !4, line: 236, size: 192, elements: !288)
!288 = !{!289, !388, !389, !390}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !287, file: !4, line: 237, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVCV", file: !33, line: 2669, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvcv", file: !293, line: 13, size: 832, elements: !294)
!293 = !DIFile(filename: "apps/500.perlbench_r/src/cv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b8f33b415055b936fc8991c908273806")
!294 = !{!295, !296, !297, !298, !303, !304, !349, !357, !362, !363, !383, !384, !385, !387}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !292, file: !293, line: 14, baseType: !43, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !292, file: !293, line: 14, baseType: !55, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !292, file: !293, line: 14, baseType: !108, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !292, file: !293, line: 14, baseType: !299, size: 64, offset: 192)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !293, line: 14, size: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !299, file: !293, line: 14, baseType: !108, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !299, file: !293, line: 14, baseType: !88, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_stash", scope: !292, file: !293, line: 15, baseType: !43, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start_u", scope: !292, file: !293, line: 15, baseType: !305, size: 64, offset: 320)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !293, line: 15, size: 64, elements: !306)
!306 = !{!307, !332}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start", scope: !305, file: !293, line: 15, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "OP", file: !33, line: 2617, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !311, line: 202, size: 320, elements: !312)
!311 = !DIFile(filename: "apps/500.perlbench_r/src/op.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b88d747a6f3149f06a4a1e8e725e6800")
!312 = !{!313, !314, !315, !319, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !310, file: !311, line: 203, baseType: !308, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !310, file: !311, line: 203, baseType: !308, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !310, file: !311, line: 203, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!308}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !310, file: !311, line: 203, baseType: !320, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADOFFSET", file: !321, line: 25, baseType: !95)
!321 = !DIFile(filename: "apps/500.perlbench_r/src/pad.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "07d0fc40568e154e930466504379a358")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !310, file: !311, line: 203, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !310, file: !311, line: 203, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !310, file: !311, line: 203, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !310, file: !311, line: 203, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !310, file: !311, line: 203, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !310, file: !311, line: 203, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !310, file: !311, line: 203, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !310, file: !311, line: 203, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !310, file: !311, line: 203, baseType: !267, size: 8, offset: 272)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !310, file: !311, line: 203, baseType: !267, size: 8, offset: 280)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsubany", scope: !305, file: !293, line: 15, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "ANY", file: !33, line: 2674, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "any", file: !33, line: 3691, size: 64, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !344, !348}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "any_ptr", scope: !334, file: !33, line: 3692, baseType: !79, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "any_i32", scope: !334, file: !33, line: 3693, baseType: !157, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "any_u32", scope: !334, file: !33, line: 3694, baseType: !81, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "any_iv", scope: !334, file: !33, line: 3695, baseType: !91, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "any_uv", scope: !334, file: !33, line: 3696, baseType: !94, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "any_long", scope: !334, file: !33, line: 3697, baseType: !92, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "any_bool", scope: !334, file: !33, line: 3698, baseType: !343, size: 8)
!343 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "any_dptr", scope: !334, file: !33, line: 3699, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !79}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "any_dxptr", scope: !334, file: !33, line: 3700, baseType: !345, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root_u", scope: !292, file: !293, line: 15, baseType: !350, size: 64, offset: 384)
!350 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !293, line: 15, size: 64, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root", scope: !350, file: !293, line: 15, baseType: !308, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsub", scope: !350, file: !293, line: 15, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !285}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv_u", scope: !292, file: !293, line: 15, baseType: !358, size: 64, offset: 448)
!358 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !293, line: 15, size: 64, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv", scope: !358, file: !293, line: 15, baseType: !218, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hek", scope: !358, file: !293, line: 15, baseType: !151, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_file", scope: !292, file: !293, line: 15, baseType: !88, size: 64, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist_u", scope: !292, file: !293, line: 15, baseType: !364, size: 64, offset: 576)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !293, line: 15, size: 64, elements: !365)
!365 = !{!366, !382}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist", scope: !364, file: !293, line: 15, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADLIST", file: !33, line: 2681, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "padlist", file: !321, line: 34, size: 192, elements: !370)
!370 = !{!371, !376, !380, !381}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_max", scope: !369, file: !321, line: 35, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !373, line: 108, baseType: !374)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !375, line: 193, baseType: !92)
!375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_alloc", scope: !369, file: !321, line: 36, baseType: !377, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAD", file: !33, line: 2682, baseType: !32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_id", scope: !369, file: !321, line: 37, baseType: !81, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_outid", scope: !369, file: !321, line: 38, baseType: !81, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hscxt", scope: !364, file: !293, line: 15, baseType: !79, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside", scope: !292, file: !293, line: 15, baseType: !285, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside_seq", scope: !292, file: !293, line: 15, baseType: !81, size: 32, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_flags", scope: !292, file: !293, line: 15, baseType: !386, size: 32, offset: 736)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv_flags_t", file: !4, line: 567, baseType: !81)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_depth", scope: !292, file: !293, line: 15, baseType: !157, size: 32, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !287, file: !4, line: 237, baseType: !81, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !287, file: !4, line: 237, baseType: !81, size: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !287, file: !4, line: 238, baseType: !391, size: 64, offset: 128)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !4, line: 238, size: 64, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !391, file: !4, line: 238, baseType: !88, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !391, file: !4, line: 238, baseType: !91, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !391, file: !4, line: 238, baseType: !94, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !391, file: !4, line: 238, baseType: !97, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !391, file: !4, line: 238, baseType: !74, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !391, file: !4, line: 238, baseType: !101, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !391, file: !4, line: 238, baseType: !142, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !391, file: !4, line: 238, baseType: !144, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !391, file: !4, line: 238, baseType: !168, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !391, file: !4, line: 238, baseType: !198, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cvgen", scope: !170, file: !171, line: 15, baseType: !81, size: 32, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gp_refcnt", scope: !170, file: !171, line: 16, baseType: !81, size: 32, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "gp_hv", scope: !170, file: !171, line: 17, baseType: !43, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "gp_av", scope: !170, file: !171, line: 18, baseType: !31, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gp_form", scope: !170, file: !171, line: 19, baseType: !285, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gp_egv", scope: !170, file: !171, line: 20, baseType: !218, size: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gp_line", scope: !170, file: !171, line: 21, baseType: !5, size: 31, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gp_flags", scope: !170, file: !171, line: 22, baseType: !5, size: 1, offset: 543, flags: DIFlagBitField, extraData: i64 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gp_file_hek", scope: !170, file: !171, line: 23, baseType: !151, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !133, file: !4, line: 258, baseType: !198, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !119, file: !103, line: 159, baseType: !415, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!157, !418, !88, !88, !88, !372, !74, !79, !81}
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "intuit", scope: !119, file: !103, line: 162, baseType: !420, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!88, !418, !74, !423, !88, !88, !426, !427}
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_scream_pos_data", file: !103, line: 152, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_scream_pos_data_s", file: !103, line: 148, size: 128, elements: !430)
!430 = !{!431, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scream_olds", scope: !429, file: !103, line: 150, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scream_pos", scope: !429, file: !103, line: 151, baseType: !434, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "checkstr", scope: !119, file: !103, line: 170, baseType: !436, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!74, !418}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !119, file: !103, line: 171, baseType: !440, size: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !418}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_FETCH", scope: !119, file: !103, line: 172, baseType: !444, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !418, !447, !413}
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_STORE", scope: !119, file: !103, line: 174, baseType: !449, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !418, !447, !452}
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_LENGTH", scope: !119, file: !103, line: 176, baseType: !456, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!157, !418, !452, !447}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff", scope: !119, file: !103, line: 178, baseType: !460, size: 64, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!74, !418, !413, !413, !426}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff_iter", scope: !119, file: !103, line: 180, baseType: !464, size: 64, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!74, !418, !452, !426}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "qr_package", scope: !119, file: !103, line: 182, baseType: !436, size: 64, offset: 640)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "op_comp", scope: !119, file: !103, line: 186, baseType: !469, size: 64, offset: 704)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!125, !472, !73, !308, !117, !125, !473, !81, !81}
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mother_re", scope: !102, file: !103, line: 142, baseType: !125, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "paren_names", scope: !102, file: !103, line: 142, baseType: !43, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "extflags", scope: !102, file: !103, line: 142, baseType: !81, size: 32, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "minlen", scope: !102, file: !103, line: 142, baseType: !372, size: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "minlenret", scope: !102, file: !103, line: 142, baseType: !372, size: 64, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "gofs", scope: !102, file: !103, line: 142, baseType: !108, size: 64, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "substrs", scope: !102, file: !103, line: 142, baseType: !481, size: 64, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_data", file: !103, line: 45, size: 1024, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "check_ix", scope: !482, file: !103, line: 46, baseType: !267, size: 8)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !482, file: !103, line: 47, baseType: !486, size: 960, offset: 64)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 960, elements: !494)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_datum", file: !103, line: 38, size: 320, elements: !488)
!488 = !{!489, !490, !491, !492, !493}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "min_offset", scope: !487, file: !103, line: 39, baseType: !372, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "max_offset", scope: !487, file: !103, line: 40, baseType: !372, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "substr", scope: !487, file: !103, line: 41, baseType: !74, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_substr", scope: !487, file: !103, line: 42, baseType: !74, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "end_shift", scope: !487, file: !103, line: 43, baseType: !372, size: 64, offset: 256)
!494 = !{!495}
!495 = !DISubrange(count: 3)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nparens", scope: !102, file: !103, line: 142, baseType: !81, size: 32, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "intflags", scope: !102, file: !103, line: 142, baseType: !81, size: 32, offset: 800)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pprivate", scope: !102, file: !103, line: 142, baseType: !79, size: 64, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !102, file: !103, line: 142, baseType: !81, size: 32, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !102, file: !103, line: 142, baseType: !81, size: 32, offset: 928)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !102, file: !103, line: 142, baseType: !502, size: 64, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "regexp_paren_pair", file: !103, line: 68, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_paren_pair", file: !103, line: 58, size: 192, elements: !505)
!505 = !{!506, !507, !508}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !504, file: !103, line: 59, baseType: !372, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !504, file: !103, line: 60, baseType: !372, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "start_tmp", scope: !504, file: !103, line: 67, baseType: !372, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "subbeg", scope: !102, file: !103, line: 142, baseType: !88, size: 64, offset: 1024)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "saved_copy", scope: !102, file: !103, line: 142, baseType: !74, size: 64, offset: 1088)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sublen", scope: !102, file: !103, line: 142, baseType: !372, size: 64, offset: 1152)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "suboffset", scope: !102, file: !103, line: 142, baseType: !372, size: 64, offset: 1216)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "subcoffset", scope: !102, file: !103, line: 142, baseType: !372, size: 64, offset: 1280)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !102, file: !103, line: 142, baseType: !372, size: 64, offset: 1344)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pre_prefix", scope: !102, file: !103, line: 142, baseType: !5, size: 4, offset: 1408, flags: DIFlagBitField, extraData: i64 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "compflags", scope: !102, file: !103, line: 142, baseType: !5, size: 9, offset: 1412, flags: DIFlagBitField, extraData: i64 1408)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "qr_anoncv", scope: !102, file: !103, line: 142, baseType: !285, size: 64, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !85, file: !4, line: 220, baseType: !142, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !85, file: !4, line: 220, baseType: !144, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !85, file: !4, line: 220, baseType: !168, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !85, file: !4, line: 220, baseType: !198, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "svt_set", scope: !67, file: !61, line: 13, baseType: !70, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "svt_len", scope: !67, file: !61, line: 14, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!81, !74, !58}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "svt_clear", scope: !67, file: !61, line: 15, baseType: !70, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "svt_free", scope: !67, file: !61, line: 16, baseType: !70, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "svt_copy", scope: !67, file: !61, line: 17, baseType: !530, size: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!73, !74, !58, !74, !424, !157}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "svt_dup", scope: !67, file: !61, line: 19, baseType: !534, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!73, !58, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLONE_PARAMS", file: !33, line: 2677, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clone_params", file: !4, line: 2150, size: 320, elements: !540)
!540 = !{!541, !542, !543, !549, !550}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "stashes", scope: !539, file: !4, line: 2151, baseType: !31, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !539, file: !4, line: 2152, baseType: !94, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "proto_perl", scope: !539, file: !4, line: 2153, baseType: !544, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlInterpreter", file: !33, line: 2639, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "interpreter", file: !33, line: 5434, size: 8, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "broiled", scope: !546, file: !33, line: 5435, baseType: !89, size: 8)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "new_perl", scope: !539, file: !4, line: 2154, baseType: !544, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "unreferenced", scope: !539, file: !4, line: 2155, baseType: !31, size: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "svt_local", scope: !67, file: !61, line: 20, baseType: !70, size: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mg_private", scope: !60, file: !61, line: 26, baseType: !553, size: 16, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "U16", file: !82, line: 173, baseType: !554)
!554 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mg_type", scope: !60, file: !61, line: 27, baseType: !89, size: 8, offset: 144)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mg_flags", scope: !60, file: !61, line: 28, baseType: !267, size: 8, offset: 152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mg_len", scope: !60, file: !61, line: 29, baseType: !372, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mg_obj", scope: !60, file: !61, line: 30, baseType: !74, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mg_ptr", scope: !60, file: !61, line: 31, baseType: !88, size: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_hash_index", scope: !55, file: !4, line: 496, baseType: !108, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_keys", scope: !50, file: !51, line: 133, baseType: !108, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_max", scope: !50, file: !51, line: 134, baseType: !108, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !45, file: !4, line: 247, baseType: !81, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !45, file: !4, line: 247, baseType: !81, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !45, file: !4, line: 248, baseType: !566, size: 64, offset: 128)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !45, file: !4, line: 248, size: 64, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !566, file: !4, line: 248, baseType: !88, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !566, file: !4, line: 248, baseType: !91, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !566, file: !4, line: 248, baseType: !94, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !566, file: !4, line: 248, baseType: !97, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !566, file: !4, line: 248, baseType: !74, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !566, file: !4, line: 248, baseType: !101, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !566, file: !4, line: 248, baseType: !142, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !566, file: !4, line: 248, baseType: !144, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !566, file: !4, line: 248, baseType: !168, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !566, file: !4, line: 248, baseType: !198, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !39, file: !40, line: 13, baseType: !55, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "xav_fill", scope: !39, file: !40, line: 14, baseType: !372, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "xav_max", scope: !39, file: !40, line: 15, baseType: !372, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "xav_alloc", scope: !39, file: !40, line: 16, baseType: !142, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !34, file: !4, line: 242, baseType: !81, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !34, file: !4, line: 242, baseType: !81, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !34, file: !4, line: 243, baseType: !585, size: 64, offset: 128)
!585 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !4, line: 243, size: 64, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !585, file: !4, line: 243, baseType: !88, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !585, file: !4, line: 243, baseType: !91, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !585, file: !4, line: 243, baseType: !94, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !585, file: !4, line: 243, baseType: !97, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !585, file: !4, line: 243, baseType: !74, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !585, file: !4, line: 243, baseType: !101, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !585, file: !4, line: 243, baseType: !142, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !585, file: !4, line: 243, baseType: !144, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !585, file: !4, line: 243, baseType: !168, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !585, file: !4, line: 243, baseType: !198, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "si_cxstack", scope: !28, file: !27, line: 1118, baseType: !598, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "PERL_CONTEXT", file: !33, line: 2655, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "context", file: !27, line: 967, size: 704, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cx_u", scope: !600, file: !27, line: 971, baseType: !603, size: 704)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !600, file: !27, line: 968, size: 704, elements: !604)
!604 = !{!605, !806}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cx_blk", scope: !603, file: !27, line: 969, baseType: !606, size: 640)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block", file: !27, line: 838, size: 640, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !656, !657, !658, !692}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "blku_type", scope: !606, file: !27, line: 839, baseType: !267, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "blku_gimme", scope: !606, file: !27, line: 840, baseType: !267, size: 8, offset: 8)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "blku_u16", scope: !606, file: !27, line: 841, baseType: !553, size: 16, offset: 16)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "blku_oldsp", scope: !606, file: !27, line: 842, baseType: !157, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "blku_oldcop", scope: !606, file: !27, line: 843, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "COP", file: !33, line: 2618, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cop", file: !27, line: 393, size: 640, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !633, !634, !635, !636, !637, !639}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !615, file: !27, line: 394, baseType: !308, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !615, file: !27, line: 394, baseType: !308, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !615, file: !27, line: 394, baseType: !316, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !615, file: !27, line: 394, baseType: !320, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !615, file: !27, line: 394, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !615, file: !27, line: 394, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !615, file: !27, line: 394, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !615, file: !27, line: 394, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !615, file: !27, line: 394, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !615, file: !27, line: 394, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !615, file: !27, line: 394, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !615, file: !27, line: 394, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !615, file: !27, line: 394, baseType: !267, size: 8, offset: 272)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !615, file: !27, line: 394, baseType: !267, size: 8, offset: 280)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cop_line", scope: !615, file: !27, line: 397, baseType: !632, size: 32, offset: 288)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_t", file: !82, line: 1734, baseType: !81)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cop_stash", scope: !615, file: !27, line: 404, baseType: !43, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cop_filegv", scope: !615, file: !27, line: 405, baseType: !218, size: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cop_hints", scope: !615, file: !27, line: 407, baseType: !81, size: 32, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cop_seq", scope: !615, file: !27, line: 408, baseType: !81, size: 32, offset: 480)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "cop_warnings", scope: !615, file: !27, line: 410, baseType: !638, size: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cop_hints_hash", scope: !615, file: !27, line: 413, baseType: !640, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPHH", file: !27, line: 170, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcounted_he", file: !51, line: 523, size: 256, elements: !643)
!643 = !{!644, !646, !647, !654, !655}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_next", scope: !642, file: !51, line: 524, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_hek", scope: !642, file: !51, line: 529, baseType: !151, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_val", scope: !642, file: !51, line: 536, baseType: !648, size: 64, offset: 128)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !642, file: !51, line: 531, size: 64, elements: !649)
!649 = !{!650, !651, !652, !653}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_u_iv", scope: !648, file: !51, line: 532, baseType: !91, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_u_uv", scope: !648, file: !51, line: 533, baseType: !94, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_u_len", scope: !648, file: !51, line: 534, baseType: !108, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_u_ptr", scope: !648, file: !51, line: 535, baseType: !79, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_refcnt", scope: !642, file: !51, line: 537, baseType: !81, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_data", scope: !642, file: !51, line: 540, baseType: !159, size: 8, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "blku_oldmarksp", scope: !606, file: !27, line: 844, baseType: !157, size: 32, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "blku_oldscopesp", scope: !606, file: !27, line: 845, baseType: !157, size: 32, offset: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "blku_oldpm", scope: !606, file: !27, line: 846, baseType: !659, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "PMOP", file: !33, line: 2624, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pmop", file: !311, line: 251, size: 768, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !686, !691}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !661, file: !311, line: 252, baseType: !308, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !661, file: !311, line: 252, baseType: !308, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !661, file: !311, line: 252, baseType: !316, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !661, file: !311, line: 252, baseType: !320, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !661, file: !311, line: 252, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !661, file: !311, line: 252, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !661, file: !311, line: 252, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !661, file: !311, line: 252, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !661, file: !311, line: 252, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !661, file: !311, line: 252, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !661, file: !311, line: 252, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !661, file: !311, line: 252, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !661, file: !311, line: 252, baseType: !267, size: 8, offset: 272)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !661, file: !311, line: 252, baseType: !267, size: 8, offset: 280)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "op_first", scope: !661, file: !311, line: 253, baseType: !308, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "op_last", scope: !661, file: !311, line: 254, baseType: !308, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmregexp", scope: !661, file: !311, line: 258, baseType: !125, size: 64, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmflags", scope: !661, file: !311, line: 260, baseType: !81, size: 32, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmreplrootu", scope: !661, file: !311, line: 268, baseType: !682, size: 64, offset: 576)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !311, line: 261, size: 64, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmreplroot", scope: !682, file: !311, line: 262, baseType: !308, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmtargetgv", scope: !682, file: !311, line: 266, baseType: !218, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmstashstartu", scope: !661, file: !311, line: 276, baseType: !687, size: 64, offset: 640)
!687 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !311, line: 269, size: 64, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmreplstart", scope: !687, file: !311, line: 270, baseType: !308, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmstash", scope: !687, file: !311, line: 274, baseType: !43, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "op_code_list", scope: !661, file: !311, line: 277, baseType: !308, size: 64, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "blk_u", scope: !606, file: !27, line: 854, baseType: !693, size: 384, offset: 256)
!693 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !606, file: !27, line: 848, size: 384, elements: !694)
!694 = !{!695, !704, !711, !750, !802}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "blku_sub", scope: !693, file: !27, line: 849, baseType: !696, size: 384)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_sub", file: !27, line: 567, size: 384, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "retop", scope: !696, file: !27, line: 568, baseType: !308, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !696, file: !27, line: 570, baseType: !285, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "savearray", scope: !696, file: !27, line: 572, baseType: !31, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "argarray", scope: !696, file: !27, line: 573, baseType: !31, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "olddepth", scope: !696, file: !27, line: 574, baseType: !157, size: 32, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "oldcomppad", scope: !696, file: !27, line: 575, baseType: !378, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "blku_format", scope: !693, file: !27, line: 850, baseType: !705, size: 256)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_format", file: !27, line: 580, size: 256, elements: !706)
!706 = !{!707, !708, !709, !710}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "retop", scope: !705, file: !27, line: 581, baseType: !308, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !705, file: !27, line: 583, baseType: !285, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gv", scope: !705, file: !27, line: 585, baseType: !218, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dfoutgv", scope: !705, file: !27, line: 586, baseType: !218, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "blku_eval", scope: !693, file: !27, line: 851, baseType: !712, size: 384)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_eval", file: !27, line: 714, size: 384, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "retop", scope: !712, file: !27, line: 715, baseType: !308, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "old_namesv", scope: !712, file: !27, line: 717, baseType: !74, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "old_eval_root", scope: !712, file: !27, line: 718, baseType: !308, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cur_text", scope: !712, file: !27, line: 719, baseType: !74, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !712, file: !27, line: 720, baseType: !285, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cur_top_env", scope: !712, file: !27, line: 721, baseType: !720, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "JMPENV", file: !27, line: 59, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jmpenv", file: !27, line: 32, size: 1728, elements: !723)
!723 = !{!724, !746, !748, !749}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "je_buf", scope: !722, file: !27, line: 49, baseType: !725, size: 1600)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigjmp_buf", file: !726, line: 83, baseType: !727)
!726 = !DIFile(filename: "/usr/include/setjmp.h", directory: "", checksumkind: CSK_MD5, checksum: "76b05e9ee1ce4e0a46e91c06a0fc7c7a")
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 1600, elements: !160)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !726, line: 33, size: 1600, elements: !729)
!729 = !{!730, !736, !737}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !728, file: !726, line: 39, baseType: !731, size: 512)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !732, line: 31, baseType: !733)
!732 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "", checksumkind: CSK_MD5, checksum: "45ab2ca18833449ad9660bc3075914aa")
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 512, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 8)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !728, file: !726, line: 40, baseType: !73, size: 32, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !728, file: !726, line: 41, baseType: !738, size: 1024, offset: 576)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !739, line: 8, baseType: !740)
!739 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !739, line: 5, size: 1024, elements: !741)
!741 = !{!742}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !740, file: !739, line: 7, baseType: !743, size: 1024)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 1024, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 16)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "je_prev", scope: !722, file: !27, line: 50, baseType: !747, size: 64, offset: 1600)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "je_ret", scope: !722, file: !27, line: 55, baseType: !73, size: 32, offset: 1664)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "je_mustcatch", scope: !722, file: !27, line: 56, baseType: !343, size: 8, offset: 1696)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "blku_loop", scope: !693, file: !27, line: 852, baseType: !751, size: 320)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_loop", file: !27, line: 756, size: 320, elements: !752)
!752 = !{!753, !754, !778, !784}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "resetsp", scope: !751, file: !27, line: 757, baseType: !157, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "my_op", scope: !751, file: !27, line: 758, baseType: !755, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "LOOP", file: !33, line: 2628, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !311, line: 422, size: 640, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !757, file: !311, line: 423, baseType: !308, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !757, file: !311, line: 423, baseType: !308, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !757, file: !311, line: 423, baseType: !316, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !757, file: !311, line: 423, baseType: !320, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !757, file: !311, line: 423, baseType: !5, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !757, file: !311, line: 423, baseType: !5, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !757, file: !311, line: 423, baseType: !5, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !757, file: !311, line: 423, baseType: !5, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !757, file: !311, line: 423, baseType: !5, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !757, file: !311, line: 423, baseType: !5, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !757, file: !311, line: 423, baseType: !5, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !757, file: !311, line: 423, baseType: !5, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !757, file: !311, line: 423, baseType: !267, size: 8, offset: 272)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !757, file: !311, line: 423, baseType: !267, size: 8, offset: 280)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "op_first", scope: !757, file: !311, line: 424, baseType: !308, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "op_last", scope: !757, file: !311, line: 425, baseType: !308, size: 64, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "op_redoop", scope: !757, file: !311, line: 426, baseType: !308, size: 64, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "op_nextop", scope: !757, file: !311, line: 427, baseType: !308, size: 64, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "op_lastop", scope: !757, file: !311, line: 428, baseType: !308, size: 64, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "itervar_u", scope: !751, file: !27, line: 763, baseType: !779, size: 64, offset: 128)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !751, file: !27, line: 759, size: 64, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "svp", scope: !779, file: !27, line: 760, baseType: !142, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "gv", scope: !779, file: !27, line: 761, baseType: !218, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "oldcomppad", scope: !779, file: !27, line: 762, baseType: !378, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "state_u", scope: !751, file: !27, line: 777, baseType: !785, size: 128, offset: 192)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !751, file: !27, line: 764, size: 128, elements: !786)
!786 = !{!787, !792, !797}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ary", scope: !785, file: !27, line: 768, baseType: !788, size: 128)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !785, file: !27, line: 765, size: 128, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ary", scope: !788, file: !27, line: 766, baseType: !31, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ix", scope: !788, file: !27, line: 767, baseType: !91, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lazyiv", scope: !785, file: !27, line: 772, baseType: !793, size: 128)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !785, file: !27, line: 769, size: 128, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !793, file: !27, line: 770, baseType: !91, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !793, file: !27, line: 771, baseType: !91, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lazysv", scope: !785, file: !27, line: 776, baseType: !798, size: 128)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !785, file: !27, line: 773, size: 128, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !798, file: !27, line: 774, baseType: !74, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !798, file: !27, line: 775, baseType: !74, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "blku_givwhen", scope: !693, file: !27, line: 853, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_givwhen", file: !27, line: 828, size: 64, elements: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "leave_op", scope: !803, file: !27, line: 829, baseType: !308, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "cx_subst", scope: !603, file: !27, line: 970, baseType: !807, size: 704)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "subst", file: !27, line: 911, size: 704, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_type", scope: !807, file: !27, line: 912, baseType: !267, size: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_rflags", scope: !807, file: !27, line: 913, baseType: !267, size: 8, offset: 8)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_rxtainted", scope: !807, file: !27, line: 914, baseType: !553, size: 16, offset: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_oldsave", scope: !807, file: !27, line: 915, baseType: !157, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_iters", scope: !807, file: !27, line: 916, baseType: !372, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_maxiters", scope: !807, file: !27, line: 917, baseType: !372, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_orig", scope: !807, file: !27, line: 918, baseType: !88, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_dstr", scope: !807, file: !27, line: 919, baseType: !74, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_targ", scope: !807, file: !27, line: 920, baseType: !74, size: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_s", scope: !807, file: !27, line: 921, baseType: !88, size: 64, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_m", scope: !807, file: !27, line: 922, baseType: !88, size: 64, offset: 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_strend", scope: !807, file: !27, line: 923, baseType: !88, size: 64, offset: 512)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_rxres", scope: !807, file: !27, line: 924, baseType: !79, size: 64, offset: 576)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sbu_rx", scope: !807, file: !27, line: 925, baseType: !125, size: 64, offset: 640)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "si_prev", scope: !28, file: !27, line: 1119, baseType: !824, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "si_next", scope: !28, file: !27, line: 1120, baseType: !824, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "si_cxix", scope: !28, file: !27, line: 1121, baseType: !157, size: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "si_cxmax", scope: !28, file: !27, line: 1122, baseType: !157, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "si_type", scope: !28, file: !27, line: 1123, baseType: !157, size: 32, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "si_markoff", scope: !28, file: !27, line: 1124, baseType: !157, size: 32, offset: 352)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvhv_aux", file: !51, line: 102, size: 448, elements: !834)
!834 = !{!835, !841, !842, !843, !844, !845, !870, !871, !872, !873}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_name_u", scope: !833, file: !51, line: 103, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xhvnameu", file: !51, line: 97, size: 64, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "xhvnameu_name", scope: !836, file: !51, line: 98, baseType: !151, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "xhvnameu_names", scope: !836, file: !51, line: 99, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_backreferences", scope: !833, file: !51, line: 104, baseType: !31, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_eiter", scope: !833, file: !51, line: 105, baseType: !145, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_riter", scope: !833, file: !51, line: 106, baseType: !157, size: 32, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_name_count", scope: !833, file: !51, line: 114, baseType: !157, size: 32, offset: 224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_mro_meta", scope: !833, file: !51, line: 115, baseType: !846, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mro_meta", file: !51, line: 72, size: 512, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !867, !868, !869}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mro_linear_all", scope: !847, file: !51, line: 74, baseType: !43, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mro_linear_current", scope: !847, file: !51, line: 78, baseType: !74, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mro_nextmethod", scope: !847, file: !51, line: 79, baseType: !43, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "cache_gen", scope: !847, file: !51, line: 80, baseType: !81, size: 32, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_gen", scope: !847, file: !51, line: 81, baseType: !81, size: 32, offset: 224)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mro_which", scope: !847, file: !51, line: 82, baseType: !855, size: 64, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mro_alg", file: !51, line: 64, size: 192, elements: !858)
!858 = !{!859, !863, !864, !865, !866}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !857, file: !51, line: 65, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!31, !43, !81}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !857, file: !51, line: 66, baseType: !424, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !857, file: !51, line: 67, baseType: !553, size: 16, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "kflags", scope: !857, file: !51, line: 68, baseType: !553, size: 16, offset: 144)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !857, file: !51, line: 69, baseType: !81, size: 32, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !847, file: !51, line: 83, baseType: !43, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "super", scope: !847, file: !51, line: 84, baseType: !43, size: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_gen", scope: !847, file: !51, line: 85, baseType: !81, size: 32, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_rand", scope: !833, file: !51, line: 117, baseType: !81, size: 32, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_last_rand", scope: !833, file: !51, line: 118, baseType: !81, size: 32, offset: 352)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_fill_lazy", scope: !833, file: !51, line: 121, baseType: !81, size: 32, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_aux_flags", scope: !833, file: !51, line: 122, baseType: !81, size: 32, offset: 416)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO", file: !33, line: 2654, baseType: !176)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVMG", file: !33, line: 2663, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvmg", file: !4, line: 524, size: 384, elements: !879)
!879 = !{!880, !881, !882, !883, !888, !889}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !878, file: !4, line: 525, baseType: !43, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !878, file: !4, line: 525, baseType: !55, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !878, file: !4, line: 525, baseType: !108, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !878, file: !4, line: 525, baseType: !884, size: 64, offset: 192)
!884 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !878, file: !4, line: 525, size: 64, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !884, file: !4, line: 525, baseType: !108, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !884, file: !4, line: 525, baseType: !88, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !878, file: !4, line: 526, baseType: !192, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !878, file: !4, line: 527, baseType: !237, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPV", file: !33, line: 2659, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpv", file: !4, line: 499, size: 256, elements: !893)
!893 = !{!894, !895, !896, !897}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !892, file: !4, line: 500, baseType: !43, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !892, file: !4, line: 500, baseType: !55, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !892, file: !4, line: 500, baseType: !108, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !892, file: !4, line: 500, baseType: !898, size: 64, offset: 192)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !892, file: !4, line: 500, size: 64, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !898, file: !4, line: 500, baseType: !108, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !898, file: !4, line: 500, baseType: !88, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "svtype", file: !4, line: 153, baseType: !3)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADNAME", file: !33, line: 2684, baseType: !908)
