; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r/llvm-ir/544.nab_r_bc/src/prm.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/prm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.parm = type { [81 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, [3 x double], double, double, double, double, double, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.molecule_t = type { [4 x [3 x double]], i32, ptr, i32, i32, i32, ptr }
%struct.atom_t = type { ptr, ptr, i32, i32, [8 x i32], ptr, double, double, double, double, ptr, i32, double, double, i32, i32, ptr, [3 x double], double }

@.str = private unnamed_addr constant [38 x i8] c"%6d%6d%6d%6d%6d%6d%6d%6d%6d%6d%6d%6d\0A\00", align 1
@f9118 = dso_local local_unnamed_addr global ptr @.str, align 8, !dbg !0
@nabout = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [24 x i8] c"Reading .prm file (%s)\0A\00", align 1
@stderr = external local_unnamed_addr global ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "f9118", scope: !2, file: !127, line: 59, type: !119, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !124, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/544.nab_r/src/prm.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/544.nab_r", checksumkind: CSK_MD5, checksum: "f2bf473b3b02b3a545d0fe01a95ee58c")
!4 = !{!5, !6, !119, !120, !57, !123, !122, !13}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !8, line: 115, baseType: !9)
!8 = !DIFile(filename: "apps/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e6947e1b068a9350a45ab4ee56d7a2de")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !8, line: 95, size: 5760, elements: !10)
!10 = !{!11, !16, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !53, !54, !55, !56, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !79, !80, !81, !82, !83, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !9, file: !8, line: 96, baseType: !12, size: 648)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 648, elements: !14)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !{!15}
!15 = !DISubrange(count: 81)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !9, file: !8, line: 97, baseType: !17, size: 32, offset: 672)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !8, line: 6, baseType: !18)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !9, file: !8, line: 97, baseType: !17, size: 32, offset: 704)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !9, file: !8, line: 97, baseType: !17, size: 32, offset: 736)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !9, file: !8, line: 98, baseType: !17, size: 32, offset: 768)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !9, file: !8, line: 98, baseType: !17, size: 32, offset: 800)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !9, file: !8, line: 98, baseType: !17, size: 32, offset: 832)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !9, file: !8, line: 98, baseType: !17, size: 32, offset: 864)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !9, file: !8, line: 98, baseType: !17, size: 32, offset: 896)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !9, file: !8, line: 98, baseType: !17, size: 32, offset: 928)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !9, file: !8, line: 99, baseType: !17, size: 32, offset: 960)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !9, file: !8, line: 99, baseType: !17, size: 32, offset: 992)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !9, file: !8, line: 99, baseType: !17, size: 32, offset: 1024)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !9, file: !8, line: 99, baseType: !17, size: 32, offset: 1056)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !9, file: !8, line: 99, baseType: !17, size: 32, offset: 1088)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !9, file: !8, line: 99, baseType: !17, size: 32, offset: 1120)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !9, file: !8, line: 100, baseType: !17, size: 32, offset: 1152)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !9, file: !8, line: 100, baseType: !17, size: 32, offset: 1184)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !9, file: !8, line: 100, baseType: !17, size: 32, offset: 1216)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !9, file: !8, line: 100, baseType: !17, size: 32, offset: 1248)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !9, file: !8, line: 100, baseType: !17, size: 32, offset: 1280)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !9, file: !8, line: 100, baseType: !17, size: 32, offset: 1312)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !9, file: !8, line: 101, baseType: !17, size: 32, offset: 1344)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !9, file: !8, line: 101, baseType: !17, size: 32, offset: 1376)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !9, file: !8, line: 101, baseType: !17, size: 32, offset: 1408)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !9, file: !8, line: 101, baseType: !17, size: 32, offset: 1440)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !9, file: !8, line: 101, baseType: !17, size: 32, offset: 1472)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !9, file: !8, line: 101, baseType: !17, size: 32, offset: 1504)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !9, file: !8, line: 101, baseType: !17, size: 32, offset: 1536)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !9, file: !8, line: 101, baseType: !17, size: 32, offset: 1568)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !9, file: !8, line: 102, baseType: !17, size: 32, offset: 1600)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !9, file: !8, line: 102, baseType: !17, size: 32, offset: 1632)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !9, file: !8, line: 102, baseType: !17, size: 32, offset: 1664)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !9, file: !8, line: 103, baseType: !51, size: 64, offset: 1728)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !8, line: 17, baseType: !13)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !9, file: !8, line: 103, baseType: !51, size: 64, offset: 1792)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !9, file: !8, line: 103, baseType: !51, size: 64, offset: 1856)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !9, file: !8, line: 103, baseType: !51, size: 64, offset: 1920)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !9, file: !8, line: 104, baseType: !57, size: 64, offset: 1984)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !9, file: !8, line: 104, baseType: !57, size: 64, offset: 2048)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !9, file: !8, line: 104, baseType: !57, size: 64, offset: 2112)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !9, file: !8, line: 104, baseType: !57, size: 64, offset: 2176)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !9, file: !8, line: 104, baseType: !57, size: 64, offset: 2240)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !9, file: !8, line: 104, baseType: !57, size: 64, offset: 2304)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !9, file: !8, line: 104, baseType: !57, size: 64, offset: 2368)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !9, file: !8, line: 104, baseType: !57, size: 64, offset: 2432)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !9, file: !8, line: 104, baseType: !57, size: 64, offset: 2496)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !9, file: !8, line: 105, baseType: !57, size: 64, offset: 2560)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !9, file: !8, line: 105, baseType: !57, size: 64, offset: 2624)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !9, file: !8, line: 105, baseType: !57, size: 64, offset: 2688)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !9, file: !8, line: 105, baseType: !57, size: 64, offset: 2752)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !9, file: !8, line: 105, baseType: !57, size: 64, offset: 2816)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !9, file: !8, line: 105, baseType: !57, size: 64, offset: 2880)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !9, file: !8, line: 105, baseType: !57, size: 64, offset: 2944)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !9, file: !8, line: 106, baseType: !75, size: 192, offset: 3008)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 192, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !9, file: !8, line: 106, baseType: !58, size: 64, offset: 3200)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !9, file: !8, line: 106, baseType: !58, size: 64, offset: 3264)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !9, file: !8, line: 106, baseType: !58, size: 64, offset: 3328)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !9, file: !8, line: 106, baseType: !58, size: 64, offset: 3392)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !9, file: !8, line: 106, baseType: !58, size: 64, offset: 3456)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !9, file: !8, line: 107, baseType: !84, size: 64, offset: 3520)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !9, file: !8, line: 107, baseType: !84, size: 64, offset: 3584)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !9, file: !8, line: 107, baseType: !84, size: 64, offset: 3648)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !9, file: !8, line: 107, baseType: !84, size: 64, offset: 3712)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !9, file: !8, line: 107, baseType: !84, size: 64, offset: 3776)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !9, file: !8, line: 107, baseType: !84, size: 64, offset: 3840)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !9, file: !8, line: 108, baseType: !84, size: 64, offset: 3904)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !9, file: !8, line: 108, baseType: !84, size: 64, offset: 3968)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !9, file: !8, line: 108, baseType: !84, size: 64, offset: 4032)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !9, file: !8, line: 108, baseType: !84, size: 64, offset: 4096)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !9, file: !8, line: 108, baseType: !84, size: 64, offset: 4160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !9, file: !8, line: 108, baseType: !84, size: 64, offset: 4224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !9, file: !8, line: 109, baseType: !84, size: 64, offset: 4288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !9, file: !8, line: 109, baseType: !84, size: 64, offset: 4352)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !9, file: !8, line: 109, baseType: !84, size: 64, offset: 4416)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !9, file: !8, line: 109, baseType: !84, size: 64, offset: 4480)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !9, file: !8, line: 109, baseType: !84, size: 64, offset: 4544)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !9, file: !8, line: 110, baseType: !84, size: 64, offset: 4608)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !9, file: !8, line: 110, baseType: !84, size: 64, offset: 4672)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !9, file: !8, line: 110, baseType: !84, size: 64, offset: 4736)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !9, file: !8, line: 110, baseType: !84, size: 64, offset: 4800)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !9, file: !8, line: 110, baseType: !84, size: 64, offset: 4864)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !9, file: !8, line: 111, baseType: !84, size: 64, offset: 4928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !9, file: !8, line: 111, baseType: !84, size: 64, offset: 4992)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !9, file: !8, line: 111, baseType: !84, size: 64, offset: 5056)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !9, file: !8, line: 111, baseType: !84, size: 64, offset: 5120)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !9, file: !8, line: 111, baseType: !84, size: 64, offset: 5184)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !9, file: !8, line: 111, baseType: !84, size: 64, offset: 5248)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !9, file: !8, line: 112, baseType: !84, size: 64, offset: 5312)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !9, file: !8, line: 112, baseType: !84, size: 64, offset: 5376)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !9, file: !8, line: 112, baseType: !84, size: 64, offset: 5440)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !9, file: !8, line: 112, baseType: !84, size: 64, offset: 5504)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !9, file: !8, line: 113, baseType: !84, size: 64, offset: 5568)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !9, file: !8, line: 113, baseType: !84, size: 64, offset: 5632)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !9, file: !8, line: 114, baseType: !57, size: 64, offset: 5696)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 46, baseType: !122)
!121 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!122 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!124 = !{!0, !125, !131, !133, !135, !137, !139, !197}
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "e_msg", scope: !2, file: !127, line: 47, type: !128, isLocal: true, isDefinition: true)
!127 = !DIFile(filename: "apps/544.nab_r/src/prm.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "f2bf473b3b02b3a545d0fe01a95ee58c")
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2048, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 256)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "SsFormat", scope: !2, file: !127, line: 49, type: !12, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "SiOnLine", scope: !2, file: !127, line: 50, type: !18, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "SbWroteNothing", scope: !2, file: !127, line: 50, type: !18, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "SiPerLine", scope: !2, file: !127, line: 50, type: !18, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "SfFile", scope: !2, file: !127, line: 51, type: !141, isLocal: true, isDefinition: true)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 7, baseType: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !145, line: 49, size: 1728, elements: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !162, !164, !165, !166, !170, !172, !174, !178, !181, !183, !186, !189, !190, !191, !192, !193}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !144, file: !145, line: 51, baseType: !18, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !144, file: !145, line: 54, baseType: !119, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !144, file: !145, line: 55, baseType: !119, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !144, file: !145, line: 56, baseType: !119, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !144, file: !145, line: 57, baseType: !119, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !144, file: !145, line: 58, baseType: !119, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !144, file: !145, line: 59, baseType: !119, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !144, file: !145, line: 60, baseType: !119, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !144, file: !145, line: 61, baseType: !119, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !144, file: !145, line: 64, baseType: !119, size: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !144, file: !145, line: 65, baseType: !119, size: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !144, file: !145, line: 66, baseType: !119, size: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !144, file: !145, line: 68, baseType: !160, size: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !145, line: 36, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !144, file: !145, line: 70, baseType: !163, size: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !144, file: !145, line: 72, baseType: !18, size: 32, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !144, file: !145, line: 73, baseType: !18, size: 32, offset: 928)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !144, file: !145, line: 74, baseType: !167, size: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !168, line: 152, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!169 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !144, file: !145, line: 77, baseType: !171, size: 16, offset: 1024)
!171 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !144, file: !145, line: 78, baseType: !173, size: 8, offset: 1040)
!173 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !144, file: !145, line: 79, baseType: !175, size: 8, offset: 1048)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 1)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !144, file: !145, line: 81, baseType: !179, size: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !145, line: 43, baseType: null)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !144, file: !145, line: 89, baseType: !182, size: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !168, line: 153, baseType: !169)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !144, file: !145, line: 91, baseType: !184, size: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !145, line: 37, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !144, file: !145, line: 92, baseType: !187, size: 64, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !145, line: 38, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !144, file: !145, line: 93, baseType: !163, size: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !144, file: !145, line: 94, baseType: !5, size: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !144, file: !145, line: 95, baseType: !120, size: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !144, file: !145, line: 96, baseType: !18, size: 32, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !144, file: !145, line: 98, baseType: !194, size: 160, offset: 1568)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 20)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "compressed", scope: !2, file: !127, line: 46, type: !18, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!200 = !{i32 7, !"Dwarf Version", i32 5}
!201 = !{i32 2, !"Debug Info Version", i32 3}
!202 = !{i32 1, !"wchar_size", i32 4}
!203 = !{i32 7, !"PIC Level", i32 2}
!204 = !{i32 7, !"PIE Level", i32 2}
!205 = !{i32 7, !"uwtable", i32 2}
!206 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!207 = distinct !DISubprogram(name: "ggets", scope: !127, file: !127, line: 71, type: !208, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !210)
!208 = !DISubroutineType(types: !209)
!209 = !{!119, !119, !18, !141}
!210 = !{!211, !212, !213, !214, !215}
!211 = !DILocalVariable(name: "line", arg: 1, scope: !207, file: !127, line: 71, type: !119)
!212 = !DILocalVariable(name: "count", arg: 2, scope: !207, file: !127, line: 71, type: !18)
!213 = !DILocalVariable(name: "file", arg: 3, scope: !207, file: !127, line: 71, type: !141)
!214 = !DILocalVariable(name: "result", scope: !207, file: !127, line: 73, type: !119)
!215 = !DILocalVariable(name: "inul", scope: !207, file: !127, line: 74, type: !18)
!216 = !DILocation(line: 0, scope: !207)
!217 = !DILocation(line: 82, column: 8, scope: !218)
!218 = distinct !DILexicalBlock(scope: !207, file: !127, line: 82, column: 8)
!219 = !DILocation(line: 82, column: 23, scope: !218)
!220 = !DILocation(line: 82, column: 8, scope: !207)
!221 = !DILocation(line: 83, column: 16, scope: !222)
!222 = distinct !DILexicalBlock(scope: !218, file: !127, line: 82, column: 29)
!223 = !DILocation(line: 84, column: 18, scope: !224)
!224 = distinct !DILexicalBlock(scope: !222, file: !127, line: 84, column: 11)
!225 = !DILocation(line: 0, scope: !226)
!226 = distinct !DILexicalBlock(scope: !207, file: !127, line: 101, column: 8)
!227 = !DILocation(line: 111, column: 1, scope: !207)
!228 = !DISubprogram(name: "get_mytaskid", scope: !127, file: !127, line: 61, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{!18}
!231 = !{}
!232 = !DISubprogram(name: "fgets", scope: !233, file: !233, line: 564, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !231)
!233 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!234 = !DISubroutineType(types: !235)
!235 = !{!119, !236, !18, !237}
!236 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !119)
!237 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !141)
!238 = distinct !DISubprogram(name: "readparm", scope: !127, file: !127, line: 399, type: !239, scopeLine: 401, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !343)
!239 = !DISubroutineType(types: !240)
!240 = !{!18, !241, !119}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !8, line: 126, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !8, line: 118, size: 1088, elements: !244)
!244 = !{!245, !250, !251, !339, !340, !341, !342}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !243, file: !8, line: 119, baseType: !246, size: 768)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !8, line: 13, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 768, elements: !248)
!248 = !{!249, !77}
!249 = !DISubrange(count: 4)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !243, file: !8, line: 120, baseType: !17, size: 32, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !243, file: !8, line: 121, baseType: !252, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !8, line: 93, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !8, line: 84, size: 384, elements: !255)
!255 = !{!256, !257, !258, !259, !261, !263, !264, !265}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !254, file: !8, line: 85, baseType: !51, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !254, file: !8, line: 86, baseType: !17, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !254, file: !8, line: 87, baseType: !17, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !254, file: !8, line: 88, baseType: !260, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !254, file: !8, line: 89, baseType: !262, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !254, file: !8, line: 90, baseType: !17, size: 32, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !254, file: !8, line: 91, baseType: !17, size: 32, offset: 288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !254, file: !8, line: 92, baseType: !266, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !8, line: 82, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !8, line: 63, size: 1024, elements: !270)
!270 = !{!271, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !292, !293, !299, !300, !309, !310, !311}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !269, file: !8, line: 64, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !269, file: !8, line: 65, baseType: !17, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !269, file: !8, line: 66, baseType: !17, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !269, file: !8, line: 67, baseType: !17, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !269, file: !8, line: 68, baseType: !51, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !269, file: !8, line: 69, baseType: !51, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !269, file: !8, line: 70, baseType: !17, size: 32, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !269, file: !8, line: 71, baseType: !17, size: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !269, file: !8, line: 72, baseType: !17, size: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !269, file: !8, line: 73, baseType: !262, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !269, file: !8, line: 74, baseType: !283, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !8, line: 52, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !8, line: 47, size: 192, elements: !286)
!286 = !{!287, !289, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !285, file: !8, line: 48, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !285, file: !8, line: 49, baseType: !17, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !285, file: !8, line: 50, baseType: !17, size: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !285, file: !8, line: 51, baseType: !17, size: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !269, file: !8, line: 75, baseType: !17, size: 32, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !269, file: !8, line: 76, baseType: !294, size: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !8, line: 54, baseType: !296)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !269, file: !8, line: 77, baseType: !17, size: 32, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !269, file: !8, line: 78, baseType: !301, size: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !8, line: 61, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !8, line: 58, size: 192, elements: !304)
!304 = !{!305, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !303, file: !8, line: 59, baseType: !306, size: 128)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !307)
!307 = !{!249}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !303, file: !8, line: 60, baseType: !58, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !269, file: !8, line: 79, baseType: !17, size: 32, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !269, file: !8, line: 80, baseType: !84, size: 64, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !269, file: !8, line: 81, baseType: !312, size: 64, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !8, line: 45, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !8, line: 25, size: 1408, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !338}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !314, file: !8, line: 26, baseType: !51, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !314, file: !8, line: 27, baseType: !51, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !314, file: !8, line: 28, baseType: !17, size: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !314, file: !8, line: 29, baseType: !17, size: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !314, file: !8, line: 30, baseType: !321, size: 256, offset: 192)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 256, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 8)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !314, file: !8, line: 31, baseType: !272, size: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !314, file: !8, line: 32, baseType: !58, size: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !314, file: !8, line: 33, baseType: !58, size: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !314, file: !8, line: 34, baseType: !58, size: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !314, file: !8, line: 35, baseType: !58, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !314, file: !8, line: 36, baseType: !51, size: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !314, file: !8, line: 37, baseType: !17, size: 32, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !314, file: !8, line: 38, baseType: !58, size: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !314, file: !8, line: 39, baseType: !58, size: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !314, file: !8, line: 40, baseType: !17, size: 32, offset: 1024)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !314, file: !8, line: 41, baseType: !17, size: 32, offset: 1056)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !314, file: !8, line: 42, baseType: !51, size: 64, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !314, file: !8, line: 43, baseType: !337, size: 192, offset: 1152)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !8, line: 12, baseType: !75)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !314, file: !8, line: 44, baseType: !58, size: 64, offset: 1344)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !243, file: !8, line: 122, baseType: !17, size: 32, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !243, file: !8, line: 123, baseType: !17, size: 32, offset: 928)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !243, file: !8, line: 124, baseType: !17, size: 32, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !243, file: !8, line: 125, baseType: !6, size: 64, offset: 1024)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!344 = !DILocalVariable(name: "mol", arg: 1, scope: !238, file: !127, line: 399, type: !241)
!345 = !DILocalVariable(name: "name", arg: 2, scope: !238, file: !127, line: 399, type: !119)
!346 = !DILocalVariable(name: "H", scope: !238, file: !127, line: 402, type: !57)
!347 = !DILocalVariable(name: "atype", scope: !238, file: !127, line: 402, type: !57)
!348 = !DILocalVariable(name: "sigmaw3", scope: !238, file: !127, line: 402, type: !58)
!349 = !DILocalVariable(name: "sigma_iw6", scope: !238, file: !127, line: 402, type: !58)
!350 = !DILocalVariable(name: "epsilon_iw", scope: !238, file: !127, line: 402, type: !58)
!351 = !DILocalVariable(name: "si_tmp", scope: !238, file: !127, line: 403, type: !58)
!352 = !DILocalVariable(name: "i", scope: !238, file: !127, line: 404, type: !18)
!353 = !DILocalVariable(name: "j", scope: !238, file: !127, line: 404, type: !18)
!354 = !DILocalVariable(name: "k", scope: !238, file: !127, line: 404, type: !18)
!355 = !DILocalVariable(name: "idum", scope: !238, file: !127, line: 404, type: !18)
!356 = !DILocalVariable(name: "res", scope: !238, file: !127, line: 404, type: !18)
!357 = !DILocalVariable(name: "ifpert", scope: !238, file: !127, line: 404, type: !18)
!358 = !DILocalVariable(name: "iat", scope: !238, file: !127, line: 404, type: !18)
!359 = !DILocalVariable(name: "kat", scope: !238, file: !127, line: 404, type: !18)
!360 = !DILocalVariable(name: "lat", scope: !238, file: !127, line: 404, type: !18)
!361 = !DILocalVariable(name: "newparm", scope: !238, file: !127, line: 404, type: !18)
!362 = !DILocalVariable(name: "ier", scope: !238, file: !127, line: 404, type: !18)
!363 = !DILocalVariable(name: "iaci", scope: !238, file: !127, line: 404, type: !18)
!364 = !DILocalVariable(name: "ismall", scope: !238, file: !127, line: 405, type: !18)
!365 = !DILocalVariable(name: "ibig", scope: !238, file: !127, line: 405, type: !18)
!366 = !DILocalVariable(name: "iptmp", scope: !238, file: !127, line: 406, type: !123)
!367 = !DILocalVariable(name: "file", scope: !238, file: !127, line: 407, type: !141)
!368 = !DILocalVariable(name: "prm", scope: !238, file: !127, line: 408, type: !6)
!369 = !DILocalVariable(name: "line", scope: !238, file: !127, line: 409, type: !12)
!370 = !DILocalVariable(name: "atsymb", scope: !238, file: !127, line: 410, type: !13)
!371 = !DILocalVariable(name: "atsymbp", scope: !238, file: !127, line: 410, type: !13)
!372 = !DILocalVariable(name: "i10_12", scope: !238, file: !127, line: 411, type: !18)
!373 = !DILocalVariable(name: "ai", scope: !238, file: !127, line: 413, type: !18)
!374 = !DILocalVariable(name: "a", scope: !238, file: !127, line: 414, type: !312)
!375 = !DILocation(line: 0, scope: !238)
!376 = !DILocation(line: 404, column: 4, scope: !238)
!377 = !DILocation(line: 409, column: 4, scope: !238)
!378 = !DILocation(line: 409, column: 9, scope: !238)
!379 = !DILocation(line: 419, column: 8, scope: !380)
!380 = distinct !DILexicalBlock(scope: !238, file: !127, line: 419, column: 8)
!381 = !DILocation(line: 419, column: 23, scope: !380)
!382 = !DILocation(line: 419, column: 8, scope: !238)
!383 = !DILocation(line: 420, column: 15, scope: !384)
!384 = distinct !DILexicalBlock(scope: !380, file: !127, line: 419, column: 29)
!385 = !{!386, !386, i64 0}
!386 = !{!"any pointer", !387, i64 0}
!387 = !{!"omnipotent char", !388, i64 0}
!388 = !{!"Simple C/C++ TBAA"}
!389 = !DILocation(line: 420, column: 7, scope: !384)
!390 = !DILocation(line: 421, column: 4, scope: !384)
!391 = !DILocalVariable(name: "name", arg: 1, scope: !392, file: !127, line: 169, type: !119)
!392 = distinct !DISubprogram(name: "genopen", scope: !127, file: !127, line: 169, type: !393, scopeLine: 170, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !395)
!393 = !DISubroutineType(types: !394)
!394 = !{!141, !119}
!395 = !{!391, !396, !432, !436, !437, !438, !439}
!396 = !DILocalVariable(name: "buf", scope: !392, file: !127, line: 171, type: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !398, line: 46, size: 1152, elements: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "f8d5b541c4f89219f8e8ff8c3e2940d9")
!399 = !{!400, !402, !404, !406, !409, !411, !413, !414, !415, !416, !418, !420, !428, !429, !430}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !397, file: !398, line: 48, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !168, line: 145, baseType: !122)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !397, file: !398, line: 53, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !168, line: 148, baseType: !122)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !397, file: !398, line: 61, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !168, line: 151, baseType: !122)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !397, file: !398, line: 62, baseType: !407, size: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !168, line: 150, baseType: !408)
!408 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !397, file: !398, line: 64, baseType: !410, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !168, line: 146, baseType: !408)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !397, file: !398, line: 65, baseType: !412, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !168, line: 147, baseType: !408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !397, file: !398, line: 67, baseType: !18, size: 32, offset: 288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !397, file: !398, line: 69, baseType: !401, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !397, file: !398, line: 74, baseType: !167, size: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !397, file: !398, line: 78, baseType: !417, size: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !168, line: 174, baseType: !169)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !397, file: !398, line: 80, baseType: !419, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !168, line: 179, baseType: !169)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !397, file: !398, line: 91, baseType: !421, size: 128, offset: 576)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !422, line: 10, size: 128, elements: !423)
!422 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!423 = !{!424, !426}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !421, file: !422, line: 12, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !168, line: 160, baseType: !169)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !421, file: !422, line: 16, baseType: !427, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !168, line: 196, baseType: !169)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !397, file: !398, line: 92, baseType: !421, size: 128, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !397, file: !398, line: 93, baseType: !421, size: 128, offset: 832)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !397, file: !398, line: 106, baseType: !431, size: 192, offset: 960)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 192, elements: !76)
!432 = !DILocalVariable(name: "cbuf", scope: !392, file: !127, line: 172, type: !433)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 960, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 120)
!436 = !DILocalVariable(name: "pcmd", scope: !392, file: !127, line: 172, type: !433)
!437 = !DILocalVariable(name: "length", scope: !392, file: !127, line: 173, type: !18)
!438 = !DILocalVariable(name: "ier", scope: !392, file: !127, line: 173, type: !18)
!439 = !DILocalVariable(name: "fp", scope: !392, file: !127, line: 174, type: !141)
!440 = !DILocation(line: 0, scope: !392, inlinedAt: !441)
!441 = distinct !DILocation(line: 423, column: 16, scope: !442)
!442 = distinct !DILexicalBlock(scope: !238, file: !127, line: 423, column: 8)
!443 = !DILocation(line: 171, column: 16, scope: !392, inlinedAt: !441)
!444 = !DILocation(line: 172, column: 4, scope: !392, inlinedAt: !441)
!445 = !DILocation(line: 172, column: 9, scope: !392, inlinedAt: !441)
!446 = !DILocation(line: 172, column: 20, scope: !392, inlinedAt: !441)
!447 = !DILocation(line: 178, column: 4, scope: !392, inlinedAt: !441)
!448 = !DILocation(line: 244, column: 11, scope: !449, inlinedAt: !441)
!449 = distinct !DILexicalBlock(scope: !450, file: !127, line: 244, column: 11)
!450 = distinct !DILexicalBlock(scope: !392, file: !127, line: 241, column: 5)
!451 = !DILocation(line: 244, column: 26, scope: !449, inlinedAt: !441)
!452 = !DILocation(line: 244, column: 11, scope: !450, inlinedAt: !441)
!453 = !DILocation(line: 245, column: 20, scope: !454, inlinedAt: !441)
!454 = distinct !DILexicalBlock(scope: !455, file: !127, line: 245, column: 14)
!455 = distinct !DILexicalBlock(scope: !449, file: !127, line: 244, column: 32)
!456 = !DILocation(line: 245, column: 38, scope: !454, inlinedAt: !441)
!457 = !DILocation(line: 245, column: 14, scope: !455, inlinedAt: !441)
!458 = !DILocation(line: 246, column: 13, scope: !459, inlinedAt: !441)
!459 = distinct !DILexicalBlock(scope: !454, file: !127, line: 245, column: 47)
!460 = !DILocation(line: 248, column: 10, scope: !459, inlinedAt: !441)
!461 = !DILocation(line: 0, scope: !450, inlinedAt: !441)
!462 = !DILocation(line: 250, column: 7, scope: !450, inlinedAt: !441)
!463 = !DILocation(line: 254, column: 11, scope: !464, inlinedAt: !441)
!464 = distinct !DILexicalBlock(scope: !450, file: !127, line: 254, column: 11)
!465 = !DILocation(line: 254, column: 26, scope: !464, inlinedAt: !441)
!466 = !DILocation(line: 254, column: 11, scope: !450, inlinedAt: !441)
!467 = !DILocation(line: 259, column: 1, scope: !392, inlinedAt: !441)
!468 = !DILocation(line: 423, column: 31, scope: !442)
!469 = !DILocation(line: 423, column: 8, scope: !238)
!470 = !DILocation(line: 424, column: 11, scope: !471)
!471 = distinct !DILexicalBlock(scope: !472, file: !127, line: 424, column: 11)
!472 = distinct !DILexicalBlock(scope: !442, file: !127, line: 423, column: 40)
!473 = !DILocation(line: 424, column: 26, scope: !471)
!474 = !DILocation(line: 424, column: 11, scope: !472)
!475 = !DILocation(line: 425, column: 18, scope: !476)
!476 = distinct !DILexicalBlock(scope: !471, file: !127, line: 424, column: 32)
!477 = !DILocation(line: 425, column: 10, scope: !476)
!478 = !DILocation(line: 427, column: 7, scope: !476)
!479 = !DILocation(line: 429, column: 4, scope: !238)
!480 = !DILocalVariable(name: "size", arg: 1, scope: !481, file: !127, line: 293, type: !120)
!481 = distinct !DISubprogram(name: "get", scope: !127, file: !127, line: 293, type: !482, scopeLine: 295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{!119, !120}
!484 = !{!480, !485}
