; ModuleID = '/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/molutil.c'
source_filename = "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/molutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.extbond_t = type { %struct.extbond_t*, i32, i32, i32 }
%struct.chiral_t = type { [4 x i32], double }
%struct.atom_t = type { i8*, i8*, i32, i32, [8 x i32], %struct.residue_t*, double, double, double, double, i8*, i32, double, double, i32, i32, i8*, [3 x double], double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "e_msg", scope: !2, file: !239, line: 25, type: !433, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !343, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/molutil.c", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Transformation-Pass/Vectorizer-Pass/test/spec codes")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !237, !238, !244, !38, !242, !55, !248, !72, !251, !254, !257, !260, !263, !266, !36, !269, !270, !276, !278, !102, !279, !280, !338}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !24, line: 126, baseType: !25)
!24 = !DIFile(filename: "Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !24, line: 118, size: 1088, elements: !26)
!26 = !{!27, !34, !37, !131, !132, !133, !134}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !25, file: !24, line: 119, baseType: !28, size: 768)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !24, line: 13, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 768, elements: !31)
!30 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!31 = !{!32, !33}
!32 = !DISubrange(count: 4)
!33 = !DISubrange(count: 3)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !25, file: !24, line: 120, baseType: !35, size: 32, offset: 768)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !24, line: 6, baseType: !36)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !25, file: !24, line: 121, baseType: !38, size: 64, offset: 832)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !24, line: 93, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !24, line: 84, size: 384, elements: !41)
!41 = !{!42, !46, !47, !48, !50, !52, !53, !54}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !40, file: !24, line: 85, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !24, line: 17, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !40, file: !24, line: 86, baseType: !35, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !40, file: !24, line: 87, baseType: !35, size: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !40, file: !24, line: 88, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !40, file: !24, line: 89, baseType: !51, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !40, file: !24, line: 90, baseType: !35, size: 32, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !40, file: !24, line: 91, baseType: !35, size: 32, offset: 288)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !40, file: !24, line: 92, baseType: !55, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !24, line: 82, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !24, line: 63, size: 1024, elements: !59)
!59 = !{!60, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !81, !82, !88, !89, !98, !99, !101}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !58, file: !24, line: 64, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !58, file: !24, line: 65, baseType: !35, size: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !58, file: !24, line: 66, baseType: !35, size: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !58, file: !24, line: 67, baseType: !35, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !58, file: !24, line: 68, baseType: !43, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !58, file: !24, line: 69, baseType: !43, size: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !58, file: !24, line: 70, baseType: !35, size: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !58, file: !24, line: 71, baseType: !35, size: 32, offset: 352)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !58, file: !24, line: 72, baseType: !35, size: 32, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !58, file: !24, line: 73, baseType: !51, size: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !58, file: !24, line: 74, baseType: !72, size: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !24, line: 52, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !24, line: 47, size: 192, elements: !75)
!75 = !{!76, !78, !79, !80}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !74, file: !24, line: 48, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !74, file: !24, line: 49, baseType: !35, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !74, file: !24, line: 50, baseType: !35, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !74, file: !24, line: 51, baseType: !35, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !58, file: !24, line: 75, baseType: !35, size: 32, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !58, file: !24, line: 76, baseType: !83, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !24, line: 54, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 2)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !58, file: !24, line: 77, baseType: !35, size: 32, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !58, file: !24, line: 78, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !24, line: 61, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !24, line: 58, size: 192, elements: !93)
!93 = !{!94, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !92, file: !24, line: 59, baseType: !95, size: 128)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !96)
!96 = !{!32}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !92, file: !24, line: 60, baseType: !30, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !58, file: !24, line: 79, baseType: !35, size: 32, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !58, file: !24, line: 80, baseType: !100, size: 64, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !58, file: !24, line: 81, baseType: !102, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !24, line: 45, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !24, line: 25, size: 1408, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !130}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !104, file: !24, line: 26, baseType: !43, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !104, file: !24, line: 27, baseType: !43, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !104, file: !24, line: 28, baseType: !35, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !104, file: !24, line: 29, baseType: !35, size: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !104, file: !24, line: 30, baseType: !111, size: 256, offset: 192)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 256, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 8)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !104, file: !24, line: 31, baseType: !61, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !104, file: !24, line: 32, baseType: !30, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !104, file: !24, line: 33, baseType: !30, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !104, file: !24, line: 34, baseType: !30, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !104, file: !24, line: 35, baseType: !30, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !104, file: !24, line: 36, baseType: !43, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !104, file: !24, line: 37, baseType: !35, size: 32, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !104, file: !24, line: 38, baseType: !30, size: 64, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !104, file: !24, line: 39, baseType: !30, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !104, file: !24, line: 40, baseType: !35, size: 32, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !104, file: !24, line: 41, baseType: !35, size: 32, offset: 1056)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !104, file: !24, line: 42, baseType: !43, size: 64, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !104, file: !24, line: 43, baseType: !127, size: 192, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !24, line: 12, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 192, elements: !129)
!129 = !{!33}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !104, file: !24, line: 44, baseType: !30, size: 64, offset: 1344)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !25, file: !24, line: 122, baseType: !35, size: 32, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !25, file: !24, line: 123, baseType: !35, size: 32, offset: 928)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !25, file: !24, line: 124, baseType: !35, size: 32, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !25, file: !24, line: 125, baseType: !135, size: 64, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !24, line: 115, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !24, line: 95, size: 5760, elements: !138)
!138 = !{!139, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !137, file: !24, line: 96, baseType: !140, size: 648)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 648, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 81)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !137, file: !24, line: 97, baseType: !35, size: 32, offset: 672)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !137, file: !24, line: 97, baseType: !35, size: 32, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !137, file: !24, line: 97, baseType: !35, size: 32, offset: 736)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 800)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 864)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !137, file: !24, line: 98, baseType: !35, size: 32, offset: 928)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 992)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 1056)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !137, file: !24, line: 99, baseType: !35, size: 32, offset: 1120)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1152)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1184)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1216)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1248)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !137, file: !24, line: 100, baseType: !35, size: 32, offset: 1312)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1376)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1440)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1504)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !137, file: !24, line: 101, baseType: !35, size: 32, offset: 1568)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !137, file: !24, line: 102, baseType: !35, size: 32, offset: 1600)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !137, file: !24, line: 102, baseType: !35, size: 32, offset: 1632)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !137, file: !24, line: 102, baseType: !35, size: 32, offset: 1664)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !137, file: !24, line: 103, baseType: !43, size: 64, offset: 1728)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !137, file: !24, line: 103, baseType: !43, size: 64, offset: 1792)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !137, file: !24, line: 103, baseType: !43, size: 64, offset: 1856)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !137, file: !24, line: 103, baseType: !43, size: 64, offset: 1920)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 1984)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2112)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2176)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2240)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2304)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2368)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2432)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !137, file: !24, line: 104, baseType: !180, size: 64, offset: 2496)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2560)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2624)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2688)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2752)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2816)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2880)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !137, file: !24, line: 105, baseType: !180, size: 64, offset: 2944)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !137, file: !24, line: 106, baseType: !128, size: 192, offset: 3008)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3200)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3264)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3328)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3392)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !137, file: !24, line: 106, baseType: !30, size: 64, offset: 3456)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3520)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3584)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3648)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3712)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3776)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !137, file: !24, line: 107, baseType: !100, size: 64, offset: 3840)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 3904)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 3968)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 4032)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 4096)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 4160)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !137, file: !24, line: 108, baseType: !100, size: 64, offset: 4224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4352)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4416)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4480)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !137, file: !24, line: 109, baseType: !100, size: 64, offset: 4544)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4608)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4800)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !137, file: !24, line: 110, baseType: !100, size: 64, offset: 4864)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 4928)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 4992)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 5056)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 5120)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 5184)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !137, file: !24, line: 111, baseType: !100, size: 64, offset: 5248)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !137, file: !24, line: 112, baseType: !100, size: 64, offset: 5312)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !137, file: !24, line: 112, baseType: !100, size: 64, offset: 5376)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !137, file: !24, line: 112, baseType: !100, size: 64, offset: 5440)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !137, file: !24, line: 112, baseType: !100, size: 64, offset: 5504)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !137, file: !24, line: 113, baseType: !100, size: 64, offset: 5568)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !137, file: !24, line: 113, baseType: !100, size: 64, offset: 5632)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !137, file: !24, line: 114, baseType: !180, size: 64, offset: 5696)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!238 = !DISubprogram(name: "rt_errormsg_s", scope: !239, file: !239, line: 28, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!239 = !DIFile(filename: "Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/molutil.c", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation")
!240 = !DISubroutineType(types: !241)
!241 = !{!36, !36, !242, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!243 = !{}
!244 = !DISubprogram(name: "free", scope: !245, file: !245, line: 565, type: !246, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!245 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!246 = !DISubroutineType(types: !247)
!247 = !{null, !237}
!248 = !DISubprogram(name: "copyresidue", scope: !239, file: !239, line: 96, type: !249, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!249 = !DISubroutineType(types: !250)
!250 = !{!61, !61}
!251 = !DISubprogram(name: "upd_molnumbers", scope: !239, file: !239, line: 69, type: !252, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !49}
!254 = !DISubprogram(name: "select_atoms", scope: !239, file: !239, line: 29, type: !255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!255 = !DISubroutineType(types: !256)
!256 = !{!36, !49, !242}
!257 = !DISubprogram(name: "setpoint", scope: !239, file: !239, line: 30, type: !258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!258 = !DISubroutineType(types: !259)
!259 = !{!36, !49, !242, !180}
!260 = !DISubprogram(name: "distp", scope: !239, file: !239, line: 42, type: !261, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!261 = !DISubroutineType(types: !262)
!262 = !{!30, !180, !180}
!263 = !DISubprogram(name: "anglep", scope: !239, file: !239, line: 44, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!264 = !DISubroutineType(types: !265)
!265 = !{!30, !180, !180, !180}
!266 = !DISubprogram(name: "torsionp", scope: !239, file: !239, line: 46, type: !267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!267 = !DISubroutineType(types: !268)
!268 = !{!30, !180, !180, !180, !180}
!269 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!270 = !DISubprogram(name: "NAB_matcpy", scope: !239, file: !239, line: 79, type: !271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !237, !237}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1024, elements: !275)
!275 = !{!32, !32}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX_T", file: !24, line: 14, baseType: !274)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!279 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!280 = !DISubprogram(name: "fflush", scope: !281, file: !281, line: 218, type: !282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!281 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!282 = !DISubroutineType(types: !283)
!283 = !{!36, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !286, line: 49, size: 1728, elements: !287)
!286 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !303, !304, !305, !306, !309, !310, !312, !316, !319, !321, !324, !327, !328, !329, !333, !334}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !285, file: !286, line: 51, baseType: !36, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !285, file: !286, line: 54, baseType: !242, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !285, file: !286, line: 55, baseType: !242, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !285, file: !286, line: 56, baseType: !242, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !285, file: !286, line: 57, baseType: !242, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !285, file: !286, line: 58, baseType: !242, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !285, file: !286, line: 59, baseType: !242, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !285, file: !286, line: 60, baseType: !242, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !285, file: !286, line: 61, baseType: !242, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !285, file: !286, line: 64, baseType: !242, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !285, file: !286, line: 65, baseType: !242, size: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !285, file: !286, line: 66, baseType: !242, size: 64, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !285, file: !286, line: 68, baseType: !301, size: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !286, line: 36, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !285, file: !286, line: 70, baseType: !284, size: 64, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !285, file: !286, line: 72, baseType: !36, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !285, file: !286, line: 73, baseType: !36, size: 32, offset: 928)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !285, file: !286, line: 74, baseType: !307, size: 64, offset: 960)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !308, line: 152, baseType: !279)
!308 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !285, file: !286, line: 77, baseType: !269, size: 16, offset: 1024)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !285, file: !286, line: 78, baseType: !311, size: 8, offset: 1040)
!311 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !285, file: !286, line: 79, baseType: !313, size: 8, offset: 1048)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 1)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !285, file: !286, line: 81, baseType: !317, size: 64, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !286, line: 43, baseType: null)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !285, file: !286, line: 89, baseType: !320, size: 64, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !308, line: 153, baseType: !279)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !285, file: !286, line: 91, baseType: !322, size: 64, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !286, line: 37, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !285, file: !286, line: 92, baseType: !325, size: 64, offset: 1280)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !286, line: 38, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !285, file: !286, line: 93, baseType: !284, size: 64, offset: 1344)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !285, file: !286, line: 94, baseType: !237, size: 64, offset: 1408)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !285, file: !286, line: 95, baseType: !330, size: 64, offset: 1472)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !331, line: 46, baseType: !332)
!331 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!332 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !285, file: !286, line: 96, baseType: !36, size: 32, offset: 1536)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !285, file: !286, line: 98, baseType: !335, size: 160, offset: 1568)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 20)
!338 = !DISubprogram(name: "perror", scope: !281, file: !281, line: 775, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !243)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!343 = !{!344, !351, !361, !372, !380, !396, !407, !421, !0}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "rname", scope: !346, file: !239, line: 733, type: !242, isLocal: true, isDefinition: true)
!346 = distinct !DISubprogram(name: "getresname", scope: !239, file: !239, line: 731, type: !347, scopeLine: 732, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !349)
!347 = !DISubroutineType(types: !348)
!348 = !{!242, !56}
!349 = !{!350}
!350 = !DILocalVariable(name: "res", arg: 1, scope: !346, file: !239, line: 731, type: !56)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "rv_err", scope: !353, file: !239, line: 1117, type: !36, isLocal: true, isDefinition: true)
!353 = distinct !DISubprogram(name: "NAB_rri", scope: !239, file: !239, line: 1113, type: !354, scopeLine: 1114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !356)
!354 = !DISubroutineType(types: !355)
!355 = !{!278, !56, !242}
!356 = !{!357, !358, !359, !360}
!357 = !DILocalVariable(name: "res", arg: 1, scope: !353, file: !239, line: 1113, type: !56)
!358 = !DILocalVariable(name: "key", arg: 2, scope: !353, file: !239, line: 1113, type: !242)
!359 = !DILocalVariable(name: "sp", scope: !353, file: !239, line: 1115, type: !38)
!360 = !DILocalVariable(name: "mp", scope: !353, file: !239, line: 1116, type: !22)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "rv_err", scope: !363, file: !239, line: 1162, type: !36, isLocal: true, isDefinition: true)
!363 = distinct !DISubprogram(name: "NAB_ari", scope: !239, file: !239, line: 1160, type: !364, scopeLine: 1161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{!278, !102, !242}
!366 = !{!367, !368, !369, !370, !371}
!367 = !DILocalVariable(name: "ap", arg: 1, scope: !363, file: !239, line: 1160, type: !102)
!368 = !DILocalVariable(name: "key", arg: 2, scope: !363, file: !239, line: 1160, type: !242)
!369 = !DILocalVariable(name: "res", scope: !363, file: !239, line: 1163, type: !56)
!370 = !DILocalVariable(name: "sp", scope: !363, file: !239, line: 1164, type: !38)
!371 = !DILocalVariable(name: "mp", scope: !363, file: !239, line: 1165, type: !22)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "f", scope: !374, file: !239, line: 1212, type: !30, isLocal: true, isDefinition: true)
!374 = distinct !DISubprogram(name: "NAB_arf", scope: !239, file: !239, line: 1210, type: !375, scopeLine: 1211, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !377)
!375 = !DISubroutineType(types: !376)
!376 = !{!180, !102, !242}
!377 = !{!378, !379}
!378 = !DILocalVariable(name: "ap", arg: 1, scope: !374, file: !239, line: 1210, type: !102)
!379 = !DILocalVariable(name: "key", arg: 2, scope: !374, file: !239, line: 1210, type: !242)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
