; ModuleID = '/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/prm.c'
source_filename = "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/prm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.extbond_t = type { %struct.extbond_t*, i32, i32, i32 }
%struct.chiral_t = type { [4 x i32], double }
%struct.atom_t = type { i8*, i8*, i32, i32, [8 x i32], %struct.residue_t*, double, double, double, double, i8*, i32, double, double, i32, i32, i8*, [3 x double], double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "f9118", scope: !2, file: !7, line: 59, type: !15, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !243, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/prm.c", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Transformation-Pass/Vectorizer-Pass/test/spec codes")
!4 = !{}
!5 = !{!6, !11, !64, !74, !77, !15, !66, !126, !188, !189, !193, !198, !203, !223, !228, !231, !234, !68, !237, !238, !16, !239, !242}
!6 = !DISubprogram(name: "get_mytaskid", scope: !7, file: !7, line: 61, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/prm.c", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation")
!8 = !DISubroutineType(types: !9)
!9 = !{!10}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DISubprogram(name: "fgets", scope: !12, file: !12, line: 564, type: !13, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!12 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !15, !10, !17}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !19, line: 49, size: 1728, elements: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !36, !37, !38, !39, !43, !45, !47, !51, !54, !56, !59, !62, !63, !65, !69, !70}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !18, file: !19, line: 51, baseType: !10, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !18, file: !19, line: 54, baseType: !15, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !18, file: !19, line: 55, baseType: !15, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !18, file: !19, line: 56, baseType: !15, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !18, file: !19, line: 57, baseType: !15, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !18, file: !19, line: 58, baseType: !15, size: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !18, file: !19, line: 59, baseType: !15, size: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !18, file: !19, line: 60, baseType: !15, size: 64, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !18, file: !19, line: 61, baseType: !15, size: 64, offset: 512)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !18, file: !19, line: 64, baseType: !15, size: 64, offset: 576)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !18, file: !19, line: 65, baseType: !15, size: 64, offset: 640)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !18, file: !19, line: 66, baseType: !15, size: 64, offset: 704)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !18, file: !19, line: 68, baseType: !34, size: 64, offset: 768)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !19, line: 36, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !18, file: !19, line: 70, baseType: !17, size: 64, offset: 832)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !18, file: !19, line: 72, baseType: !10, size: 32, offset: 896)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !18, file: !19, line: 73, baseType: !10, size: 32, offset: 928)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !18, file: !19, line: 74, baseType: !40, size: 64, offset: 960)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !41, line: 152, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!42 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !18, file: !19, line: 77, baseType: !44, size: 16, offset: 1024)
!44 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !18, file: !19, line: 78, baseType: !46, size: 8, offset: 1040)
!46 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !18, file: !19, line: 79, baseType: !48, size: 8, offset: 1048)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 1)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !18, file: !19, line: 81, baseType: !52, size: 64, offset: 1088)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !19, line: 43, baseType: null)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !18, file: !19, line: 89, baseType: !55, size: 64, offset: 1152)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !41, line: 153, baseType: !42)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !18, file: !19, line: 91, baseType: !57, size: 64, offset: 1216)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !19, line: 37, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !18, file: !19, line: 92, baseType: !60, size: 64, offset: 1280)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !19, line: 38, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !18, file: !19, line: 93, baseType: !17, size: 64, offset: 1344)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !18, file: !19, line: 94, baseType: !64, size: 64, offset: 1408)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !18, file: !19, line: 95, baseType: !66, size: 64, offset: 1472)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 46, baseType: !68)
!67 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !18, file: !19, line: 96, baseType: !10, size: 32, offset: 1536)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !18, file: !19, line: 98, baseType: !71, size: 160, offset: 1568)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 20)
!74 = !DISubprogram(name: "reducerror", scope: !7, file: !7, line: 63, type: !75, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !10}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !79, line: 115, baseType: !80)
!79 = !DIFile(filename: "Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !79, line: 95, size: 5760, elements: !81)
!81 = !{!82, !86, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !122, !123, !124, !125, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !147, !148, !149, !150, !151, !152, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !80, file: !79, line: 96, baseType: !83, size: 648)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 648, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 81)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !80, file: !79, line: 97, baseType: !87, size: 32, offset: 672)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !79, line: 6, baseType: !10)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !80, file: !79, line: 97, baseType: !87, size: 32, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !80, file: !79, line: 97, baseType: !87, size: 32, offset: 736)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !80, file: !79, line: 98, baseType: !87, size: 32, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !80, file: !79, line: 98, baseType: !87, size: 32, offset: 800)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !80, file: !79, line: 98, baseType: !87, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !80, file: !79, line: 98, baseType: !87, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !80, file: !79, line: 98, baseType: !87, size: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !80, file: !79, line: 98, baseType: !87, size: 32, offset: 928)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !80, file: !79, line: 99, baseType: !87, size: 32, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !80, file: !79, line: 99, baseType: !87, size: 32, offset: 992)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !80, file: !79, line: 99, baseType: !87, size: 32, offset: 1024)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !80, file: !79, line: 99, baseType: !87, size: 32, offset: 1056)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !80, file: !79, line: 99, baseType: !87, size: 32, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !80, file: !79, line: 99, baseType: !87, size: 32, offset: 1120)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !80, file: !79, line: 100, baseType: !87, size: 32, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !80, file: !79, line: 100, baseType: !87, size: 32, offset: 1184)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !80, file: !79, line: 100, baseType: !87, size: 32, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !80, file: !79, line: 100, baseType: !87, size: 32, offset: 1248)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !80, file: !79, line: 100, baseType: !87, size: 32, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !80, file: !79, line: 100, baseType: !87, size: 32, offset: 1312)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !80, file: !79, line: 101, baseType: !87, size: 32, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !80, file: !79, line: 101, baseType: !87, size: 32, offset: 1376)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !80, file: !79, line: 101, baseType: !87, size: 32, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !80, file: !79, line: 101, baseType: !87, size: 32, offset: 1440)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !80, file: !79, line: 101, baseType: !87, size: 32, offset: 1472)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !80, file: !79, line: 101, baseType: !87, size: 32, offset: 1504)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !80, file: !79, line: 101, baseType: !87, size: 32, offset: 1536)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !80, file: !79, line: 101, baseType: !87, size: 32, offset: 1568)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !80, file: !79, line: 102, baseType: !87, size: 32, offset: 1600)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !80, file: !79, line: 102, baseType: !87, size: 32, offset: 1632)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !80, file: !79, line: 102, baseType: !87, size: 32, offset: 1664)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !80, file: !79, line: 103, baseType: !120, size: 64, offset: 1728)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !79, line: 17, baseType: !16)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !80, file: !79, line: 103, baseType: !120, size: 64, offset: 1792)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !80, file: !79, line: 103, baseType: !120, size: 64, offset: 1856)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !80, file: !79, line: 103, baseType: !120, size: 64, offset: 1920)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !80, file: !79, line: 104, baseType: !126, size: 64, offset: 1984)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !80, file: !79, line: 104, baseType: !126, size: 64, offset: 2048)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !80, file: !79, line: 104, baseType: !126, size: 64, offset: 2112)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !80, file: !79, line: 104, baseType: !126, size: 64, offset: 2176)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !80, file: !79, line: 104, baseType: !126, size: 64, offset: 2240)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !80, file: !79, line: 104, baseType: !126, size: 64, offset: 2304)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !80, file: !79, line: 104, baseType: !126, size: 64, offset: 2368)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !80, file: !79, line: 104, baseType: !126, size: 64, offset: 2432)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !80, file: !79, line: 104, baseType: !126, size: 64, offset: 2496)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !80, file: !79, line: 105, baseType: !126, size: 64, offset: 2560)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !80, file: !79, line: 105, baseType: !126, size: 64, offset: 2624)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !80, file: !79, line: 105, baseType: !126, size: 64, offset: 2688)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !80, file: !79, line: 105, baseType: !126, size: 64, offset: 2752)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !80, file: !79, line: 105, baseType: !126, size: 64, offset: 2816)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !80, file: !79, line: 105, baseType: !126, size: 64, offset: 2880)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !80, file: !79, line: 105, baseType: !126, size: 64, offset: 2944)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !80, file: !79, line: 106, baseType: !144, size: 192, offset: 3008)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 192, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 3)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !80, file: !79, line: 106, baseType: !127, size: 64, offset: 3200)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !80, file: !79, line: 106, baseType: !127, size: 64, offset: 3264)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !80, file: !79, line: 106, baseType: !127, size: 64, offset: 3328)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !80, file: !79, line: 106, baseType: !127, size: 64, offset: 3392)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !80, file: !79, line: 106, baseType: !127, size: 64, offset: 3456)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !80, file: !79, line: 107, baseType: !153, size: 64, offset: 3520)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !80, file: !79, line: 107, baseType: !153, size: 64, offset: 3584)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !80, file: !79, line: 107, baseType: !153, size: 64, offset: 3648)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !80, file: !79, line: 107, baseType: !153, size: 64, offset: 3712)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !80, file: !79, line: 107, baseType: !153, size: 64, offset: 3776)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !80, file: !79, line: 107, baseType: !153, size: 64, offset: 3840)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !80, file: !79, line: 108, baseType: !153, size: 64, offset: 3904)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !80, file: !79, line: 108, baseType: !153, size: 64, offset: 3968)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !80, file: !79, line: 108, baseType: !153, size: 64, offset: 4032)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !80, file: !79, line: 108, baseType: !153, size: 64, offset: 4096)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !80, file: !79, line: 108, baseType: !153, size: 64, offset: 4160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !80, file: !79, line: 108, baseType: !153, size: 64, offset: 4224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !80, file: !79, line: 109, baseType: !153, size: 64, offset: 4288)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !80, file: !79, line: 109, baseType: !153, size: 64, offset: 4352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !80, file: !79, line: 109, baseType: !153, size: 64, offset: 4416)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !80, file: !79, line: 109, baseType: !153, size: 64, offset: 4480)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !80, file: !79, line: 109, baseType: !153, size: 64, offset: 4544)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !80, file: !79, line: 110, baseType: !153, size: 64, offset: 4608)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !80, file: !79, line: 110, baseType: !153, size: 64, offset: 4672)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !80, file: !79, line: 110, baseType: !153, size: 64, offset: 4736)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !80, file: !79, line: 110, baseType: !153, size: 64, offset: 4800)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !80, file: !79, line: 110, baseType: !153, size: 64, offset: 4864)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !80, file: !79, line: 111, baseType: !153, size: 64, offset: 4928)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !80, file: !79, line: 111, baseType: !153, size: 64, offset: 4992)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !80, file: !79, line: 111, baseType: !153, size: 64, offset: 5056)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !80, file: !79, line: 111, baseType: !153, size: 64, offset: 5120)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !80, file: !79, line: 111, baseType: !153, size: 64, offset: 5184)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !80, file: !79, line: 111, baseType: !153, size: 64, offset: 5248)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !80, file: !79, line: 112, baseType: !153, size: 64, offset: 5312)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !80, file: !79, line: 112, baseType: !153, size: 64, offset: 5376)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !80, file: !79, line: 112, baseType: !153, size: 64, offset: 5440)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !80, file: !79, line: 112, baseType: !153, size: 64, offset: 5504)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !80, file: !79, line: 113, baseType: !153, size: 64, offset: 5568)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !80, file: !79, line: 113, baseType: !153, size: 64, offset: 5632)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !80, file: !79, line: 114, baseType: !126, size: 64, offset: 5696)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!189 = !DISubprogram(name: "free", scope: !190, file: !190, line: 565, type: !191, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!190 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!191 = !DISubroutineType(types: !192)
!192 = !{null, !64}
!193 = !DISubprogram(name: "perror", scope: !12, file: !12, line: 775, type: !194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!198 = !DISubprogram(name: "time", scope: !199, file: !199, line: 75, type: !200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!199 = !DIFile(filename: "/usr/include/time.h", directory: "")
!200 = !DISubroutineType(types: !201)
!201 = !{!42, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!203 = !DISubprogram(name: "localtime", scope: !199, file: !199, line: 123, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !221}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !208, line: 7, size: 448, elements: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !207, file: !208, line: 9, baseType: !10, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !207, file: !208, line: 10, baseType: !10, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !207, file: !208, line: 11, baseType: !10, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !207, file: !208, line: 12, baseType: !10, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !207, file: !208, line: 13, baseType: !10, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !207, file: !208, line: 14, baseType: !10, size: 32, offset: 160)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !207, file: !208, line: 15, baseType: !10, size: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !207, file: !208, line: 16, baseType: !10, size: 32, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !207, file: !208, line: 17, baseType: !10, size: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !207, file: !208, line: 20, baseType: !42, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !207, file: !208, line: 21, baseType: !196, size: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!223 = !DISubprogram(name: "strftime", scope: !199, file: !199, line: 88, type: !224, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!224 = !DISubroutineType(types: !225)
!225 = !{!68, !15, !68, !196, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!228 = !DISubprogram(name: "fclose", scope: !12, file: !12, line: 213, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!229 = !DISubroutineType(types: !230)
!230 = !{!10, !17}
!231 = !DISubprogram(name: "rt_errormsg_s", scope: !7, file: !7, line: 62, type: !232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!232 = !DISubroutineType(types: !233)
!233 = !{!10, !10, !15, !15}
!234 = !DISubprogram(name: "popen", scope: !12, file: !12, line: 800, type: !235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!235 = !DISubroutineType(types: !236)
!236 = !{!17, !196, !196}
!237 = !DISubprogram(name: "fflush", scope: !12, file: !12, line: 218, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!238 = !DISubprogram(name: "getc", scope: !12, file: !12, line: 486, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!239 = !DISubprogram(name: "rewind", scope: !12, file: !12, line: 694, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !17}
!242 = !DISubprogram(name: "pclose", scope: !12, file: !12, line: 806, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!243 = !{!0, !244, !249, !251, !253, !255, !257, !262}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "e_msg", scope: !2, file: !7, line: 47, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 256)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "SsFormat", scope: !2, file: !7, line: 49, type: !83, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "SiOnLine", scope: !2, file: !7, line: 50, type: !10, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "SbWroteNothing", scope: !2, file: !7, line: 50, type: !10, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "SiPerLine", scope: !2, file: !7, line: 50, type: !10, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "SfFile", scope: !2, file: !7, line: 51, type: !259, isLocal: true, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !261, line: 7, baseType: !18)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "compressed", scope: !2, file: !7, line: 46, type: !10, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!265 = !{i32 7, !"Dwarf Version", i32 4}
!266 = !{i32 2, !"Debug Info Version", i32 3}
!267 = !{i32 1, !"wchar_size", i32 4}
!268 = !{!"clang version 10.0.0-4ubuntu1 "}
!269 = distinct !DISubprogram(name: "ggets", scope: !7, file: !7, line: 71, type: !270, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !272)
!270 = !DISubroutineType(types: !271)
!271 = !{!15, !15, !10, !259}
!272 = !{!273, !274, !275, !276, !277}
!273 = !DILocalVariable(name: "line", arg: 1, scope: !269, file: !7, line: 71, type: !15)
!274 = !DILocalVariable(name: "count", arg: 2, scope: !269, file: !7, line: 71, type: !10)
!275 = !DILocalVariable(name: "file", arg: 3, scope: !269, file: !7, line: 71, type: !259)
!276 = !DILocalVariable(name: "result", scope: !269, file: !7, line: 73, type: !15)
!277 = !DILocalVariable(name: "inul", scope: !269, file: !7, line: 74, type: !10)
!278 = !DILocation(line: 0, scope: !269)
!279 = !DILocation(line: 82, column: 8, scope: !280)
!280 = distinct !DILexicalBlock(scope: !269, file: !7, line: 82, column: 8)
!281 = !DILocation(line: 82, column: 23, scope: !280)
!282 = !DILocation(line: 82, column: 8, scope: !269)
!283 = !DILocation(line: 83, column: 16, scope: !284)
!284 = distinct !DILexicalBlock(scope: !280, file: !7, line: 82, column: 29)
!285 = !DILocation(line: 84, column: 18, scope: !286)
!286 = distinct !DILexicalBlock(scope: !284, file: !7, line: 84, column: 11)
!287 = !DILocation(line: 0, scope: !288)
!288 = distinct !DILexicalBlock(scope: !269, file: !7, line: 101, column: 8)
!289 = !DILocation(line: 111, column: 1, scope: !269)
!290 = distinct !DISubprogram(name: "readparm", scope: !7, file: !7, line: 399, type: !291, scopeLine: 401, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !395)
!291 = !DISubroutineType(types: !292)
!292 = !{!10, !293, !15}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !79, line: 126, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !79, line: 118, size: 1088, elements: !296)
!296 = !{!297, !302, !303, !391, !392, !393, !394}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !295, file: !79, line: 119, baseType: !298, size: 768)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !79, line: 13, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 768, elements: !300)
!300 = !{!301, !146}
!301 = !DISubrange(count: 4)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !295, file: !79, line: 120, baseType: !87, size: 32, offset: 768)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !295, file: !79, line: 121, baseType: !304, size: 64, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !79, line: 93, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !79, line: 84, size: 384, elements: !307)
!307 = !{!308, !309, !310, !311, !313, !315, !316, !317}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !306, file: !79, line: 85, baseType: !120, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !306, file: !79, line: 86, baseType: !87, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !306, file: !79, line: 87, baseType: !87, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !306, file: !79, line: 88, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !306, file: !79, line: 89, baseType: !314, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !306, file: !79, line: 90, baseType: !87, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !306, file: !79, line: 91, baseType: !87, size: 32, offset: 288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !306, file: !79, line: 92, baseType: !318, size: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !79, line: 82, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !79, line: 63, size: 1024, elements: !322)
!322 = !{!323, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !344, !345, !351, !352, !361, !362, !363}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !321, file: !79, line: 64, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !321, file: !79, line: 65, baseType: !87, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !321, file: !79, line: 66, baseType: !87, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !321, file: !79, line: 67, baseType: !87, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !321, file: !79, line: 68, baseType: !120, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !321, file: !79, line: 69, baseType: !120, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !321, file: !79, line: 70, baseType: !87, size: 32, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !321, file: !79, line: 71, baseType: !87, size: 32, offset: 352)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !321, file: !79, line: 72, baseType: !87, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !321, file: !79, line: 73, baseType: !314, size: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !321, file: !79, line: 74, baseType: !335, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !79, line: 52, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !79, line: 47, size: 192, elements: !338)
!338 = !{!339, !341, !342, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !337, file: !79, line: 48, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !337, file: !79, line: 49, baseType: !87, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !337, file: !79, line: 50, baseType: !87, size: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !337, file: !79, line: 51, baseType: !87, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !321, file: !79, line: 75, baseType: !87, size: 32, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !321, file: !79, line: 76, baseType: !346, size: 64, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !79, line: 54, baseType: !348)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 64, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 2)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !321, file: !79, line: 77, baseType: !87, size: 32, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !321, file: !79, line: 78, baseType: !353, size: 64, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !79, line: 61, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !79, line: 58, size: 192, elements: !356)
!356 = !{!357, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !355, file: !79, line: 59, baseType: !358, size: 128)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, elements: !359)
!359 = !{!301}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !355, file: !79, line: 60, baseType: !127, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !321, file: !79, line: 79, baseType: !87, size: 32, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !321, file: !79, line: 80, baseType: !153, size: 64, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !321, file: !79, line: 81, baseType: !364, size: 64, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !79, line: 45, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !79, line: 25, size: 1408, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !390}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !366, file: !79, line: 26, baseType: !120, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !366, file: !79, line: 27, baseType: !120, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !366, file: !79, line: 28, baseType: !87, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !366, file: !79, line: 29, baseType: !87, size: 32, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !366, file: !79, line: 30, baseType: !373, size: 256, offset: 192)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 8)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !366, file: !79, line: 31, baseType: !324, size: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !366, file: !79, line: 32, baseType: !127, size: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !366, file: !79, line: 33, baseType: !127, size: 64, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !366, file: !79, line: 34, baseType: !127, size: 64, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !366, file: !79, line: 35, baseType: !127, size: 64, offset: 704)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !366, file: !79, line: 36, baseType: !120, size: 64, offset: 768)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !366, file: !79, line: 37, baseType: !87, size: 32, offset: 832)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !366, file: !79, line: 38, baseType: !127, size: 64, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !366, file: !79, line: 39, baseType: !127, size: 64, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !366, file: !79, line: 40, baseType: !87, size: 32, offset: 1024)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !366, file: !79, line: 41, baseType: !87, size: 32, offset: 1056)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !366, file: !79, line: 42, baseType: !120, size: 64, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !366, file: !79, line: 43, baseType: !389, size: 192, offset: 1152)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !79, line: 12, baseType: !144)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !366, file: !79, line: 44, baseType: !127, size: 64, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !295, file: !79, line: 122, baseType: !87, size: 32, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !295, file: !79, line: 123, baseType: !87, size: 32, offset: 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !295, file: !79, line: 124, baseType: !87, size: 32, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !295, file: !79, line: 125, baseType: !77, size: 64, offset: 1024)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!396 = !DILocalVariable(name: "mol", arg: 1, scope: !290, file: !7, line: 399, type: !293)
!397 = !DILocalVariable(name: "name", arg: 2, scope: !290, file: !7, line: 399, type: !15)
!398 = !DILocalVariable(name: "H", scope: !290, file: !7, line: 402, type: !126)
!399 = !DILocalVariable(name: "atype", scope: !290, file: !7, line: 402, type: !126)
!400 = !DILocalVariable(name: "sigmaw3", scope: !290, file: !7, line: 402, type: !127)
!401 = !DILocalVariable(name: "sigma_iw6", scope: !290, file: !7, line: 402, type: !127)
!402 = !DILocalVariable(name: "epsilon_iw", scope: !290, file: !7, line: 402, type: !127)
!403 = !DILocalVariable(name: "si_tmp", scope: !290, file: !7, line: 403, type: !127)
!404 = !DILocalVariable(name: "i", scope: !290, file: !7, line: 404, type: !10)
!405 = !DILocalVariable(name: "j", scope: !290, file: !7, line: 404, type: !10)
!406 = !DILocalVariable(name: "k", scope: !290, file: !7, line: 404, type: !10)
!407 = !DILocalVariable(name: "idum", scope: !290, file: !7, line: 404, type: !10)
!408 = !DILocalVariable(name: "res", scope: !290, file: !7, line: 404, type: !10)
!409 = !DILocalVariable(name: "ifpert", scope: !290, file: !7, line: 404, type: !10)
!410 = !DILocalVariable(name: "iat", scope: !290, file: !7, line: 404, type: !10)
!411 = !DILocalVariable(name: "kat", scope: !290, file: !7, line: 404, type: !10)
!412 = !DILocalVariable(name: "lat", scope: !290, file: !7, line: 404, type: !10)
!413 = !DILocalVariable(name: "newparm", scope: !290, file: !7, line: 404, type: !10)
!414 = !DILocalVariable(name: "ier", scope: !290, file: !7, line: 404, type: !10)
!415 = !DILocalVariable(name: "iaci", scope: !290, file: !7, line: 404, type: !10)
!416 = !DILocalVariable(name: "ismall", scope: !290, file: !7, line: 405, type: !10)
!417 = !DILocalVariable(name: "ibig", scope: !290, file: !7, line: 405, type: !10)
!418 = !DILocalVariable(name: "iptmp", scope: !290, file: !7, line: 406, type: !188)
!419 = !DILocalVariable(name: "file", scope: !290, file: !7, line: 407, type: !259)
!420 = !DILocalVariable(name: "prm", scope: !290, file: !7, line: 408, type: !77)
!421 = !DILocalVariable(name: "line", scope: !290, file: !7, line: 409, type: !83)
!422 = !DILocalVariable(name: "atsymb", scope: !290, file: !7, line: 410, type: !16)
!423 = !DILocalVariable(name: "atsymbp", scope: !290, file: !7, line: 410, type: !16)
!424 = !DILocalVariable(name: "i10_12", scope: !290, file: !7, line: 411, type: !10)
!425 = !DILocalVariable(name: "ai", scope: !290, file: !7, line: 413, type: !10)
!426 = !DILocalVariable(name: "a", scope: !290, file: !7, line: 414, type: !364)
!427 = !DILocalVariable(name: "buf", scope: !428, file: !7, line: 171, type: !441)
!428 = distinct !DISubprogram(name: "genopen", scope: !7, file: !7, line: 169, type: !429, scopeLine: 170, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{!259, !15}
!431 = !{!432, !427, !433, !437, !438, !439, !440}
!432 = !DILocalVariable(name: "name", arg: 1, scope: !428, file: !7, line: 169, type: !15)
!433 = !DILocalVariable(name: "cbuf", scope: !428, file: !7, line: 172, type: !434)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 960, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 120)
!437 = !DILocalVariable(name: "pcmd", scope: !428, file: !7, line: 172, type: !434)
!438 = !DILocalVariable(name: "length", scope: !428, file: !7, line: 173, type: !10)
!439 = !DILocalVariable(name: "ier", scope: !428, file: !7, line: 173, type: !10)
!440 = !DILocalVariable(name: "fp", scope: !428, file: !7, line: 174, type: !259)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !442, line: 46, size: 1152, elements: !443)
!442 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!443 = !{!444, !446, !448, !450, !453, !455, !457, !458, !459, !460, !462, !464, !472, !473, !474}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !441, file: !442, line: 48, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !41, line: 145, baseType: !68)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !441, file: !442, line: 53, baseType: !447, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !41, line: 148, baseType: !68)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !441, file: !442, line: 61, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !41, line: 151, baseType: !68)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !441, file: !442, line: 62, baseType: !451, size: 32, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !41, line: 150, baseType: !452)
!452 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !441, file: !442, line: 64, baseType: !454, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !41, line: 146, baseType: !452)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !441, file: !442, line: 65, baseType: !456, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !41, line: 147, baseType: !452)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !441, file: !442, line: 67, baseType: !10, size: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !441, file: !442, line: 69, baseType: !445, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !441, file: !442, line: 74, baseType: !40, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !441, file: !442, line: 78, baseType: !461, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !41, line: 174, baseType: !42)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !441, file: !442, line: 80, baseType: !463, size: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !41, line: 179, baseType: !42)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !441, file: !442, line: 91, baseType: !465, size: 128, offset: 576)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !466, line: 10, size: 128, elements: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!467 = !{!468, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !465, file: !466, line: 12, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !41, line: 160, baseType: !42)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !465, file: !466, line: 16, baseType: !471, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !41, line: 196, baseType: !42)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !441, file: !442, line: 92, baseType: !465, size: 128, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !441, file: !442, line: 93, baseType: !465, size: 128, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !441, file: !442, line: 106, baseType: !475, size: 192, offset: 960)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 192, elements: !145)
!476 = !DILocation(line: 171, column: 16, scope: !428, inlinedAt: !477)
!477 = distinct !DILocation(line: 423, column: 16, scope: !478)
!478 = distinct !DILexicalBlock(scope: !290, file: !7, line: 423, column: 8)
!479 = !DILocation(line: 172, column: 9, scope: !428, inlinedAt: !477)
!480 = !DILocation(line: 172, column: 20, scope: !428, inlinedAt: !477)
!481 = !DILocation(line: 0, scope: !290)
!482 = !DILocation(line: 404, column: 4, scope: !290)
!483 = !DILocation(line: 409, column: 4, scope: !290)
!484 = !DILocation(line: 409, column: 9, scope: !290)
!485 = !DILocation(line: 419, column: 8, scope: !486)
!486 = distinct !DILexicalBlock(scope: !290, file: !7, line: 419, column: 8)
!487 = !DILocation(line: 419, column: 23, scope: !486)
!488 = !DILocation(line: 419, column: 8, scope: !290)
!489 = !DILocation(line: 420, column: 15, scope: !490)
!490 = distinct !DILexicalBlock(scope: !486, file: !7, line: 419, column: 29)
!491 = !{!492, !492, i64 0}
!492 = !{!"any pointer", !493, i64 0}
!493 = !{!"omnipotent char", !494, i64 0}
!494 = !{!"Simple C/C++ TBAA"}
!495 = !DILocation(line: 420, column: 7, scope: !490)
!496 = !DILocation(line: 421, column: 4, scope: !490)
!497 = !DILocation(line: 0, scope: !428, inlinedAt: !477)
!498 = !DILocation(line: 171, column: 4, scope: !428, inlinedAt: !477)
!499 = !DILocation(line: 172, column: 4, scope: !428, inlinedAt: !477)
!500 = !DILocation(line: 176, column: 13, scope: !428, inlinedAt: !477)
!501 = !DILocalVariable(name: "name", arg: 1, scope: !502, file: !7, line: 142, type: !15)
!502 = distinct !DISubprogram(name: "iscompressed", scope: !7, file: !7, line: 142, type: !503, scopeLine: 143, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{!10, !15}
!505 = !{!501, !506}
!506 = !DILocalVariable(name: "i", scope: !502, file: !7, line: 145, type: !10)
!507 = !DILocation(line: 0, scope: !502, inlinedAt: !508)
!508 = distinct !DILocation(line: 177, column: 17, scope: !428, inlinedAt: !477)
!509 = !DILocation(line: 147, column: 8, scope: !502, inlinedAt: !508)
!510 = !DILocation(line: 149, column: 10, scope: !511, inlinedAt: !508)
!511 = distinct !DILexicalBlock(scope: !502, file: !7, line: 149, column: 8)
!512 = !DILocation(line: 149, column: 8, scope: !502, inlinedAt: !508)
!513 = !DILocation(line: 150, column: 11, scope: !514, inlinedAt: !508)
!514 = distinct !DILexicalBlock(scope: !515, file: !7, line: 150, column: 11)
!515 = distinct !DILexicalBlock(scope: !511, file: !7, line: 149, column: 15)
!516 = !DILocation(line: 150, column: 26, scope: !514, inlinedAt: !508)
!517 = !DILocation(line: 150, column: 11, scope: !515, inlinedAt: !508)
!518 = !DILocation(line: 151, column: 18, scope: !519, inlinedAt: !508)
!519 = distinct !DILexicalBlock(scope: !514, file: !7, line: 150, column: 32)
!520 = !DILocation(line: 151, column: 10, scope: !519, inlinedAt: !508)
!521 = !DILocation(line: 152, column: 7, scope: !519, inlinedAt: !508)
!522 = !DILocation(line: 153, column: 7, scope: !515, inlinedAt: !508)
!523 = !DILocation(line: 155, column: 8, scope: !502, inlinedAt: !508)
!524 = !DILocation(line: 155, column: 10, scope: !525, inlinedAt: !508)
!525 = distinct !DILexicalBlock(scope: !502, file: !7, line: 155, column: 8)
!526 = !DILocation(line: 157, column: 8, scope: !527, inlinedAt: !508)
!527 = distinct !DILexicalBlock(scope: !502, file: !7, line: 157, column: 8)
!528 = !{!493, !493, i64 0}
!529 = !DILocation(line: 157, column: 16, scope: !527, inlinedAt: !508)
!530 = !DILocation(line: 157, column: 23, scope: !527, inlinedAt: !508)
!531 = !DILocation(line: 157, column: 26, scope: !527, inlinedAt: !508)
