; ModuleID = '/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/select_atoms.c'
source_filename = "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/select_atoms.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.extbond_t = type { %struct.extbond_t*, i32, i32, i32 }
%struct.chiral_t = type { [4 x i32], double }
%struct.atom_t = type { i8*, i8*, i32, i32, [8 x i32], %struct.residue_t*, double, double, double, double, i8*, i32, double, double, i32, i32, i8*, [3 x double], double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "aexpr", scope: !2, file: !23, line: 14, type: !259, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !250, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/select_atoms.c", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation/Transformation-Pass/Vectorizer-Pass/test/spec codes")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !241, !26, !242, !243, !247}
!22 = !DISubprogram(name: "select_atoms", scope: !23, file: !23, line: 29, type: !24, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !240)
!23 = !DIFile(filename: "Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/select_atoms.c", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation")
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !27, !239}
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !29, line: 118, size: 1088, elements: !30)
!29 = !DIFile(filename: "Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation")
!30 = !{!31, !38, !40, !133, !134, !135, !136}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !28, file: !29, line: 119, baseType: !32, size: 768)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !29, line: 13, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 768, elements: !35)
!34 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!35 = !{!36, !37}
!36 = !DISubrange(count: 4)
!37 = !DISubrange(count: 3)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !28, file: !29, line: 120, baseType: !39, size: 32, offset: 768)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !29, line: 6, baseType: !26)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !28, file: !29, line: 121, baseType: !41, size: 64, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !29, line: 93, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !29, line: 84, size: 384, elements: !44)
!44 = !{!45, !49, !50, !51, !52, !54, !55, !56}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !43, file: !29, line: 85, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !29, line: 17, baseType: !48)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !43, file: !29, line: 86, baseType: !39, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !43, file: !29, line: 87, baseType: !39, size: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !43, file: !29, line: 88, baseType: !27, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !43, file: !29, line: 89, baseType: !53, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !43, file: !29, line: 90, baseType: !39, size: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !43, file: !29, line: 91, baseType: !39, size: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !43, file: !29, line: 92, baseType: !57, size: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !29, line: 82, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !29, line: 63, size: 1024, elements: !61)
!61 = !{!62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !83, !84, !90, !91, !100, !101, !103}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !60, file: !29, line: 64, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !60, file: !29, line: 65, baseType: !39, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !60, file: !29, line: 66, baseType: !39, size: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !60, file: !29, line: 67, baseType: !39, size: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !60, file: !29, line: 68, baseType: !46, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !60, file: !29, line: 69, baseType: !46, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !60, file: !29, line: 70, baseType: !39, size: 32, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !60, file: !29, line: 71, baseType: !39, size: 32, offset: 352)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !60, file: !29, line: 72, baseType: !39, size: 32, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !60, file: !29, line: 73, baseType: !53, size: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !60, file: !29, line: 74, baseType: !74, size: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !29, line: 52, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !29, line: 47, size: 192, elements: !77)
!77 = !{!78, !80, !81, !82}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !76, file: !29, line: 48, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !76, file: !29, line: 49, baseType: !39, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !76, file: !29, line: 50, baseType: !39, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !76, file: !29, line: 51, baseType: !39, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !60, file: !29, line: 75, baseType: !39, size: 32, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !60, file: !29, line: 76, baseType: !85, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !29, line: 54, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 2)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !60, file: !29, line: 77, baseType: !39, size: 32, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !60, file: !29, line: 78, baseType: !92, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !29, line: 61, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !29, line: 58, size: 192, elements: !95)
!95 = !{!96, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !94, file: !29, line: 59, baseType: !97, size: 128)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !98)
!98 = !{!36}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !94, file: !29, line: 60, baseType: !34, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !60, file: !29, line: 79, baseType: !39, size: 32, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !60, file: !29, line: 80, baseType: !102, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !60, file: !29, line: 81, baseType: !104, size: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !29, line: 45, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !29, line: 25, size: 1408, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !132}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !106, file: !29, line: 26, baseType: !46, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !106, file: !29, line: 27, baseType: !46, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !106, file: !29, line: 28, baseType: !39, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !106, file: !29, line: 29, baseType: !39, size: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !106, file: !29, line: 30, baseType: !113, size: 256, offset: 192)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 8)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !106, file: !29, line: 31, baseType: !63, size: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !106, file: !29, line: 32, baseType: !34, size: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !106, file: !29, line: 33, baseType: !34, size: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !106, file: !29, line: 34, baseType: !34, size: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !106, file: !29, line: 35, baseType: !34, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !106, file: !29, line: 36, baseType: !46, size: 64, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !106, file: !29, line: 37, baseType: !39, size: 32, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !106, file: !29, line: 38, baseType: !34, size: 64, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !106, file: !29, line: 39, baseType: !34, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !106, file: !29, line: 40, baseType: !39, size: 32, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !106, file: !29, line: 41, baseType: !39, size: 32, offset: 1056)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !106, file: !29, line: 42, baseType: !46, size: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !106, file: !29, line: 43, baseType: !129, size: 192, offset: 1152)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !29, line: 12, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 192, elements: !131)
!131 = !{!37}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !106, file: !29, line: 44, baseType: !34, size: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !28, file: !29, line: 122, baseType: !39, size: 32, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !28, file: !29, line: 123, baseType: !39, size: 32, offset: 928)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !28, file: !29, line: 124, baseType: !39, size: 32, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !28, file: !29, line: 125, baseType: !137, size: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !29, line: 115, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !29, line: 95, size: 5760, elements: !140)
!140 = !{!141, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !139, file: !29, line: 96, baseType: !142, size: 648)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 648, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 81)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !139, file: !29, line: 97, baseType: !39, size: 32, offset: 672)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !139, file: !29, line: 97, baseType: !39, size: 32, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !139, file: !29, line: 97, baseType: !39, size: 32, offset: 736)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !139, file: !29, line: 98, baseType: !39, size: 32, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !139, file: !29, line: 98, baseType: !39, size: 32, offset: 800)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !139, file: !29, line: 98, baseType: !39, size: 32, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !139, file: !29, line: 98, baseType: !39, size: 32, offset: 864)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !139, file: !29, line: 98, baseType: !39, size: 32, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !139, file: !29, line: 98, baseType: !39, size: 32, offset: 928)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !139, file: !29, line: 99, baseType: !39, size: 32, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !139, file: !29, line: 99, baseType: !39, size: 32, offset: 992)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !139, file: !29, line: 99, baseType: !39, size: 32, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !139, file: !29, line: 99, baseType: !39, size: 32, offset: 1056)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !139, file: !29, line: 99, baseType: !39, size: 32, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !139, file: !29, line: 99, baseType: !39, size: 32, offset: 1120)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !139, file: !29, line: 100, baseType: !39, size: 32, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !139, file: !29, line: 100, baseType: !39, size: 32, offset: 1184)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !139, file: !29, line: 100, baseType: !39, size: 32, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !139, file: !29, line: 100, baseType: !39, size: 32, offset: 1248)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !139, file: !29, line: 100, baseType: !39, size: 32, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !139, file: !29, line: 100, baseType: !39, size: 32, offset: 1312)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !139, file: !29, line: 101, baseType: !39, size: 32, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !139, file: !29, line: 101, baseType: !39, size: 32, offset: 1376)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !139, file: !29, line: 101, baseType: !39, size: 32, offset: 1408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !139, file: !29, line: 101, baseType: !39, size: 32, offset: 1440)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !139, file: !29, line: 101, baseType: !39, size: 32, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !139, file: !29, line: 101, baseType: !39, size: 32, offset: 1504)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !139, file: !29, line: 101, baseType: !39, size: 32, offset: 1536)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !139, file: !29, line: 101, baseType: !39, size: 32, offset: 1568)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !139, file: !29, line: 102, baseType: !39, size: 32, offset: 1600)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !139, file: !29, line: 102, baseType: !39, size: 32, offset: 1632)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !139, file: !29, line: 102, baseType: !39, size: 32, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !139, file: !29, line: 103, baseType: !46, size: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !139, file: !29, line: 103, baseType: !46, size: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !139, file: !29, line: 103, baseType: !46, size: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !139, file: !29, line: 103, baseType: !46, size: 64, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !139, file: !29, line: 104, baseType: !182, size: 64, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !139, file: !29, line: 104, baseType: !182, size: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !139, file: !29, line: 104, baseType: !182, size: 64, offset: 2112)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !139, file: !29, line: 104, baseType: !182, size: 64, offset: 2176)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !139, file: !29, line: 104, baseType: !182, size: 64, offset: 2240)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !139, file: !29, line: 104, baseType: !182, size: 64, offset: 2304)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !139, file: !29, line: 104, baseType: !182, size: 64, offset: 2368)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !139, file: !29, line: 104, baseType: !182, size: 64, offset: 2432)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !139, file: !29, line: 104, baseType: !182, size: 64, offset: 2496)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !139, file: !29, line: 105, baseType: !182, size: 64, offset: 2560)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !139, file: !29, line: 105, baseType: !182, size: 64, offset: 2624)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !139, file: !29, line: 105, baseType: !182, size: 64, offset: 2688)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !139, file: !29, line: 105, baseType: !182, size: 64, offset: 2752)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !139, file: !29, line: 105, baseType: !182, size: 64, offset: 2816)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !139, file: !29, line: 105, baseType: !182, size: 64, offset: 2880)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !139, file: !29, line: 105, baseType: !182, size: 64, offset: 2944)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !139, file: !29, line: 106, baseType: !130, size: 192, offset: 3008)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !139, file: !29, line: 106, baseType: !34, size: 64, offset: 3200)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !139, file: !29, line: 106, baseType: !34, size: 64, offset: 3264)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !139, file: !29, line: 106, baseType: !34, size: 64, offset: 3328)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !139, file: !29, line: 106, baseType: !34, size: 64, offset: 3392)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !139, file: !29, line: 106, baseType: !34, size: 64, offset: 3456)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !139, file: !29, line: 107, baseType: !102, size: 64, offset: 3520)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !139, file: !29, line: 107, baseType: !102, size: 64, offset: 3584)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !139, file: !29, line: 107, baseType: !102, size: 64, offset: 3648)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !139, file: !29, line: 107, baseType: !102, size: 64, offset: 3712)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !139, file: !29, line: 107, baseType: !102, size: 64, offset: 3776)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !139, file: !29, line: 107, baseType: !102, size: 64, offset: 3840)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !139, file: !29, line: 108, baseType: !102, size: 64, offset: 3904)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !139, file: !29, line: 108, baseType: !102, size: 64, offset: 3968)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !139, file: !29, line: 108, baseType: !102, size: 64, offset: 4032)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !139, file: !29, line: 108, baseType: !102, size: 64, offset: 4096)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !139, file: !29, line: 108, baseType: !102, size: 64, offset: 4160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !139, file: !29, line: 108, baseType: !102, size: 64, offset: 4224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !139, file: !29, line: 109, baseType: !102, size: 64, offset: 4288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !139, file: !29, line: 109, baseType: !102, size: 64, offset: 4352)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !139, file: !29, line: 109, baseType: !102, size: 64, offset: 4416)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !139, file: !29, line: 109, baseType: !102, size: 64, offset: 4480)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !139, file: !29, line: 109, baseType: !102, size: 64, offset: 4544)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !139, file: !29, line: 110, baseType: !102, size: 64, offset: 4608)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !139, file: !29, line: 110, baseType: !102, size: 64, offset: 4672)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !139, file: !29, line: 110, baseType: !102, size: 64, offset: 4736)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !139, file: !29, line: 110, baseType: !102, size: 64, offset: 4800)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !139, file: !29, line: 110, baseType: !102, size: 64, offset: 4864)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !139, file: !29, line: 111, baseType: !102, size: 64, offset: 4928)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !139, file: !29, line: 111, baseType: !102, size: 64, offset: 4992)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !139, file: !29, line: 111, baseType: !102, size: 64, offset: 5056)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !139, file: !29, line: 111, baseType: !102, size: 64, offset: 5120)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !139, file: !29, line: 111, baseType: !102, size: 64, offset: 5184)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !139, file: !29, line: 111, baseType: !102, size: 64, offset: 5248)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !139, file: !29, line: 112, baseType: !102, size: 64, offset: 5312)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !139, file: !29, line: 112, baseType: !102, size: 64, offset: 5376)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !139, file: !29, line: 112, baseType: !102, size: 64, offset: 5440)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !139, file: !29, line: 112, baseType: !102, size: 64, offset: 5504)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !139, file: !29, line: 113, baseType: !102, size: 64, offset: 5568)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !139, file: !29, line: 113, baseType: !102, size: 64, offset: 5632)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !139, file: !29, line: 114, baseType: !182, size: 64, offset: 5696)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!240 = !{}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!242 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!243 = !DISubprogram(name: "compile", scope: !244, file: !244, line: 257, type: !245, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !240)
!244 = !DIFile(filename: "Benchmarks/SPEC/benchspec/CPU/544.nab_r/src/nab.h", directory: "/home/rouzbeh/Graduate/LLVM/Active-Lane-Conslidation")
!245 = !DISubroutineType(types: !246)
!246 = !{!239, !239, !239, !239, !26}
!247 = !DISubprogram(name: "step", scope: !244, file: !244, line: 258, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !240)
!248 = !DISubroutineType(types: !249)
!249 = !{!26, !239, !239}
!250 = !{!0, !251, !253, !255, !257, !262}
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "spart", scope: !2, file: !23, line: 15, type: !239, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "rpart", scope: !2, file: !23, line: 16, type: !239, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "apart", scope: !2, file: !23, line: 17, type: !239, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "rexpr", scope: !2, file: !23, line: 20, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8000, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 1000)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "expbuf", scope: !2, file: !23, line: 26, type: !259, isLocal: true, isDefinition: true)
!264 = !{i32 7, !"Dwarf Version", i32 4}
!265 = !{i32 2, !"Debug Info Version", i32 3}
!266 = !{i32 1, !"wchar_size", i32 4}
!267 = !{!"clang version 10.0.0-4ubuntu1 "}
!268 = distinct !DISubprogram(name: "setpoint", scope: !23, file: !23, line: 54, type: !269, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !273)
!269 = !DISubroutineType(types: !270)
!270 = !{!26, !271, !239, !182}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !29, line: 126, baseType: !28)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!274 = !DILocalVariable(name: "mol", arg: 1, scope: !268, file: !23, line: 54, type: !271)
!275 = !DILocalVariable(name: "aexpr", arg: 2, scope: !268, file: !23, line: 54, type: !239)
!276 = !DILocalVariable(name: "point", arg: 3, scope: !268, file: !23, line: 54, type: !182)
!277 = !DILocalVariable(name: "r", scope: !268, file: !23, line: 56, type: !26)
!278 = !DILocalVariable(name: "a", scope: !268, file: !23, line: 56, type: !26)
!279 = !DILocalVariable(name: "ta", scope: !268, file: !23, line: 56, type: !26)
!280 = !DILocalVariable(name: "sp", scope: !268, file: !23, line: 57, type: !41)
!281 = !DILocalVariable(name: "res", scope: !268, file: !23, line: 58, type: !58)
!282 = !DILocalVariable(name: "ap", scope: !268, file: !23, line: 59, type: !104)
!283 = !DILocalVariable(name: "x", scope: !268, file: !23, line: 60, type: !34)
!284 = !DILocalVariable(name: "y", scope: !268, file: !23, line: 60, type: !34)
!285 = !DILocalVariable(name: "z", scope: !268, file: !23, line: 60, type: !34)
!286 = !DILocation(line: 0, scope: !268)
!287 = !DILocation(line: 62, column: 2, scope: !268)
!288 = !DILocation(line: 66, column: 25, scope: !289)
