; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/500.perlbench_r/llvm-ir/500.perlbench_r_bc/src/globals.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/500.perlbench_r/src/globals.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mgvtbl = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.sv = type { ptr, i32, i32, %union.anon }
%union.anon = type { ptr }
%struct.padname = type { ptr, ptr, %union.anon.39, i32, i32, i32, i32, i8, i8 }
%union.anon.39 = type { ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.jmpenv = type { [1 x %struct.__jmp_buf_tag], ptr, i32, i8 }
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.cop = type { ptr, ptr, ptr, i64, i16, i8, i8, i32, ptr, ptr, i32, i32, ptr, ptr }
%struct.perl_debug_pad = type { [3 x %struct.sv] }


!147 = distinct !DIGlobalVariable(name: "PL_uuemap", scope: !2, file: !6, line: 4740, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 520, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 65)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "PL_uudmap", scope: !2, file: !6, line: 4744, type: !153, isLocal: false, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, elements: !23)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "PL_bitcount", scope: !2, file: !6, line: 4751, type: !153, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "PL_sig_name", scope: !2, file: !6, line: 4758, type: !158, isLocal: false, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 1088, elements: !161)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!161 = !{!162}
!162 = !DISubrange(count: 17)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "PL_sig_num", scope: !2, file: !6, line: 4759, type: !165, isLocal: false, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 544, elements: !161)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "PL_fold", scope: !2, file: !6, line: 4777, type: !20, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "PL_fold_latin1", scope: !2, file: !6, line: 4811, type: !20, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "PL_latin1_lc", scope: !2, file: !6, line: 4857, type: !20, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "PL_mod_latin1_uc", scope: !2, file: !6, line: 4894, type: !20, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "PL_fold_locale", scope: !2, file: !6, line: 4940, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !23)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "PL_freq", scope: !2, file: !6, line: 5016, type: !20, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "PL_block_type", scope: !2, file: !6, line: 5059, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 768, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 12)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "PL_bincompat_options", scope: !2, file: !6, line: 5083, type: !188, isLocal: false, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 448, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 56)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "PL_phase_names", scope: !2, file: !6, line: 5222, type: !193, isLocal: false, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 448, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 7)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "PL_op_name", scope: !2, file: !198, line: 152, type: !199, isLocal: false, isDefinition: true)
!198 = !DIFile(filename: "apps/500.perlbench_r/src/opcode.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "0ffc1f27a9d8302912a304aabe30fe6c")
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 25408, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 397)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "PL_op_desc", scope: !2, file: !198, line: 556, type: !199, isLocal: false, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "PL_ppaddr", scope: !2, file: !198, line: 969, type: !206, isLocal: false, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 25344, elements: !233)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "Perl_ppaddr_t", file: !6, line: 5404, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "OP", file: !6, line: 2617, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !214, line: 202, size: 320, elements: !215)
!214 = !DIFile(filename: "apps/500.perlbench_r/src/op.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b88d747a6f3149f06a4a1e8e725e6800")
!215 = !{!216, !217, !218, !219, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !213, file: !214, line: 203, baseType: !211, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !213, file: !214, line: 203, baseType: !211, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !213, file: !214, line: 203, baseType: !208, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !213, file: !214, line: 203, baseType: !220, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADOFFSET", file: !221, line: 25, baseType: !222)
!221 = !DIFile(filename: "apps/500.perlbench_r/src/pad.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "07d0fc40568e154e930466504379a358")
!222 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !213, file: !214, line: 203, baseType: !7, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !213, file: !214, line: 203, baseType: !7, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !213, file: !214, line: 203, baseType: !7, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !213, file: !214, line: 203, baseType: !7, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !213, file: !214, line: 203, baseType: !7, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !213, file: !214, line: 203, baseType: !7, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !213, file: !214, line: 203, baseType: !7, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !213, file: !214, line: 203, baseType: !7, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !213, file: !214, line: 203, baseType: !140, size: 8, offset: 272)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !213, file: !214, line: 203, baseType: !140, size: 8, offset: 280)
!233 = !{!234}
!234 = !DISubrange(count: 396)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "PL_check", scope: !2, file: !198, line: 1383, type: !237, isLocal: false, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 25344, elements: !233)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Perl_check_t", file: !6, line: 5405, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!211, !211}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "PL_opargs", scope: !2, file: !198, line: 1796, type: !244, isLocal: false, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 12672, elements: !233)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "U32", file: !141, line: 175, baseType: !7)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "PL_op_private_labels", scope: !2, file: !198, line: 2317, type: !249, isLocal: false, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 4144, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 518)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "PL_op_private_bitfields", scope: !2, file: !198, line: 2418, type: !254, isLocal: false, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 608, elements: !258)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "I16", file: !141, line: 172, baseType: !257)
!257 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!258 = !{!259}
!259 = !DISubrange(count: 38)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "PL_op_private_bitdef_ix", scope: !2, file: !198, line: 2434, type: !262, isLocal: false, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 6336, elements: !233)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "PL_op_private_bitdefs", scope: !2, file: !198, line: 2848, type: !265, isLocal: false, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 3280, elements: !269)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "U16", file: !141, line: 173, baseType: !268)
!268 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!269 = !{!270}
!270 = !DISubrange(count: 205)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "PL_op_private_valid", scope: !2, file: !198, line: 2919, type: !273, isLocal: false, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 3168, elements: !233)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "PL_tmps_ix", scope: !2, file: !276, line: 52, type: !277, isLocal: false, isDefinition: true)
!276 = !DIFile(filename: "apps/500.perlbench_r/src/intrpvar.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ea36858c45fc11e41a9e2b6d8c7e39fa")
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !278, line: 108, baseType: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !280, line: 193, baseType: !281)
!280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!281 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "PL_tmps_floor", scope: !2, file: !276, line: 53, type: !277, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "PL_sub_generation", scope: !2, file: !276, line: 56, type: !246, isLocal: false, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "PL_sawalias", scope: !2, file: !276, line: 63, type: !288, isLocal: false, isDefinition: true)
!288 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "PL_hash_rand_bits_enabled", scope: !2, file: !276, line: 68, type: !140, isLocal: false, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "PL_hash_rand_bits", scope: !2, file: !276, line: 70, type: !293, isLocal: false, isDefinition: true)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV", file: !6, line: 1671, baseType: !222)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "PL_utf8cache", scope: !2, file: !276, line: 102, type: !296, isLocal: false, isDefinition: true)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "I8", file: !141, line: 170, baseType: !297)
!297 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "PL_reg_curpm", scope: !2, file: !276, line: 123, type: !300, isLocal: false, isDefinition: true)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PMOP", file: !6, line: 2624, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pmop", file: !214, line: 251, size: 768, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !841, !842, !847, !852}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !302, file: !214, line: 252, baseType: !211, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !302, file: !214, line: 252, baseType: !211, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !302, file: !214, line: 252, baseType: !208, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !302, file: !214, line: 252, baseType: !220, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !302, file: !214, line: 252, baseType: !7, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !302, file: !214, line: 252, baseType: !7, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !302, file: !214, line: 252, baseType: !7, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !302, file: !214, line: 252, baseType: !7, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !302, file: !214, line: 252, baseType: !7, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !302, file: !214, line: 252, baseType: !7, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !302, file: !214, line: 252, baseType: !7, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !302, file: !214, line: 252, baseType: !7, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !302, file: !214, line: 252, baseType: !140, size: 8, offset: 272)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !302, file: !214, line: 252, baseType: !140, size: 8, offset: 280)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "op_first", scope: !302, file: !214, line: 253, baseType: !211, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "op_last", scope: !302, file: !214, line: 254, baseType: !211, size: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmregexp", scope: !302, file: !214, line: 258, baseType: !321, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "REGEXP", file: !6, line: 2651, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "p5rx", file: !324, line: 256, size: 192, elements: !325)
!324 = !DIFile(filename: "apps/500.perlbench_r/src/sv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e8ddee5f0a5032210b880c8e95bcea58")
!325 = !{!326, !826, !827, !828}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !323, file: !324, line: 257, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp", file: !329, line: 140, size: 1536, elements: !330)
!329 = !DIFile(filename: "apps/500.perlbench_r/src/regexp.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "83285f03b848d0cf5e30c9354282eae6")
!330 = !{!331, !709, !710, !711, !716, !782, !783, !784, !785, !786, !787, !788, !804, !805, !806, !807, !808, !809, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !328, file: !329, line: 141, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "HV", file: !6, line: 2649, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hv", file: !324, line: 246, size: 192, elements: !335)
!335 = !{!336, !694, !695, !696}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !334, file: !324, line: 247, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVHV", file: !6, line: 2667, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvhv", file: !340, line: 130, size: 256, elements: !341)
!340 = !DIFile(filename: "apps/500.perlbench_r/src/hv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "27f8e9a41fdec76d9a4a382c2975f411")
!341 = !{!342, !343, !692, !693}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !339, file: !340, line: 131, baseType: !332, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !339, file: !340, line: 132, baseType: !344, size: 64, offset: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xmgu", file: !324, line: 494, size: 64, elements: !345)
!345 = !{!346, !691}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_magic", scope: !344, file: !324, line: 495, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAGIC", file: !6, line: 2658, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "magic", file: !350, line: 23, size: 384, elements: !351)
!350 = !DIFile(filename: "apps/500.perlbench_r/src/mg.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4fa2ae981502c39a9854b719090d263f")
!351 = !{!352, !353, !685, !686, !687, !688, !689, !690}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mg_moremagic", scope: !349, file: !350, line: 24, baseType: !347, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mg_virtual", scope: !349, file: !350, line: 25, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MGVTBL", file: !6, line: 2673, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mgvtbl", file: !350, line: 11, size: 512, elements: !357)
!357 = !{!358, !655, !656, !660, !661, !662, !666, !684}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "svt_get", scope: !356, file: !350, line: 12, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!167, !362, !347}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "SV", file: !6, line: 2647, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sv", file: !324, line: 218, size: 192, elements: !365)
!365 = !{!366, !368, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !364, file: !324, line: 219, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !364, file: !324, line: 219, baseType: !246, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !364, file: !324, line: 219, baseType: !246, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !364, file: !324, line: 220, baseType: !371, size: 64, offset: 128)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !364, file: !324, line: 220, size: 64, elements: !372)
!372 = !{!373, !375, !377, !378, !381, !382, !383, !385, !409, !654}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !371, file: !324, line: 220, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !371, file: !324, line: 220, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !6, line: 1670, baseType: !281)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !371, file: !324, line: 220, baseType: !293, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !371, file: !324, line: 220, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "NV", file: !6, line: 1877, baseType: !380)
!380 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !371, file: !324, line: 220, baseType: !362, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !371, file: !324, line: 220, baseType: !327, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !371, file: !324, line: 220, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !371, file: !324, line: 220, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "HE", file: !324, line: 186, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "he", file: !340, line: 32, size: 192, elements: !390)
!390 = !{!391, !392, !402}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hent_next", scope: !389, file: !340, line: 36, baseType: !387, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hent_hek", scope: !389, file: !340, line: 37, baseType: !393, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEK", file: !324, line: 187, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hek", file: !340, line: 45, size: 96, elements: !396)
!396 = !{!397, !398, !400}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "hek_hash", scope: !395, file: !340, line: 46, baseType: !246, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hek_len", scope: !395, file: !340, line: 47, baseType: !399, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "I32", file: !141, line: 174, baseType: !167)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hek_key", scope: !395, file: !340, line: 48, baseType: !401, size: 8, offset: 64)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, elements: !126)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "he_valu", scope: !389, file: !340, line: 41, baseType: !403, size: 64, offset: 128)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !389, file: !340, line: 38, size: 64, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "hent_val", scope: !403, file: !340, line: 39, baseType: !362, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "hent_refcount", scope: !403, file: !340, line: 40, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !408, line: 46, baseType: !222)
!408 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !371, file: !324, line: 220, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "GP", file: !6, line: 2652, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gp", file: !413, line: 11, size: 640, elements: !414)
!413 = !DIFile(filename: "apps/500.perlbench_r/src/gv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9bb5d31ae54fd87680f22708385557b3")
!414 = !{!415, !416, !525, !644, !645, !646, !647, !649, !650, !651, !652, !653}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gp_sv", scope: !412, file: !413, line: 12, baseType: !362, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gp_io", scope: !412, file: !413, line: 13, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io", file: !324, line: 251, size: 192, elements: !419)
!419 = !{!420, !510, !511, !512}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !418, file: !324, line: 252, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVIO", file: !6, line: 2672, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvio", file: !324, line: 603, size: 1088, elements: !424)
!424 = !{!425, !426, !427, !429, !434, !440, !447, !456, !457, !458, !459, !460, !504, !505, !506, !507, !508, !509}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !423, file: !324, line: 604, baseType: !332, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !423, file: !324, line: 604, baseType: !344, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !423, file: !324, line: 604, baseType: !428, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRLEN", file: !6, line: 2615, baseType: !407)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !423, file: !324, line: 604, baseType: !430, size: 64, offset: 192)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !423, file: !324, line: 604, size: 64, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !430, file: !324, line: 604, baseType: !428, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !430, file: !324, line: 604, baseType: !374, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !423, file: !324, line: 605, baseType: !435, size: 64, offset: 256)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xivu", file: !324, line: 488, size: 64, elements: !436)
!436 = !{!437, !438, !439}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_iv", scope: !435, file: !324, line: 489, baseType: !376, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_uv", scope: !435, file: !324, line: 490, baseType: !293, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_namehek", scope: !435, file: !324, line: 491, baseType: !393, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "xio_ofp", scope: !423, file: !324, line: 607, baseType: !441, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIO", file: !443, line: 85, baseType: !444)
!443 = !DIFile(filename: "apps/500.perlbench_r/src/perlio.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "97551467ae05102ac1f9e2f28362d918")
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIOl", file: !443, line: 83, baseType: !446)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PerlIO", file: !443, line: 83, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "xio_dirpu", scope: !423, file: !324, line: 620, baseType: !448, size: 64, offset: 384)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !423, file: !324, line: 617, size: 64, elements: !449)
!449 = !{!450, !455}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_dirp", scope: !448, file: !324, line: 618, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !453, line: 127, baseType: !454)
!453 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "33c45a2c20a17fc93667c8d9aa922ab0")
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !453, line: 127, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_any", scope: !448, file: !324, line: 619, baseType: !367, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page", scope: !423, file: !324, line: 622, baseType: !376, size: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page_len", scope: !423, file: !324, line: 623, baseType: !376, size: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "xio_lines_left", scope: !423, file: !324, line: 624, baseType: !376, size: 64, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_name", scope: !423, file: !324, line: 625, baseType: !374, size: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_gv", scope: !423, file: !324, line: 626, baseType: !461, size: 64, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "GV", file: !6, line: 2653, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gv", file: !324, line: 231, size: 192, elements: !464)
!464 = !{!465, !489, !490, !491}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !463, file: !324, line: 232, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVGV", file: !6, line: 2668, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvgv", file: !324, line: 561, size: 384, elements: !469)
!469 = !{!470, !471, !472, !473, !478, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !468, file: !324, line: 562, baseType: !332, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !468, file: !324, line: 562, baseType: !344, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !468, file: !324, line: 562, baseType: !428, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !468, file: !324, line: 562, baseType: !474, size: 64, offset: 192)
!474 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !468, file: !324, line: 562, size: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !474, file: !324, line: 562, baseType: !428, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !474, file: !324, line: 562, baseType: !374, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !468, file: !324, line: 563, baseType: !435, size: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !468, file: !324, line: 564, baseType: !480, size: 64, offset: 320)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xnvu", file: !324, line: 479, size: 64, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_nv", scope: !480, file: !324, line: 480, baseType: !379, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "xgv_stash", scope: !480, file: !324, line: 481, baseType: !332, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "xpad_cop_seq", scope: !480, file: !324, line: 485, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !480, file: !324, line: 482, size: 64, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !485, file: !324, line: 483, baseType: !246, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !485, file: !324, line: 484, baseType: !246, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !463, file: !324, line: 232, baseType: !246, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !463, file: !324, line: 232, baseType: !246, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !463, file: !324, line: 233, baseType: !492, size: 64, offset: 128)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !463, file: !324, line: 233, size: 64, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !492, file: !324, line: 233, baseType: !374, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !492, file: !324, line: 233, baseType: !376, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !492, file: !324, line: 233, baseType: !293, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !492, file: !324, line: 233, baseType: !379, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !492, file: !324, line: 233, baseType: !362, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !492, file: !324, line: 233, baseType: !327, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !492, file: !324, line: 233, baseType: !384, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !492, file: !324, line: 233, baseType: !386, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !492, file: !324, line: 233, baseType: !410, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !492, file: !324, line: 233, baseType: !441, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_name", scope: !423, file: !324, line: 627, baseType: !374, size: 64, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_gv", scope: !423, file: !324, line: 628, baseType: !461, size: 64, offset: 832)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_name", scope: !423, file: !324, line: 629, baseType: !374, size: 64, offset: 896)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_gv", scope: !423, file: !324, line: 630, baseType: !461, size: 64, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "xio_type", scope: !423, file: !324, line: 631, baseType: !29, size: 8, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "xio_flags", scope: !423, file: !324, line: 632, baseType: !140, size: 8, offset: 1032)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !418, file: !324, line: 252, baseType: !246, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !418, file: !324, line: 252, baseType: !246, size: 32, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !418, file: !324, line: 253, baseType: !513, size: 64, offset: 128)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !418, file: !324, line: 253, size: 64, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !513, file: !324, line: 253, baseType: !374, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !513, file: !324, line: 253, baseType: !376, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !513, file: !324, line: 253, baseType: !293, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !513, file: !324, line: 253, baseType: !379, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !513, file: !324, line: 253, baseType: !362, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !513, file: !324, line: 253, baseType: !327, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !513, file: !324, line: 253, baseType: !384, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !513, file: !324, line: 253, baseType: !386, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !513, file: !324, line: 253, baseType: !410, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !513, file: !324, line: 253, baseType: !441, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cv", scope: !412, file: !413, line: 14, baseType: !526, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "CV", file: !6, line: 2650, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv", file: !324, line: 236, size: 192, elements: !529)
!529 = !{!530, !629, !630, !631}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !528, file: !324, line: 237, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVCV", file: !6, line: 2669, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvcv", file: !534, line: 13, size: 832, elements: !535)
!534 = !DIFile(filename: "apps/500.perlbench_r/src/cv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b8f33b415055b936fc8991c908273806")
!535 = !{!536, !537, !538, !539, !544, !545, !565, !573, !578, !579, !624, !625, !626, !628}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !533, file: !534, line: 14, baseType: !332, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !533, file: !534, line: 14, baseType: !344, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !533, file: !534, line: 14, baseType: !428, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !533, file: !534, line: 14, baseType: !540, size: 64, offset: 192)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !534, line: 14, size: 64, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !540, file: !534, line: 14, baseType: !428, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !540, file: !534, line: 14, baseType: !374, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_stash", scope: !533, file: !534, line: 15, baseType: !332, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start_u", scope: !533, file: !534, line: 15, baseType: !546, size: 64, offset: 320)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !534, line: 15, size: 64, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start", scope: !546, file: !534, line: 15, baseType: !211, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsubany", scope: !546, file: !534, line: 15, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ANY", file: !6, line: 2674, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "any", file: !6, line: 3691, size: 64, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !564}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "any_ptr", scope: !551, file: !6, line: 3692, baseType: !367, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "any_i32", scope: !551, file: !6, line: 3693, baseType: !399, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "any_u32", scope: !551, file: !6, line: 3694, baseType: !246, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "any_iv", scope: !551, file: !6, line: 3695, baseType: !376, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "any_uv", scope: !551, file: !6, line: 3696, baseType: !293, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "any_long", scope: !551, file: !6, line: 3697, baseType: !281, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "any_bool", scope: !551, file: !6, line: 3698, baseType: !288, size: 8)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "any_dptr", scope: !551, file: !6, line: 3699, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !367}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "any_dxptr", scope: !551, file: !6, line: 3700, baseType: !561, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root_u", scope: !533, file: !534, line: 15, baseType: !566, size: 64, offset: 384)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !534, line: 15, size: 64, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root", scope: !566, file: !534, line: 15, baseType: !211, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsub", scope: !566, file: !534, line: 15, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !526}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv_u", scope: !533, file: !534, line: 15, baseType: !574, size: 64, offset: 448)
!574 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !534, line: 15, size: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv", scope: !574, file: !534, line: 15, baseType: !461, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hek", scope: !574, file: !534, line: 15, baseType: !393, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_file", scope: !533, file: !534, line: 15, baseType: !374, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist_u", scope: !533, file: !534, line: 15, baseType: !580, size: 64, offset: 576)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !534, line: 15, size: 64, elements: !581)
!581 = !{!582, !623}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist", scope: !580, file: !534, line: 15, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADLIST", file: !6, line: 2681, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "padlist", file: !221, line: 34, size: 192, elements: !586)
!586 = !{!587, !588, !621, !622}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_max", scope: !585, file: !221, line: 35, baseType: !277, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_alloc", scope: !585, file: !221, line: 36, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAD", file: !6, line: 2682, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV", file: !6, line: 2648, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "av", file: !324, line: 241, size: 192, elements: !594)
!594 = !{!595, !606, !607, !608}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !593, file: !324, line: 242, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVAV", file: !6, line: 2666, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvav", file: !599, line: 11, size: 320, elements: !600)
!599 = !DIFile(filename: "apps/500.perlbench_r/src/av.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3a1f05c53eedc93ff5262833cf63fc72")
!600 = !{!601, !602, !603, !604, !605}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !598, file: !599, line: 12, baseType: !332, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !598, file: !599, line: 13, baseType: !344, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "xav_fill", scope: !598, file: !599, line: 14, baseType: !277, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "xav_max", scope: !598, file: !599, line: 15, baseType: !277, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "xav_alloc", scope: !598, file: !599, line: 16, baseType: !384, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !593, file: !324, line: 242, baseType: !246, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !593, file: !324, line: 242, baseType: !246, size: 32, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !593, file: !324, line: 243, baseType: !609, size: 64, offset: 128)
!609 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !324, line: 243, size: 64, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !609, file: !324, line: 243, baseType: !374, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !609, file: !324, line: 243, baseType: !376, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !609, file: !324, line: 243, baseType: !293, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !609, file: !324, line: 243, baseType: !379, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !609, file: !324, line: 243, baseType: !362, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !609, file: !324, line: 243, baseType: !327, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !609, file: !324, line: 243, baseType: !384, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !609, file: !324, line: 243, baseType: !386, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !609, file: !324, line: 243, baseType: !410, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !609, file: !324, line: 243, baseType: !441, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_id", scope: !585, file: !221, line: 37, baseType: !246, size: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_outid", scope: !585, file: !221, line: 38, baseType: !246, size: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hscxt", scope: !580, file: !534, line: 15, baseType: !367, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside", scope: !533, file: !534, line: 15, baseType: !526, size: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside_seq", scope: !533, file: !534, line: 15, baseType: !246, size: 32, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_flags", scope: !533, file: !534, line: 15, baseType: !627, size: 32, offset: 736)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv_flags_t", file: !324, line: 567, baseType: !246)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_depth", scope: !533, file: !534, line: 15, baseType: !399, size: 32, offset: 768)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !528, file: !324, line: 237, baseType: !246, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !528, file: !324, line: 237, baseType: !246, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !528, file: !324, line: 238, baseType: !632, size: 64, offset: 128)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !324, line: 238, size: 64, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !632, file: !324, line: 238, baseType: !374, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !632, file: !324, line: 238, baseType: !376, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !632, file: !324, line: 238, baseType: !293, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !632, file: !324, line: 238, baseType: !379, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !632, file: !324, line: 238, baseType: !362, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !632, file: !324, line: 238, baseType: !327, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !632, file: !324, line: 238, baseType: !384, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !632, file: !324, line: 238, baseType: !386, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !632, file: !324, line: 238, baseType: !410, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !632, file: !324, line: 238, baseType: !441, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cvgen", scope: !412, file: !413, line: 15, baseType: !246, size: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "gp_refcnt", scope: !412, file: !413, line: 16, baseType: !246, size: 32, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gp_hv", scope: !412, file: !413, line: 17, baseType: !332, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gp_av", scope: !412, file: !413, line: 18, baseType: !648, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gp_form", scope: !412, file: !413, line: 19, baseType: !526, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gp_egv", scope: !412, file: !413, line: 20, baseType: !461, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gp_line", scope: !412, file: !413, line: 21, baseType: !7, size: 31, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gp_flags", scope: !412, file: !413, line: 22, baseType: !7, size: 1, offset: 543, flags: DIFlagBitField, extraData: i64 512)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "gp_file_hek", scope: !412, file: !413, line: 23, baseType: !393, size: 64, offset: 576)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !371, file: !324, line: 220, baseType: !441, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "svt_set", scope: !356, file: !350, line: 13, baseType: !359, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "svt_len", scope: !356, file: !350, line: 14, baseType: !657, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!246, !362, !347}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "svt_clear", scope: !356, file: !350, line: 15, baseType: !359, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "svt_free", scope: !356, file: !350, line: 16, baseType: !359, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "svt_copy", scope: !356, file: !350, line: 17, baseType: !663, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!167, !362, !347, !362, !160, !399}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "svt_dup", scope: !356, file: !350, line: 19, baseType: !667, size: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!167, !347, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLONE_PARAMS", file: !6, line: 2677, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clone_params", file: !324, line: 2150, size: 320, elements: !673)
!673 = !{!674, !675, !676, !682, !683}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stashes", scope: !672, file: !324, line: 2151, baseType: !648, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !672, file: !324, line: 2152, baseType: !293, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "proto_perl", scope: !672, file: !324, line: 2153, baseType: !677, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlInterpreter", file: !6, line: 2639, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "interpreter", file: !6, line: 5434, size: 8, elements: !680)
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "broiled", scope: !679, file: !6, line: 5435, baseType: !29, size: 8)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "new_perl", scope: !672, file: !324, line: 2154, baseType: !677, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "unreferenced", scope: !672, file: !324, line: 2155, baseType: !648, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "svt_local", scope: !356, file: !350, line: 20, baseType: !359, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mg_private", scope: !349, file: !350, line: 26, baseType: !267, size: 16, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mg_type", scope: !349, file: !350, line: 27, baseType: !29, size: 8, offset: 144)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mg_flags", scope: !349, file: !350, line: 28, baseType: !140, size: 8, offset: 152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mg_len", scope: !349, file: !350, line: 29, baseType: !277, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mg_obj", scope: !349, file: !350, line: 30, baseType: !362, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mg_ptr", scope: !349, file: !350, line: 31, baseType: !374, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_hash_index", scope: !344, file: !324, line: 496, baseType: !428, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_keys", scope: !339, file: !340, line: 133, baseType: !428, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_max", scope: !339, file: !340, line: 134, baseType: !428, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !334, file: !324, line: 247, baseType: !246, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !334, file: !324, line: 247, baseType: !246, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !334, file: !324, line: 248, baseType: !697, size: 64, offset: 128)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !324, line: 248, size: 64, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !697, file: !324, line: 248, baseType: !374, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !697, file: !324, line: 248, baseType: !376, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !697, file: !324, line: 248, baseType: !293, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !697, file: !324, line: 248, baseType: !379, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !697, file: !324, line: 248, baseType: !362, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !697, file: !324, line: 248, baseType: !327, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !697, file: !324, line: 248, baseType: !384, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !697, file: !324, line: 248, baseType: !386, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !697, file: !324, line: 248, baseType: !410, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !697, file: !324, line: 248, baseType: !441, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !328, file: !329, line: 141, baseType: !344, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !328, file: !329, line: 141, baseType: !428, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !328, file: !329, line: 141, baseType: !712, size: 64, offset: 192)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !328, file: !329, line: 141, size: 64, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !712, file: !329, line: 141, baseType: !428, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !712, file: !329, line: 141, baseType: !374, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !328, file: !329, line: 142, baseType: !717, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_engine", file: !329, line: 157, size: 768, elements: !720)
!720 = !{!721, !726, !731, !743, !747, !751, !756, !763, !767, !771, !775, !776}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !719, file: !329, line: 158, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!321, !725, !246}
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !719, file: !329, line: 159, baseType: !727, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!399, !730, !374, !374, !374, !277, !362, !367, !246}
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "intuit", scope: !719, file: !329, line: 162, baseType: !732, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!374, !730, !362, !159, !374, !374, !245, !735}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_scream_pos_data", file: !329, line: 152, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_scream_pos_data_s", file: !329, line: 148, size: 128, elements: !738)
!738 = !{!739, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "scream_olds", scope: !737, file: !329, line: 150, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "scream_pos", scope: !737, file: !329, line: 151, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "checkstr", scope: !719, file: !329, line: 170, baseType: !744, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!362, !730}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !719, file: !329, line: 171, baseType: !748, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !730}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_FETCH", scope: !719, file: !329, line: 172, baseType: !752, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !730, !755, !725}
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_STORE", scope: !719, file: !329, line: 174, baseType: !757, size: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !730, !755, !760}
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_LENGTH", scope: !719, file: !329, line: 176, baseType: !764, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!399, !730, !760, !755}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff", scope: !719, file: !329, line: 178, baseType: !768, size: 64, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!362, !730, !725, !725, !245}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff_iter", scope: !719, file: !329, line: 180, baseType: !772, size: 64, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!362, !730, !760, !245}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "qr_package", scope: !719, file: !329, line: 182, baseType: !744, size: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "op_comp", scope: !719, file: !329, line: 186, baseType: !777, size: 64, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!321, !780, !167, !211, !717, !321, !781, !246, !246}
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mother_re", scope: !328, file: !329, line: 142, baseType: !321, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "paren_names", scope: !328, file: !329, line: 142, baseType: !332, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "extflags", scope: !328, file: !329, line: 142, baseType: !246, size: 32, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "minlen", scope: !328, file: !329, line: 142, baseType: !277, size: 64, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "minlenret", scope: !328, file: !329, line: 142, baseType: !277, size: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gofs", scope: !328, file: !329, line: 142, baseType: !428, size: 64, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "substrs", scope: !328, file: !329, line: 142, baseType: !789, size: 64, offset: 704)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_data", file: !329, line: 45, size: 1024, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "check_ix", scope: !790, file: !329, line: 46, baseType: !140, size: 8)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !790, file: !329, line: 47, baseType: !794, size: 960, offset: 64)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 960, elements: !802)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_datum", file: !329, line: 38, size: 320, elements: !796)
!796 = !{!797, !798, !799, !800, !801}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "min_offset", scope: !795, file: !329, line: 39, baseType: !277, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "max_offset", scope: !795, file: !329, line: 40, baseType: !277, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "substr", scope: !795, file: !329, line: 41, baseType: !362, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_substr", scope: !795, file: !329, line: 42, baseType: !362, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "end_shift", scope: !795, file: !329, line: 43, baseType: !277, size: 64, offset: 256)
!802 = !{!803}
!803 = !DISubrange(count: 3)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nparens", scope: !328, file: !329, line: 142, baseType: !246, size: 32, offset: 768)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "intflags", scope: !328, file: !329, line: 142, baseType: !246, size: 32, offset: 800)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pprivate", scope: !328, file: !329, line: 142, baseType: !367, size: 64, offset: 832)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !328, file: !329, line: 142, baseType: !246, size: 32, offset: 896)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !328, file: !329, line: 142, baseType: !246, size: 32, offset: 928)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !328, file: !329, line: 142, baseType: !810, size: 64, offset: 960)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "regexp_paren_pair", file: !329, line: 68, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_paren_pair", file: !329, line: 58, size: 192, elements: !813)
!813 = !{!814, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !812, file: !329, line: 59, baseType: !277, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !812, file: !329, line: 60, baseType: !277, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "start_tmp", scope: !812, file: !329, line: 67, baseType: !277, size: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "subbeg", scope: !328, file: !329, line: 142, baseType: !374, size: 64, offset: 1024)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "saved_copy", scope: !328, file: !329, line: 142, baseType: !362, size: 64, offset: 1088)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sublen", scope: !328, file: !329, line: 142, baseType: !277, size: 64, offset: 1152)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "suboffset", scope: !328, file: !329, line: 142, baseType: !277, size: 64, offset: 1216)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "subcoffset", scope: !328, file: !329, line: 142, baseType: !277, size: 64, offset: 1280)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !328, file: !329, line: 142, baseType: !277, size: 64, offset: 1344)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pre_prefix", scope: !328, file: !329, line: 142, baseType: !7, size: 4, offset: 1408, flags: DIFlagBitField, extraData: i64 1408)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "compflags", scope: !328, file: !329, line: 142, baseType: !7, size: 9, offset: 1412, flags: DIFlagBitField, extraData: i64 1408)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "qr_anoncv", scope: !328, file: !329, line: 142, baseType: !526, size: 64, offset: 1472)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !323, file: !324, line: 257, baseType: !246, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !323, file: !324, line: 257, baseType: !246, size: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !323, file: !324, line: 258, baseType: !829, size: 64, offset: 128)
!829 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !323, file: !324, line: 258, size: 64, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !829, file: !324, line: 258, baseType: !374, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !829, file: !324, line: 258, baseType: !376, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !829, file: !324, line: 258, baseType: !293, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !829, file: !324, line: 258, baseType: !379, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !829, file: !324, line: 258, baseType: !362, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !829, file: !324, line: 258, baseType: !327, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !829, file: !324, line: 258, baseType: !384, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !829, file: !324, line: 258, baseType: !386, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !829, file: !324, line: 258, baseType: !410, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !829, file: !324, line: 258, baseType: !441, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmflags", scope: !302, file: !214, line: 260, baseType: !246, size: 32, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmreplrootu", scope: !302, file: !214, line: 268, baseType: !843, size: 64, offset: 576)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !302, file: !214, line: 261, size: 64, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmreplroot", scope: !843, file: !214, line: 262, baseType: !211, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmtargetgv", scope: !843, file: !214, line: 266, baseType: !461, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmstashstartu", scope: !302, file: !214, line: 276, baseType: !848, size: 64, offset: 640)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !302, file: !214, line: 269, size: 64, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmreplstart", scope: !848, file: !214, line: 270, baseType: !211, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "op_pmstash", scope: !848, file: !214, line: 274, baseType: !332, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "op_code_list", scope: !302, file: !214, line: 277, baseType: !211, size: 64, offset: 704)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "PL_regmatch_slab", scope: !2, file: !276, line: 129, type: !855, isLocal: false, isDefinition: true)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_slab", file: !329, line: 846, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regmatch_slab", file: !329, line: 843, size: 31808, elements: !858)
!858 = !{!859, !1029, !1030}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !857, file: !329, line: 844, baseType: !860, size: 31680)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 31680, elements: !30)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_state", file: !329, line: 834, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regmatch_state", file: !329, line: 665, size: 960, elements: !863)
!863 = !{!864, !865, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "resume_state", scope: !862, file: !329, line: 666, baseType: !167, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "locinput", scope: !862, file: !329, line: 667, baseType: !374, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !862, file: !329, line: 833, baseType: !867, size: 832, offset: 128)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !862, file: !329, line: 669, size: 832, elements: !868)
!868 = !{!869, !895, !896, !900, !908, !923, !940, !951, !958, !965, !969, !981, !991, !1011}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "info_aux", scope: !867, file: !329, line: 690, baseType: !870, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_info_aux", file: !329, line: 627, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 622, size: 256, elements: !872)
!872 = !{!873, !890, !892, !894}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "info_aux_eval", scope: !871, file: !329, line: 623, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_info_aux_eval", file: !329, line: 615, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 602, size: 640, elements: !877)
!877 = !{!878, !881, !882, !883, !884, !885, !886, !887, !888, !889}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rex", scope: !876, file: !329, line: 603, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "regexp", file: !329, line: 143, baseType: !328)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "curpm", scope: !876, file: !329, line: 604, baseType: !300, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "saved_copy", scope: !876, file: !329, line: 606, baseType: !362, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "subbeg", scope: !876, file: !329, line: 608, baseType: !374, size: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sublen", scope: !876, file: !329, line: 609, baseType: !428, size: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "suboffset", scope: !876, file: !329, line: 610, baseType: !428, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "subcoffset", scope: !876, file: !329, line: 611, baseType: !428, size: 64, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pos_magic", scope: !876, file: !329, line: 612, baseType: !347, size: 64, offset: 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !876, file: !329, line: 613, baseType: !277, size: 64, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pos_flags", scope: !876, file: !329, line: 614, baseType: !140, size: 8, offset: 576)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "old_regmatch_state", scope: !871, file: !329, line: 624, baseType: !891, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "old_regmatch_slab", scope: !871, file: !329, line: 625, baseType: !893, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "poscache", scope: !871, file: !329, line: 626, baseType: !374, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "info_aux_eval", scope: !867, file: !329, line: 692, baseType: !875, size: 640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "yes", scope: !867, file: !329, line: 699, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 697, size: 64, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !897, file: !329, line: 698, baseType: !891, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "branchlike", scope: !867, file: !329, line: 711, baseType: !901, size: 192)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 704, size: 192, elements: !902)
!902 = !{!903, !904, !905, !906}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !901, file: !329, line: 706, baseType: !891, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !901, file: !329, line: 707, baseType: !246, size: 32, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !901, file: !329, line: 708, baseType: !246, size: 32, offset: 96)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "cp", scope: !901, file: !329, line: 709, baseType: !907, size: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHECKPOINT", file: !329, line: 663, baseType: !399)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "branch", scope: !867, file: !329, line: 721, baseType: !909, size: 256)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 713, size: 256, elements: !910)
!910 = !{!911, !912, !913, !914, !915}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !909, file: !329, line: 715, baseType: !891, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !909, file: !329, line: 716, baseType: !246, size: 32, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !909, file: !329, line: 717, baseType: !246, size: 32, offset: 96)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "cp", scope: !909, file: !329, line: 718, baseType: !907, size: 32, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "next_branch", scope: !909, file: !329, line: 720, baseType: !916, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "regnode", file: !329, line: 29, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regnode", file: !329, line: 23, size: 32, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !918, file: !329, line: 24, baseType: !140, size: 8)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !918, file: !329, line: 25, baseType: !140, size: 8, offset: 8)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "next_off", scope: !918, file: !329, line: 26, baseType: !267, size: 16, offset: 16)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "trie", scope: !867, file: !329, line: 738, baseType: !924, size: 512)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 723, size: 512, elements: !925)
!925 = !{!926, !927, !928, !929, !930, !931, !932, !934, !935, !937, !938, !939}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !924, file: !329, line: 725, baseType: !891, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !924, file: !329, line: 726, baseType: !246, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !924, file: !329, line: 727, baseType: !246, size: 32, offset: 96)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "cp", scope: !924, file: !329, line: 728, baseType: !907, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "accepted", scope: !924, file: !329, line: 730, baseType: !246, size: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "longfold", scope: !924, file: !329, line: 731, baseType: !288, size: 8, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !924, file: !329, line: 732, baseType: !933, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "me", scope: !924, file: !329, line: 733, baseType: !916, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "firstpos", scope: !924, file: !329, line: 734, baseType: !936, size: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "firstchars", scope: !924, file: !329, line: 735, baseType: !246, size: 32, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nextword", scope: !924, file: !329, line: 736, baseType: !267, size: 16, offset: 480)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "topword", scope: !924, file: !329, line: 737, baseType: !267, size: 16, offset: 496)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !867, file: !329, line: 752, baseType: !941, size: 448)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 742, size: 448, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949, !950}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !941, file: !329, line: 744, baseType: !891, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "prev_eval", scope: !941, file: !329, line: 745, baseType: !891, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "prev_curlyx", scope: !941, file: !329, line: 746, baseType: !891, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "prev_rex", scope: !941, file: !329, line: 747, baseType: !321, size: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "cp", scope: !941, file: !329, line: 748, baseType: !907, size: 32, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "lastcp", scope: !941, file: !329, line: 749, baseType: !907, size: 32, offset: 288)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "close_paren", scope: !941, file: !329, line: 750, baseType: !246, size: 32, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !941, file: !329, line: 751, baseType: !916, size: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ifmatch", scope: !867, file: !329, line: 760, baseType: !952, size: 192)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 754, size: 192, elements: !953)
!953 = !{!954, !955, !956, !957}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !952, file: !329, line: 756, baseType: !891, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "wanted", scope: !952, file: !329, line: 757, baseType: !399, size: 32, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "logical", scope: !952, file: !329, line: 758, baseType: !399, size: 32, offset: 96)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "me", scope: !952, file: !329, line: 759, baseType: !916, size: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !867, file: !329, line: 768, baseType: !959, size: 256)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 762, size: 256, elements: !960)
!960 = !{!961, !962, !963, !964}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !959, file: !329, line: 764, baseType: !891, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "prev_mark", scope: !959, file: !329, line: 765, baseType: !891, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "mark_name", scope: !959, file: !329, line: 766, baseType: !362, size: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mark_loc", scope: !959, file: !329, line: 767, baseType: !374, size: 64, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "keeper", scope: !867, file: !329, line: 772, baseType: !966, size: 32)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 770, size: 32, elements: !967)
!967 = !{!968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !966, file: !329, line: 771, baseType: !167, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "curlyx", scope: !867, file: !329, line: 789, baseType: !970, size: 448)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 776, size: 448, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979, !980}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !970, file: !329, line: 778, baseType: !891, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "prev_curlyx", scope: !970, file: !329, line: 779, baseType: !891, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "me", scope: !970, file: !329, line: 780, baseType: !916, size: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !970, file: !329, line: 781, baseType: !916, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "cp", scope: !970, file: !329, line: 782, baseType: !907, size: 32, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "minmod", scope: !970, file: !329, line: 783, baseType: !288, size: 8, offset: 288)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "parenfloor", scope: !970, file: !329, line: 784, baseType: !167, size: 32, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !970, file: !329, line: 787, baseType: !167, size: 32, offset: 352)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "lastloc", scope: !970, file: !329, line: 788, baseType: !374, size: 64, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "whilem", scope: !867, file: !329, line: 800, baseType: !982, size: 320)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 791, size: 320, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !982, file: !329, line: 793, baseType: !891, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "save_curlyx", scope: !982, file: !329, line: 794, baseType: !891, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "cp", scope: !982, file: !329, line: 795, baseType: !907, size: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lastcp", scope: !982, file: !329, line: 796, baseType: !907, size: 32, offset: 160)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "save_lastloc", scope: !982, file: !329, line: 797, baseType: !374, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "cache_offset", scope: !982, file: !329, line: 798, baseType: !399, size: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "cache_mask", scope: !982, file: !329, line: 799, baseType: !399, size: 32, offset: 288)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "curlym", scope: !867, file: !329, line: 816, baseType: !992, size: 768)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 802, size: 768, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1010}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "prev_yes_state", scope: !992, file: !329, line: 804, baseType: !891, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !992, file: !329, line: 805, baseType: !167, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !992, file: !329, line: 805, baseType: !167, size: 32, offset: 96)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "cp", scope: !992, file: !329, line: 806, baseType: !907, size: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !992, file: !329, line: 807, baseType: !246, size: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !992, file: !329, line: 808, baseType: !246, size: 32, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !992, file: !329, line: 809, baseType: !399, size: 32, offset: 224)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !992, file: !329, line: 810, baseType: !399, size: 32, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "minmod", scope: !992, file: !329, line: 811, baseType: !288, size: 8, offset: 288)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !992, file: !329, line: 812, baseType: !916, size: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !992, file: !329, line: 812, baseType: !916, size: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "me", scope: !992, file: !329, line: 813, baseType: !916, size: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "c1_utf8", scope: !992, file: !329, line: 814, baseType: !1007, size: 112, offset: 512)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 112, elements: !1008)
!1008 = !{!1009}
!1009 = !DISubrange(count: 14)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "c2_utf8", scope: !992, file: !329, line: 815, baseType: !1007, size: 112, offset: 624)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "curly", scope: !867, file: !329, line: 831, baseType: !1012, size: 832)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !329, line: 818, size: 832, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "paren", scope: !1012, file: !329, line: 819, baseType: !246, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "cp", scope: !1012, file: !329, line: 820, baseType: !907, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !1012, file: !329, line: 821, baseType: !246, size: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !1012, file: !329, line: 822, baseType: !246, size: 32, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !1012, file: !329, line: 823, baseType: !167, size: 32, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !1012, file: !329, line: 823, baseType: !167, size: 32, offset: 160)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "maxpos", scope: !1012, file: !329, line: 824, baseType: !374, size: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "oldloc", scope: !1012, file: !329, line: 825, baseType: !374, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1012, file: !329, line: 826, baseType: !167, size: 32, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1012, file: !329, line: 827, baseType: !167, size: 32, offset: 352)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1012, file: !329, line: 827, baseType: !167, size: 32, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !1012, file: !329, line: 828, baseType: !916, size: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !1012, file: !329, line: 828, baseType: !916, size: 64, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "c1_utf8", scope: !1012, file: !329, line: 829, baseType: !1007, size: 112, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "c2_utf8", scope: !1012, file: !329, line: 830, baseType: !1007, size: 112, offset: 688)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !857, file: !329, line: 845, baseType: !893, size: 64, offset: 31680)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !857, file: !329, line: 845, baseType: !893, size: 64, offset: 31744)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "PL_statname", scope: !2, file: !276, line: 179, type: !362, isLocal: false, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "PL_chopset", scope: !2, file: !276, line: 206, type: !160, isLocal: false, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(name: "PL_errors", scope: !2, file: !276, line: 217, type: !362, isLocal: false, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "PL_dumpindent", scope: !2, file: !276, line: 234, type: !267, isLocal: false, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "PL_peepp", scope: !2, file: !276, line: 268, type: !1041, isLocal: false, isDefinition: true)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "peep_t", file: !6, line: 5382, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{null, !211}
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "PL_rpeepp", scope: !2, file: !276, line: 292, type: !1041, isLocal: false, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "PL_opfreehook", scope: !2, file: !276, line: 306, type: !1049, isLocal: false, isDefinition: true)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "Perl_ophook_t", file: !6, line: 5406, baseType: !1042)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "PL_watchaddr", scope: !2, file: !276, line: 308, type: !740, isLocal: false, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "PL_xsubfilename", scope: !2, file: !276, line: 324, type: !160, isLocal: false, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(name: "PL_splitstr", scope: !2, file: !276, line: 331, type: !160, isLocal: false, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(name: "PL_maxsysfd", scope: !2, file: !276, line: 347, type: !399, isLocal: false, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(name: "PL_sig_pending", scope: !2, file: !276, line: 356, type: !167, isLocal: false, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(name: "PL_op_mask", scope: !2, file: !276, line: 420, type: !374, isLocal: false, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(name: "PL_curcopdb", scope: !2, file: !276, line: 430, type: !1064, isLocal: false, isDefinition: true)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "COP", file: !6, line: 2618, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cop", file: !1067, line: 393, size: 640, elements: !1068)
!1067 = !DIFile(filename: "apps/500.perlbench_r/src/cop.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "64d4f81e93be43c58d053d27101a3a5e")
!1068 = !{!1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1085, !1086, !1087, !1088, !1089, !1091}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !1066, file: !1067, line: 394, baseType: !211, size: 64)
