; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/500.perlbench_r/llvm-ir/500.perlbench_r_bc/src/perlio.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/500.perlbench_r/src/perlio.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sv = type { ptr, i32, i32, %union.anon }
%union.anon = type { ptr }
%struct._PerlIO_funcs = type { i64, ptr, i64, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct._PerlIO = type { ptr, ptr, i32, i32, ptr }
%struct.PerlIO_list_s = type { i64, i64, i64, ptr }
%struct.PerlIO_pair_t = type { ptr, ptr }
%struct.cv = type { ptr, i32, i32, %union.anon.3 }
%union.anon.3 = type { ptr }
%struct.xpv = type { ptr, %union._xmgu, i64, %union.anon.16 }
%union._xmgu = type { ptr }
%union.anon.16 = type { i64 }
%struct.xpviv = type { ptr, %union._xmgu, i64, %union.anon.17, %union._xivu }
%union.anon.17 = type { i64 }
%union._xivu = type { i64 }
%struct.xpvnv = type { ptr, %union._xmgu, i64, %union.anon.18, %union._xivu, %union._xnvu }
%union.anon.18 = type { i64 }
%union._xnvu = type { double }
%struct.cop = type { ptr, ptr, ptr, i64, i16, i8, i8, i32, ptr, ptr, i32, i32, ptr, ptr }
%struct.PerlIOBuf = type { %struct._PerlIO, ptr, ptr, ptr, i64, i64, i64 }
%struct.PerlIOUnix = type { %struct._PerlIO, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PerlIO_perlio", scope: !2, file: !748, line: 4328, type: !839, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !836, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/500.perlbench_r/src/perlio.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/500.perlbench_r", checksumkind: CSK_MD5, checksum: "8d0545f295fed0a9104caa3081f54687")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 132, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "apps/500.perlbench_r/src/sv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "e8ddee5f0a5032210b880c8e95bcea58")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!9 = !DIEnumerator(name: "SVt_NULL", value: 0)
!10 = !DIEnumerator(name: "SVt_IV", value: 1)
!11 = !DIEnumerator(name: "SVt_NV", value: 2)
!12 = !DIEnumerator(name: "SVt_PV", value: 3)
!13 = !DIEnumerator(name: "SVt_INVLIST", value: 4)
!14 = !DIEnumerator(name: "SVt_PVIV", value: 5)
!15 = !DIEnumerator(name: "SVt_PVNV", value: 6)
!16 = !DIEnumerator(name: "SVt_PVMG", value: 7)
!17 = !DIEnumerator(name: "SVt_REGEXP", value: 8)
!18 = !DIEnumerator(name: "SVt_PVGV", value: 9)
!19 = !DIEnumerator(name: "SVt_PVLV", value: 10)
!20 = !DIEnumerator(name: "SVt_PVAV", value: 11)
!21 = !DIEnumerator(name: "SVt_PVHV", value: 12)
!22 = !DIEnumerator(name: "SVt_PVCV", value: 13)
!23 = !DIEnumerator(name: "SVt_PVFM", value: 14)
!24 = !DIEnumerator(name: "SVt_PVIO", value: 15)
!25 = !DIEnumerator(name: "SVt_LAST", value: 16)
!26 = !{!27, !28, !59, !66, !618, !61, !626, !41, !139, !56, !152, !117, !158, !129, !45, !695, !365, !707, !708, !721, !289, !36, !76, !73, !735, !677, !746, !657, !754, !808, !810, !290, !816, !833, !834, !835}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIOl", file: !30, line: 83, baseType: !31)
!30 = !DIFile(filename: "apps/500.perlbench_r/src/perlio.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "97551467ae05102ac1f9e2f28362d918")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PerlIO", file: !32, line: 66, size: 256, elements: !33)
!32 = !DIFile(filename: "apps/500.perlbench_r/src/perliol.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2d9de85bae3f71c4cc9ed495c75b11f0")
!33 = !{!34, !35, !692, !693, !694}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !32, line: 67, baseType: !28, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !31, file: !32, line: 68, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIO_funcs", file: !30, line: 84, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PerlIO_funcs", file: !32, line: 16, size: 1792, elements: !39)
!39 = !{!40, !44, !48, !49, !52, !610, !614, !632, !633, !637, !638, !642, !646, !652, !653, !659, !663, !664, !665, !666, !667, !668, !672, !673, !679, !683, !684, !688}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !38, file: !32, line: 17, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 46, baseType: !43)
!42 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!43 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !32, line: 18, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !38, file: !32, line: 19, baseType: !41, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !38, file: !32, line: 20, baseType: !50, size: 32, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "U32", file: !51, line: 175, baseType: !7)
!51 = !DIFile(filename: "apps/500.perlbench_r/src/handy.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "c8309d47b4ac9e3aa493b22b0023a43d")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Pushed", scope: !38, file: !32, line: 21, baseType: !53, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !59, !45, !61, !36}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !57, line: 1670, baseType: !58)
!57 = !DIFile(filename: "apps/500.perlbench_r/src/perl.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "d6cbd7c2824e8e37adbd28e0286c9085")
!58 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIO", file: !30, line: 85, baseType: !28)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "SV", file: !57, line: 2647, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sv", file: !6, line: 218, size: 192, elements: !64)
!64 = !{!65, !67, !68, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !63, file: !6, line: 219, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !63, file: !6, line: 219, baseType: !50, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !63, file: !6, line: 219, baseType: !50, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !63, file: !6, line: 220, baseType: !70, size: 64, offset: 128)
!70 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !63, file: !6, line: 220, size: 64, elements: !71)
!71 = !{!72, !74, !75, !77, !80, !81, !606, !607, !608, !609}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !70, file: !6, line: 220, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !70, file: !6, line: 220, baseType: !56, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !70, file: !6, line: 220, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV", file: !57, line: 1671, baseType: !43)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !70, file: !6, line: 220, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "NV", file: !57, line: 1877, baseType: !79)
!79 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !70, file: !6, line: 220, baseType: !61, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !70, file: !6, line: 220, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp", file: !84, line: 140, size: 1536, elements: !85)
!84 = !DIFile(filename: "apps/500.perlbench_r/src/regexp.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "83285f03b848d0cf5e30c9354282eae6")
!85 = !{!86, !467, !468, !469, !474, !562, !563, !564, !565, !566, !567, !568, !584, !585, !586, !587, !588, !589, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !83, file: !84, line: 141, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "HV", file: !57, line: 2649, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hv", file: !6, line: 246, size: 192, elements: !90)
!90 = !{!91, !452, !453, !454}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !89, file: !6, line: 247, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVHV", file: !57, line: 2667, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvhv", file: !95, line: 130, size: 256, elements: !96)
!95 = !DIFile(filename: "apps/500.perlbench_r/src/hv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "27f8e9a41fdec76d9a4a382c2975f411")
!96 = !{!97, !98, !450, !451}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !94, file: !95, line: 131, baseType: !87, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !94, file: !95, line: 132, baseType: !99, size: 64, offset: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xmgu", file: !6, line: 494, size: 64, elements: !100)
!100 = !{!101, !449}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_magic", scope: !99, file: !6, line: 495, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAGIC", file: !57, line: 2658, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "magic", file: !105, line: 23, size: 384, elements: !106)
!105 = !DIFile(filename: "apps/500.perlbench_r/src/mg.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "4fa2ae981502c39a9854b719090d263f")
!106 = !{!107, !108, !441, !444, !445, !446, !447, !448}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mg_moremagic", scope: !104, file: !105, line: 24, baseType: !102, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mg_virtual", scope: !104, file: !105, line: 25, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "MGVTBL", file: !57, line: 2673, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mgvtbl", file: !105, line: 11, size: 512, elements: !112)
!112 = !{!113, !118, !119, !123, !124, !125, !130, !440}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "svt_get", scope: !111, file: !105, line: 12, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!117, !61, !102}
!117 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "svt_set", scope: !111, file: !105, line: 13, baseType: !114, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "svt_len", scope: !111, file: !105, line: 14, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!50, !61, !102}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "svt_clear", scope: !111, file: !105, line: 15, baseType: !114, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "svt_free", scope: !111, file: !105, line: 16, baseType: !114, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "svt_copy", scope: !111, file: !105, line: 17, baseType: !126, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!117, !61, !102, !61, !45, !129}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "I32", file: !51, line: 174, baseType: !117)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "svt_dup", scope: !111, file: !105, line: 19, baseType: !131, size: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!117, !102, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLONE_PARAMS", file: !57, line: 2677, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clone_params", file: !6, line: 2150, size: 320, elements: !137)
!137 = !{!138, !431, !432, !438, !439}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "stashes", scope: !136, file: !6, line: 2151, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV", file: !57, line: 2648, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "av", file: !6, line: 241, size: 192, elements: !142)
!142 = !{!143, !159, !160, !161}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !141, file: !6, line: 242, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVAV", file: !57, line: 2666, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvav", file: !147, line: 11, size: 320, elements: !148)
!147 = !DIFile(filename: "apps/500.perlbench_r/src/av.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3a1f05c53eedc93ff5262833cf63fc72")
!148 = !{!149, !150, !151, !156, !157}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !146, file: !147, line: 12, baseType: !87, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !146, file: !147, line: 13, baseType: !99, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "xav_fill", scope: !146, file: !147, line: 14, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !153, line: 108, baseType: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !155, line: 193, baseType: !58)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "xav_max", scope: !146, file: !147, line: 15, baseType: !152, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "xav_alloc", scope: !146, file: !147, line: 16, baseType: !158, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !141, file: !6, line: 242, baseType: !50, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !141, file: !6, line: 242, baseType: !50, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !141, file: !6, line: 243, baseType: !162, size: 64, offset: 128)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !141, file: !6, line: 243, size: 64, elements: !163)
!163 = !{!164, !165, !166, !167, !168, !169, !170, !171, !194, !430}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !162, file: !6, line: 243, baseType: !73, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !162, file: !6, line: 243, baseType: !56, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !162, file: !6, line: 243, baseType: !76, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !162, file: !6, line: 243, baseType: !78, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !162, file: !6, line: 243, baseType: !61, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !162, file: !6, line: 243, baseType: !82, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !162, file: !6, line: 243, baseType: !158, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !162, file: !6, line: 243, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "HE", file: !6, line: 186, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "he", file: !95, line: 32, size: 192, elements: !176)
!176 = !{!177, !178, !189}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "hent_next", scope: !175, file: !95, line: 36, baseType: !173, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "hent_hek", scope: !175, file: !95, line: 37, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEK", file: !6, line: 187, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hek", file: !95, line: 45, size: 96, elements: !182)
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "hek_hash", scope: !181, file: !95, line: 46, baseType: !50, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "hek_len", scope: !181, file: !95, line: 47, baseType: !129, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "hek_key", scope: !181, file: !95, line: 48, baseType: !186, size: 8, offset: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 1)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "he_valu", scope: !175, file: !95, line: 41, baseType: !190, size: 64, offset: 128)
!190 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !175, file: !95, line: 38, size: 64, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hent_val", scope: !190, file: !95, line: 39, baseType: !61, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "hent_refcount", scope: !190, file: !95, line: 40, baseType: !41, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !162, file: !6, line: 243, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "GP", file: !57, line: 2652, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gp", file: !198, line: 11, size: 640, elements: !199)
!198 = !DIFile(filename: "apps/500.perlbench_r/src/gv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9bb5d31ae54fd87680f22708385557b3")
!199 = !{!200, !201, !306, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "gp_sv", scope: !197, file: !198, line: 12, baseType: !61, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "gp_io", scope: !197, file: !198, line: 13, baseType: !202, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io", file: !6, line: 251, size: 192, elements: !204)
!204 = !{!205, !291, !292, !293}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !203, file: !6, line: 252, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVIO", file: !57, line: 2672, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvio", file: !6, line: 603, size: 1088, elements: !209)
!209 = !{!210, !211, !212, !214, !219, !225, !226, !235, !236, !237, !238, !239, !283, !284, !285, !286, !287, !288}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !208, file: !6, line: 604, baseType: !87, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !208, file: !6, line: 604, baseType: !99, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !208, file: !6, line: 604, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRLEN", file: !57, line: 2615, baseType: !41)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !208, file: !6, line: 604, baseType: !215, size: 64, offset: 192)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !208, file: !6, line: 604, size: 64, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !215, file: !6, line: 604, baseType: !213, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !215, file: !6, line: 604, baseType: !73, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !208, file: !6, line: 605, baseType: !220, size: 64, offset: 256)
!220 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xivu", file: !6, line: 488, size: 64, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_iv", scope: !220, file: !6, line: 489, baseType: !56, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_uv", scope: !220, file: !6, line: 490, baseType: !76, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "xivu_namehek", scope: !220, file: !6, line: 491, baseType: !179, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "xio_ofp", scope: !208, file: !6, line: 607, baseType: !59, size: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "xio_dirpu", scope: !208, file: !6, line: 620, baseType: !227, size: 64, offset: 384)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !208, file: !6, line: 617, size: 64, elements: !228)
!228 = !{!229, !234}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_dirp", scope: !227, file: !6, line: 618, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !232, line: 127, baseType: !233)
!232 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "33c45a2c20a17fc93667c8d9aa922ab0")
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !232, line: 127, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "xiou_any", scope: !227, file: !6, line: 619, baseType: !66, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page", scope: !208, file: !6, line: 622, baseType: !56, size: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "xio_page_len", scope: !208, file: !6, line: 623, baseType: !56, size: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "xio_lines_left", scope: !208, file: !6, line: 624, baseType: !56, size: 64, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_name", scope: !208, file: !6, line: 625, baseType: !73, size: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "xio_top_gv", scope: !208, file: !6, line: 626, baseType: !240, size: 64, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GV", file: !57, line: 2653, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gv", file: !6, line: 231, size: 192, elements: !243)
!243 = !{!244, !268, !269, !270}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !242, file: !6, line: 232, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVGV", file: !57, line: 2668, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvgv", file: !6, line: 561, size: 384, elements: !248)
!248 = !{!249, !250, !251, !252, !257, !258}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !247, file: !6, line: 562, baseType: !87, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !247, file: !6, line: 562, baseType: !99, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !247, file: !6, line: 562, baseType: !213, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !247, file: !6, line: 562, baseType: !253, size: 64, offset: 192)
!253 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !6, line: 562, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !253, file: !6, line: 562, baseType: !213, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !253, file: !6, line: 562, baseType: !73, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !247, file: !6, line: 563, baseType: !220, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !247, file: !6, line: 564, baseType: !259, size: 64, offset: 320)
!259 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_xnvu", file: !6, line: 479, size: 64, elements: !260)
!260 = !{!261, !262, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_nv", scope: !259, file: !6, line: 480, baseType: !78, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "xgv_stash", scope: !259, file: !6, line: 481, baseType: !87, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "xpad_cop_seq", scope: !259, file: !6, line: 485, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !259, file: !6, line: 482, size: 64, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !264, file: !6, line: 483, baseType: !50, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !264, file: !6, line: 484, baseType: !50, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !242, file: !6, line: 232, baseType: !50, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !242, file: !6, line: 232, baseType: !50, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !242, file: !6, line: 233, baseType: !271, size: 64, offset: 128)
!271 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !6, line: 233, size: 64, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !271, file: !6, line: 233, baseType: !73, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !271, file: !6, line: 233, baseType: !56, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !271, file: !6, line: 233, baseType: !76, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !271, file: !6, line: 233, baseType: !78, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !271, file: !6, line: 233, baseType: !61, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !271, file: !6, line: 233, baseType: !82, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !271, file: !6, line: 233, baseType: !158, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !271, file: !6, line: 233, baseType: !172, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !271, file: !6, line: 233, baseType: !195, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !271, file: !6, line: 233, baseType: !59, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_name", scope: !208, file: !6, line: 627, baseType: !73, size: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "xio_fmt_gv", scope: !208, file: !6, line: 628, baseType: !240, size: 64, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_name", scope: !208, file: !6, line: 629, baseType: !73, size: 64, offset: 896)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "xio_bottom_gv", scope: !208, file: !6, line: 630, baseType: !240, size: 64, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "xio_type", scope: !208, file: !6, line: 631, baseType: !47, size: 8, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "xio_flags", scope: !208, file: !6, line: 632, baseType: !289, size: 8, offset: 1032)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "U8", file: !51, line: 171, baseType: !290)
!290 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !203, file: !6, line: 252, baseType: !50, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !203, file: !6, line: 252, baseType: !50, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !203, file: !6, line: 253, baseType: !294, size: 64, offset: 128)
!294 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !6, line: 253, size: 64, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !294, file: !6, line: 253, baseType: !73, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !294, file: !6, line: 253, baseType: !56, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !294, file: !6, line: 253, baseType: !76, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !294, file: !6, line: 253, baseType: !78, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !294, file: !6, line: 253, baseType: !61, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !294, file: !6, line: 253, baseType: !82, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !294, file: !6, line: 253, baseType: !158, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !294, file: !6, line: 253, baseType: !172, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !294, file: !6, line: 253, baseType: !195, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !294, file: !6, line: 253, baseType: !59, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cv", scope: !197, file: !198, line: 14, baseType: !307, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "CV", file: !57, line: 2650, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv", file: !6, line: 236, size: 192, elements: !310)
!310 = !{!311, !406, !407, !408}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !309, file: !6, line: 237, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVCV", file: !57, line: 2669, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvcv", file: !315, line: 13, size: 832, elements: !316)
!315 = !DIFile(filename: "apps/500.perlbench_r/src/cv.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b8f33b415055b936fc8991c908273806")
!316 = !{!317, !318, !319, !320, !325, !326, !371, !379, !384, !385, !401, !402, !403, !405}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !314, file: !315, line: 14, baseType: !87, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !314, file: !315, line: 14, baseType: !99, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !314, file: !315, line: 14, baseType: !213, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !314, file: !315, line: 14, baseType: !321, size: 64, offset: 192)
!321 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !315, line: 14, size: 64, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !321, file: !315, line: 14, baseType: !213, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !321, file: !315, line: 14, baseType: !73, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_stash", scope: !314, file: !315, line: 15, baseType: !87, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start_u", scope: !314, file: !315, line: 15, baseType: !327, size: 64, offset: 320)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !315, line: 15, size: 64, elements: !328)
!328 = !{!329, !354}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_start", scope: !327, file: !315, line: 15, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "OP", file: !57, line: 2617, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !333, line: 202, size: 320, elements: !334)
!333 = !DIFile(filename: "apps/500.perlbench_r/src/op.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "b88d747a6f3149f06a4a1e8e725e6800")
!334 = !{!335, !336, !337, !341, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "op_next", scope: !332, file: !333, line: 203, baseType: !330, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "op_sibling", scope: !332, file: !333, line: 203, baseType: !330, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "op_ppaddr", scope: !332, file: !333, line: 203, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!330}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "op_targ", scope: !332, file: !333, line: 203, baseType: !342, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADOFFSET", file: !343, line: 25, baseType: !43)
!343 = !DIFile(filename: "apps/500.perlbench_r/src/pad.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "07d0fc40568e154e930466504379a358")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !332, file: !333, line: 203, baseType: !7, size: 9, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "op_opt", scope: !332, file: !333, line: 203, baseType: !7, size: 1, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "op_slabbed", scope: !332, file: !333, line: 203, baseType: !7, size: 1, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "op_savefree", scope: !332, file: !333, line: 203, baseType: !7, size: 1, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "op_static", scope: !332, file: !333, line: 203, baseType: !7, size: 1, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "op_folded", scope: !332, file: !333, line: 203, baseType: !7, size: 1, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "op_moresib", scope: !332, file: !333, line: 203, baseType: !7, size: 1, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "op_spare", scope: !332, file: !333, line: 203, baseType: !7, size: 1, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "op_flags", scope: !332, file: !333, line: 203, baseType: !289, size: 8, offset: 272)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "op_private", scope: !332, file: !333, line: 203, baseType: !289, size: 8, offset: 280)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsubany", scope: !327, file: !315, line: 15, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ANY", file: !57, line: 2674, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "any", file: !57, line: 3691, size: 64, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !366, !370}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "any_ptr", scope: !356, file: !57, line: 3692, baseType: !66, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "any_i32", scope: !356, file: !57, line: 3693, baseType: !129, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "any_u32", scope: !356, file: !57, line: 3694, baseType: !50, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "any_iv", scope: !356, file: !57, line: 3695, baseType: !56, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "any_uv", scope: !356, file: !57, line: 3696, baseType: !76, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "any_long", scope: !356, file: !57, line: 3697, baseType: !58, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "any_bool", scope: !356, file: !57, line: 3698, baseType: !365, size: 8)
!365 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "any_dptr", scope: !356, file: !57, line: 3699, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !66}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "any_dxptr", scope: !356, file: !57, line: 3700, baseType: !367, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root_u", scope: !314, file: !315, line: 15, baseType: !372, size: 64, offset: 384)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !315, line: 15, size: 64, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_root", scope: !372, file: !315, line: 15, baseType: !330, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_xsub", scope: !372, file: !315, line: 15, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !307}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv_u", scope: !314, file: !315, line: 15, baseType: !380, size: 64, offset: 448)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !315, line: 15, size: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_gv", scope: !380, file: !315, line: 15, baseType: !240, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hek", scope: !380, file: !315, line: 15, baseType: !179, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_file", scope: !314, file: !315, line: 15, baseType: !73, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist_u", scope: !314, file: !315, line: 15, baseType: !386, size: 64, offset: 576)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !315, line: 15, size: 64, elements: !387)
!387 = !{!388, !400}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_padlist", scope: !386, file: !315, line: 15, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PADLIST", file: !57, line: 2681, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "padlist", file: !343, line: 34, size: 192, elements: !392)
!392 = !{!393, !394, !398, !399}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_max", scope: !391, file: !343, line: 35, baseType: !152, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_alloc", scope: !391, file: !343, line: 36, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAD", file: !57, line: 2682, baseType: !140)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_id", scope: !391, file: !343, line: 37, baseType: !50, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "xpadl_outid", scope: !391, file: !343, line: 38, baseType: !50, size: 32, offset: 160)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_hscxt", scope: !386, file: !315, line: 15, baseType: !66, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside", scope: !314, file: !315, line: 15, baseType: !307, size: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_outside_seq", scope: !314, file: !315, line: 15, baseType: !50, size: 32, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_flags", scope: !314, file: !315, line: 15, baseType: !404, size: 32, offset: 736)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv_flags_t", file: !6, line: 567, baseType: !50)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "xcv_depth", scope: !314, file: !315, line: 15, baseType: !129, size: 32, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !309, file: !6, line: 237, baseType: !50, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !309, file: !6, line: 237, baseType: !50, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !309, file: !6, line: 238, baseType: !409, size: 64, offset: 128)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !6, line: 238, size: 64, elements: !410)
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !409, file: !6, line: 238, baseType: !73, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !409, file: !6, line: 238, baseType: !56, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !409, file: !6, line: 238, baseType: !76, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !409, file: !6, line: 238, baseType: !78, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !409, file: !6, line: 238, baseType: !61, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !409, file: !6, line: 238, baseType: !82, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !409, file: !6, line: 238, baseType: !158, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !409, file: !6, line: 238, baseType: !172, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !409, file: !6, line: 238, baseType: !195, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !409, file: !6, line: 238, baseType: !59, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gp_cvgen", scope: !197, file: !198, line: 15, baseType: !50, size: 32, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gp_refcnt", scope: !197, file: !198, line: 16, baseType: !50, size: 32, offset: 224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gp_hv", scope: !197, file: !198, line: 17, baseType: !87, size: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gp_av", scope: !197, file: !198, line: 18, baseType: !139, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gp_form", scope: !197, file: !198, line: 19, baseType: !307, size: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gp_egv", scope: !197, file: !198, line: 20, baseType: !240, size: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gp_line", scope: !197, file: !198, line: 21, baseType: !7, size: 31, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gp_flags", scope: !197, file: !198, line: 22, baseType: !7, size: 1, offset: 543, flags: DIFlagBitField, extraData: i64 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gp_file_hek", scope: !197, file: !198, line: 23, baseType: !179, size: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !162, file: !6, line: 243, baseType: !59, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !6, line: 2152, baseType: !76, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "proto_perl", scope: !136, file: !6, line: 2153, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlInterpreter", file: !57, line: 2639, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "interpreter", file: !57, line: 5434, size: 8, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "broiled", scope: !435, file: !57, line: 5435, baseType: !47, size: 8)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "new_perl", scope: !136, file: !6, line: 2154, baseType: !433, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "unreferenced", scope: !136, file: !6, line: 2155, baseType: !139, size: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "svt_local", scope: !111, file: !105, line: 20, baseType: !114, size: 64, offset: 448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mg_private", scope: !104, file: !105, line: 26, baseType: !442, size: 16, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "U16", file: !51, line: 173, baseType: !443)
!443 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mg_type", scope: !104, file: !105, line: 27, baseType: !47, size: 8, offset: 144)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mg_flags", scope: !104, file: !105, line: 28, baseType: !289, size: 8, offset: 152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mg_len", scope: !104, file: !105, line: 29, baseType: !152, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mg_obj", scope: !104, file: !105, line: 30, baseType: !61, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mg_ptr", scope: !104, file: !105, line: 31, baseType: !73, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_hash_index", scope: !99, file: !6, line: 496, baseType: !213, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_keys", scope: !94, file: !95, line: 133, baseType: !213, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "xhv_max", scope: !94, file: !95, line: 134, baseType: !213, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !89, file: !6, line: 247, baseType: !50, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !89, file: !6, line: 247, baseType: !50, size: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !89, file: !6, line: 248, baseType: !455, size: 64, offset: 128)
!455 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !89, file: !6, line: 248, size: 64, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !455, file: !6, line: 248, baseType: !73, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !455, file: !6, line: 248, baseType: !56, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !455, file: !6, line: 248, baseType: !76, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !455, file: !6, line: 248, baseType: !78, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !455, file: !6, line: 248, baseType: !61, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !455, file: !6, line: 248, baseType: !82, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !455, file: !6, line: 248, baseType: !158, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !455, file: !6, line: 248, baseType: !172, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !455, file: !6, line: 248, baseType: !195, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !455, file: !6, line: 248, baseType: !59, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !83, file: !84, line: 141, baseType: !99, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !83, file: !84, line: 141, baseType: !213, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !83, file: !84, line: 141, baseType: !470, size: 64, offset: 192)
!470 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !83, file: !84, line: 141, size: 64, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !470, file: !84, line: 141, baseType: !213, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !470, file: !84, line: 141, baseType: !73, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !83, file: !84, line: 142, baseType: !475, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_engine", file: !84, line: 157, size: 768, elements: !478)
!478 = !{!479, !504, !509, !523, !527, !531, !536, !543, !547, !551, !555, !556}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !477, file: !84, line: 158, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !503, !50}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "REGEXP", file: !57, line: 2651, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "p5rx", file: !6, line: 256, size: 192, elements: !486)
!486 = !{!487, !488, !489, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sv_any", scope: !485, file: !6, line: 257, baseType: !82, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sv_refcnt", scope: !485, file: !6, line: 257, baseType: !50, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !485, file: !6, line: 257, baseType: !50, size: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sv_u", scope: !485, file: !6, line: 258, baseType: !491, size: 64, offset: 128)
!491 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !485, file: !6, line: 258, size: 64, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "svu_pv", scope: !491, file: !6, line: 258, baseType: !73, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "svu_iv", scope: !491, file: !6, line: 258, baseType: !56, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "svu_uv", scope: !491, file: !6, line: 258, baseType: !76, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "svu_nv", scope: !491, file: !6, line: 258, baseType: !78, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rv", scope: !491, file: !6, line: 258, baseType: !61, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "svu_rx", scope: !491, file: !6, line: 258, baseType: !82, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !491, file: !6, line: 258, baseType: !158, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !491, file: !6, line: 258, baseType: !172, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !491, file: !6, line: 258, baseType: !195, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !491, file: !6, line: 258, baseType: !59, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !477, file: !84, line: 159, baseType: !505, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!129, !508, !73, !73, !73, !152, !61, !66, !50}
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "intuit", scope: !477, file: !84, line: 162, baseType: !510, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!73, !508, !61, !513, !73, !73, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_scream_pos_data", file: !84, line: 152, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_scream_pos_data_s", file: !84, line: 148, size: 128, elements: !518)
!518 = !{!519, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "scream_olds", scope: !517, file: !84, line: 150, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "scream_pos", scope: !517, file: !84, line: 151, baseType: !522, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "checkstr", scope: !477, file: !84, line: 170, baseType: !524, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!61, !508}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !477, file: !84, line: 171, baseType: !528, size: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !508}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_FETCH", scope: !477, file: !84, line: 172, baseType: !532, size: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !508, !535, !503}
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_STORE", scope: !477, file: !84, line: 174, baseType: !537, size: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !508, !535, !540}
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "numbered_buff_LENGTH", scope: !477, file: !84, line: 176, baseType: !544, size: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!129, !508, !540, !535}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff", scope: !477, file: !84, line: 178, baseType: !548, size: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!61, !508, !503, !503, !514}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "named_buff_iter", scope: !477, file: !84, line: 180, baseType: !552, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!61, !508, !540, !514}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "qr_package", scope: !477, file: !84, line: 182, baseType: !524, size: 64, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "op_comp", scope: !477, file: !84, line: 186, baseType: !557, size: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!483, !560, !117, !330, !475, !483, !561, !50, !50}
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mother_re", scope: !83, file: !84, line: 142, baseType: !483, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "paren_names", scope: !83, file: !84, line: 142, baseType: !87, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "extflags", scope: !83, file: !84, line: 142, baseType: !50, size: 32, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "minlen", scope: !83, file: !84, line: 142, baseType: !152, size: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "minlenret", scope: !83, file: !84, line: 142, baseType: !152, size: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gofs", scope: !83, file: !84, line: 142, baseType: !213, size: 64, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "substrs", scope: !83, file: !84, line: 142, baseType: !569, size: 64, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_data", file: !84, line: 45, size: 1024, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "check_ix", scope: !570, file: !84, line: 46, baseType: !289, size: 8)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !570, file: !84, line: 47, baseType: !574, size: 960, offset: 64)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 960, elements: !582)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_substr_datum", file: !84, line: 38, size: 320, elements: !576)
!576 = !{!577, !578, !579, !580, !581}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "min_offset", scope: !575, file: !84, line: 39, baseType: !152, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "max_offset", scope: !575, file: !84, line: 40, baseType: !152, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "substr", scope: !575, file: !84, line: 41, baseType: !61, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_substr", scope: !575, file: !84, line: 42, baseType: !61, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "end_shift", scope: !575, file: !84, line: 43, baseType: !152, size: 64, offset: 256)
!582 = !{!583}
!583 = !DISubrange(count: 3)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nparens", scope: !83, file: !84, line: 142, baseType: !50, size: 32, offset: 768)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "intflags", scope: !83, file: !84, line: 142, baseType: !50, size: 32, offset: 800)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pprivate", scope: !83, file: !84, line: 142, baseType: !66, size: 64, offset: 832)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lastparen", scope: !83, file: !84, line: 142, baseType: !50, size: 32, offset: 896)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lastcloseparen", scope: !83, file: !84, line: 142, baseType: !50, size: 32, offset: 928)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !83, file: !84, line: 142, baseType: !590, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "regexp_paren_pair", file: !84, line: 68, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regexp_paren_pair", file: !84, line: 58, size: 192, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !592, file: !84, line: 59, baseType: !152, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !592, file: !84, line: 60, baseType: !152, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "start_tmp", scope: !592, file: !84, line: 67, baseType: !152, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "subbeg", scope: !83, file: !84, line: 142, baseType: !73, size: 64, offset: 1024)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "saved_copy", scope: !83, file: !84, line: 142, baseType: !61, size: 64, offset: 1088)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sublen", scope: !83, file: !84, line: 142, baseType: !152, size: 64, offset: 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "suboffset", scope: !83, file: !84, line: 142, baseType: !152, size: 64, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "subcoffset", scope: !83, file: !84, line: 142, baseType: !152, size: 64, offset: 1280)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !83, file: !84, line: 142, baseType: !152, size: 64, offset: 1344)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pre_prefix", scope: !83, file: !84, line: 142, baseType: !7, size: 4, offset: 1408, flags: DIFlagBitField, extraData: i64 1408)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "compflags", scope: !83, file: !84, line: 142, baseType: !7, size: 9, offset: 1412, flags: DIFlagBitField, extraData: i64 1408)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "qr_anoncv", scope: !83, file: !84, line: 142, baseType: !307, size: 64, offset: 1472)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "svu_array", scope: !70, file: !6, line: 220, baseType: !158, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "svu_hash", scope: !70, file: !6, line: 220, baseType: !172, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "svu_gp", scope: !70, file: !6, line: 220, baseType: !195, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "svu_fp", scope: !70, file: !6, line: 220, baseType: !59, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Popped", scope: !38, file: !32, line: 22, baseType: !611, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!56, !59}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Open", scope: !38, file: !32, line: 23, baseType: !615, size: 64, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!59, !36, !618, !56, !45, !117, !117, !117, !59, !117, !158}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIO_list_t", file: !30, line: 361, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PerlIO_list_s", file: !32, line: 9, size: 256, elements: !621)
!621 = !{!622, !623, !624, !625}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !620, file: !32, line: 10, baseType: !56, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !620, file: !32, line: 11, baseType: !56, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !620, file: !32, line: 12, baseType: !56, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !620, file: !32, line: 13, baseType: !626, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIO_pair_t", file: !32, line: 7, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 4, size: 128, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !628, file: !32, line: 5, baseType: !36, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !628, file: !32, line: 6, baseType: !61, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Binmode", scope: !38, file: !32, line: 28, baseType: !611, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Getarg", scope: !38, file: !32, line: 29, baseType: !634, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!61, !59, !134, !117}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Fileno", scope: !38, file: !32, line: 30, baseType: !611, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Dup", scope: !38, file: !32, line: 31, baseType: !639, size: 64, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!59, !59, !59, !134, !117}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !38, file: !32, line: 33, baseType: !643, size: 64, offset: 704)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!152, !59, !66, !41}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Unread", scope: !38, file: !32, line: 34, baseType: !647, size: 64, offset: 768)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!152, !59, !650, !41}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !38, file: !32, line: 35, baseType: !647, size: 64, offset: 832)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", scope: !38, file: !32, line: 36, baseType: !654, size: 64, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!56, !59, !657, !117}
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !153, line: 85, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !155, line: 152, baseType: !58)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Tell", scope: !38, file: !32, line: 37, baseType: !660, size: 64, offset: 960)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!657, !59}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Close", scope: !38, file: !32, line: 38, baseType: !611, size: 64, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Flush", scope: !38, file: !32, line: 40, baseType: !611, size: 64, offset: 1088)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Fill", scope: !38, file: !32, line: 41, baseType: !611, size: 64, offset: 1152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Eof", scope: !38, file: !32, line: 42, baseType: !611, size: 64, offset: 1216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !38, file: !32, line: 43, baseType: !611, size: 64, offset: 1280)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Clearerr", scope: !38, file: !32, line: 44, baseType: !669, size: 64, offset: 1344)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !59}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Setlinebuf", scope: !38, file: !32, line: 45, baseType: !669, size: 64, offset: 1408)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Get_base", scope: !38, file: !32, line: 47, baseType: !674, size: 64, offset: 1472)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!677, !59}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Get_bufsiz", scope: !38, file: !32, line: 48, baseType: !680, size: 64, offset: 1536)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!41, !59}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Get_ptr", scope: !38, file: !32, line: 49, baseType: !674, size: 64, offset: 1600)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Get_cnt", scope: !38, file: !32, line: 50, baseType: !685, size: 64, offset: 1664)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!152, !59}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Set_ptrcnt", scope: !38, file: !32, line: 51, baseType: !689, size: 64, offset: 1728)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !59, !677, !152}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !31, file: !32, line: 69, baseType: !50, size: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !31, file: !32, line: 70, baseType: !117, size: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !31, file: !32, line: 78, baseType: !28, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPV", file: !57, line: 2659, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpv", file: !6, line: 499, size: 256, elements: !698)
!698 = !{!699, !700, !701, !702}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !697, file: !6, line: 500, baseType: !87, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !697, file: !6, line: 500, baseType: !99, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !697, file: !6, line: 500, baseType: !213, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !697, file: !6, line: 500, baseType: !703, size: 64, offset: 192)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !697, file: !6, line: 500, size: 64, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !703, file: !6, line: 500, baseType: !213, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !703, file: !6, line: 500, baseType: !73, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "svtype", file: !6, line: 153, baseType: !5)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVIV", file: !57, line: 2660, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpviv", file: !6, line: 503, size: 320, elements: !711)
!711 = !{!712, !713, !714, !715, !720}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !710, file: !6, line: 504, baseType: !87, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !710, file: !6, line: 504, baseType: !99, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !710, file: !6, line: 504, baseType: !213, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !710, file: !6, line: 504, baseType: !716, size: 64, offset: 192)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !710, file: !6, line: 504, size: 64, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !716, file: !6, line: 504, baseType: !213, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !716, file: !6, line: 504, baseType: !73, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !710, file: !6, line: 505, baseType: !220, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPVNV", file: !57, line: 2662, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xpvnv", file: !6, line: 517, size: 384, elements: !724)
!724 = !{!725, !726, !727, !728, !733, !734}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_stash", scope: !723, file: !6, line: 518, baseType: !87, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "xmg_u", scope: !723, file: !6, line: 518, baseType: !99, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_cur", scope: !723, file: !6, line: 518, baseType: !213, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "xpv_len_u", scope: !723, file: !6, line: 518, baseType: !729, size: 64, offset: 192)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !723, file: !6, line: 518, size: 64, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_len", scope: !729, file: !6, line: 518, baseType: !213, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "xpvlenu_pv", scope: !729, file: !6, line: 518, baseType: !73, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "xiv_u", scope: !723, file: !6, line: 519, baseType: !220, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "xnv_u", scope: !723, file: !6, line: 520, baseType: !259, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIOBuf", file: !32, line: 151, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 143, size: 640, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !737, file: !32, line: 144, baseType: !31, size: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !737, file: !32, line: 145, baseType: !677, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !737, file: !32, line: 146, baseType: !677, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !737, file: !32, line: 147, baseType: !677, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "posn", scope: !737, file: !32, line: 148, baseType: !657, size: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bufsiz", scope: !737, file: !32, line: 149, baseType: !41, size: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "oneword", scope: !737, file: !32, line: 150, baseType: !56, size: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIOUnix", file: !748, line: 2454, baseType: !749)
!748 = !DIFile(filename: "apps/500.perlbench_r/src/perlio.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "8d0545f295fed0a9104caa3081f54687")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !748, line: 2450, size: 320, elements: !750)
!750 = !{!751, !752, !753}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !749, file: !748, line: 2451, baseType: !31, size: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !749, file: !748, line: 2452, baseType: !117, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !749, file: !748, line: 2453, baseType: !117, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIOStdio", file: !748, line: 2872, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !748, line: 2869, size: 320, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !756, file: !748, line: 2870, baseType: !31, size: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "stdio", scope: !756, file: !748, line: 2871, baseType: !760, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !762, line: 7, baseType: !763)
!762 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !764, line: 49, size: 1728, elements: !765)
!764 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !781, !783, !784, !785, !786, !787, !788, !789, !792, !794, !797, !800, !801, !802, !803, !804}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !763, file: !764, line: 51, baseType: !117, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !763, file: !764, line: 54, baseType: !73, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !763, file: !764, line: 55, baseType: !73, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !763, file: !764, line: 56, baseType: !73, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !763, file: !764, line: 57, baseType: !73, size: 64, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !763, file: !764, line: 58, baseType: !73, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !763, file: !764, line: 59, baseType: !73, size: 64, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !763, file: !764, line: 60, baseType: !73, size: 64, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !763, file: !764, line: 61, baseType: !73, size: 64, offset: 512)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !763, file: !764, line: 64, baseType: !73, size: 64, offset: 576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !763, file: !764, line: 65, baseType: !73, size: 64, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !763, file: !764, line: 66, baseType: !73, size: 64, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !763, file: !764, line: 68, baseType: !779, size: 64, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !764, line: 36, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !763, file: !764, line: 70, baseType: !782, size: 64, offset: 832)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !763, file: !764, line: 72, baseType: !117, size: 32, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !763, file: !764, line: 73, baseType: !117, size: 32, offset: 928)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !763, file: !764, line: 74, baseType: !658, size: 64, offset: 960)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !763, file: !764, line: 77, baseType: !443, size: 16, offset: 1024)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !763, file: !764, line: 78, baseType: !678, size: 8, offset: 1040)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !763, file: !764, line: 79, baseType: !186, size: 8, offset: 1048)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !763, file: !764, line: 81, baseType: !790, size: 64, offset: 1088)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !764, line: 43, baseType: null)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !763, file: !764, line: 89, baseType: !793, size: 64, offset: 1152)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !155, line: 153, baseType: !58)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !763, file: !764, line: 91, baseType: !795, size: 64, offset: 1216)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !764, line: 37, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !763, file: !764, line: 92, baseType: !798, size: 64, offset: 1280)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !764, line: 38, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !763, file: !764, line: 93, baseType: !782, size: 64, offset: 1344)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !763, file: !764, line: 94, baseType: !66, size: 64, offset: 1408)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !763, file: !764, line: 95, baseType: !41, size: 64, offset: 1472)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !763, file: !764, line: 96, baseType: !117, size: 32, offset: 1536)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !763, file: !764, line: 98, baseType: !805, size: 160, offset: 1568)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 20)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "PerlIOCrlf", file: !748, line: 4503, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !748, line: 4499, size: 704, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !812, file: !748, line: 4500, baseType: !736, size: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !812, file: !748, line: 4501, baseType: !677, size: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPHH", file: !818, line: 170, baseType: !819)
!818 = !DIFile(filename: "apps/500.perlbench_r/src/cop.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "64d4f81e93be43c58d053d27101a3a5e")
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcounted_he", file: !95, line: 523, size: 256, elements: !820)
!820 = !{!821, !823, !824, !831, !832}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_next", scope: !819, file: !95, line: 524, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_hek", scope: !819, file: !95, line: 529, baseType: !179, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_val", scope: !819, file: !95, line: 536, baseType: !825, size: 64, offset: 128)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !819, file: !95, line: 531, size: 64, elements: !826)
!826 = !{!827, !828, !829, !830}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_u_iv", scope: !825, file: !95, line: 532, baseType: !56, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_u_uv", scope: !825, file: !95, line: 533, baseType: !76, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_u_len", scope: !825, file: !95, line: 534, baseType: !213, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_u_ptr", scope: !825, file: !95, line: 535, baseType: !66, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_refcnt", scope: !819, file: !95, line: 537, baseType: !50, size: 32, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_he_data", scope: !819, file: !95, line: 540, baseType: !186, size: 8, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTRUCTORFUNC_t", file: !57, line: 5397, baseType: !367)
!836 = !{!837, !840, !842, !844, !846, !848, !0, !850, !852}
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "PerlIO_remove", scope: !2, file: !748, line: 1044, type: !839, isLocal: false, isDefinition: true)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "PerlIO_utf8", scope: !2, file: !748, line: 1843, type: !839, isLocal: false, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "PerlIO_byte", scope: !2, file: !748, line: 1874, type: !839, isLocal: false, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "PerlIO_raw", scope: !2, file: !748, line: 1905, type: !839, isLocal: false, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "PerlIO_unix", scope: !2, file: !748, line: 2825, type: !839, isLocal: false, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "PerlIO_stdio", scope: !2, file: !748, line: 3689, type: !839, isLocal: false, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "PerlIO_pending", scope: !2, file: !748, line: 4451, type: !839, isLocal: false, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "PerlIO_crlf", scope: !2, file: !748, line: 4808, type: !839, isLocal: false, isDefinition: true)
!854 = !{i32 7, !"Dwarf Version", i32 5}
!855 = !{i32 2, !"Debug Info Version", i32 3}
!856 = !{i32 1, !"wchar_size", i32 4}
!857 = !{i32 7, !"PIC Level", i32 2}
!858 = !{i32 7, !"PIE Level", i32 2}
!859 = !{i32 7, !"uwtable", i32 2}
!860 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!861 = distinct !DISubprogram(name: "perlsio_binmode", scope: !748, file: !748, line: 123, type: !862, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !864)
!862 = !DISubroutineType(types: !863)
!863 = !{!117, !760, !117, !117}
!864 = !{!865, !866, !867}
!865 = !DILocalVariable(name: "fp", arg: 1, scope: !861, file: !748, line: 123, type: !760)
!866 = !DILocalVariable(name: "iotype", arg: 2, scope: !861, file: !748, line: 123, type: !117)
!867 = !DILocalVariable(name: "mode", arg: 3, scope: !861, file: !748, line: 123, type: !117)
!868 = !DILocation(line: 0, scope: !861)
!869 = !DILocation(line: 154, column: 5, scope: !861)
!870 = distinct !DISubprogram(name: "PerlIO_intmode2str", scope: !748, file: !748, line: 164, type: !871, scopeLine: 165, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !873)
!871 = !DISubroutineType(types: !872)
!872 = !{!117, !117, !73, !834}
!873 = !{!874, !875, !876, !877, !879, !880}
!874 = !DILocalVariable(name: "rawmode", arg: 1, scope: !870, file: !748, line: 164, type: !117)
!875 = !DILocalVariable(name: "mode", arg: 2, scope: !870, file: !748, line: 164, type: !73)
!876 = !DILocalVariable(name: "writing", arg: 3, scope: !870, file: !748, line: 164, type: !834)
!877 = !DILocalVariable(name: "result", scope: !870, file: !748, line: 166, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!879 = !DILocalVariable(name: "ix", scope: !870, file: !748, line: 167, type: !117)
!880 = !DILocalVariable(name: "ptype", scope: !870, file: !748, line: 168, type: !117)
!881 = !DILocation(line: 0, scope: !870)
!882 = !DILocation(line: 166, column: 32, scope: !870)
!883 = !DILocation(line: 169, column: 5, scope: !870)
!884 = !DILocation(line: 181, column: 9, scope: !885)
!885 = distinct !DILexicalBlock(scope: !870, file: !748, line: 181, column: 9)
!886 = !DILocation(line: 181, column: 9, scope: !870)
!887 = !DILocation(line: 182, column: 21, scope: !885)
!888 = !DILocation(line: 182, column: 11, scope: !885)
!889 = !DILocation(line: 182, column: 2, scope: !885)
!890 = !DILocation(line: 184, column: 9, scope: !870)
!891 = !DILocation(line: 185, column: 13, scope: !892)
!892 = distinct !DILexicalBlock(scope: !893, file: !748, line: 184, column: 29)
!893 = distinct !DILexicalBlock(scope: !870, file: !748, line: 184, column: 9)
!894 = !DILocation(line: 186, column: 5, scope: !892)
!895 = !DILocation(line: 188, column: 22, scope: !896)
!896 = distinct !DILexicalBlock(scope: !893, file: !748, line: 188, column: 14)
!897 = !DILocation(line: 188, column: 14, scope: !893)
!898 = !DILocation(line: 189, column: 13, scope: !899)
!899 = distinct !DILexicalBlock(scope: !896, file: !748, line: 188, column: 34)
!900 = !DILocation(line: 190, column: 6, scope: !899)
!901 = !DILocation(line: 191, column: 6, scope: !902)
!902 = distinct !DILexicalBlock(scope: !899, file: !748, line: 190, column: 6)
!903 = !DILocation(line: 191, column: 17, scope: !902)
!904 = !DILocation(line: 195, column: 6, scope: !905)
!905 = distinct !DILexicalBlock(scope: !896, file: !748, line: 194, column: 10)
!906 = !DILocation(line: 196, column: 17, scope: !907)
!907 = distinct !DILexicalBlock(scope: !905, file: !748, line: 195, column: 6)
!908 = !DILocation(line: 196, column: 6, scope: !907)
!909 = !DILocation(line: 198, column: 17, scope: !910)
!910 = distinct !DILexicalBlock(scope: !907, file: !748, line: 197, column: 7)
!911 = !DILocation(line: 199, column: 6, scope: !910)
!912 = !DILocation(line: 199, column: 17, scope: !910)
!913 = !DILocation(line: 208, column: 5, scope: !870)
!914 = !DILocation(line: 208, column: 14, scope: !870)
!915 = !DILocation(line: 209, column: 5, scope: !870)
!916 = distinct !DISubprogram(name: "PerlIO_debug", scope: !748, file: !748, line: 372, type: !917, scopeLine: 373, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !919)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !45, null}
!919 = !{!920, !921}
!920 = !DILocalVariable(name: "fmt", arg: 1, scope: !916, file: !748, line: 372, type: !45)
!921 = !DILocalVariable(name: "ap", scope: !916, file: !748, line: 374, type: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !923, line: 52, baseType: !924)
!923 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !925, line: 32, baseType: !926)
!925 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stdarg.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !927, baseType: !928)
!927 = !DIFile(filename: "apps/500.perlbench_r/src/perlio.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake")
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 192, elements: !187)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !930)
!930 = !{!931, !932, !933, !934}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !929, file: !927, line: 374, baseType: !7, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !929, file: !927, line: 374, baseType: !7, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !929, file: !927, line: 374, baseType: !66, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !929, file: !927, line: 374, baseType: !66, size: 64, offset: 128)
!935 = !DILocation(line: 0, scope: !916)
!936 = !DILocation(line: 416, column: 1, scope: !916)
!937 = distinct !DISubprogram(name: "PerlIO_allocate", scope: !748, file: !748, line: 469, type: !938, scopeLine: 470, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !940)
!938 = !DISubroutineType(types: !939)
!939 = !{!59}
!940 = !{!941, !942, !943, !945}
!941 = !DILocalVariable(name: "last", scope: !937, file: !748, line: 474, type: !27)
!942 = !DILocalVariable(name: "f", scope: !937, file: !748, line: 475, type: !28)
!943 = !DILocalVariable(name: "i", scope: !944, file: !748, line: 478, type: !117)
!944 = distinct !DILexicalBlock(scope: !937, file: !748, line: 477, column: 25)
!945 = !DILabel(scope: !937, name: "good_exit", file: !748, line: 492)
!946 = !DILocation(line: 0, scope: !937)
!947 = !DILocation(line: 477, column: 17, scope: !937)
!948 = !DILocation(line: 477, column: 5, scope: !937)
!949 = !DILocation(line: 0, scope: !944)
!950 = !DILocation(line: 480, column: 2, scope: !951)
!951 = distinct !DILexicalBlock(scope: !944, file: !748, line: 480, column: 2)
!952 = !DILocation(line: 480, column: 38, scope: !953)
!953 = distinct !DILexicalBlock(scope: !951, file: !748, line: 480, column: 2)
!954 = !DILocation(line: 480, column: 16, scope: !953)
!955 = distinct !{!955, !950, !956, !957, !958}
!956 = !DILocation(line: 484, column: 2, scope: !951)
!957 = !{!"llvm.loop.mustprogress"}
!958 = !{!"llvm.loop.unroll.disable"}
!959 = !DILocation(line: 481, column: 13, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !748, line: 481, column: 10)
!961 = distinct !DILexicalBlock(scope: !953, file: !748, line: 480, column: 42)
!962 = !DILocation(line: 481, column: 19, scope: !960)
!963 = !DILocation(line: 481, column: 11, scope: !960)
!964 = !DILocation(line: 481, column: 10, scope: !961)
!965 = !DILocation(line: 486, column: 5, scope: !937)
!966 = !DILocation(line: 487, column: 10, scope: !967)
!967 = distinct !DILexicalBlock(scope: !937, file: !748, line: 487, column: 9)
!968 = !DILocation(line: 487, column: 9, scope: !937)
!969 = !DILocation(line: 490, column: 25, scope: !937)
!970 = !DILocation(line: 490, column: 11, scope: !937)
!971 = !DILocation(line: 490, column: 5, scope: !937)
!972 = !DILocation(line: 492, column: 5, scope: !937)
!973 = !DILocation(line: 493, column: 8, scope: !937)
!974 = !DILocation(line: 493, column: 14, scope: !937)
!975 = !DILocation(line: 494, column: 8, scope: !937)
!976 = !DILocation(line: 494, column: 12, scope: !937)
!977 = !DILocation(line: 495, column: 8, scope: !937)
!978 = !DILocation(line: 495, column: 13, scope: !937)
!979 = !DILocation(line: 496, column: 5, scope: !937)
!980 = !DILocation(line: 497, column: 1, scope: !937)
!981 = !DISubprogram(name: "Perl_safesyscalloc", scope: !982, file: !982, line: 3746, type: !983, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !985)
!982 = !DIFile(filename: "apps/500.perlbench_r/src/proto.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "86c1c4cb1b6333bdae0149184d61a8ce")
!983 = !DISubroutineType(types: !984)
!984 = !{!66, !41, !41}
!985 = !{}
!986 = distinct !DISubprogram(name: "PerlIO_fdupopen", scope: !748, file: !748, line: 501, type: !987, scopeLine: 502, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !989)
!987 = !DISubroutineType(types: !988)
!988 = !{!59, !59, !134, !117}
!989 = !{!990, !991, !992, !993}
!990 = !DILocalVariable(name: "f", arg: 1, scope: !986, file: !748, line: 501, type: !59)
!991 = !DILocalVariable(name: "param", arg: 2, scope: !986, file: !748, line: 501, type: !134)
!992 = !DILocalVariable(name: "flags", arg: 3, scope: !986, file: !748, line: 501, type: !117)
