; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/519.lbm_r/llvm-ir/519.lbm_r_bc/src/main.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/519.lbm_r/src/main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MAIN_Param = type { i32, ptr, i32, i32, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@srcGrid = internal global ptr null, align 8, !dbg !0
@dstGrid = internal global ptr null, align 8, !dbg !28
@.str = private unnamed_addr constant [14 x i8] c"timestep: %i\0A\00", align 1
@.str.2 = private unnamed_addr constant [55 x i8] c"MAIN_parseCommandLine: cannot stat obstacle file '%s'\0A\00", align 1
@.str.3 = private unnamed_addr constant [82 x i8] c"MAIN_parseCommandLine:\0A\09size of file '%s' is %i bytes\0A\09expected size is %i bytes\0A\00", align 1
@.str.4 = private unnamed_addr constant [53 x i8] c"MAIN_parseCommandLine: cannot stat result file '%s'\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "srcGrid", scope: !2, file: !30, line: 21, type: !31, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !16, globals: !27, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/519.lbm_r/src/main.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/519.lbm_r", checksumkind: CSK_MD5, checksum: "3b91efcff068dd48542caf6338b4ce36")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 27, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "apps/519.lbm_r/src/main.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ed9999bc40f1cbdbc95d90d838886bd9")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "NOTHING", value: 0)
!10 = !DIEnumerator(name: "COMPARE", value: 1)
!11 = !DIEnumerator(name: "STORE", value: 2)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 28, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "LDC", value: 0)
!15 = !DIEnumerator(name: "CHANNEL", value: 1)
!16 = !{!17, !18, !19, !20, !21, !24}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_Action", file: !6, line: 27, baseType: !5)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_SimType", file: !6, line: 28, baseType: !12)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !{!0, !28}
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "dstGrid", scope: !2, file: !30, line: 21, type: !31, isLocal: true, isDefinition: true)
!30 = !DIFile(filename: "apps/519.lbm_r/src/main.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "3b91efcff068dd48542caf6338b4ce36")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_GridPtr", file: !32, line: 9, baseType: !33)
!32 = !DIFile(filename: "apps/519.lbm_r/src/lbm_1d_array.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9999ab0a9cab1c793e34b2a812895996")
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_Grid", file: !32, line: 8, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1664000000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 26000000)
!38 = !{i32 7, !"Dwarf Version", i32 5}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{i32 7, !"PIC Level", i32 2}
!42 = !{i32 7, !"PIE Level", i32 2}
!43 = !{i32 7, !"uwtable", i32 2}
!44 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!45 = distinct !DISubprogram(name: "main", scope: !30, file: !30, line: 25, type: !46, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{!19, !19, !24}
!48 = !{!49, !50, !51, !60}
!49 = !DILocalVariable(name: "nArgs", arg: 1, scope: !45, file: !30, line: 25, type: !19)
!50 = !DILocalVariable(name: "arg", arg: 2, scope: !45, file: !30, line: 25, type: !24)
!51 = !DILocalVariable(name: "param", scope: !45, file: !30, line: 26, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_Param", file: !6, line: 36, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 30, size: 256, elements: !54)
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "nTimeSteps", scope: !53, file: !6, line: 31, baseType: !19, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "resultFilename", scope: !53, file: !6, line: 32, baseType: !25, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !53, file: !6, line: 33, baseType: !17, size: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "simType", scope: !53, file: !6, line: 34, baseType: !18, size: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleFilename", scope: !53, file: !6, line: 35, baseType: !25, size: 64, offset: 192)
!60 = !DILocalVariable(name: "t", scope: !45, file: !30, line: 30, type: !19)
!61 = !DILocation(line: 0, scope: !45)
!62 = !DILocation(line: 26, column: 2, scope: !45)
!63 = !DILocation(line: 26, column: 13, scope: !45)
!64 = !DILocation(line: 32, column: 2, scope: !45)
!65 = !DILocalVariable(name: "param", arg: 1, scope: !66, file: !30, line: 105, type: !69)
!66 = distinct !DISubprogram(name: "MAIN_printInfo", scope: !30, file: !30, line: 105, type: !67, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !71)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!71 = !{!65, !72, !78}
!72 = !DILocalVariable(name: "actionString", scope: !66, file: !30, line: 106, type: !73)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 768, elements: !75)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!75 = !{!76, !77}
!76 = !DISubrange(count: 3)
!77 = !DISubrange(count: 32)
!78 = !DILocalVariable(name: "simTypeString", scope: !66, file: !30, line: 107, type: !73)
!79 = !DILocation(line: 0, scope: !66, inlinedAt: !80)
!80 = distinct !DILocation(line: 33, column: 2, scope: !45)
!81 = !DILocation(line: 106, column: 2, scope: !66, inlinedAt: !80)
!82 = !DILocation(line: 106, column: 13, scope: !66, inlinedAt: !80)
!83 = !DILocation(line: 107, column: 2, scope: !66, inlinedAt: !80)
!84 = !DILocation(line: 107, column: 13, scope: !66, inlinedAt: !80)
!85 = !DILocation(line: 116, column: 17, scope: !66, inlinedAt: !80)
!86 = !{!87, !88, i64 0}
!87 = !{!"", !88, i64 0, !91, i64 8, !89, i64 16, !89, i64 20, !91, i64 24}
!88 = !{!"int", !89, i64 0}
!89 = !{!"omnipotent char", !90, i64 0}
!90 = !{!"Simple C/C++ TBAA"}
!91 = !{!"any pointer", !89, i64 0}
!92 = !DILocation(line: 116, column: 36, scope: !66, inlinedAt: !80)
!93 = !{!87, !91, i64 8}
!94 = !DILocation(line: 117, column: 30, scope: !66, inlinedAt: !80)
!95 = !{!87, !89, i64 16}
!96 = !DILocation(line: 117, column: 60, scope: !66, inlinedAt: !80)
!97 = !{!87, !89, i64 20}
!98 = !DILocation(line: 118, column: 18, scope: !66, inlinedAt: !80)
!99 = !{!87, !91, i64 24}
!100 = !DILocation(line: 118, column: 35, scope: !66, inlinedAt: !80)
!101 = !DILocation(line: 118, column: 10, scope: !66, inlinedAt: !80)
!102 = !DILocation(line: 117, column: 39, scope: !66, inlinedAt: !80)
!103 = !DILocation(line: 117, column: 10, scope: !66, inlinedAt: !80)
!104 = !DILocation(line: 108, column: 2, scope: !66, inlinedAt: !80)
!105 = !DILocation(line: 120, column: 1, scope: !66, inlinedAt: !80)
!106 = !DILocation(line: 34, column: 2, scope: !45)
!107 = !DILocation(line: 39, column: 16, scope: !108)
!108 = distinct !DILexicalBlock(scope: !109, file: !30, line: 39, column: 2)
!109 = distinct !DILexicalBlock(scope: !45, file: !30, line: 39, column: 2)
!110 = !DILocation(line: 39, column: 2, scope: !109)
!111 = !DILocation(line: 40, column: 7, scope: !112)
!112 = distinct !DILexicalBlock(scope: !108, file: !30, line: 39, column: 43)
!113 = !DILocation(line: 41, column: 26, scope: !114)
!114 = distinct !DILexicalBlock(scope: !115, file: !30, line: 40, column: 34)
!115 = distinct !DILexicalBlock(scope: !112, file: !30, line: 40, column: 7)
!116 = !{!91, !91, i64 0}
!117 = !DILocation(line: 41, column: 4, scope: !114)
!118 = !DILocation(line: 44, column: 33, scope: !112)
!119 = !DILocation(line: 44, column: 43, scope: !112)
!120 = !DILocation(line: 44, column: 3, scope: !112)
!121 = !DILocation(line: 45, column: 3, scope: !112)
!122 = !DILocation(line: 47, column: 10, scope: !123)
!123 = distinct !DILexicalBlock(scope: !112, file: !30, line: 47, column: 7)
!124 = !DILocation(line: 47, column: 16, scope: !123)
!125 = !DILocation(line: 47, column: 7, scope: !112)
!126 = !DILocation(line: 48, column: 4, scope: !127)
!127 = distinct !DILexicalBlock(scope: !123, file: !30, line: 47, column: 23)
!128 = !DILocation(line: 49, column: 29, scope: !127)
!129 = !DILocation(line: 49, column: 4, scope: !127)
!130 = !DILocation(line: 50, column: 3, scope: !127)
!131 = !DILocation(line: 39, column: 38, scope: !108)
!132 = distinct !{!132, !110, !133, !134, !135}
!133 = !DILocation(line: 51, column: 2, scope: !109)
!134 = !{!"llvm.loop.mustprogress"}
!135 = !{!"llvm.loop.unroll.disable"}
!136 = !DILocalVariable(name: "param", arg: 1, scope: !137, file: !30, line: 150, type: !69)
!137 = distinct !DISubprogram(name: "MAIN_finalize", scope: !30, file: !30, line: 150, type: !67, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !138)
!138 = !{!136}
!139 = !DILocation(line: 0, scope: !137, inlinedAt: !140)
!140 = distinct !DILocation(line: 56, column: 2, scope: !45)
!141 = !DILocation(line: 151, column: 27, scope: !137, inlinedAt: !140)
!142 = !DILocation(line: 151, column: 2, scope: !137, inlinedAt: !140)
!143 = !DILocation(line: 153, column: 6, scope: !137, inlinedAt: !140)
!144 = !DILocation(line: 154, column: 30, scope: !145, inlinedAt: !140)
!145 = distinct !DILexicalBlock(scope: !137, file: !30, line: 153, column: 6)
!146 = !DILocation(line: 154, column: 3, scope: !145, inlinedAt: !140)
!147 = !DILocation(line: 155, column: 6, scope: !137, inlinedAt: !140)
!148 = !DILocation(line: 156, column: 27, scope: !149, inlinedAt: !140)
!149 = distinct !DILexicalBlock(scope: !137, file: !30, line: 155, column: 6)
!150 = !DILocation(line: 156, column: 2, scope: !149, inlinedAt: !140)
!151 = !DILocation(line: 158, column: 2, scope: !137, inlinedAt: !140)
!152 = !DILocation(line: 159, column: 2, scope: !137, inlinedAt: !140)
!153 = !DILocation(line: 59, column: 1, scope: !45)
!154 = !DILocation(line: 58, column: 2, scope: !45)
!155 = distinct !DISubprogram(name: "MAIN_parseCommandLine", scope: !30, file: !30, line: 63, type: !156, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !159)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !19, !24, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!159 = !{!160, !161, !162, !163}
!160 = !DILocalVariable(name: "nArgs", arg: 1, scope: !155, file: !30, line: 63, type: !19)
!161 = !DILocalVariable(name: "arg", arg: 2, scope: !155, file: !30, line: 63, type: !24)
!162 = !DILocalVariable(name: "param", arg: 3, scope: !155, file: !30, line: 63, type: !158)
!163 = !DILocalVariable(name: "fileStat", scope: !155, file: !30, line: 64, type: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !165, line: 46, size: 1152, elements: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "f8d5b541c4f89219f8e8ff8c3e2940d9")
!166 = !{!167, !171, !173, !175, !177, !179, !181, !182, !183, !186, !188, !190, !198, !199, !200}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !164, file: !165, line: 48, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !169, line: 145, baseType: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!170 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !164, file: !165, line: 53, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !169, line: 148, baseType: !170)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !164, file: !165, line: 61, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !169, line: 151, baseType: !170)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !164, file: !165, line: 62, baseType: !176, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !169, line: 150, baseType: !7)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !164, file: !165, line: 64, baseType: !178, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !169, line: 146, baseType: !7)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !164, file: !165, line: 65, baseType: !180, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !169, line: 147, baseType: !7)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !164, file: !165, line: 67, baseType: !19, size: 32, offset: 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !164, file: !165, line: 69, baseType: !168, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !164, file: !165, line: 74, baseType: !184, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !169, line: 152, baseType: !185)
!185 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !164, file: !165, line: 78, baseType: !187, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !169, line: 174, baseType: !185)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !164, file: !165, line: 80, baseType: !189, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !169, line: 179, baseType: !185)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !164, file: !165, line: 91, baseType: !191, size: 128, offset: 576)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !192, line: 10, size: 128, elements: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !191, file: !192, line: 12, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !169, line: 160, baseType: !185)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !191, file: !192, line: 16, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !169, line: 196, baseType: !185)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !164, file: !165, line: 92, baseType: !191, size: 128, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !164, file: !165, line: 93, baseType: !191, size: 128, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !164, file: !165, line: 106, baseType: !201, size: 192, offset: 960)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 192, elements: !202)
!202 = !{!76}
!203 = !DILocation(line: 0, scope: !155)
!204 = !DILocation(line: 64, column: 2, scope: !155)
!205 = !DILocation(line: 64, column: 14, scope: !155)
!206 = !DILocation(line: 66, column: 16, scope: !207)
!207 = distinct !DILexicalBlock(scope: !155, file: !30, line: 66, column: 6)
!208 = !DILocation(line: 67, column: 3, scope: !209)
!209 = distinct !DILexicalBlock(scope: !207, file: !30, line: 66, column: 31)
!210 = !DILocation(line: 68, column: 3, scope: !209)
!211 = !DILocation(line: 71, column: 32, scope: !155)
!212 = !DILocalVariable(name: "__nptr", arg: 1, scope: !213, file: !214, line: 361, type: !217)
!213 = distinct !DISubprogram(name: "atoi", scope: !214, file: !214, line: 361, type: !215, scopeLine: 362, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !218)
!214 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!215 = !DISubroutineType(types: !216)
!216 = !{!19, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!218 = !{!212}
!219 = !DILocation(line: 0, scope: !213, inlinedAt: !220)
!220 = distinct !DILocation(line: 71, column: 26, scope: !155)
!221 = !DILocation(line: 363, column: 16, scope: !213, inlinedAt: !220)
!222 = !DILocation(line: 363, column: 10, scope: !213, inlinedAt: !220)
!223 = !DILocation(line: 71, column: 24, scope: !155)
!224 = !DILocation(line: 72, column: 26, scope: !155)
!225 = !DILocation(line: 72, column: 9, scope: !155)
!226 = !DILocation(line: 72, column: 24, scope: !155)
!227 = !DILocation(line: 73, column: 46, scope: !155)
!228 = !DILocation(line: 0, scope: !213, inlinedAt: !229)
!229 = distinct !DILocation(line: 73, column: 40, scope: !155)
!230 = !DILocation(line: 363, column: 16, scope: !213, inlinedAt: !229)
!231 = !DILocation(line: 363, column: 10, scope: !213, inlinedAt: !229)
!232 = !DILocation(line: 73, column: 9, scope: !155)
!233 = !DILocation(line: 73, column: 24, scope: !155)
!234 = !DILocation(line: 74, column: 47, scope: !155)
!235 = !DILocation(line: 0, scope: !213, inlinedAt: !236)
!236 = distinct !DILocation(line: 74, column: 41, scope: !155)
!237 = !DILocation(line: 363, column: 16, scope: !213, inlinedAt: !236)
!238 = !DILocation(line: 363, column: 10, scope: !213, inlinedAt: !236)
!239 = !DILocation(line: 74, column: 9, scope: !155)
!240 = !DILocation(line: 74, column: 24, scope: !155)
!241 = !DILocation(line: 76, column: 12, scope: !242)
!242 = distinct !DILexicalBlock(scope: !155, file: !30, line: 76, column: 6)
!243 = !DILocation(line: 76, column: 6, scope: !155)
!244 = !DILocation(line: 77, column: 29, scope: !245)
!245 = distinct !DILexicalBlock(scope: !242, file: !30, line: 76, column: 19)
!246 = !DILocation(line: 77, column: 10, scope: !245)
!247 = !DILocation(line: 77, column: 27, scope: !245)
!248 = !DILocalVariable(name: "__path", arg: 1, scope: !249, file: !250, line: 453, type: !217)
!249 = distinct !DISubprogram(name: "stat", scope: !250, file: !250, line: 453, type: !251, scopeLine: 454, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!250 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "461013b06495e219438a7cca03a67307")
!251 = !DISubroutineType(types: !252)
!252 = !{!19, !217, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!254 = !{!248, !255}
!255 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !249, file: !250, line: 453, type: !253)
!256 = !DILocation(line: 0, scope: !249, inlinedAt: !257)
!257 = distinct !DILocation(line: 79, column: 7, scope: !258)
