; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/505.mcf_r/llvm-ir/505.mcf_r_bc/src/pbeampp.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/pbeampp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64 }
%struct.arc = type { i32, i64, ptr, ptr, i16, ptr, ptr, i64, i64 }
%struct.basket = type { ptr, i64, i64, i64 }

@full_group_end_arc = internal unnamed_addr global ptr null, align 8, !dbg !0

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn uwtable
define dso_local void @set_static_vars(ptr nocapture noundef readonly %net, ptr noundef %arcs) local_unnamed_addr #0 !dbg !62 {
entry:
  call void @llvm.dbg.value(metadata ptr %net, metadata !108, metadata !DIExpression()), !dbg !110
  call void @llvm.dbg.value(metadata ptr %arcs, metadata !109, metadata !DIExpression()), !dbg !110
  %full_groups = getelementptr inbounds %struct.network, ptr %net, i64 0, i32 31, !dbg !111
  %0 = load i64, ptr %full_groups, align 8, !dbg !111, !tbaa !112
  %max_elems = getelementptr inbounds %struct.network, ptr %net, i64 0, i32 32, !dbg !119
  %1 = load i64, ptr %max_elems, align 8, !dbg !119, !tbaa !120

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "full_group_end_arc", scope: !2, file: !12, line: 30, type: !13, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !11, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/pbeampp.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/505.mcf_r", checksumkind: CSK_MD5, checksum: "2fbb96f58b58aae8ef374e75283f10fa")
!4 = !{!5}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !9, !9}
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!11 = !{!0}
!12 = !DIFile(filename: "apps/505.mcf_r/src/pbeampp.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "2fbb96f58b58aae8ef374e75283f10fa")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !15, line: 137, baseType: !16)
!15 = !DIFile(filename: "apps/505.mcf_r/src/defines.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "05eeb7bba098b08025cbe048b289d372")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !15, line: 168, size: 576, elements: !17)
!17 = !{!18, !19, !26, !48, !49, !51, !52, !53, !54}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !16, file: !15, line: 170, baseType: !8, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !16, file: !15, line: 171, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !15, line: 98, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !22, line: 27, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !24, line: 44, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!25 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !16, file: !15, line: 172, baseType: !27, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !15, line: 135, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !15, line: 149, size: 832, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !40, !41, !42, !43, !45, !46, !47}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !29, file: !15, line: 151, baseType: !20, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !29, file: !15, line: 152, baseType: !8, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !29, file: !15, line: 153, baseType: !27, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !29, file: !15, line: 154, baseType: !27, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !29, file: !15, line: 155, baseType: !27, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !29, file: !15, line: 156, baseType: !27, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !29, file: !15, line: 157, baseType: !38, size: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !15, line: 138, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !29, file: !15, line: 158, baseType: !38, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !29, file: !15, line: 158, baseType: !38, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !29, file: !15, line: 159, baseType: !38, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !29, file: !15, line: 160, baseType: !44, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !15, line: 97, baseType: !21)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !29, file: !15, line: 161, baseType: !21, size: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !29, file: !15, line: 162, baseType: !8, size: 32, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !29, file: !15, line: 163, baseType: !8, size: 32, offset: 800)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !16, file: !15, line: 172, baseType: !27, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !16, file: !15, line: 173, baseType: !50, size: 16, offset: 256)
!50 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !16, file: !15, line: 174, baseType: !38, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !16, file: !15, line: 174, baseType: !38, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !16, file: !15, line: 175, baseType: !44, size: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !16, file: !15, line: 176, baseType: !20, size: 64, offset: 512)
!55 = !{i32 7, !"Dwarf Version", i32 5}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{i32 1, !"wchar_size", i32 4}
!58 = !{i32 7, !"PIC Level", i32 2}
!59 = !{i32 7, !"PIE Level", i32 2}
!60 = !{i32 7, !"uwtable", i32 2}
!61 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!62 = distinct !DISubprogram(name: "set_static_vars", scope: !12, file: !12, line: 33, type: !63, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !107)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !13}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !15, line: 206, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !15, line: 181, size: 5184, elements: !68)
!68 = !{!69, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !67, file: !15, line: 183, baseType: !70, size: 1600)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1600, elements: !72)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!72 = !{!73}
!73 = !DISubrange(count: 200)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !67, file: !15, line: 184, baseType: !70, size: 1600, offset: 1600)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !67, file: !15, line: 185, baseType: !21, size: 64, offset: 3200)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !67, file: !15, line: 185, baseType: !21, size: 64, offset: 3264)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !67, file: !15, line: 186, baseType: !21, size: 64, offset: 3328)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !67, file: !15, line: 186, baseType: !21, size: 64, offset: 3392)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !67, file: !15, line: 186, baseType: !21, size: 64, offset: 3456)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !67, file: !15, line: 186, baseType: !21, size: 64, offset: 3520)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !67, file: !15, line: 187, baseType: !21, size: 64, offset: 3584)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !67, file: !15, line: 187, baseType: !21, size: 64, offset: 3648)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !67, file: !15, line: 189, baseType: !21, size: 64, offset: 3712)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !67, file: !15, line: 190, baseType: !21, size: 64, offset: 3776)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !67, file: !15, line: 191, baseType: !21, size: 64, offset: 3840)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !67, file: !15, line: 192, baseType: !21, size: 64, offset: 3904)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !67, file: !15, line: 193, baseType: !21, size: 64, offset: 3968)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !67, file: !15, line: 194, baseType: !21, size: 64, offset: 4032)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !67, file: !15, line: 195, baseType: !21, size: 64, offset: 4096)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !67, file: !15, line: 196, baseType: !21, size: 64, offset: 4160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !67, file: !15, line: 197, baseType: !21, size: 64, offset: 4224)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !67, file: !15, line: 198, baseType: !93, size: 64, offset: 4288)
!93 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !67, file: !15, line: 199, baseType: !20, size: 64, offset: 4352)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !67, file: !15, line: 200, baseType: !27, size: 64, offset: 4416)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !67, file: !15, line: 200, baseType: !27, size: 64, offset: 4480)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !67, file: !15, line: 201, baseType: !38, size: 64, offset: 4544)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !67, file: !15, line: 201, baseType: !38, size: 64, offset: 4608)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !67, file: !15, line: 201, baseType: !38, size: 64, offset: 4672)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !67, file: !15, line: 202, baseType: !38, size: 64, offset: 4736)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !67, file: !15, line: 202, baseType: !38, size: 64, offset: 4800)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !67, file: !15, line: 203, baseType: !21, size: 64, offset: 4864)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !67, file: !15, line: 204, baseType: !21, size: 64, offset: 4928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !67, file: !15, line: 205, baseType: !21, size: 64, offset: 4992)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !67, file: !15, line: 205, baseType: !21, size: 64, offset: 5056)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !67, file: !15, line: 205, baseType: !21, size: 64, offset: 5120)
!107 = !{!108, !109}
!108 = !DILocalVariable(name: "net", arg: 1, scope: !62, file: !12, line: 33, type: !65)
!109 = !DILocalVariable(name: "arcs", arg: 2, scope: !62, file: !12, line: 33, type: !13)
!110 = !DILocation(line: 0, scope: !62)
!111 = !DILocation(line: 40, column: 36, scope: !62)
!112 = !{!113, !116, i64 632}
!113 = !{!"network", !114, i64 0, !114, i64 200, !116, i64 400, !116, i64 408, !116, i64 416, !116, i64 424, !116, i64 432, !116, i64 440, !116, i64 448, !116, i64 456, !116, i64 464, !116, i64 472, !116, i64 480, !116, i64 488, !116, i64 496, !116, i64 504, !116, i64 512, !116, i64 520, !116, i64 528, !117, i64 536, !116, i64 544, !118, i64 552, !118, i64 560, !118, i64 568, !118, i64 576, !118, i64 584, !118, i64 592, !118, i64 600, !116, i64 608, !116, i64 616, !116, i64 624, !116, i64 632, !116, i64 640}
!114 = !{!"omnipotent char", !115, i64 0}
!115 = !{!"Simple C/C++ TBAA"}
!116 = !{!"long", !114, i64 0}
!117 = !{!"double", !114, i64 0}
!118 = !{!"any pointer", !114, i64 0}
!119 = !DILocation(line: 40, column: 55, scope: !62)
!120 = !{!113, !116, i64 640}
!121 = !DILocation(line: 40, column: 48, scope: !62)
!122 = !DILocation(line: 40, column: 29, scope: !62)
!123 = !DILocation(line: 40, column: 22, scope: !62)
!124 = !{!118, !118, i64 0}
!125 = !DILocation(line: 41, column: 1, scope: !62)
!126 = distinct !DISubprogram(name: "bea_is_dual_infeasible", scope: !12, file: !12, line: 46, type: !127, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !129)
!127 = !DISubroutineType(types: !128)
!128 = !{!8, !13, !20}
!129 = !{!130, !131}
!130 = !DILocalVariable(name: "arc", arg: 1, scope: !126, file: !12, line: 46, type: !13)
!131 = !DILocalVariable(name: "red_cost", arg: 2, scope: !126, file: !12, line: 46, type: !20)
!132 = !DILocation(line: 0, scope: !126)
!133 = !DILocation(line: 53, column: 26, scope: !126)
!134 = !DILocation(line: 53, column: 30, scope: !126)
!135 = !DILocation(line: 54, column: 26, scope: !126)
!136 = !DILocation(line: 54, column: 30, scope: !126)
!137 = !{!138, !140, i64 32}
!138 = !{!"arc", !139, i64 0, !116, i64 8, !118, i64 16, !118, i64 24, !140, i64 32, !118, i64 40, !118, i64 48, !116, i64 56, !116, i64 64}
!139 = !{!"int", !114, i64 0}
!140 = !{!"short", !114, i64 0}
!141 = !DILocation(line: 53, column: 5, scope: !126)
!142 = distinct !DISubprogram(name: "cost_compare", scope: !12, file: !12, line: 61, type: !143, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !154)
!143 = !DISubroutineType(types: !144)
!144 = !{!8, !145, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASKET", file: !15, line: 146, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basket", file: !15, line: 140, size: 256, elements: !149)
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !148, file: !15, line: 142, baseType: !13, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !148, file: !15, line: 143, baseType: !20, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "abs_cost", scope: !148, file: !15, line: 144, baseType: !20, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !148, file: !15, line: 145, baseType: !21, size: 64, offset: 192)
!154 = !{!155, !156}
!155 = !DILocalVariable(name: "b1", arg: 1, scope: !142, file: !12, line: 61, type: !145)
!156 = !DILocalVariable(name: "b2", arg: 2, scope: !142, file: !12, line: 61, type: !145)
!157 = !DILocation(line: 0, scope: !142)
!158 = !DILocation(line: 68, column: 8, scope: !159)
!159 = distinct !DILexicalBlock(scope: !142, file: !12, line: 68, column: 7)
!160 = !DILocation(line: 68, column: 14, scope: !159)
!161 = !{!162, !116, i64 16}
!162 = !{!"basket", !118, i64 0, !116, i64 8, !116, i64 16, !116, i64 24}
!163 = !DILocation(line: 68, column: 26, scope: !159)
!164 = !DILocation(line: 68, column: 32, scope: !159)
!165 = !DILocation(line: 68, column: 23, scope: !159)
!166 = !DILocation(line: 68, column: 7, scope: !142)
!167 = !DILocation(line: 70, column: 23, scope: !168)
!168 = distinct !DILexicalBlock(scope: !142, file: !12, line: 70, column: 7)
!169 = !DILocation(line: 70, column: 7, scope: !142)
!170 = !DILocation(line: 72, column: 14, scope: !171)
!171 = distinct !DILexicalBlock(scope: !142, file: !12, line: 72, column: 7)
!172 = !{!162, !118, i64 0}
!173 = !DILocation(line: 72, column: 17, scope: !171)
!174 = !{!138, !139, i64 0}
!175 = !DILocation(line: 72, column: 29, scope: !171)
!176 = !DILocation(line: 72, column: 32, scope: !171)
!177 = !DILocation(line: 72, column: 20, scope: !171)
!178 = !DILocation(line: 0, scope: !171)
!179 = !DILocation(line: 76, column: 1, scope: !142)
!180 = distinct !DISubprogram(name: "primal_bea_mpp", scope: !12, file: !12, line: 80, type: !181, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !185)
!181 = !DISubroutineType(types: !182)
!182 = !{!146, !21, !13, !13, !183, !145, !8, !184, !21, !21, !21}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!185 = !{!186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!186 = !DILocalVariable(name: "m", arg: 1, scope: !180, file: !12, line: 80, type: !21)
!187 = !DILocalVariable(name: "arcs", arg: 2, scope: !180, file: !12, line: 80, type: !13)
!188 = !DILocalVariable(name: "stop_arcs", arg: 3, scope: !180, file: !12, line: 80, type: !13)
!189 = !DILocalVariable(name: "basket_sizes", arg: 4, scope: !180, file: !12, line: 81, type: !183)
!190 = !DILocalVariable(name: "perm", arg: 5, scope: !180, file: !12, line: 81, type: !145)
!191 = !DILocalVariable(name: "thread", arg: 6, scope: !180, file: !12, line: 81, type: !8)
!192 = !DILocalVariable(name: "end_arc", arg: 7, scope: !180, file: !12, line: 81, type: !184)
!193 = !DILocalVariable(name: "step", arg: 8, scope: !180, file: !12, line: 81, type: !21)
!194 = !DILocalVariable(name: "num_threads", arg: 9, scope: !180, file: !12, line: 81, type: !21)
!195 = !DILocalVariable(name: "max_elems", arg: 10, scope: !180, file: !12, line: 81, type: !21)
!196 = !DILocalVariable(name: "i", scope: !180, file: !12, line: 96, type: !21)
!197 = !DILocalVariable(name: "j", scope: !180, file: !12, line: 96, type: !21)
!198 = !DILocalVariable(name: "count", scope: !180, file: !12, line: 96, type: !21)
!199 = !DILocalVariable(name: "global_basket_size", scope: !180, file: !12, line: 96, type: !21)
!200 = !DILocalVariable(name: "next", scope: !180, file: !12, line: 96, type: !21)
!201 = !DILocalVariable(name: "arc", scope: !180, file: !12, line: 97, type: !13)
!202 = !DILocalVariable(name: "old_end_arc", scope: !180, file: !12, line: 97, type: !13)
!203 = !DILocalVariable(name: "red_cost", scope: !180, file: !12, line: 98, type: !20)
!204 = !DILabel(scope: !180, name: "NEXT", file: !12, line: 120)
!205 = !DILabel(scope: !180, name: "READY", file: !12, line: 170)
!206 = !DILocation(line: 0, scope: !180)
