; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/505.mcf_r/llvm-ir/505.mcf_r_bc/src/psimplex.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/psimplex.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.basket = type { ptr, i64, i64, i64 }
%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64 }
%struct.arc = type { i32, i64, ptr, ptr, i16, ptr, ptr, i64, i64 }
%struct.node = type { i64, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i32, i32 }

@perm_p = internal unnamed_addr global ptr null, align 8, !dbg !0
@basket_sizes = internal unnamed_addr global ptr null, align 8, !dbg !63
@basket = internal unnamed_addr global ptr null, align 8, !dbg !65
@opt = internal unnamed_addr global i1 false, align 8, !dbg !69
@opt_basket = internal unnamed_addr global ptr null, align 8, !dbg !60

; Function Attrs: nounwind uwtable
define dso_local void @markBaskets(i64 noundef %num_threads) local_unnamed_addr #0 !dbg !77 {
entry:
  %max = alloca ptr, align 8
  %act = alloca ptr, align 8
  call void @llvm.dbg.value(metadata i64 %num_threads, metadata !81, metadata !DIExpression()), !dbg !87

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "perm_p", scope: !2, file: !62, line: 30, type: !12, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !59, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/psimplex.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/505.mcf_r", checksumkind: CSK_MD5, checksum: "cae1ac12ce2300f66d85771ef1d03a22")
!4 = !{!5, !12, !13, !58, !14}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !6, line: 97, baseType: !7)
!6 = !DIFile(filename: "apps/505.mcf_r/src/defines.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "05eeb7bba098b08025cbe048b289d372")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !8, line: 27, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 44, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!11 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASKET", file: !6, line: 146, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basket", file: !6, line: 140, size: 256, elements: !17)
!17 = !{!18, !55, !56, !57}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !16, file: !6, line: 142, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !6, line: 137, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !6, line: 168, size: 576, elements: !22)
!22 = !{!23, !25, !27, !48, !49, !51, !52, !53, !54}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !21, file: !6, line: 170, baseType: !24, size: 32)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !21, file: !6, line: 171, baseType: !26, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !6, line: 98, baseType: !7)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !21, file: !6, line: 172, baseType: !28, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !6, line: 135, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !6, line: 149, size: 832, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !41, !42, !43, !44, !45, !46, !47}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !30, file: !6, line: 151, baseType: !26, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !30, file: !6, line: 152, baseType: !24, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !30, file: !6, line: 153, baseType: !28, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !30, file: !6, line: 154, baseType: !28, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !30, file: !6, line: 155, baseType: !28, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !30, file: !6, line: 156, baseType: !28, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !30, file: !6, line: 157, baseType: !39, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !6, line: 138, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !30, file: !6, line: 158, baseType: !39, size: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !30, file: !6, line: 158, baseType: !39, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !30, file: !6, line: 159, baseType: !39, size: 64, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !30, file: !6, line: 160, baseType: !5, size: 64, offset: 640)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !30, file: !6, line: 161, baseType: !7, size: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !30, file: !6, line: 162, baseType: !24, size: 32, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !30, file: !6, line: 163, baseType: !24, size: 32, offset: 800)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !21, file: !6, line: 172, baseType: !28, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !21, file: !6, line: 173, baseType: !50, size: 16, offset: 256)
!50 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !21, file: !6, line: 174, baseType: !39, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !21, file: !6, line: 174, baseType: !39, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !21, file: !6, line: 175, baseType: !5, size: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !21, file: !6, line: 176, baseType: !26, size: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !16, file: !6, line: 143, baseType: !26, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "abs_cost", scope: !16, file: !6, line: 144, baseType: !26, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !16, file: !6, line: 145, baseType: !7, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!59 = !{!60, !0, !63, !65, !67}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "opt_basket", scope: !2, file: !62, line: 29, type: !13, isLocal: true, isDefinition: true)
!62 = !DIFile(filename: "apps/505.mcf_r/src/psimplex.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "cae1ac12ce2300f66d85771ef1d03a22")
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "basket_sizes", scope: !2, file: !62, line: 31, type: !58, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "basket", scope: !2, file: !62, line: 33, type: !14, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "opt", scope: !2, file: !62, line: 32, type: !7, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!70 = !{i32 7, !"Dwarf Version", i32 5}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{i32 1, !"wchar_size", i32 4}
!73 = !{i32 7, !"PIC Level", i32 2}
!74 = !{i32 7, !"PIE Level", i32 2}
!75 = !{i32 7, !"uwtable", i32 2}
!76 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!77 = distinct !DISubprogram(name: "markBaskets", scope: !62, file: !62, line: 36, type: !78, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !80)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !7}
!80 = !{!81, !82, !83, !84, !85, !86}
!81 = !DILocalVariable(name: "num_threads", arg: 1, scope: !77, file: !62, line: 36, type: !7)
!82 = !DILocalVariable(name: "i", scope: !77, file: !62, line: 42, type: !7)
!83 = !DILocalVariable(name: "j", scope: !77, file: !62, line: 42, type: !7)
!84 = !DILocalVariable(name: "max_pos", scope: !77, file: !62, line: 42, type: !7)
!85 = !DILocalVariable(name: "max", scope: !77, file: !62, line: 43, type: !14)
!86 = !DILocalVariable(name: "act", scope: !77, file: !62, line: 43, type: !14)
!87 = !DILocation(line: 0, scope: !77)
!88 = !DILocation(line: 43, column: 5, scope: !77)
!89 = !DILocation(line: 53, column: 9, scope: !90)
!90 = distinct !DILexicalBlock(scope: !91, file: !62, line: 53, column: 9)
!91 = distinct !DILexicalBlock(scope: !92, file: !62, line: 45, column: 27)
!92 = distinct !DILexicalBlock(scope: !93, file: !62, line: 45, column: 5)
!93 = distinct !DILexicalBlock(scope: !77, file: !62, line: 45, column: 5)
!94 = !DILocation(line: 54, column: 18, scope: !95)
!95 = distinct !DILexicalBlock(scope: !96, file: !62, line: 53, column: 43)
!96 = distinct !DILexicalBlock(scope: !90, file: !62, line: 53, column: 9)
!97 = !DILocation(line: 46, column: 13, scope: !98)
!98 = distinct !DILexicalBlock(scope: !91, file: !62, line: 46, column: 11)
!99 = !{!100, !100, i64 0}
!100 = !{!"any pointer", !101, i64 0}
!101 = !{!"omnipotent char", !102, i64 0}
!102 = !{!"Simple C/C++ TBAA"}
!103 = !DILocation(line: 46, column: 12, scope: !98)
!104 = !DILocation(line: 46, column: 25, scope: !98)
!105 = !{!106, !107, i64 24}
!106 = !{!"basket", !100, i64 0, !107, i64 8, !107, i64 16, !107, i64 24}
!107 = !{!"long", !101, i64 0}
!108 = !DILocation(line: 46, column: 32, scope: !98)
!109 = !DILocation(line: 0, scope: !98)
!110 = !DILocation(line: 67, column: 14, scope: !91)
!111 = !DILocation(line: 67, column: 21, scope: !91)
!112 = !DILocation(line: 68, column: 10, scope: !91)
!113 = !DILocation(line: 68, column: 26, scope: !91)
!114 = !DILocation(line: 45, column: 23, scope: !92)
!115 = !DILocation(line: 45, column: 17, scope: !92)
!116 = !DILocation(line: 45, column: 5, scope: !93)
!117 = distinct !{!117, !116, !118, !119, !120}
!118 = !DILocation(line: 69, column: 5, scope: !93)
!119 = !{!"llvm.loop.mustprogress"}
!120 = !{!"llvm.loop.unroll.disable"}
!121 = !DILocation(line: 54, column: 17, scope: !95)
!122 = !DILocation(line: 54, column: 15, scope: !95)
!123 = !DILocation(line: 55, column: 20, scope: !124)
!124 = distinct !DILexicalBlock(scope: !95, file: !62, line: 55, column: 15)
!125 = !DILocation(line: 55, column: 27, scope: !124)
!126 = !DILocation(line: 55, column: 15, scope: !95)
!127 = !DILocation(line: 56, column: 22, scope: !128)
!128 = distinct !DILexicalBlock(scope: !129, file: !62, line: 56, column: 21)
!129 = distinct !DILexicalBlock(scope: !124, file: !62, line: 55, column: 33)
!130 = !DILocation(line: 56, column: 26, scope: !128)
!131 = !DILocation(line: 56, column: 29, scope: !128)
!132 = !DILocation(line: 56, column: 54, scope: !128)
!133 = !DILocation(line: 56, column: 21, scope: !129)
!134 = !DILocation(line: 57, column: 27, scope: !135)
!135 = distinct !DILexicalBlock(scope: !128, file: !62, line: 56, column: 59)
!136 = !DILocation(line: 57, column: 25, scope: !135)
!137 = !DILocation(line: 59, column: 17, scope: !135)
!138 = !DILocation(line: 0, scope: !91)
!139 = !DILocation(line: 53, column: 39, scope: !96)
!140 = !DILocation(line: 53, column: 23, scope: !96)
!141 = distinct !{!141, !89, !142, !119, !120}
!142 = !DILocation(line: 61, column: 9, scope: !90)
!143 = !DILocation(line: 63, column: 12, scope: !144)
!144 = distinct !DILexicalBlock(scope: !91, file: !62, line: 63, column: 11)
!145 = !DILocation(line: 63, column: 11, scope: !91)
!146 = !DILocation(line: 70, column: 1, scope: !77)
!147 = !DISubprogram(name: "cost_compare", scope: !148, file: !148, line: 33, type: !149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !151)
!148 = !DIFile(filename: "apps/505.mcf_r/src/pbeampp.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "78005d84781db2f8b424d1e0780a6648")
!149 = !DISubroutineType(types: !150)
!150 = !{!24, !13, !13}
!151 = !{}
!152 = distinct !DISubprogram(name: "worker", scope: !62, file: !62, line: 87, type: !153, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !197)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155, !24, !24}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !6, line: 206, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !6, line: 181, size: 5184, elements: !158)
!158 = !{!159, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !157, file: !6, line: 183, baseType: !160, size: 1600)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1600, elements: !162)
!161 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!162 = !{!163}
!163 = !DISubrange(count: 200)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !157, file: !6, line: 184, baseType: !160, size: 1600, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !157, file: !6, line: 185, baseType: !7, size: 64, offset: 3200)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !157, file: !6, line: 185, baseType: !7, size: 64, offset: 3264)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !157, file: !6, line: 186, baseType: !7, size: 64, offset: 3328)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !157, file: !6, line: 186, baseType: !7, size: 64, offset: 3392)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !157, file: !6, line: 186, baseType: !7, size: 64, offset: 3456)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !157, file: !6, line: 186, baseType: !7, size: 64, offset: 3520)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !157, file: !6, line: 187, baseType: !7, size: 64, offset: 3584)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !157, file: !6, line: 187, baseType: !7, size: 64, offset: 3648)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !157, file: !6, line: 189, baseType: !7, size: 64, offset: 3712)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !157, file: !6, line: 190, baseType: !7, size: 64, offset: 3776)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !157, file: !6, line: 191, baseType: !7, size: 64, offset: 3840)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !157, file: !6, line: 192, baseType: !7, size: 64, offset: 3904)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !157, file: !6, line: 193, baseType: !7, size: 64, offset: 3968)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !157, file: !6, line: 194, baseType: !7, size: 64, offset: 4032)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !157, file: !6, line: 195, baseType: !7, size: 64, offset: 4096)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !157, file: !6, line: 196, baseType: !7, size: 64, offset: 4160)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !157, file: !6, line: 197, baseType: !7, size: 64, offset: 4224)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !157, file: !6, line: 198, baseType: !183, size: 64, offset: 4288)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !157, file: !6, line: 199, baseType: !26, size: 64, offset: 4352)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !157, file: !6, line: 200, baseType: !28, size: 64, offset: 4416)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !157, file: !6, line: 200, baseType: !28, size: 64, offset: 4480)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !157, file: !6, line: 201, baseType: !39, size: 64, offset: 4544)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !157, file: !6, line: 201, baseType: !39, size: 64, offset: 4608)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !157, file: !6, line: 201, baseType: !39, size: 64, offset: 4672)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !157, file: !6, line: 202, baseType: !39, size: 64, offset: 4736)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !157, file: !6, line: 202, baseType: !39, size: 64, offset: 4800)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !157, file: !6, line: 203, baseType: !7, size: 64, offset: 4864)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !157, file: !6, line: 204, baseType: !7, size: 64, offset: 4928)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !157, file: !6, line: 205, baseType: !7, size: 64, offset: 4992)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !157, file: !6, line: 205, baseType: !7, size: 64, offset: 5056)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !157, file: !6, line: 205, baseType: !7, size: 64, offset: 5120)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !209, !210, !211}
!198 = !DILocalVariable(name: "net", arg: 1, scope: !152, file: !62, line: 87, type: !155)
!199 = !DILocalVariable(name: "thread", arg: 2, scope: !152, file: !62, line: 87, type: !24)
!200 = !DILocalVariable(name: "num_threads", arg: 3, scope: !152, file: !62, line: 87, type: !24)
!201 = !DILocalVariable(name: "arcs", scope: !152, file: !62, line: 95, type: !19)
!202 = !DILocalVariable(name: "stop_arcs", scope: !152, file: !62, line: 96, type: !19)
!203 = !DILocalVariable(name: "m", scope: !152, file: !62, line: 97, type: !7)
!204 = !DILocalVariable(name: "iterations", scope: !152, file: !62, line: 98, type: !58)
!205 = !DILocalVariable(name: "perm", scope: !152, file: !62, line: 99, type: !206)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 259904, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 4061)
!209 = !DILocalVariable(name: "end_arc", scope: !152, file: !62, line: 100, type: !19)
!210 = !DILocalVariable(name: "i", scope: !152, file: !62, line: 101, type: !7)
!211 = !DILocalVariable(name: "j", scope: !152, file: !62, line: 101, type: !7)
!212 = !DILocation(line: 0, scope: !152)
!213 = !DILocation(line: 95, column: 39, scope: !152)
!214 = !{!215, !100, i64 568}
!215 = !{!"network", !101, i64 0, !101, i64 200, !107, i64 400, !107, i64 408, !107, i64 416, !107, i64 424, !107, i64 432, !107, i64 440, !107, i64 448, !107, i64 456, !107, i64 464, !107, i64 472, !107, i64 480, !107, i64 488, !107, i64 496, !107, i64 504, !107, i64 512, !107, i64 520, !107, i64 528, !216, i64 536, !107, i64 544, !100, i64 552, !100, i64 560, !100, i64 568, !100, i64 576, !100, i64 584, !100, i64 592, !100, i64 600, !107, i64 608, !107, i64 616, !107, i64 624, !107, i64 632, !107, i64 640}
!216 = !{!"double", !101, i64 0}
!217 = !DILocation(line: 96, column: 39, scope: !152)
!218 = !{!215, !100, i64 576}
!219 = !DILocation(line: 97, column: 26, scope: !152)
!220 = !{!215, !107, i64 424}
!221 = !DILocation(line: 98, column: 38, scope: !152)
!222 = !DILocation(line: 99, column: 3, scope: !152)
!223 = !DILocation(line: 99, column: 18, scope: !152)
!224 = !DILocation(line: 100, column: 3, scope: !152)
!225 = !DILocation(line: 100, column: 18, scope: !152)
!226 = !DILocation(line: 103, column: 3, scope: !152)
!227 = !DILocation(line: 103, column: 24, scope: !152)
!228 = !{!107, !107, i64 0}
!229 = !DILocation(line: 104, column: 23, scope: !230)
!230 = distinct !DILexicalBlock(scope: !152, file: !62, line: 104, column: 3)
!231 = !DILocation(line: 104, column: 62, scope: !232)
!232 = distinct !DILexicalBlock(scope: !230, file: !62, line: 104, column: 3)
!233 = !DILocation(line: 104, column: 3, scope: !230)
!234 = !DILocation(line: 104, column: 40, scope: !230)
!235 = !DILocation(line: 104, column: 19, scope: !230)
!236 = !DILocation(line: 104, column: 50, scope: !230)
!237 = !DILocation(line: 104, column: 12, scope: !230)
!238 = !DILocation(line: 107, column: 11, scope: !152)
!239 = !DILocation(line: 107, column: 3, scope: !152)
!240 = !DILocation(line: 113, column: 9, scope: !241)
!241 = distinct !DILexicalBlock(scope: !152, file: !62, line: 107, column: 16)
!242 = !DILocation(line: 108, column: 62, scope: !241)
!243 = !DILocation(line: 108, column: 101, scope: !241)
!244 = !DILocation(line: 108, column: 113, scope: !241)
!245 = !DILocation(line: 108, column: 123, scope: !241)
!246 = !DILocation(line: 108, column: 156, scope: !241)
!247 = !{!215, !107, i64 640}
!248 = !DILocation(line: 108, column: 26, scope: !241)
!249 = !DILocation(line: 108, column: 5, scope: !241)
!250 = !DILocation(line: 108, column: 24, scope: !241)
!251 = !DILocation(line: 109, column: 5, scope: !241)
!252 = !DILocation(line: 109, column: 20, scope: !241)
!253 = !DILocation(line: 114, column: 7, scope: !254)
