; ModuleID = '/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/memutil.c'
source_filename = "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/memutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@stderr = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [11 x i8] c"FATAL: %s\0A\00", align 1
@nabout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [41 x i8] c"allocation failure in vector: nh = %lld\0A\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"allocation failure in vector()\00", align 1
@.str.3 = private unnamed_addr constant [32 x i8] c"allocation failure in ivector()\00", align 1
@.str.4 = private unnamed_addr constant [33 x i8] c"allocation failure in ipvector()\00", align 1
@.str.5 = private unnamed_addr constant [33 x i8] c"allocation failure 1 in matrix()\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 14.0.0 (https://github.com/llvm/llvm-project.git 4327d39b15b22b9ee23582e5455df5b2a093fe8d)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/memutil.c", directory: "/home/rouzbeh/Graduate/Research/LLVM/Active-Lane-Conslidation/test", checksumkind: CSK_MD5, checksum: "69fa2a4216f25d0cb4fca617d474b59c")
!2 = !{!3, !5, !6, !8, !9, !10}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!5 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !{i32 7, !"Dwarf Version", i32 5}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{i32 7, !"uwtable", i32 1}
!16 = !{!"clang version 14.0.0 (https://github.com/llvm/llvm-project.git 4327d39b15b22b9ee23582e5455df5b2a093fe8d)"}
!17 = distinct !DISubprogram(name: "nrerror", scope: !18, file: !18, line: 6, type: !19, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !21)
!18 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/memutil.c", directory: "/home/rouzbeh/Graduate/Research", checksumkind: CSK_MD5, checksum: "69fa2a4216f25d0cb4fca617d474b59c")
!19 = !DISubroutineType(types: !20)
!20 = !{null, !10}
!21 = !{!22}
!22 = !DILocalVariable(name: "msg", arg: 1, scope: !17, file: !18, line: 6, type: !10)
!23 = !DILocation(line: 0, scope: !17)
!24 = !DILocation(line: 12, column: 11, scope: !17)
!25 = !{!26, !26, i64 0}
!26 = !{!"any pointer", !27, i64 0}
!27 = !{!"omnipotent char", !28, i64 0}
!28 = !{!"Simple C/C++ TBAA"}
!29 = !DILocation(line: 12, column: 2, scope: !17)
!30 = !DILocation(line: 13, column: 2, scope: !17)
!31 = distinct !DISubprogram(name: "vector", scope: !18, file: !18, line: 16, type: !32, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !37)
!32 = !DISubroutineType(types: !33)
!33 = !{!3, !34, !34}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 46, baseType: !36)
!35 = !DIFile(filename: "llvm-project/build/lib/clang/14.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/Research/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!36 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!37 = !{!38, !39, !40}
!38 = !DILocalVariable(name: "nl", arg: 1, scope: !31, file: !18, line: 16, type: !34)
!39 = !DILocalVariable(name: "nh", arg: 2, scope: !31, file: !18, line: 16, type: !34)
!40 = !DILocalVariable(name: "v", scope: !31, file: !18, line: 18, type: !3)
!41 = !DILocation(line: 0, scope: !31)
!42 = !DILocation(line: 29, column: 31, scope: !31)
!43 = !DILocation(line: 29, column: 42, scope: !31)
!44 = !DILocation(line: 29, column: 18, scope: !31)
!45 = !DILocation(line: 30, column: 7, scope: !46)
!46 = distinct !DILexicalBlock(scope: !31, file: !18, line: 30, column: 6)
!47 = !DILocation(line: 30, column: 6, scope: !31)
!48 = !DILocation(line: 31, column: 19, scope: !49)
!49 = distinct !DILexicalBlock(scope: !46, file: !18, line: 30, column: 11)
!50 = !DILocation(line: 31, column: 10, scope: !49)
!51 = !DILocation(line: 32, column: 10, scope: !49)
!52 = !DILocation(line: 32, column: 3, scope: !49)
!53 = !DILocation(line: 0, scope: !17, inlinedAt: !54)
!54 = distinct !DILocation(line: 33, column: 3, scope: !49)
!55 = !DILocation(line: 12, column: 11, scope: !17, inlinedAt: !54)
!56 = !DILocation(line: 12, column: 2, scope: !17, inlinedAt: !54)
!57 = !DILocation(line: 13, column: 2, scope: !17, inlinedAt: !54)
!58 = !DILocation(line: 29, column: 6, scope: !31)
!59 = !DILocation(line: 39, column: 12, scope: !31)
!60 = !DILocation(line: 39, column: 2, scope: !31)
!61 = !DISubprogram(name: "fflush", scope: !62, file: !62, line: 218, type: !63, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !122)
!62 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!63 = !DISubroutineType(types: !64)
!64 = !{!7, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !67, line: 7, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !69, line: 49, size: 1728, elements: !70)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !86, !88, !89, !90, !94, !96, !98, !102, !105, !107, !110, !113, !114, !116, !117, !118}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !68, file: !69, line: 51, baseType: !7, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !68, file: !69, line: 54, baseType: !10, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !68, file: !69, line: 55, baseType: !10, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !68, file: !69, line: 56, baseType: !10, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !68, file: !69, line: 57, baseType: !10, size: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !68, file: !69, line: 58, baseType: !10, size: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !68, file: !69, line: 59, baseType: !10, size: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !68, file: !69, line: 60, baseType: !10, size: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !68, file: !69, line: 61, baseType: !10, size: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !68, file: !69, line: 64, baseType: !10, size: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !68, file: !69, line: 65, baseType: !10, size: 64, offset: 640)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !68, file: !69, line: 66, baseType: !10, size: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !68, file: !69, line: 68, baseType: !84, size: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !69, line: 36, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !68, file: !69, line: 70, baseType: !87, size: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !68, file: !69, line: 72, baseType: !7, size: 32, offset: 896)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !68, file: !69, line: 73, baseType: !7, size: 32, offset: 928)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !68, file: !69, line: 74, baseType: !91, size: 64, offset: 960)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !92, line: 152, baseType: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!93 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !68, file: !69, line: 77, baseType: !95, size: 16, offset: 1024)
!95 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !68, file: !69, line: 78, baseType: !97, size: 8, offset: 1040)
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !68, file: !69, line: 79, baseType: !99, size: 8, offset: 1048)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !68, file: !69, line: 81, baseType: !103, size: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !69, line: 43, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !68, file: !69, line: 89, baseType: !106, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !92, line: 153, baseType: !93)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !68, file: !69, line: 91, baseType: !108, size: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !69, line: 37, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !68, file: !69, line: 92, baseType: !111, size: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !69, line: 38, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !68, file: !69, line: 93, baseType: !87, size: 64, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !68, file: !69, line: 94, baseType: !115, size: 64, offset: 1408)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !68, file: !69, line: 95, baseType: !34, size: 64, offset: 1472)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !68, file: !69, line: 96, baseType: !7, size: 32, offset: 1536)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !68, file: !69, line: 98, baseType: !119, size: 160, offset: 1568)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 20)
!122 = !{}
!123 = distinct !DISubprogram(name: "ivector", scope: !18, file: !18, line: 42, type: !124, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!6, !7, !7}
!126 = !{!127, !128, !129}
!127 = !DILocalVariable(name: "nl", arg: 1, scope: !123, file: !18, line: 42, type: !7)
!128 = !DILocalVariable(name: "nh", arg: 2, scope: !123, file: !18, line: 42, type: !7)
!129 = !DILocalVariable(name: "v", scope: !123, file: !18, line: 47, type: !6)
!130 = !DILocation(line: 0, scope: !123)
!131 = !DILocation(line: 49, column: 28, scope: !123)
!132 = !DILocation(line: 49, column: 33, scope: !123)
!133 = !DILocation(line: 49, column: 23, scope: !123)
!134 = !DILocation(line: 49, column: 39, scope: !123)
!135 = !DILocation(line: 49, column: 15, scope: !123)
!136 = !DILocation(line: 50, column: 7, scope: !137)
!137 = distinct !DILexicalBlock(scope: !123, file: !18, line: 50, column: 6)
!138 = !DILocation(line: 50, column: 6, scope: !123)
!139 = !DILocation(line: 0, scope: !17, inlinedAt: !140)
!140 = distinct !DILocation(line: 51, column: 3, scope: !137)
!141 = !DILocation(line: 12, column: 11, scope: !17, inlinedAt: !140)
!142 = !DILocation(line: 12, column: 2, scope: !17, inlinedAt: !140)
!143 = !DILocation(line: 13, column: 2, scope: !17, inlinedAt: !140)
!144 = !DILocation(line: 49, column: 6, scope: !123)
!145 = !DILocation(line: 52, column: 12, scope: !123)
!146 = !DILocation(line: 52, column: 2, scope: !123)
!147 = distinct !DISubprogram(name: "ipvector", scope: !18, file: !18, line: 55, type: !124, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !148)
!148 = !{!149, !150, !151}
!149 = !DILocalVariable(name: "nl", arg: 1, scope: !147, file: !18, line: 55, type: !7)
!150 = !DILocalVariable(name: "nh", arg: 2, scope: !147, file: !18, line: 55, type: !7)
!151 = !DILocalVariable(name: "v", scope: !147, file: !18, line: 60, type: !6)
!152 = !DILocation(line: 0, scope: !147)
!153 = !DILocation(line: 62, column: 28, scope: !147)
!154 = !DILocation(line: 62, column: 33, scope: !147)
!155 = !DILocation(line: 62, column: 23, scope: !147)
!156 = !DILocation(line: 62, column: 39, scope: !147)
!157 = !DILocation(line: 62, column: 15, scope: !147)
!158 = !DILocation(line: 63, column: 7, scope: !159)
!159 = distinct !DILexicalBlock(scope: !147, file: !18, line: 63, column: 6)
!160 = !DILocation(line: 63, column: 6, scope: !147)
!161 = !DILocation(line: 0, scope: !17, inlinedAt: !162)
!162 = distinct !DILocation(line: 64, column: 3, scope: !159)
!163 = !DILocation(line: 12, column: 11, scope: !17, inlinedAt: !162)
!164 = !DILocation(line: 12, column: 2, scope: !17, inlinedAt: !162)
!165 = !DILocation(line: 13, column: 2, scope: !17, inlinedAt: !162)
!166 = !DILocation(line: 62, column: 6, scope: !147)
!167 = !DILocation(line: 65, column: 12, scope: !147)
!168 = !DILocation(line: 65, column: 2, scope: !147)
!169 = distinct !DISubprogram(name: "matrix", scope: !18, file: !18, line: 69, type: !170, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !172)
!170 = !DISubroutineType(types: !171)
!171 = !{!8, !7, !7, !7, !7}
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180}
!173 = !DILocalVariable(name: "nrl", arg: 1, scope: !169, file: !18, line: 69, type: !7)
!174 = !DILocalVariable(name: "nrh", arg: 2, scope: !169, file: !18, line: 69, type: !7)
!175 = !DILocalVariable(name: "ncl", arg: 3, scope: !169, file: !18, line: 69, type: !7)
