; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/519.lbm_r/llvm-ir/519.lbm_r_bc/src/lbm.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/519.lbm_r/src/lbm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [49 x i8] c"LBM_allocateGrid: could not allocate %.1f MByte\0A\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.2 = private unnamed_addr constant [148 x i8] c"LBM_showGridStatistics:\0A\09nObstacleCells: %7i nAccelCells: %7i nFluidCells: %7i\0A\09minRho: %8.6f maxRho: %8.6f Mass: %e\0A\09minU  : %8.6f maxU  : %8.6f\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.5 = private unnamed_addr constant [10 x i8] c"%e %e %e\0A\00", align 1
@.str.6 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"%f %f %f\0A\00", align 1
@.str.8 = private unnamed_addr constant [43 x i8] c"LBM_compareVelocityField: maxDiff = %e  \0A\0A\00", align 1

; Function Attrs: nounwind uwtable
define dso_local void @LBM_allocateGrid(ptr nocapture noundef writeonly %ptr) local_unnamed_addr #0 !dbg !47 {
entry:
  call void @llvm.dbg.value(metadata ptr %ptr, metadata !55, metadata !DIExpression()), !dbg !62

!102 = !DILocation(line: 58, column: 3, scope: !96)
!103 = !DILocation(line: 58, column: 21, scope: !96)
!104 = !{!105, !105, i64 0}
!105 = !{!"double", !67, i64 0}
!106 = !DILocation(line: 59, column: 3, scope: !96)
!107 = !DILocation(line: 59, column: 21, scope: !96)
!108 = !DILocation(line: 60, column: 3, scope: !96)
!109 = !DILocation(line: 60, column: 21, scope: !96)
!110 = !DILocation(line: 61, column: 3, scope: !96)
!111 = !DILocation(line: 61, column: 21, scope: !96)
!112 = !DILocation(line: 62, column: 3, scope: !96)
!113 = !DILocation(line: 62, column: 21, scope: !96)
!114 = !DILocation(line: 63, column: 3, scope: !96)
!115 = !DILocation(line: 63, column: 21, scope: !96)
!116 = !DILocation(line: 64, column: 3, scope: !96)
!117 = !DILocation(line: 64, column: 21, scope: !96)
!118 = !DILocation(line: 65, column: 3, scope: !96)
!119 = !DILocation(line: 65, column: 21, scope: !96)
!120 = !DILocation(line: 66, column: 3, scope: !96)
!121 = !DILocation(line: 66, column: 21, scope: !96)
!122 = !DILocation(line: 67, column: 3, scope: !96)
!123 = !DILocation(line: 67, column: 21, scope: !96)
!124 = !DILocation(line: 68, column: 3, scope: !96)
!125 = !DILocation(line: 68, column: 21, scope: !96)
!126 = !DILocation(line: 69, column: 3, scope: !96)
!127 = !DILocation(line: 69, column: 21, scope: !96)
!128 = !DILocation(line: 70, column: 3, scope: !96)
!129 = !DILocation(line: 70, column: 21, scope: !96)
!130 = !DILocation(line: 71, column: 3, scope: !96)
!131 = !DILocation(line: 71, column: 21, scope: !96)
!132 = !DILocation(line: 72, column: 3, scope: !96)
!133 = !DILocation(line: 72, column: 21, scope: !96)
!134 = !DILocation(line: 73, column: 3, scope: !96)
!135 = !DILocation(line: 73, column: 21, scope: !96)
!136 = !DILocation(line: 74, column: 3, scope: !96)
!137 = !DILocation(line: 74, column: 21, scope: !96)
!138 = !DILocation(line: 75, column: 3, scope: !96)
!139 = !DILocation(line: 75, column: 21, scope: !96)
!140 = !DILocation(line: 76, column: 3, scope: !96)
!141 = !DILocation(line: 76, column: 21, scope: !96)
!142 = !DILocation(line: 78, column: 3, scope: !95)
!143 = !DILocation(line: 0, scope: !95)
!144 = !{!145, !145, i64 0}
!145 = !{!"int", !67, i64 0}
!146 = !DILocation(line: 57, column: 2, scope: !97)
!147 = distinct !{!147, !101, !148, !149, !150}
!148 = !DILocation(line: 79, column: 2, scope: !98)
!149 = !{!"llvm.loop.mustprogress"}
!150 = !{!"llvm.loop.unroll.disable"}
!151 = !DILocation(line: 80, column: 1, scope: !87)
!152 = distinct !DISubprogram(name: "LBM_swapGrids", scope: !48, file: !48, line: 84, type: !153, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !163)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_GridPtr", file: !157, line: 9, baseType: !158)
!157 = !DIFile(filename: "apps/519.lbm_r/src/lbm_1d_array.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "9999ab0a9cab1c793e34b2a812895996")
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_Grid", file: !157, line: 8, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1664000000, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 26000000)
!163 = !{!164, !165, !166}
!164 = !DILocalVariable(name: "grid1", arg: 1, scope: !152, file: !48, line: 84, type: !155)
!165 = !DILocalVariable(name: "grid2", arg: 2, scope: !152, file: !48, line: 84, type: !155)
!166 = !DILocalVariable(name: "aux", scope: !152, file: !48, line: 85, type: !156)
!167 = !DILocation(line: 0, scope: !152)
!168 = !DILocation(line: 85, column: 20, scope: !152)
!169 = !DILocation(line: 86, column: 11, scope: !152)
!170 = !DILocation(line: 86, column: 9, scope: !152)
!171 = !DILocation(line: 87, column: 9, scope: !152)
!172 = !DILocation(line: 88, column: 1, scope: !152)
!173 = distinct !DISubprogram(name: "LBM_loadObstacleFile", scope: !48, file: !48, line: 92, type: !174, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !178)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !52, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!178 = !{!179, !180, !181, !182, !183, !184, !241}
!179 = !DILocalVariable(name: "grid", arg: 1, scope: !173, file: !48, line: 92, type: !52)
!180 = !DILocalVariable(name: "filename", arg: 2, scope: !173, file: !48, line: 92, type: !176)
!181 = !DILocalVariable(name: "x", scope: !173, file: !48, line: 93, type: !93)
!182 = !DILocalVariable(name: "y", scope: !173, file: !48, line: 93, type: !93)
!183 = !DILocalVariable(name: "z", scope: !173, file: !48, line: 93, type: !93)
!184 = !DILocalVariable(name: "file", scope: !173, file: !48, line: 95, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !187, line: 7, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !189, line: 49, size: 1728, elements: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !206, !208, !209, !210, !214, !216, !218, !222, !225, !227, !230, !233, !234, !235, !236, !237}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !188, file: !189, line: 51, baseType: !93, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !188, file: !189, line: 54, baseType: !38, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !188, file: !189, line: 55, baseType: !38, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !188, file: !189, line: 56, baseType: !38, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !188, file: !189, line: 57, baseType: !38, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !188, file: !189, line: 58, baseType: !38, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !188, file: !189, line: 59, baseType: !38, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !188, file: !189, line: 60, baseType: !38, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !188, file: !189, line: 61, baseType: !38, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !188, file: !189, line: 64, baseType: !38, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !188, file: !189, line: 65, baseType: !38, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !188, file: !189, line: 66, baseType: !38, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !188, file: !189, line: 68, baseType: !204, size: 64, offset: 768)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !189, line: 36, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !188, file: !189, line: 70, baseType: !207, size: 64, offset: 832)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !188, file: !189, line: 72, baseType: !93, size: 32, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !188, file: !189, line: 73, baseType: !93, size: 32, offset: 928)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !188, file: !189, line: 74, baseType: !211, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !212, line: 152, baseType: !213)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!213 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !188, file: !189, line: 77, baseType: !215, size: 16, offset: 1024)
!215 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !188, file: !189, line: 78, baseType: !217, size: 8, offset: 1040)
!217 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !188, file: !189, line: 79, baseType: !219, size: 8, offset: 1048)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 1)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !188, file: !189, line: 81, baseType: !223, size: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !189, line: 43, baseType: null)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !188, file: !189, line: 89, baseType: !226, size: 64, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !212, line: 153, baseType: !213)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !188, file: !189, line: 91, baseType: !228, size: 64, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !189, line: 37, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !188, file: !189, line: 92, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !189, line: 38, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !188, file: !189, line: 93, baseType: !207, size: 64, offset: 1344)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !188, file: !189, line: 94, baseType: !35, size: 64, offset: 1408)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !188, file: !189, line: 95, baseType: !58, size: 64, offset: 1472)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !188, file: !189, line: 96, baseType: !93, size: 32, offset: 1536)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !188, file: !189, line: 98, baseType: !238, size: 160, offset: 1568)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 20)
!241 = !DILocalVariable(name: "_aux_", scope: !242, file: !48, line: 100, type: !99)
!242 = distinct !DILexicalBlock(scope: !243, file: !48, line: 100, column: 32)
!243 = distinct !DILexicalBlock(scope: !244, file: !48, line: 100, column: 9)
!244 = distinct !DILexicalBlock(scope: !245, file: !48, line: 99, column: 34)
!245 = distinct !DILexicalBlock(scope: !246, file: !48, line: 99, column: 4)
!246 = distinct !DILexicalBlock(scope: !247, file: !48, line: 99, column: 4)
!247 = distinct !DILexicalBlock(scope: !248, file: !48, line: 98, column: 33)
!248 = distinct !DILexicalBlock(scope: !249, file: !48, line: 98, column: 3)
!249 = distinct !DILexicalBlock(scope: !250, file: !48, line: 98, column: 3)
!250 = distinct !DILexicalBlock(scope: !251, file: !48, line: 97, column: 32)
!251 = distinct !DILexicalBlock(scope: !252, file: !48, line: 97, column: 2)
!252 = distinct !DILexicalBlock(scope: !173, file: !48, line: 97, column: 2)
!253 = !DILocation(line: 0, scope: !173)
!254 = !DILocation(line: 95, column: 15, scope: !173)
!255 = !DILocation(line: 97, column: 2, scope: !252)
!256 = !DILocation(line: 98, column: 3, scope: !249)
!257 = !DILocation(line: 99, column: 4, scope: !246)
!258 = !DILocation(line: 100, column: 9, scope: !243)
!259 = !DILocation(line: 100, column: 23, scope: !243)
!260 = !DILocation(line: 100, column: 9, scope: !244)
!261 = !DILocation(line: 100, column: 32, scope: !242)
!262 = !DILocation(line: 0, scope: !242)
!263 = !DILocation(line: 99, column: 29, scope: !245)
!264 = !DILocation(line: 99, column: 18, scope: !245)
!265 = distinct !{!265, !257, !266, !149, !150}
!266 = !DILocation(line: 101, column: 4, scope: !246)
!267 = !DILocation(line: 102, column: 4, scope: !247)
!268 = !DILocation(line: 98, column: 28, scope: !248)
!269 = !DILocation(line: 98, column: 17, scope: !248)
!270 = distinct !{!270, !256, !271, !149, !150}
!271 = !DILocation(line: 103, column: 3, scope: !249)
!272 = !DILocation(line: 104, column: 3, scope: !250)
!273 = !DILocation(line: 97, column: 27, scope: !251)
!274 = !DILocation(line: 97, column: 16, scope: !251)
!275 = distinct !{!275, !255, !276, !149, !150}
!276 = !DILocation(line: 105, column: 2, scope: !252)
!277 = !DILocation(line: 107, column: 2, scope: !173)
!278 = !DILocation(line: 108, column: 1, scope: !173)
!279 = !DISubprogram(name: "fgetc", scope: !280, file: !280, line: 485, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !283)
!280 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!281 = !DISubroutineType(types: !282)
!282 = !{!93, !185}
!283 = !{}
!284 = !DISubprogram(name: "fclose", scope: !280, file: !280, line: 213, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !283)
!285 = distinct !DISubprogram(name: "LBM_initializeSpecialCellsForLDC", scope: !48, file: !48, line: 112, type: !88, scopeLine: 112, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !286)
!286 = !{!287, !288, !289, !290, !291, !304}
!287 = !DILocalVariable(name: "grid", arg: 1, scope: !285, file: !48, line: 112, type: !52)
!288 = !DILocalVariable(name: "x", scope: !285, file: !48, line: 113, type: !93)
!289 = !DILocalVariable(name: "y", scope: !285, file: !48, line: 113, type: !93)
!290 = !DILocalVariable(name: "z", scope: !285, file: !48, line: 113, type: !93)
!291 = !DILocalVariable(name: "_aux_", scope: !292, file: !48, line: 125, type: !99)
!292 = distinct !DILexicalBlock(scope: !293, file: !48, line: 125, column: 6)
!293 = distinct !DILexicalBlock(scope: !294, file: !48, line: 124, column: 35)
