; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/505.mcf_r/llvm-ir/505.mcf_r_bc/src/mcf.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/mcf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64 }

@.str = private unnamed_addr constant [34 x i8] c"active arcs                : %ld\0A\00", align 1
@net = dso_local global %struct.network zeroinitializer, align 8, !dbg !0
@.str.1 = private unnamed_addr constant [34 x i8] c"simplex iterations         : %ld\0A\00", align 1
@.str.2 = private unnamed_addr constant [36 x i8] c"objective value            : %0.0f\0A\00", align 1
@.str.4 = private unnamed_addr constant [34 x i8] c"erased arcs                : %ld\0A\00", align 1
@.str.5 = private unnamed_addr constant [34 x i8] c"new implicit arcs          : %ld\0A\00", align 1
@.str.6 = private unnamed_addr constant [36 x i8] c"checksum                   : %0.0f\0A\00", align 1
@.str.13 = private unnamed_addr constant [11 x i8] c"mcf.%d.out\00", align 1
@.str.16 = private unnamed_addr constant [34 x i8] c"nodes                      : %ld\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "net", scope: !2, file: !21, line: 30, type: !22, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/mcf.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/505.mcf_r", checksumkind: CSK_MD5, checksum: "68421b99eaebf895bf4140b53f89af68")
!4 = !{!5, !12, !13, !7, !16, !17}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !6, line: 98, baseType: !7)
!6 = !DIFile(filename: "apps/505.mcf_r/src/defines.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "05eeb7bba098b08025cbe048b289d372")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !8, line: 27, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 44, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!11 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 46, baseType: !15)
!14 = !DIFile(filename: "llvm-project/build/lib/clang/15.0.0/include/stddef.h", directory: "/home/rouzbeh/Graduate/LLVM", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!15 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !{!0}
!21 = !DIFile(filename: "apps/505.mcf_r/src/mcf.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "68421b99eaebf895bf4140b53f89af68")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !6, line: 206, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !6, line: 181, size: 5184, elements: !24)
!24 = !{!25, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !49, !50, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !23, file: !6, line: 183, baseType: !26, size: 1600)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1600, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 200)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !23, file: !6, line: 184, baseType: !26, size: 1600, offset: 1600)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !23, file: !6, line: 185, baseType: !7, size: 64, offset: 3200)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !23, file: !6, line: 185, baseType: !7, size: 64, offset: 3264)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !23, file: !6, line: 186, baseType: !7, size: 64, offset: 3328)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !23, file: !6, line: 186, baseType: !7, size: 64, offset: 3392)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !23, file: !6, line: 186, baseType: !7, size: 64, offset: 3456)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !23, file: !6, line: 186, baseType: !7, size: 64, offset: 3520)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !23, file: !6, line: 187, baseType: !7, size: 64, offset: 3584)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !23, file: !6, line: 187, baseType: !7, size: 64, offset: 3648)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !23, file: !6, line: 189, baseType: !7, size: 64, offset: 3712)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !23, file: !6, line: 190, baseType: !7, size: 64, offset: 3776)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !23, file: !6, line: 191, baseType: !7, size: 64, offset: 3840)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !23, file: !6, line: 192, baseType: !7, size: 64, offset: 3904)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !23, file: !6, line: 193, baseType: !7, size: 64, offset: 3968)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !23, file: !6, line: 194, baseType: !7, size: 64, offset: 4032)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !23, file: !6, line: 195, baseType: !7, size: 64, offset: 4096)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !23, file: !6, line: 196, baseType: !7, size: 64, offset: 4160)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !23, file: !6, line: 197, baseType: !7, size: 64, offset: 4224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !23, file: !6, line: 198, baseType: !48, size: 64, offset: 4288)
!48 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !23, file: !6, line: 199, baseType: !5, size: 64, offset: 4352)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !23, file: !6, line: 200, baseType: !51, size: 64, offset: 4416)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !6, line: 135, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !6, line: 149, size: 832, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !77, !78, !79, !80, !81, !82, !83}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !53, file: !6, line: 151, baseType: !5, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !53, file: !6, line: 152, baseType: !16, size: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !53, file: !6, line: 153, baseType: !51, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !53, file: !6, line: 154, baseType: !51, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !53, file: !6, line: 155, baseType: !51, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !53, file: !6, line: 156, baseType: !51, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !53, file: !6, line: 157, baseType: !62, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !6, line: 138, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !6, line: 168, size: 576, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !72, !73, !74, !76}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !64, file: !6, line: 170, baseType: !16, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !64, file: !6, line: 171, baseType: !5, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !64, file: !6, line: 172, baseType: !51, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !64, file: !6, line: 172, baseType: !51, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !64, file: !6, line: 173, baseType: !71, size: 16, offset: 256)
!71 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !64, file: !6, line: 174, baseType: !62, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !64, file: !6, line: 174, baseType: !62, size: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !64, file: !6, line: 175, baseType: !75, size: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !6, line: 97, baseType: !7)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !64, file: !6, line: 176, baseType: !5, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !53, file: !6, line: 158, baseType: !62, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !53, file: !6, line: 158, baseType: !62, size: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !53, file: !6, line: 159, baseType: !62, size: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !53, file: !6, line: 160, baseType: !75, size: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !53, file: !6, line: 161, baseType: !7, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !53, file: !6, line: 162, baseType: !16, size: 32, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !53, file: !6, line: 163, baseType: !16, size: 32, offset: 800)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !23, file: !6, line: 200, baseType: !51, size: 64, offset: 4480)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !23, file: !6, line: 201, baseType: !62, size: 64, offset: 4544)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !23, file: !6, line: 201, baseType: !62, size: 64, offset: 4608)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !23, file: !6, line: 201, baseType: !62, size: 64, offset: 4672)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !23, file: !6, line: 202, baseType: !62, size: 64, offset: 4736)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !23, file: !6, line: 202, baseType: !62, size: 64, offset: 4800)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !23, file: !6, line: 203, baseType: !7, size: 64, offset: 4864)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !23, file: !6, line: 204, baseType: !7, size: 64, offset: 4928)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !23, file: !6, line: 205, baseType: !7, size: 64, offset: 4992)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !23, file: !6, line: 205, baseType: !7, size: 64, offset: 5056)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !23, file: !6, line: 205, baseType: !7, size: 64, offset: 5120)
!95 = !{i32 7, !"Dwarf Version", i32 5}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{i32 1, !"wchar_size", i32 4}
!98 = !{i32 7, !"PIC Level", i32 2}
!99 = !{i32 7, !"PIE Level", i32 2}
!100 = !{i32 7, !"uwtable", i32 2}
!101 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!102 = distinct !DISubprogram(name: "global_opt", scope: !21, file: !21, line: 37, type: !103, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !105)
!103 = !DISubroutineType(types: !104)
!104 = !{!7}
!105 = !{!106, !107}
!106 = !DILocalVariable(name: "new_arcs", scope: !102, file: !21, line: 42, type: !7)
!107 = !DILocalVariable(name: "residual_nb_it", scope: !102, file: !21, line: 43, type: !7)
!108 = !DILocation(line: 0, scope: !102)
!109 = !DILocation(line: 48, column: 3, scope: !102)
!110 = !DILocation(line: 51, column: 63, scope: !111)
!111 = distinct !DILexicalBlock(scope: !102, file: !21, line: 49, column: 3)
!112 = !{!113, !116, i64 424}
!113 = !{!"network", !114, i64 0, !114, i64 200, !116, i64 400, !116, i64 408, !116, i64 416, !116, i64 424, !116, i64 432, !116, i64 440, !116, i64 448, !116, i64 456, !116, i64 464, !116, i64 472, !116, i64 480, !116, i64 488, !116, i64 496, !116, i64 504, !116, i64 512, !116, i64 520, !116, i64 528, !117, i64 536, !116, i64 544, !118, i64 552, !118, i64 560, !118, i64 568, !118, i64 576, !118, i64 584, !118, i64 592, !118, i64 600, !116, i64 608, !116, i64 616, !116, i64 624, !116, i64 632, !116, i64 640}
!114 = !{!"omnipotent char", !115, i64 0}
!115 = !{!"Simple C/C++ TBAA"}
!116 = !{!"long", !114, i64 0}
!117 = !{!"double", !114, i64 0}
!118 = !{!"any pointer", !114, i64 0}
!119 = !DILocation(line: 51, column: 5, scope: !111)
!120 = !DILocation(line: 54, column: 5, scope: !111)
!121 = !DILocation(line: 57, column: 63, scope: !111)
!122 = !{!113, !116, i64 608}
!123 = !DILocation(line: 57, column: 5, scope: !111)
!124 = !DILocation(line: 58, column: 53, scope: !111)
!125 = !DILocation(line: 58, column: 5, scope: !111)
!126 = !DILocation(line: 67, column: 13, scope: !127)
!127 = distinct !DILexicalBlock(scope: !111, file: !21, line: 67, column: 9)
!128 = !{!113, !116, i64 440}
!129 = !DILocation(line: 67, column: 9, scope: !127)
!130 = !DILocation(line: 67, column: 9, scope: !111)
!131 = !DILocation(line: 69, column: 18, scope: !132)
!132 = distinct !DILexicalBlock(scope: !127, file: !21, line: 68, column: 5)
!133 = !DILocation(line: 71, column: 21, scope: !134)
!134 = distinct !DILexicalBlock(scope: !132, file: !21, line: 71, column: 12)
!135 = !DILocation(line: 71, column: 12, scope: !132)
!136 = !DILocation(line: 74, column: 9, scope: !137)
!137 = distinct !DILexicalBlock(scope: !134, file: !21, line: 72, column: 7)
!138 = !DILocation(line: 77, column: 9, scope: !137)
!139 = !DILocation(line: 80, column: 11, scope: !140)
!140 = distinct !DILexicalBlock(scope: !132, file: !21, line: 80, column: 11)
!141 = !DILocation(line: 80, column: 11, scope: !132)
!142 = !DILocation(line: 81, column: 9, scope: !140)
!143 = !DILocation(line: 86, column: 58, scope: !144)
!144 = distinct !DILexicalBlock(scope: !127, file: !21, line: 85, column: 5)
!145 = !DILocation(line: 86, column: 7, scope: !144)
!146 = !DILocation(line: 90, column: 16, scope: !111)
!147 = !DILocation(line: 93, column: 9, scope: !148)
!148 = distinct !DILexicalBlock(scope: !111, file: !21, line: 93, column: 9)
!149 = !DILocation(line: 93, column: 9, scope: !111)
!150 = !DILocation(line: 94, column: 7, scope: !148)
!151 = !DILocation(line: 97, column: 18, scope: !152)
!152 = distinct !DILexicalBlock(scope: !111, file: !21, line: 97, column: 9)
!153 = !DILocation(line: 97, column: 9, scope: !111)
!154 = distinct !{!154, !109, !155, !156, !157}
