; ModuleID = '/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/505.mcf_r/llvm-ir/505.mcf_r_bc/src/treeup.c.bc'
source_filename = "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/treeup.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.arc = type { i32, i64, ptr, ptr, i16, ptr, ptr, i64, i64 }
%struct.node = type { i64, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i32, i32 }

; Function Attrs: nofree norecurse nosync nounwind uwtable
define dso_local void @update_tree(i64 noundef %cycle_ori, i64 noundef %new_orientation, i64 noundef %delta, i64 noundef %new_flow, ptr noundef %iplus, ptr noundef %jplus, ptr noundef %iminus, ptr noundef %jminus, ptr noundef readnone %w, ptr noundef %bea, i64 noundef %sigma, i64 noundef %feas_tol) local_unnamed_addr #0 !dbg !9 {
entry:
  call void @llvm.dbg.value(metadata i64 %cycle_ori, metadata !59, metadata !DIExpression()), !dbg !87
  call void @llvm.dbg.value(metadata i64 %new_orientation, metadata !60, metadata !DIExpression()), !dbg !87
  call void @llvm.dbg.value(metadata i64 %delta, metadata !61, metadata !DIExpression()), !dbg !87
  call void @llvm.dbg.value(metadata i64 %new_flow, metadata !62, metadata !DIExpression()), !dbg !87
  call void @llvm.dbg.value(metadata ptr %iplus, metadata !63, metadata !DIExpression()), !dbg !87

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/apps/505.mcf_r/src/treeup.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake/build/apps/505.mcf_r", checksumkind: CSK_MD5, checksum: "ef0ab74f9ccbe7f6abaffc8ea1417580")
!2 = !{i32 7, !"Dwarf Version", i32 5}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{i32 1, !"wchar_size", i32 4}
!5 = !{i32 7, !"PIC Level", i32 2}
!6 = !{i32 7, !"PIE Level", i32 2}
!7 = !{i32 7, !"uwtable", i32 2}
!8 = !{!"clang version 15.0.0 (https://www.github.com/llvm/llvm-project.git 61baf2ffa7071944c00a0642fdb9ff77d9cff0da)"}
!9 = distinct !DISubprogram(name: "update_tree", scope: !10, file: !10, line: 30, type: !11, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !58)
!10 = !DIFile(filename: "apps/505.mcf_r/src/treeup.c", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "ef0ab74f9ccbe7f6abaffc8ea1417580")
!11 = !DISubroutineType(types: !12)
!12 = !{null, !13, !13, !18, !18, !20, !20, !20, !20, !20, !56, !25, !18}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !14, line: 27, baseType: !15)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !16, line: 44, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!17 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !19, line: 97, baseType: !13)
!19 = !DIFile(filename: "apps/505.mcf_r/src/defines.h", directory: "/home/rouzbeh/Graduate/LLVM/spec2017cpu-cmake", checksumkind: CSK_MD5, checksum: "05eeb7bba098b08025cbe048b289d372")
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !19, line: 134, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !19, line: 149, size: 832, elements: !23)
!23 = !{!24, !26, !28, !31, !32, !33, !34, !49, !50, !51, !52, !53, !54, !55}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !22, file: !19, line: 151, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !19, line: 98, baseType: !13)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !22, file: !19, line: 152, baseType: !27, size: 32, offset: 64)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !22, file: !19, line: 153, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !19, line: 135, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !22, file: !19, line: 154, baseType: !29, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !22, file: !19, line: 155, baseType: !29, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !22, file: !19, line: 156, baseType: !29, size: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !22, file: !19, line: 157, baseType: !35, size: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !19, line: 138, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !19, line: 168, size: 576, elements: !38)
!38 = !{!39, !40, !41, !42, !43, !45, !46, !47, !48}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !37, file: !19, line: 170, baseType: !27, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !37, file: !19, line: 171, baseType: !25, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !37, file: !19, line: 172, baseType: !29, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !37, file: !19, line: 172, baseType: !29, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !37, file: !19, line: 173, baseType: !44, size: 16, offset: 256)
!44 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !37, file: !19, line: 174, baseType: !35, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !37, file: !19, line: 174, baseType: !35, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !37, file: !19, line: 175, baseType: !18, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !37, file: !19, line: 176, baseType: !25, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !22, file: !19, line: 158, baseType: !35, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !22, file: !19, line: 158, baseType: !35, size: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !22, file: !19, line: 159, baseType: !35, size: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !22, file: !19, line: 160, baseType: !18, size: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !22, file: !19, line: 161, baseType: !13, size: 64, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !22, file: !19, line: 162, baseType: !27, size: 32, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !22, file: !19, line: 163, baseType: !27, size: 32, offset: 800)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !19, line: 137, baseType: !37)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !85, !86}
!59 = !DILocalVariable(name: "cycle_ori", arg: 1, scope: !9, file: !10, line: 31, type: !13)
!60 = !DILocalVariable(name: "new_orientation", arg: 2, scope: !9, file: !10, line: 32, type: !13)
!61 = !DILocalVariable(name: "delta", arg: 3, scope: !9, file: !10, line: 33, type: !18)
!62 = !DILocalVariable(name: "new_flow", arg: 4, scope: !9, file: !10, line: 34, type: !18)
!63 = !DILocalVariable(name: "iplus", arg: 5, scope: !9, file: !10, line: 35, type: !20)
!64 = !DILocalVariable(name: "jplus", arg: 6, scope: !9, file: !10, line: 36, type: !20)
!65 = !DILocalVariable(name: "iminus", arg: 7, scope: !9, file: !10, line: 37, type: !20)
!66 = !DILocalVariable(name: "jminus", arg: 8, scope: !9, file: !10, line: 38, type: !20)
!67 = !DILocalVariable(name: "w", arg: 9, scope: !9, file: !10, line: 39, type: !20)
!68 = !DILocalVariable(name: "bea", arg: 10, scope: !9, file: !10, line: 40, type: !56)
!69 = !DILocalVariable(name: "sigma", arg: 11, scope: !9, file: !10, line: 41, type: !25)
!70 = !DILocalVariable(name: "feas_tol", arg: 12, scope: !9, file: !10, line: 42, type: !18)
!71 = !DILocalVariable(name: "basic_arc_temp", scope: !9, file: !10, line: 59, type: !56)
!72 = !DILocalVariable(name: "new_basic_arc", scope: !9, file: !10, line: 60, type: !56)
!73 = !DILocalVariable(name: "father", scope: !9, file: !10, line: 61, type: !20)
!74 = !DILocalVariable(name: "temp", scope: !9, file: !10, line: 62, type: !20)
!75 = !DILocalVariable(name: "new_pred", scope: !9, file: !10, line: 63, type: !20)
!76 = !DILocalVariable(name: "orientation_temp", scope: !9, file: !10, line: 64, type: !13)
!77 = !DILocalVariable(name: "depth_temp", scope: !9, file: !10, line: 65, type: !13)
!78 = !DILocalVariable(name: "depth_iminus", scope: !9, file: !10, line: 66, type: !13)
!79 = !DILocalVariable(name: "new_depth", scope: !9, file: !10, line: 67, type: !13)
!80 = !DILocalVariable(name: "flow_temp", scope: !9, file: !10, line: 68, type: !18)
!81 = !DILabel(scope: !9, name: "RECURSION", file: !10, line: 80)
!82 = !DILabel(scope: !83, name: "ITERATION", file: !10, line: 84)
!83 = distinct !DILexicalBlock(scope: !84, file: !10, line: 83, column: 5)
!84 = distinct !DILexicalBlock(scope: !9, file: !10, line: 82, column: 9)
!85 = !DILabel(scope: !9, name: "TEST", file: !10, line: 89)
!86 = !DILabel(scope: !9, name: "CONTINUE", file: !10, line: 98)
!87 = !DILocation(line: 0, scope: !9)
!88 = !DILocation(line: 72, column: 15, scope: !89)
!89 = distinct !DILexicalBlock(scope: !9, file: !10, line: 72, column: 9)
!90 = !{!91, !96, i64 16}
!91 = !{!"arc", !92, i64 0, !95, i64 8, !96, i64 16, !96, i64 24, !97, i64 32, !96, i64 40, !96, i64 48, !95, i64 56, !95, i64 64}
!92 = !{!"int", !93, i64 0}
!93 = !{!"omnipotent char", !94, i64 0}
!94 = !{!"Simple C/C++ TBAA"}
!95 = !{!"long", !93, i64 0}
!96 = !{!"any pointer", !93, i64 0}
!97 = !{!"short", !93, i64 0}
!98 = !DILocation(line: 72, column: 20, scope: !89)
!99 = !DILocation(line: 72, column: 29, scope: !89)
!100 = !DILocation(line: 73, column: 20, scope: !89)
!101 = !DILocation(line: 73, column: 29, scope: !89)
!102 = !DILocation(line: 74, column: 17, scope: !89)
!103 = !DILocation(line: 76, column: 19, scope: !89)
!104 = !DILocation(line: 76, column: 17, scope: !89)
!105 = !DILocation(line: 0, scope: !89)
!106 = !DILocation(line: 79, column: 5, scope: !9)
!107 = !{!108, !95, i64 0}
!108 = !{!"node", !95, i64 0, !92, i64 8, !96, i64 16, !96, i64 24, !96, i64 32, !96, i64 40, !96, i64 48, !96, i64 56, !96, i64 64, !96, i64 72, !95, i64 80, !95, i64 88, !92, i64 96, !92, i64 100}
