; ModuleID = '/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/database.c'
source_filename = "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/database.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.DICTt = type { i32, %struct.DICT_ENTRYt* }
%struct.DICT_ENTRYt = type { i8*, i8* }
%struct.DATABASEt = type { i32, %struct._IO_FILE*, [256 x i8], i32, i32, [10 x [256 x i8]], i8, i8*, i32, [1000 x i8], i32, [256 x i8], i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ENTRYt = type { i64, [256 x i8], i32, i32 }

@GiDBLastError = dso_local local_unnamed_addr global i32 0, align 4, !dbg !0
@.str = private unnamed_addr constant [10 x i8] c"!%s %s %s\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"single\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"array\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"table\00", align 1
@.str.4 = private unnamed_addr constant [17 x i8] c"Unknown modifier\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GiDBLastError", scope: !2, file: !7, line: 473, type: !13, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !166, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/database.c", directory: "/home/rouzbeh/Graduate/Research/LLVM/ALC/test/Compiled_files")
!4 = !{}
!5 = !{!6, !24, !23, !15, !20, !28, !30, !39, !40, !55, !113, !117, !120, !148, !151, !152, !153, !156, !157, !159, !160, !163}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "DICT", file: !7, line: 268, baseType: !8)
!7 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/database.c", directory: "/home/rouzbeh/Graduate/Research")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "DICTt", file: !7, line: 266, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 263, size: 128, elements: !11)
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "iEntries", scope: !10, file: !7, line: 264, baseType: !13, size: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "dePEntries", scope: !10, file: !7, line: 265, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "DICT_ENTRYt", file: !7, line: 261, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 258, size: 128, elements: !18)
!18 = !{!19, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cPKey", scope: !17, file: !7, line: 259, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "vPData", scope: !17, file: !7, line: 260, baseType: !23, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DISubprogram(name: "free", scope: !25, file: !25, line: 565, type: !26, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!25 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!26 = !DISubroutineType(types: !27)
!27 = !{null, !23}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!30 = !DISubprogram(name: "qsort", scope: !25, file: !25, line: 830, type: !31, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !23, !33, !33, !34}
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!13, !37, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENTRY", file: !41, line: 57, baseType: !42)
!41 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/database.h", directory: "/home/rouzbeh/Graduate/Research")
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENTRYt", file: !41, line: 55, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 50, size: 2176, elements: !45)
!45 = !{!46, !48, !53, !54}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "lFileOffset", scope: !44, file: !41, line: 51, baseType: !47, size: 64)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sName", scope: !44, file: !41, line: 52, baseType: !49, size: 2048, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !41, line: 48, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "iType", scope: !44, file: !41, line: 53, baseType: !13, size: 32, offset: 2112)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "iRows", scope: !44, file: !41, line: 54, baseType: !13, size: 32, offset: 2144)
!55 = !DISubprogram(name: "fclose", scope: !56, file: !56, line: 213, type: !57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!56 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!57 = !DISubroutineType(types: !58)
!58 = !{!13, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !78, !79, !80, !81, !84, !86, !88, !92, !95, !97, !100, !103, !104, !105, !108, !109}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 51, baseType: !13, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 54, baseType: !20, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 55, baseType: !20, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 56, baseType: !20, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 57, baseType: !20, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 58, baseType: !20, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 59, baseType: !20, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 60, baseType: !20, size: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 61, baseType: !20, size: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 64, baseType: !20, size: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 65, baseType: !20, size: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 66, baseType: !20, size: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 36, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 70, baseType: !59, size: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 72, baseType: !13, size: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 73, baseType: !13, size: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !83, line: 152, baseType: !47)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 77, baseType: !85, size: 16, offset: 1024)
!85 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 78, baseType: !87, size: 8, offset: 1040)
!87 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 79, baseType: !89, size: 8, offset: 1048)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 81, baseType: !93, size: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 43, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 89, baseType: !96, size: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !83, line: 153, baseType: !47)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !60, file: !61, line: 91, baseType: !98, size: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !61, line: 37, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !60, file: !61, line: 92, baseType: !101, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !61, line: 38, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !60, file: !61, line: 93, baseType: !59, size: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !60, file: !61, line: 94, baseType: !23, size: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 95, baseType: !106, size: 64, offset: 1472)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 46, baseType: !33)
!107 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 96, baseType: !13, size: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 98, baseType: !110, size: 160, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DISubprogram(name: "unlink", scope: !114, file: !114, line: 825, type: !115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!114 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!115 = !DISubroutineType(types: !116)
!116 = !{!13, !28}
!117 = !DISubprogram(name: "rename", scope: !56, file: !56, line: 148, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!118 = !DISubroutineType(types: !119)
!119 = !{!13, !28, !28}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATABASE", file: !41, line: 84, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATABASEt", file: !41, line: 82, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 65, size: 33024, elements: !124)
!124 = !{!125, !126, !130, !131, !132, !133, !137, !139, !140, !141, !145, !146, !147}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "iAccessMode", scope: !123, file: !41, line: 66, baseType: !13, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "fDataBase", scope: !123, file: !41, line: 67, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !129, line: 7, baseType: !60)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sFileName", scope: !123, file: !41, line: 68, baseType: !49, size: 2048, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "iOpenMode", scope: !123, file: !41, line: 69, baseType: !13, size: 32, offset: 2176)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "iPrefix", scope: !123, file: !41, line: 70, baseType: !13, size: 32, offset: 2208)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "saPrefixStack", scope: !123, file: !41, line: 71, baseType: !134, size: 20480, offset: 2240)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 20480, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 10)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "bCompactFileAtClose", scope: !123, file: !41, line: 72, baseType: !138, size: 8, offset: 22720)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !41, line: 47, baseType: !21)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "dEntries", scope: !123, file: !41, line: 73, baseType: !23, size: 64, offset: 22784)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "iCurrentLine", scope: !123, file: !41, line: 74, baseType: !13, size: 32, offset: 22848)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sLookAhead", scope: !123, file: !41, line: 75, baseType: !142, size: 8000, offset: 22880)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8000, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 1000)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "iLastSequentialOperation", scope: !123, file: !41, line: 76, baseType: !13, size: 32, offset: 30880)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sLoopPrefix", scope: !123, file: !41, line: 79, baseType: !49, size: 2048, offset: 30912)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "dlEntryLoop", scope: !123, file: !41, line: 80, baseType: !13, size: 32, offset: 32960)
!148 = !DISubprogram(name: "fseek", scope: !56, file: !56, line: 684, type: !149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!149 = !DISubroutineType(types: !150)
!150 = !{!13, !59, !47, !13}
!151 = !DISubprogram(name: "fgetc", scope: !56, file: !56, line: 485, type: !57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!152 = !DISubprogram(name: "feof", scope: !56, file: !56, line: 759, type: !57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!153 = !DISubprogram(name: "ftell", scope: !56, file: !56, line: 689, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!154 = !DISubroutineType(types: !155)
!155 = !{!47, !59}
!156 = !DISubprogram(name: "fflush", scope: !56, file: !56, line: 218, type: !57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!160 = !DISubprogram(name: "fputs", scope: !56, file: !56, line: 626, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!161 = !DISubroutineType(types: !162)
!162 = !{!13, !28, !59}
!163 = !DISubprogram(name: "fgets", scope: !56, file: !56, line: 564, type: !164, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!164 = !DISubroutineType(types: !165)
!165 = !{!20, !20, !13, !59}
!166 = !{!0}
!167 = !{i32 7, !"Dwarf Version", i32 4}
!168 = !{i32 2, !"Debug Info Version", i32 3}
!169 = !{i32 1, !"wchar_size", i32 4}
!170 = !{!"clang version 10.0.0-4ubuntu1 "}
!171 = distinct !DISubprogram(name: "sDBRemoveSpaces", scope: !7, file: !7, line: 115, type: !172, scopeLine: 118, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !174)
!172 = !DISubroutineType(types: !173)
!173 = !{!20, !20, !20}
!174 = !{!175, !176, !177}
!175 = !DILocalVariable(name: "sIn", arg: 1, scope: !171, file: !7, line: 116, type: !20)
!176 = !DILocalVariable(name: "sOut", arg: 2, scope: !171, file: !7, line: 117, type: !20)
!177 = !DILocalVariable(name: "sWrite", scope: !171, file: !7, line: 119, type: !20)
!178 = !DILocation(line: 0, scope: !171)
!179 = !DILocation(line: 125, column: 5, scope: !171)
!180 = !DILocation(line: 125, column: 14, scope: !171)
!181 = !{!182, !182, i64 0}
!182 = !{!"omnipotent char", !183, i64 0}
!183 = !{!"Simple C/C++ TBAA"}
!184 = !DILocation(line: 126, column: 36, scope: !185)
!185 = distinct !DILexicalBlock(scope: !186, file: !7, line: 126, column: 14)
!186 = distinct !DILexicalBlock(scope: !171, file: !7, line: 125, column: 29)
!187 = !DILocation(line: 126, column: 39, scope: !185)
!188 = !DILocation(line: 126, column: 28, scope: !185)
!189 = !DILocation(line: 127, column: 12, scope: !186)
!190 = distinct !{!190, !179, !191}
!191 = !DILocation(line: 128, column: 5, scope: !171)
!192 = !DILocation(line: 129, column: 15, scope: !171)
!193 = !DILocation(line: 130, column: 5, scope: !171)
!194 = distinct !DISubprogram(name: "sDBRemoveControlAndPadding", scope: !7, file: !7, line: 148, type: !172, scopeLine: 151, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !195)
!195 = !{!196, !197, !198, !199, !200}
!196 = !DILocalVariable(name: "sRaw", arg: 1, scope: !194, file: !7, line: 149, type: !20)
!197 = !DILocalVariable(name: "sResult", arg: 2, scope: !194, file: !7, line: 150, type: !20)
!198 = !DILocalVariable(name: "sCur", scope: !194, file: !7, line: 152, type: !20)
!199 = !DILocalVariable(name: "sResultCur", scope: !194, file: !7, line: 153, type: !20)
!200 = !DILabel(scope: !194, name: "DONE", file: !7, line: 184)
!201 = !DILocation(line: 0, scope: !194)
