; ModuleID = '/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/molio.c'
source_filename = "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/molio.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mat", scope: !2, file: !3, line: 164, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "getmatrix", scope: !3, file: !3, line: 159, type: !4, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !15, retainedNodes: !369)
!3 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/molio.c", directory: "/home/rouzbeh/Graduate/Research")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX_T", file: !8, line: 14, baseType: !9)
!8 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/Research")
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !11)
!10 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!11 = !{!12, !12}
!12 = !DISubrange(count: 4)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = distinct !DICompileUnit(language: DW_LANG_C99, file: !16, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !17, retainedTypes: !34, globals: !351, splitDebugInlining: false, nameTableKind: None)
!16 = !DIFile(filename: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/molio.c", directory: "/home/rouzbeh/Graduate/Research/LLVM/ALC/test/Compiled_files")
!17 = !{!18}
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 46, baseType: !20, size: 32, elements: !21)
!19 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!22 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!23 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!34 = !{!35, !40, !41, !44, !104, !107, !110, !111, !115, !144, !326, !329, !38, !330, !333, !336, !340, !13, !343, !75, !344}
!35 = !DISubprogram(name: "get_mytaskid", scope: !3, file: !3, line: 99, type: !36, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!36 = !DISubroutineType(types: !37)
!37 = !{!38}
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DISubprogram(name: "reducerror", scope: !3, file: !3, line: 100, type: !42, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !38}
!44 = !DISubprogram(name: "fclose", scope: !45, file: !45, line: 213, type: !46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!45 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!46 = !DISubroutineType(types: !47)
!47 = !{!38, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !50, line: 49, size: 1728, elements: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !67, !68, !69, !70, !74, !76, !78, !82, !85, !87, !90, !93, !94, !95, !99, !100}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !49, file: !50, line: 51, baseType: !38, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !49, file: !50, line: 54, baseType: !13, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !49, file: !50, line: 55, baseType: !13, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !49, file: !50, line: 56, baseType: !13, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !49, file: !50, line: 57, baseType: !13, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !49, file: !50, line: 58, baseType: !13, size: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !49, file: !50, line: 59, baseType: !13, size: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !49, file: !50, line: 60, baseType: !13, size: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !49, file: !50, line: 61, baseType: !13, size: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !49, file: !50, line: 64, baseType: !13, size: 64, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !49, file: !50, line: 65, baseType: !13, size: 64, offset: 640)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !49, file: !50, line: 66, baseType: !13, size: 64, offset: 704)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !49, file: !50, line: 68, baseType: !65, size: 64, offset: 768)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !50, line: 36, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !49, file: !50, line: 70, baseType: !48, size: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !49, file: !50, line: 72, baseType: !38, size: 32, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !49, file: !50, line: 73, baseType: !38, size: 32, offset: 928)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !49, file: !50, line: 74, baseType: !71, size: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !72, line: 152, baseType: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!73 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !49, file: !50, line: 77, baseType: !75, size: 16, offset: 1024)
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !49, file: !50, line: 78, baseType: !77, size: 8, offset: 1040)
!77 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !49, file: !50, line: 79, baseType: !79, size: 8, offset: 1048)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !49, file: !50, line: 81, baseType: !83, size: 64, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !50, line: 43, baseType: null)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !49, file: !50, line: 89, baseType: !86, size: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !72, line: 153, baseType: !73)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !49, file: !50, line: 91, baseType: !88, size: 64, offset: 1216)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !50, line: 37, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !49, file: !50, line: 92, baseType: !91, size: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !50, line: 38, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !49, file: !50, line: 93, baseType: !48, size: 64, offset: 1344)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !49, file: !50, line: 94, baseType: !40, size: 64, offset: 1408)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !49, file: !50, line: 95, baseType: !96, size: 64, offset: 1472)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !97, line: 46, baseType: !98)
!97 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!98 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !49, file: !50, line: 96, baseType: !38, size: 32, offset: 1536)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !49, file: !50, line: 98, baseType: !101, size: 160, offset: 1568)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 20)
!104 = !DISubprogram(name: "fgets", scope: !45, file: !45, line: 564, type: !105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!105 = !DISubroutineType(types: !106)
!106 = !{!13, !13, !38, !48}
!107 = !DISubprogram(name: "rt_errormsg_s", scope: !3, file: !3, line: 107, type: !108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!108 = !DISubroutineType(types: !109)
!109 = !{!38, !38, !13, !13}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!111 = !DISubprogram(name: "free", scope: !112, file: !112, line: 565, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!112 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!113 = !DISubroutineType(types: !114)
!114 = !{null, !40}
!115 = !DISubprogram(name: "select_atoms", scope: !3, file: !3, line: 106, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !118, !13}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !8, line: 118, size: 1088, elements: !120)
!120 = !{!121, !126, !128, !220, !221, !222, !223}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !119, file: !8, line: 119, baseType: !122, size: 768)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !8, line: 13, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 768, elements: !124)
!124 = !{!12, !125}
!125 = !DISubrange(count: 3)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !119, file: !8, line: 120, baseType: !127, size: 32, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !8, line: 6, baseType: !38)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !119, file: !8, line: 121, baseType: !129, size: 64, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !8, line: 93, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !8, line: 84, size: 384, elements: !132)
!132 = !{!133, !136, !137, !138, !139, !141, !142, !143}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !131, file: !8, line: 85, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !8, line: 17, baseType: !14)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !131, file: !8, line: 86, baseType: !127, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !131, file: !8, line: 87, baseType: !127, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !131, file: !8, line: 88, baseType: !118, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !131, file: !8, line: 89, baseType: !140, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !131, file: !8, line: 90, baseType: !127, size: 32, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !131, file: !8, line: 91, baseType: !127, size: 32, offset: 288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !131, file: !8, line: 92, baseType: !144, size: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !8, line: 82, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !8, line: 63, size: 1024, elements: !148)
!148 = !{!149, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !170, !171, !177, !178, !187, !188, !190}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !147, file: !8, line: 64, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !147, file: !8, line: 65, baseType: !127, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !147, file: !8, line: 66, baseType: !127, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !147, file: !8, line: 67, baseType: !127, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !147, file: !8, line: 68, baseType: !134, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !147, file: !8, line: 69, baseType: !134, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !147, file: !8, line: 70, baseType: !127, size: 32, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !147, file: !8, line: 71, baseType: !127, size: 32, offset: 352)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !147, file: !8, line: 72, baseType: !127, size: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !147, file: !8, line: 73, baseType: !140, size: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !147, file: !8, line: 74, baseType: !161, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !8, line: 52, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !8, line: 47, size: 192, elements: !164)
!164 = !{!165, !167, !168, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !163, file: !8, line: 48, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !163, file: !8, line: 49, baseType: !127, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !163, file: !8, line: 50, baseType: !127, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !163, file: !8, line: 51, baseType: !127, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !147, file: !8, line: 75, baseType: !127, size: 32, offset: 576)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !147, file: !8, line: 76, baseType: !172, size: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !8, line: 54, baseType: !174)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 64, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 2)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !147, file: !8, line: 77, baseType: !127, size: 32, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !147, file: !8, line: 78, baseType: !179, size: 64, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !8, line: 61, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !8, line: 58, size: 192, elements: !182)
!182 = !{!183, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !181, file: !8, line: 59, baseType: !184, size: 128)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 128, elements: !185)
!185 = !{!12}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !181, file: !8, line: 60, baseType: !10, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !147, file: !8, line: 79, baseType: !127, size: 32, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !147, file: !8, line: 80, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !147, file: !8, line: 81, baseType: !191, size: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !8, line: 45, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !8, line: 25, size: 1408, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !219}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !193, file: !8, line: 26, baseType: !134, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !193, file: !8, line: 27, baseType: !134, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !193, file: !8, line: 28, baseType: !127, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !193, file: !8, line: 29, baseType: !127, size: 32, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !193, file: !8, line: 30, baseType: !200, size: 256, offset: 192)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 256, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !193, file: !8, line: 31, baseType: !150, size: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !193, file: !8, line: 32, baseType: !10, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !193, file: !8, line: 33, baseType: !10, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !193, file: !8, line: 34, baseType: !10, size: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !193, file: !8, line: 35, baseType: !10, size: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !193, file: !8, line: 36, baseType: !134, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !193, file: !8, line: 37, baseType: !127, size: 32, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !193, file: !8, line: 38, baseType: !10, size: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !193, file: !8, line: 39, baseType: !10, size: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !193, file: !8, line: 40, baseType: !127, size: 32, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !193, file: !8, line: 41, baseType: !127, size: 32, offset: 1056)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !193, file: !8, line: 42, baseType: !134, size: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !193, file: !8, line: 43, baseType: !216, size: 192, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !8, line: 12, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !218)
!218 = !{!125}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !193, file: !8, line: 44, baseType: !10, size: 64, offset: 1344)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !119, file: !8, line: 122, baseType: !127, size: 32, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !119, file: !8, line: 123, baseType: !127, size: 32, offset: 928)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !119, file: !8, line: 124, baseType: !127, size: 32, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !119, file: !8, line: 125, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !8, line: 115, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !8, line: 95, size: 5760, elements: !227)
!227 = !{!228, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !226, file: !8, line: 96, baseType: !229, size: 648)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 648, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 81)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !226, file: !8, line: 97, baseType: !127, size: 32, offset: 672)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !226, file: !8, line: 97, baseType: !127, size: 32, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !226, file: !8, line: 97, baseType: !127, size: 32, offset: 736)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !226, file: !8, line: 98, baseType: !127, size: 32, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !226, file: !8, line: 98, baseType: !127, size: 32, offset: 800)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !226, file: !8, line: 98, baseType: !127, size: 32, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !226, file: !8, line: 98, baseType: !127, size: 32, offset: 864)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !226, file: !8, line: 98, baseType: !127, size: 32, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !226, file: !8, line: 98, baseType: !127, size: 32, offset: 928)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !226, file: !8, line: 99, baseType: !127, size: 32, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !226, file: !8, line: 99, baseType: !127, size: 32, offset: 992)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !226, file: !8, line: 99, baseType: !127, size: 32, offset: 1024)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !226, file: !8, line: 99, baseType: !127, size: 32, offset: 1056)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !226, file: !8, line: 99, baseType: !127, size: 32, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !226, file: !8, line: 99, baseType: !127, size: 32, offset: 1120)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !226, file: !8, line: 100, baseType: !127, size: 32, offset: 1152)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !226, file: !8, line: 100, baseType: !127, size: 32, offset: 1184)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !226, file: !8, line: 100, baseType: !127, size: 32, offset: 1216)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !226, file: !8, line: 100, baseType: !127, size: 32, offset: 1248)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !226, file: !8, line: 100, baseType: !127, size: 32, offset: 1280)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !226, file: !8, line: 100, baseType: !127, size: 32, offset: 1312)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !226, file: !8, line: 101, baseType: !127, size: 32, offset: 1344)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !226, file: !8, line: 101, baseType: !127, size: 32, offset: 1376)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !226, file: !8, line: 101, baseType: !127, size: 32, offset: 1408)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !226, file: !8, line: 101, baseType: !127, size: 32, offset: 1440)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !226, file: !8, line: 101, baseType: !127, size: 32, offset: 1472)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !226, file: !8, line: 101, baseType: !127, size: 32, offset: 1504)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !226, file: !8, line: 101, baseType: !127, size: 32, offset: 1536)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !226, file: !8, line: 101, baseType: !127, size: 32, offset: 1568)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !226, file: !8, line: 102, baseType: !127, size: 32, offset: 1600)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !226, file: !8, line: 102, baseType: !127, size: 32, offset: 1632)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !226, file: !8, line: 102, baseType: !127, size: 32, offset: 1664)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !226, file: !8, line: 103, baseType: !134, size: 64, offset: 1728)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !226, file: !8, line: 103, baseType: !134, size: 64, offset: 1792)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !226, file: !8, line: 103, baseType: !134, size: 64, offset: 1856)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !226, file: !8, line: 103, baseType: !134, size: 64, offset: 1920)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !226, file: !8, line: 104, baseType: !269, size: 64, offset: 1984)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !226, file: !8, line: 104, baseType: !269, size: 64, offset: 2048)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !226, file: !8, line: 104, baseType: !269, size: 64, offset: 2112)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !226, file: !8, line: 104, baseType: !269, size: 64, offset: 2176)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !226, file: !8, line: 104, baseType: !269, size: 64, offset: 2240)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !226, file: !8, line: 104, baseType: !269, size: 64, offset: 2304)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !226, file: !8, line: 104, baseType: !269, size: 64, offset: 2368)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !226, file: !8, line: 104, baseType: !269, size: 64, offset: 2432)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !226, file: !8, line: 104, baseType: !269, size: 64, offset: 2496)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !226, file: !8, line: 105, baseType: !269, size: 64, offset: 2560)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !226, file: !8, line: 105, baseType: !269, size: 64, offset: 2624)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !226, file: !8, line: 105, baseType: !269, size: 64, offset: 2688)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !226, file: !8, line: 105, baseType: !269, size: 64, offset: 2752)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !226, file: !8, line: 105, baseType: !269, size: 64, offset: 2816)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !226, file: !8, line: 105, baseType: !269, size: 64, offset: 2880)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !226, file: !8, line: 105, baseType: !269, size: 64, offset: 2944)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !226, file: !8, line: 106, baseType: !217, size: 192, offset: 3008)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !226, file: !8, line: 106, baseType: !10, size: 64, offset: 3200)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !226, file: !8, line: 106, baseType: !10, size: 64, offset: 3264)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !226, file: !8, line: 106, baseType: !10, size: 64, offset: 3328)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !226, file: !8, line: 106, baseType: !10, size: 64, offset: 3392)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !226, file: !8, line: 106, baseType: !10, size: 64, offset: 3456)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !226, file: !8, line: 107, baseType: !189, size: 64, offset: 3520)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !226, file: !8, line: 107, baseType: !189, size: 64, offset: 3584)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !226, file: !8, line: 107, baseType: !189, size: 64, offset: 3648)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !226, file: !8, line: 107, baseType: !189, size: 64, offset: 3712)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !226, file: !8, line: 107, baseType: !189, size: 64, offset: 3776)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !226, file: !8, line: 107, baseType: !189, size: 64, offset: 3840)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !226, file: !8, line: 108, baseType: !189, size: 64, offset: 3904)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !226, file: !8, line: 108, baseType: !189, size: 64, offset: 3968)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !226, file: !8, line: 108, baseType: !189, size: 64, offset: 4032)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !226, file: !8, line: 108, baseType: !189, size: 64, offset: 4096)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !226, file: !8, line: 108, baseType: !189, size: 64, offset: 4160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !226, file: !8, line: 108, baseType: !189, size: 64, offset: 4224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !226, file: !8, line: 109, baseType: !189, size: 64, offset: 4288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !226, file: !8, line: 109, baseType: !189, size: 64, offset: 4352)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !226, file: !8, line: 109, baseType: !189, size: 64, offset: 4416)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !226, file: !8, line: 109, baseType: !189, size: 64, offset: 4480)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !226, file: !8, line: 109, baseType: !189, size: 64, offset: 4544)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !226, file: !8, line: 110, baseType: !189, size: 64, offset: 4608)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !226, file: !8, line: 110, baseType: !189, size: 64, offset: 4672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !226, file: !8, line: 110, baseType: !189, size: 64, offset: 4736)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !226, file: !8, line: 110, baseType: !189, size: 64, offset: 4800)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !226, file: !8, line: 110, baseType: !189, size: 64, offset: 4864)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !226, file: !8, line: 111, baseType: !189, size: 64, offset: 4928)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !226, file: !8, line: 111, baseType: !189, size: 64, offset: 4992)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !226, file: !8, line: 111, baseType: !189, size: 64, offset: 5056)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !226, file: !8, line: 111, baseType: !189, size: 64, offset: 5120)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !226, file: !8, line: 111, baseType: !189, size: 64, offset: 5184)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !226, file: !8, line: 111, baseType: !189, size: 64, offset: 5248)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !226, file: !8, line: 112, baseType: !189, size: 64, offset: 5312)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !226, file: !8, line: 112, baseType: !189, size: 64, offset: 5376)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !226, file: !8, line: 112, baseType: !189, size: 64, offset: 5440)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !226, file: !8, line: 112, baseType: !189, size: 64, offset: 5504)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !226, file: !8, line: 113, baseType: !189, size: 64, offset: 5568)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !226, file: !8, line: 113, baseType: !189, size: 64, offset: 5632)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !226, file: !8, line: 114, baseType: !269, size: 64, offset: 5696)
!326 = !DISubprogram(name: "newmolecule", scope: !3, file: !3, line: 103, type: !327, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!327 = !DISubroutineType(types: !328)
!328 = !{!118}
!329 = !DISubprogram(name: "ggets", scope: !3, file: !3, line: 101, type: !105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!330 = !DISubprogram(name: "addresidue", scope: !3, file: !3, line: 105, type: !331, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!331 = !DISubroutineType(types: !332)
!332 = !{!38, !118, !13, !150}
!333 = !DISubprogram(name: "addstrand", scope: !3, file: !3, line: 104, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!334 = !DISubroutineType(types: !335)
!335 = !{!38, !118, !13}
!336 = !DISubprogram(name: "NAB_initatom", scope: !3, file: !3, line: 89, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !339, !38}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!340 = !DISubprogram(name: "NAB_initres", scope: !3, file: !3, line: 88, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !150, !38}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "CID_T", file: !3, line: 62, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cid_t", file: !3, line: 58, size: 128, elements: !347)
!347 = !{!348, !349, !350}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !346, file: !3, line: 59, baseType: !38, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "c_last", scope: !346, file: !3, line: 60, baseType: !38, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "c_cids", scope: !346, file: !3, line: 61, baseType: !13, size: 64, offset: 64)
!351 = !{!0, !352, !360, !362, !364}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "init", scope: !354, file: !3, line: 774, type: !38, isLocal: true, isDefinition: true)
!354 = distinct !DISubprogram(name: "init_atab", scope: !3, file: !3, line: 772, type: !355, scopeLine: 773, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !15, retainedNodes: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{null}
!357 = !{!358, !359}
!358 = !DILocalVariable(name: "a", scope: !354, file: !3, line: 775, type: !38)
!359 = !DILocalVariable(name: "ap", scope: !354, file: !3, line: 776, type: !191)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "n_atab", scope: !15, file: !3, line: 70, type: !38, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "res", scope: !15, file: !3, line: 75, type: !146, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "atab", scope: !15, file: !3, line: 69, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 1408000, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 1000)
!369 = !{!370, !371, !375, !379, !380, !381, !382, !383, !384}
!370 = !DILocalVariable(name: "fname", arg: 1, scope: !2, file: !3, line: 159, type: !13)
!371 = !DILocalVariable(name: "fp", scope: !2, file: !3, line: 161, type: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !374, line: 7, baseType: !49)
!374 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!375 = !DILocalVariable(name: "line", scope: !2, file: !3, line: 162, type: !376)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 256)
!379 = !DILocalVariable(name: "r", scope: !2, file: !3, line: 163, type: !38)
!380 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 163, type: !38)
!381 = !DILocalVariable(name: "cnt", scope: !2, file: !3, line: 163, type: !38)
!382 = !DILocalVariable(name: "ptr", scope: !2, file: !3, line: 165, type: !40)
!383 = !DILocalVariable(name: "err", scope: !2, file: !3, line: 166, type: !38)
!384 = !DILabel(scope: !2, name: "CLEAN_UP", file: !3, line: 210)
!385 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!386 = !{i32 7, !"Dwarf Version", i32 4}
!387 = !{i32 2, !"Debug Info Version", i32 3}
!388 = !{i32 1, !"wchar_size", i32 4}
!389 = !{!"clang version 10.0.0-4ubuntu1 "}
!390 = distinct !DISubprogram(name: "getpdb", scope: !3, file: !3, line: 121, type: !391, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !15, retainedNodes: !395)
!391 = !DISubroutineType(types: !392)
!392 = !{!393, !13, !13}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !8, line: 126, baseType: !119)
!395 = !{!396, !397, !398, !399, !400}
!396 = !DILocalVariable(name: "fname", arg: 1, scope: !390, file: !3, line: 121, type: !13)
!397 = !DILocalVariable(name: "options", arg: 2, scope: !390, file: !3, line: 121, type: !13)
!398 = !DILocalVariable(name: "fp", scope: !390, file: !3, line: 123, type: !372)
!399 = !DILocalVariable(name: "mol", scope: !390, file: !3, line: 124, type: !393)
