; ModuleID = '/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/reslib.c'
source_filename = "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/reslib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.reslib_t = type { %struct.reslib_t*, i8*, i32, i32, %struct.residue_t* }
%struct.residue_t = type { %struct.residue_t*, i32, i32, i32, i8*, i8*, i32, i32, i32, %struct.strand_t*, %struct.extbond_t*, i32, [2 x i32]*, i32, %struct.chiral_t*, i32, i32*, %struct.atom_t* }
%struct.strand_t = type { i8*, i32, i32, %struct.molecule_t*, %struct.strand_t*, i32, i32, %struct.residue_t** }
%struct.molecule_t = type { [4 x [3 x double]], i32, %struct.strand_t*, i32, i32, i32, %struct.parm* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "e_msg", scope: !2, file: !15, line: 46, type: !353, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !320, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/rouzbeh/Graduate/Research/SPEC/installation/benchspec/CPU/544.nab_r/src/reslib.c", directory: "/home/rouzbeh/Graduate/Research/LLVM/ALC/test/Compiled_files")
!4 = !{}
!5 = !{!6, !7, !14, !170, !202, !229, !184, !191, !12, !54, !169, !230, !233, !235, !239, !299, !309, !312, !105, !316}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DISubprogram(name: "rt_errormsg_s", scope: !8, file: !8, line: 2, type: !9, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!8 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/traceback.h", directory: "/home/rouzbeh/Graduate/Research")
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11, !12, !12}
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DISubprogram(name: "copyresidue", scope: !15, file: !15, line: 54, type: !16, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!15 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/reslib.c", directory: "/home/rouzbeh/Graduate/Research")
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !18}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "residue_t", file: !20, line: 63, size: 1024, elements: !21)
!20 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/nabtypes.h", directory: "/home/rouzbeh/Graduate/Research")
!21 = !{!22, !23, !25, !26, !27, !30, !31, !32, !33, !34, !172, !182, !183, !189, !190, !199, !200, !201}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "r_next", scope: !19, file: !20, line: 64, baseType: !18, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "r_num", scope: !19, file: !20, line: 65, baseType: !24, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT_T", file: !20, line: 6, baseType: !11)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "r_tresnum", scope: !19, file: !20, line: 66, baseType: !24, size: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "r_resnum", scope: !19, file: !20, line: 67, baseType: !24, size: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "r_resname", scope: !19, file: !20, line: 68, baseType: !28, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_T", file: !20, line: 17, baseType: !13)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "r_resid", scope: !19, file: !20, line: 69, baseType: !28, size: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "r_attr", scope: !19, file: !20, line: 70, baseType: !24, size: 32, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "r_kind", scope: !19, file: !20, line: 71, baseType: !24, size: 32, offset: 352)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "r_atomkind", scope: !19, file: !20, line: 72, baseType: !24, size: 32, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "r_strand", scope: !19, file: !20, line: 73, baseType: !35, size: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strand_t", file: !20, line: 84, size: 384, elements: !37)
!37 = !{!38, !39, !40, !41, !165, !166, !167, !168}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandname", scope: !36, file: !20, line: 85, baseType: !28, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "s_strandnum", scope: !36, file: !20, line: 86, baseType: !24, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "s_attr", scope: !36, file: !20, line: 87, baseType: !24, size: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "s_molecule", scope: !36, file: !20, line: 88, baseType: !42, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "molecule_t", file: !20, line: 118, size: 1088, elements: !44)
!44 = !{!45, !52, !53, !56, !57, !58, !59}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "m_frame", scope: !43, file: !20, line: 119, baseType: !46, size: 768)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME_T", file: !20, line: 13, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 768, elements: !49)
!48 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!49 = !{!50, !51}
!50 = !DISubrange(count: 4)
!51 = !DISubrange(count: 3)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "m_nstrands", scope: !43, file: !20, line: 120, baseType: !24, size: 32, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "m_strands", scope: !43, file: !20, line: 121, baseType: !54, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRAND_T", file: !20, line: 93, baseType: !36)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "m_nresidues", scope: !43, file: !20, line: 122, baseType: !24, size: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "m_natoms", scope: !43, file: !20, line: 123, baseType: !24, size: 32, offset: 928)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "m_nvalid", scope: !43, file: !20, line: 124, baseType: !24, size: 32, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "m_prm", scope: !43, file: !20, line: 125, baseType: !60, size: 64, offset: 1024)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARMSTRUCT_T", file: !20, line: 115, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parm", file: !20, line: 95, size: 5760, elements: !63)
!63 = !{!64, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !124, !125, !126, !127, !128, !129, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ititl", scope: !62, file: !20, line: 96, baseType: !65, size: 648)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 648, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 81)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "IfBox", scope: !62, file: !20, line: 97, baseType: !24, size: 32, offset: 672)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Nmxrs", scope: !62, file: !20, line: 97, baseType: !24, size: 32, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "IfCap", scope: !62, file: !20, line: 97, baseType: !24, size: 32, offset: 736)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Natom", scope: !62, file: !20, line: 98, baseType: !24, size: 32, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Ntypes", scope: !62, file: !20, line: 98, baseType: !24, size: 32, offset: 800)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Nbonh", scope: !62, file: !20, line: 98, baseType: !24, size: 32, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Mbona", scope: !62, file: !20, line: 98, baseType: !24, size: 32, offset: 864)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheth", scope: !62, file: !20, line: 98, baseType: !24, size: 32, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Mtheta", scope: !62, file: !20, line: 98, baseType: !24, size: 32, offset: 928)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Nphih", scope: !62, file: !20, line: 99, baseType: !24, size: 32, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Mphia", scope: !62, file: !20, line: 99, baseType: !24, size: 32, offset: 992)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Nhparm", scope: !62, file: !20, line: 99, baseType: !24, size: 32, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Nparm", scope: !62, file: !20, line: 99, baseType: !24, size: 32, offset: 1056)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Nnb", scope: !62, file: !20, line: 99, baseType: !24, size: 32, offset: 1088)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Nres", scope: !62, file: !20, line: 99, baseType: !24, size: 32, offset: 1120)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Nbona", scope: !62, file: !20, line: 100, baseType: !24, size: 32, offset: 1152)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Ntheta", scope: !62, file: !20, line: 100, baseType: !24, size: 32, offset: 1184)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Nphia", scope: !62, file: !20, line: 100, baseType: !24, size: 32, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Numbnd", scope: !62, file: !20, line: 100, baseType: !24, size: 32, offset: 1248)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Numang", scope: !62, file: !20, line: 100, baseType: !24, size: 32, offset: 1280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Nptra", scope: !62, file: !20, line: 100, baseType: !24, size: 32, offset: 1312)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Natyp", scope: !62, file: !20, line: 101, baseType: !24, size: 32, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Nphb", scope: !62, file: !20, line: 101, baseType: !24, size: 32, offset: 1376)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Nat3", scope: !62, file: !20, line: 101, baseType: !24, size: 32, offset: 1408)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Ntype2d", scope: !62, file: !20, line: 101, baseType: !24, size: 32, offset: 1440)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Nttyp", scope: !62, file: !20, line: 101, baseType: !24, size: 32, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Nspm", scope: !62, file: !20, line: 101, baseType: !24, size: 32, offset: 1504)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Iptres", scope: !62, file: !20, line: 101, baseType: !24, size: 32, offset: 1536)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Nspsol", scope: !62, file: !20, line: 101, baseType: !24, size: 32, offset: 1568)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Ipatm", scope: !62, file: !20, line: 102, baseType: !24, size: 32, offset: 1600)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Natcap", scope: !62, file: !20, line: 102, baseType: !24, size: 32, offset: 1632)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Numextra", scope: !62, file: !20, line: 102, baseType: !24, size: 32, offset: 1664)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "AtomNames", scope: !62, file: !20, line: 103, baseType: !28, size: 64, offset: 1728)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ResNames", scope: !62, file: !20, line: 103, baseType: !28, size: 64, offset: 1792)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "AtomSym", scope: !62, file: !20, line: 103, baseType: !28, size: 64, offset: 1856)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "AtomTree", scope: !62, file: !20, line: 103, baseType: !28, size: 64, offset: 1920)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Charges", scope: !62, file: !20, line: 104, baseType: !105, size: 64, offset: 1984)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Masses", scope: !62, file: !20, line: 104, baseType: !105, size: 64, offset: 2048)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Rk", scope: !62, file: !20, line: 104, baseType: !105, size: 64, offset: 2112)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Req", scope: !62, file: !20, line: 104, baseType: !105, size: 64, offset: 2176)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Tk", scope: !62, file: !20, line: 104, baseType: !105, size: 64, offset: 2240)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Teq", scope: !62, file: !20, line: 104, baseType: !105, size: 64, offset: 2304)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Pk", scope: !62, file: !20, line: 104, baseType: !105, size: 64, offset: 2368)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Pn", scope: !62, file: !20, line: 104, baseType: !105, size: 64, offset: 2432)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !62, file: !20, line: 104, baseType: !105, size: 64, offset: 2496)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Solty", scope: !62, file: !20, line: 105, baseType: !105, size: 64, offset: 2560)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Cn1", scope: !62, file: !20, line: 105, baseType: !105, size: 64, offset: 2624)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Cn2", scope: !62, file: !20, line: 105, baseType: !105, size: 64, offset: 2688)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "HB12", scope: !62, file: !20, line: 105, baseType: !105, size: 64, offset: 2752)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "HB10", scope: !62, file: !20, line: 105, baseType: !105, size: 64, offset: 2816)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Rborn", scope: !62, file: !20, line: 105, baseType: !105, size: 64, offset: 2880)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !62, file: !20, line: 105, baseType: !105, size: 64, offset: 2944)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Box", scope: !62, file: !20, line: 106, baseType: !122, size: 192, offset: 3008)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 192, elements: !123)
!123 = !{!51}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Cutcap", scope: !62, file: !20, line: 106, baseType: !48, size: 64, offset: 3200)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Xcap", scope: !62, file: !20, line: 106, baseType: !48, size: 64, offset: 3264)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Ycap", scope: !62, file: !20, line: 106, baseType: !48, size: 64, offset: 3328)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Zcap", scope: !62, file: !20, line: 106, baseType: !48, size: 64, offset: 3392)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Fsmax", scope: !62, file: !20, line: 106, baseType: !48, size: 64, offset: 3456)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Iac", scope: !62, file: !20, line: 107, baseType: !130, size: 64, offset: 3520)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Iblo", scope: !62, file: !20, line: 107, baseType: !130, size: 64, offset: 3584)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Cno", scope: !62, file: !20, line: 107, baseType: !130, size: 64, offset: 3648)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Ipres", scope: !62, file: !20, line: 107, baseType: !130, size: 64, offset: 3712)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ExclAt", scope: !62, file: !20, line: 107, baseType: !130, size: 64, offset: 3776)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "TreeJoin", scope: !62, file: !20, line: 107, baseType: !130, size: 64, offset: 3840)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "AtomRes", scope: !62, file: !20, line: 108, baseType: !130, size: 64, offset: 3904)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt1", scope: !62, file: !20, line: 108, baseType: !130, size: 64, offset: 3968)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "BondHAt2", scope: !62, file: !20, line: 108, baseType: !130, size: 64, offset: 4032)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "BondHNum", scope: !62, file: !20, line: 108, baseType: !130, size: 64, offset: 4096)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt1", scope: !62, file: !20, line: 108, baseType: !130, size: 64, offset: 4160)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "BondAt2", scope: !62, file: !20, line: 108, baseType: !130, size: 64, offset: 4224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "BondNum", scope: !62, file: !20, line: 109, baseType: !130, size: 64, offset: 4288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt1", scope: !62, file: !20, line: 109, baseType: !130, size: 64, offset: 4352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt2", scope: !62, file: !20, line: 109, baseType: !130, size: 64, offset: 4416)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHAt3", scope: !62, file: !20, line: 109, baseType: !130, size: 64, offset: 4480)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "AngleHNum", scope: !62, file: !20, line: 109, baseType: !130, size: 64, offset: 4544)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt1", scope: !62, file: !20, line: 110, baseType: !130, size: 64, offset: 4608)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt2", scope: !62, file: !20, line: 110, baseType: !130, size: 64, offset: 4672)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "AngleAt3", scope: !62, file: !20, line: 110, baseType: !130, size: 64, offset: 4736)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "AngleNum", scope: !62, file: !20, line: 110, baseType: !130, size: 64, offset: 4800)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt1", scope: !62, file: !20, line: 110, baseType: !130, size: 64, offset: 4864)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt2", scope: !62, file: !20, line: 111, baseType: !130, size: 64, offset: 4928)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt3", scope: !62, file: !20, line: 111, baseType: !130, size: 64, offset: 4992)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "DihHAt4", scope: !62, file: !20, line: 111, baseType: !130, size: 64, offset: 5056)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "DihHNum", scope: !62, file: !20, line: 111, baseType: !130, size: 64, offset: 5120)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt1", scope: !62, file: !20, line: 111, baseType: !130, size: 64, offset: 5184)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt2", scope: !62, file: !20, line: 111, baseType: !130, size: 64, offset: 5248)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt3", scope: !62, file: !20, line: 112, baseType: !130, size: 64, offset: 5312)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "DihAt4", scope: !62, file: !20, line: 112, baseType: !130, size: 64, offset: 5376)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "DihNum", scope: !62, file: !20, line: 112, baseType: !130, size: 64, offset: 5440)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Boundary", scope: !62, file: !20, line: 112, baseType: !130, size: 64, offset: 5504)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairs", scope: !62, file: !20, line: 113, baseType: !130, size: 64, offset: 5568)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "N14pairlist", scope: !62, file: !20, line: 113, baseType: !130, size: 64, offset: 5632)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Gvdw", scope: !62, file: !20, line: 114, baseType: !105, size: 64, offset: 5696)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !36, file: !20, line: 89, baseType: !35, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "s_nresidues", scope: !36, file: !20, line: 90, baseType: !24, size: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "s_res_size", scope: !36, file: !20, line: 91, baseType: !24, size: 32, offset: 288)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "s_residues", scope: !36, file: !20, line: 92, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESIDUE_T", file: !20, line: 82, baseType: !19)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "r_extbonds", scope: !19, file: !20, line: 74, baseType: !173, size: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTBOND_T", file: !20, line: 52, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extbond_t", file: !20, line: 47, size: 192, elements: !176)
!176 = !{!177, !179, !180, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "eb_next", scope: !175, file: !20, line: 48, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "eb_anum", scope: !175, file: !20, line: 49, baseType: !24, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "eb_rnum", scope: !175, file: !20, line: 50, baseType: !24, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "eb_ranum", scope: !175, file: !20, line: 51, baseType: !24, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "r_nintbonds", scope: !19, file: !20, line: 75, baseType: !24, size: 32, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "r_intbonds", scope: !19, file: !20, line: 76, baseType: !184, size: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTBOND_T", file: !20, line: 54, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 2)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "r_nchiral", scope: !19, file: !20, line: 77, baseType: !24, size: 32, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "r_chiral", scope: !19, file: !20, line: 78, baseType: !191, size: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHIRAL_T", file: !20, line: 61, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chiral_t", file: !20, line: 58, size: 192, elements: !194)
!194 = !{!195, !198}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "c_anum", scope: !193, file: !20, line: 59, baseType: !196, size: 128)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !197)
!197 = !{!50}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "c_dist", scope: !193, file: !20, line: 60, baseType: !48, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "r_natoms", scope: !19, file: !20, line: 79, baseType: !24, size: 32, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "r_aindex", scope: !19, file: !20, line: 80, baseType: !130, size: 64, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "r_atoms", scope: !19, file: !20, line: 81, baseType: !202, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATOM_T", file: !20, line: 45, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atom_t", file: !20, line: 25, size: 1408, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !228}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomname", scope: !204, file: !20, line: 26, baseType: !28, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomtype", scope: !204, file: !20, line: 27, baseType: !28, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "a_attr", scope: !204, file: !20, line: 28, baseType: !24, size: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "a_nconnect", scope: !204, file: !20, line: 29, baseType: !24, size: 32, offset: 160)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "a_connect", scope: !204, file: !20, line: 30, baseType: !211, size: 256, offset: 192)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "a_residue", scope: !204, file: !20, line: 31, baseType: !18, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "a_charge", scope: !204, file: !20, line: 32, baseType: !48, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "a_radius", scope: !204, file: !20, line: 33, baseType: !48, size: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "a_bfact", scope: !204, file: !20, line: 34, baseType: !48, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "a_occ", scope: !204, file: !20, line: 35, baseType: !48, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "a_element", scope: !204, file: !20, line: 36, baseType: !28, size: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "a_int1", scope: !204, file: !20, line: 37, baseType: !24, size: 32, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "a_float1", scope: !204, file: !20, line: 38, baseType: !48, size: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "a_float2", scope: !204, file: !20, line: 39, baseType: !48, size: 64, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "a_tatomnum", scope: !204, file: !20, line: 40, baseType: !24, size: 32, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "a_atomnum", scope: !204, file: !20, line: 41, baseType: !24, size: 32, offset: 1056)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "a_fullname", scope: !204, file: !20, line: 42, baseType: !28, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "a_pos", scope: !204, file: !20, line: 43, baseType: !227, size: 192, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT_T", file: !20, line: 12, baseType: !122)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "a_w", scope: !204, file: !20, line: 44, baseType: !48, size: 64, offset: 1344)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!230 = !DISubprogram(name: "upd_molnumbers", scope: !15, file: !15, line: 16, type: !231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !42}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOLECULE_T", file: !20, line: 126, baseType: !43)
!235 = !DISubprogram(name: "copyparm", scope: !15, file: !15, line: 53, type: !236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!239 = !DISubprogram(name: "fclose", scope: !240, file: !240, line: 213, type: !241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!240 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!241 = !DISubroutineType(types: !242)
!242 = !{!11, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !245, line: 49, size: 1728, elements: !246)
!245 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !262, !263, !264, !265, !269, !271, !273, !277, !280, !282, !285, !288, !289, !290, !294, !295}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !244, file: !245, line: 51, baseType: !11, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !244, file: !245, line: 54, baseType: !12, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !244, file: !245, line: 55, baseType: !12, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !244, file: !245, line: 56, baseType: !12, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !244, file: !245, line: 57, baseType: !12, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !244, file: !245, line: 58, baseType: !12, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !244, file: !245, line: 59, baseType: !12, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !244, file: !245, line: 60, baseType: !12, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !244, file: !245, line: 61, baseType: !12, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !244, file: !245, line: 64, baseType: !12, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !244, file: !245, line: 65, baseType: !12, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !244, file: !245, line: 66, baseType: !12, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !244, file: !245, line: 68, baseType: !260, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !245, line: 36, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !244, file: !245, line: 70, baseType: !243, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !244, file: !245, line: 72, baseType: !11, size: 32, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !244, file: !245, line: 73, baseType: !11, size: 32, offset: 928)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !244, file: !245, line: 74, baseType: !266, size: 64, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !267, line: 152, baseType: !268)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!268 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !244, file: !245, line: 77, baseType: !270, size: 16, offset: 1024)
!270 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !244, file: !245, line: 78, baseType: !272, size: 8, offset: 1040)
!272 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !244, file: !245, line: 79, baseType: !274, size: 8, offset: 1048)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 1)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !244, file: !245, line: 81, baseType: !278, size: 64, offset: 1088)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !245, line: 43, baseType: null)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !244, file: !245, line: 89, baseType: !281, size: 64, offset: 1152)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !267, line: 153, baseType: !268)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !244, file: !245, line: 91, baseType: !283, size: 64, offset: 1216)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !245, line: 37, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !244, file: !245, line: 92, baseType: !286, size: 64, offset: 1280)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !245, line: 38, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !244, file: !245, line: 93, baseType: !243, size: 64, offset: 1344)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !244, file: !245, line: 94, baseType: !6, size: 64, offset: 1408)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !244, file: !245, line: 95, baseType: !291, size: 64, offset: 1472)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !292, line: 46, baseType: !293)
!292 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!293 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !244, file: !245, line: 96, baseType: !11, size: 32, offset: 1536)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !244, file: !245, line: 98, baseType: !296, size: 160, offset: 1568)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 20)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESLIB_T", file: !15, line: 26, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reslib_t", file: !15, line: 20, size: 256, elements: !302)
!302 = !{!303, !305, !306, !307, !308}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rl_next", scope: !301, file: !15, line: 21, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rl_name", scope: !301, file: !15, line: 22, baseType: !12, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rl_r_kind", scope: !301, file: !15, line: 23, baseType: !11, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rl_r_atomkind", scope: !301, file: !15, line: 24, baseType: !11, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rl_rlist", scope: !301, file: !15, line: 25, baseType: !170, size: 64, offset: 192)
!309 = !DISubprogram(name: "fgets", scope: !240, file: !240, line: 564, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!310 = !DISubroutineType(types: !311)
!311 = !{!12, !12, !11, !243}
!312 = !DISubprogram(name: "NAB_initatom", scope: !15, file: !15, line: 48, type: !313, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315, !11}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!316 = !DISubprogram(name: "chirvol", scope: !317, file: !317, line: 1, type: !318, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!317 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/chirvol.h", directory: "/home/rouzbeh/Graduate/Research")
!318 = !DISubroutineType(types: !319)
!319 = !{null, !11, !11, !11, !11, !11, !105, !105, !105}
!320 = !{!0, !321, !323, !331, !336, !338, !341, !343, !346, !348}
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "reslibs", scope: !2, file: !15, line: 44, type: !299, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "init", scope: !325, file: !15, line: 474, type: !11, isLocal: true, isDefinition: true)
!325 = distinct !DISubprogram(name: "initatoms", scope: !15, file: !15, line: 472, type: !326, scopeLine: 473, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !328)
!326 = !DISubroutineType(types: !327)
!327 = !{null}
!328 = !{!329, !330}
!329 = !DILocalVariable(name: "i", scope: !325, file: !15, line: 475, type: !11)
!330 = !DILocalVariable(name: "ap", scope: !325, file: !15, line: 476, type: !202)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "atoms", scope: !2, file: !15, line: 34, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 1408000, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 1000)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "n_atoms", scope: !2, file: !15, line: 33, type: !11, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "lr_name", scope: !2, file: !15, line: 32, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !212)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "n_bonds", scope: !2, file: !15, line: 37, type: !11, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "bonds", scope: !2, file: !15, line: 38, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 64000, elements: !334)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "n_chi", scope: !2, file: !15, line: 41, type: !11, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "chi", scope: !2, file: !15, line: 42, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 96000, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 500)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2048, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 256)
!356 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!357 = !{i32 7, !"Dwarf Version", i32 4}
!358 = !{i32 2, !"Debug Info Version", i32 3}
!359 = !{i32 1, !"wchar_size", i32 4}
!360 = !{!"clang version 10.0.0-4ubuntu1 "}
!361 = distinct !DISubprogram(name: "getreslibkind", scope: !15, file: !15, line: 78, type: !362, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !364)
!362 = !DISubroutineType(types: !363)
!363 = !{!12, !12}
!364 = !{!365, !366, !367}
!365 = !DILocalVariable(name: "reslib", arg: 1, scope: !361, file: !15, line: 78, type: !12)
!366 = !DILocalVariable(name: "nhp", scope: !361, file: !15, line: 80, type: !12)
!367 = !DILocalVariable(name: "rlp", scope: !361, file: !15, line: 81, type: !299)
!368 = !DILocation(line: 0, scope: !361)
!369 = !DILocalVariable(name: "reslib", arg: 1, scope: !370, file: !15, line: 422, type: !12)
!370 = distinct !DISubprogram(name: "known_reslib", scope: !15, file: !15, line: 422, type: !371, scopeLine: 423, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !373)
!371 = !DISubroutineType(types: !372)
!372 = !{!299, !12}
!373 = !{!369, !374}
!374 = !DILocalVariable(name: "rlp", scope: !370, file: !15, line: 424, type: !299)
!375 = !DILocation(line: 0, scope: !370, inlinedAt: !376)
!376 = distinct !DILocation(line: 83, column: 14, scope: !377)
!377 = distinct !DILexicalBlock(scope: !361, file: !15, line: 83, column: 6)
!378 = !DILocation(line: 0, scope: !379, inlinedAt: !376)
!379 = distinct !DILexicalBlock(scope: !370, file: !15, line: 426, column: 2)
!380 = !{!381, !381, i64 0}
!381 = !{!"any pointer", !382, i64 0}
!382 = !{!"omnipotent char", !383, i64 0}
!383 = !{!"Simple C/C++ TBAA"}
!384 = !DILocation(line: 426, column: 2, scope: !379, inlinedAt: !376)
!385 = !DILocation(line: 427, column: 20, scope: !386, inlinedAt: !376)
!386 = distinct !DILexicalBlock(scope: !387, file: !15, line: 427, column: 7)
!387 = distinct !DILexicalBlock(scope: !388, file: !15, line: 426, column: 47)
!388 = distinct !DILexicalBlock(scope: !379, file: !15, line: 426, column: 2)
!389 = !{!390, !381, i64 8}
!390 = !{!"reslib_t", !381, i64 0, !381, i64 8, !391, i64 16, !391, i64 20, !381, i64 24}
!391 = !{!"int", !382, i64 0}
!392 = !DILocation(line: 427, column: 7, scope: !386, inlinedAt: !376)
!393 = !DILocation(line: 427, column: 38, scope: !386, inlinedAt: !376)
!394 = !DILocation(line: 427, column: 7, scope: !387, inlinedAt: !376)
!395 = !DILocation(line: 426, column: 38, scope: !388, inlinedAt: !376)
!396 = distinct !{!396, !384, !397}
!397 = !DILocation(line: 430, column: 2, scope: !379, inlinedAt: !376)
!398 = !DILocation(line: 84, column: 15, scope: !399)
!399 = distinct !DILexicalBlock(scope: !400, file: !15, line: 84, column: 7)
!400 = distinct !DILexicalBlock(scope: !377, file: !15, line: 83, column: 48)
!401 = !DILocation(line: 84, column: 39, scope: !399)
!402 = !DILocation(line: 84, column: 7, scope: !400)
!403 = !DILocation(line: 85, column: 13, scope: !404)
!404 = distinct !DILexicalBlock(scope: !399, file: !15, line: 84, column: 48)
!405 = !DILocation(line: 85, column: 4, scope: !404)
!406 = !DILocation(line: 87, column: 4, scope: !404)
!407 = !DILocation(line: 0, scope: !377)
!408 = !DILocation(line: 90, column: 11, scope: !409)
!409 = distinct !DILexicalBlock(scope: !361, file: !15, line: 90, column: 6)
!410 = !{!390, !391, i64 16}
!411 = !DILocation(line: 90, column: 6, scope: !361)
!412 = !DILocation(line: 101, column: 1, scope: !361)
!413 = distinct !DISubprogram(name: "read_reslib", scope: !15, file: !15, line: 434, type: !371, scopeLine: 435, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !414)
!414 = !{!415, !416, !420, !421, !422, !423, !424}
!415 = !DILocalVariable(name: "reslib", arg: 1, scope: !413, file: !15, line: 434, type: !12)
!416 = !DILocalVariable(name: "pfp", scope: !413, file: !15, line: 436, type: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !419, line: 7, baseType: !244)
!419 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!420 = !DILocalVariable(name: "bfp", scope: !413, file: !15, line: 437, type: !417)
!421 = !DILocalVariable(name: "qfp", scope: !413, file: !15, line: 438, type: !417)
!422 = !DILocalVariable(name: "cfp", scope: !413, file: !15, line: 439, type: !417)
!423 = !DILocalVariable(name: "rlp", scope: !413, file: !15, line: 440, type: !299)
!424 = !DILocalVariable(name: "offname", scope: !413, file: !15, line: 441, type: !353)
!425 = !DILocalVariable(name: "anm1", scope: !426, file: !15, line: 854, type: !340)
!426 = distinct !DISubprogram(name: "chi2reslib", scope: !15, file: !15, line: 848, type: !427, scopeLine: 849, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !429)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !417, !299}
!429 = !{!430, !431, !432, !433, !434, !435, !436, !425, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!430 = !DILocalVariable(name: "cfp", arg: 1, scope: !426, file: !15, line: 848, type: !417)
!431 = !DILocalVariable(name: "rlp", arg: 2, scope: !426, file: !15, line: 848, type: !299)
!432 = !DILocalVariable(name: "line", scope: !426, file: !15, line: 850, type: !353)
!433 = !DILocalVariable(name: "r_name", scope: !426, file: !15, line: 851, type: !296)
!434 = !DILocalVariable(name: "llen", scope: !426, file: !15, line: 852, type: !11)
!435 = !DILocalVariable(name: "res", scope: !426, file: !15, line: 853, type: !170)
!436 = !DILocalVariable(name: "res1", scope: !426, file: !15, line: 853, type: !170)
!437 = !DILocalVariable(name: "anm2", scope: !426, file: !15, line: 854, type: !340)
!438 = !DILocalVariable(name: "anm3", scope: !426, file: !15, line: 854, type: !340)
!439 = !DILocalVariable(name: "anm4", scope: !426, file: !15, line: 854, type: !340)
!440 = !DILocalVariable(name: "a1", scope: !426, file: !15, line: 855, type: !11)
!441 = !DILocalVariable(name: "a2", scope: !426, file: !15, line: 855, type: !11)
!442 = !DILocalVariable(name: "a3", scope: !426, file: !15, line: 855, type: !11)
!443 = !DILocalVariable(name: "a4", scope: !426, file: !15, line: 855, type: !11)
!444 = !DILocalVariable(name: "ap", scope: !426, file: !15, line: 856, type: !202)
!445 = !DILocalVariable(name: "cp", scope: !426, file: !15, line: 857, type: !191)
!446 = !DILocation(line: 854, column: 7, scope: !426, inlinedAt: !447)
!447 = distinct !DILocation(line: 465, column: 3, scope: !448)
!448 = distinct !DILexicalBlock(scope: !449, file: !15, line: 464, column: 11)
!449 = distinct !DILexicalBlock(scope: !413, file: !15, line: 464, column: 6)
!450 = !DILocation(line: 854, column: 18, scope: !426, inlinedAt: !447)
!451 = !DILocation(line: 854, column: 29, scope: !426, inlinedAt: !447)
!452 = !DILocation(line: 854, column: 40, scope: !426, inlinedAt: !447)
!453 = !DILocalVariable(name: "ltype", scope: !454, file: !15, line: 940, type: !460)
!454 = distinct !DISubprogram(name: "qr2reslib", scope: !15, file: !15, line: 937, type: !427, scopeLine: 938, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!455 = !{!456, !457, !458, !453, !459, !463, !464, !465, !466, !467, !468}
!456 = !DILocalVariable(name: "qfp", arg: 1, scope: !454, file: !15, line: 937, type: !417)
!457 = !DILocalVariable(name: "rlp", arg: 2, scope: !454, file: !15, line: 937, type: !299)
!458 = !DILocalVariable(name: "line", scope: !454, file: !15, line: 939, type: !353)
!459 = !DILocalVariable(name: "a_name", scope: !454, file: !15, line: 940, type: !460)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 80, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 10)
!463 = !DILocalVariable(name: "r_name", scope: !454, file: !15, line: 940, type: !460)
!464 = !DILocalVariable(name: "a_num", scope: !454, file: !15, line: 941, type: !11)
!465 = !DILocalVariable(name: "r_num", scope: !454, file: !15, line: 941, type: !11)
!466 = !DILocalVariable(name: "q", scope: !454, file: !15, line: 942, type: !48)
!467 = !DILocalVariable(name: "r", scope: !454, file: !15, line: 942, type: !48)
!468 = !DILocalVariable(name: "ap", scope: !454, file: !15, line: 943, type: !202)
!469 = !DILocation(line: 940, column: 7, scope: !454, inlinedAt: !470)
!470 = distinct !DILocation(line: 460, column: 3, scope: !471)
!471 = distinct !DILexicalBlock(scope: !472, file: !15, line: 459, column: 11)
!472 = distinct !DILexicalBlock(scope: !413, file: !15, line: 459, column: 6)
!473 = !DILocalVariable(name: "ltype", scope: !474, file: !15, line: 765, type: !460)
!474 = distinct !DISubprogram(name: "pdb2reslib", scope: !15, file: !15, line: 762, type: !427, scopeLine: 763, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !475)
!475 = !{!476, !477, !478, !473, !479, !480, !481, !482, !483, !484, !485, !486}
!476 = !DILocalVariable(name: "rfp", arg: 1, scope: !474, file: !15, line: 762, type: !417)
!477 = !DILocalVariable(name: "rlp", arg: 2, scope: !474, file: !15, line: 762, type: !299)
!478 = !DILocalVariable(name: "line", scope: !474, file: !15, line: 764, type: !353)
!479 = !DILocalVariable(name: "a_name", scope: !474, file: !15, line: 765, type: !460)
!480 = !DILocalVariable(name: "r_name", scope: !474, file: !15, line: 765, type: !460)
!481 = !DILocalVariable(name: "a_num", scope: !474, file: !15, line: 766, type: !11)
!482 = !DILocalVariable(name: "r_num", scope: !474, file: !15, line: 766, type: !11)
!483 = !DILocalVariable(name: "x", scope: !474, file: !15, line: 767, type: !48)
!484 = !DILocalVariable(name: "y", scope: !474, file: !15, line: 767, type: !48)
!485 = !DILocalVariable(name: "z", scope: !474, file: !15, line: 767, type: !48)
!486 = !DILocalVariable(name: "ap", scope: !474, file: !15, line: 768, type: !202)
!487 = !DILocation(line: 765, column: 7, scope: !474, inlinedAt: !488)
!488 = distinct !DILocation(line: 453, column: 3, scope: !489)
!489 = distinct !DILexicalBlock(scope: !490, file: !15, line: 452, column: 7)
!490 = distinct !DILexicalBlock(scope: !413, file: !15, line: 450, column: 7)
!491 = !DILocation(line: 940, column: 20, scope: !454, inlinedAt: !470)
!492 = !DILocation(line: 765, column: 20, scope: !474, inlinedAt: !488)
!493 = !DILocation(line: 940, column: 34, scope: !454, inlinedAt: !470)
!494 = !DILocation(line: 765, column: 34, scope: !474, inlinedAt: !488)
!495 = !DILocalVariable(name: "typex", scope: !496, file: !15, line: 653, type: !533)
!496 = distinct !DISubprogram(name: "off2reslib", scope: !15, file: !15, line: 647, type: !497, scopeLine: 648, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !12, !299}
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !531, !495, !532, !536, !537, !538, !539, !540, !541, !543, !544, !545, !546, !549, !550, !551}
!500 = !DILocalVariable(name: "offname", arg: 1, scope: !496, file: !15, line: 647, type: !12)
!501 = !DILocalVariable(name: "rlp", arg: 2, scope: !496, file: !15, line: 647, type: !299)
!502 = !DILocalVariable(name: "ap", scope: !496, file: !15, line: 649, type: !202)
!503 = !DILocalVariable(name: "n_names", scope: !496, file: !15, line: 650, type: !11)
!504 = !DILocalVariable(name: "n_resnames", scope: !496, file: !15, line: 650, type: !11)
!505 = !DILocalVariable(name: "i", scope: !496, file: !15, line: 650, type: !11)
!506 = !DILocalVariable(name: "ires", scope: !496, file: !15, line: 650, type: !11)
!507 = !DILocalVariable(name: "db", scope: !496, file: !15, line: 651, type: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATABASE", file: !509, line: 84, baseType: !510)
!509 = !DIFile(filename: "SPEC/installation/benchspec/CPU/544.nab_r/src/database.h", directory: "/home/rouzbeh/Graduate/Research")
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATABASEt", file: !509, line: 82, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 65, size: 33024, elements: !513)
!513 = !{!514, !515, !516, !518, !519, !520, !522, !524, !525, !526, !528, !529, !530}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "iAccessMode", scope: !512, file: !509, line: 66, baseType: !11, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fDataBase", scope: !512, file: !509, line: 67, baseType: !417, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sFileName", scope: !512, file: !509, line: 68, baseType: !517, size: 2048, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !509, line: 48, baseType: !353)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "iOpenMode", scope: !512, file: !509, line: 69, baseType: !11, size: 32, offset: 2176)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "iPrefix", scope: !512, file: !509, line: 70, baseType: !11, size: 32, offset: 2208)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "saPrefixStack", scope: !512, file: !509, line: 71, baseType: !521, size: 20480, offset: 2240)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 20480, elements: !461)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bCompactFileAtClose", scope: !512, file: !509, line: 72, baseType: !523, size: 8, offset: 22720)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !509, line: 47, baseType: !13)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dEntries", scope: !512, file: !509, line: 73, baseType: !6, size: 64, offset: 22784)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "iCurrentLine", scope: !512, file: !509, line: 74, baseType: !11, size: 32, offset: 22848)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sLookAhead", scope: !512, file: !509, line: 75, baseType: !527, size: 8000, offset: 22880)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8000, elements: !334)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "iLastSequentialOperation", scope: !512, file: !509, line: 76, baseType: !11, size: 32, offset: 30880)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sLoopPrefix", scope: !512, file: !509, line: 79, baseType: !517, size: 2048, offset: 30912)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dlEntryLoop", scope: !512, file: !509, line: 80, baseType: !11, size: 32, offset: 32960)
!531 = !DILocalVariable(name: "bresult", scope: !496, file: !15, line: 652, type: !523)
!532 = !DILocalVariable(name: "resx", scope: !496, file: !15, line: 653, type: !533)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 3200, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 100)
!536 = !DILocalVariable(name: "flags", scope: !496, file: !15, line: 653, type: !533)
!537 = !DILocalVariable(name: "seq", scope: !496, file: !15, line: 654, type: !533)
!538 = !DILocalVariable(name: "elmnt", scope: !496, file: !15, line: 654, type: !533)
!539 = !DILocalVariable(name: "atom1x", scope: !496, file: !15, line: 655, type: !533)
!540 = !DILocalVariable(name: "atom2x", scope: !496, file: !15, line: 655, type: !533)
!541 = !DILocalVariable(name: "chg", scope: !496, file: !15, line: 656, type: !542)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 6400, elements: !534)
!543 = !DILocalVariable(name: "x", scope: !496, file: !15, line: 656, type: !542)
!544 = !DILocalVariable(name: "y", scope: !496, file: !15, line: 656, type: !542)
!545 = !DILocalVariable(name: "z", scope: !496, file: !15, line: 656, type: !542)
!546 = !DILocalVariable(name: "a_name", scope: !496, file: !15, line: 657, type: !547)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8000, elements: !548)
!548 = !{!535, !462}
!549 = !DILocalVariable(name: "type", scope: !496, file: !15, line: 657, type: !547)
!550 = !DILocalVariable(name: "res_name", scope: !496, file: !15, line: 657, type: !547)
!551 = !DILocalVariable(name: "prefix", scope: !496, file: !15, line: 658, type: !552)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2040, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 255)
!555 = !DILocation(line: 653, column: 6, scope: !496, inlinedAt: !556)
!556 = distinct !DILocation(line: 451, column: 3, scope: !557)
!557 = distinct !DILexicalBlock(scope: !490, file: !15, line: 450, column: 17)
!558 = !DILocation(line: 653, column: 20, scope: !496, inlinedAt: !556)
!559 = !DILocation(line: 653, column: 33, scope: !496, inlinedAt: !556)
!560 = !DILocation(line: 654, column: 3, scope: !496, inlinedAt: !556)
!561 = !DILocation(line: 654, column: 15, scope: !496, inlinedAt: !556)
!562 = !DILocation(line: 655, column: 6, scope: !496, inlinedAt: !556)
!563 = !DILocation(line: 655, column: 21, scope: !496, inlinedAt: !556)
!564 = !DILocation(line: 656, column: 9, scope: !496, inlinedAt: !556)
!565 = !DILocation(line: 656, column: 21, scope: !496, inlinedAt: !556)
!566 = !DILocation(line: 656, column: 31, scope: !496, inlinedAt: !556)
!567 = !DILocation(line: 656, column: 41, scope: !496, inlinedAt: !556)
!568 = !DILocation(line: 657, column: 7, scope: !496, inlinedAt: !556)
!569 = !DILocation(line: 657, column: 28, scope: !496, inlinedAt: !556)
!570 = !DILocation(line: 657, column: 47, scope: !496, inlinedAt: !556)
!571 = !DILocation(line: 658, column: 7, scope: !496, inlinedAt: !556)
!572 = !DILocalVariable(name: "line", scope: !573, file: !15, line: 499, type: !595)
!573 = distinct !DISubprogram(name: "read_reslib_header", scope: !15, file: !15, line: 492, type: !574, scopeLine: 494, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !577)
!574 = !DISubroutineType(types: !575)
!575 = !{!299, !12, !576, !576, !576, !576, !12}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !572, !589, !590, !592, !593, !594}
!578 = !DILocalVariable(name: "reslib", arg: 1, scope: !573, file: !15, line: 492, type: !12)
!579 = !DILocalVariable(name: "pfp", arg: 2, scope: !573, file: !15, line: 493, type: !576)
!580 = !DILocalVariable(name: "bfp", arg: 3, scope: !573, file: !15, line: 493, type: !576)
